{"title":"3 Möglichkeiten zum Ändern des Office-Produktschlüssels in Office 2019, Office 2016, Office 2013.","content":"<p> Dieses Tutorial enthält Anweisungen zum Ändern des Office-Produktschlüssels in Office 2013/2016/2019, ohne die Office-Suite deinstallieren und erneut installieren zu müssen. In einigen Fällen muss der Office-Product Key geändert werden, insbesondere wenn Sie aufgefordert werden, den Product Key zu ändern, oder wenn Sie eine Raubkopie von Office installiert haben. </p> <h6> Methode 1. Ändern Sie die Office-Lizenz im Menü Datei. </h6> <p> Die einfachste Methode zum Ändern des Office-Lizenzschlüssels besteht darin, eine beliebige Office-Anwendung zu öffnen und dann zu . zu gehen <strong> Datei </strong> Menü &gt; <strong> Konto </strong> und zu klicken <strong> Lizenz ändern </strong> im rechten Fenster. </p> <p><img src=\"images/chnage-office-license-key-283.png\" alt=\"\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Methode 2. Ändern / aktualisieren Sie den Office 2019,206, 2013-Schlüssel von Programmen und Funktionen. </h6> <p> Die nächste Methode zum Ändern des Office-Produktschlüssels besteht darin, &quot;Programme und Funktionen&quot; in der Systemsteuerung zu öffnen und dann, nachdem Sie die Office-Suite in der Liste der installierten Programme markiert haben, auf zu klicken <strong> Veränderung </strong> . </p> <p><img src=\"images/image_thumb-463.png\" alt=\"How to Change Office Product key in Office 2019, Office 2016, Office 2013\" loading=\"lazy\"></p> <p> </p> <p> Wählen Sie im nächsten Bildschirm <strong> Geben Sie einen Produktschlüssel ein </strong> und klicke <strong> Fortsetzen </strong> . </p> <p><img src=\"images/image_thumb-1-107.png\" alt=\"enter new office product key\" loading=\"lazy\"></p> <p> Geben Sie im nächsten Bildschirm den neuen Office-Produktschlüssel ein und klicken Sie auf <strong> Fortsetzen. </strong></p> <p><img src=\"images/image_thumb-2-539.png\" alt=\"change product key office\" loading=\"lazy\"></p> <h6> Methode 3. Ändern Sie den Office-Produktschlüssel von der Befehlszeile aus. </h6> <p> Wenn Sie den Office-Lizenzschlüssel mit den oben genannten Methoden nicht ändern/aktualisieren können, befolgen Sie die nachstehenden Anweisungen, um den Office-Schlüssel 2019, 2016 oder 2013 über die Eingabeaufforderung zu ändern: </p> <p> 1. Öffnen <strong> Eingabeaufforderung als Administrator </strong> . Das zu tun: </p> <p> </p> <ul> <li> Geben Sie im Suchfeld Folgendes ein: <strong> Eingabeaufforderung </strong> oder <strong> cmd </strong></li> <li> Klicken Sie mit der rechten Maustaste auf <strong> Eingabeaufforderung </strong> Ergebnis und auswählen <strong> Als Administrator ausführen. </strong></li> </ul> <p><img src=\"images/image_thumb-10-789.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. Geben Sie an der Eingabeaufforderung den entsprechenden Befehl unten ein (je nach installierter Windows*- und Office**-Version) und drücken Sie <strong> Eingeben, </strong> So ändern Sie den Office-Produktschlüssel: *** </p> <p> * Anmerkungen: <br> 1. Um die Windows-Version herauszufinden, klicken Sie mit der rechten Maustaste auf <strong> Mein Computer </strong> (oder bei &quot;Mein PC&quot;) und klicken Sie auf <strong> Eigenschaften </strong> . <br> 2. Um die installierte Office-Version herauszufinden, öffnen Sie eine beliebige Office-Anwendung (z. B. Word) und aus dem <strong> Datei </strong> Menüklick <strong> Konto </strong> (oder <strong> Hilfe </strong> ). Dann klicke auf <strong> Über Word </strong> Schaltfläche im rechten Bereich. <br> 3. Ersetzen Sie beim obigen Befehl XXXX-XXXXX-XXXXX-XXXXX-XXXXX durch Ihren Produktschlüssel. </p> <p> </p> <ul> <li><strong> BÜRO 2016/2019 32bit Unter Windows 64Bit </strong> <ul> <li> cscript „C:\\Programme (x86)\\Microsoft Office\\Office16\\OSPP.VBS“ /inpkey:XXXXX-XXXXX-XXXXX-XXXXX-XXXXX </li> </ul> </li> </ul> <p> </p> <ul> <li><strong> BÜRO 2016/2019 64bit Unter Windows 64Bit </strong> <ul> <li> cscript &quot;C:\\Programme\\Microsoft Office\\Office16\\OSPP.VBS&quot; /inpkey:XXXXX-XXXXX-XXXXX-XXXXX-XXXXX </li> </ul> </li> </ul> <p> </p> <ul> <li><strong> BÜRO 2016/2019 32bit Unter Windows 32Bit </strong> <ul> <li> cscript &quot;C:\\Programme\\Microsoft Office\\Office16\\OSPP.VBS&quot; /inpkey:XXXXX-XXXXX-XXXXX-XXXXX-XXXXX </li> </ul> </li> </ul> <p> </p> <p> </p> <ul> <li><strong> OFFICE 2013 32bit Unter Windows 64bit </strong> <ul> <li> cscript &quot;C:\\Programme (x86)\\Microsoft Office\\Office15\\OSPP.VBS&quot; /inpkey:XXXXX-XXXXX-XXXXX-XXXXX-XXXXX </li> </ul> </li> </ul> <p> </p> <ul> <li><strong> OFFICE 2013 64bit Unter Windows 64bit </strong> <ul> <li> cscript &quot;C:\\Programme\\Microsoft Office\\Office15\\OSPP.VBS&quot; /inpkey:XXXXX-XXXXX-XXXXX-XXXXX-XXXXX </li> </ul> </li> </ul> <p> </p> <ul> <li><strong> OFFICE 2013 32bit Unter Windows 32bit </strong> <ul> <li> cscript &quot;C:\\Programme\\Microsoft Office\\Office15\\OSPP.VBS&quot; /inpkey:XXXXX-XXXXX-XXXXX-XXXXX-XXXXX </li> </ul> </li> </ul> <p> </p> <p><img src=\"images/image_thumb-4-130.png\" alt=\"change office product key command\" loading=\"lazy\"></p> <p> </p> <p> 3. Schließen Sie die Eingabeaufforderung. <br> 4. Öffnen Sie eine beliebige Office-Anwendung und fahren Sie mit der Aktivierung des Produkts über das Internet fort. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}