{"title":"FIX: Standort ist nicht verfügbar – Datei oder Verzeichnis ist beschädigt und nicht lesbar (Gelöst)","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben des folgenden Fehlers, wenn Sie versuchen, auf ein Laufwerk oder einen Ordner im Betriebssystem Windows 10/8/7 zuzugreifen: „Der Speicherort ist nicht verfügbar. &quot;. </p> <p><img src=\"images/image_thumb-21-253.png\" alt=\"FIX Locations is not available - File or Directory is Corrupted and Unreadable 0x80070570\" loading=\"lazy\"></p> <p> </p> <p> Der Fehler 0x80070570 &quot;Die Datei oder das Verzeichnis ist beschädigt und nicht lesbar&quot; tritt normalerweise auf, wenn Sie das USB-Laufwerk zuvor nicht ordnungsgemäß getrennt haben (ohne die Option &quot;Sicherheitsentfernung&quot; zu verwenden). In anderen Fällen tritt der Fehler auf, wenn das Laufwerk beschädigt ist. </p> <h4> So beheben Sie: Laufwerk nicht zugänglich – Die Datei oder das Verzeichnis ist beschädigt und nicht lesbar (0x80070570). </h4> <p> </p> <h6> Methode 1. Trennen Sie das Laufwerk und schließen Sie es wieder an. </h6> <p> Wenn Sie die Fehlermeldung &quot;Laufwerk nicht zugänglich&quot; erhalten, wenn Sie versuchen, den Inhalt eines USB-Laufwerks anzuzeigen, versuchen Sie zuerst, das USB-Laufwerk zu trennen und wieder anzuschließen oder versuchen Sie, es an einen anderen USB-Anschluss oder einen anderen Computer anzuschließen. </p> <p> </p> <h6> Methode 2. Verwenden Sie Datenträger überprüfen, um das beschädigte Laufwerk zu reparieren. </h6> <p> Die zweite Methode zum Beheben des Fehlers &quot;Laufwerk nicht zugänglich&quot; oder &quot;Ordner nicht zugänglich&quot; besteht darin, das beschädigte Laufwerk mit dem Befehl &quot;CHKDSK&quot; zu reparieren. </p> <p> 1. Öffnen <strong> Eingabeaufforderung als Administrator </strong> . Das zu tun: </p> <ul> <li> Im <strong> Windows 7, Vista, XP </strong> : Navigieren Sie zu <strong> Start </strong> –&gt; <strong> Programme </strong> –&gt; <strong> Zubehör. </strong> Klicken Sie dann mit der rechten Maustaste auf <strong> Eingabeaufforderung </strong> und wählen Sie <strong> Als Administrator ausführen. </strong></li> </ul> <p><img src=\"images/image_thumb16-914.png\" alt=\"command-prompt-admin-windows-7-vista\" loading=\"lazy\"></p> <ul> <li> Im <strong> Windows 10, 8 </strong> : Geben Sie im Suchfeld Folgendes ein: <strong> Eingabeaufforderung </strong> oder <strong> cmd. </strong> Klicken Sie dann mit der rechten Maustaste auf <strong> Eingabeaufforderung </strong> Ergebnis und auswählen <strong> Als Administrator ausführen. </strong></li> </ul> <p><img src=\"images/image_thumb-10-340.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. Geben Sie im Eingabeaufforderungsfenster den folgenden Befehl ein und drücken Sie <strong> Eingeben </strong> : * </p> <ul> <li><strong> chkdsk D: /F /R </strong></li> </ul> <p><strong> * Hinweis: </strong> In diesem Beispiel ist der Treiberbuchstabe der beschädigten Festplatte das &quot;D&quot;. Ersetzen Sie den Treiberbuchstaben entsprechend Ihrem Fall. </p> <p><img src=\"images/image_thumb-22-172.png\" alt=\"fix drive not accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. Typ <strong> Ja </strong> und drücke <strong> Eingeben </strong> um das Volume aufzuheben (falls Sie dazu aufgefordert werden) </p> <p><img src=\"images/image_thumb-23-496.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Warten Sie, bis der Check Disk-Prozess das beschädigte Laufwerk repariert. </p> <p><img src=\"images/image_thumb-24-722.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Wenn die Überprüfung der Festplatte abgeschlossen ist, versuchen Sie, den Inhalt des Laufwerks zu durchsuchen. <br> 6. Wenn Sie auf das Laufwerk zugreifen können, kopieren Sie seinen gesamten Inhalt auf Ihren Computer und diagnostizieren Sie dann das Laufwerk auf Probleme, indem Sie die Anweisungen in diesem Tutorial befolgen: <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Beste Festplattentest- und Diagnosetools, um den Zustand der Festplatte zu überprüfen </a> . </p> <p> </p> <h6> Methode 3. Verwenden Sie PhotoRec, um Ihre Dateien wiederherzustellen. </h6> <p> Wenn die oben genannten Methoden nicht funktionieren, verwenden Sie das kostenlose <a href=\"http://www.cgsecurity.org/wiki/PhotoRec\" target=\"_blank\" rel=\"nofollow noopener\"> PhotoRec </a> Wiederherstellungsprogramm, um die verlorenen Dateien vom beschädigten Laufwerk wiederherzustellen. Das zu tun: </p> <p><strong> Schritt 1. Laden Sie Photorec herunter. </strong></p> <p> </p> <p> 1. Navigieren Sie zu: <a href=\"http://www.cgsecurity.org/wiki/TestDisk_Download\" target=\"_blank\" rel=\"nofollow noopener\"> http://www.cgsecurity.org/wiki/TestDisk_Download </a> Seite und klicken Sie auf <strong> &#39;TestDisk – Kostenloser Download&#39; </strong> Taste, oder klicken Sie <a href=\"http://www.cgsecurity.org/Download_and_donate.php/testdisk-7.0.win.zip\" target=\"_blank\" rel=\"nofollow noopener\"> Hier </a> um TestDisk direkt herunterzuladen. </p> <p> 2. Entpacken Sie die Datei &quot;testdisk-7.0.win.zip&quot;. </p> <p> </p> <p><strong> Schritt 2. Stellen Sie die beschädigten Dateien mit PhotoRec wieder her. </strong></p> <p> 1. Erkunden Sie den Ordner &quot;testdisk-7.0&quot; und öffnen Sie das <strong> qphotorec_win </strong> Anwendung. </p> <p> </p> <p><img src=\"images/image_thumb-4-696.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Wählen Sie die Festplatte aus, von der Sie Ihre Daten abrufen möchten. </p> <p><img src=\"images/image_thumb-7-484.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Wählen Sie dann die gesamte Festplatte oder die Partition aus, um Dateien abzurufen. * </p> <p><strong> * Hinweis: </strong> Wenn Sie nichts verpassen möchten, wählen Sie &quot; <strong> Keine Partition&quot; </strong> . Der PhotoRec scannt das gesamte Laufwerk. (Der Scan dauert länger) </p> <p><img src=\"images/image_thumb-8-229.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Wählen Sie: <strong> Ganz: Dateien aus der gesamten Partition extrahieren, </strong> wenn Sie beschädigte Daten wiederherstellen möchten * </p> <p><strong> * Hinweis: </strong> Wenn Sie gelöschte Dateien wiederherstellen möchten, wählen Sie: &quot; <em> Kostenlos: Nur von nicht zugewiesenem Speicherplatz nach Dateien suchen </em> . </p> <p><img src=\"images/image_thumb-9-232.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Wählen Sie dann ein Ziel auf Ihrer Festplatte*, um die wiederhergestellten Dateien zu speichern. </p> <p><strong> * Hinweis: </strong> Speichern Sie die wiederhergestellten Dateien niemals auf der beschädigten Festplatte. </p> <p><img src=\"images/image_thumb-10-286.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. (Optional) Klicken Sie auf <strong> Dateiformate </strong> und wählen Sie den Dateityp aus, den Sie wiederherstellen möchten. (z. B. &quot;jpg – JPG-Bild&quot;). </p> <p><img src=\"images/image_thumb-11-487.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Drücken Sie abschließend die <strong> Suche </strong> Taste. </p> <p><img src=\"images/image_thumb-12-520.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. Wenn der Scan- und Wiederherstellungsprozess abgeschlossen ist, navigieren Sie zu dem Ordner, den Sie (zuvor) ausgewählt haben, um die wiederhergestellten Dateien anzuzeigen. </p> <p> Das ist alles! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}