{"title":"FIX: YouTube funktioniert nicht in Chrome (Gelöst)","content":"<p> Einige Tage zuvor hatte ich folgendes Problem auf einem Windows-Computer: YouTube funktioniert nicht in Chrome (Videos werden nicht abgespielt). Wenn Sie mit Google Chrome keine Videos auf YouTube oder anderen Websites ansehen können, weil das Videofenster schwarz ist, lesen Sie dieses Tutorial, um das Problem zu beheben. </p> <p><img src=\"images/image_thumb-19-778.png\" alt=\"FIX YouTube Not Working on Chrome \" loading=\"lazy\"></p> <h4> So beheben Sie: YouTube- oder Online-Videos werden im Chrome-Browser nicht geladen. </h4> <p> Wenn YouTube-Videos nicht in Chrome geladen werden, fahren Sie fort, um das Problem zu beheben, indem Sie die folgenden Schritte ausführen. </p> <h6> Schritt 1. Überprüfen Sie, ob Sie Videos mit einem anderen Browser ansehen können. </h6> <p> Der erste Schritt besteht darin, festzustellen, ob das Problem &quot;YouTube funktioniert nicht&quot; nur in Google Chrome oder in allen anderen installierten Browsern auftritt. Öffnen Sie also einen anderen Webbrowser (z. B. den &#39;Internet Explorer&#39;) und prüfen Sie, ob Sie YouTube-Videos ansehen können. Wenn das gleiche Problem auftritt, überprüfen Sie Ihre Internetverbindung und aktualisieren Sie die Treiber auf Ihrem Bildschirmadapter, wenn es in Ordnung ist. Wenn Sie YouTube-Videos mit einem anderen Browser ansehen können, fahren Sie mit dem nächsten Schritt fort. </p> <p> </p> <h6> Schritt 2. Deaktivieren Sie die Hardwarebeschleunigung in Chrome. </h6> <p> Der nächste Schritt zur Behebung des Problems &quot;YouTube-Videos werden nicht in Chrome geladen&quot; besteht darin, die Hardwarebeschleunigung im Chrome-Browser zu deaktivieren. Das zu tun: </p> <p> 1. Über das Chrome-Menü <img src=\"images/image_thumb-78-483.png\" alt=\"image\" loading=\"lazy\"> wählen <strong> die Einstellungen </strong> . </p> <p><img src=\"images/image_thumb-79-661.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. At <strong> die Einstellungen </strong> Seite, scrollen Sie nach unten und klicken Sie auf <strong> Fortgeschritten </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Ziehen Sie die <strong> Hardwarebeschleunigung verwenden, wenn verfügbar </strong> wechseln zu <strong> AUS </strong> und dann klick <strong> Neustart. </strong></p> <p><img src=\"images/image_thumb-16-156.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Prüfen Sie, ob Sie jetzt YouTube-Videos ansehen können. Wenn nicht, fahren Sie mit Schritt 3 fort. </p> <p> </p> <h6> Schritt 3. Browserdaten löschen (Cookies, Cache usw.). </h6> <p> Der nächste Schritt zur Behebung des Problems &quot;YouTube-Video wird nicht geladen&quot; in Chrome besteht darin, die Browserdaten zu löschen. Gehen Sie dazu wie folgt vor: </p> <p> 1. Über das Chrome-Menü <img src=\"images/image_thumb-78-896.png\" alt=\"image\" loading=\"lazy\"> wählen <strong> Mehr Werkzeuge </strong> &gt; <strong> Browserdaten löschen </strong> . </p> <p><img src=\"images/image_thumb-17-593.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Wählen Sie unter Browserdaten löschen-Optionen <strong> Alle Zeit </strong> (bei &#39;Zeitbereich&#39;) und klicken Sie dann auf <strong> Daten löschen </strong> . </p> <p><img src=\"images/image_thumb-18-321.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Starten Sie Chrome neu und versuchen Sie, ein YouTube-Video anzusehen. Wenn das Problem weiterhin besteht, fahren Sie mit der nächsten Lösung fort. </p> <p> </p> <h6> Schritt 4: Löschen Sie die gespeicherten Einstellungen und Daten Ihres Chrome-Profils. </h6> <p> Manchmal funktioniert der Chrome-Browser nicht normal, wenn das Chrome-Profil beschädigt ist. Eine einfache Methode zum Beheben von Chrome-Problemen besteht darin, den Chrome-Profilordner neu zu erstellen. Das zu tun: </p> <p><strong> 1. </strong> <strong> Gleichzeitig </strong> Drücken Sie &quot; <strong> Fenster </strong> ” + “ <strong> R </strong> ”-Tasten zum Öffnen der <em> LAUF </em> Fenster. </p> <p><strong> 2. </strong> Im <em> LAUF </em> Fenster kopieren und fügen Sie den folgenden Befehl entsprechend Ihrem Windows-Betriebssystem ein und drücken Sie <strong> OK </strong> : </p> <ul> <li><strong> Windows 10, 8, 7 oder Vista: </strong> <ul> <li><strong> %LOCALAPPDATA%\\Google\\Chrome\\ </strong></li> </ul> </li> </ul> <p><img src=\"images/image_thumb4-325.png\" alt=\"chrome profile data\" loading=\"lazy\"></p> <ul> <li><strong> WindowsXP: </strong> <ul> <li><strong> %USERPROFILE%\\Lokale Einstellungen\\Anwendungsdaten\\Google\\Chrome\\ </strong></li> </ul> </li> </ul> <p> </p> <p> 3. <strong> Umbenennen </strong> den Ordner „Benutzerdaten“ in „Benutzerdaten.OLD“ oder <strong> löschen* </strong> den Ordner &#39;Benutzerdaten&#39;. </p> <p><strong> * Wichtiger Hinweis: </strong> Denken Sie daran, dass Sie durch das Löschen Ihres Chrome-Profilspeicherordners alle gespeicherten Daten (Lesezeichen, Passwörter, Einstellungen, Erweiterungen, Verlauf usw.) löschen. Bevor Sie Ihr Profil löschen, nehmen Sie eine <a href=\"https://www.repairwin.com/how-to-backup-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> Sicherung Ihrer Chrome-Lesezeichen </a> und <a href=\"https://www.repairwin.com/how-to-view-and-export-chrome-passwords/\" target=\"_blank\" rel=\"nofollow noopener\"> speichern Sie Ihre Chrome-Passwörter. </a></p> <p> </p> <p><img src=\"images/image_thumb11_thumb-690.png\" alt=\"chrome profile storage folder\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Öffnen </strong> Google Chrome, versuchen Sie, ein YouTube-Video anzuzeigen. </p> <h6></h6> <h6> Andere Lösungen zum Beheben des Problems &quot;YouTube-Videos werden nicht in Chrome geöffnet&quot;. </h6> <blockquote><p><strong> 1. </strong> Google Chrome aktualisieren. (Aus dem Chrome-Menü <img src=\"images/image_thumb-78-732.png\" alt=\"image\" loading=\"lazy\"> klicken <strong> Hilfe </strong> und dann auswählen <strong> Über Google Chrome </strong> .) </p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Überprüfen Sie Ihren Computer auf Viren, Malware usw. </a></p> <p><strong> 3. </strong> Aktualisieren Sie die Treiber des Bildschirmadapters. </p> <p><strong> 4. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Chrome vollständig deinstallieren und neu installieren </a> . </p> <p><strong> 5. </strong> Verwenden Sie einen anderen Webbrowser. </p></blockquote> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}