{"title":"FIX: Adobe Reader DC – Speichern unter ist leer (Gelöst)","content":"<p> Nach einem automatischen Update von Adobe Reader DC trat das folgende Problem auf: Die Funktion &quot;Speichern unter&quot; zeigt ein leeres (leeres) Fenster (leer) an, das es dem Benutzer nicht erlaubt, das PDF-Dokument zu speichern. </p> <p><img src=\"images/image_thumb-38-290.png\" alt=\"Adobe Reader DC - Save As is blank - fix\" loading=\"lazy\"></p> <p> Dieses Tutorial enthält Anweisungen zum Beheben des folgenden Problems: Die Funktion &quot;Speichern unter&quot; funktioniert nicht in Adobe Reader DC unter Windows oder MAC OS. </p> <h4> So beheben Sie: Speichern unter ist in Adobe Reader DC leer. </h4> <h6> Methode 1. Scannen Sie Ihr System auf Viren und Malware. </h6> <p> Der erste Schritt zur Behebung des Problems &quot;fehlende Ordner&quot; in Outlook besteht darin, sicherzustellen, dass Ihr System frei von Viren/Malware ist. Befolgen Sie für diese Aufgabe die Anweisungen in dieser Anleitung: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> So scannen Sie Ihren Computer auf Viren und andere bösartige Programme. </a></p> <p> </p> <h6> Methode 2. Deaktivieren Sie den Online-Speicher beim Speichern von Dateien. </h6> <p> 1. Von Adobe Reader DC <strong> Bearbeiten </strong> Menüklick <strong> Einstellungen </strong> . </p> <p><img src=\"images/image_thumb-39-749.png\" alt=\"save as not working fix in Adobe Reader DC\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Deaktivieren Sie </strong> das <strong> Online-Speicher beim Speichern von Dateien anzeigen </strong> und klicke <strong> OK. * </strong></p> <p> * Hinweis: Deaktivieren Sie optional auch die Funktion &quot;Online-Speicher beim Öffnen von Dateien anzeigen&quot;. </p> <p><img src=\"images/image_thumb-40-312.png\" alt=\"save as blank - abobe reader DC - fix\" loading=\"lazy\"></p> <p> </p> <p> 3. Versuchen Sie nun, die Funktion „Speichern unter“ in Adobe DC zu verwenden. Das Problem muss gelöst werden. </p> <p> </p> <h6> Methode 3. Deinstallieren Sie Adobe Reader DC und installieren Sie es erneut. </h6> <p> Die letzte Methode zum Auflösen der leeren Fenster in der Funktion &quot;Speichern unter&quot; in Adobe DC besteht darin, den Adobe Reader DC vollständig zu deinstallieren und dann die neueste Version des Programms von <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> Hier </a> . </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht zu verbreiten. </p>"}