{"title":"FIX: Semaphore Timeout Period ist beim Kopieren von Dateien abgelaufen (Gelöst)","content":"<p> Der Fehler &quot;Die Zeitüberschreitung des Semaphors ist abgelaufen&quot; kann angezeigt werden, wenn Sie versuchen, große Dateien über das Netzwerk zu kopieren oder Dateien von einem externen USB-Laufwerk auf Ihren Computer zu übertragen. In anderen Fällen erscheint der &quot;Fehler 0x80070079: Die Semaphore-Zeitüberschreitung ist abgelaufen&quot;, wenn Sie versuchen, Dateien von einem über USB angeschlossenen Gerät (z. </p> <p><img src=\"images/image_thumb-4-812.png\" alt=\"Semaphore Timeout Period has Expired\" loading=\"lazy\"></p> <p> </p> <p> In diesem Handbuch finden Sie mehrere Möglichkeiten, um den &quot;Semaphor-Timeout-Zeitraum abgelaufen. Fehler 0x80070079&quot; beim Kopieren von Dateien vom/zum Netzwerk oder USB unter Windows 10, 8, 8.1, 7 oder Vista zu beheben. </p> <h4> So beheben Sie: Fehler beim Kopieren einer Datei oder eines Ordners. Die Semaphorperiode ist abgelaufen. </h4> <p><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> TEIL 1. FIX &#39;Semaphore-Periode ist abgelaufen&#39; beim Kopieren von Dateien von USB. </a></p> <p><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> TEIL 2. FIX &#39;Semaphore ist abgelaufen&#39; beim Kopieren von Dateien aus dem Netzwerk. </a></p> <p> </p> <h6> TEIL 1. FIX &#39;Semaphore-Periode ist abgelaufen&#39; beim Kopieren von Dateien von USB. </h6> <p> Wenn Sie beim Kopieren von Dateien von einem USB-Gerät (z. B. von einer externen USB-Festplatte oder von Ihrer Digitalkamera) die Fehlermeldung &quot;Semaphore-Periode ist abgelaufen&quot; erhalten, versuchen Sie Folgendes, um das Problem zu beheben: </p> <p><strong> 1. </strong> Schließen Sie alle geöffneten Programme und <strong> neu starten </strong> dein Computer. <br> <strong> 2. </strong> Verbinden Sie das USB-Gerät mit <strong> ein anderer USB-Anschluss </strong> . Wenn Ihr Computer über einen USB 2.0-Anschluss verfügt, schließen Sie das USB-Gerät an diesem Anschluss an. <br> <strong> 3. </strong> Verwenden ein <strong> anderes USB-Kabel </strong> um das USB-Gerät mit Ihrem Computer zu verbinden. <br> <strong> 4. </strong> Wenn Sie Dateien von einem USB-Gerät (z. B. Ihrem Mobiltelefon oder Ihrer Digitalkamera) kopieren möchten, das eine SD-Karte besitzt, dann <strong> entfernen </strong> und <strong> wieder einfügen </strong> das <strong> SD-Karte </strong> . Entfernen Sie außerdem die SD-Karte aus dem USB-Gerät und stecken Sie sie in ein <strong> Kartenleser </strong> (wenn Sie einen besitzen). <br> <strong> 5. </strong> <strong> Prüfen </strong> und <strong> Fehler reparieren </strong> auf dem USB-Laufwerk mit dem &#39; <strong> chkdsk </strong> &#39; Befehl. Das zu tun: </p> <blockquote><p> 1. Starten <strong> Eingabeaufforderung als Administrator </strong> . </p></blockquote> <p><img src=\"images/image_thumb-30-765.png\" alt=\"command prompt administrator\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 2. Geben Sie im Eingabeaufforderungsfenster den folgenden Befehl ein und drücken Sie <strong> Eingeben </strong> : * </p></blockquote> <ul> <li> <ul> <li> <ul> <li><strong> chkdsk X: /F /R </strong></li> </ul> </li> </ul> </li> </ul> <p><strong> * Hinweis: </strong> Ersetzen Sie den Laufwerksbuchstaben X entsprechend dem Buchstaben des USB-Laufwerks. </p> <p> </p> <p> </p> <h6> TEIL 2. FIX &#39;Semaphore-Periode ist abgelaufen&#39; beim Kopieren von Dateien über das Netzwerk. </h6> <p> Wenn Sie beim Versuch, Dateien über das Netzwerk zu kopieren, die Fehlermeldung „Semaphore-Periode ist abgelaufen“ erhalten, versuchen Sie Folgendes: </p> <h2> Methode 1. Verwenden Sie eine statische IP-Adresse. </h2> <p> Wenn Sie DHCP verwenden, deaktivieren Sie es und geben Sie auf beiden Netzwerkcomputern eine statische IP-Adresse an. </p> <p> </p> <h2> Methode 2. Aktualisieren Sie die Netzwerktreiber auf beiden Computern. </h2> <ul> <li> Wenn Sie einen Laptop besitzen, versuchen Sie Folgendes: <ul> <li> Wenn Sie über Wi-Fi verbunden sind, versuchen Sie, die Dateien über die Ethernet-Verbindung (LAN) zu kopieren, oder… </li> <li> Navigieren Sie zur Support-Site des Herstellers Ihres Laptops, um die neuesten Netzwerktreiber herunterzuladen und zu installieren. </li> </ul> </li> <li> Wenn Sie einen Desktop-Computer besitzen, laden Sie die neuesten Treiber für Ihre Netzwerkkarte von der Support-Site des Motherboard-Herstellers herunter. </li> </ul> <p><strong> TRINKGELD: </strong> Wenn Sie das Modell Ihres Laptops oder Ihres Motherboards nicht finden können, gehen Sie wie folgt vor: </p> <blockquote><p> 1.  Drücken Sie die <strong> Fenster </strong> <img src=\"images/image_thumb8_thumb_thumb-904.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ: <strong> devmgmt.msc </strong> &amp; klicken <strong> OK </strong> um den &#39;Geräte-Manager&#39; zu öffnen <strong> . </strong></p></blockquote> <p><img src=\"images/image_thumb-1-166.png\" alt=\"device manager\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> </p> <p> 3. Erweitern Sie im Geräte-Manager das <strong> Netzwerkadapter. <br> </strong> 4. Klicken Sie mit der rechten Maustaste auf Ihren Netzwerkadapter und klicken Sie auf <strong> Treiber aktualisieren </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-946.png\" alt=\"update driver\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Lassen Sie Windows automatisch nach einem Update-Treiber für den Netzwerkadapter suchen. * </p></blockquote> <p><strong> *Hinweis: </strong> Wenn Windows keinen aktualisierten Treiber finden kann, verwenden Sie den Namen des Adapters (z. B. &quot;Broadcom 802.11g Network Adapter&quot;) und suchen Sie manuell nach einem aktualisierten Treiber. </p> <p><img src=\"images/image_thumb-6-471.png\" alt=\"search for drivers\" loading=\"lazy\"></p> <p> </p> <p> </p> <h2> Methode 3. Deaktivieren Sie vorübergehend Antivirus oder Firewall. </h2> <p> Die nächste Methode zum Beheben des Problems &quot;Semaphore-Periode ist abgelaufen&quot; besteht darin, die Windows-Firewall und Ihr Antivirenprogramm vorübergehend zu deaktivieren. So deaktivieren Sie die Windows-Firewall: </p> <p> 1.  Drücken Sie die <strong> Fenster </strong> <img src=\"images/image_thumb8_thumb_thumb-462.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ: <strong> Steuerung </strong> &amp; klicken <strong> OK </strong><strong> . </strong></p> <p><img src=\"images/image_thumb7-807.png\" alt=\"control panel command\" loading=\"lazy\"></p> <p> </p> <p> 3. Setzen Sie &quot;Anzeigen nach:&quot; auf <strong> Kleine Icons </strong> um alle Elemente des Bedienfelds anzuzeigen. </p> <p> </p> <p><img src=\"images/image_thumb8-567.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Öffnen <strong> Windows-Firewall </strong> (oder &quot;Windows Defender-Firewall&quot; in Windows 10). </p> <p><img src=\"images/image_thumb-7-921.png\" alt=\"disable firewall wiindows\" loading=\"lazy\"></p> <p> </p> <p> 5. Klicken Sie auf <strong> Schalten Sie die Windows-Firewall ein oder aus </strong> . </p> <p><img src=\"images/image_thumb-8-655.png\" alt=\"turn off windows defender firewall\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Prüfen </strong> das &quot; <strong> Deaktivieren Sie die Windows-Firewall (nicht empfohlen) </strong> &quot;Option und klicken Sie <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-9-907.png\" alt=\"turn off windows firewall\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Neu starten </strong> Ihren Computer und kopieren Sie dann die Dateien. * </p> <p> * Hinweis:  Führen Sie nach dem Kopieren der Dateien die obigen Schritte aus, um die Windows-Firewall erneut zu aktivieren. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}