{"title":"FIX: Laufwerk ist nicht zugänglich – Zugriff verweigert (Gelöst).","content":"<p> Wenn Sie versuchen, eine Festplatte im Windows Explorer zu öffnen und die Fehlermeldung &quot;Laufwerk ist nicht zugänglich. Zugriff verweigert&quot; erhalten, lesen Sie dieses Tutorial, um das Problem zu beheben. Der Fehler &quot;Laufwerk ist nicht zugänglich – Zugriff verweigert&quot; erscheint normalerweise beim Versuch, auf eine externe oder interne Festplatte zuzugreifen, ohne die entsprechenden Berechtigungen dafür zu haben. </p> <p><img src=\"images/image_thumb-23-851.png\" alt=\"Drive is not accessible - Access is denied \" loading=\"lazy\"></p> <h4> So beheben Sie: Zugriff auf Festplatte verweigert. * </h4> <p><strong> * Wichtig </strong> : Bevor Sie mit der Behebung des Fehlers &quot;Laufwerk nicht zugänglich&quot; fortfahren, <strong> Stellen Sie sicher, dass die Festplatte nicht gesperrt ist </strong> durch <strong> BitLocker </strong> oder <strong> andere Verschlüsselungssoftware </strong> . Wenn das Laufwerk beispielsweise mit BitLocker gesperrt ist, klicken Sie mit der rechten Maustaste darauf und wählen Sie <strong> Laufwerk entsperren </strong> und geben Sie das Passwort ein, um es zu entsperren. </p> <h6> Methode 1. Greifen Sie im abgesicherten Modus auf die Festplatte zu. </h6> <p> Die einfachste Lösung, um den Fehler „Laufwerk ist nicht zugänglich – Zugriff verweigert“ im Windows Explorer zu umgehen, besteht darin, den Inhalt der Festplatte im abgesicherten Modus von Windows anzuzeigen. </p> <p> 1. Drücken Sie die Windows <img src=\"images/image_thumb8_thumb_thumb-681.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ <strong> msconfig </strong> und drücke <strong> Eingeben </strong> . </p> <p><img src=\"images/image_thumb-47-294.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. At <strong> Booten </strong> Registerkarte wählen Sie die <strong> Sicherer Start </strong> Option, dann klicke <strong> OK </strong> und starten Sie Ihren Computer neu. </p> <p><img src=\"images/image_thumb-48-656.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> 4. Öffnen Sie nach dem Neustart und im abgesicherten Modus den Windows Explorer und doppelklicken Sie auf das Laufwerk, um seinen Inhalt anzuzeigen. <br> 5. Kopieren Sie den Inhalt der Festplatte an einen anderen Speicherort (Laufwerk) auf Ihrem PC. <br> 6. Wenn Sie fertig sind, klicken Sie mit der rechten Maustaste auf das Laufwerk und klicken Sie auf <strong> Format </strong> um das Laufwerk zu formatieren. <br> 7. Führen Sie nach dem Formatieren das &#39;msconfig&#39;-Tool erneut aus und <strong> Allgemeines </strong> Registerkarte, überprüfen Sie die <strong> Normaler Start </strong> und klicke <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-958.png\" alt=\"normal startup windows\" loading=\"lazy\"></p> <p> 6. <strong> Neu starten </strong> dein Computer. <br> 7. Verschieben Sie nach dem Neustart die kopierten Dateien zurück auf das Laufwerk und fertig! </p> <p> </p> <h6> Methode 2. Ändern Sie die Berechtigungen auf der Festplatte. </h6> <p> Die nächste Methode zum Beheben des Fehlers „Datenträger ist nicht zugänglich – Zugriff verweigert“ besteht darin, dem Laufwerk die richtigen Berechtigungen zuzuweisen. Das zu tun: </p> <p> 1. Klicken Sie mit der rechten Maustaste auf das Laufwerk mit dem Problem &quot;Zugriff verweigert&quot; und wählen Sie <strong> Eigenschaften </strong> . </p> <p><img src=\"images/image_thumb-24-600.png\" alt=\"Modify Drive Properties\" loading=\"lazy\"></p> <p> 2. At <strong> Sicherheit </strong> Tab-Klick <strong> Fortgeschritten </strong> . </p> <p><img src=\"images/image_thumb-25-352.png\" alt=\"Modify Permissions on Drive\" loading=\"lazy\"></p> <p> </p> <p> 3. Klicken Sie auf <strong> Veränderung </strong> Inhaber </p> <p><img src=\"images/image_thumb-26-346.png\" alt=\"Modify Disk Permissions\" loading=\"lazy\"></p> <p> </p> <p> 4. Geben Sie Administratoren ein und klicken Sie auf <strong> Namen überprüfen </strong></p> <p><img src=\"images/image_thumb-27-581.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Klicken Sie dann auf <strong> OK </strong></p> <p><img src=\"images/image_thumb-28-161.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. <strong> Prüfen </strong> das <strong> Kontrollkästchen Besitzer auf Untercontainern und Objekten ersetzen </strong> und klicke <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-29-373.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7. Klicken Sie auf <strong> Ja </strong> um die Berechtigungen zu ersetzen. </p> <p><img src=\"images/image_thumb-30-111.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. Klicken Sie nun auf <strong> OK </strong> , um die Eigenschaften des Laufwerks zu schließen. </p> <p> 9. Öffnen Sie die Eigenschaften des Laufwerks erneut und gehen Sie zu <strong> Sicherheit </strong> &gt; <strong> Fortgeschritten. </strong></p> <p> 10. Klicken Sie bei &#39;Erweiterte Sicherheitseinstellungen für lokale Festplatte&#39; auf <strong> Hinzufügen. </strong></p> <p><img src=\"images/image_thumb-31-320.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 11. Klicken Sie auf <strong> Wählen Sie einen Schulleiter aus </strong></p> <p><img src=\"images/image_thumb-32-829.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 12. Typ <strong> Authentifizierte Benutzer </strong> und klicke <strong> OK </strong></p> <p><img src=\"images/image_thumb-33-524.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 13. <strong> Prüfen </strong> das <strong> Volle Kontrolle </strong> Kästchen an und klicke <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-34-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 14. Wiederholen Sie die Schritte 10-13 und fügen Sie die folgenden Principals (Benutzer) hinzu: </p> <ul> <li><strong> Administratoren </strong></li> <li><strong> SYSTEM </strong></li> </ul> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/02/image-36.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 15. Wenn Sie fertig sind, klicken Sie auf <strong> OK </strong> um die Änderungen zu übernehmen und klicken Sie dann auf <strong> OK </strong> erneut, um die Eigenschaften des Laufwerks zu schließen. </p> <p><img src=\"images/image_thumb-37-204.png\" alt=\"image\" loading=\"lazy\"></p> <p> 16. Versuchen Sie nun, das Laufwerk zu öffnen und zu sehen, ob Sie auf seinen Inhalt zugreifen. </p> <h6> Methode 3. Überprüfen Sie das Laufwerk auf Fehler. </h6> <p> 1. Öffnen <strong> Eingabeaufforderung als Administrator </strong> . Das zu tun: </p> <ul> <li> Geben Sie im Suchfeld Folgendes ein: <strong> Eingabeaufforderung </strong> oder <strong> cmd </strong></li> <li> Klicken Sie mit der rechten Maustaste auf <strong> cmd </strong> oder <strong> Eingabeaufforderung </strong> Ergebnis und auswählen <strong> Als Administrator ausführen. </strong></li> </ul> <p><img src=\"images/image_thumb-10-756.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. Geben Sie in die Eingabeaufforderung den folgenden Befehl ein und drücken Sie <strong> Eingeben: </strong></p> <ul> <li> <strong> chkdsk-Laufwerksbuchstabe: /r </strong></li> </ul> <p><strong> * </strong> z.B. Der Laufwerksbuchstabe in diesem Beispiel ist das &quot;G:&quot;. Der Befehl sollte also lauten: <strong> chkdsk g: /r </strong></p> <p><img src=\"images/image_thumb59-915.png\" alt=\"check-disk-repair\" loading=\"lazy\"></p> <p><strong> 4. </strong> Wenn Sie gebeten haben, Dateien wiederherzustellen, fragen Sie <strong> Ja </strong> . </p> <p> </p> <p> Das ist alles! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}