{"title":"FIX: Batterieentladung in Windows 10 (Gelöst)","content":"<p> Bei Windows 10 beschweren sich viele Benutzer darüber, dass ihr Laptop-Akku selbst bei geringer Nutzung oder sogar beim vollständigen Herunterfahren schnell leer wird. Dieses Problem mit dem &quot;Batterieverbrauch&quot; in Windows 10 tritt aus zwei grundlegenden Gründen auf. Der erste Grund ist, dass Windows 10 zu viele Hintergrundanwendungen lädt, die Batteriestrom verbrauchen, auch wenn sie nicht verwendet werden. </p> <p> Der nächste Grund, der auch beim vollständigen Herunterfahren zum Entladen der Batterie führt, ist die &quot;Fast Startup&quot;-Funktion. Windows 10 (und Windows 8/8.1) hat standardmäßig die Funktion &quot;Fast Startup&quot; aktiviert, die es dem System ermöglicht, schneller zu booten und zu starten. Tatsächlich führt Windows 10 bei aktiviertem &quot;Schnellstart&quot; kein vollständiges Herunterfahren des Systems durch und wird aus dem Ruhezustand wieder aufgenommen. </p> <p> In diesem Tutorial finden Sie Anweisungen, um zu verhindern, dass Windows 10 den Akku entlädt. </p> <h4> So beheben Sie das Problem mit dem Batterieverbrauch in Windows 10. </h4> <p> </p> <h6> Schritt 1. Verhindern, dass Apps im Hintergrund ausgeführt werden. </h6> <p> Der erste Schritt zur Behebung des Akkuverbrauchsproblems in Windows 10 besteht darin, zu vermeiden, dass Apps im Hintergrund ausgeführt werden. So deaktivieren Sie die Hintergrund-Apps: </p> <p> 1. Navigieren Sie zu <strong> Start </strong> -&gt; <strong> die Einstellungen </strong> -&gt; <strong> Privatsphäre </strong> . <br> 2. Wählen Sie <strong> Hintergrund-Apps </strong> links und dann rechts das &quot; <strong> Apps im Hintergrund laufen lassen&quot; </strong> wechseln zu <strong> Aus, </strong> oder wählen Sie einzeln die Apps aus, die Sie nicht im Hintergrund ausführen möchten, und schalten Sie sie aus. </p> <p><img src=\"images/image_thumb-8-676.png\" alt=\"Prevent Apps from Running in the Background - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Schritt 2. Schalten Sie den Energiesparmodus ein. </h6> <p> Der nächste Schritt besteht darin, den Batteriesparmodus zu aktivieren, um die Batterielebensdauer durch Begrenzung der Hintergrundaktivität zu verlängern. </p> <p> 1. Navigieren Sie zu <strong> Start </strong> -&gt; <strong> die Einstellungen </strong> -&gt; <strong> System </strong> . <br> 2. At <strong> Batterie </strong> Optionen: </p> <blockquote> <p> ein. Klicken Sie auf &quot;Sehen Sie, welche Apps Ihre Akkulaufzeit beeinträchtigen&quot;, um den Akkuverbrauch der geöffneten Apps zu ermitteln. <br> b. <strong> Prüfen </strong> das &quot; <strong> Schalten Sie den Energiesparmodus automatisch ein, wenn mein Akku unten ausfällt&quot; </strong> Kontrollkästchen und verschieben Sie den Schieberegler an eine geeignete Position. <br> c. Wählen Sie außerdem &quot;Bildschirmhelligkeit im Energiesparmodus verringern. </p> </blockquote> <p><img src=\"images/image_thumb-9-289.png\" alt=\"turn on battery saver Windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Schritt 3. Deaktivieren Sie den Schnellstart. </h6> <p> Der nächste Schritt besteht darin, das vollständige Herunterfahren von Windows 10 zu erzwingen, indem die Schnellstartfunktion deaktiviert wird. </p> <p> 1. Navigieren Sie zu <strong> Start </strong> -&gt; <strong> die Einstellungen </strong> -&gt; <strong> System </strong> . <br> 2. At <strong> Leistung </strong> Optionen klicken <strong> Zusätzliche Energieeinstellungen. </strong></p> <p><img src=\"images/image_thumb-10-405.png\" alt=\"FIX Battery Drain in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Wählen Sie <strong> Wählen Sie aus, was die Power-Tasten tun </strong> auf der linken Seite. </p> <p><img src=\"images/image_thumb-11-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Dann klick <strong> Einstellungen ändern, die derzeit nicht verfügbar sind </strong> . </p> <p><img src=\"images/image_thumb-12-235.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> Deaktivieren Sie </strong> das <strong> Schnellstart aktivieren (empfohlen) </strong> Option und klicken Sie <strong> Änderungen speichern. * </strong></p> <p> * Hinweis: Wenn die Schnellstartoption bereits deaktiviert war, überprüfen Sie sie und starten Sie Ihren Computer neu. Nach dem Neustart deaktivieren Sie es und starten Sie Ihren Computer erneut. </p> <p><img src=\"images/image_thumb-13-410.png\" alt=\"Turn Off Fast Startup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Neu starten </strong> dein Computer. </p> <h6></h6> <h6> Schritt 4. Deaktivieren Sie den Ruhezustand. </h6> <p> Der &#39;Ruhezustand&#39; ist eine Energiefunktion, die weniger Strom verbraucht als der Ruhezustand. Wenn Sie den PC erneut starten, sind Sie wieder da, wo Sie aufgehört haben. In einigen Fällen führt die Ruhezustandsfunktion dazu, dass Ihr Windows 10-PC nicht vollständig heruntergefahren wird. So deaktivieren Sie den Ruhezustand: </p> <p> </p> <p> 1. Geben Sie im Suchfeld Folgendes ein: <strong> Eingabeaufforderung </strong> oder <strong> cmd <br> </strong> 2.  Rechtsklick auf <strong> Eingabeaufforderung und wählen Sie Als Administrator ausführen </strong></p> <p><img src=\"images/image_thumb-14-379.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Geben Sie an der Eingabeaufforderung den folgenden Befehl ein und drücken Sie <strong> Eingeben. </strong></p> <ul> <li><strong> powercfg -h aus </strong></li> </ul> <p><img src=\"images/image_thumb-15-234.png\" alt=\"Disable Hibernate Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. <strong> Neu starten </strong> dein Computer. * </p> <p> * Hinweis: Wenn Sie die Funktion &quot;Ruhezustand&quot; wieder aktivieren möchten, geben Sie einfach diesen Befehl in die administrative Eingabeaufforderung ein: </p> <ul> <li> <ul> <li> powercfg -h aus </li> </ul> </li> </ul> <p> </p> <h6> Schritt 5. Ändern Sie die Energieeinstellungen des Netzwerkadapters. </h6> <p> Die nächste Methode zum Beheben des Batterieverbrauchsproblems in Windows 10 besteht darin, die Energieeinstellungen der Netzwerkadapter zu ändern. </p> <p> 1. Öffnen <strong> Gerätemanager </strong> . <br> 2. Erweitern <strong> Netzwerkadapter </strong> . <br> 3. Klicken Sie mit der rechten Maustaste auf den installierten Netzwerkadapter und wählen Sie <strong> Eigenschaften </strong> . <br> 3. Wählen Sie die <strong> Energieverwaltung </strong> Tab. <br> 4. <strong> Deaktivieren Sie </strong> das <strong> &#39;Diesem Gerät erlauben, den Computer zu reaktivieren </strong> &#39;Checkbox und klicken <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-7-574.png\" alt=\"modify power settings\" loading=\"lazy\"></p> <h6></h6> <h6> Schritt 6. Rollback des Intel Management Engine-Schnittstellentreibers. </h6> <p> Wenn das Problem mit dem Akkuverbrauch nach der Installation eines Windows 10-Updates auftritt, fahren Sie fort und führen Sie ein Rollback des Treibers für die Intel Management Engine-Schnittstelle durch. Das zu tun: </p> <p> 1.  Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-592.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ: <strong> devmgmt.msc </strong> &amp; klicken <strong> OK </strong> . <br> 3. Erweitern <strong> Systemgeräte </strong> . <br> 4. Rechtsklick auf <strong> Intel Management Engine-Schnittstelle </strong> und wählen Sie <strong> Eigenschaften </strong> . </p> <p><img src=\"images/image_thumb-5-532.png\" alt=\"device properties\" loading=\"lazy\"></p> <p> </p> <p> 5. Wählen Sie die Registerkarte Treiber und klicken Sie auf <strong> Rollback-Treiber </strong> . * </p> <p> </p> <p> * Wenn die <strong> Rollback-Treiber </strong> Schaltfläche ausgegraut ist, navigieren Sie dann zur Support-Site des Herstellers Ihres Laptops oder Motherboards, um eine ältere Treiberversion für das Intel Management Engine Interface herunterzuladen und zu installieren. </p> <p><img src=\"images/image_thumb-6-551.png\" alt=\"roll back driver\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Neu starten </strong> dein Computer. </p> <h6> Schritt 7. Andere Vorschläge zur Behebung des Problems mit der Batterieentladung. </h6> <p> 1. Ersetzen Sie das Ladegerät des Laptops und verwenden Sie immer ein Markenladegerät, um die Lebensdauer Ihres Akkus zu verlängern. <br> 2. Wenn der Akku Ihres Laptops alt ist, ist seine Kapazität wahrscheinlich gesunken und sollte ersetzt werden. Um den Zustand Ihres Akkus zu diagnostizieren, verwenden Sie die <a href=\"http://www.nirsoft.net/utils/battery_information_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> BatterieInfoView </a> Nützlichkeit. </p> <p><img src=\"images/image_thumb-16-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um das Problem zu verbreiten. </p>"}