{"title":"FIX: Thunderbird reagiert nicht oder friert ein. (Gelöst)","content":"<p> Wenn Thunderbird nicht reagiert, fahren Sie unten fort, um das Problem zu beheben. Thunderbird ist ein beliebter Open-Source-E-Mail-Client, der für alle Plattformen verfügbar ist. Aber manchmal reagiert Thunderbird überhaupt nicht mehr oder friert 4-5 Minuten lang ein, bevor es wieder verwendbar ist. </p> <p><img src=\"images/image_thumb-18-762.png\" alt=\"Thunderbird is not responding or freezing - fix\" loading=\"lazy\"></p> <p> Thunderbird funktioniert aus folgenden Gründen möglicherweise nicht: </p> <ul> <li> Das Antivirus-Programm kann Thunderbird daran hindern, eine Verbindung zum Internet herzustellen. </li> <li> Die Windows-Suchfunktion in Thunderbird-Nachrichten kann dazu führen, dass Thunderbird einfriert. </li> <li> Eine problematische Thunderbird-Einstellung oder ein Add-on. </li> <li> Thunderbird-Indexierungsdateien (MSF-Dateien) sind möglicherweise beschädigt. </li> </ul> <p> Da Thunderbird aus verschiedenen Gründen möglicherweise nicht reagiert, zeigen wir Ihnen in diesem Tutorial alle verfügbaren Möglichkeiten zur Lösung des Problems. </p> <h2> So beheben Sie: Thunderbird reagiert nicht oder friert in Windows 10 ein. </h2> <h3> Methode 1. Scannen Sie Ihren Computer auf Viren. </h3> <p><strong> Wichtig: </strong> Viele Viren oder Schadprogramme können Probleme mit dem Windows-Update verursachen. Bevor Sie also mit den folgenden Schritten zur Fehlerbehebung fortfahren, verwenden Sie dies <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Anleitung zum Scannen und Entfernen von Malware </a> um Viren und/oder bösartige Programme zu überprüfen und zu entfernen, die möglicherweise auf Ihrem Computer ausgeführt werden. </p> <h3></h3> <h3> Methode 2. Deaktivieren Sie die Windows-Suche in Thunderbird-Nachrichten. </h3> <p> 1. Wählen Sie im Menü von Thunderbird die Option <strong> Werkzeuge </strong> &gt; <strong> Optionen </strong> . </p> <p> 2. Unter Allgemeine Einstellungen, <strong> deaktivieren </strong> die Option <strong> Erlaube der Windows-Suche, Nachrichten zu durchsuchen </strong> . </p> <p><img src=\"images/image_thumb-24-636.png\" alt=\"Disable Windows Search in Thunderbird Messages\" loading=\"lazy\"></p> <p> 3. <strong> Neu starten </strong> Donnervogel. </p> <p> </p> <h3> Methode 3. Fügen Sie Thunderbird zu Antivirus-Ausnahmen hinzu. </h3> <p> Wenn Sie auf Ihrem Computer ein Antivirenprogramm eines Drittanbieters verwenden, fahren Sie fort und fügen Sie das ausführbare Programm „thunderbird.exe“ zu den Ausnahmen Ihres Antivirenprogramms hinzu. </p> <p> Wenn Sie beispielsweise Eigentümer von AVG Antivirus sind: </p> <p> 1. Gehe zu <strong> Speisekarte </strong> &gt; <strong> die Einstellungen </strong> . <br> 2. In <strong> Allgemeines </strong> Registerkarte, klicken Sie <strong> Ausnahmen </strong> &gt; <strong> Ausnahme hinzufügen </strong> . <br> 3. Klicken Sie auf das <strong> Durchsuche </strong> und suchen Sie die <strong> Thunderbird.exe </strong> Datei, (oder <strong> Kopieren </strong> &amp; <strong> füge die untere Zeile ein) </strong> und dann klick <strong> Ausnahme hinzufügen. * </strong></p> <ul> <li> C:\\Programme (x86)\\Mozilla Thunderbird\\thunderbird.exe </li> </ul> <p><strong> * Hinweis: </strong> Wenn das Problem nach dem Hinzufügen der Datei &quot;thunderbird.exe&quot; zu Ihren AV-Ausnahmen weiterhin besteht, <strong> hinzufügen </strong> ebenfalls <strong> zu AV-Ausnahmen </strong> das <strong> Ordner, in dem Thunderbird installiert wurde </strong> und der <strong> Thunderbird-Profilordner </strong> . </p> <p><img src=\"images/image_thumb-19-734.png\" alt=\"add thunderbird to antivirus exceptions\" loading=\"lazy\"></p> <p> </p> <p> </p> <h3> Methode 4. Deaktivieren – Deinstallieren Sie Ihre Antivirenprogramme. </h3> <p> Da das Problem &quot;reagiert nicht&quot; im Thunderbird-Programm normalerweise auf das Antivirus-Programm zurückzuführen ist, empfehle ich, <strong> deaktivieren </strong> oder zu <strong> komplett deinstallieren </strong> Ihr Antivirenprogramm und prüfen Sie, ob das Problem weiterhin besteht. </p> <h3></h3> <p> </p> <h3> Methode 5. Starten Sie Thunderbird im abgesicherten Modus. </h3> <p> Thunderbird kann einfrieren und nicht reagieren, wenn eine installierte Erweiterung Probleme verursacht oder beschädigt ist. Um Probleme mit den Add-ons von Thunderbird zu beheben, gehen Sie wie folgt vor. </p> <p> 1. Drücken Sie und <strong> runter halten </strong> das <strong> VERSCHIEBUNG </strong> Taste auf deiner Tastatur und öffne <strong> Donnervogel. </strong></p> <p> 2. Klicken Sie im nächsten Fenster auf <strong> Fahren Sie im abgesicherten Modus fort. </strong></p> <p><img src=\"images/image_thumb-21-196.png\" alt=\"Strat Thunderbird in Safe Mode\" loading=\"lazy\"></p> <p> </p> <p> 3. Wenn Thunderbird im abgesicherten Modus nicht einfriert, kann ein installiertes Add-On das Problem verursachen. In diesem Fall: </p> <ol> <li> Schließen Sie Thunderbird. </li> <li> Drücken Sie die SHIFT-Taste und starten Sie Thunderbird erneut. </li> <li> Im nächsten Fenster, <strong> prüfen </strong> <strong> Alle Add-ons deaktivieren </strong> und klicke <strong> Änderungen vornehmen und neu starten </strong> . </li> </ol> <p><img src=\"images/image_thumb-22-149.png\" alt=\"Disable Thunderbird add-ons\" loading=\"lazy\"></p> <p> 4. Wenn Thunderbird nicht mehr reagiert, fahren Sie mit der nächsten Methode fort. </p> <h3> Methode 5. Setzen Sie Thunderbird-Symbolleisten und -Steuerelemente zurück. </h3> <p> 1. Drücken Sie und <strong> runter halten </strong> das <strong> VERSCHIEBUNG </strong> Taste auf deiner Tastatur und öffne <strong> Donnervogel. </strong></p> <p> 2. Wählen Sie im nächsten Fenster <strong> Symbolleisten und Steuerelemente zurücksetzen </strong> und klicke <strong> Änderungen vornehmen und neu starten. </strong></p> <p><img src=\"images/image_thumb-23-344.png\" alt=\"Reset Thunderbird Toolbars\" loading=\"lazy\"></p> <p> </p> <h3> Methode 6. Löschen Sie die Indexdateien (.msf) von Thunderbird. </h3> <p> In einigen Fällen friert Thunderbird ein, weil die Indexierungsdateien (auch bekannt als MSF-Dateien) beschädigt werden. Die letzte Methode, um das Problem &quot;Thunderbird reagiert nicht&quot; zu lösen, besteht darin, die .MSF-Dateien zu löschen. * </p> <p><strong> * WICHTIG: </strong> Obwohl MSF-Dateien (Mail Summary Files) sicher gelöscht werden können, da sie nur die E-Mail-Header und den E-Mail-Status (gelesen, ungelesen usw.) <a href=\"https://www.repairwin.com/how-to-transfer-thunderbird-email-and-settings-to-a-new-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Sichern Sie den Thunderbird-Profilordner </a> bevor Sie MSF-Dateien löschen. </p> <p><strong> Schritt 1. Schließen Sie Thunderbird. </strong></p> <p><strong> Schritt 2. Aktivieren Sie die Ansicht Versteckte Dateien. </strong></p> <p> 1. Navigieren Sie zu Windows <strong> Schalttafel </strong> und öffne die <strong> Ordneroptionen </strong> . (oder der <strong> Datei-Explorer-Optionen </strong> bei Windows 10). </p> <p> 2. Wählen Sie die <strong> Aussicht </strong> Registerkarte und unter dem <strong> &#39;Versteckte Dateien und Ordner&#39; </strong> Sektion, <strong> prüfen </strong> das <strong> Versteckte Dateien, Ordner und Laufwerke anzeigen </strong> Option und klicken Sie <strong> OK. </strong></p> <p><img src=\"images/image_thumb-34-553.png\" alt=\"Show Hidden files\" loading=\"lazy\"></p> <p> </p> <p><strong> Schritt 3. Löschen Sie die .MSF-Dateien </strong></p> <p> 1. Navigieren Sie zum Thunderbird-Profilordner auf Ihrer Festplatte und öffnen Sie das <strong> E-Mail </strong> Mappe: * </p> <ul> <li> C:\\Benutzer\\Benutzername\\AppData\\Roaming\\Thunderbird\\Profiles\\ProfileName <strong> .default\\Mail </strong></li> </ul> <p> * Dabei ist Benutzername Ihr Windows-Benutzername und Profilname der Mozilla-Profilname, unter dem die E-Mails gespeichert werden. </p> <p> 2. Erkunden Sie nun alle enthaltenen Ordner im <strong> E-Mail </strong> Ordner, um zu sehen, welcher die .msf-Dateien enthält. (bei Standardinstallationen mit nur einem E-Mail-Konto befinden sich die MSF-Dateien im Ordner &quot;Lokale Ordner&quot;. </p> <p> 3. <strong> Löschen </strong> alle <strong> .msf </strong> Dateien oder -besser- <strong> Bewegung </strong> sie in einen (neuen) Ordner auf Ihrem Desktop. </p> <p><img src=\"images/image_thumb-25-355.png\" alt=\"Delete Thunderbird MSF files\" loading=\"lazy\"></p> <p> 4. Wenn Sie fertig sind, öffnen Sie Thunderbird und warten Sie, bis Thunderbird die Indizierungsdateien (MSF-Dateien) neu erstellt hat. </p> <p> Das war&#39;s Leute! Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}