{"title":"FIX: Kein Ton von internen Lautsprechern auf Laptop HP OMEN (Gelöst)","content":"<p> Dieses Tutorial enthält Schritt-für-Schritt-Anleitungen zum Beheben des Problems &quot;Kein Ton aus internen Lautsprechern&quot; auf a <a href=\"https://support.hp.com/ph-en/document/c05576170\" target=\"_blank\" rel=\"nofollow noopener\"> Laptop Omen von HP – 17-an009nv </a> . Das Problem „kein Ton aus den Lautsprechern des Laptops“ kann bei jedem HP Laptop-Modell auftreten und tritt normalerweise nach der Installation eines Windows-Treiberupdates für das Realtek High Definition Audio-Gerät auf. </p> <p> Problem im Detail: Auf einem HP-Laptop mit Windows 10 ist bei der Wiedergabe von Musik oder Video kein Ton aus den internen Lautsprechern zu hören, aber die Lautsprecher funktionieren normal, wenn die HP-Diagnosetests außerhalb des Betriebssystems ausgeführt werden. Außerdem tritt das Problem &quot;kein Ton&quot; nur bei den Laptop-Lautsprechern auf und nicht bei externen Lautsprechern oder Kopfhörern. </p> <h4> So beheben Sie: Die Lautsprecher des Laptops kein Ton in Windows 10. </h4> <h6> Schritt 1. Erhöhen Sie die Lautstärke </h6> <p> 1. <strong> Rechtsklick </strong> Bei der <strong> Tonsymbol </strong><img src=\"images/image_thumb-11-503.png\" alt=\"image\" loading=\"lazy\"> in der Taskleiste und wählen Sie <strong> Lautstärkemixer öffnen. </strong></p> <p><img src=\"images/image_thumb-12-807.png\" alt=\"Open Volume Mixer\" loading=\"lazy\"></p> <p> 2. Ziehen Sie den Lautsprecher-Schieberegler auf das <strong> oben </strong> und prüfen Sie, ob Sie Ton hören können. </p> <p><img src=\"images/image_thumb-13-813.png\" alt=\"Adjust Sound Volume\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Schritt 2. Stellen Sie die Lautsprecher als Standardwiedergabegerät ein. </h6> <p> 1. Navigieren Sie zu Windows <strong> Schalttafel </strong> und öffnen <strong> Klang. </strong></p> <p><img src=\"images/image_thumb-14-315.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Stellen Sie sicher, dass <strong> Sprecher </strong> ist der <strong> Standard </strong> Wiedergabegerät, andernfalls wählen Sie die Lautsprecher aus und klicken Sie auf <strong> Als Standard festlegen </strong> Taste. Wenn Sie fertig sind, testen Sie Ihre Lautsprecher und fahren Sie mit dem nächsten Schritt fort, wenn das Problem weiterhin besteht. </p> <p><img src=\"images/image_thumb-15-993.png\" alt=\"Set Speakers as Default Playback Device\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Schritt 3. Testen Sie die internen Lautsprecher außerhalb von Windows. </h6> <p> Der nächste Schritt zur Lösung des Problems &quot;kein Ton auf internen Lautsprechern&quot; auf Ihrem Laptop besteht darin, zu testen, ob die Lautsprecher funktionieren, wenn Sie die HP-Hardwarediagnosetests ausführen. Das zu tun: </p> <p> 1. <strong> Ausschalten </strong> dein Laptop. <br> 2. Schalten Sie Ihren Laptop ein und drücken Sie sofort die <strong> ESC </strong> Taste wiederholt. <br> 3. Wenn das Menü erscheint, drücken Sie die <strong> F2 </strong> Schlüssel. <br> 4. Klicken Sie im Hauptmenü auf <strong> Komponententests </strong> und dann klick <strong> AUDIO. <br> </strong> 5. Wenn Sie während der Audiotests Ton aus den Lautsprechern hören, fahren Sie mit Schritt 3 unten fort. * </p> <p><strong> * Hinweis: </strong> Wenn Sie keinen Ton aus den Lautsprechern hören, dann hören Sie hier auf, denn es liegt ein Hardwareproblem vor, das nur von einem spezialisierten Laptop-Techniker (Service) behoben werden kann. </p> <p><img src=\"images/image_thumb-22-211.png\" alt=\"HP Diagnostics - Component Test\" loading=\"lazy\"></p> <p> </p> <h6><br clear=\"all\"> Schritt 4. Setzen Sie den Soundkartentreiber zurück. </h6> <p> 1. Öffnen <strong> Gerätemanager </strong> . Das zu tun: </p> <blockquote><p> 1. Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-958.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Geben Sie im Feld &quot;Öffnen&quot; Folgendes ein: <strong> devmgmt.msc </strong> &amp; klicken <strong> OK </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-5-510.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Erweitern </strong> das <strong> Sound-, Video- und Gamecontroller. </strong></p> <p> 3. <strong> Rechtsklick </strong> auf der <strong> Realtek High-Definition-Audio </strong> Gerät und wählen Sie <strong> Eigenschaften. </strong></p> <p><img src=\"images/image_thumb-17-678.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. Klicken Sie auf der Registerkarte Treiber auf <strong> Rollback-Treiber </strong> Taste. <strong> * </strong></p> <p><strong> * Hinweis: </strong> Wenn die Schaltfläche „Treiber zurücksetzen“ inaktiv ist, fahren Sie mit dem nächsten Schritt fort. </p> <p><img src=\"images/image_thumb-18-178.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> </p> <p> 5. Wählen Sie einen Grund für das Rollback des Treiberpakets und klicken Sie auf <strong> Ja. </strong></p> <p><img src=\"images/image_thumb-19-167.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Wenn das Rollback des Treibers abgeschlossen ist, <strong> neu starten </strong> dein Computer. <br> 5. Fahren Sie nach dem Neustart fort und testen Sie den Ton von den Lautsprechern des Laptops. Wenn Sie immer noch keinen Ton über die Lautsprecher Ihres Laptops hören, fahren Sie mit dem nächsten Schritt fort. </p> <p> </p> <h6><br clear=\"all\"> Schritt 5. Ändern Sie den Soundkartentreiber. </h6> <p> 1. Öffnen <strong> Gerätemanager. </strong><br> 2. <strong> Erweitern </strong> das <strong> Sound-, Video- und Gamecontroller. <br> </strong> 3. <strong> Rechtsklick </strong> beim <strong> Realtek High-Definition-Audio </strong> Gerät, {oder am <strong> &#39;Realtek High Definition Audio (SST) </strong> Gerät} und wählen Sie <strong> Treiber aktualisieren. <br> </strong></p> <p><img src=\"images/image_thumb-6-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Wählen Sie <strong> Durchsuchen Sie meinen Computer nach Treibern. </strong></p> <p><img src=\"images/image_thumb-7-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Wählen Sie <strong> Lassen Sie mich aus einer Liste verfügbarer Treiber auf meinem Computer auswählen </strong> . </p> <p><img src=\"images/image_thumb-8-771.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> </p> <p> 6. Wenden Sie auf dem nächsten Bildschirm je nach Fall eine der folgenden Aktionen an: </p> <p><strong> Fall A. </strong> Wenn im Feld &quot;Kompatible Hardware anzeigen&quot; die Geräte &quot;High Definition Audio Device&quot; und &quot;Realtek High Definition Audio&quot; aufgeführt sind, wählen Sie die <strong> Hochauflösendes Audio-Gerät </strong> und klicke <strong> Nächster. </strong></p> <p><img src=\"images/image_thumb-20-130.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p><strong> Fall B. </strong> Wenn im Feld &quot;Kompatible Hardware anzeigen&quot; nur die <strong> &#39;Realtek High Definition Audio (SST) </strong> Gerät, dann: </p> <blockquote><p> ein. <strong> Deaktivieren Sie </strong> das <strong> Kontrollkästchen kompatible Hardware anzeigen. </strong></p></blockquote> <p><img src=\"images/image_thumb-9-565.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Wähle aus <strong> Realtek High-Definition-Audio </strong> Treiber und klicke <strong> Nächster. </strong></p></blockquote> <p><img src=\"images/image_thumb-10-248.png\" alt=\"FIX No Sound from Internal Speakers on Laptop\" loading=\"lazy\"></p> <p> </p> <p> 8. Wenn die Treiberinstallation abgeschlossen ist, <strong> neu starten </strong> dein Computer. <br> 9. Fahren Sie nach dem Neustart fort und testen Sie den Ton von den Lautsprechern des Laptops. </p> <p> </p> <h6><br clear=\"all\"> Schritt 6. Deinstallieren Sie den Soundkartentreiber und installieren Sie ihn erneut. </h6> <p> 1. Öffnen <strong> Gerätemanager. </strong><br> 2. <strong> Erweitern </strong> das <strong> Sound-, Video- und Gamecontroller. <br> </strong> 3. <strong> Rechtsklick </strong> beim <strong> Realtek High-Definition-Audio </strong> Gerät und wählen Sie <strong> Gerät deinstallieren. </strong></p> <p><img src=\"images/image_thumb-21-889.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. Nach der Deinstallation <strong> neu starten </strong> Ihren Computer und lassen Sie Windows die Soundtreiber automatisch installieren. Wenn dies nicht der Fall ist, navigieren Sie zu <strong> die Einstellungen </strong> &gt; <strong> Update und Sicherheit </strong> und erzwinge Windows, <strong> Auf Updates prüfen, </strong> oder fahren Sie mit Schritt 7 unten fort. </p> <p> </p> <h6><br clear=\"all\"> Schritt 7. Aktualisieren Sie die Soundkartentreiber. </h6> <p> Navigieren Sie zur Hersteller-Support-Site Ihres Laptops und laden Sie den neuesten Treiber für Ihre Soundkarte herunter und installieren Sie ihn. Wenn Sie auf der Support-Website des Herstellers keinen Treiber für die Soundkarte finden oder nach der Installation des neuen Treibers immer noch das Problem &quot;Kein Ton aus den internen Lautsprechern&quot; auftritt, versuchen Sie Folgendes, wenn Sie ein Realtek HD Audio-Gerät besitzen. </p> <p> 1. Lesen Sie die Anweisungen dazu <a href=\"https://www.repairwin.com/how-to-download-realtek-audio-manager-realtek-audio-drivers-windows-10-8-1-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Artikel </strong></a> zu <strong> herunterladen </strong> das <strong> Realtek HD-Audiotreiber v2.82. <br> </strong> 2. Fahren Sie nach dem Download fort und <strong> Installieren </strong> das <strong> Realtek HD-Audiotreiber. <br> </strong> 3. Nach der Installation <strong> neu starten </strong> Ihren PC und testen Sie den Ton aus den Lautsprechern. * </p> <p><strong> Abschließende Anmerkung: </strong> Wenn das Soundproblem der Lautsprecher weiterhin besteht, sehen Sie im Geräte-Manager nach. Wenn das Audiogerät als &quot;Realtek High Definition Audio (SST)&quot; aufgeführt ist, befolgen Sie die Anweisungen in Schritt 5 oben und ändern Sie die &quot;-Treiber zu &quot;Realtek High Definition Audio&quot;. </p> <p> Das war&#39;s Leute! Welche Methode hat bei Ihnen funktioniert? Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}