{"title":"FIX: 120 Tage Kulanzzeitraum auf RDS Server 2016/2012 zurücksetzen.","content":"<p> Wenn Sie zu Testzwecken einen RDS-Server 2016 installiert haben und der Kulanzzeitraum für die RDS-Lizenzierung abgelaufen ist, lesen Sie weiter unten, um zu erfahren, wie Sie den Kulanzzeitraum von 120 Tagen zurücksetzen. Wie Sie vielleicht wissen, haben Sie bei der Installation des RDS-Servers 2016 120 Tage Zeit, um die RD-Clientzugriffslizenzen (RD-CALs) zu installieren Desktop-Sitzung wurde getrennt, weil keine Remotedesktop-Lizenzserver verfügbar sind, um eine Lizenz bereitzustellen&quot;. </p> <p><img src=\"images/image_thumb-32-368.png\" alt=\"Reset 120 Days Grace Period on RDS Server 2012/2016\" loading=\"lazy\"></p> <p> </p> <h4> So setzen Sie die Kulanzfrist für die RDS-Lizenzierung auf Server 2012 oder 2016 zurück. * </h4> <p><strong> * Wichtig: </strong> Wenden Sie die nachstehenden Anweisungen nur an, wenn Sie RDS Server 2016 in einer Testumgebung verwenden. Wenn Sie den RDS-Server in einer Produktionsumgebung verwenden möchten, fahren Sie fort und kaufen Sie RD-CALs. </p> <p> So verlängern Sie die Kulanzfrist von 120 Tagen auf dem RDS-Lizenzserver: </p> <p> 1. Öffnen Sie den Registrierungseditor und navigieren Sie zu folgendem Schlüssel: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\\RCM\\GracePeriod </li> </ul> <p> 2. Klicken Sie mit der rechten Maustaste auf die Taste „GracePeriod“ und wählen Sie <strong> Berechtigungen. </strong></p> <p><img src=\"images/image_thumb-33-473.png\" alt=\"Reset Grace Period RDS 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Dann klick <strong> Fortgeschritten </strong> . </p> <p><img src=\"images/image_thumb-34-585.png\" alt=\"Reset RDS Grace Period\" loading=\"lazy\"></p> <p> </p> <p> 4. Wählen Sie die <strong> Administratoren </strong> Objekt und klicke <strong> Bearbeiten </strong> . </p> <p><img src=\"images/image_thumb-18-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Ändern Sie die Berechtigungen zu <strong> Volle Kontrolle </strong> und klicke <strong> OK. </strong></p> <p><img src=\"images/image_thumb-19-737.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Klicken Sie mit der rechten Maustaste auf den Wert &quot;L$RTMTIMEBOMB…&quot; und wählen Sie <strong> Löschen </strong> . </p> <p><img src=\"images/image_thumb-35-208.png\" alt=\"Reset RDS Licensing Grace Pariod\" loading=\"lazy\"></p> <p> </p> <p> 7. Schließen Sie den Registrierungseditor und starten Sie den RDS-Server neu. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}