{"title":"FIX: Adobe Acrobat Reader DC Neuere Version bereits installiert – Fehler 1722 (Gelöst)","content":"<p> Das folgende Problem ist auf einem Windows-basierten Computer aufgetreten: Adobe Acrobat Reader DC kann nicht installiert werden, weil &quot;Neuere Version bereits installiert&quot; ist. Das Seltsame an diesem Problem ist, dass Adobe Reader DC nicht auf dem Computer installiert wurde, da weder in den Programmen zum Hinzufügen/Entfernen noch auf der Festplatte Spuren des Adobe Reader-Programms oder Dateien vorhanden sind. </p> <p><img src=\"images/image_thumb-19-522.png\" alt=\"Adobe Acrobat Reader DC Newer Version already installed – Error 1722 - fix\" loading=\"lazy\"></p> <p> </p> <p> Darüber hinaus trat bei der Behebung des Installationsproblems &quot;eine neue Version ist bereits installiert&quot; des Adobe Reader DC-Programms die folgende Fehlermeldung auf, wenn versucht wurde, das Programm mit dem zu installieren <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Adobe Acrobat Reader DC-Verteilungspaket </a> : &quot;Fehler 1722. Es liegt ein Problem mit diesem Windows Installer-Paket vor. Ein als Teil des Setups ausgeführtes Programm wurde nicht wie erwartet beendet. Wenden Sie sich an Ihren Support oder den Paketanbieter....&quot; </p> <p><img src=\"images/image_thumb-20-398.png\" alt=\"Acrobat reader Error 1722 There is a problem with this Windows Installer package\" loading=\"lazy\"></p> <p> </p> <p> Dieses Tutorial enthält detaillierte Schritte und Anweisungen zum Beheben der folgenden Fehler bei der Installation von Adobe Reader DC: &quot;Eine neue Version wurde bereits installiert&quot; und &quot;Fehler 1722. Es liegt ein Problem mit diesem Windows Installer-Paket vor&quot; im Windows 10/8/7 OS. </p> <h4> So beheben Sie Probleme bei der Installation von Adobe Acrobat Reader DC: Neuere Version bereits installiert – Fehler 1722 Problem mit dem Installationspaket. </h4> <h6> Methode 1. Entfernen Sie Adobe Acrobat-Produkte mit dem Acrobat Cleaner Tool. </h6> <p> Der erste Schritt, um die Installationsprobleme von Adobe Reader DC zu beheben, besteht darin, alle vorherigen Installationen von Adobe Acrobat &amp; Adobe Reader zu entfernen, indem Sie die <a href=\"https://labs.adobe.com/downloads/acrobatcleaner.html\" target=\"_blank\" rel=\"nofollow noopener\"> Acrobat Reader DC &amp; Adobe Acrobat DC Cleanup-Dienstprogramm </a> * und dann zu installieren <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> Adobe Reader DC </a> . </p> <p> * Das Adobe Reader und Acrobat Cleaner Tool wurde entwickelt, um beschädigte Installationen von Adobe Acrobat und Adobe Reader zu bereinigen, einschließlich des Entfernens oder Reparierens beschädigter Dateien, des Entfernens oder Änderns von Registrierungseinträgen für Berechtigungen usw. </p> <p><img src=\"images/image_thumb-21-370.png\" alt=\"Acrobat Reader DC & Adobe Acrobat DC Cleanup tool\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Methode 2. Führen Sie die Problembehandlung für die Programminstallation und -deinstallation von Microsoft aus. </h6> <p> 1. Laden Sie die . herunter <a href=\"https://support.microsoft.com/en-us/help/17588/fix-problems-that-block-programs-from-being-installed-or-removed\" target=\"_blank\" rel=\"nofollow noopener\"> Fehlerbehebung bei der Programminstallation und -deinstallation </a> von Microsoft. <br> 2. Führen Sie das heruntergeladene Programm aus und klicken Sie im ersten Bildschirm auf Weiter. <br> 3. Wenn Sie dazu aufgefordert werden, klicken Sie auf <strong> Deinstallieren </strong></p> <p><img src=\"images/image_thumb-22-965.png\" alt=\"Program Install & Uninstall Troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 4. Wählen Sie die <strong> Adobe Acrobat Reader DC </strong> programmieren und auswählen <strong> Nächster </strong> .* Befolgen Sie dann die Anweisungen auf dem Bildschirm, um das Problem zu beheben. </p> <p> * Hinweis: Wenn Sie „Adobe Acrobat Reader DC“ nicht in der Liste sehen, klicken Sie auf <strong> Stornieren </strong> und führen Sie die Fehlerbehebung erneut aus. Wählen Sie dieses Mal jedoch &quot;Installieren&quot;, wenn Sie dazu aufgefordert werden. </p> <p><img src=\"images/image_thumb-23-917.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Methode 3. Installieren Sie Adobe Reader mit dem vollständigen Acrobat Reader DC-Installationspaket. </h6> <p> Versuchen Sie, Adobe Reader DC zu installieren, indem Sie das <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Adobe Acrobat Reader DC-Verteilungspaket </a> . </p> <p> </p> <h6> Methode 4. Starten Sie den Windows Installer-Dienst. </h6> <p> 1. Öffnen Sie die Systemsteuerung der Windows-Dienste: Um das zu tun: </p> <ul> <li> Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-698.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. </li> <li> Geben Sie in das Suchfeld Folgendes ein: <strong> dienste.msc </strong> &amp; klicken <strong> OK </strong> . </li> <li> (Akzeptieren Sie die UAC-Warnung, falls angezeigt). </li> </ul> <p><img src=\"images/image_thumb-12-635.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. Klicken Sie in der Systemsteuerung für Dienste mit der rechten Maustaste auf <strong> Windows Installer s </strong> Service und Klick <strong> Start </strong> . * </p> <p> * Hinweis: Wenn der Dienst gestartet ist, klicken Sie auf <strong> Neu starten </strong> . </p> <p><img src=\"images/image_thumb-24-258.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Methode 5. Registrieren Sie den Windows Installer-Dienst erneut. </h6> <p> 1. Öffnen <strong> Eingabeaufforderung als Administrator. <br> </strong> 2. Geben Sie die folgenden Befehle der Reihe nach ein (drücken Sie die Eingabetaste, nachdem Sie jeden Befehl eingegeben haben) </p> <ul> <li><strong> msiexec /unregister </strong></li> <li><strong> msiexec /regserver </strong></li> </ul> <p><img src=\"images/image_thumb-25-162.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Schließen Sie das Eingabeaufforderungsfenster und <strong> neu starten </strong> dein Computer. <br> 4. Versuchen Sie, Acrobat Reader DC zu installieren. </p> <p> </p> <h6> Methode 6. Installieren Sie Windows-Updates und Visual C++. </h6> <p> 1. Installieren Sie alle verfügbaren Windows-Updates. <br> 2. Installieren Sie sowohl die x86- als auch die x64-Version des <a href=\"https://www.microsoft.com/en-in/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Visual C++ Redistributable Packages für Visual Studio 2013 </a><br> 3. Installieren Sie sowohl die x86- als auch die x64-Version des <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48145\" target=\"_blank\" rel=\"nofollow noopener\"> Visual C++ Redistributable Packages für Visual Studio 2015 </a><br> 4. Versuchen Sie, Acrobat Reader DC zu installieren. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}