{"title":"FIX: PowerPoint Die angegebene Datei kann auf dem angegebenen MCI-Gerät nicht wiedergegeben werden (Gelöst)","content":"<p> Der PowerPoint-Fehler &quot;Die angegebene Datei kann auf dem angegebenen MCI-Gerät nicht wiedergegeben werden. Die Datei ist möglicherweise beschädigt, hat nicht das richtige Format oder es ist kein Dateihandler für dieses Format verfügbar&quot;, wenn Sie versuchen, eine eingebettete MP4-Datei abzuspielen, weil PowerPoint 2007 und PowerPoint 2003 unterstützen nur die Videoformate WMV, AVI, ASF und nicht das Videoformat MP4. </p> <p> Die einzige Möglichkeit, den PowerPoint-Fehler &quot;Angegebene Datei kann auf dem angegebenen MCI-Gerät nicht abgespielt werden&quot; zu umgehen, besteht darin, die MP4-Videodatei in das AVI-, WMV- oder ASF-Format zu konvertieren. </p> <p><img src=\"images/image_thumb-46-106.png\" alt=\"specified file cannot be played on the specified MCI device \" loading=\"lazy\"></p> <p> </p> <p> In diesem Tutorial zeige ich Ihnen, wie Sie mit dem kostenlosen Programm VLC Media Player eine MP4-Videodatei in das AVI-Videoformat konvertieren. </p> <h4> So konvertieren Sie MP4 in AVI und beheben das Problem &quot;Angegebene Datei kann auf dem angegebenen MCI-Gerät nicht abgespielt werden&quot; in PowerPoint. </h4> <p><strong> 1. </strong> Laden Sie den VLC Media Player herunter und installieren Sie ihn von: <a href=\"http://www.videolan.org/vlc/\" target=\"_blank\" rel=\"nofollow noopener\"> http://www.videolan.org/vlc/ </a></p> <p><strong> 2. </strong> Starten Sie dann VLC und wählen Sie im Hauptmenü <strong> Medien </strong> -&gt; <strong> Konvertieren/Speichern </strong></p> <p><img src=\"images/image_thumb-21-700.png\" alt=\"convert mp4 2 avi\" loading=\"lazy\"></p> <p> </p> <p><strong> 3 </strong><strong> . </strong> Klicken Sie auf der Registerkarte &quot;Datei&quot; auf die <strong> Hinzufügen </strong> Taste. </p> <p><img src=\"images/image_thumb-22-657.png\" alt=\"save mp4 to avi\" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Wählen Sie die MP4-Videodatei aus und klicken Sie auf <strong> Öffnen. </strong></p> <p> </p> <p><img src=\"images/image_thumb-47-802.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 5. </strong> Drücke den <strong> Konvertieren/Speichern </strong> Taste. </p> <p><img src=\"images/image_thumb-48-772.png\" alt=\"convert MP4 to AVI\" loading=\"lazy\"></p> <p> </p> <p><strong> 6. </strong> Wähle aus <strong> Video –H.264 +MP3 (MP4) </strong> Profil und klicken Sie dann auf <strong> Werkzeuge </strong> Symbol daneben. </p> <p><img src=\"images/image_thumb-49-637.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 7. </strong> Beim <strong> Verkapselung </strong> Tab-Check <strong> AVI </strong> . </p> <p><img src=\"images/image_thumb-55-132.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 9. </strong> Beim <strong> Video-Codec </strong> Registerkarte auswählen <strong> Behalten Sie die ursprüngliche Videospur bei </strong> . </p> <p><img src=\"images/image_thumb-56-268.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 9. </strong> Beim <strong> Audio-Codec </strong> Registerkarte, wählen Sie die folgenden Kodierungsparameter aus und klicken Sie dann auf <strong> speichern </strong> : </p> <ul> <li> Codec: <strong> MP3 </strong></li> <li> Beispielrate: <strong> 48000 Hz </strong></li> </ul> <p><img src=\"images/image_thumb-57-956.png\" alt=\"image\" loading=\"lazy\"></p> <p><strong> 10. </strong> Drücken Sie im Hauptfenster &quot;Konvertieren&quot; die <strong> Durchsuche </strong> Taste. </p> <p><strong> 11. </strong> Wählen Sie ein Ziel aus, um das neue (konvertierte) Video zu speichern, und geben Sie dann a . ein <strong> neuer Dateiname </strong> für die neue Videodatei und auch <strong> hinzufügen </strong> die Erweiterung <strong> .avi </strong> Am Ende. (z.B. &quot;Video Sample.avi&quot;). Wenn Sie fertig sind, klicken Sie auf <strong> speichern </strong> . </p> <p><img src=\"images/image_thumb-58-611.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 12. </strong> Drücken Sie schließlich im Fenster &quot;Konvertieren&quot; die <strong> Start </strong> -Taste und verlassen Sie dann VLC, um das MP4-Video in das AVI-Format zu konvertieren und zu konvertieren und zu speichern. </p> <p><img src=\"images/image_thumb-54-157.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> 13. </strong> Wenn die Konvertierung abgeschlossen ist, fügen Sie die gespeicherte AVI-Datei zu Ihrer PowerPoint-Präsentation hinzu und das Problem &quot;Die angegebene Datei kann auf dem angegebenen MCI-Gerät nicht wiedergegeben werden&quot; wäre behoben. </p> <p> Das ist alles! Hat es bei dir funktioniert? </p> <p> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}