{"title":"FIX: HP Smart Error – Druckerstatus unbekannt (Gelöst)","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben des <a href=\"https://www.hpsmart.com/us/en\" target=\"_blank\" rel=\"nofollow noopener\"> HP Smart </a> App-Fehler &quot;Druckerstatus unbekannt&quot; unter Windows 10 OS. Der &quot;Druckerstatus unbekannt&quot; in der HP SMART-Anwendung kann aus unbekannten Gründen erscheinen und verhindert, dass der Benutzer die Scan- oder Druckfunktion des Druckers verwenden kann. </p> <p> Problem im Detail: Auf einem Windows 10-Computer mit installiertem HP Drucker erscheint in der HP Smart App der Fehler &quot;Druckerstatus unbekannt&quot;, obwohl der Drucker problemlos aus dem Web oder anderen Anwendungen druckt. Das Hauptproblem bei diesem Fehler besteht darin, dass der Benutzer die Option SCANNEN in der HP Smart-Anwendung nicht zum Scannen eines Dokuments verwenden kann. </p> <p> </p> <p> </p> <p><img src=\"images/image_thumb-23-787.png\" alt=\"FIX: HP Smart \" printer status unknown loading=\"lazy\"></p> <h4> FIX: &quot;Druckerstatus unbekannt&quot; in der HP Smart App. (Windows10). </h4> <p> 1. Aus dem Startmenü <img src=\"images/image_thumb2_thumb_thumb-697.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> Klicken Sie auf Einstellungen <img src=\"images/image_thumb-66-822.png\" alt=\"image\" loading=\"lazy\"> und dann öffnen <strong> Apps </strong> . </p> <p><img src=\"images/image_thumb-25-257.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Klicken Sie auf <strong> HP Smart-App </strong> und dann klick <strong> Erweiterte Optionen </strong> . </p> <p><img src=\"images/image_thumb-26-912.png\" alt=\"FIX: Printer Status unknown on HP Smart app\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Klicken Sie auf das <strong> Zurücksetzen </strong> Taste. </p> <p><img src=\"images/image_thumb-27-494.png\" alt=\"Fix Printer Status Unknow on HP Smart app\" loading=\"lazy\"></p> <p> 4. Wenn das Zurücksetzen abgeschlossen ist, schließen Sie alle Fenster und öffnen Sie das <strong> HP Smart </strong> App. <br> 5. Normalerweise sollte der Fehler &quot;Druckerstatus unbekannt&quot; behoben sein. Klicken Sie einfach auf <strong> Einrichten </strong> um alle HP Smart-Funktionen zu aktivieren und fertig! * </p> <p><img src=\"images/image_thumb-28-849.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Hinweis: Wenn der HP Smart-Fehler &quot;Druckerstatus unbekannt&quot; weiterhin besteht, versuchen Sie Folgendes: </p> <blockquote><p> 1. <strong> Schließen </strong> der Computer. <br> 2. <strong> Trennen </strong> das <strong> Netzkabel vom Drucker </strong> 1 Minute lang. <br> 3. Nach 1 Minute, <strong> ein </strong> Ihre <strong> Computer </strong> . <br> 4. Nach dem Booten von Windows 10, <strong> Schließen Sie das Netzkabel des Druckers wieder an </strong> und prüfen Sie, ob der Fehler &quot;Druckerstatus unbekannt&quot; in der HP Smart-App behoben ist. Wenn der Fehler weiterhin besteht, deinstallieren Sie den Drucker und die Druckersoftware auf Ihrem PC und installieren Sie sie erneut. </p></blockquote> <p> Das war&#39;s Leute! Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}