{"title":"FIX: ERR_CONNECTION_CLOSED in Google Chrome (Gelöst)","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben des Chrome-Fehlers: &quot;ERR_CONNECTION_CLOSED&quot;. Der Fehler &quot;ERR_CONNECTION_CLOSED&quot; in Google Chrome bedeutet, dass Ihr Browser keine Verbindung zu der von Ihnen aufgerufenen Website herstellen kann, weil Ihre Internetverbindung unterbrochen wurde oder Ihr Internetdienstanbieter den Zugriff auf die Website gesperrt hat. </p> <h4> So beheben Sie: CHROME ERR_CONNECTION_CLOSED-Fehler. </h4> <p><strong> Rat: </strong> Bevor Sie den Chrome-Fehler &quot;ERR_CONNECTION_CLOSED&quot; beheben, indem Sie die folgenden Methoden anwenden, versuchen Sie Folgendes: <br> 1. Starten Sie Ihren Internet-Router neu. <br> 2. Versuchen Sie, andere Websites zu besuchen, um sicherzustellen, dass Ihre Internetverbindung funktioniert. <br> 3. Wenn Sie an Ihrer Stelle einen anderen Computer/ein anderes Gerät besitzen, versuchen Sie, die Website zu besuchen, auf der Sie den Fehler &quot;ERR_CONNECTION_CLOSED&quot; erhalten, um sicherzustellen, dass die Website, die Sie besuchen möchten, nicht von Ihrem ISP gesperrt ist. <br> 4. Wenn Sie eine VPN-Verbindung eingerichtet haben, trennen Sie diese. <br> 5. Deaktivieren Sie vorübergehend die Firewall-Anwendung (sofern vorhanden). </p> <p> </p> <h6> Methode 1. Scannen Sie Ihren Computer auf Malware und Viren. </h6> <p> Der erste Schritt vor der Behebung des Fehlers &quot;ERR_CONNECTION_CLOSED&quot; in Chrome besteht darin, sicherzustellen, dass Ihr System frei von Viren/Malware ist. Befolgen Sie für diese Aufgabe die Anweisungen in dieser Anleitung: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> So scannen Sie Ihren Computer auf Viren und andere bösartige Programme. </a></p> <p> </p> <h6> Methode 2. Setzen Sie die Chrome-Einstellungen auf die Standardeinstellungen zurück. </h6> <p> So setzen Sie Chrome auf die installierten Standardeinstellungen zurück: </p> <p> 1. Klicken Sie auf das Chrome-Menü <img src=\"images/image_thumb_thumb_thumb_thumb-657.png\" alt=\"image_thumb_thumb_thumb\" loading=\"lazy\"> Symbol in der oberen rechten Ecke) und wählen Sie <strong> die Einstellungen </strong> . </p> <p><img src=\"images/image_thumb31-256.png\" alt=\"chrome-options\" loading=\"lazy\"></p> <p> </p> <p> 2. At <strong> die Einstellungen </strong> Seite, scrollen Sie nach unten und klicken Sie auf <strong> Erweiterte Einstellungen anzeigen. </strong></p> <p><img src=\"images/image_thumb2_thumb-894.png\" alt=\"FIX ERR_CONNECTION_CLOSED CHROME\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Klicken Sie am Ende der Seite auf <strong> Setzen Sie die Einstellungen auf ihre ursprünglichen Standardeinstellungen zurück </strong> . </p> <p><img src=\"images/image_thumb5_thumb-475.png\" alt=\"image_thumb[5]\" loading=\"lazy\"></p> <p> </p> <p> 4. Endlich klick <strong> Einstellungen zurücksetzen </strong> . </p> <p><img src=\"images/image_thumb6_thumb-389.png\" alt=\"CHROME ERR_CONNECTION_CLOSED - FIX\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Neu starten </strong> Chrom. </p> <p> </p> <h6> Methode 3. Setzen Sie das Winsock-Protokoll zurück. </h6> <p> 1. Öffnen Sie die Eingabeaufforderung im Administratormodus. Das zu tun: </p> <blockquote><p> 1. Geben Sie im Suchfeld ein <strong> cmd </strong> oder <strong> Eingabeaufforderung </strong></p> <p> </p> <p> 2. Rechtsklick auf <strong> Eingabeaufforderung </strong> Ergebnis und auswählen <strong> Als Administrator ausführen. </strong></p></blockquote> <p><img src=\"images/image_thumb-38-412.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Geben Sie in der Eingabeaufforderung den folgenden Befehl ein und drücken Sie <strong> Eingeben </strong> . </p> <ul> <li><strong> netsh winsock reset katalog </strong></li> </ul> <p><img src=\"images/image_thumb_thumb-865.png\" alt=\"netsh winsock reset catalog\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Neu starten </strong> dein Computer. </p> <p> </p> <h6> Methode 4. Ändern Sie die DNS-Einstellungen. </h6> <p> – Verwenden Sie die öffentlichen DNS-Server von Google, um den Fehler &quot;ERR_CONNECTION_CLOSED&quot; in Chrome zu beheben. </p> <p> </p> <p><strong> So ändern Sie die DNS-Einstellungen: </strong></p> <p> 1. <strong> Rechtsklick </strong> auf das aktive Netzwerksymbol in der Taskleiste (oder gehen Sie zur Windows-Systemsteuerung) und klicken Sie auf <strong> Netzwerk-und Freigabecenter </strong></p> <p><img src=\"images/image_thumb14_thumb-1-229.png\" alt=\"image_thumb[14]\" loading=\"lazy\"></p> <p> </p> <p> 2. Wählen Sie die aktive Netzwerkkarte aus und klicken Sie dann auf <strong> Adapteroptionen ändern. </strong></p> <p><img src=\"images/image_thumb17_thumb-1-221.png\" alt=\"FIX CHROME ERR_CONNECTION_CLOSED\" loading=\"lazy\"></p> <p> </p> <p> 3. Klicken Sie mit der rechten Maustaste auf Ihren aktiven Netzwerkadapter und wählen Sie <strong> Eigenschaften </strong> . <br> 4. Wählen Sie die <strong> „Internetprotokoll Version 4 (TCP/IPv4) </strong> ’ und klicke <strong> Eigenschaften </strong></p> <p><img src=\"images/image_thumb18_thumb-1-963.png\" alt=\"image_thumb[18]\" loading=\"lazy\"></p> <p> </p> <p> 5a. Überprüf den &quot; <strong> Verwenden Sie die folgenden DNS-Serveradressen: </strong> &quot; Radio knopf. <br> 5b. Geben Sie die folgenden DNS-Serveradressen (die öffentlichen DNS-Server von Google) ein und klicken Sie auf <strong> OK. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> <p><img src=\"images/image_thumb20_thumb-1-904.png\" alt=\"image_thumb[20]\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> Neu starten </strong> dein Computer. </p> <p> </p> <h6> Methode 5. Verbinden Sie sich über Opera VPN mit dem Internet. </h6> <p> Wenn Ihr Internetdienstanbieter (ISP) den Zugriff auf die Site(s), die Sie besuchen möchten, blockiert hat, können Sie versuchen, eine Verbindung zu dieser Site(s) herzustellen, entweder über ein kostenloses (oder kostenpflichtiges) Virtual Private Network ( VPN)-Dienstanbieter oder indem Sie einfach den Opera-Browser verwenden, der über die integrierte VPN-Funktion verfügt. * </p> <p> * Hinweis: Wenn Sie sich über einen VPN-Dienst mit dem Internet verbinden, können Sie Ihre echte IP-Adresse Ihres Geräts &quot;maskieren&quot;, um so auszusehen, als wären Sie aus einem anderen Land online. </p> <p> So aktivieren Sie die VPN-Funktion im Opera-Browser: </p> <p> 1. Öffnen Sie das Opera-Menü und wählen Sie dann <strong> die Einstellungen </strong> . </p> <p><img src=\"images/image_thumb10_thumb-360.png\" alt=\"image_thumb[10]\" loading=\"lazy\"></p> <p> </p> <p> 2. Klicken Sie auf <strong> Fortgeschritten </strong> links und dann klick <strong> Eigenschaften </strong> . <br> 3. Ziehen Sie die <strong> VPN aktivieren </strong> wechseln zu <strong> AUF </strong> . </p> <p><img src=\"images/image_thumb13_thumb-171.png\" alt=\"image_thumb[13]\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Neu starten </strong> Oper. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}