{"title":"FIX: Prozess kann nicht beendet werden. Der Vorgang konnte nicht abgeschlossen werden, Zugriff wird verweigert.","content":"<p> Wenn Sie einen Prozess oder Dienst in Windows nicht beenden können, weil die Fehlermeldung &quot;Prozess kann nicht beendet werden. Der Vorgang konnte nicht abgeschlossen werden, Zugriff verweigert&quot; angezeigt wird, lesen Sie weiter unten, um zu erfahren, wie Sie das Problem beheben können. </p> <p><img src=\"images/image_thumb-10-874.png\" alt=\"Unable to terminate process. Access is denied\" loading=\"lazy\"></p> <p> Die übliche Möglichkeit, einen laufenden Prozess in Windows zu stoppen, besteht darin, den Task-Manager zu öffnen, mit der rechten Maustaste auf den Prozessnamen zu klicken und &quot;Task beenden&quot; auszuwählen. Aber wie Sie vielleicht wissen, ist es manchmal unmöglich, einen Prozess zu stoppen, weil Sie die Meldung &quot;Prozess kann nicht beendet werden. Zugriff verweigert&quot; erhalten. </p> <p> Ebenso kann ein ähnliches Problem auftreten, wenn Sie einen Dienst stoppen möchten und dies nicht können, weil die Option &quot;Stopp&quot; ausgegraut ist oder weil Sie beim Versuch, den Dienst zu stoppen, die Fehlermeldung &quot;Dienst kann nicht beendet werden. Zugriff verweigert&quot; erhalten Bedienung. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"Unable to Terminate Service\" loading=\"lazy\"></p> <p> In diesem Tutorial erfahren Sie, wie Sie Dienste oder Prozesse beenden, die Sie nicht mit den üblichen Methoden beenden können. </p> <h4> So erzwingen Sie das Beenden eines Dienstes oder Programms von PowerShell in Windows 10/8/7 OS. </h4> <ul> <li><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> So erzwingen Sie das Schließen einer Anwendung aus PowerShell. </a></li> <li><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> So erzwingen Sie das Schließen eines Dienstes aus PowerShell. </a></li> </ul> <h6></h6> <h6> Teil 1. So beenden Sie eine Anwendung aus PowerShell. </h6> <p> 1. Öffnen Sie PowerShell als Administrator. </p> <p> 2. Geben Sie in PowerShell den folgenden Befehl ein, um die Prozess-ID (PID) abzurufen. </p> <ul> <li><strong> Aufgabenliste </strong></li> </ul> <p><img src=\"images/image_thumb-12-275.png\" alt=\"Terminate process from powershell\" loading=\"lazy\"></p> <p> </p> <p> 3. Notieren Sie den Namen der Anwendung, die Sie löschen möchten, und geben Sie dann den folgenden Befehl ein, um alle Instanzen der Anwendung zu schließen. * </p> <ul> <li> Stopp-Prozess -Name &quot;Application_Name&quot; </li> </ul> <p> * Hinweis: Geben Sie bei Application_Name den Namen der Anwendung ohne die Erweiterung .exe ein. Wenn Sie beispielsweise das Schließen der Anwendung &quot;chrome.exe&quot; erzwingen möchten, geben Sie Folgendes ein: </p> <ul> <li><em> Stop-Prozess -Name &quot;chrome&quot; </em></li> </ul> <p><img src=\"images/image_thumb-16-974.png\" alt=\"Stop Program PowerShell\" loading=\"lazy\"></p> <p> </p> <p><strong> TRINKGELD: </strong> Wenn Sie eine einzelne Instanz eines Programms beenden möchten, geben Sie den folgenden Befehl ein: </p> <ul> <li> Stop-Prozess -ID PID </li> </ul> <p> * Hinweis: Geben Sie bei PID die eindeutige Nummer der Programminstanz ein. </p> <p> </p> <h6> Teil 2. So beenden Sie einen Dienst aus PowerShell. </h6> <p> 1. Öffnen Sie den Task-Manager und aus dem <strong> Dienstleistungen </strong> Registerkarte, beachten Sie die <strong> PID </strong> des Dienstes, den Sie beenden möchten. </p> <p><em> z.B. In diesem Beispiel erzwingen wir das Beenden des Dienstes &quot;AdobeARMservice&quot; mit PID <strong> 1640 </strong> . </em></p> <p><img src=\"images/image_thumb-14-150.png\" alt=\"Force Stop Service PowerShell\" loading=\"lazy\"></p> <p> </p> <p> 2. Dann lauf <strong> PowerShell als Administrator </strong> und geben Sie diesen Befehl ein: </p> <ul> <li> kill -id PID </li> </ul> <p> * Hinweis: Geben Sie als PID die PID ein, die Sie im Task-Manager bemerkt haben. In diesem Beispiel lautet der Befehl: </p> <ul> <li><em> kill -id 1640 </em></li> </ul> <p><img src=\"images/image_thumb-15-147.png\" alt=\"Kill Running Service from PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}