{"title":"FIX: Diese Website kann in Chrome nicht erreicht werden (Gelöst)","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben des Chrome-Fehlers: &quot;Diese Website kann nicht erreicht werden&quot;. Die Fehlermeldung &quot;Diese Website kann nicht erreicht werden&quot; in Chrome bedeutet, dass Ihr Browser keine Verbindung mit der Website herstellen kann, auf die Sie zugreifen möchten, weil Ihre Internetverbindung unterbrochen wurde oder die gewünschte Website nicht existiert. </p> <p> </p> <p><img src=\"images/image_thumb-14-568.png\" alt=\"FIX: This site can't be reached in Chrome \" loading=\"lazy\"></p> <p> Befolgen Sie die folgenden Anweisungen, um den Chrome-Fehler &quot;Diese Website kann nicht erreicht werden&quot; zu beheben: </p> <h4> So beheben Sie den Google Chrome-Fehler: Diese Website kann nicht erreicht werden. </h4> <p><strong> Rat: </strong> Führen Sie die folgenden Schritte aus, bevor Sie mit den folgenden Methoden fortfahren: <br> 1. Stellen Sie sicher, dass Sie die Adresse der Website richtig eingeben. <br> 2. Starten Sie Ihren Internet-Router neu. <br> 3. Versuchen Sie, andere Websites zu besuchen, um sicherzustellen, dass Ihre Internetverbindung funktioniert. <br> 4. Wenn Sie an Ihrer Stelle einen anderen Computer/ein anderes Gerät besitzen, versuchen Sie, die Website zu besuchen, auf der Sie die Fehlermeldung „Diese Website kann nicht erreicht werden“ erhalten, um sicherzustellen, dass die Website, die Sie besuchen möchten, nicht blockiert ist von Ihrem ISP. <br> 5. Wenn Sie eine VPN-Verbindung eingerichtet haben, trennen Sie diese. </p> <p> </p> <h6> Methode 1. Ändern Sie die DNS-Einstellungen. </h6> <p> Die nächste Methode zum Beheben des Google Chrome-Fehlers &quot;Diese Site kann nicht erreicht werden&quot; besteht darin, die DNS-Einstellungen zu ändern und die öffentlichen DNS-Server von Google zu verwenden. Das zu tun: </p> <p> 1. <strong> Rechtsklick </strong> auf das aktive Netzwerksymbol in der Taskleiste (oder gehen Sie zur Windows-Systemsteuerung) und klicken Sie auf <strong> Netzwerk-und Freigabecenter </strong></p> <p><img src=\"images/image_thumb14_thumb-1-913.png\" alt=\"image_thumb[14]\" loading=\"lazy\"></p> <p> </p> <p> 2. Wählen Sie die aktive Netzwerkkarte aus und klicken Sie dann auf <strong> Adapteroptionen ändern. </strong></p> <p><img src=\"images/image_thumb17_thumb-1-994.png\" alt=\"FIX CHROME ERR_CONNECTION_CLOSED\" loading=\"lazy\"></p> <p> 3. Klicken Sie mit der rechten Maustaste auf Ihren aktiven Netzwerkadapter und wählen Sie <strong> Eigenschaften </strong> . <br> 4. Wählen Sie die <strong> &#39;Internetprotokoll Version 4 (TCP/IPv4) </strong> &#39; und klicke <strong> Eigenschaften </strong></p> <p><img src=\"images/image_thumb18_thumb-1-801.png\" alt=\"image_thumb[18]\" loading=\"lazy\"></p> <p> 5a. Überprüf den &quot; <strong> Verwenden Sie die folgenden DNS-Serveradressen: </strong> &quot; Radio knopf. <br> 5b. Geben Sie die folgenden DNS-Serveradressen (öffentliche DNS-Server von Google) ein und klicken Sie auf <strong> OK. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> <p><img src=\"images/image_thumb20_thumb-1-963.png\" alt=\"image_thumb[20]\" loading=\"lazy\"></p> <p> 6. <strong> Neu starten </strong> dein Computer. </p> <p> </p> <h6> Methode 2. TCP/IP-Einstellungen und WINSOCK zurücksetzen. </h6> <p> 1. Öffnen Sie die Eingabeaufforderung im Administratormodus. Das zu tun: </p> <blockquote><p> 1. Geben Sie im Suchfeld ein <strong> cmd </strong> oder <strong> Eingabeaufforderung </strong></p> <p> 2. Rechtsklick auf <strong> Eingabeaufforderung </strong> Ergebnis und auswählen <strong> Als Administrator ausführen. </strong></p></blockquote> <p><img src=\"images/image_thumb-38-528.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Geben Sie in der Eingabeaufforderung den folgenden Befehl ein und drücken Sie <strong> Eingeben </strong> . </p> <ul> <li> ipconfig /release </li> </ul> <p><img src=\"images/image_thumb11_thumb-364.png\" alt=\"image_thumb[11]\" loading=\"lazy\"></p> <p> </p> <p> 3. Geben Sie nun die folgenden Befehle der Reihe nach ein (drücken Sie <strong> Eingeben </strong> nach jedem Befehl).: </p> <ul> <li> ipconfig /flushdns </li> <li> ipconfig /erneuern </li> <li> netsh winsock zurücksetzen </li> </ul> <p><img src=\"images/image_thumb12_thumb-449.png\" alt=\"image_thumb[12]\" loading=\"lazy\"></p> <p> 3. <strong> Neu starten </strong> dein Computer. </p> <p> </p> <h6> Methode 3. Setzen Sie die Chrome-Einstellungen zurück. </h6> <p> So setzen Sie Chrome auf die installierten Standardeinstellungen zurück: </p> <p> 1. Klicken Sie auf das Chrome-Menü <img src=\"images/image_thumb_thumb_thumb_thumb-979.png\" alt=\"image_thumb_thumb_thumb\" loading=\"lazy\"> Symbol in der oberen rechten Ecke) und wählen Sie <strong> die Einstellungen </strong> . </p> <p><img src=\"images/image_thumb31-186.png\" alt=\"chrome-options\" loading=\"lazy\"></p> <p> 2. At <strong> die Einstellungen </strong> Seite, scrollen Sie nach unten und klicken Sie auf <strong> Erweiterte Einstellungen anzeigen. </strong></p> <p><img src=\"images/image_thumb2_thumb-809.png\" alt=\"FIX ERR_CONNECTION_CLOSED CHROME\" loading=\"lazy\"></p> <p> </p> <p> 3. Klicken Sie am Ende der Seite auf <strong> Setzen Sie die Einstellungen auf ihre ursprünglichen Standardeinstellungen zurück </strong> . </p> <p><img src=\"images/image_thumb5_thumb-192.png\" alt=\"image_thumb[5]\" loading=\"lazy\"></p> <p> 4. Endlich klick <strong> Einstellungen zurücksetzen </strong> . </p> <p><img src=\"images/image_thumb6_thumb-812.png\" alt=\"CHROME ERR_CONNECTION_CLOSED - FIX\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Neu starten </strong> Chrom. </p> <p> </p> <h6> Methode 4. Scannen Sie Ihren Computer auf Malware und Viren. </h6> <p> Die letzte Methode zum Beheben des Fehlers &quot;Diese Site kann nicht erreicht werden&quot; in Chrome besteht darin, sicherzustellen, dass Ihr System frei von Viren/Malware ist. Befolgen Sie für diese Aufgabe die Anweisungen in dieser Anleitung: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> So scannen Sie Ihren Computer auf Viren und andere bösartige Programme. </a></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}