{"title":"FIX: Windows 10 Startmenü, Einstellungen, Cortana oder Taskleiste funktionieren nicht. (Gelöst)","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben der folgenden Probleme in Windows 10: Startmenü wird nicht geöffnet, Cortana Search funktioniert nicht, Einstellungs-App wird nicht gestartet, Taskleistensymbole werden nicht geöffnet. </p> <p> Viele Windows 10-Benutzer haben Probleme mit dem Startmenü, der Taskleiste, Cortana und den Einstellungen gemeldet, daher liste ich in diesem Handbuch die gängigsten Methoden zur Lösung der oben genannten Probleme auf. </p> <h2> So beheben Sie: Windows 10-Taskleiste, Startmenü, Einstellungen oder Cortana-Probleme. </h2> <h3> Methode 1. Deinstallieren Sie das neueste Windows 10-Update. </h3> <p> Viele Benutzer haben berichtet, dass die in diesem Artikel erwähnten Probleme nach der Deinstallation behoben sind <strong><a href=\"https://support.microsoft.com/en-us/topic/august-11-2020-kb4566782-os-build-19041-450-ec5cf4b6-86ed-b0d3-539c-5fbe1b17f56a\" target=\"_blank\" rel=\"nofollow noopener\"> KB4566782 </a></strong> Aktualisieren. </p> <p> Wenn Sie das Update KB4566782 in der Liste der installierten Updates nicht finden können, überprüfen und installieren Sie alle verfügbaren Updates und wenn das Problem weiterhin besteht, versuchen Sie es <strong><a href=\"https://www.repairwin.com/how-to-uninstall-updates-in-windows-10/#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> deinstallieren Sie die neuesten installierten Updates. </a></strong></p> <h3> Methode 2. Starten Sie Windows 10 im abgesicherten Modus neu. </h3> <p> 1. Drücken Sie die Windows <img src=\"images/image_thumb8_thumb_thumb-268.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ <strong> msconfig </strong> und drücke <strong> Eingeben </strong> . </p> <p><img src=\"images/image_thumb-47-537.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. At <strong> Booten </strong> Registerkarte wählen Sie die <strong> Sicherer Start </strong> Option, dann klicke <strong> OK </strong> und starten Sie Ihren Computer neu. </p> <p><img src=\"images/image_thumb-48-665.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 4. Überprüfen Sie nach dem Neustart und im abgesicherten Modus, ob Ihre Probleme weiterhin bestehen. <br> 5. Führen Sie dann das &#39;msconfig&#39;-Tool erneut aus und <strong> Allgemeines </strong> Registerkarte, überprüfen Sie die <strong> Normaler Start </strong> und klicke <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-859.png\" alt=\"normal startup windows\" loading=\"lazy\"></p> <p> 6. <strong> Neu starten </strong> dein Computer. <br> 7. Überprüfen Sie nach dem Neustart, ob das Problem weiterhin besteht, andernfalls fahren Sie mit der nächsten Methode fort. </p> <p> </p> <h2> Methode 3. Führen Sie einen sauberen Neustart durch. </h2> <p> 1. Führen Sie das &#39;msconfig&#39;-Tool aus. <br> 2. Auf der Registerkarte Dienste, <strong> prüfen </strong> das <strong> Verstecke alle Microsoft-Dienste </strong> Kontrollkästchen und drücken Sie dann <strong> Alle deaktivieren </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-333.png\" alt=\"clean boot windows\" loading=\"lazy\"></p> <p> </p> <p> 3. Wählen Sie dann die <strong> Anlaufen </strong> Tab und klicken Sie <strong> Öffnen Sie den Task-Manager. <br> </strong> 4. <strong> </strong> Wählen Sie nacheinander alle aufgelisteten Programme aus und klicken Sie auf <strong> Deaktivieren. </strong></p> <p><img src=\"images/image_thumb-1-399.png\" alt=\"clean boot windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Wenn Sie fertig sind, schließen Sie dieses Fenster und klicken Sie dann auf <strong> OK </strong> im Dienstprogramm &#39;Systemkonfiguration&#39;, um <strong> Neu starten </strong> dein Computer. <br> 6. Wenn Ihr Computer nach dem Neustart einwandfrei und ohne Probleme funktioniert*, öffnen Sie das Dienstprogramm &#39;Systemkonfiguration&#39; (msconfig) erneut und aktivieren Sie nacheinander alle deaktivierten Programme und starten Sie Ihren PC neu, bis Sie herausfinden, welches Programm das Problem verursacht Problem. </p> <p> * Hinweis: Wenn das Problem auch im Clean Boot-Status weiterhin besteht, fahren Sie mit der nächsten Methode fort. </p> <h3> Methode 4. Installieren Sie alle integrierten Windows 10-Apps neu und registrieren Sie sie erneut. </h3> <p> Die nächste Methode zum Beheben von Problemen mit der Taskleiste, dem Startmenü, Cortana usw. in Windows 10 besteht darin, alle integrierten Apps neu zu installieren und neu zu registrieren. </p> <p> 1. Öffnen Sie PowerShell als Administrator. Das zu tun: </p> <blockquote><p> 1. At <strong> Cortana </strong> &#39;s Suchfeld, geben Sie ein <strong> Power Shell <br> </strong> 2. Rechtsklick auf <strong> Windows PowerShell </strong> Ergebnis und auswählen <strong> Als Administrator ausführen. </strong></p></blockquote> <p><img src=\"images/image_thumb-51-691.png\" alt=\"FIX: Windows 10 Start Menu, Settings, Cortana or Taskbar icons Not Working.\" loading=\"lazy\"></p> <p> </p> <p> 3. Geben Sie in PowerShell (Kopieren und Einfügen) den folgenden Befehl ein und drücken Sie <strong> Eingeben </strong> : </p> <ul> <li> Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register &quot;$($_.InstallLocation)\\AppXManifest.xml&quot;} </li> </ul> <p><img src=\"images/image_thumb-2-985.png\" alt=\"register re-install windows 10 apps\" loading=\"lazy\"></p> <p> 4. Warten Sie, bis der Befehl ausgeführt wird, und ignorieren Sie die Fehler (in roten Buchstaben). <br> 5. <strong> Neu starten </strong> Ihren Computer und überprüfen Sie dann, ob Ihr Problem behoben ist. </p> <p> </p> <h3> Methode 5. Erstellen Sie ein neues Konto. </h3> <p> Eine andere Methode, um mehrere Probleme in Windows 10 zu beheben, besteht darin, ein neues Konto zu erstellen und Ihre persönlichen Dateien und Daten auf das neue Konto zu übertragen. Das zu tun: </p> <p> 1. Öffnen <strong> Eingabeaufforderung als Administrator </strong> . <br> 2. Geben Sie an der Eingabeaufforderung den folgenden Befehl ein und drücken Sie <strong> Eingeben </strong> : </p> <ul> <li><strong> net-Benutzerkonto-Passwort /add </strong></li> </ul> <p> * Hinweis: Ersetzen Sie bei obigem Befehl die Felder &quot;Konto&quot; &amp; &quot;Passwort&quot; durch Ihre Wahl. </p> <p> z.B. Wenn Sie ein neues Konto mit dem Benutzernamen &quot;Admin1&quot; und dem Passwort &quot;Admin123&quot; erstellen möchten, geben Sie Folgendes ein: <em> Netzbenutzer Admin1 Admin123 /add </em></p> <p><img src=\"images/image_thumb-3-388.png\" alt=\"add user windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Fahren Sie dann fort und fügen Sie das neue Konto mit diesem Befehl zur Gruppe Administratoren hinzu: </p> <ul> <li><strong> net localgroup-Administratorkonto /add </strong></li> </ul> <p> z.B. In unserem Beispiel lautet der Befehl: <em> net localgroup-Administratoren Admin1 /add </em></p> <p><img src=\"images/image_thumb-4-429.png\" alt=\"fix windows 10 start menu, cortana, settings\" loading=\"lazy\"></p> <p> </p> <p> 4. Schließen Sie das Eingabeaufforderungsfenster und <strong> neu starten </strong> dein Computer. <br> 5. Melden Sie sich nach dem Neustart mit einem neuen Konto an. <br> 6. Prüfen Sie, ob das Problem weiterhin besteht. Wenn das Problem behoben ist, übertragen Sie Ihre Daten und Dateien auf das neue Konto und Sie sind fertig. </p> <p> </p> <h3> Methode 6. Reparieren Sie Windows 10. </h3> <p> Die letzte Methode zum Beheben von Windows 10-Problemen besteht darin, <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Reparieren Sie Windows 10 mit In-Place-Upgrade </a> . </p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}