{"title":"FIX: Wir konnten keine Verbindung zum Update-Dienst herstellen. Stellen Sie sicher, dass Sie in Windows 10 mit dem Internet verbunden sind (Gelöst)","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben des folgenden Fehlers im Windows 10-Update: &quot;Wir konnten keine Verbindung zum Update-Dienst herstellen. Wir werden es später erneut versuchen, oder Sie können es jetzt überprüfen. Wenn es immer noch nicht funktioniert, stellen Sie sicher, dass Sie&quot; wieder mit dem Internet verbunden.&quot; </p> <p><img src=\"images/image_thumb-46-713.png\" alt=\"We couldn't connect to the update service. Make sure you're connected to the Internet in Windows 10 update\" loading=\"lazy\"></p> <p> </p> <p> Microsoft ist sich des oben genannten Update-Problems bewusst und wie es ist <a href=\"https://support.microsoft.com/en-us/help/4464619/windows-10-update-history\" target=\"_blank\" rel=\"nofollow noopener\"> angekündigt am 4. Februar 2019 </a> : &quot;Der Windows Update-Dienst war am 29. Januar 2019 von einem Datenkorruptionsproblem bei einem globalen Ausfall eines externen DNS-Dienstanbieters betroffen. Das Problem wurde am selben Tag behoben und Windows Update funktioniert jetzt normal, aber einige Kunden haben es weiterhin getan Probleme bei der Verbindung mit dem Windows Update-Dienst melden. Wir gehen davon aus, dass diese Probleme verschwinden werden, wenn Downstream-DNS-Server mit den korrigierten Windows Update-DNS-Einträgen aktualisiert werden&quot;. </p> <p> Da viele Benutzer berichteten, dass das Problem noch nicht behoben wurde und sich auch auf Windows Defender (Defender-Definitionen können nicht aktualisiert werden) und den Microsoft Store (Store funktioniert nicht) auswirkt, lesen Sie die folgenden Anweisungen, um Aktualisierungsprobleme in Windows 10 zu beheben, oder im Windows Defender und im Windows Store. </p> <h2> So beheben Sie: Es konnte keine Verbindung zum Update-Dienst in Windows 10 hergestellt werden. </h2> <h6> Methode 1. DNS-Einstellungen ändern </h6> <p> 1. <strong> Rechtsklick </strong> auf der <strong> Netzwerk </strong> Symbol <img src=\"images/image_thumb-42-546.png\" alt=\"image\" loading=\"lazy\"> in der Taskleiste und klicken Sie auf <strong> Öffnen Sie das Netzwerk- und Freigabecenter. </strong> * </p> <p><img src=\"images/image_thumb-104-256.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> </p> <p> 2. Wählen Sie <strong> Ethernet </strong> (oder Wi-Fi) auf der linken Seite und klicken Sie dann im Abschnitt &quot;Zugehörige Einstellungen&quot; auf <strong> Adapteroptionen ändern </strong> . </p> <p><img src=\"images/image_thumb-43-363.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3. Klicken Sie mit der rechten Maustaste auf den aktiven Netzwerkadapter (Ethernet oder Wi-Fi) und wählen Sie <strong> Eigenschaften </strong> . </p> <p><img src=\"images/image_thumb-44-396.png\" alt=\"network properties\" loading=\"lazy\"></p> <p> 4. Wählen Sie die <strong> „Internetprotokoll Version 4 (TCP/IPv4) </strong> ’ und klicke <strong> Eigenschaften </strong></p> <p><img src=\"images/image_thumb-106-941.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 5. Bei den Eigenschaften von Internet Protocol Version 4 (TCP/IPv4): </p> <blockquote><p> ein. <strong> Prüfen </strong> das <strong> Verwenden Sie die folgenden DNS-Serveradressen: </strong> Radio knopf. <br> b. Geben Sie dann die folgenden DNS-Serveradressen (öffentliche DNS-Server von Google) ein und klicken Sie auf <strong> OK. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> </blockquote> <p><img src=\"images/image_thumb-109-998.png\" alt=\"google dns settings\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Neu starten </strong> dein Computer. </p> <p> </p> <h6> Methode 2. Führen Sie die Windows Update-Problembehandlung aus. </h6> <h6> Methode 2. Führen Sie die Windows Update-Problembehandlung aus. </h6> <p> 1. Navigieren Sie zu Windows <strong> Schalttafel </strong> , setzen Sie &#39;Anzeigen nach&#39; auf <strong> Kleine Icons </strong> und öffnen <strong> Fehlerbehebung. </strong></p> <p><img src=\"images/image_thumb-5-213.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Klicken Sie in den Fehlerbehebungsoptionen auf <strong> Beheben Sie Probleme mit Windows Update. </strong></p> <p><img src=\"images/image_thumb-9-911.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Klicken Sie auf <strong> Nächster </strong> um Probleme mit Windows-Updates zu beheben. </p> <p><img src=\"images/image_thumb-8-372.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Wenn der Fehlerbehebungsprozess abgeschlossen ist, <strong> schließen </strong> der Troubleshooter und <strong> neu starten </strong> dein PC. <br> 6. Suchen Sie nach Updates. </p> <h6> Methode 3. <strong> Löschen Sie den Update Store-Ordner. </strong></h6> <p> Das „C:\\Windows\\SoftwareDistribution“ ist der Ort, an dem Windows die Windows-Updates speichert. Oft wird dieser Ordner beschädigt und Sie müssen ihn neu erstellen, um Updates herunterzuladen und von Grund auf neu zu installieren. Um den Ordner „SoftwareDistribution“ neu zu erstellen (neu zu erstellen), führen Sie die folgenden Schritte aus: </p> <p><strong> Schritt 1: Beenden Sie den Windows Update-Dienst. </strong></p> <p> 1. Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-610.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Geben Sie in das Suchfeld Folgendes ein: <strong> dienste.msc </strong> &amp; klicken <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-12-860.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 3. Suchen Sie in der Systemsteuerung &quot;Dienste&quot; das <strong> Windows Update </strong> Bedienung. <br> 4. Klicken Sie mit der rechten Maustaste auf <strong> Windows Update </strong> bedienen und auswählen <strong> Halt </strong> . </p> <p><img src=\"images/image_thumb-9-707.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Schritt 2: Löschen Sie den SoftwareDistribution-Ordner. </strong></p> <p> 1. Öffnen Sie den Windows Explorer und navigieren Sie zu: <strong> C:\\Windows </strong> Mappe. <br> 2. Finden und <strong> Löschen </strong> das <strong> Softwareverteilung </strong> Ordner (oder benennen Sie ihn um, z. </p> <p> </p> <p><img src=\"images/image_thumb-10-148.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p><strong> Schritt 3: Starten Sie den Windows Update-Dienst. </strong></p> <p> 1. Öffnen Sie die Systemsteuerung der Windows-Dienste. <br> 2. Klicken Sie mit der rechten Maustaste auf <strong> Windows Update </strong> bedienen und auswählen <strong> Start </strong> . </p> <p><img src=\"images/image_thumb-11-233.png\" alt=\"start windows update service\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Schritt 4: Überprüfen und installieren Sie das Windows 10-Update. </strong></p> <p> 1. Navigieren Sie zu <strong> die Einstellungen </strong> -&gt; <strong> Update und Sicherheit </strong> und klicke <strong> Auf Updates prüfen </strong> . </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}