{"title":"FIX: Windows 10 Update konnte Avira AntiVir nicht deinstallieren (Gelöst)","content":"<p> Auf einem Windows 10-Computer erscheint beim Versuch, Windows 10 auf Version 1803 oder 1809 zu aktualisieren, die folgende Meldung: &quot;Einige Apps müssen deinstalliert werden: Diese Programme müssen deinstalliert werden, da sie nicht mit dem Upgrade kompatibel sind: Avira Antivirus&quot; und beim Drücken der Schaltfläche &quot;Deinstallieren und fortfahren&quot; erscheint die Fehlermeldung: &quot;Diese Apps konnten nicht deinstalliert werden: Avira AntiVir&quot;. Das Lustige an diesem Problem ist, dass das Avira Antivir (Antivirus) nicht auf dem PC installiert ist (nicht unter Installierte Programme aufgeführt). </p> <p><img src=\"images/image_thumb-10-929.png\" alt=\"Windows 10 Update Couldn't uninstall Avira AntiVir\" loading=\"lazy\"></p> <p> Das Problem &quot;Konnte Avira AntiVir nicht deinstallieren&quot; während des Upgrades auf Windows 10 v1803 tritt auf, weil das Update-Programm einige Dateien auf Ihrem PC findet, die mit Avira AntiVir verbunden sind und die während der Avira-Deinstallation nicht entfernt wurden. * </p> <p> * Hinweis: Wenn das Programm &quot;Avira Antivirus&quot; wirklich auf Ihrem Computer installiert ist, deinstallieren Sie es mit der Option &quot;Programme und Funktionen&quot; in der Systemsteuerung und aktualisieren Sie Ihr System dann auf Windows 10 v1803 (oder 1809). Laden Sie nach dem Upgrade die neueste Version von Avira Antivirus herunter und installieren Sie sie auf Ihrem System. </p> <h4> So beheben Sie den Windows 10 Update-Fehler: Avira AntiVir konnte nicht deinstalliert werden. </h4> <p> </p> <p> 1. Starten Sie Windows in <strong> Sicherheitsmodus </strong> . Das zu tun: </p> <ul> <li> <ul> <li> Drücken Sie die Windows <img src=\"images/image_thumb8_thumb_thumb-432.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. </li> <li> Art <strong> msconfig </strong> und drücke <strong> Eingeben </strong> . </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-47-667.png\" alt=\"msconfig\" loading=\"lazy\"></p> <ul> <li> <ul> <li> Beim <strong> Booten </strong> Registerkarte wählen Sie die <strong> Sicherer Start </strong> Option, dann klicke <strong> OK </strong> und starten Sie Ihren Computer neu. </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-48-342.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Öffnen Sie nach dem Neustart den Datei-Explorer und löschen Sie die <strong> avipbb.sys </strong> Datei von den folgenden Speicherorten: </p> <ul> <li> C:\\Windows\\System32\\Treiber </li> <li> C:\\Windows\\SysWOW64\\Treiber </li> </ul> <p> </p> <p> 3. Fahren Sie fort, um alle anderen Dateien mit dem Namen von den oben genannten Speicherorten zu löschen <strong> avipbb </strong> trotz Verlängerung. </p> <p> 4. Dann löschen Sie die <strong> Avira </strong> Ordner von folgendem Speicherort: </p> <ul> <li> (Windows 64-Bit) : C:\\Programme (x86)\\ <strong> Avira\\Antivirus </strong></li> <li> (Windows 32-Bit): C:\\Programme\\ <strong> Avira\\Antivirus </strong></li> </ul> <p> 5. Laufen <strong> msconfig </strong> nochmal. <br> 6. Klicken Sie auf der Registerkarte Allgemein auf Normaler Start und klicken Sie auf <strong> OK </strong> , um Ihren Computer normal neu zu starten. </p> <p><img src=\"images/image_thumb-11-949.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Überprüfen und installieren Sie Updates. * </p> <p> * Hinweis: Wenn während des Updates immer noch der Fehler „Konnte Avira AntiVir nicht deinstallieren“ auftritt, laden Sie das . herunter und führen Sie es aus <a href=\"https://www.avira.com/en/support-download-avira-registrycleaner/1//\" target=\"_blank\" rel=\"nofollow noopener\"> Avira Registry Cleaner </a> . </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}