{"title":"Kontaktformular 7 funktioniert nicht: Beim Senden Ihrer Nachricht ist ein Fehler aufgetreten. Bitte versuchen Sie es später erneut. (Gelöst)","content":"<p> Wenn das Kontaktformular 7 auf Ihrer WordPress-Site nicht funktioniert, lesen Sie weiter unten, um das Problem zu beheben. Contact Form 7 ist eines der bekanntesten kostenlosen WordPress-Plugins, mit dem Sie das Kontaktformular auf Ihrer WordPress-Site erstellen, verwalten und anpassen können. Vor kurzem habe ich festgestellt, dass das Plugin &quot;Contact Form 7&quot; auf meiner Website (und auf vielen anderen) mit dem Fehler &quot;Beim Senden Ihrer Nachricht ist ein Fehler aufgetreten. Bitte versuchen Sie es später erneut&quot; nicht mehr funktioniert, der von einem orangefarbenen Rechteck umgeben ist , nach dem Absenden des Formulars. </p> <p><img src=\"images/image_thumb-14-729.png\" alt=\"Contact Form 7: There was an error to send your message. Please try again later\" loading=\"lazy\"></p> <p> Dieses Tutorial enthält Anweisungen zum Beheben des Fehlers &quot;Beim Senden Ihrer Nachricht ist ein Fehler aufgetreten. Bitte versuchen Sie es später erneut&quot; in einem orangefarbenen Feld nach dem Absenden des Kontaktformulars. </p> <h4> So beheben Sie: Kontaktformular funktioniert nicht mit Fehler &quot;Beim Senden Ihrer Nachricht ist ein Fehler aufgetreten&quot;. </h4> <p> Wenn Ihr Kontaktformular 7 auf Ihrer WordPress-Site nicht mehr funktioniert, führen Sie die folgenden Schritte aus: </p> <h6> Schritt 1. Kontaktformular validieren 7. </h6> <p> 1. Navigieren Sie zu Ihrem WordPress-Admin-Dashboard und klicken Sie auf <strong> Kontakt </strong> &gt; <strong> Kontaktformulare. </strong><br> 2. Überprüfen Sie oben auf der Seite, ob die Fehlermeldung &quot;Fehlkonfiguration führt zu E-Mail-Zustellungsfehlern oder anderen Problemen. Überprüfen Sie Ihre Kontaktformulare jetzt&quot; angezeigt wird. <br> 3. Wenn Sie diese Nachricht sehen*, dann <strong> klicken </strong> das <strong> Konfiguration von Kontaktformular 7 validieren </strong> Verknüpfung. </p> <p> * Hinweis: Wenn diese Meldung nicht angezeigt wird, fahren Sie mit Schritt 2 fort. </p> <p><img src=\"images/image_thumb-813.png\" alt=\"Validate Contact Form 7 Configuration \" loading=\"lazy\"></p> <p> 4. Klicken Sie im nächsten Bildschirm auf <strong> Jetzt 2 Kontaktformulare validieren </strong> Taste. </p> <p><img src=\"images/image_thumb-1-270.png\" alt=\"Validate Contact Form\" loading=\"lazy\"></p> <p> 5. Wenn die Konfigurationsvalidierung abgeschlossen ist, sollten Sie &quot;Kein ungültiges Kontaktformular gefunden&quot; erhalten. </p> <p><img src=\"images/image_thumb-17-318.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Testen Sie Ihr Kontaktformular und wenn der Fehler weiterhin besteht, fahren Sie mit Schritt 2 unten fort. </p> <h6> Schritt 2. Richten Sie Kontaktformular 7 mit reCAPTCHA V3-Schlüsseln ein. </h6> <p> Bei meinen Recherchen habe ich festgestellt, dass die neuesten Versionen des Kontaktformulars 7 (v5.1 und höher) die reCAPTCHA v3-API verwenden, um Sie vor Spam und anderen Arten von automatisiertem Missbrauch zu schützen. Auf dieser Grundlage haben Sie also die folgenden zwei Möglichkeiten, den Kontaktformular-Fehler &quot;Beim Senden Ihrer Nachricht ist ein Fehler aufgetreten. Bitte versuchen Sie es später noch einmal.&quot; zu beheben: * </p> <ul> <li> <p><strong> Option 1. </strong> So richten Sie Contact Form 7 mit reCAPTCHA V3-Schlüsseln ein. </p> </li> <li> <p><strong> Option 2. </strong> Um die zu verwenden <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"noopener noreferrer\"> Kontaktformular 7 – reCaptcha v2 </a> Plugin für Ihre Kontaktformulare. </p> </li> </ul> <p> * Hinweis: In diesem Artikel zeige ich Ihnen, wie Sie Contact Form 7 mit reCAPTCHA V3-Schlüsseln einrichten. Wenn Sie den reCAPTCHA V3-Schutz nicht verwenden möchten, deinstallieren Sie das Plugin „Contact Form 7“ und installieren Sie das <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"nofollow noopener\"> Kontaktformular 7 – reCaptcha v2 </a> Plugin. </p> <p><strong> So richten Sie Kontaktformular 7 mit reCAPTCHA V3-Schlüsseln ein: </strong></p> <p> 1. Melden Sie sich bei Ihrem Google-Konto an, mit dem Sie reCAPTCHA auf Ihrer Website eingerichtet haben, und navigieren Sie zum <a href=\"https://www.google.com/recaptcha/admin\" target=\"_blank\" rel=\"nofollow noopener\"> Die reCAPTCHA-Admin-Konsole von Google. </a></p> <p> 2. Klicken Sie auf Einstellungen <img src=\"images/image_thumb-2-494.png\" alt=\"image\" loading=\"lazy\"> Symbol. </p> <p><img src=\"images/image_thumb-3-786.png\" alt=\"Setup Contact Form 7 with recaptcha v3\" loading=\"lazy\"></p> <p> 3. Klicken Sie auf das <strong> Papierkorb </strong> Symbol <img src=\"images/image_thumb-4-167.png\" alt=\"image\" loading=\"lazy\"> und <strong> löschen </strong> das <strong> reCAPTCHA V2-Schlüssel. </strong></p> <p><img src=\"images/image_thumb-5-757.png\" alt=\"Recaptcha v3\" loading=\"lazy\"></p> <p> 4. Klicken Sie auf das Plus-Symbol <img src=\"images/image_thumb-6-851.png\" alt=\"image\" loading=\"lazy\"> um Ihre Website erneut zu registrieren. </p> <p><img src=\"images/image_thumb-7-337.png\" alt=\"Register Site with Recaptcha\" loading=\"lazy\"></p> <p> 5. Auf dem Bildschirm „Neue Site registrieren“: </p> <blockquote> <p> ein. <strong> Geben Sie einen Namen ein </strong> um Ihre Website in Zukunft zu identifizieren, <br> b. <strong> Wählen </strong> das <strong> reCAPTCHA v3 </strong> Art. <br> c. <strong> Art </strong> das <strong> Domainname </strong> Ihrer Website. <br> d. <strong> Akzeptieren </strong> das <strong> reCAPTCHA-Nutzungsbedingungen. </strong><br> e. Klicken <strong> EINREICHEN. </strong></p> </blockquote> <p><img src=\"images/image_thumb-8-227.png\" alt=\"Register Site with Recaptcha V3\" loading=\"lazy\"></p> <p> 6. Nach der Registrierung sehen Sie einen Bildschirm mit dem <strong> SEITENSCHLÜSSEL </strong> und der <strong> GEHEIMER SCHLÜSSEL </strong> . <br> 7. Klicken Sie auf <strong> SITE-SCHLÜSSEL KOPIEREN </strong> und <strong> NICHT SCHLIESSEN </strong> dieses Fenster. </p> <p><img src=\"images/image_thumb-9-995.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. Navigieren Sie in einem anderen Browserfenster zu Ihrem WordPress-Admin-Dashboard und klicken Sie auf <strong> Kontakt </strong> &gt; <strong> Integration. </strong></p> <p> 9. Klicken Sie auf das <strong> Setup-Integration </strong> Taste. </p> <p><img src=\"images/image_thumb-10-834.png\" alt=\"Integrate Recaptcha in Contact Form 7\" loading=\"lazy\"></p> <p> 10. Klicken Sie auf <strong> Schlüssel entfernen </strong> um die reCAPTCHA V2-Schlüssel zu löschen. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"image\" loading=\"lazy\"></p> <p> 11. <strong> Einfügen </strong> das neue <strong> Site-Schlüssel </strong> und dann das neue kopieren und einfügen <strong> Geheimer Schlüssel </strong> aus der reCAPTCHA-Admin-Konsole und klicken Sie auf <strong> Änderungen speichern. </strong></p> <p><img src=\"images/image_thumb-12-147.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. <strong> Löschen </strong> das <strong> Zwischenspeicher </strong> auf Ihrer Seite. <br> 13. Öffnen Sie ein neues Browserfenster und testen Sie Ihr Kontaktformular. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}