{"title":"So suchen Sie nach Updates in Office 2019, 2016 oder 2013 in Windows 10.","content":"<p> In diesem Tutorial erfahren Sie, wie Sie in Office 2019, 2016 und Office 2013 manuell nach Updates suchen. In allen Office-Versionen gibt es zwei Möglichkeiten, die verfügbaren Office-Updates zu installieren: automatisch und manuell. </p> <h4> So aktualisieren Sie Office 209/2016/2013/2010 Manuell. </h4> <h6> Methode 1. Manuelles Suchen nach Office-Updates in Office 2019, 2016 und Office 2013. </h6> <p> So überprüfen und installieren Sie die verfügbaren Office-Updates in allen Office-Versionen manuell: </p> <p> 1. Öffnen Sie ein beliebiges Office-Programm (z. B. Word). <br> 2. Von <strong> Datei </strong> Menü, wählen <strong> Konto </strong> . * </p> <p> * Hinweis: In Office 2010 wählen Sie <strong> Hilfe. </strong></p> <p> 3. Erweitern Sie die <strong> Update-Optionen </strong> und klicke <strong> Jetzt aktualisieren </strong> . * </p> <p> * Hinweis: Wenn die &quot;Update-Optionen&quot; nicht verfügbar sind, befolgen Sie die Anweisungen unter Methode-2 unten. </p> <p><img src=\"images/image_thumb-19-478.png\" alt=\"How to Check for Updates in Office 2019, 2016 or 2013 in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Methode 2. So installieren Sie Office-Updates für Office 2019, 2016 und Office 2013 automatisch. </h6> <p> Wenn Sie möchten, dass Windows die verfügbaren Office-Updates automatisch herunterlädt und installiert, navigieren Sie zu den Windows-Updateeinstellungen und überprüfen Sie die folgende Einstellung: </p> <ul> <li> Erhalten Sie Updates für andere Microsoft-Produkte, wenn Sie Windows aktualisieren (Windows 10) </li> <li> Geben Sie mir Updates für andere Microsoft-Produkte, wenn ich Windows aktualisiere (Windows 7) </li> </ul> <h5> So installieren Sie Office-Updates automatisch in Windows 10. </h5> <p><strong> 1. </strong> Gehe zu <strong> die Einstellungen </strong> -&gt; <strong> Update und Sicherheit -&gt; Erweiterte Optionen. </strong></p> <p><img src=\"images/image_thumb-20-149.png\" alt=\"Change Update Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Ziehen Sie bei den Update-Optionen den Schieberegler „Updates für andere Microsoft-Produkte erhalten, wenn Sie Windows aktualisieren“ auf <strong> AUF. </strong></p> <p><img src=\"images/image_thumb-21-717.png\" alt=\"automatically install office updates windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Navigieren Sie zum vorherigen Bildschirm und klicken Sie auf <strong> Auf Updates prüfen </strong> Schaltfläche in Sie möchten die verfügbaren Office-Updates sofort installieren. </p> <p> </p> <h5> So installieren Sie Office-Updates automatisch in Windows 7. </h5> <p> 1. Navigieren Sie zu <strong> Schalttafel </strong> -&gt; <strong> Windows Update </strong> und klicke <strong> Einstellungen ändern </strong> . </p> <p><img src=\"images/image_thumb-22-108.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Wählen Sie die <strong> Geben Sie mir Updates für andere Microsoft-Produkte, wenn ich Windows aktualisiere </strong> Kästchen an und klicke <strong> Anwenden </strong> . </p> <p> 3. Klicken Sie auf <strong> Auf Updates prüfen </strong> um alle verfügbaren Updates zu installieren. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blog-Beitrag in den sozialen Netzwerken, um die Nachricht über diesen Leitfaden zu verbreiten. </p> <p> </p>"}