{"title":"So öffnen Sie PowerShell als Administrator im aktuellen Ordner im Datei-Explorer (Windows 10)","content":"<p> Wenn Sie PowerShell oder PowerShell als Administrator an einem beliebigen Ort/Ordner im Datei-Explorer öffnen möchten, lesen Sie dieses Tutorial weiter. Wie Sie wissen, können Sie die PowerShell in Windows 10 normalerweise öffnen, indem Sie die Cortana-Suche verwenden oder (schneller) die Taste drücken <strong> Sieg <img src=\"images/image_thumb8_thumb_thumb-479.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"></strong> + <strong> X </strong> -Tasten, um das &quot;Power User-Menü&quot; zu öffnen und die Windows PowerShell von dort aus auszuführen. </p> <p><img src=\"images/image_thumb-54-350.png\" alt=\"PoweShell Admin (Win + X menu)\" loading=\"lazy\"></p> <p> </p> <p> Obwohl diese Methoden nützlich sind, muss PowerShell manchmal an einem bestimmten Ort / Ordner geöffnet werden. Befolgen Sie dazu die folgenden Anweisungen. </p> <h4> So öffnen Sie Windows PowerShell an einem bestimmten Ort in Windows 10. </h4> <p> 1. Navigieren Sie zu dem Ordner, in dem Sie PowerShell öffnen möchten. <br> 2. <strong> Runter halten </strong> das <strong> VERSCHIEBUNG </strong> Schlüssel und <strong> Rechtsklick </strong> irgendwo im Ordner. <br> 3. Wählen Sie im Rechtsklickmenü menu <strong> PowerShell-Fenster hier öffnen </strong> zu <strong> </strong> Öffnen Sie ein neues PowerShell-Fenster in diesem Ordner. </p> <p> </p> <p><img src=\"images/image_thumb-55-793.png\" alt=\"Open PoweShell at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Wenn Sie &#39;PowerShell als Admin&#39; in einem beliebigen Ordner öffnen möchten, klicken Sie auf <strong> Datei </strong> Menü und wählen Sie <strong> Öffnen Sie Windows PowerShell als Administrator </strong> . * </p> <p> * Hinweis: Wie Sie im Menü &#39;Datei&#39; sehen können, können Sie auch ein &quot;einfaches&quot; PowerShell-Fenster öffnen. </p> <p><img src=\"images/image_thumb-56-830.png\" alt=\"Open PoweShell As Administrator at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p><strong> Zusätzliche Hilfe: </strong> Wenn Sie ein Fan von Tastenkombinationen sind, können Sie PowerShell (Admin) auch öffnen, indem Sie die Taste press drücken <strong> Alt </strong> + <strong> F </strong> + <strong> S </strong> + <strong> EIN </strong> Schlüssel in Ordnung. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}