{"title":"So zeigen Sie Nachrichtenkopfzeilen an, ohne die E-Mail-Nachricht in Outlook 2016/2019 zu öffnen.","content":"<p> Wie Sie vielleicht wissen, enthält &quot;Nachrichtenkopfzeilen&quot; (auch bekannt als &quot;Nachrichtenquelle&quot; oder &quot;Internetkopfzeilen&quot; in Outlook) alle technischen Details einer empfangenen E-Mail-Nachricht. Genauer gesagt enthalten die &quot;Nachrichtenkopfzeilen&quot; einer E-Mail-Nachricht neben den üblichen Informationen (Absender, Sendezeit usw.) die zum Verfassen der Nachricht verwendete Software und die Server, die vor der Zustellung an Sie weitergegeben wurden . </p> <p> Um die Nachrichtenquelle/Kopfzeilen in der Microsoft Outlook-Desktopanwendung anzuzeigen, können Sie eine der folgenden Methoden verwenden: </p> <ol> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> So zeigen Sie die Nachrichtenkopfzeilen in Outlook 2016/2019 nach dem Öffnen der E-Mail-Nachricht an opening </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> So zeigen Sie die Nachrichtenkopfzeilen in Outlook 2016/2019 an, ohne die E-Mail-Nachricht zu öffnen. </a></li> </ol> <p> </p> <h2> So zeigen Sie die Nachrichtenkopfzeilen in Outlook 2016/2019 nach dem Öffnen von E-Mails an. </h2> <p> Die übliche Möglichkeit, die Nachrichtenquelle einer E-Mail-Nachricht in Microsoft Outlook 2016/2019 anzuzeigen, besteht darin, die E-Mail zu öffnen und ihre Eigenschaften anzuzeigen: </p> <p> 1. Öffnen Sie die E-Mail (in einem eigenen Fenster) und klicken Sie auf die <strong> Datei </strong> Speisekarte. </p> <p><img src=\"images/image_thumb-36-771.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Von <strong> Datei </strong> Menü, klick <strong> Eigenschaften </strong> . </p> <p><img src=\"images/image_thumb-37-974.png\" alt=\"View message headers outlook\" loading=\"lazy\"></p> <p> </p> <p> 3. Schau dir an <strong> Internet-Header, </strong> um die Nachrichtenquelle der E-Mail anzuzeigen (Details). </p> <p> * Hinweis: Wählen und kopieren Sie den Internet-Header-Text in Notepad, um das Lesen zu erleichtern. </p> <p><img src=\"images/image_thumb-38-976.png\" alt=\"View Internet headers in Outlook\" loading=\"lazy\"></p> <p> </p> <h2> So zeigen Sie die Nachrichtenkopfzeilen in Outlook 2016/2019 an, ohne eine E-Mail-Nachricht zu öffnen. </h2> <p> Das Problem beim Anzeigen der Nachrichtenquelle (Internet-Header) nach dem Öffnen der E-Mail-Nachricht besteht darin, dass Sie Ihren Computer einem Risiko aussetzen können, wenn die Nachricht eine Malware enthält. Um dies zu vermeiden, fahren Sie fort und folgen Sie den Anweisungen unten, um die Nachrichtenquelle lesen zu können, ohne die E-Mail zu öffnen. </p> <p> 1. Wählen Sie im Hauptfenster von Outlook <strong> Datei </strong> -&gt; <strong> Optionen </strong> . <br> 2. Wählen Sie <strong> Menüband anpassen </strong> links und rechts: </p> <p> ein. Beim <strong> Wählen Sie Befehle aus </strong> Dropdown-Liste, wählen Sie <strong> Befehle Nicht in der Multifunktionsleiste. <br> </strong> b. Stellen Sie sicher, dass in den Hauptregisterkarten die <strong> Startseite (Post) </strong> ist ausgewählt und klicke <strong> Neue Gruppe </strong> und dann klick <strong> Umbenennen. </strong></p> <p><img src=\"images/image_thumb-39-295.png\" alt=\"How to view the Message Headers in Outlook 2016-2019 \" loading=\"lazy\"></p> <p> c. <strong> Umbenennen </strong> das &quot; <strong> Neue Gruppe </strong> &quot;zu&quot; <strong> Internet-Header </strong> &quot; und klick <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-40-856.png\" alt=\"image\" loading=\"lazy\"></p> <p> d. Jetzt wählen Now <strong> Nachrichtenoptionen </strong> aus der Liste der Befehle und klicken Sie auf <strong> Hinzufügen </strong> . </p> <p><img src=\"images/image_thumb-41-344.png\" alt=\"image\" loading=\"lazy\"></p> <p> e. Jetzt sollten Sie die &#39;Nachrichtenoptionen&#39; unter der neu erstellten Gruppe (&quot;Internet Headers&quot;) sehen. Klicken <strong> OK </strong> Änderungen anwenden <strong> . </strong></p> <p><img src=\"images/image_thumb-42-209.png\" alt=\"view message source without opening email outlook\" loading=\"lazy\"></p> <p> 3. Jetzt auf deinem <strong> Zuhause </strong> Registerkarte sollten Sie eine neue Schaltfläche namens &quot;Nachrichtenoptionen – Internet-Header&quot; sehen. <br> 5. Markieren Sie von nun an einfach die Nachricht, deren Nachrichtenquelle Sie anzeigen möchten, und klicken Sie auf die Schaltfläche &quot;Nachrichtenoptionen&quot;, um die Nachrichtenquelle anzuzeigen, ohne die Nachricht in einem eigenen Fenster öffnen zu müssen. </p> <p><img src=\"images/image_thumb-43-460.png\" alt=\"view headers without opening email outlook\" loading=\"lazy\"></p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}