{"title":"So installieren Sie Windows 10 neu, wenn Windows nicht startet","content":"<p> In diesem Tutorial finden Sie eine detaillierte Anleitung zur Neuinstallation von Windows 10, wenn Windows nicht booten kann. In einem früheren Tutorial erwähnte ich den Weg zu <a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"nofollow noopener\"> Installieren Sie Windows 10 neu, indem Sie die Funktion &quot;Diesen PC zurücksetzen&quot; verwenden </a> . &quot;Diesen PC zurücksetzen&quot; ist jedoch nur verfügbar, wenn Windows 10 normal booten kann oder wenn Sie nach dem Booten von Windows das Menü &quot;Erweiterter Start&quot; aufrufen können (Die Option &quot;Diesen PC zurücksetzen&quot; ist beim Booten von USB nicht verfügbar). </p> <p> Dieses Tutorial enthält Anweisungen zur Neuinstallation von Windows 10, wenn Windows nicht startet, ohne Ihre Dateien zu verlieren. </p> <h2> So installieren Sie ein Paar von Windows 10 neu, wenn Windows nicht gestartet werden kann. </h2> <p><strong> Bedarf </strong> : Um Windows 10 neu zu installieren, wenn Windows nicht normal startet, müssen Sie Ihren Computer von einem Windows-Installationsmedium (USB oder DVD) booten und das Menü Erweiterte Optionen (F8-Tastenmenü) aktivieren. Wenn Sie kein Windows-Installationsmedium besitzen, können Sie eines erstellen, indem Sie . verwenden <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Das Medienerstellungstool von Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> So erstellen Sie ein Windows 10 USB-Installationsmedium. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> So erstellen Sie ein Windows 10-DVD-Installationsmedium. </a></li> </ul> <p> 1. Starten Sie Ihren Computer vom Windows-Installationsmedium. <br> 3. Drücken Sie <strong> Nächster </strong> auf dem Bildschirm mit den Sprachoptionen. <br> 4. Wählen Sie <strong> Deinen Computer reparieren </strong> . <br> 5. Dann wähle <strong> Fehlerbehebung -&gt; </strong><strong> Erweiterte Optionen -&gt; Eingabeaufforderung. </strong></p> <p> 6. Geben Sie im Eingabeaufforderungsfenster den folgenden Befehl ein und drücken Sie <strong> Eingeben: </strong></p> <ul> <li><strong> bcdedit /set {default} bootmenupolicy Legacy </strong></li> </ul> <p><img src=\"images/image_thumb-33-821.png\" alt=\"advanced boot options\" loading=\"lazy\"></p> <p> 7. Typ <strong> Ausfahrt </strong> um das Eingabeaufforderungsfenster zu schließen. <br> 8. Entfernen Sie das Windows-Installationsmedium. <br> 9. Schließen Sie alle Fenster, um Ihren PC neu zu starten oder auszuschalten. </p> <p> 10. <strong> Drücken Sie </strong> das <strong> F8 </strong> Schlüssel <strong> wiederholt </strong> beim Hochfahren des Computers. </p> <p> 11. Markieren Sie im &quot;Menü &quot;Erweiterte Optionen&quot; die Option &quot; <strong> Deinen Computer reparieren </strong> &quot;-Option und drücken Sie dann <strong> EINGEBEN </strong> . </p> <p><img src=\"images/image_thumb-13-334.png\" alt=\"Repair your Computer in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 12. Wählen Sie auf dem Bildschirm „Option auswählen“ <strong> Fehlerbehebung </strong> und dann klick <strong> Diesen PC zurücksetzen -&gt; Meine Dateien behalten. </strong> * </p> <p> Anmerkungen: <br> 1. Die &quot; <strong> Behalte meine Dateien&quot; </strong> Option entfernt alle Ihre Apps und Einstellungen, behält aber Ihre persönlichen Dateien. <br> 2. Die <strong> &quot;Alles entfernen&quot; </strong> Option entfernt alle Apps, Einstellungen und Dateien. Wenn Sie diese Option auswählen, wird Ihr PC in einen sauberen Zustand zurückversetzt. <br> 3. Wenn Sie &quot;Alles entfernen&quot; wählen, stellen Sie sicher, dass Sie eine aktuelle Sicherung Ihrer persönlichen Dateien auf einem anderen Speichermedium (z. B. einem USB-Laufwerk) haben, da sonst alle Ihre Dateien verloren gehen. </p> <p><img src=\"images/image_thumb-14-296.png\" alt=\"How to Reinstall Windows 10 if Windows Won't Boot.\" loading=\"lazy\"></p> <p> </p> <p> 13. Wählen Sie auf dem nächsten Bildschirm ein Konto mit Administratorrechten aus. ) und auf dem nächsten Bildschirm geben Sie Ihr Passwort ein und klicken Sie auf <strong> Nächster </strong> . </p> <p><img src=\"images/image_thumb-15-869.png\" alt=\"How to Reinstall Windows 10 if Windows cannot Boot.\" loading=\"lazy\"></p> <p> 14. Geben Sie das Passwort für das ausgewählte Konto ein und klicken Sie auf <strong> Fortsetzen. </strong></p> <p><img src=\"images/image_thumb-16-692.png\" alt=\"How to Reinstall Windows 10 if Windows fails to boot.\" loading=\"lazy\"></p> <p> </p> <p> 15. Warten Sie, bis die Installation abgeschlossen ist. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blog-Beitrag in den sozialen Netzwerken, um diesen Leitfaden bekannt zu machen. </p>"}