{"title":"So deinstallieren Sie die Edge Chromium-Version in Windows 10.","content":"<p> Viele Benutzer haben berichtet, dass das System nach der Installation der neuen Chromium-basierten Version des Microsoft Edge-Browsers in Windows 10 zu langsam wurde oder zu zufälligen Zeiten einfriert. Wenn das gleiche Problem auftritt, lesen Sie weiter unten, um die Edge Chromium-Version von Ihrem PC zu deinstallieren. * </p> <p> * Hinweis: Wenn die Chromium-Version von Microsoft Edge noch nicht auf Ihrem System installiert ist, lesen Sie die Anweisungen dazu <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Artikel </a> um zu verhindern, dass Microsoft Edge automatisch installiert wird. </p> <p><img src=\"images/image_thumb-38-388.png\" alt=\"Remove Edge Chromium in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Die neue Chromium-basierte Version des Microsoft Edge-Browsers wird automatisch mit dem . installiert <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> aktualisieren. In diesem Fall können Sie den Microsoft Edge nicht aus dem entfernen <strong> Start </strong> Speisekarte <img src=\"images/image_thumb2_thumb_thumb-565.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> die Einstellungen </strong><img src=\"images/image_thumb-66-219.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Apps </strong> -&gt; <strong> Apps &amp; Funktionen </strong> Optionen, denn die <strong> Deinstallieren </strong> Option ist ausgegraut. Um diese Einschränkung zu umgehen, führen Sie die folgenden Schritte aus. </p> <p><img src=\"images/image_thumb-39-654.png\" alt=\"How to Uninstall Edge Chromium version in Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> So entfernen Sie Edge Chromium von Windows 10. </h4> <p> So deinstallieren Sie den neuen Chromium-basierten Edge in Windows 10: </p> <p> 1. Navigieren Sie auf Ihrem PC zu folgendem Ordner: * </p> <ul> <li> C:\\Programme (x86)\\Microsoft\\Edge\\Application\\85.0.564.41\\Installer </li> </ul> <p> * Hinweis: Der Ordnername &quot;85.0.564.41&quot; gibt die installierte Version der neuen Chromium-Version an und kann an Ihrem PC abweichen. </p> <p> 2. Wählen Sie den Ordnerpfad in der Adressleiste aus und klicken Sie mit der rechten Maustaste &gt; <strong> Kopieren. </strong></p> <p><img src=\"images/image_thumb35_thumb-738.png\" alt=\"image_thumb[35]\" loading=\"lazy\"></p> <p> </p> <p> 3. Öffnen <strong> Eingabeaufforderung als Administrator, </strong> Art <strong> CD </strong> und drücke dann <strong> STRG+V </strong> zum Einfügen in den kopierten Ordnerpfad. Wenn Sie fertig sind, drücken Sie <strong> Eingeben </strong> . * </p> <p> * Bsp.: Im aktuellen Beispiel lautet der Befehl: </p> <p><em> cd C:\\Programme (x86)\\Microsoft\\Edge\\Application\\85.0.564.41\\Installer </em></p> <p><img src=\"images/image_thumb39_thumb-252.png\" alt=\"Uninstall Edge Chromium\" loading=\"lazy\"></p> <p> </p> <p> 4. Geben Sie nun den folgenden Befehl (Kopieren/Einfügen) in der Eingabeaufforderung ein, um die Chromium-Version des Microsoft Edge-Browsers von Ihrem PC zu entfernen. </p> <ul> <li> setup.exe –uninstall –Systemebene –verbose-logging –force-uninstall </li> </ul> <p><img src=\"images/image_thumb47_thumb-506.png\" alt=\"Uninstall Edge Chromium command\" loading=\"lazy\"></p> <p> 5. Sobald der obige Befehl ausgeführt wurde, wird die alte Version von EDGE wieder aktiviert. Starten Sie Ihren PC neu, um die Änderungen zu übernehmen. <br> 6. Fahren Sie nach dem Neustart mit der manuellen Installation fort <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> neuer Chromium-basierter Edge-Browser </a> auf Ihrem PC, um die automatische Lieferung zu vermeiden oder die zukünftige Installation von Edge Chromium zu verhindern, indem Sie die Anweisungen in diesem Artikel befolgen: <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> So verhindern Sie, dass Edge Chromium automatisch in Windows 10 installiert wird </a></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}