{"title":"So deaktivieren Sie Bitlocker in der Windows-Wiederherstellungsumgebung (WinRE).","content":"<p> Dieses Tutorial enthält Anweisungen zum Deaktivieren des BitLocker-Schutzes und zum Entschlüsseln eines mit BitLocker verschlüsselten Laufwerks in der Windows-Wiederherstellungsumgebung. Die Anweisungen können nützlich sein, wenn Ihr Computer durch BitLocker geschützt ist und den BitLocker-Wiederherstellungsschlüssel oder das BitLocker-Kennwort beim Systemstart nicht akzeptiert und Sie das BitLocker-geschützte Laufwerk nicht entsperren können. </p> <p><img src=\"images/image_thumb-52-511.png\" alt=\"Remove Bitlocker from Windows Recovery Environment \" loading=\"lazy\"></p> <h4></h4> <h4> So entfernen Sie den BitLocker-Schutz und entschlüsseln das verschlüsselte BitLocker-Laufwerk in der Windows-Wiederherstellungsumgebung (WinRE). </h4> <p><strong> Bedarf: </strong><br> <strong> EIN </strong> . <strong> Ein Windows 10-Installationsmedium (USB oder DVD). </strong> Wenn Sie kein Windows-Installationsmedium besitzen, können Sie eines erstellen, indem Sie verwenden <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Das Media Creation-Tool von Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> So erstellen Sie ein Windows 10 USB-Installationsmedium. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> So erstellen Sie ein Windows 10-DVD-Installationsmedium. </a></li> </ul> <p><strong> B. Der BitLocker-Wiederherstellungsschlüssel oder das BitLocker-Kennwort: </strong> Um den Bitlocker-Schutz zu deaktivieren, benötigen Sie das Bitlocker-Passwort oder den Bitlocker-Wiederherstellungsschlüssel, um das Laufwerk zuerst zu entsperren und dann das Laufwerk zu entschlüsseln. * </p> <p> * Hinweis: Wenn Sie nicht über den BitLocker-Wiederherstellungsschlüssel verfügen, können Sie den BitLocker-Schutz nicht umgehen. Wenn ein Datenträger BitLocker-geschützt ist und Sie nicht über den BitLocker-Wiederherstellungsschlüssel oder das Kennwort zum Entsperren des Laufwerks verfügen, besteht die einzige Möglichkeit (um das Laufwerk wieder zu verwenden) darin, das Laufwerk mithilfe der Anweisungen vollständig zu löschen In diesem Artikel: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> So entfernen Sie den BitLocker-Schutz von einem Laufwerk ohne den BitLocker-Wiederherstellungsschlüssel oder das Kennwort. </a></p> <p> Der Bitlocker-Wiederherstellungsschlüssel ist eine 48-stellige Nummer und kann an folgenden Orten gefunden werden: </p> <ul> <li> Auf einem Ausdruck, den Sie gespeichert haben, als Sie Bitlocker aktiviert haben. </li> <li> Auf einem USB-Laufwerk, das Sie während der Bitlocker-Aktivierung verwendet haben, um den Bitlocker-Wiederherstellungsschlüssel zu speichern. </li> <li> Bei der <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Schlüssel zur Wiederherstellung des Microsoft-Kontos </a> , indem Sie das MS-Konto verwenden, mit dem Sie sich auf Ihrem Gerät anmelden oder das Sie dem Gerät hinzugefügt haben, um Apps aus dem Microsoft Store herunterzuladen oder MS Office zu aktivieren oder für E-Mail. </li> <li> Auf Ihrem <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Azure-Konto </a> für Arbeits-PCs, die sich mit einem Azure Active Directory-Konto anmelden. </li> </ul> <p> Sobald Sie den BitLocker-Wiederherstellungsschlüssel oder das ΒitLocker-Kennwort gefunden haben, fahren Sie mit dem Entsperren des mit Bitlocker verschlüsselten Laufwerks und dem Entfernen der Bitlocker-Verschlüsselung in WinRE fort, indem Sie die folgenden Anweisungen befolgen. </p> <p> So entsperren und entschlüsseln Sie das Betriebssystemlaufwerk C: aus der WinRE: </p> <p> 1. Starten Sie Ihr System vom Windows 10-Installationsmedium. <br> 2. Drücken Sie im unteren Bildschirm die <strong> VERSCHIEBUNG </strong> + <strong> F10 </strong> Tasten zum Starten der Eingabeaufforderung. (oder drücke <strong> Nächster </strong> &gt; <strong> Meinen Computer reparieren </strong> &gt; <strong> Fehlerbehebung </strong> &gt; <strong> Eingabeaufforderung </strong> ). * </p> <p> * Hinweis: Wenn Sie nach dem Wiederherstellungsschlüssel gefragt haben, klicken Sie auf <strong> Dieses Laufwerk überspringen </strong> . </p> <p><img src=\"images/image_thumb15_thumb-548.png\" alt=\"How to disable-unlock bitlocker from Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. Geben Sie an der Eingabeaufforderung den folgenden Befehl ein, um den Laufwerksbuchstaben des verschlüsselten Laufwerks anzuzeigen: </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p> </p> <p> 4. Fahren Sie dann mit dem Entsperren des verschlüsselten Laufwerks fort, indem Sie den folgenden Befehl entsprechend Ihrem Fall verwenden: </p> <p><strong> Fall A. </strong> Wenn Sie den BitLocker-Wiederherstellungsschlüssel kennen, geben Sie diesen Befehl ein: </p> <ul> <li><strong> manage-bde -unlock Laufwerksbuchstabe: -rp BitLocker-recovery-key​ </strong></li> </ul> <p> * Bsp.: Wenn Sie das Laufwerk &quot;D:&quot; entsperren möchten und der Bitlocker-Wiederherstellungsschlüssel lautet: &quot;123456-123456-123456-123456-123456-123456&quot; </p> <ul> <li> <ul> <li> manage-bde -unlock <strong> D </strong> : -rp <strong> 123456-123456-123456-123456-123456-123456 </strong></li> </ul> </li> </ul> <p> </p> <p><strong> Fall B. </strong> Wenn Sie das BitLocker-Kennwort zum Entsperren des Laufwerks kennen, geben Sie diesen Befehl ein: </p> <ul> <li><strong> manage-bde -Laufwerksbuchstabe entsperren: -pw BitLocker-Password </strong></li> </ul> <p> * Bsp.: Wenn Sie das Laufwerk &quot;D:&quot; entsperren möchten und das BitLocker-Passwort lautet: &quot;123qwerty&quot; dann geben Sie ein: * </p> <ul> <li> <ul> <li> manage-bde -unlock <strong> D </strong> : -Passwort <strong> 123qwerty </strong></li> </ul> </li> </ul> <p> </p> <p> 5. Fahren Sie dann mit dem Entschlüsseln des Laufwerks fort und deaktivieren Sie den BitLocker-Schutz mit diesem Befehl: </p> <ul> <li><strong> manage-bde -off Laufwerksbuchstabe: </strong></li> </ul> <p> * Bsp.: Wenn Sie das Laufwerk &quot;D:&quot; entschlüsseln möchten, geben Sie ein: </p> <ul> <li> <ul> <li> manage-bde –off <strong> D </strong> : </li> </ul> </li> </ul> <p> 6. Der Entschlüsselungsvorgang mit start. Um den Entschlüsselungsstatus zu überprüfen, geben Sie den folgenden Befehl erneut ein und stellen Sie sicher, dass das Laufwerk <strong> Vollständig entschlüsselt </strong> und <strong> Entsperrt </strong> : </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p><img src=\"images/image_thumb9_thumb-678.png\" alt=\"decrypt bitlocker encrypted drive windows removery environment\" loading=\"lazy\"></p> <p> </p> <p> 7. Wenn Sie fertig sind, entfernen Sie das Windows-Installationsmedium und starten Sie den Computer neu. * </p> <p> * Hinweis: Wenn Windows nicht gestartet werden kann, schließen Sie das Laufwerk an einen anderen Computer an und sichern Sie Ihre persönlichen Daten auf einem anderen Medium. Dann <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> diagnostizieren Sie das Laufwerk auf Probleme </a> und wenn es in Ordnung ist, legen Sie die Diskette wieder in den Computer ein und führen Sie a <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> saubere Windows 10 Installation </a> . </p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um das Problem zu verbreiten. </p>"}