{"title":"So blockieren Sie Websites in Chrome oder Firefox.","content":"<p> Wenn Sie nach einer einfachen Möglichkeit suchen, eine Website in Chrome oder Firefox zu blockieren, lesen Sie weiter unten. </p> <p> Obwohl das Internet für die meisten von uns in unserem täglichen Leben für unsere Arbeit oder Unterhaltung notwendig geworden ist, ist es andererseits manchmal nützlich, einige Websites blockieren zu können, um Ablenkungen zu vermeiden. Niemand möchte zum Beispiel, dass sein Kind beim Lesen des Unterrichts durch Videos auf YouTube abgelenkt wird. </p> <p> In dieser Anleitung erfahren Sie, wie Sie Websites in Chrome blockieren und <a href=\"#firefox\" target=\"_blank\" rel=\"nofollow noopener\"> Feuerfuchs </a> Browser. </p> <p> * Hinweis: Wenn Sie eine Website in allen Browsern blockieren möchten, lesen Sie diesen Artikel: <a href=\"https://www.repairwin.com/block-youtube-on-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> So blockieren Sie YouTube unter Windows 10. </a></p> <h2> So blockieren Sie Websites in Google Chrome. </h2> <p> Der einfachste Weg, eine Website in Chrome zu blockieren, besteht darin, die berühmte BlockSite-Erweiterung zu verwenden. Die Installation des BlockSite-Add-Ons ist ähnlich wie bei jeder anderen Erweiterung. </p> <p> 1. Navigieren Sie zu <a href=\"https://chrome.google.com/webstore/detail/blocksite-stay-focused-co/eiimnmioipafcokbfikbljfdeojpcgbh\" target=\"_blank\" rel=\"nofollow noopener\"> BlockSite-Erweiterung </a> im Chrome Web Store und klicken Sie auf <strong> Zu Chrome hinzufügen </strong> Taste. </p> <p><img src=\"images/image_thumb-4-439.png\" alt=\"how to block websites chrome\" loading=\"lazy\"></p> <p> 2. Wenn Sie dazu aufgefordert werden, klicken Sie auf <strong> Erweiterung hinzufügen </strong> . </p> <p><img src=\"images/image_thumb-5-782.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Wenn die Installation abgeschlossen ist, gehen Sie zum Chrome-Menü &gt; Weitere Tools &gt; Erweiterungen </p> <p><img src=\"images/image_thumb-6-830.png\" alt=\"chrome tools extensions\" loading=\"lazy\"></p> <p> 4. Finden Sie die <strong> BlockSite </strong> erweitern und klicken <strong> Einzelheiten. </strong></p> <p><img src=\"images/image_thumb-7-415.png\" alt=\"Blocksite details\" loading=\"lazy\"></p> <p> 5. <strong> Öffnen </strong> das <strong> Erweiterungsmöglichkeiten </strong> . </p> <p><img src=\"images/image_thumb-8-135.png\" alt=\"How to Block sites chrome\" loading=\"lazy\"></p> <p> 6. Geben Sie den Namen der Site ein, die Sie blockieren möchten (z. <a href=\"http://www.youtube.com\" target=\"_blank\" rel=\"nofollow noopener\"> www.youtube.com </a> ) und drücken Sie das Plus-Symbol (+), um die Website zur Liste der gesperrten Websites hinzuzufügen. </p> <p><img src=\"images/image_thumb-9-298.png\" alt=\"blocked sites chrome\" loading=\"lazy\"></p> <p> 7. Das ist es! Wenn Sie von nun an versuchen, die blockierte Site zu besuchen, werden Sie darüber informiert, dass die Site mit der BlockSite-Erweiterung gesperrt ist. Um die Liste der blockierten Sites zu ändern, klicken Sie auf <strong> Bearbeiten Sie Ihre Liste </strong> Schaltfläche, um die gewünschten Änderungen vorzunehmen oder die blockierte Site aus der Liste zu entfernen. </p> <p><img src=\"images/image_thumb-10-951.png\" alt=\"image\" loading=\"lazy\"></p> <h3> So schützen Sie die blockierten Sites in der BlockSite-Erweiterung mit einem Kennwort. </h3> <p> Wenn Sie verhindern möchten, dass Benutzer eine blockierte Site entsperren: </p> <p> 1. Öffnen Sie die <strong> BlockSite </strong> Erweiterungsmöglichkeiten. <br> 2. Navigieren Sie zu <strong> Passwortschutz </strong> die Einstellungen. <br> 3. <strong> Aktivieren </strong> die Option Schützen <strong> Ihre bevorzugten BlockSite-Optionen und die Chrome-Erweiterungsseite mit einem Passwort </strong> Geben Sie dann Ihre E-Mail und ein Passwort ein und klicken Sie auf <strong> Speichern. </strong></p> <p><img src=\"images/image_thumb-11-711.png\" alt=\"password protect blocked sites\" loading=\"lazy\"></p> <p> 4. BlockSite sendet Ihnen eine E-Mail mit einem Link zur Bestätigung Ihrer E-Mail-Adresse. Nach der E-Mail-Verifizierung ist der Passwortschutz aktiv. </p> <h2> So blockieren Sie Websites in Mozilla Firefox. </h2> <p> 1. Navigieren Sie zu <a href=\"https://addons.mozilla.org/en-US/firefox/addon/blocksite/\" target=\"_blank\" rel=\"nofollow noopener\"> BlockSite-Erweiterung </a> in Firefox-Add-Ons. <br> 2. Klicken Sie auf das <strong> Zu Firefox hinzufügen </strong> Taste. </p> <p><img src=\"images/image_thumb-12-999.png\" alt=\"block websites firefox\" loading=\"lazy\"></p> <p> 2. Wenn Sie aufgefordert werden, die Installation der Erweiterung zuzulassen, klicken Sie auf <strong> Hinzufügen. </strong></p> <p><img src=\"images/image_thumb-13-588.png\" alt=\"Blocksite firefox\" loading=\"lazy\"></p> <p> 3. Wenn die Installation abgeschlossen ist, wählen Sie aus, ob Sie Websites in privaten (inkognito) Fenstern blockieren möchten, und klicken Sie auf <strong> okay </strong> . </p> <p><img src=\"images/image_thumb-14-173.png\" alt=\"how to block site\" loading=\"lazy\"></p> <p> 4. Wenn Sie verhindern möchten, dass die BlockSite-Erweiterung Daten auf von Ihnen besuchten Websites liest, klicken Sie auf Vielleicht Brief. </p> <p><img src=\"images/image_thumb-15-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Klicken Sie nun auf das BlockSite-Symbol und <strong> Sperrliste bearbeiten </strong> um anzugeben, welche Websites Sie blockieren möchten. </p> <p><img src=\"images/image_thumb-16-657.png\" alt=\"block sites firefox\" loading=\"lazy\"></p> <p> 6. Geben Sie auf der Registerkarte &quot;Sites blockieren&quot; den Namen der Site ein, die Sie blockieren möchten (z. </p> <p><img src=\"images/image_thumb-17-817.png\" alt=\"How to block site Firefox\" loading=\"lazy\"></p> <p> 7. Nachdem Sie die zu blockierenden Sites hinzugefügt haben, schließen Sie die BlockSite-Einstellungen und fertig. </p> <p> Neben ihrer Hauptfunktion verfügt die BlockSite-Erweiterung auch über einige andere nützliche Funktionen wie: </p> <ul> <li> <p><strong> Fokus Modus </strong> : Websites für eine bestimmte Zeit blockieren (z. B. 25 Minuten) </p> </li> <li> <p><strong> Passwortschutz: </strong> Schützen Sie Ihre BlockSite-Einstellungen vor Änderungen. </p> </li> <li> <p><strong> Mit Worten blockieren: </strong> Blockieren Sie URLs, die bestimmte Wörter enthalten. </p> </li> </ul> <p> Das war&#39;s Leute! Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}