{"title":"So schützen Sie einen Ordner in Windows 10 mit einem Kennwort (Ordner mit Kennwort sperren).","content":"<p> Dieses Tutorial enthält zwei verschiedene kostenlose und sichere Methoden zum Passwortschutz eines Ordners im Windows 10/8/7 OS. Wenn Sie einen Ordner mit einem Passwort sperren, kann niemand außer Ihnen darauf zugreifen. Das Schützen eines Ordners mit einem Kennwort ist nützlich, wenn Sie Ihren Computer mit anderen teilen und nicht möchten, dass jemand anderes auf Ihre privaten Dateien zugreift und sie liest. </p> <ul> <li><strong> Verwandter Artikel: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> So schützen Sie Ihren Windows 10-PC mit BitLocker </a> . </strong></li> </ul> <h4> So sperren Sie einen Ordner mit einem Kennwort in Windows 10. </h4> <h6> Methode 1. So sperren und verschlüsseln Sie Dateien mit 7-zip (Windows Alle Versionen). </h6> <p> Die einfachste und sicherste Methode, einen Ordner in Windows mit einem Kennwort zu schützen, ist die Verwendung des 7-Zip-Archivierungsdienstprogramms, das auch die Verschlüsselung unterstützt. So verschlüsseln und schützen Sie einen Ordner/eine Datei mit 7-zip: </p> <p> 1. Laden Sie das herunter und installieren Sie es <a href=\"https://www.7-zip.org/\" target=\"_blank\" rel=\"nofollow noopener\"> 7-zip </a> Archivierungsprogramm. <br> 2. Klicken Sie mit der rechten Maustaste auf den Ordner (oder die Datei), den Sie mit einem Passwort schützen möchten, und wählen Sie: <strong> 7-zip </strong> &gt; <strong> Zum Archiv hinzufügen </strong> . </p> <p><img src=\"images/image_thumb-28-978.png\" alt=\"How to Password Protect a Folder\" loading=\"lazy\"></p> <p> </p> <p> 3. Geben Sie bei den Optionen „Zum Archiv hinzufügen“ ein starkes Passwort ein und klicken Sie dann auf <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-29-728.png\" alt=\"set password to archive with 7-zip\" loading=\"lazy\"></p> <p> </p> <p> 4. Dann den unkomprimierten Ordner (oder die Datei) löschen und fertig! </p> <h6> Methode 2. So verschlüsseln Sie einen Ordner mit EFS-Schutz (Windows Pro &amp; Enterprise). </h6> <p> Der EFS-Schutz ist ein integriertes Verschlüsselungstool in den Editionen Windows 10 Professional und Enterprise. Wenn Sie einen Ordner oder eine Datei mit EFS-Verschlüsselung schützen, ist es für andere sehr schwierig, auf die verschlüsselten Dateien zuzugreifen, ohne den Entschlüsselungsschlüssel (Zertifikat PFX-Schlüssel) zu haben. </p> <p> Der einzige Nachteil der EFS-Verschlüsselung besteht darin, dass die Verschlüsselung entfernt wird, wenn Sie die verschlüsselten Dateien auf einen anderen Netzwerkcomputer kopieren oder die verschlüsselten Dateien per E-Mail senden. </p> <p> Wenn Sie Ihre EFS-Dateien verschlüsseln, wird außerdem der Entschlüsselungsschlüssel (Zertifikat) lokal auf Ihrem Computer gespeichert. Das bedeutet, dass jeder mit Ihrem Passwort auch Zugriff auf Ihre verschlüsselten Dateien hat. Wenn Sie Ihre Dateien mit der EFS-Verschlüsselung verschlüsseln, geben Sie daher ein starkes Anmeldekennwort an und geben Sie es nicht an andere weiter. </p> <ul> <li><strong> Verwandter Artikel: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> So entschlüsseln Sie mit EFS verschlüsselte Dateien und entfernen die EFS-Verschlüsselung. </a></strong></li> </ul> <p><strong> So verschlüsseln Sie einen Ordner oder eine Datei mit EFS: </strong><br> 1. Klicken Sie mit der rechten Maustaste auf den Ordner (oder die Datei), den Sie schützen möchten, und wählen Sie <strong> Eigenschaften </strong> . <br> 2. Klicken Sie auf der Registerkarte Allgemein auf <strong> Fortgeschritten </strong> . </p> <p><img src=\"images/image_thumb-13-582.png\" alt=\"enable efs protection\" loading=\"lazy\"></p> <p> </p> <p> 3. Wählen Sie <strong> Dateien verschlüsseln, um Daten zu sichern </strong> und dann klick <strong> OK. </strong></p> <p><img src=\"images/image_thumb-14-983.png\" alt=\"How to Lock Folder with Password - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Dann klick <strong> Anwenden </strong> und <strong> OK </strong> erneut, um die Änderungen zu speichern und zu beenden. <br> 5. An diesem Punkt fordert Windows Sie auf, den Wiederherstellungsschlüssel zu sichern. Klicken <strong> Sichern Sie Ihren Dateiverschlüsselungsschlüssel. </strong></p> <p><img src=\"images/image_thumb-2-823.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Klicken Sie dann auf <strong> Jetzt sichern (empfohlen) </strong> und speichern Sie den Schlüssel des Entschlüsselungszertifikats auf einem USB-Laufwerk. </p> <p><img src=\"images/image_thumb-15-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Klicken Sie im Zertifikatexport-Assistenten auf <strong> Nächster </strong> auf dem Willkommensbildschirm. <br> 8. Dann klicke <strong> Nächster </strong> erneut auf dem Bildschirm Dateiformat exportieren. </p> <p><img src=\"images/image_thumb-4-842.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. Bei Sicherheitsoptionen: </p> <blockquote> <p> 1. <strong> Prüfen </strong> das <strong> Passwort </strong> Box. <br> 2. Geben Sie ein Kennwort für den exportierten Zertifikatsschlüssel ein. <br> 3. Wählen Sie <strong> AES256-SHA256 </strong> Verschlüsselung <br> 4. Klicken Sie auf <strong> Nächster </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-16-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. Klicken Sie auf <strong> Durchsuche </strong> und <strong> speichern </strong> die Zertifikatsdatei (.pfx) auf Ihrem Computer. <br> 11. Wenn Sie fertig sind, klicken Sie auf <strong> Nächster </strong> weitermachen. </p> <p><img src=\"images/image_thumb-17-804.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. Endlich klick <strong> Fertig </strong> . </p> <p><img src=\"images/image_thumb-18-449.png\" alt=\"image\" loading=\"lazy\"></p> <p> 13. Wenn der Export abgeschlossen ist, speichern Sie den exportierten Zertifikatsschlüssel (.pfx-Datei) an einem anderen sicheren Ort (z. B. auf einem USB-Datenträger). </p> <p><strong> TRINKGELD: </strong> Wenn Sie einen Ordner (oder Dateien) mit EFS verschlüsseln, wird der Entschlüsselungsschlüssel (Zertifikat) in Ihrem Benutzerprofilordner gespeichert. Wenn also ein anderer Benutzer Ihr Windows-Anmeldekennwort hat, kann er die verschlüsselten Dateien öffnen und lesen. Um dies zu vermeiden, geben Sie Ihr Anmeldekennwort nicht weiter oder entfernen (deinstallieren) Sie das Entschlüsselungszertifikat aus Ihrem Profil, wenn Sie Ihren PC verlassen, und installieren Sie es bei Ihrer Rückkehr erneut. * </p> <p> * Hinweis: Um den Wiederherstellungsschlüssel (Zertifikat) zu entfernen und erneut zu importieren, gehen Sie zu: </p> <blockquote> <p> ein. <strong> Schalttafel </strong> &gt; <strong> Internet Optionen. <br> </strong> b. Klicken Sie unter &#39;Internetoptionen&#39; auf das <strong> Inhalt </strong> Tab und dann klick <strong> Zertifikat </strong> s. <br> c. Klicken Sie auf der Registerkarte &quot;Persönlich&quot; auf das <strong> Entfernen </strong> , um den Entschlüsselungsschlüssel (Zertifikat) zu entfernen, oder klicken Sie auf die Schaltfläche <strong> Importieren </strong> Schaltfläche, um das Entschlüsselungszertifikat vom USB-Laufwerk neu zu installieren. </p> </blockquote> <ul> <li> <p><strong> Verwandter Artikel: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"noopener noreferrer\"> So entschlüsseln Sie mit EFS verschlüsselte Dateien und entfernen die EFS-Verschlüsselung. </a></strong></p> </li> </ul> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht über diese Lösung zu verbreiten </p>"}