{"title":"So verhindern Sie, dass Windows 10 Netzwerkdrucker automatisch installiert","content":"<p> Wie Sie vielleicht bereits bemerkt haben, installiert Windows 10 automatisch die Treiber für jeden mit dem Netzwerk verbundenen Drucker oder jedes andere Gerät. Obwohl dies eine sehr nützliche Funktion ist, ist sie jedoch auch sehr ärgerlich, insbesondere in Geschäftsumgebungen, in denen möglicherweise nicht alle Drucker von allen Netzwerkbenutzern verwendet werden sollen. </p> <p> Wenn Sie ein Netzwerkgerät und dessen Hersteller-Apps nicht möchten, können Sie es natürlich von Ihrem System entfernen. Windows 10 installiert es jedoch automatisch erneut. Um dies zu vermeiden, müssen Sie verhindern, dass Windows die mit dem Netzwerk verbundenen Geräte (Drucker, Scanner, Kameras usw.) und deren Apps und Zollsymbole vom Hersteller automatisch installiert. </p> <h3> So stoppen Sie Windows 10, um Netzwerkgeräte und Apps automatisch zu installieren. </h3> <p> 1. Navigieren Sie zu <strong> Schalttafel </strong> . Das zu tun: </p> <blockquote><p> ein. Geben Sie &quot;Systemsteuerung&quot; in das Windows-Suchfeld ein <br> b. Klicken <strong> Schalttafel </strong> aus den Ergebnissen. </p></blockquote> <p><img src=\"images/image_thumb-53-862.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Stellen Sie die <strong> Gesehen von </strong> zu <strong> Kleine Icons </strong> , um alle Elemente der Systemsteuerung anzuzeigen, und klicken Sie dann auf <strong> Netzwerk-und Freigabecenter. </strong></p> <p><img src=\"images/image_thumb-37-625.png\" alt=\"control panel network and sharing center\" loading=\"lazy\"></p> <p> </p> <p> 3. Wählen Sie <strong> Erweiterte Freigabeeinstellungen </strong> links <strong> . </strong></p> <p><img src=\"images/image_thumb-38-656.png\" alt=\"Prevent Windows 10 to Install Network Printers Automatically\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Löschen Sie das &quot; <strong> Automatische Einrichtung von mit dem Netzwerk verbundenen Geräten aktivieren&quot; </strong> und klicke <strong> Änderungen speichern. </strong></p> <p><img src=\"images/image_thumb-39-992.png\" alt=\"Turn Off automatic setup of network connected devices \" loading=\"lazy\"></p> <p> </p> <p><strong> Optional: </strong> Wenn Sie verhindern möchten, dass Windows 10 die Apps und benutzerdefinierten Symbole des Herstellers automatisch für jedes angeschlossene Gerät auf Ihrem PC herunterlädt und installiert, gehen Sie wie folgt vor: </p> <blockquote><p> 1. Navigieren Sie zu <strong> Schalttafel </strong> -&gt; <strong> System </strong> . <br> 2. Klicken Sie auf <strong> Systemschutz </strong> links. <br> 3. Klicken Sie auf der Registerkarte Hardware auf <strong> Geräteinstallationseinstellungen </strong> . </p></blockquote> <p><img src=\"images/image_thumb-40-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. Wählen Sie unter &quot;Geräteinstallationseinstellungen&quot;  &quot; <strong> Nein (Ihr Gerät funktioniert möglicherweise nicht wie erwartet)&quot; </strong> und klicke <strong> Änderungen speichern </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-728.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blog-Beitrag in den sozialen Netzwerken, um diesen Leitfaden bekannt zu machen. </p>"}