{"title":"So zeigen und exportieren Sie Chrome-Passwörter.","content":"<p> In diesem Tutorial zeige ich Ihnen, wie Sie die gespeicherten Passwörter für jede Website, die Sie in Google Chrome besuchen, anzeigen, verwalten oder in eine Datei exportieren. Wie Sie bereits wissen, fordert Sie der Chrome-Browser beim ersten Besuch einer Website auf, Ihre Zugangsdaten (Benutzername und Passwort) zu speichern. </p> <p><img src=\"images/image_thumb-97-400.png\" alt=\"view-chrome-passwords\" loading=\"lazy\"></p> <p> Wenn Sie Chrome erlauben, Ihre Anmeldeinformationen zu speichern, füllt der Chrome-Browser bei der nächsten Anmeldung auf der Website automatisch die Anmeldefelder aus. Auf diese Weise vergessen viele Benutzer (einschließlich mir) jedoch im Laufe der Zeit ihre Anmeldeinformationen. In diesem Tutorial erfahren Sie, wie Sie die in Chrome gespeicherten Passwörter anzeigen, verwalten oder in einer Datei speichern können. </p> <h4> So verwalten, zeigen und exportieren Sie die gespeicherten Passwörter in Google Chrome. </h4> <p> 1. Über das Chrome-Menü <img src=\"images/image_thumb-78-707.png\" alt=\"image\" loading=\"lazy\"> wählen <strong> die Einstellungen </strong> . </p> <p><img src=\"images/image_thumb-79-605.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> 2. Klicken Sie bei den AutoFill-Optionen auf <strong> Passwörter </strong> . </p> <p><img src=\"images/image_thumb-80-931.png\" alt=\"manage chrome passwords\" loading=\"lazy\"></p> <p> </p> <p><strong> So zeigen Sie Chrome-Passwörter an. </strong></p> <p> 1. Um das in Chrome gespeicherte Passwort für eine bestimmte Site anzuzeigen, klicken Sie auf das <strong> Passwort anzeigen </strong><img src=\"images/image_thumb-86-925.png\" alt=\"image\" loading=\"lazy\"> Symbol. </p> <p><img src=\"images/image_thumb-87-291.png\" alt=\"view chrome passwords\" loading=\"lazy\"></p> <p> </p> <p> 2. Geben Sie das Windows-Anmeldekennwort ein, wenn Sie dazu aufgefordert werden, und klicken Sie auf <strong> OK </strong> um das gespeicherte Passwort für die Site anzuzeigen. </p> <p><img src=\"images/image_thumb-88-816.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Um das gespeicherte Passwort für die Site zu entfernen, klicken Sie auf das Drei-Punkte-Menü <img src=\"images/image_thumb-89-602.png\" alt=\"image\" loading=\"lazy\"> neben dem Site-Namen und klicken Sie auf <strong> Entfernen </strong> . </p> <p><img src=\"images/image_thumb-91-954.png\" alt=\"remove chrome passwords\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> So speichern Sie alle Chrome-Passwörter in einer Datei </strong></p> <p> 1. Um alle gespeicherten Login-Benutzernamen und Passwörter für alle Websites in einer Excel-Datei (.csv) zu speichern, klicken Sie auf das Drei-Punkte-Menü <img src=\"images/image_thumb-92-183.png\" alt=\"image\" loading=\"lazy\"> neben &quot;Gespeicherte Passwörter&quot; und klicken Sie auf <strong> Export </strong> . </p> <p><img src=\"images/image_thumb-93-646.png\" alt=\"export chrome passwords\" loading=\"lazy\"></p> <p> </p> <p> 2. Klicken Sie im nächsten Fenster auf <strong> Passwörter exportieren </strong> . </p> <p><img src=\"images/image_thumb-94-438.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Geben Sie Ihr Windows-Anmeldekennwort ein, wenn Sie dazu aufgefordert werden, und klicken Sie auf <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-95-376.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Speichern Sie die &quot;Chrome Passwords.csv&quot; auf Ihrem Computer. </p> <p><img src=\"images/image_thumb-96-130.png\" alt=\"save chrome passwords\" loading=\"lazy\"></p> <p> </p> <p> Das ist alles! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}