{"title":"So setzen Sie die Photoshop-Einstellungen auf die Standardeinstellungen zurück.","content":"<p> Wenn das Photoshop-Programm seltsam funktioniert, können Sie das Problem am schnellsten beheben, indem Sie die Photoshop-Einstellungen auf die Standardeinstellungen zurücksetzen. In diesem Tutorial finden Sie detaillierte Anweisungen zum Zurücksetzen der Photoshop-Voreinstellungen auf ihre Standardwerte. </p> <p> Im Programm Adobe Photoshop werden alle Anpassungen (Anzeigeoptionen, Leistungsoptionen, Transparenzoptionen, Cursoroptionen usw.) beim Beenden der Anwendung in der Datei „Adobe Photoshop Preferences“ gespeichert. Wenn die Voreinstellungsdatei beschädigt wird, verhält sich das Photoshop-Programm seltsam und die einzige Möglichkeit, das Problem zu beheben, besteht darin, die Voreinstellungen auf ihre Standardwerte zurückzusetzen. </p> <h4> So setzen Sie die Photoshop-Einstellungen auf die Standardeinstellungen zurück. * </h4> <p> * Hinweis: Die oben genannten Methoden setzen alle Voreinstellungen auf die Standardeinstellungen zurück. Wenn Sie ein bestimmtes oder alle Photoshop-Werkzeuge zurücksetzen möchten, wenden Sie die folgenden Aktionen an: </p> <blockquote><p> 1. Klicken Sie im Photoshop-Menü auf <strong> Fenster </strong> und wählen Sie dann die <strong> Optionen </strong> Artikel. <br> 2. Wählen Sie dann in der Toolbox das Werkzeug aus, das Sie zurücksetzen möchten. <br> 3. Klicken Sie nun mit der rechten Maustaste auf das Werkzeug links von der Optionsleiste und wählen Sie <strong> Werkzeug zurücksetzen </strong> oder <strong> Alle Werkzeuge zurücksetzen. </strong></p></blockquote> <p><img src=\"images/image_thumb-25-673.png\" alt=\"reset tools photoshop\" loading=\"lazy\"></p> <h6></h6> <h6> Methode 1. Zurücksetzen der Voreinstellungen beim Start von Photoshop. </h6> <p> Die erste Methode zum Zurücksetzen der Einstellungen in Photoshop besteht darin, nach dem Starten von Photoshop eine Tastenkombination zu verwenden. Das zu tun: </p> <p> 1. <strong> Verlassen </strong> Photoshop. <br> 2. <strong> Doppelklick </strong> auf Photoshop-Symbol und sofort <strong> runter halten </strong> das <strong> Strg+Alt+Umschalt </strong> Tasten (unter Windows) oder die <strong> Befehl+Wahl+Umschalt </strong> (unter MacOS). <br> 3. Wenn Sie darum gebeten werden <strong> &quot;Löschen Sie die Adobe Photoshop-Einstellungsdatei?&quot; </strong> klicken <strong> Ja. </strong></p> <p><img src=\"images/image_thumb-24-561.png\" alt=\"delete photoshop settings\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Methode 2. Setzen Sie die Einstellungen aus dem Photoshop-Menü zurück. </h6> <p> 1. Starten Sie Photoshop. <br> 2. Von der <strong> Bearbeiten </strong> Menü, wählen <strong> Einstellungen </strong> -&gt; <strong> Allgemeines <br> </strong> 3. Klicken Sie auf <strong> Einstellungen beim Beenden zurücksetzen. </strong></p> <p><img src=\"images/image_thumb-21-842.png\" alt=\"Reset Adobe Photoshop Preferences on Quit\" loading=\"lazy\"></p> <p> </p> <p> 4. Klicken Sie auf <strong> OK </strong> wenn Sie beim Beenden von Photoshop aufgefordert werden, die Voreinstellungen zurückzusetzen. </p> <p><img src=\"images/image_thumb-22-194.png\" alt=\"Reset Photoshop Settings on Quit\" loading=\"lazy\"></p> <p> </p> <p> 5. Klicken Sie auf <strong> OK </strong> erneut, um das Dialogfeld Einstellungen zu schließen. <br> 6. Schließen Sie Photoshop und starten Sie es erneut. </p> <p> </p> <h6> Methode 3. Löschen Sie die Adobe Photoshop-Einstellungsdatei, oder benennen Sie sie um. </h6> <p> Die letzte Methode zum Zurücksetzen der Photoshop-Voreinstellungen auf ihre Standardeinstellungen besteht darin, die Photoshop-Einstellungsdatei (Adobe Photoshop %Version% Prefs.psp) an folgendem Speicherort auf Ihrem PC umzubenennen oder zu löschen:* </p> <ul> <li> C:\\Benutzer\\%Benutzername%\\AppData\\Roaming\\Adobe\\Adobe Photoshop %Version%\\Adobe Photoshop %Version% Einstellungen\\ <strong> Adobe Photoshop %Version% Prefs.psp </strong></li> </ul> <p> * Hinweis: Navigieren Sie unter MAC OS zu: </p> <ul> <li> Benutzer\\%Benutzername%\\Bibliothek\\Einstellungen\\Adobe Photoshop %Version% Einstellungen\\ <strong> Adobe Photoshop %Version% Prefs.psp </strong></li> </ul> <p> So löschen Sie die Adobe-Einstellungen in Windows 10, 8, 7 OS: </p> <p> 1. <strong> Verlassen </strong> Photoshop. <br> 2. Navigieren Sie zum Ordner &quot;C:\\Benutzer\\%Benutzername%\\AppData\\Roaming\\&quot;. Das zu tun: </p> <blockquote><p> 1. Drücken Sie die Windows <img src=\"images/image_thumb8_thumb_thumb-455.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Geben Sie in das Suchfeld Folgendes ein: <strong> %Anwendungsdaten% </strong> &amp; klicken <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-66-926.png\" alt=\"Delete Photoshop Preferences file\" loading=\"lazy\"></p> <p> </p> <p> 4. Navigieren Sie dann zum Ordner „…\\Adobe\\Adobe Photoshop %Version%\\Adobe Photoshop %Version% Settings\\“. <br> 5. <strong> Löschen </strong> oder <strong> umbenennen </strong> die Datei &quot;Adobe Photoshop %Version% Prefs.psp&quot; in Adobe Photoshop %Version% Prefs.OLD&quot; * </p> <p> * Hinweis: Wenn Sie Photoshop 64-Bit besitzen, benennen oder löschen Sie auch die Datei &quot;Adobe Photoshop X64 %version% Prefs.psp&quot;. </p> <p><img src=\"images/image_thumb-23-438.png\" alt=\"Re-create Photoshop Settings File\" loading=\"lazy\"></p> <p> </p> <p> 6. Starten Sie Photoshop. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}