{"title":"So teilen Sie Dateien und Ordner in Windows 10, 8.1 oder 7 OS.","content":"<p> Die Dateifreigabefunktion in Windows bietet Ihnen die Möglichkeit, Ordner und Dateien einfach zwischen den Benutzern in Ihrem Netzwerk freizugeben. Indem Sie Ihre Dateien mit anderen Benutzern im selben Netzwerk teilen, können Sie dieselben Dateien/Ordner anzeigen und mit ihnen arbeiten. </p> <p> Dieses Tutorial enthält Anweisungen zum Freigeben von Ordnern und/oder Dateien in den Betriebssystemen Windows 10, 8, 8.1 oder 7. </p> <h4> So aktivieren Sie die Dateifreigabe in Windows. </h4> <h5> Schritt 1. Fügen Sie Ihrem PC erforderliche Benutzer hinzu. </h5> <p> Bevor Sie Ihre Dateien mit anderen teilen, fügen Sie die Benutzer hinzu, die Zugriff auf den freigegebenen Ordner auf dem Computer haben. Um diese Aufgabe auszuführen, befolgen Sie die Anweisungen in den folgenden Artikeln entsprechend Ihrer Windows-Version. </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-create-a-new-user-in-windows-7\" target=\"_blank\" rel=\"nofollow noopener\"> So fügen Sie einen neuen Benutzer in Windows 7 hinzu. </a></li> <li><a href=\"https://www.repairwin.com/how-to-add-a-new-user-account-in-windows-10-8/\" target=\"_blank\" rel=\"nofollow noopener\"> So fügen Sie einen neuen Benutzer in Windows 10/8.1 hinzu </a></li> </ul> <p> </p> <h5> Schritt 2. So teilen Sie einen Ordner oder eine Datei mit anderen. </h5> <p> 1. Klicken Sie mit der rechten Maustaste auf den Ordner (oder die Datei), den Sie teilen möchten, und wählen Sie <strong> Zugriff gewähren auf </strong> -&gt; <strong> Bestimmte Menschen. </strong></p> <p><img src=\"images/image_thumb-56-411.png\" alt=\"How to Share Files and Folders in Windows 10, 8.1, 7\" loading=\"lazy\"></p> <p> </p> <p> 2. Wählen Sie über das Dropdown-Menü den Benutzer aus, mit dem Sie Ihre Dateien teilen möchten, und klicken Sie dann auf <strong> Hinzufügen </strong> . </p> <p><img src=\"images/image_thumb-57-274.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Klicken Sie nun auf den Abwärtspfeil neben dem hinzugefügten Benutzer und geben Sie seine Zugriffsberechtigungen (Berechtigungsstufe) an. </p> <p><img src=\"images/image_thumb-58-517.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Wenn Sie fertig sind, drücken Sie die <strong> Teilen </strong> Taste, </p> <p><img src=\"images/image_thumb-59-431.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Notieren Sie sich den angegebenen Link zum freigegebenen Ordner* und klicken Sie auf <strong> Getan </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-60-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Zu diesem Zeitpunkt haben Sie die Dateifreigabe auf Ihrem Computer aktiviert. So greifen Sie von einem anderen PC auf den freigegebenen Ordner zu: </p> <blockquote><p> ein. Geben Sie in der Adressleiste des Explorers den Link zum freigegebenen Ordner ein, wie im vorherigen Schritt gezeigt. (z. B. &quot;\\\\DESKTOP-HMG31RD\\2Share&quot; ohne Anführungszeichen) <br> b. Drücken Sie <strong> Eingeben </strong> . <br> c. Geben Sie den Benutzernamen und das Passwort des Benutzers ein, dem Sie Zugriff gewährt haben, und drücken Sie <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-61-512.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Zusätzliche Information: <br> 1.Um die Berechtigungen des Benutzers zu ändern, folgen Sie einfach erneut dem obigen Verfahren und ändern Sie die Berechtigungsstufe des Benutzers. <br> 2. Wenn Sie die Dateifreigabe beenden möchten, klicken Sie mit der rechten Maustaste auf den freigegebenen Ordner/die Datei und gehen Sie zu <strong> Zugriff gewähren auf </strong> -&gt; und wählen <strong> Zugriff entfernen </strong> . </p> <p><img src=\"images/image_thumb-62-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um das Problem zu verbreiten. </p>"}