{"title":"So finden Sie den Windows Media Player in Windows 10.","content":"<p> Der Windows Media Player war über viele Jahre die Standardanwendung zum Abspielen von Musik und Videos. In Windows 10 ist der Windows Player nicht mehr der Standardplayer für die Mediendateien und wurde durch die App &quot;Filme und TV&quot; ersetzt. </p> <p> Dieser Artikel richtet sich an alle Benutzer, die den klassischen Windows Media Player als Standardplayer zum Abspielen ihrer Musik und Videos suchen und verwenden möchten. </p> <h4> So finden Sie den Windows Media Player in Windows 10. </h4> <p> Der schnellste Weg, um herauszufinden, ob der Windows Media Player auf Ihrem Computer installiert ist, besteht darin, ihn zu durchsuchen. Das zu tun: </p> <p> 1. Bei Cortanas Suchfeldtyp <strong> Windows Media Player </strong> . <br> 2. Wenn der Windows Media Player in den Ergebnissen aufgeführt ist, klicken Sie darauf, um das Programm zu starten. (Wenn nicht aufgeführt, dann weiter unten…) </p> <p><img src=\"images/image_thumb-66-377.png\" alt=\"How to Find Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> TRINKGELD: </strong> So legen Sie den Windows Media Player als Standardplayer für Ihre Videos und Musik fest: </p> <blockquote><p> 1. Navigieren Sie zu <strong> Start </strong> -&gt; <strong> die Einstellungen </strong> -&gt; <strong> Apps </strong> und wählen Sie <strong> Standard-Apps </strong> auf der linken Seite. <br> 2. At <strong> Musikspieler </strong> Optionen, klicken Sie auf <strong> Groove-Musik </strong> und wählen Sie dann die <strong> Windows Media Player </strong> . <br> 3. <strong> Unter Videoplayer-Optionen </strong> , klicken <strong> Filme &amp; Fernsehen </strong> und wählen Sie dann die <strong> Windows Media Player </strong> . </p> <p><img src=\"images/image_thumb-72-358.png\" alt=\"set windows media player default widnows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h4> So installieren Sie den Windows Media Player in Windows 10 Home, Pro. </h4> <p> Wenn der Windows Media Player nicht aufgeführt ist, können Sie ihn installieren, indem Sie zu: </p> <p> 1. <strong> Schalttafel </strong> -&gt; <strong> Programme und Funktionen </strong> . <br> 2. Klicken Sie auf <strong> Schalte Windows Funktionen ein oder aus </strong> von links. </p> <p><img src=\"images/image_thumb-68-342.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. At <strong> Medienfunktionen </strong> , wähle aus <strong> Windows Media Player </strong> und drücke <strong> OK </strong> . * </p> <p> * Hinweis: Wenn Sie eine Windows 10 N- oder KN-Version besitzen oder den Windows Media Player nicht über die „Windows-Funktionen“ installieren können, lesen Sie weiter unten… </p> <p><img src=\"images/image_thumb-69-565.png\" alt=\"How to Install Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> So laden Sie den Windows Media Player in den Windows 10 Home-, Pro-, N- und KN-Versionen herunter und installieren ihn. </h4> <p> Wenn Sie den Windows Player nicht mit den obigen Anweisungen installieren können oder wenn Sie Windows 10 N oder KN besitzen, können Sie den Windows Media Player für Windows 10 herunterladen, indem Sie die folgenden Anweisungen befolgen: </p> <p> 1. Laden Sie die . herunter <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48231\" target=\"_blank\" rel=\"nofollow noopener\"> Media Feature Pack für N- und KN-Versionen von Windows 10 </a> . </p> <p> * Hinweis: Laden Sie die . herunter <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package.msu </strong> zum <strong> 32-Bit-Betriebssystem, </strong> und der <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package_x64.msu </strong> zum <strong> 64-Bit-Betriebssystem. </strong></p> <p> 2. Führen Sie die heruntergeladene Datei aus und klicken Sie auf <strong> Ja </strong> auf dem ersten Bildschirm. </p> <p><img src=\"images/image_thumb-70-480.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Akzeptieren </strong> die Lizenzvereinbarung und warten Sie dann, bis die Installation abgeschlossen ist. </p> <p><img src=\"images/image_thumb-71-400.png\" alt=\"download windows media player windows 10\" loading=\"lazy\"></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}