{"title":"So starten Sie einen HP Server über die iLO-Schnittstelle neu.","content":"<p> In diesem Tutorial finden wir Schritt-für-Schritt-Anleitungen zum Remote-Neustart eines HP-Servers über die iLO-Schnittstelle von HP. HP Integrated Lights-Out (iLO) ist eine Hardwarekomponente auf den HP Servern, die normalerweise auf der Systemplatine integriert ist. Die iLO-Komponente verfügt über eine eigene Netzwerkverbindung, IP-Adresse und Webschnittstelle und kann dem Benutzer helfen, auf den Server zuzugreifen und ihn remote zu verwalten. </p> <h4> So starten Sie einen HP Server über die iLO 5-Webschnittstelle neu. </h4> <p> So starten Sie einen Server neu, wenn er hängen bleibt, über die iLO-Benutzeroberfläche: </p> <p> 1. Öffnen Sie auf einem anderen Computer einen Webbrowser und geben Sie in die Adressleiste die IP-Adresse der iLO-Schnittstelle auf dem Server ein, den Sie neu starten möchten. <br> 2. Geben Sie den iLO-Benutzernamen und das Kennwort ein und klicken Sie auf <strong> Einloggen </strong> . </p> <p><img src=\"images/image_thumb-8-790.png\" alt=\"restart hp proliant server from ilo\" loading=\"lazy\"></p> <p> </p> <p> 3. Wählen Sie <strong> Strom &amp; Thermik </strong> links. <br> 4. Klicken Sie im Abschnitt Virtueller Netzschalter auf die Schaltfläche <strong> Zurücksetzen </strong> um Ihren HP Server neu zu starten. * </p> <p> * Die Info: </p> <ul> <li> Das virtuelle <strong> Zurücksetzen </strong> Taste hat die gleiche Funktion wie die <strong> Neu starten </strong> Befehl im Betriebssystem (Warmstart). </li> <li> Das virtuelle <strong> Kaltstart </strong> Taste hat die gleiche Aktion wie die <strong> Schließen </strong> Befehl im Betriebssystem. Wenn Sie die Schaltfläche „Cold Boot“ drücken, wird der Server heruntergefahren und nach ca. 8 Sekunden neu gestartet. </li> </ul> <p> <img src=\"images/image_thumb-9-784.png\" alt=\"How to Reboot an HP Server using iLO 5 web interface.\" loading=\"lazy\"></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}