{"title":"So fügen Sie ein neues Benutzerkonto in Windows 10/8/8.1 hinzu","content":"<p> Eine der Funktionen von Windows 10 besteht darin, ein Microsoft Online-Konto auf Ihrem PC (oder Gerät) hinzuzufügen, um alle Microsoft-Dienste (E-Mail, moderne Apps, Xbox-Spiele, Skype, OneDrive usw.) mit einem Konto zu verwenden. Wenn Sie ein Microsoft-Konto in Windows 10 einrichten, können Sie sich außerdem von jedem anderen Windows 10-Gerät (das mit dem Internet verbunden ist) anmelden und alle Ihre Apps, Einstellungen und Passwörter auf dem neuen Gerät synchronisieren. </p> <p> Wenn Sie &#39;kein Interesse an der Nutzung des Windows Store haben oder die Vorteile eines Microsoft Online-Kontos nicht nutzen möchten, dann ist es besser, ein lokales Konto in Windows 10 einzurichten ist immer sicherer als ein Microsoft-Onlinekonto und funktioniert immer, unabhängig von der Internetverbindung. </p> <p> Dieses Tutorial zeigt Baum (3) verschiedene Methoden zum Hinzufügen eines neuen Benutzerkontos in Windows 10 und Windows 8.1, falls Sie es benötigen. (z.B. wenn Sie Ihren Computer oder Ihre Dateien mit anderen teilen möchten). </p> <h2> So erstellen Sie einen neuen Benutzer in Windows 10, 8.1. </h2> <p><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Methode 1. Erstellen Sie ein neues Konto aus den Einstellungsoptionen. </a></p> <p><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Methode 2. Fügen Sie ein neues Konto hinzu, indem Sie das Dienstprogramm &quot;Benutzerkonten&quot; in Windows 10/8 verwenden. </a></p> <p><a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"> Methode 3. Erstellen Sie einen neuen Benutzer mit der Eingabeaufforderung in Windows 10/8. </a></p> <p> </p> <h6> Methode 1. So erstellen Sie ein neues Konto aus den Einstellungen in Windows 10. </h6> <p> 1. Melden Sie sich mit einem Administratorkonto bei Windows an. </p> <p> 2. Öffnen <strong> die Einstellungen </strong> <img src=\"images/image_thumb-50-534.png\" alt=\"image\" loading=\"lazy\"> und dann klick <strong> Konten </strong> . </p> <p><img src=\"images/image_thumb-43-324.png\" alt=\"How to Add a New User in Windows 10, 8.1.\" loading=\"lazy\"></p> <p> </p> <p> 3. Wählen Sie <strong> Familie und andere Benutzer </strong> links und dann klick <strong> Fügen Sie diesem PC eine andere Person hinzu. </strong></p> <p><img src=\"images/image_thumb-49-471.png\" alt=\"create new account windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Auf dem nächsten Bildschirm: </p> <blockquote><p> A. Wenn Sie ein neues Microsoft-Konto auf dem PC hinzufügen möchten, geben Sie die E-Mail-Adresse der neuen Person ein und klicken Sie auf <strong> Nächster </strong> . </p> <p> B. Wenn Sie ein neues lokales Konto hinzufügen möchten (wie in diesem Beispiel), klicken Sie auf <strong> Ich habe die Anmeldeinformationen dieser Person nicht. </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-665.png\" alt=\"add local account windows 10\" loading=\"lazy\"></p> <p> 5. Dann klick <strong> Hinzufügen eines Benutzers ohne Microsoft-Konto </strong> . </p> <p><img src=\"images/image_thumb-42-715.png\" alt=\"add a non Microsoft account windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Geben Sie im nächsten Bildschirm einen Benutzernamen und ein Kennwort für das neue Konto ein. Wählen und beantworten Sie dann die angegebenen Sicherheitsfragen*, falls Sie das Passwort vergessen haben und wenn Sie fertig sind, klicken Sie auf <strong> Nächster </strong> . </p> <p> * Hinweis: Wenn Sie nicht alle diese &quot;dummen&quot; Sicherheitsfragen beantworten möchten, fahren Sie fort, um den neuen Benutzer hinzuzufügen, indem Sie die Methode-1 oder die Methode-2 unten verwenden. </p> <p><img src=\"images/image_thumb-46-912.png\" alt=\"add new user account windows 10-8\" loading=\"lazy\"></p> <p> </p> <p> 7. An dieser Stelle haben Sie die Erstellung eines neuen Standardbenutzers unter Windows 10 abgeschlossen. Wenn Sie dem neuen Benutzer jedoch Administratorrechte erteilen möchten: </p> <blockquote><p> ein. Wählen Sie den Benutzer aus und klicken Sie auf <strong> Kontotyp ändern. </strong></p></blockquote> <p><img src=\"images/image_thumb-47-574.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Ändern Sie auf dem nächsten Bildschirm den Kontotyp in &#39;Administrator&#39; und klicken Sie auf <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-48-850.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Methode 2. Fügen Sie ein neues Konto hinzu, indem Sie das Dienstprogramm &quot;Benutzerkonten&quot; in Windows 10/8 verwenden. </h6> <p> Eine meiner bevorzugten Methoden zum Hinzufügen (oder Entfernen) von Benutzern (in allen Windows-Versionen) ist die Verwendung des Dienstprogramms &quot;Benutzerkonten&quot;, das alle erforderlichen Optionen zur einfachen Verwaltung von Windows-Konten bietet. (Benutzer hinzufügen/entfernen, Benutzerberechtigungen angeben oder Benutzerkennwort ändern). </p> <p> 1. Melden Sie sich mit einem Administratorkonto bei Windows an. </p> <p> 2. Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-578.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 3. Geben Sie im Feld &quot;Öffnen&quot; Folgendes ein: <strong> Benutzerpasswörter kontrollieren2 </strong> &amp; klicken <strong> OK </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-29-910.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Klicken Sie auf der Registerkarte Benutzer auf das <strong> Hinzufügen </strong> Schaltfläche, um das Konto hinzuzufügen, das Sie auf Ihre Dateien zugreifen möchten. </p> <p><img src=\"images/image_thumb_thumb1_thumb-455.png\" alt=\"image_thumb_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> 5. Wählen Sie <strong> Ohne ein Microsoft-Konto anmelden </strong> Um ein lokales Konto zu erstellen, geben Sie die E-Mail-Adresse des Benutzers ein, wenn Sie ein Microsoft-Konto erstellen möchten </p> <p><img src=\"images/image_thumb-51-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Dann wähle <strong> Lokales Konto </strong> . </p> <p><img src=\"images/image_thumb-52-375.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Füllen Sie die erforderlichen Felder aus (Benutzername, Passwort &amp; Passworthinweis) und klicken Sie auf <strong> Nächster </strong> . </p> <p><img src=\"images/image_thumb-53-204.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Klicken Sie auf dem letzten Bildschirm auf <strong> Fertig </strong> . </p> <p> 9. Wenn Sie schließlich den neuen Benutzer als Administrator auf dem Computer festlegen möchten: </p> <blockquote><p> ein. Markieren Sie den Benutzer und wählen Sie <strong> Eigenschaften </strong></p></blockquote> <p><img src=\"images/image_thumb-54-635.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Dann bei <strong> Gruppenmitgliedschaft </strong> Tab, platzieren Sie die Kugel auf <strong> Administrator </strong> und klicke <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-55-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Methode 3. So erstellen oder löschen Sie einen Benutzer mit der Eingabeaufforderung in Windows 10/8/7 OS. </h6> <p> Die einfachste Methode zum Hinzufügen oder Entfernen von Benutzern in allen Windows-Versionen ist die Verwendung der Eingabeaufforderung. </p> <p> So fügen Sie ein neues Konto über die Eingabeaufforderung hinzu: </p> <p> 1. Öffnen <strong> Eingabeaufforderung als Administrator </strong> . <br> 2. Geben Sie an der Eingabeaufforderung den folgenden Befehl ein und drücken Sie <strong> Eingeben </strong> : </p> <ul> <li><strong> net user username passwort /add </strong></li> </ul> <p> * Hinweis: Ändern Sie bei obigem Befehl die Felder &quot;Benutzername&quot; &amp; &quot;Passwort&quot; nach Ihrer Wahl. </p> <blockquote><p> z.B. Wenn Sie ein neues Konto mit dem Benutzernamen &quot;John&quot; und dem Passwort &quot;Pas123&quot; erstellen möchten, geben Sie Folgendes ein: </p> <ul> <li> net-Benutzer John Pas123 /add </li> </ul> </blockquote> <p><img src=\"images/image_thumb13_thumb-169.png\" alt=\"add account command prompt windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <p> 3. Wenn Sie den neuen Benutzer schließlich zur Gruppe Administratoren hinzufügen möchten, geben Sie diesen Befehl ein: </p> <ul> <li><strong> Benutzername der net localgroup-Administratoren /add </strong></li> </ul> <blockquote><p> z.B. In unserem Beispiel lautet der Befehl: </p> <ul> <li> net localgroup-Administratoren John /add </li> </ul> </blockquote> <p><img src=\"images/image_thumb16_thumb-668.png\" alt=\"image_thumb[16]\" loading=\"lazy\"></p> <p> </p> <p> So löschen Sie einen Benutzer aus der Eingabeaufforderung: </p> <p> 1. Öffnen <strong> Eingabeaufforderung als Administrator </strong> . <br> 2. Geben Sie an der Eingabeaufforderung den folgenden Befehl ein und drücken Sie <strong> Eingeben </strong> : </p> <ul> <li><strong> net-Benutzer-Benutzername /löschen </strong></li> </ul> <p> z.B. Wenn Sie den Benutzer &quot;John&quot; löschen möchten, geben Sie Folgendes ein: </p> <ul> <li> net-Benutzer John /delete </li> </ul> <p><img src=\"images/image_thumb19_thumb-438.png\" alt=\"image_thumb[19]\" loading=\"lazy\"></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um das Problem zu verbreiten. </p>"}