{"title":"So aktualisieren Sie Chrome-Komponenten und Google Chrome manuell.","content":"<p> Immer wenn ein neues Chrome-Update verfügbar ist, fordert Google Chrome den Benutzer auf, den Browser neu zu starten, um das Update zu installieren. Aber manchmal kann Chrome nach der Installation des Updates abstürzen oder einfrieren. Dies liegt daran, dass Chrome mehrere einzelne Komponenten enthält, die möglicherweise noch nicht aktualisiert wurden und in diesem Fall manuell aktualisiert werden müssen. </p> <p> Diese Anleitung enthält Anweisungen zum manuellen Aktualisieren von Chrome und einzelnen Chrome-Komponenten. </p> <h4> So aktualisieren Sie Google Chrome und Chrome-Komponenten manuell. </h4> <h6> Teil 1. So aktualisieren Sie Google Chrome manuell. </h6> <p> So installieren Sie die neueste Version von Google Chrome: </p> <p> 1. Über das Chrome-Menü <img src=\"images/image_thumb-4-667.png\" alt=\"image\" loading=\"lazy\"> klicken <strong> Hilfe -&gt; Über Google Chrome </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-39-551.png\" alt=\"How to Update Chrome manually\" loading=\"lazy\"></p> <p> </p> <p> 2. Google Chrome sucht nach Updates und installiert dann automatisch das letzte Update. </p> <p><img src=\"images/image_thumb-40-825.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Wenn das Update abgeschlossen ist, klicken Sie auf <strong> Neustart </strong> Taste. </p> <p><img src=\"images/image_thumb-41-622.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Teil 2. So aktualisieren Sie einzelne Chrome-Komponenten. </h6> <p> 1. Geben Sie in die Adressleiste von Chrome Folgendes ein: </p> <ul> <li><strong> chrome://komponenten </strong></li> </ul> <p> 2. Klicken Sie auf das <strong> Auf Update überprüfen </strong> Schaltfläche an jeder Chrome-Komponente, die Sie aktualisieren möchten. </p> <p><img src=\"images/image_thumb-42-446.png\" alt=\"How to Update Chrome Components\" loading=\"lazy\"></p> <p> </p> <p> 3. Wenn Sie mit der Aktualisierung fertig sind, starten Sie Chrome neu. </p> <p> Zusätzliche Hilfe: Wenn Sie nach dem Aktualisieren von Chrome und seinen Komponenten Probleme mit Ihrem Browser haben, fahren Sie fort mit <a href=\"https://www.repairwin.com/how-to-uninstall-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Chrome vollständig entfernen und neu installieren </a> . </p> <p> Das ist alles! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}