{"title":"So entfernen Sie den BitLocker-Schutz vom Systemlaufwerk C: Ohne den BitLocker-Wiederherstellungsschlüssel oder das Kennwort.","content":"<p> Dieser Artikel enthält schrittweise Anweisungen zum Entfernen des BitLocker-Schutzes auf dem Systemlaufwerk C: um Windows 10 auf einem mit BitLocker geschützten Computer neu installieren zu können, wenn Sie nicht über den BitLocker-Wiederherstellungsschlüssel oder das BitLocker-Kennwort verfügen wenn Sie das BitLocker-Laufwerk aus irgendeinem Grund nicht entsperren können. </p> <p><img src=\"images/image_thumb-51-648.png\" alt=\"Fix Refresh your PC error: Drive where windows is installed is locked\" loading=\"lazy\"></p> <p> </p> <p> Wenn ein Windows 10-Gerät (Laptop oder PC) mit dem BitLocker geschützt ist, dann die einzige Möglichkeit, auf seinen Inhalt zuzugreifen oder das Gerät zurückzusetzen (mit den Funktionen &quot;Diesen PC zurücksetzen&quot;, &quot;Ihren PC aktualisieren&quot;) oder neu zu installieren Windows besteht darin, das Betriebssystemlaufwerk C: mithilfe des BitLocker-Wiederherstellungsschlüssels oder des BitLocker-Kennworts zu entsperren. </p> <p> Wenn Sie den BitLocker-Wiederherstellungsschlüssel oder das BitLocker-Kennwort zum Entsperren des Systemlaufwerks C: nicht haben oder der BitLocker-Schlüssel nicht akzeptiert wird, bleibt Ihnen (leider) nur die Möglichkeit, das Laufwerk vollständig zu löschen und eine saubere Windows-Installation. </p> <p> In diesem Tutorial finden Sie Anweisungen zur Behebung des folgenden Problems beim Versuch, Windows 10 zu installieren oder ein Windows 10-Gerät auf die Werkseinstellungen zurückzusetzen: „Das Laufwerk, auf dem Windows installiert ist, ist gesperrt &quot;. </p> <h4> So bereinigen Sie die Installation von Windows 10 auf einem mit BitLocker geschützten Computer (FIX: Windows 10 kann nicht installiert/aktualisiert werden – Laufwerk ist mit BitLocker gesperrt.) </h4> <p><strong> Anforderung: </strong> <strong> Ein Windows 10-Installationsmedium (USB oder DVD). </strong><br> Wenn Sie kein Windows-Installationsmedium besitzen, können Sie eines erstellen, indem Sie verwenden <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Das Media Creation-Tool von Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> So erstellen Sie ein Windows 10 USB-Installationsmedium. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> So erstellen Sie ein Windows 10-DVD-Installationsmedium. </a></li> </ul> <p> Um eine Neuinstallation von Windows 10 auf einem durch BitLocker geschützten Computer/Laufwerk durchzuführen, befolgen Sie die folgenden Anweisungen: * </p> <p><strong> * VORSICHT: DAS FOLGENDE VERFAHREN WERDEN ALLE GESPEICHERTEN DATEN AUF DEM GESPERRTEN LAUFWERK LÖSCHEN. NUR FORTFAHREN, WENN SIE <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> DAS BITLOCKER-GESCHÜTZTE LAUFWERK/COMPUTER KANN NICHT ENTRIEGELT WERDEN. </a></strong></p> <p> 1. Starten Sie Ihr System vom Windows 10-Installationsmedium. * </p> <p> * Hinweis: <strong> </strong> Um von Windows Media (USB oder DVD) booten zu können, gehen Sie wie folgt vor: </p> <ul> <li><strong> Methode 1: </strong> Drücken Sie nach dem Einschalten die entsprechende Funktionstaste (normalerweise die Taste &quot;F12&quot; oder &quot;F8&quot;), um die Optionen &quot;Boot Order&quot; oder &quot;Boot Menu&quot; anzuzeigen. Wählen Sie dann das USB-Gerät (oder die DVD) aus, das die Windows-Installationsmedien (Dateien) enthält, und drücken Sie die Eingabetaste. </li> <li><strong> Methode 2: </strong> Rufen Sie das BIOS-Setup (Einstellungen) auf und stellen Sie das Windows-Installationsmedium als &quot;Erstes Startgerät&quot; im Menü &quot;Startreihenfolge&quot; ein. Dann <strong> Speichern und schließen </strong> aus den BIOS-Einstellungen. </li> </ul> <p> 2. Drücken Sie im unteren Bildschirm die <strong> VERSCHIEBUNG </strong> + <strong> F10 </strong> Tasten zum Starten der Eingabeaufforderung. (oder drücke <strong> Nächster </strong> &gt; <strong> Meinen Computer reparieren </strong> &gt; <strong> Fehlerbehebung </strong> &gt; <strong> Eingabeaufforderung </strong> ). * </p> <p> * Hinweis: Wenn Sie nach dem Wiederherstellungsschlüssel gefragt haben, klicken Sie auf <strong> Dieses Laufwerk überspringen </strong> . </p> <p><img src=\"images/image_thumb15_thumb-290.png\" alt=\"How to Remove Updates from the Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. Geben Sie in der Eingabeaufforderung die folgenden Befehle der Reihe nach ein: </p> <ul> <li><strong> Diskpart </strong></li> <li><strong> Listendiskette </strong></li> <li><strong> Datenträger auswählen 0 </strong></li> <li><strong> Listenvolumen </strong></li> </ul> <p> 4. Suchen Sie nun, welches der aufgelisteten Volumes die größere Größe in GB hat. Normalerweise befindet sich das größere Volume dort, wo Windows installiert ist (das gesperrte Laufwerk). * </p> <p> * z.B. Auf dem unteren Screenshot hat das &quot;Volume 2&quot; die größere Größe. </p> <p> </p> <p><img src=\"images/image_thumb-10-992.png\" alt=\"fix drive is locked Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Wählen Sie dann das größere Volumen aus, indem Sie diesen Befehl eingeben: * </p> <ul> <li><strong> Wählen Sie die Bandnummer </strong></li> </ul> <p> * Hinweis: Ändern Sie die Volume-Nummer beim obigen Befehl entsprechend Ihrem Fall (z. B. &quot;select volume 2&quot;) </p> <p> 5. Löschen Sie abschließend das ausgewählte Volume, indem Sie diesen Befehl eingeben: </p> <p> </p> <ul> <li><strong> Volumenüberschreibung löschen </strong></li> </ul> <p><img src=\"images/image_thumb-14-714.png\" alt=\"delete volume override\" loading=\"lazy\"></p> <p> </p> <p> 6. Typ <strong> Ausfahrt </strong> , um das DISKPART-Tool zu schließen und dann die Eingabeaufforderung zu schließen. <br> 7. Schalten Sie Ihr Gerät aus und dann wieder EIN. <br> 8. Booten Sie vom Windows-Installationsmedium. <br> 9. Klicken Sie auf <strong> Nächster </strong> und dann <strong> Jetzt installieren </strong> . <br> 10. Wählen Sie &quot;Ich habe keinen Produktschlüssel&quot; und akzeptieren Sie dann die Lizenzvereinbarung. <br> 11. Wählen Sie &quot;Benutzerdefinierte Installation&quot; und löschen Sie alle restlichen Partitionen/Volumes auf der Festplatte. </p> <p><img src=\"images/image_thumb-12-362.png\" alt=\"cannot reset windows 10 drive locked with bitlocker\" loading=\"lazy\"></p> <p> </p> <p> 12. Wenn Sie fertig sind, wählen Sie &quot;Nicht zugewiesener Speicherplatz&quot; und klicken Sie auf <strong> Nächster. <br> </strong> 13. Folgen Sie den Anweisungen auf dem Bildschirm, um <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Neuinstallation von Windows 10 </a> . </p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um das Problem zu verbreiten. </p>"}