{"title":"So öffnen Sie Chrome immer im Inkognito-Modus.","content":"<p> Wenn Sie nach einer Möglichkeit suchen, Chrome immer im Inkognito-Modus zu öffnen, lesen Sie weiter unten. Wenn Sie Chrome im Inkognito-Modus starten, bleiben Ihre Browseraktivitäten für andere Nutzer, die dasselbe Gerät verwenden, privat. Im Inkognito-Modus speichert Chrome Ihren Browserverlauf, Cookies und die in Formularen eingegebenen Informationen nicht. </p> <p> Der manuelle Weg, um eine neue Chrome-Sitzung im Inkognito-Modus zu starten, besteht darin, zum Chrome-Menü zu gehen <img src=\"images/image_thumb10_thumb-963.png\" alt=\"image_thumb[10]\" loading=\"lazy\"> und &quot;Neues Inkognito-Fenster&quot; auswählen oder STRG + UMSCHALT + N drücken. </p> <p><img src=\"images/image_thumb-42-832.png\" alt=\"Chrome New incognito window\" loading=\"lazy\"></p> <p> </p> <p> In diesem Artikel finden Sie Anweisungen, wie Sie Google Chrome immer im Inkognito-Modus starten. </p> <h4> So starten Sie Google Chrome immer im Inkognito-Modus. </h4> <p> Wenn Sie Chrome immer im Inkognito-Modus starten möchten, erstellen Sie eine neue Chrome-Verknüpfung und ändern Sie ihre Eigenschaften wie folgt: </p> <p> 1, <strong> Rechtsklick </strong> auf <strong> Google Chrome </strong> Verknüpfung und wählen Sie <strong> Eigenschaften </strong> . <br> 2. At <strong> Allgemeines </strong> fügen Sie den Schalter &quot;–inkognito&quot; (ohne Anführungszeichen) am Ende der Zielzeile hinzu und klicken Sie auf <strong> OK </strong> : </p> <p> z.B. &quot;C:\\Programme\\Google\\Chrome\\Application\\chrome.exe&quot; –inkognito </p> <p><img src=\"images/image_thumb-43-798.png\" alt=\"How to Always Open Chrome in Incognito mode.\" loading=\"lazy\"></p> <p> 3. Wenn Sie Chrome von nun an über die geänderte Verknüpfung starten, wird Chrome im Inkognito-Modus geöffnet. * </p> <p><strong> * TRINKGELD: </strong> Wenn Sie Chrome im Inkognito-Modus öffnen möchten, müssen Sie beim Öffnen eines Hyperlinks (URL) aus Ihrer E-Mail oder einem anderen Programm die Registrierung ändern. Das zu tun: </p> <blockquote> <p> 1. Öffnen Sie die <strong> Registierungseditor </strong> . <br> 2. Navigieren Sie in der Registrierung zum folgenden Schlüssel: </p> <ul> <li> <p> HKEY_CLASSES_ROOT\\ChromeHTML\\shell\\open\\command </p> </li> </ul> <p> 3. Doppelklicken Sie im rechten Bereich auf das <strong> Standard </strong> REG_SZ-String-Wert. </p> </blockquote> <p><img src=\"images/image_thumb-44-612.png\" alt=\"open url in chrome incognito\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4.  Fügen Sie den Schalter hinzu, fügen Sie das Wort &quot;inkognito&quot; (ohne Anführungszeichen) vor &quot;%1&quot; hinzu und klicken Sie auf <strong> OK </strong> . </p></blockquote> <blockquote><p> z.B. Ändern Sie die Wertdaten von: </p> <p> &quot;C:\\Programme\\Google\\Chrome\\Application\\chrome.exe&quot; — &quot;%1&quot; </p> <p> zu: </p> <p> „C:\\Programme\\Google\\Chrome\\Application\\chrome.exe“ – inkognito „%1“ </p></blockquote> <p><img src=\"images/image_thumb-45-148.png\" alt=\"open url chrome incognito - registry\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Von nun an öffnet Chrome beim Klicken auf eine URL (HTML) diese im Inkognito-Modus. </p></blockquote> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}