{"title":"So entschlüsseln Sie mit EFS verschlüsselte Dateien und entfernen die EFS-Verschlüsselung in Windows 10.","content":"<p> In einem früheren Tutorial hatte ich den Weg beschrieben <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Verschlüsseln Sie Ihre Dateien mit der EFS-Verschlüsselung </a> . In diesem Tutorial erfahren Sie, wie Sie die EFS-Verschlüsselung entfernen und die EFS-verschlüsselten Dateien nach der Übertragung auf einen anderen Computer entschlüsseln. </p> <h4> So entschlüsseln Sie die EFS-verschlüsselten Dateien und deaktivieren Sie die EFS-Verschlüsselung. </h4> <ul> <li> <p><a href=\"#part-1\"> Teil 1. So deaktivieren und entfernen Sie die EFS-Verschlüsselung auf demselben PC. </a></p> </li> <li> <p><a href=\"#part-2\"> Teil 2. So entschlüsseln Sie EFS-Dateien auf einem anderen PC. </a></p> </li> </ul> <h6> Teil 1. So deaktivieren und entfernen Sie die EFS-Verschlüsselung. </h6> <p> Wenn Sie Ihre Dateien mit EFS verschlüsseln, wird der Entschlüsselungsschlüssel (Zertifikat) lokal auf Ihrem Computer gespeichert und die Dateien sind bereits entschlüsselt. Wenn Sie die EFS-Verschlüsselung deaktivieren möchten, um die Verschlüsselung Ihrer Dateien/Ordner zu stoppen: </p> <p> 1. Klicken Sie mit der rechten Maustaste auf den verschlüsselten Ordner/die Datei und ändern Sie die <strong> Dateieigentum </strong> zu <strong> persönlich </strong> . </p> <p><img src=\"images/image_thumb-26-500.png\" alt=\"how to disable efs encryption\" loading=\"lazy\"></p> <p> 2. Wenn Sie fertig sind, sollten Sie sehen, dass der Ordner/die Datei entsperrt ist. Führen Sie einfach die gleichen Schritte aus, um die Verschlüsselung für alle anderen verschlüsselten Ordner und Dateien zu entfernen. </p> <p> 3. Wenn Sie nun die EFS-Verschlüsselung für keine anderen Dateien/Ordner verwenden und den EFS-Wiederherstellungsschlüssel (auch bekannt als &quot;Entschlüsselungsschlüssel - Zertifikat&quot;) vollständig von Ihrem PC entfernen möchten: </p> <blockquote> <p> 1. Öffnen Sie den Internet Explorer und aus dem <strong> Werkzeuge </strong> Menüauswahl <strong> Internet Optionen </strong> . (oder, öffnen <strong> Internet Optionen </strong> von <strong> Schalttafel </strong> .) </p> <p> 2. At <strong> Inhalt </strong> Tab-Klick <strong> Zertifikate </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-27-186.png\" alt=\"how to remove efs certificate-recovery key\" loading=\"lazy\"></p> <blockquote> <p> 3. Wählen Sie auf der Registerkarte Persönlich das Entschlüsselungszertifikat aus und klicken Sie auf <strong> Entfernen </strong> . * </p> <p><strong> * Beachtung: </strong> Stellen Sie sicher, dass Sie die Verschlüsselung für alle verschlüsselten Dateien entfernt (gestoppt) haben, bevor Sie das Zertifikat (Entschlüsselungsschlüssel) entfernen. </p> </blockquote> <p><img src=\"images/image_thumb-25-639.png\" alt=\"how to remove efs recovery key\" loading=\"lazy\"></p> <blockquote> <p> 4. <strong> Neu starten </strong> dein Computer. </p> </blockquote> <h6></h6> <h6> Teil 2: So entschlüsseln Sie die EFS-verschlüsselten Dateien auf einem anderen Computer. </h6> <p> Wenn Sie die EFS-verschlüsselten Dateien auf einen anderen Computer übertragen haben, besteht die einzige Möglichkeit zum Anzeigen (Öffnen) der EFS-Dateien darin, den Entschlüsselungsschlüssel zu besitzen. Der Entschlüsselungsschlüssel ist die .pfx-Zertifikatsdatei, die Sie beim Verschlüsseln der Dateien exportiert haben. Wenn Sie den EFS-Entschlüsselungsschlüssel nicht haben, gibt es keine Möglichkeit, die EFS-Dateien zu entschlüsseln. </p> <p><strong> So entschlüsseln Sie EFS-verschlüsselte Dateien mit dem Entschlüsselungsschlüssel – Zertifikat: </strong></p> <p> 1. Doppelklicken Sie auf den Entschlüsselungsschlüssel (Zertifikat-.pfx-Datei), um ihn zu installieren. <br> 2. Klicken Sie auf dem Begrüßungsbildschirm des Assistenten zum Importieren von Zertifikaten auf <strong> Nächster </strong> . <br> 3. Dann klick <strong> Nächster </strong> nochmal. </p> <p><img src=\"images/image_thumb38_thumb-158.png\" alt=\"How to Decrypt EFS Encrypted files\" loading=\"lazy\"></p> <p> 4. Geben Sie das Kennwort ein, das Sie beim Exportieren des Zertifikatsschlüssels verwendet haben, und klicken Sie auf <strong> Nächster </strong> . </p> <p><img src=\"images/image_thumb39_thumb-680.png\" alt=\"install efs .pfx certificate\" loading=\"lazy\"></p> <p> 5. Belassen Sie die Standardeinstellungen bei den Zertifikatspeicheroptionen und klicken Sie auf <strong> Nächster </strong> . </p> <p><img src=\"images/image_thumb40_thumb-629.png\" alt=\"image_thumb[40]\" loading=\"lazy\"></p> <p> 6. Endlich klick <strong> Fertig </strong> . </p> <p><img src=\"images/image_thumb41_thumb-225.png\" alt=\"image_thumb[41]\" loading=\"lazy\"></p> <p> </p> <p> 7. Jetzt können Sie die verschlüsselten Dateien öffnen. * </p> <p> * Hinweis: Folgen Sie nach dem Entschlüsseln der Dateien den Anweisungen unter <a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> Teil 1 </a> oben, um die Verschlüsselung bei Bedarf vollständig zu entfernen. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht über diese Lösung zu verbreiten </p>"}