{"title":"So erstellen Sie Schattenkopien von Dateien mit dem Taskplaner in Windows 10.","content":"<p> In einem früheren Tutorial habe ich erwähnt, wie Sie Ihre persönlichen Dateien sichern können <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Dokumentenhistorie </a> in Windows 10. In diesem Tutorial zeige ich, wie Sie mit dem Taskplaner automatisch Schattenkopien Ihrer persönlichen Dateien erstellen. Mit den Schattenkopien Ihrer Dateien können Sie eine bestimmte Datei oder einen bestimmten Ordner auf eine frühere Version (Zeitpunkt) zurücksetzen. </p> <p> Die Schattenkopiefunktion wurde zuerst in Windows Server 2003 eingeführt und dann als Teil der Systemwiederherstellungsfunktion zu den Versionen von Windows Vista und 7 hinzugefügt. Der &#39;Schattenkopie&#39;-Prozess kann Sicherungskopien und Snapshots des aktuellen Systemstatus und persönlicher Dateien erstellen, auch wenn diese verwendet werden. Der Vorgang der Wiederherstellung von Dateien aus den Schattenkopien wird allgemein als &quot;Vorherige Versionen wiederherstellen&quot; bezeichnet. </p> <h4> So erstellen Sie täglich eine Schattenkopie Ihrer Dateien in Windows 10. * </h4> <p><strong> * Anmerkungen: </strong><br> 1. Mit den folgenden Anweisungen können Sie täglich Schattenkopien (Schnappschüsse) des gesamten Volumes &quot;C:\\&quot; erstellen. (Windows-Systemdateien und persönliche Daten) <br> 2. Die Schattenkopien können verwendet werden, um Ihre Dateien zu einem früheren Zeitpunkt wiederherzustellen, indem Sie die Funktion &quot;Vorherige Version wiederherstellen&quot; verwenden oder ein Dienstprogramm eines Drittanbieters verwenden, das auf die Schattenkopien zugreifen kann, wie z <a href=\"https://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> SchattenExplorer </a> oder der <a href=\"https://www.nirsoft.net/utils/shadow_copy_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowCopyView </a> . <br> 3. Die Schattenkopien <strong> kann nicht verwendet werden, um Ihr System wiederherzustellen </strong> zu einem früheren Zeitpunkt, indem Sie die <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> Systemwiederherstellung </a> Werkzeug. Wenn Sie Ihr System mithilfe der Systemwiederherstellung wiederherstellen möchten, fahren Sie fort und <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Aktivieren Sie den Schutz der Systemwiederherstellung. </a> <br> 4. Denken Sie abschließend daran, dass die erstellten Schattenkopien kein zuverlässiges Backup sind, da die &#39;Schattenkopien&#39; auf Ihrem Hauptlaufwerk C:\\ gespeichert werden und wenn das Laufwerk ausfällt, verlieren Sie alle Ihre Daten. Um eine zuverlässige Sicherung Ihrer Daten zu erstellen, lesen Sie die Anweisungen in diesem Artikel: <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> So sichern Sie persönliche Dateien mit dem Dateiversionsverlauf in Windows 10. </a></p> <p> </p> <p><strong> So erstellen Sie frühere Versionen Ihrer persönlichen Dateien mithilfe von Schattenkopien: </strong></p> <p> 1. Öffnen <strong> Aufgabenplaner </strong> . Wenn Sie nicht wissen, wie das geht, dann… </p> <blockquote><p> 1. Geben Sie im Suchfeld ein <strong> Aufgabe </strong> oder <strong> Aufgabenplaner </strong> . <br> 2. Öffnen Sie den &#39;Aufgabenplaner&#39; aus den Suchergebnissen. </p></blockquote> <p><img src=\"images/image_thumb-31-630.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Klicken Sie im Taskplaner auf <strong> Aufgabe erstellen </strong> . </p> <p><img src=\"images/image_thumb-23-462.png\" alt=\"How to Start ThrottleStop at Windows Startup\" loading=\"lazy\"></p> <p> </p> <p> 3. At <strong> Allgemeines </strong> Tab: </p> <blockquote><p> 1. Geben Sie als Namen für die Aufgabe &quot;Schattenkopie meiner Dateien erstellen&quot; ein. <br> 2. <strong> Prüfen </strong> das <strong> Mit höchsten Privilegien ausführen </strong> Box. </p></blockquote> <p> Hinweis: Wenn Sie die Aufgabe im Hintergrund starten möchten, setzen Sie einen Punkt bei <strong> Ausführen, ob der Benutzer angemeldet ist oder nicht </strong> Option und geben Sie dann Ihr Login-Passwort ein. </p> <p><img src=\"images/image_thumb-62-499.png\" alt=\"create shadow copies task windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Wählen Sie dann die <strong> Löst aus </strong> Tab und klicken Sie <strong> Neu </strong> . <br> 4a. Geben Sie im Fenster &quot;Neuer Auslöser&quot; an, wie oft ein Snapshot Ihrer Dateien erstellt werden soll, und klicken Sie auf <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-63-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Wählen Sie dann die <strong> Aktionen </strong> Tab und klicken Sie <strong> Neu </strong> . <br> 5a. Im Fenster „Neue Aktion“: </p> <blockquote><p> 1. Wählen Sie <strong> Starten Sie ein Programm </strong> . <br> 2. Geben Sie bei „Programm/Skript“ Folgendes ein: <strong> wmic </strong><br> 3. Geben Sie im Feld &#39;Argumente hinzufügen (optional)&#39; Folgendes ein: </p> <ul> <li><strong> Shadowcopy-Aufruf create Volume=C:\\ </strong></li> </ul> <p> 4. Wenn Sie fertig sind, klicken Sie auf <strong> OK. </strong></p></blockquote> <p><img src=\"images/image_thumb-66-640.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Klicken Sie auf <strong> OK </strong> erneut, um die Eigenschaften der geplanten Aufgabe zu schließen. </p> <p><img src=\"images/image_thumb-67-138.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Um Ihr erstes Backup zu erstellen, klicken Sie mit der rechten Maustaste auf die Aufgabe und wählen Sie <strong> Lauf </strong> . </p> <p><img src=\"images/image_thumb-68-388.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Du bist fertig! Wenn Sie von nun an eine Datei/einen Ordner in der vorherigen Version wiederherstellen möchten, klicken Sie mit der rechten Maustaste darauf und wählen Sie <strong> Wiederherstellung früherer Versionen </strong> . </p> <p><img src=\"images/image_thumb-69-568.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Nützliche Info: <br> </strong> 1. Der maximal zugewiesene Speicherplatz, der zum Speichern der Schattenkopien verwendet werden kann, ist der Speicherplatz, den die Systemwiederherstellung zum Speichern auf Wiederherstellungspunkten verwenden könnte. <br> 2. Um den verwendeten und den maximal zugewiesenen Speicherplatz für die Schattenkopien herauszufinden, geben Sie diesen Befehl in der Eingabeaufforderung (Admin) ein: </p> <ul> <li><strong> vssadmin list shadowstorage </strong></li> </ul> <p><img src=\"images/image_thumb-76-672.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Um den maximal zugewiesenen Speicherplatz für die Schattenkopien und die Systemwiederherstellungspunkte zu ändern, navigieren Sie zu <strong> Systemschutz </strong> Einstellungen für die <strong> Lokale Festplatte (C:) </strong><br> 4. Wenn Sie alle gespeicherten Schattenkopien löschen möchten, müssen Sie auch die gespeicherten Wiederherstellungspunkte löschen. Wenn Sie dies tun möchten, klicken Sie auf <strong> Alle Wiederherstellungspunkte löschen </strong> Schaltfläche in den Systemschutzeinstellungen. </p> <p><img src=\"images/image_thumb-77-662.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Das ist alles! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}