{"title":"So deaktivieren Sie BitLocker in Windows 10.","content":"<p> Dieses Tutorial enthält Anweisungen zum Deaktivieren des Bitlocker-Schutzes und der Laufwerksverschlüsselung in Windows 10. Wie Sie vielleicht wissen, kann Ihnen die BitLocker-Verschlüsselungsfunktion, die in Windows 10 Pro- und Enterprise-Versionen verfügbar ist, helfen, Ihre PC-Inhalte vor unbefugtem Zugriff zu schützen. Aber manchmal besteht die Notwendigkeit, den Bitlocker unter Windows 10 zu deaktivieren. In diesem Handbuch erfahren Sie, wie Sie dies tun. </p> <p> Wenn Ihr Computer mit BitLocker geschützt ist, werden Sie beim Starten des Systems aufgefordert, das USB-Laufwerk anzuschließen, das Sie während der BitLocker-Aktivierung verwendet haben, oder Ihr BitLocker-Passwort einzugeben, um das Laufwerk C: zu entsperren, um den Bootvorgang fortzusetzen. Wenn Sie keines davon haben, drücken Sie <strong> ESC </strong> um Ihren BitLocker-Wiederherstellungsschlüssel einzugeben. * </p> <blockquote><p> * Anmerkungen: <br> 1. Wenn der Bitlocker-Wiederherstellungsschlüssel oder das Passwort beim Systemstart nicht akzeptiert wird, versuchen Sie, die Festplatte auf einem anderen Windows 10-Computer zu entsperren und zu entschlüsseln, oder versuchen Sie Folgendes: <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-recovery-environment-winre/\" target=\"_blank\" rel=\"nofollow noopener\"> Entsperren und entschlüsseln Sie das geschützte Laufwerk in der Windows-Wiederherstellungsumgebung (WinRE). </a><br> 2. Wenn Sie das Laufwerk nicht entsperren können (z. B. wenn Sie den BitLocker-Wiederherstellungsschlüssel nicht besitzen oder der BitLocker-Schlüssel nicht akzeptiert wird) und Sie die BitLocker-Verschlüsselung entfernen möchten, um das geschützte Laufwerk wieder zu verwenden, dann lesen Sie dieses Tutorial: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> So entfernen Sie den BitLocker-Schutz von einem Laufwerk ohne den BitLocker-Wiederherstellungsschlüssel oder das Kennwort </a> . </p></blockquote> <p><img src=\"images/image_thumb-53-752.png\" alt=\"How to Disable BitLocker in Windows 10 GUI - PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Befolgen Sie nach dem Booten von Windows die folgenden Anweisungen, um den Bitlocker-Schutz zu deaktivieren und das Laufwerk zu entschlüsseln. </p> <h4> So deaktivieren Sie den BitLocker-Schutz und entschlüsseln ein mit Bitlocker verschlüsseltes Laufwerk in Windows 10. </h4> <p> Um den Bitlocker-Schutz zu deaktivieren, benötigen Sie das Bitlocker-Passwort oder den Bitlocker-Wiederherstellungsschlüssel, um das Laufwerk zuerst zu entsperren und dann das Laufwerk zu entschlüsseln. </p> <p> Der Bitlocker-Wiederherstellungsschlüssel ist ein 48-stelliger Zahlenschlüssel und kann an folgenden Orten gefunden werden: </p> <ul> <li> Auf einem Ausdruck, den Sie gespeichert haben, als Sie Bitlocker aktiviert haben. </li> <li> Auf einem USB-Laufwerk, das Sie während der Bitlocker-Aktivierung verwendet haben, um den Bitlocker-Wiederherstellungsschlüssel zu speichern. </li> <li> Bei der <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Schlüssel zur Wiederherstellung des Microsoft-Kontos </a> , indem Sie das MS-Konto verwenden, mit dem Sie sich auf Ihrem Gerät anmelden oder das Sie dem Gerät hinzugefügt haben, um Apps aus dem Microsoft Store herunterzuladen oder MS Office zu aktivieren oder für E-Mail. </li> <li> Auf Ihrem <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Azure-Konto </a> für Arbeits-PCs, die sich mit einem Azure Active Directory-Konto anmelden. </li> </ul> <p> Sobald Sie den Bitlocker-Wiederherstellungsschlüssel oder das Bitlocker-Passwort gefunden haben, fahren Sie fort, das mit Bitlocker verschlüsselte Laufwerk zu entsperren und die Bitlocker-Verschlüsselung auf eine der folgenden Weisen zu entfernen: </p> <ul> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Methode 1. Deaktivieren Sie den BitLocker-Schutz über die Windows-GUI. </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Methode 2. Deaktivieren Sie BitLocker und entschlüsseln Sie ein mit Bitlocker verschlüsseltes Laufwerk von PowerShell. </a></li> </ul> <p> </p> <h6> Methode 1. So deaktivieren Sie den Bitlocker-Schutz in der Windows 10-GUI. </h6> <p> So deaktivieren Sie den Schutz auf Ihrem Systemlaufwerk C: </p> <p> 1. Navigieren Sie zu Windows <strong> Schalttafel </strong> -&gt; <strong> System und Sicherheit </strong> und dann klick <strong> BitLocker-Laufwerkverschlüsselung </strong> . </p> <p><img src=\"images/image_thumb-33-233.png\" alt=\"How to turn off or Turn Onn BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Klicken Sie neben dem Betriebssystemlaufwerk C: auf <strong> BitLocker deaktivieren </strong> . * </p> <p> * Anmerkungen: <br> 1. Wenn die Option &quot;BitLocker deaktivieren&quot; nicht verfügbar ist, öffnen Sie <strong> Eingabeaufforderung als Administrator </strong> und geben Sie folgenden Befehl ein: </p> <ul> <li> manage-bde -off C: </li> </ul> <p> 2. Um den Entschlüsselungsstatus (Fortschritt) von Laufwerk C: anzuzeigen, geben Sie diesen Befehl ein: </p> <ul> <li> manage-bde -status C: </li> </ul> <p> </p> <p> </p> <p><img src=\"images/image_thumb-43-236.png\" alt=\"turn off bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Nachdem Sie Bitlocker ausgeschaltet haben, klicken Sie auf das Bitlocker-Symbol in der Taskleiste, um den Entschlüsselungsvorgang anzuzeigen. </p> <p><img src=\"images/image_thumb-41-694.png\" alt=\"remove bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> So deaktivieren Sie den Schutz auf einem anderen BitLocker-geschützten Laufwerk über die Windows-GUI: </p> <p> 1. Öffnen Sie den Windows Explorer und doppelklicken Sie dann auf das gesperrte Laufwerk. <br> 2. Geben Sie das Bitlocker-Passwort ein oder klicken Sie auf <strong> Mehr Optionen </strong> Geben Sie den Bitlocker-Wiederherstellungsschlüssel ein, um das Laufwerk zu entsperren. </p> <p><img src=\"images/image_thumb-47-646.png\" alt=\"unlock bitlocker windows 10\" loading=\"lazy\"></p> <p> 2. Nachdem Sie das Laufwerk entsperrt haben, navigieren Sie zu <strong> Schalttafel </strong> -&gt; <strong> System und Sicherheit </strong> -&gt; <strong> BitLocker-Laufwerkverschlüsselung </strong> und nach Auswahl des Laufwerks klicken <strong> BitLocker deaktivieren </strong> um das Laufwerk zu entschlüsseln. (siehe Screenshots oben) </p> <p> </p> <h6> Methode 2. So deaktivieren Sie den BitLocker-Schutz und entschlüsseln ein mit Bitlocker verschlüsseltes Laufwerk von PowerShell in Windows 10. </h6> <p> 1. Öffnen Sie PowerShell als Administrator. Das zu tun: </p> <ol> <li> <ol> <li> Beim <strong> Cortana </strong> &#39;s Suchfeld, geben Sie ein <strong> Power Shell </strong></li> <li> Rechtsklick auf <strong> Windows PowerShell </strong> Ergebnis und auswählen <strong> Als Administrator ausführen. </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb_thumb-1-316.png\" alt=\"disable bitlocker powershell windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Überprüfen Sie dann den Verschlüsselungsstatus jedes Laufwerks auf Ihrem Computer, indem Sie diesen Befehl eingeben: </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p> </p> <p> 3. Notieren Sie, in welchem ​​Laufwerksbuchstaben der Sperrstatus angezeigt wird <strong> Gesperrt </strong> , und fahren Sie dann mit dem Entsperren dieses Laufwerks fort, indem Sie diesen Befehl eingeben: * </p> <ul> <li><strong> manage-bde -unlock Laufwerksbuchstabe: -rp BitLocker-recovery-key​ </strong></li> </ul> <p> * Bsp.: Wenn Sie das Laufwerk &quot;D:&quot; entsperren möchten und der Bitlocker-Wiederherstellungsschlüssel lautet: &quot;123456-123456-123456-123456-123456-123456&quot; </p> <ul> <li> <ul> <li> manage-bde -unlock D: -rp 123456-123456-123456-123456-123456-123456 </li> </ul> </li> </ul> <p> </p> <p> * Hinweis: Wenn Sie das Bitlocker-Passwort kennen, geben Sie diesen Befehl ein: </p> <ul> <li><strong> manage-bde -Laufwerksbuchstabe entsperren: -pw BitLocker-Password </strong></li> </ul> <p> * Bsp.: Wenn Sie das Laufwerk &quot;D:&quot; entsperren möchten und das BitLocker-Passwort lautet: &quot;123qwerty&quot; dann geben Sie ein: * </p> <ul> <li> <ul> <li> manage-bde -unlock D: -Passwort 123qwerty </li> </ul> </li> </ul> <p> </p> <p> 4. Deaktivieren Sie dann die Bitlocker-Verschlüsselung und entschlüsseln Sie das verschlüsselte Laufwerk, indem Sie einen der folgenden Befehle verwenden: </p> <ul> <li><strong> Disable-BitLocker -MountPoint &quot;Laufwerksbuchstabe:&quot; </strong></li> <li><strong> manage-bde -off Laufwerksbuchstabe: </strong></li> </ul> <p> * Bsp.: Wenn Sie die Bitlocker-Verschlüsselung auf Laufwerk &quot;D:&quot; deaktivieren möchten, geben Sie Folgendes ein: </p> <ul> <li> <ul> <li> Disable-BitLocker -MountPoint &quot;D:&quot; </li> </ul> </li> </ul> <blockquote> <p> ODER Typ… </p> </blockquote> <ul> <li> <ul> <li> manage-bde –off D: </li> </ul> </li> </ul> <p> 5. Wenn der Entschlüsselungsprozess abgeschlossen ist, überprüfen Sie den Verschlüsselungsstatus erneut, indem Sie diesen Befehl eingeben: </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p> 6. Wenn der &#39;Sperrstatus&#39; angezeigt wird <strong> Entsperrt </strong> und der &#39;Konvertierungsstatus&#39; wird angezeigt <strong> Vollständig entschlüsselt, </strong> Sie sind fertig! </p> <p><img src=\"images/image_thumb-50-868.png\" alt=\"view bitlocker status\" loading=\"lazy\"></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um das Problem zu verbreiten. </p>"}