{"title":"So schützen Sie Ihren PC mit BitLocker in Windows 10.","content":"<p> Dieses Tutorial enthält Schritt-für-Schritt-Anleitungen zum Kennwortschutz Ihres PCs mit BitLocker-Verschlüsselung. Der BitLocker ist eine Funktion zur vollständigen Festplattenverschlüsselung, die in den Editionen Windows 10 Professional und Enterprise enthalten ist und Ihnen helfen kann, Ihre persönlichen Daten vor unbefugtem Zugriff zu schützen. </p> <p> Stellen Sie sich folgendes Szenario vor: Ihr persönlicher Laptop wird gestohlen oder geht verloren und Ihre privaten Daten sind für indiskrete Augen zugänglich. Um dies zu vermeiden, lesen Sie diese Anleitung und erfahren Sie, wie Sie Ihren PC und Ihre wertvollen Daten mit einer starken Verschlüsselung mit einem Kennwort schützen, damit jeder ohne das Entschlüsselungskennwort für niemanden zugänglich ist. </p> <ul> <li><strong> Verwandter Artikel: <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/\" target=\"_blank\" rel=\"nofollow noopener\"> So schützen Sie einen Ordner mit einem Passwort. </a></strong></li> </ul> <h4> So verwenden Sie BitLocker zum Verschlüsseln und Schützen Ihres Windows 10-PCs. </h4> <p> So schützen Sie das Betriebssystemlaufwerk mit BitLocker in Windows 10 Pro oder Enterprise: </p> <p> 1. Von Windows <strong> Schalttafel </strong> , klicken <strong> System und Sicherheit </strong> und dann klick <strong> BitLocker-Laufwerkverschlüsselung </strong> . </p> <p><img src=\"images/image_thumb-33-320.png\" alt=\"How to Protect your PC with BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Klicken Sie neben dem Betriebssystemlaufwerk C: auf <strong> Aktivieren Sie BitLocker </strong> . * </p> <p> * Hinweis: Wenn Sie nach dem Drücken von „BitLocker aktivieren“ die Fehlermeldung „Dieses Gerät kann kein Trusted Platform Module verwenden…“ erhalten, lesen Sie diesen Artikel, um das Problem zu beheben. </p> <p><img src=\"images/image_thumb-34-100.png\" alt=\"turn on bitlocker operating system drive\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Wählen Sie auf dem nächsten Bildschirm aus, wie Sie das Laufwerk beim Start entsperren möchten. </p> <blockquote><p> 1. Wenn Sie Ihren PC mit einem USB-Gerät entsperren möchten, klicken Sie auf <strong> Stecken Sie ein USB-Flash-Laufwerk ein. <br> </strong> 2. Wenn Sie Ihren PC durch Eingabe eines Passworts entsperren möchten, klicken Sie auf <strong> Geben Sie ein Passwort ein </strong> . (wie in diesem Beispiel) </p></blockquote> <p><img src=\"images/image_thumb-35-212.png\" alt=\"enable bitlocker protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Geben Sie nun ein sehr starkes Passwort ein und klicken Sie auf <strong> Nächster </strong> . </p> <p><img src=\"images/image_thumb-36-435.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Wählen Sie nun aus, wo Sie den Wiederherstellungsschlüssel speichern möchten* und klicken Sie auf <strong> Nächster </strong> . * </p> <p> * Beispiel: Wenn Sie sich mit einem Microsoft-Konto bei Windows 10 anmelden, klicken Sie auf <strong> Speichern Sie in Ihrem Microsoft-Konto. </strong> Wenn Sie sich mit einem lokalen Konto bei Windows 10 anmelden, wählen Sie eine der anderen Optionen. </p> <p> Anmerkungen: <br> 1. Wenn Sie den BitLocker-Wiederherstellungsschlüssel in Ihrem Microsoft-Konto speichern, können Sie den Schlüssel nach der Anmeldung bei <a title=\"https://onedrive.live.com/recoverykey.\" href=\"https://onedrive.live.com/recoverykey.\" target=\"_blank\" rel=\"nofollow noopener\"> https://onedrive.live.com/recoverykey. </a><br> 2. Ich bevorzuge es immer, den Wiederherstellungsschlüssel auf einem USB-Laufwerk zu speichern, um bereit zu sein, BitLocker-Probleme zu beheben. </p> <p> </p> <p><img src=\"images/image_thumb-37-801.png\" alt=\"save bitlocker recovery key\" loading=\"lazy\"></p> <p> </p> <p> 6. Belassen Sie auf dem nächsten Bildschirm die Standardeinstellung, wenn Ihr PC und/oder Ihr Laufwerk neu ist, und klicken Sie dann auf <strong> Nächster </strong> nochmal. </p> <p><img src=\"images/image_thumb-38-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Belassen Sie bei den Verschlüsselungsmodusoptionen die Standardeinstellung und klicken Sie <strong> Nächster </strong> . </p> <p><img src=\"images/image_thumb-39-785.png\" alt=\"bitlocker encryption mode\" loading=\"lazy\"></p> <p> </p> <p> 8. Klicken Sie auf dem letzten Bildschirm auf <strong> Fortsetzen </strong> , um das System neu zu starten und zu überprüfen, bevor Sie den BitLocker-Schutz aktivieren. </p> <p><img src=\"images/image_thumb-40-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Beim Neustart werden Sie aufgefordert, Ihr BitLocker-Kennwort einzugeben. Geben Sie Ihr Passwort ein und drücken Sie <strong> Eingeben </strong> . * </p> <p> * Hinweis: Wenn BitLocker das Kennwort nicht akzeptieren kann oder andere Probleme auftreten, versuchen Sie eine der folgenden Aktionen, um sich bei Windows anzumelden: </p> <blockquote><p> 1. Drücken Sie die ESC-Taste im Kennwort-Bildschirm von BitLocker, um auf die Wiederherstellungsoptionen zuzugreifen. <br> 2. Drücken Sie nach dem Einschalten Ihres PCs wiederholt die ESC-Taste, um den BitLocker-Test zu umgehen. </p></blockquote> <p> 10. Wenn die BitLocker-Tests erfolgreich waren, beginnt BitLocker nach dem Booten mit Windows 10, Ihr Betriebssystemlaufwerk zu verschlüsseln. Um den Status des Verschlüsselungsprozesses anzuzeigen, klicken Sie in der Taskleiste auf die BitLocker-Benachrichtigung oder gehen Sie zu Systemsteuerung &gt; BitLocker-Laufwerkverschlüsselung. </p> <p><img src=\"images/image_thumb-41-171.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}