{"title":"So blockieren Sie YouTube unter Windows 10.","content":"<p> Da Fernunterricht in den letzten Jahren zu einem Teil des Lebens von Kindern geworden ist, suchen viele Eltern nach einer Möglichkeit, YouTube-Videos während des E-Learnings zu blockieren oder die Zeit zu reduzieren, die Kinder vor einem Computer verbringen, um Videos anzusehen, anstatt andere Aktivitäten auszuführen. </p> <p> Neben der YouTube-Sucht, die Eltern beunruhigt, wurden in den letzten Jahren viele YouTube-Videos mit unangemessenen oder gefährlichen Inhalten für Kinder veröffentlicht und aus diesem Grund ist es notwendig, den YouTube-Zugriff einzuschränken, insbesondere wenn keine Aufsicht durch die Eltern besteht. </p> <p> In dieser Anleitung erfahren Sie, wie Sie den Zugriff auf die YouTube-Website in allen Browsern verhindern. * </p> <p> * Hinweis: Wenn Sie eine Website nur in Chrome oder in Firefox blockieren möchten, lesen Sie diesen Artikel: <a href=\"https://www.repairwin.com/block-websites-on-chrome-firefox/\" target=\"_blank\" rel=\"nofollow noopener\"> So blockieren Sie Websites in Chrome und Firefox. </a></p> <h2> So blockieren Sie YouTube in jedem Browser unter Windows 10, 8 oder 7 OS. </h2> <p> Der zuverlässigste Weg, eine Website in jedem Browser auf einem Windows-PC zu blockieren, ist die Verwendung der Datei &quot;hosts&quot;. Das <strong> Gastgeber </strong> file ist eine Betriebssystemdatei, die Hostnamen (Domänennamen) IP-Adressen zuordnet. In einfachen Worten, wenn Sie die Adresse einer Website in Ihren Browser eingeben, schaut der Computer zuerst auf die lokale <strong> Gastgeber </strong> Datei, um seine IP-Adresse aufzulösen. Wenn der Site-Name nicht in der Hostdatei angezeigt wird, versucht er, seine IP-Adresse über den DNS-Dienst zu ermitteln, den Sie auf Ihrem Gerät verwenden. </p> <p> So blockieren Sie YouTube in einem beliebigen Webbrowser (z. B. Chrome, Firefox, Edge usw.) unter Windows über die Hosts-Datei: </p> <p> 1. Öffnen <strong> Notizblock </strong> Anwendung <strong> als Administrator </strong> . Das zu tun: </p> <blockquote><p> ein. Art <strong> Notizblock </strong> im Suchfeld </p> <p> b. <strong> Rechtsklick </strong> auf <strong> Notizblock </strong> und wählen Sie <strong> Als Administrator ausführen </strong> . </p> <p><img src=\"images/image_thumb-584.png\" alt=\"run notepad as administrator\" loading=\"lazy\"></p></blockquote> <p> </p> <p> 2. Von <strong> Datei </strong> Menü, wählen <strong> Öffnen. <br> </strong> 3. Navigieren Sie zu diesem Speicherort auf Ihrer Festplatte: </p> <ul> <li> C:\\Windows\\System32\\drivers\\etc </li> </ul> <p> 4. Ändern Sie den &quot;Dateityp&quot; auf <strong> Alle Dateien </strong> und dann öffne die <strong> Gastgeber </strong> Datei </p> <p><img src=\"images/image_thumb-1-968.png\" alt=\"block sites hosts file\" loading=\"lazy\"></p> <p> </p> <p> 5. Fügen Sie am Ende die folgenden Zeilen hinzu:* </p> <ul> <li> 127.0.0.1    youtube.com </li> <li> 127.0.0.1    www.youtube.com </li> <li> 127.0.0.1    m.youtube.com </li> </ul> <p> * Hinweis: Drücken Sie die TAB-Taste, nachdem Sie 127.0.0.1 eingegeben haben </p> <p><img src=\"images/image_thumb-2-460.png\" alt=\"block youtube hosts\" loading=\"lazy\"></p> <p> </p> <p> 6. Wenn Sie fertig sind, klicken Sie auf <strong> Datei </strong> &gt; <strong> speichern </strong> und Notizblock schließen. </p> <p> 7. Öffnen Sie schließlich Ihren Browser und versuchen Sie, YouTube zu besuchen. Normalerweise sollten Sie die Meldung &quot;Verbindung mit dem Internet herstellen. Sie sind offline. Überprüfen Sie Ihre Verbindung&quot; erhalten. </p> <p><img src=\"images/image_thumb-3-490.png\" alt=\"block youtube.com hosts\" loading=\"lazy\"></p> <p> </p> <p> 8. Sie sind fertig. Wenn Sie YouTube in Zukunft entsperren möchten, führen Sie einfach die gleichen Schritte aus. aber diesmal entfernen Sie die drei (3) hinzugefügten Zeilen in der hosts-Datei oder geben Sie das Symbol ein <strong> # </strong> vor jeder hinzugefügten Zeile. </p> <p> Das war&#39;s Leute! Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}