{"title":"So melden Sie sich automatisch bei Windows 10/8/7 an (ohne ein Passwort einzugeben).","content":"<p> Dieses Tutorial enthält Anweisungen zur automatischen Anmeldung bei Windows 10. Tatsächlich erfahren Sie, wie Sie sich automatisch bei Ihrem Benutzerkonto (Microsoft-, Lokal- oder Domänenkonto) anmelden, ohne Ihre Anmeldeinformationen bei der Anmeldung oder beim Sperrbildschirm eingeben zu müssen . Die Anweisungen gelten für das Betriebssystem Windows 10/8/7. </p> <p> Wenn Sie eine neue Windows 10-Installation durchführen, werden Sie aufgefordert, ein Benutzerkonto und ein Kennwort für die Verwendung des Computers anzugeben. In diesem Schritt können Sie Ihr Microsoft-Konto (mit Ihrem MS-Kontokennwort) verwenden oder ein neues lokales Konto und ein neues Kennwort erstellen, um sich bei Windows anzumelden. In beiden Fällen (es sei denn, Sie erstellen ein lokales Konto mit einem leeren Kennwort) werden Sie bei jedem Start von Windows aufgefordert, Ihr Kennwort einzugeben. </p> <p> Der Schutz Ihres eigenen Computers mit einem Passwort ist eine gute Sicherheitsmaßnahme, insbesondere wenn Sie Ihren Computer mit anderen teilen, mit Ihrem Laptop reisen oder wenn Ihr PC zu einer Geschäftsumgebung gehört. Wenn Sie jedoch der einzige Benutzer Ihres eigenständigen Desktop-Computers sind oder Ihren Laptop nur zu Hause verwenden, müssen Sie Ihre Anmeldeinformationen nicht jedes Mal eingeben, wenn Sie ihn verwenden möchten. * </p> <p><strong> Warnung: </strong> AKTIVIEREN SIE DIE AUTOMATISCHE ANMELDUNG unter Windows NICHT, wenn Sie Ihren Computer mit anderen teilen oder wenn Sie mit Ihrem Laptop oder Tablet reisen, da jeder, der Ihren Computer findet, problemlos auf Ihre Dateien zugreifen kann. </p> <h4> So melden Sie sich unter Windows 10/8/7/Vista automatisch bei Ihrem Benutzerkonto an. (Automatische Anmeldung aktivieren) </h4> <h6> Methode 1. Aktivieren Sie die automatische Anmeldung, indem Sie das Dienstprogramm AUTOLOGON verwenden. </h6> <p> Microsoft hat ein Tool entwickelt, um den Anmeldevorgang in Windows zu automatisieren. Das Tool heißt &quot;Autologon&quot; und ermöglicht Ihnen die einfache Konfiguration von Windows für die automatische Anmeldung, ohne bei jedem Start Ihre Anmeldeinformationen eingeben zu müssen. Der Vorteil dieses Tools ist, dass das Passwort verschlüsselt in der Registrierung gespeichert wird. </p> <p> 1. Herunterladen <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/autologon\" target=\"_blank\" rel=\"nofollow noopener\"> Autologon </a> Nützlichkeit. <br> 2. Extrahieren Sie die heruntergeladene Datei. <br> 3. Führen Sie &quot;autologon.exe&quot; aus. <br> 4. Geben Sie Ihr Passwort ein und klicken Sie auf <strong> Aktivieren </strong> . </p> <p><img src=\"images/image_thumb-44-251.png\" alt=\"windows auto login\" loading=\"lazy\"></p> <p> * Hinweis: Wenn Sie die automatische Anmeldung deaktivieren möchten, führen Sie das Dienstprogramm erneut aus und klicken Sie auf <strong> Deaktivieren </strong> . </p> <p> </p> <h6> Methode 2. Aktivieren Sie die automatische Anmeldung über die Benutzerkonten-Systemsteuerung. </h6> <p> Die zweite Methode zum Aktivieren der automatischen Anmeldung bei Windows 10/8/7 besteht darin, die Einstellung &quot;Benutzer müssen einen Benutzernamen und ein Kennwort eingeben, um diesen Computer zu verwenden&quot; in der Systemsteuerung &quot;Benutzerkonten&quot; deaktivieren. Das zu tun: </p> <p> Hinweis: Wenn Sie ein lokales Konto verwenden, gibt es eine andere einfachere Möglichkeit, die automatische Anmeldung von Windows zu erzwingen: Geben Sie einfach ein neues leeres (leeres) Kennwort unter Einstellungen &gt; Konten &gt; Anmeldeoptionen &gt; Kennwort ändern ein. Geben Sie dann Ihr Passwort einmal ein und klicken Sie dann zweimal auf Weiter und Fertig stellen. </p> <p> 1. Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-738.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Geben Sie im Feld &quot;Öffnen&quot; Folgendes ein: <strong> Benutzerpasswörter kontrollieren2 </strong> &amp; klicken <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-29-873.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. In den Benutzerkontenoptionen (Registerkarte &#39;Benutzer&#39;) <strong> deaktivieren </strong> das <strong> Benutzer müssen einen Benutzernamen und ein Kennwort eingeben, um dieses Kontrollkästchen für diesen Computer verwenden zu können </strong> und dann klick <strong> Anwenden. * </strong></p> <p> * Hinweis: Wenn Sie die automatische Anmeldung in Zukunft deaktivieren möchten, aktivieren Sie einfach dieses Kontrollkästchen. </p> <p><img src=\"images/image_thumb-32-315.png\" alt=\"auto login windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Geben Sie (zweimal) Ihr Kontopasswort ein und klicken Sie auf <strong> OK </strong> zweimal, um die Eigenschaften des Benutzerkontos zu schließen. </p> <p><img src=\"images/image_thumb-31-509.png\" alt=\"Auto Login to Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Methode 3. Aktivieren Sie die automatische Anmeldung in der Registrierung (Windows 10/8/7/Vista). </h6> <p> Die letzte Methode zum Deaktivieren der Kennwortanmeldung unter Windows 10, 8 oder 7 besteht darin, die Registrierung für die automatische Anmeldung zu aktivieren. Das zu tun: </p> <p> 1. Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-512.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Geben Sie im Feld &quot;Öffnen&quot; Folgendes ein: <strong> regedit </strong> &amp; klicken <strong> OK </strong> . </p> <p><img src=\"images/image_thumb7-114.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Navigieren Sie im linken Bereich zu dieser Taste: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon </li> </ul> <p> 4. Im rechten Bereich: </p> <blockquote><p> ein. Klicken Sie mit der rechten Maustaste auf eine leere Stelle und wählen Sie <strong> Neu </strong> &gt; <strong> Zeichenfolgenwert. </strong></p> <p><img src=\"images/image_thumb-38-930.png\" alt=\"image\" loading=\"lazy\"></p> <p> b. Benennen Sie den neuen Wert um in <strong> Standardbenutzername </strong> und drücke <strong> Eingeben </strong> . <br> c. Öffnen Sie den REG_SZ-Wert &#39;DefaultUserName&#39;. <br> d. Geben Sie den Namen Ihres lokalen Benutzerkontos oder Ihres Microsoft-Kontos ein und klicken Sie auf <strong> OK </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-42-933.png\" alt=\"enable auto login registry\" loading=\"lazy\"></p> <p> </p> <p> 5a. Führen Sie die gleichen Schritte aus und erstellen Sie einen neuen REG_SZ (String)-Wert und benennen Sie ihn <strong> Voreingestelltes Paswort </strong> . <br> 5b. Doppelklicken Sie auf &quot;DefaultPassword&quot; <strong> &#39; </strong> REG_SZ-Wert, geben Sie Ihr Passwort in das Feld Wertdaten ein und klicken Sie auf <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-43-192.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7a. Erstellen Sie abschließend einen neuen REG_SZ-Wert und benennen Sie ihn <b> AutoAdminAnmeldung </b> . <br> 7b. Doppelklicken Sie auf den Wert &#39;AutoAdminLogon&#39;, geben Sie ein <strong> 1 </strong> in das Feld Wertdaten und klicken Sie auf <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-41-705.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Schließen Sie den Registrierungseditor und starten Sie Ihren PC neu. * </p> <p> * Anmerkungen: <br> 1. Wenn Ihr Computer Teil einer Domain ist, müssen Sie einen weiteren REG_SZ-Wert mit dem Namen erstellen <strong> DefaultDomainName </strong> und geben Sie dann in das Wertdatenfeld den Namen Ihrer Domain ein. <br> 2. Um die automatische Anmeldung in Zukunft zu deaktivieren, löschen Sie einfach die oben erwähnten neu erstellten Zeichenfolgenwerte. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}