{"title":"So steuern Sie die Maus mit der Tastatur in Windows 10/8/7.","content":"<p> Dieses Tutorial enthält Anweisungen zur Steuerung der Maus mit der Tastatur, mit der Funktion &quot;Maustasten&quot; in Windows. Der Artikel kann für Personen nützlich sein, die die Maus nicht bedienen können oder in Fällen, in denen die Maus nicht mehr funktioniert (oder nicht existiert). und Sie möchten Ihre Tastatur als Maus verwenden, um mit Ihrem Computer zu arbeiten, um eine dringende Arbeit zu erledigen. </p> <p> Das <strong> Maustasten </strong> Die Funktion ist in die Betriebssysteme Windows 10, 7 oder 7 integriert und ermöglicht es Ihnen, den Mauszeiger über den Ziffernblock auf dem Bildschirm zu bewegen und alle üblichen Aktionen einer Maus auszuführen (Klick, Doppelklick, Rechtsklick). </p> <h4> So verwenden Sie Ihre Tastatur als Maus. </h4> <h6> Methode 1. Aktivieren Sie die Maustasten, indem Sie die Tastenkombination verwenden. * </h6> <p> Die erste Methode zum Bewegen des Mauszeigers [ohne Maus <img src=\"images/wlemoticon-openmouthedsmile-273.png\" alt=\"Open-mouthed smile\" loading=\"lazy\"> ], besteht darin, die Maustasten wie folgt einzuschalten: </p> <p> 1. Drücken Sie <strong> links ALT </strong> + <strong> Linksverschiebung </strong> + <strong> Num Lock </strong></p> <p><img src=\"images/image_thumb-10-220.png\" alt=\"How to Control Mouse with Keyboard \" loading=\"lazy\"></p> <p> </p> <p> 2. Wenn das Fenster Maustasten auf dem Bildschirm erscheint, drücken Sie <strong> EINGEBEN </strong> um die Maustasten einzuschalten. </p> <p><img src=\"images/image_thumb-2-595.png\" alt=\"turn on mouse keys\" loading=\"lazy\"></p> <p> 3. Nachdem Sie die Maustasten aktiviert haben, können Sie mit Ihrer Tastatur (Ziffernblock) alle Mausaktionen (Verschieben, Klicken, Rechtsklick, Doppelklick) ausführen, wie in der Abbildung unten gezeigt. * </p> <p> * Hinweis: Wenn Sie die Zeigergeschwindigkeit erhöhen oder verringern möchten, lesen Sie die Anweisungen in der nächsten Methode. </p> <p><strong> Mausfunktionen über das numerische Tastenfeld </strong></p> <p><img src=\"images/image_thumb-8-332.png\" alt=\"mouse functions numeric keypas\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Methode 2. Aktivieren Sie die Maustasten im Center für erleichterte Bedienung. </h6> <p> Die zweite Methode, um den Mauszeiger mit Ihrer Tastatur steuern zu können, besteht darin, die Funktion &quot;Maustasten&quot; im Ease Access Center einzuschalten und zu konfigurieren. Das zu tun: </p> <p> 1. Navigieren Sie zur Windows-Systemsteuerung, stellen Sie „Anzeigen nach“ auf <strong> Kleine Icons </strong> und dann öffne die <strong> Center für erleichterten Zugriff. </strong></p> <p><img src=\"images/image_thumb-3-309.png\" alt=\"use keyboard as mouse\" loading=\"lazy\"></p> <p> </p> <p> 2. Klicken Sie auf <strong> Machen Sie die Maus einfacher zu bedienen. </strong></p> <p><img src=\"images/image_thumb-4-518.png\" alt=\"enable mouse keys - ease of access\" loading=\"lazy\"></p> <p> </p> <p> 3. Dann klick <strong> Einrichten der Maustasten </strong> . </p> <p><img src=\"images/image_thumb-9-206.png\" alt=\"Configure Pointer Speed \" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Überprüfen Sie nun die <strong> Aktivieren Sie die Maustasten </strong> Kästchen und klick <strong> Anwenden. </strong><br> <strong> 5. </strong> Versuchen Sie nun, den Mauszeiger über den Ziffernblock zu bewegen und konfigurieren Sie die <strong> Zeigergeschwindigkeit </strong> wie du möchtest. (Klicken Sie bei jeder Änderung auf &#39;Übernehmen&#39; und &#39;OK&#39;, um die &#39;Maustasten&#39;-Optionen zu schließen.) </p> <p><img src=\"images/image_thumb-7-340.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Das ist alles! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}