{"title":"So übertragen Sie Thunderbird-E-Mails und -Einstellungen auf einen neuen Computer.","content":"<p> Dieses Tutorial enthält detaillierte Anweisungen zum Übertragen von Thunderbird-E-Mail-Nachrichten, Kontoeinstellungen und Adressbüchern auf einen anderen Computer. Die Thunderbird-E-Mail-Anwendung speichert alle Daten in einem Profilordner, der die Erweiterung &quot;.default&quot; am Ende seines Namens hat. (z.B. &quot;wyhsxcvs.default&quot;). Standardmäßig wird dieser Profilordner an folgendem Speicherort auf Ihrem Computer gespeichert: </p> <ul> <li> C:\\Benutzer\\AppData\\Roaming\\Thunderbird\\Profiles\\ <strong> .Standard </strong></li> </ul> <p><img src=\"images/image_thumb-14-425.png\" alt=\"How to Transfer Thunderbird Emails & Data to a New Computer.\" loading=\"lazy\"></p> <p> Wenn Sie also Ihre Thunderbird-Daten auf einen neuen Computer verschieben möchten, müssen Sie den übergeordneten Ordner „Thunderbird“ auf den neuen Computer übertragen und dann Thunderbird auf diesen Ordner verweisen. </p> <h4> So verschieben Sie das Thunderbird-Profil auf einen anderen PC. </h4> <h6> Schritt 1. Kopieren Sie den Thunderbird-Profilordner vom alten Computer. </h6> <p> </p> <p> Navigieren Sie auf dem alten Computer zum Speicherort der Thunderbird-Daten. Das zu tun: </p> <p> 1. Öffnen Sie Thunderbird. <br> 2. Aus dem Menü <img src=\"images/image_thumb21_thumb-959.png\" alt=\"image_thumb[21]\" loading=\"lazy\"> , wählen <strong> Hilfe </strong> -&gt; <strong> Informationen zur Fehlerbehebung. <br> </strong> 3. At <strong> Profilordner </strong> Linie, klick <strong> Ordner öffnen </strong> . </p> <p><img src=\"images/image_thumb-8-878.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Schließen Sie die Thunderbird-Anwendung. <br> 5. Klicken Sie im Explorer-Fenster auf <strong> Wandernd </strong> . </p> <p><img src=\"images/image_thumb-9-272.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Kopieren </strong> und <strong> Einfügen </strong> das <strong> Donnervogel </strong> Ordner auf ein Speichermedium mit genügend freiem Speicherplatz. (z.B. ein externes USB-Laufwerk). </p> <p><img src=\"images/image_thumb-10-958.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Schritt 2. Übertragen Sie das Thunderbird-Profil auf den neuen Computer. </h6> <p> 1. <a href=\"https://www.thunderbird.net/en-US/download/\" target=\"_blank\" rel=\"nofollow noopener\"> Herunterladen </a> und installieren Sie Thunderbird auf dem neuen PC. * </p> <p><strong> * Wichtig: </strong> Am Ende des Installationsvorgangs, <strong> deaktivieren </strong> die Option &quot;Mozilla Thunderbird jetzt starten&quot; und klicken Sie auf <strong> Fertig </strong> . </p> <p><img src=\"images/image_thumb-11-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Verbinden Sie das USB-Laufwerk (mit dem Ordner „Thunderbird“) mit dem neuen Computer. <br> 3. Klicken Sie mit der rechten Maustaste auf den Ordner „Thunderbird“ und klicken Sie auf <strong> Kopieren </strong> . <br> 4. Drücken Sie die Windows <img src=\"images/image_thumb8_thumb-1-464.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 5. Geben Sie den folgenden Befehl ein <strong> </strong> und drücke <strong> Eingeben: </strong></p> <ul> <li><strong> %Anwendungsdaten% </strong></li> </ul> <p><img src=\"images/image_thumb-12-421.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Klicken Sie in den Explorer-Fenstern mit der rechten Maustaste auf eine leere Stelle und klicken Sie auf <strong> Einfügen </strong> . </p> <p><img src=\"images/image_thumb-13-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Starten Sie Thunderbird und Sie sollten alle Ihre E-Mails, Adressbücher und Kontoeinstellungen wie auf Ihrem alten Computer sehen. </p> <p> Das ist alles! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}