{"title":"So sichern Sie persönliche Dateien mit dem Dateiversionsverlauf in Windows 10.","content":"<p> In diesem Tutorial zeige ich Ihnen, wie Sie Windows 10 so konfigurieren, dass mit dem Sicherungstool Dateiversionsverlauf automatisch Kopien und Snapshots Ihrer Dateien erstellt werden, um sie (bei Bedarf) mithilfe der Option &quot;Vorherige Versionen wiederherstellen&quot; wiederherstellen zu können. Feature. </p> <p> Wie Sie vielleicht bereits bemerkt haben, behält Windows 10 standardmäßig keine früheren Versionen Ihrer Dateien oder Ordner bei, wie in Windows 7. Dies geschieht, weil Windows 10 den Dienst &quot;Volume Shadow Copy&quot; nicht mehr verwendet, um Machen Sie Schnappschüsse Ihrer Dateien, sondern verwendet stattdessen nur das Backup-Tool &quot;Dateiverlauf&quot;. </p> <p> Der &quot;Dateiverlauf&quot; ist ein hervorragendes integriertes Backup-Tool in Windows 10, das so konfiguriert werden kann, dass Kopien und Schnappschüsse Ihrer Dateien an einem anderen Speicherort als dem Hauptlaufwerk erstellt werden (z. B. auf einem USB-Laufwerk, Netzwerk usw.). . * </p> <p> * Hinweis: Die einzige Einschränkung des Tools &quot;Dateiversionsverlauf&quot; besteht darin, dass Sie das Laufwerk C: nicht als alternatives Backup-Ziel auswählen können. Wenn Sie kein sekundäres Laufwerk besitzen, das für das Backup verfügbar ist, lesen Sie dieses Tutorial weiter, um herauszufinden, wie Sie diese Einschränkung umgehen können… </p> <ul> <li><strong> Verwandter Artikel: </strong> <a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> So erstellen Sie Schattenkopien Ihrer Dateien mit dem Taskplaner in Windows 10. </a></li> </ul> <h4> So sichern Sie Ihre persönlichen Dateien mit dem Tool zum Sichern des Dateiversionsverlaufs in Windows 10. </h4> <p> 1. Wie oben erwähnt, müssen Sie, um Ihre Dateien mit dem Backup-Tool des Dateiversionsverlaufs zu sichern, ein verfügbares Speicherlaufwerk an Ihrem PC (z , oder ein NAS-Speichergerät). * </p> <p> * Hinweis: Wenn Sie kein alternatives Speichergerät besitzen, haben Sie folgende Möglichkeiten: </p> <blockquote><p> A. Zu <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> Verkleinern Sie die Größe Ihres Hauptlaufwerks C:\\ </a> und mit dem verfügbaren freien Speicherplatz, um ein neues Laufwerk zum Speichern des Backups zu erstellen, oder… </p> <p> B. Um das Backup auf dem Hauptlaufwerk C:\\ zu speichern. Erstellen Sie in diesem Fall einen neuen Ordner auf Laufwerk C: und nennen Sie ihn &quot;FileHistory&quot; (oder was auch immer Sie wollen) und fahren Sie unten fort… </p></blockquote> <p> 2. Navigieren Sie zu Windows <strong> Schalttafel </strong> und unter <strong> System und Sicherheit, </strong> klicken <strong> Sicherung speichern </strong><strong> Kopien Ihrer Dateien mit dem Dateiversionsverlauf. </strong></p> <p><img src=\"images/image_thumb-42-924.png\" alt=\"How to Backup & Keep Previous Versions of Files in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 3. Führen Sie nun je nach Fall die folgenden Schritte aus: </p> <ul> <li><strong> Fall A. </strong> Wenn Sie ein verfügbares Laufwerk für das Backup besitzen, dann: </li> </ul> <blockquote><p> ein. Drücke den <strong> Einschalten </strong> Schaltfläche auf dem Bildschirm, um den &#39;Dateiverlauf&#39; zu aktivieren. <br> b. Weiter <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> Schritt 4 </a> unten, um die Sicherungseinstellungen für den &#39;Dateiverlauf&#39; zu konfigurieren. </p></blockquote> <p><img src=\"images/image_thumb-44-788.png\" alt=\"Turn On File History Windows 10\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Fall B: </strong> Wenn Sie kein verfügbares Laufwerk für die Sicherung des Dateiversionsverlaufs besitzen oder die Sicherung im Netzwerk speichern möchten, gehen Sie wie folgt vor: </li> </ul> <blockquote><p> ein. Klicken <strong> Wählen Sie einen Netzwerkspeicherort aus. </strong></p></blockquote> <p><img src=\"images/image_thumb-56-796.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Auf dem nächsten Bildschirm: </p> <p> 1. Wenn Sie das Backup im Netzwerk speichern möchten, geben Sie den vollständigen Netzwerkpfad des Backup-Speicherorts ein und klicken Sie auf <strong> Ordner auswählen </strong> . </p> <p> 2.  Wenn Sie die Sicherung auf Ihrem Hauptlaufwerk C:\\ speichern möchten, geben Sie den vollständigen Netzwerkpfad zum lokalen Sicherungsordner auf dem Laufwerk C:\\ in diesem Formular ein: * </p> <ul> <li> <strong> \\\\Computername\\C$\\Dateiverlauf </strong></li> </ul> <p> * Anmerkungen: <br> 1. Ersetzen Sie den Wert &quot;Computer-Name&quot; durch den Namen Ihres PCs. (Um den Namen Ihres Computers zu finden, klicken Sie mit der rechten Maustaste auf das Symbol &quot;Dieser PC&quot; im Windows Explorer). <br> 2. Denken Sie daran, dass die Sicherung Ihrer persönlichen Dateien auf demselben Laufwerk gespeichert wird, auf dem sie bereits gespeichert sind <strong> ist keine zuverlässige Lösung </strong> . Speichern Sie das Backup sicherheitshalber immer auf einem anderen Speichergerät. </p></blockquote> <p> Beispiel: Wenn der Computername &quot;Pegasus&quot; ist, geben Sie ein: &quot;\\\\Pegasus\\C$\\FileHistory&quot; </p> <p><img src=\"images/image_thumb-53-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> c. Klicken Sie im nächsten Bildschirm auf <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-54-349.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> d. Klicken Sie nun auf die <strong> Einschalten </strong> , um das Backup-Tool des Dateiversionsverlaufs zu aktivieren, und fahren Sie dann unten fort, um die Backup-Einstellungen zu konfigurieren. </p></blockquote> <p><img src=\"images/image_thumb-48-620.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Um die Backup-Optionen des &#39;Dateiverlaufs&#39; zu konfigurieren, klicken Sie auf <strong> Erweiterte Einstellungen </strong> links. </p> <p><img src=\"images/image_thumb-49-919.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4a. Dann bei <strong> Erweiterte Einstellungen </strong> Optionen, legen Sie fest, wie oft Ihre Dateien gesichert und wie lange die gespeicherten Versionen aufbewahrt werden sollen. Wenn Sie fertig sind, klicken Sie auf <strong> Änderungen speichern </strong> . </p> <p><img src=\"images/image_thumb-61-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Endlich klick <strong> Lauf jetzt </strong> um Ihr erstes Backup zu erstellen. * </p> <p><img src=\"images/image_thumb-55-463.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Zusätzliche Hilfe – Hinweise: <br> 1. Standardmäßig erstellt der „Dateiverlauf“ ein Backup der Ordner „Bibliotheken“ (Desktop, Dokumente, Favoriten, Musik, OneDrive, Bilder &amp; Videos). Wenn Sie einen dieser Ordner von der Sicherung ausschließen, andere Ordner einschließen oder alle Sicherungsoptionen für den Dateiversionsverlauf überprüfen möchten, navigieren Sie zu: </p> <ul> <li> <p><strong> die Einstellungen <img src=\"images/image_thumb-58-467.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Update &amp; Sicherheit </strong> &gt; <strong> Sicherung </strong> &gt; <strong> Mehr Optionen. </strong></p> </li> </ul> <p><img src=\"images/image_thumb-57-938.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Um Ihre Dateien aus dem Backup „Dateiverlauf“ wiederherzustellen, navigieren Sie zu einem der folgenden Speicherorte: </p> <ul> <li><strong> Schalttafel </strong> &gt; <strong> Dokumentenhistorie </strong> &gt; <strong> Persönliche Dateien wiederherstellen. </strong></li> <li><strong> die Einstellungen <img src=\"images/image_thumb-59-275.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Update &amp; Sicherheit </strong> &gt; <strong> Sicherung </strong> &gt; <strong> Mehr Optionen </strong> &gt; <strong> Wiederherstellen von Dateien aus einem aktuellen Backup. </strong></li> </ul> <p> 3. Um eine Datei oder einen Ordner selektiv in ihrer vorherigen Version wiederherzustellen, klicken Sie mit der rechten Maustaste auf die Datei (oder den Ordner) und wählen Sie <strong> Wiederherstellung früherer Versionen </strong> . </p> <p><img src=\"images/image_thumb-60-867.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Das ist alles! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}