{"title":"So zeigen und exportieren Sie Firefox-Passwörter.","content":"<p> In diesem Tutorial zeige ich Ihnen, wie Sie die gespeicherten Passwörter im Webbrowser Mozilla Firefox anzeigen und verwalten. Wie Sie bereits wissen, bietet Ihnen der Firefox-Browser die Möglichkeit, Ihren Login-Benutzernamen und Ihr Passwort beim ersten Besuch einer Website zu speichern. Wenn Sie sich dafür entscheiden, Ihre Zugangsdaten zu speichern, speichert Firefox sie und wenn Sie sich das nächste Mal auf der Website anmelden, müssen Sie sie nicht erneut eingeben. </p> <p><img src=\"images/image_thumb-98-507.png\" alt=\"How to View and Export Firefox Passwords.\" loading=\"lazy\"></p> <p> Wenn Sie im Laufe der Zeit Ihre Anmeldedaten vergessen, lesen Sie dieses Tutorial, um zu erfahren, wie Sie in Firefox gespeicherte Passwörter anzeigen und exportieren. </p> <h4> So verwalten, zeigen und exportieren Sie die gespeicherten Passwörter in Mozilla Firefox. </h4> <p><strong> So zeigen Sie Firefox-Passwörter an </strong></p> <p> 1. Aus dem Firefox-Menü <img src=\"images/image_thumb-99-587.png\" alt=\"image\" loading=\"lazy\"> wählen <strong> Login und Passwörter </strong> . </p> <p><img src=\"images/image_thumb-100-999.png\" alt=\"View Saved Passwords Firefox\" loading=\"lazy\"></p> <p> </p> <p> 2. Klicken Sie auf das <strong> Passwörter anzeigen </strong> Schaltfläche, um die gespeicherten Passwörter in Websites anzuzeigen. Verwenden Sie in diesem Fenster zusätzlich die <strong> Entfernen </strong> Schaltfläche, um die gespeicherten Passwörter aus Firefox zu entfernen. </p> <p><img src=\"images/image_thumb-101-863.png\" alt=\"Manage Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p><strong> So speichern Sie alle Firefox-Passwörter in einer Datei </strong></p> <p> So zeigen Sie alle gespeicherten Passwörter in Firefox an und exportieren sie: </p> <p> 1. Herunterladen <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> PasswortFox </a> Nützlichkeit ( <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> http://www.nirsoft.net/utils/passwordfox.html </a> ) <br> 2. Extrahieren Sie die heruntergeladene ZIP-Datei. <br> 3. Doppelklicken Sie im extrahierten Ordner, um die Anwendung &quot;PasswordFox.exe&quot; auszuführen. <br> 4. Drücken Sie <strong> Strg </strong> + <strong> EIN </strong> , um alle aufgelisteten Sites auszuwählen, und dann aus dem <strong> Datei </strong> Menü wählen <strong> Ausgewählte Elemente speichern. </strong></p> <p><img src=\"images/image_thumb-102-438.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Geben Sie einen Namen für die .txt-Datei ein und klicken Sie auf <strong> speichern </strong> . </p> <p><img src=\"images/image_thumb-103-923.png\" alt=\"How to Save Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p> 6. Öffnen Sie die erstellte Datei im Editor, um alle gespeicherten Passwörter im Mozilla Firefox-Browser anzuzeigen. </p> <p> Das ist alles! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}