{"title":"UPDATE: Windows 10 Update-Installation fehlgeschlagen Fehler 0x800711C7 – 0x2000A (Gelöst)","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben des Windows 10-Upgrade-Fehlers 0x800711C7 – 0x2000A: &quot;Die Installation ist in der SAFE_OS-Phase mit einem Fehler während PREPARE_FIRST_BOOT fehlgeschlagen&quot;. </p> <p> </p> <p><img src=\"images/image_thumb-51-797.png\" alt=\"FIX Error 0x800711C7 - 0x2000A installation failed in the SAFE_OS phase during PREPARE_FIRST_BOOT\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Windows 10 Upgrade Problem 0x800711C7 – 0x2000A im Detail: Wenn Sie versuchen, Windows 10 auf die neueste Version (Build) zu aktualisieren, stoppt die Installation mit dem Fehler „Wir konnten Windows 10 nicht installieren – 0x800711C7 – 0x2000A – Die Installation ist in der SAFE_OS-Phase fehlgeschlagen mit ein Fehler während PREPARE_FIRST_BOOT&quot; und kehrt dann zur vorherigen Windows-Version zurück. </p> <h4> So beheben Sie den Installationsfehler des Windows 10 v1809-Updates 0x800711C7 – 0x2000A </h4> <p> </p> <h6> Methode 1. Deaktivieren Sie Device Guard von PowerShell. </h6> <p> Der Fehler 0x800711C7 – 0x2000A beim Windows 10-Upgrade erscheint in Systemen mit dem &quot; <a href=\"https://techcommunity.microsoft.com/t5/iis-support-blog/windows-10-device-guard-and-credential-guard-demystified/ba-p/376419\" target=\"_blank\" rel=\"nofollow noopener\"> Geräteschutz </a> &quot; aktiviert, Die erste Methode zum Beheben des Fehlers 0x800711C7 – 0x2000A im Windows 10-Update besteht darin, den Device Guard auf Ihrem System zu deaktivieren. </p> <p> 1. Fahren Sie fort und laden Sie die . herunter <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=53337\" target=\"_blank\" rel=\"nofollow noopener\"> Hardware-Bereitschaftstool für Device Guard und Credential Guard </a> von Microsoft. <br> 2. Wenn der Download abgeschlossen ist, entpacken Sie die Datei &quot;dgreadiness&quot;_v3.6.zip. <br> 3. Öffnen Sie den extrahierten Ordner und wählen Sie im Menü Datei die Option Windows PowerShell als Administrator öffnen. </p> <p><img src=\"images/image_thumb-52-765.png\" alt=\"FIX Error 0x800711C7 - 0x2000A Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Geben Sie bei PowerShell den folgenden Befehl ein, um <strong> Erlauben (setzen) Sie die Ausführungsrichtlinie, Skripte auszuführen </strong> (Drücken Sie <strong> EIN </strong> wenn Sie aufgefordert werden, die Ausführungsrichtlinie zu ändern). </p> <ul> <li> Set-ExecutionPolicy Unrestricted </li> </ul> <p> 5. Geben Sie dann diesen Befehl an <strong> deaktivieren </strong> das <strong> Geräteschutz </strong> und der <strong> Berechtigungswächter </strong> : </p> <ul> <li> .\\DG_Readiness_Tool_v3.6 -Deaktivieren </li> </ul> <p><img src=\"images/image_thumb-53-648.png\" alt=\"Disable Device Guard and Credential Guard Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Nach der Befehlsausführung, <strong> neu starten </strong> der Computer. <br> 7. Versuchen Sie, Windows 10 zu aktualisieren. * </p> <p> * Hinweis: Befolgen Sie nach dem Aktualisieren von Windows 10 das gleiche Verfahren, um den Device Guard und den Credential Guard mit diesen Befehlen zu aktivieren: </p> <ul> <li> Set-ExecutionPolicy Unrestricted </li> <li> .\\DG_Readiness_Tool_v3.6 -Aktivieren </li> </ul> <p> </p> <h6> Methode 2. Deaktivieren Sie Hyper-V über die Eingabeaufforderung. </h6> <p> Die nächste Methode zum Beheben des Fehlers 0x800711C7 – 0x2000A beim Windows 10-Upgrade besteht darin, den Hypervisor beim Windows-Start zu deaktivieren. </p> <p> 1. Öffnen <strong> Eingabeaufforderung als Administrator </strong> . <br> 2. Geben Sie den folgenden Befehl ein, um Hyper-V beim Windows-Start zu deaktivieren. </p> <ul> <li> bcdedit /set hypervisorlaunchtype aus </li> </ul> <p><img src=\"images/image_thumb-50-768.png\" alt=\"Disable Hyper-V Command Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Neustart </strong> dein PC. <br> 4. Versuchen Sie, das Update zu installieren.* </p> <p> * Hinweis: Geben Sie nach der Aktualisierung von Windows 10 den folgenden Befehl ein, um Hypervisor automatisch beim Hochfahren des Computers zu starten: </p> <ul> <li> bcdedit /set hypervisorlaunchtype auto </li> </ul> <p> </p> <h6> Methode 3. Deaktivieren Sie den sicheren Start in den BIOS-Einstellungen. </h6> <p> Eine weitere Ursache für den Windows 10-Update-Fehler 0x800711C7 – 0x2000A ist der Secure Boot. Fahren Sie also fort und deaktivieren Sie Secure Boot in den BIOS-Einstellungen. Das zu tun: </p> <p> 1. Schalten Sie Ihr System ein und drücken Sie sofort die entsprechende Taste*, um in das <strong> BIOS-SETUP. </strong></p> <p> </p> <p> * Hinweis: Normalerweise müssen Sie zum Aufrufen des BIOS die Taste . drücken <strong> DEL </strong> oder <strong> F1 </strong> oder <strong> F2 </strong> oder der <strong> F10 </strong> Schlüssel. (abhängig vom Hersteller) </p> <p> 2. Schau dir an <strong> Sicherheit </strong> oder bei <strong> Boot Optionen, </strong> oder bei <strong> Authentifizierung </strong> Einstellungen,* um die <strong> Sicherer Startvorgang </strong> Option und <strong> Deaktivieren </strong> es <strong> . </strong></p> <p> * Anmerkungen: <br> 1.Der Speicherort der &#39;Secure Boot&#39;-Einstellung im BIOS hängt vom Gerätehersteller ab. <br> 2. Wenn Sie die Einstellung &#39;Secure Boot&#39; nicht finden können, dann <strong> Deaktivieren </strong> das <strong> CSM-Unterstützung </strong> und dann <strong> Speichern und schließen </strong> BIOS-Setup bilden. Rufen Sie dann das BIOS-Setup erneut auf, um den Secure Boot zu finden. </p> <p><img src=\"images/image_thumb-23-385.png\" alt=\"Disable Secure Boot\" loading=\"lazy\"></p> <p> 3. <strong> speichern </strong> Einstellungen und <strong> AUSFAHRT </strong> BIOS-Setup. <br> 4. Lassen Sie Windows normal booten und versuchen Sie, das Update zu installieren. Wenn das Update erneut fehlschlägt, aktivieren Sie „Secure Boot“ erneut und fahren Sie mit der nächsten Methode fort. </p> <p> </p> <h6> Methode 4. Aktualisieren Sie Windows 10 mit dem Update-Assistenten </h6> <p> 1. Navigieren Sie zu <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Download-Site für Windows 10 </a> und klicke auf <strong> Jetzt aktualisieren </strong> Taste. </p> <p><img src=\"images/image_thumb_thumb-680.png\" alt=\"Update Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Speichern Sie die Datei „Windows10Upgrade9252.exe“ auf Ihrem Desktop. <br> 3. Doppelklicken Sie auf die heruntergeladene Datei, um die <strong> Windows-Upgrade-Assistent </strong> . <br> 4. Klicken Sie auf <strong> Jetzt aktualisieren </strong> um das Update zu starten. </p> <p><img src=\"images/image_thumb4_thumb-918.png\" alt=\"Windows 10 Update Assistant\" loading=\"lazy\"></p> <p> 5. Lassen Sie Windows den Download und die Überprüfung abschließen. <br> 6. Wenn die Überprüfung 100% erreicht, <strong> Trennen Sie Ihren Computer vom Internet </strong> , oder setzen Sie es auf &quot; <strong> Flugzeug-Modus </strong> &quot;. <br> 7. Warten Sie, bis Windows Ihr System aktualisiert hat. <br> 8. Wenn Sie dazu aufgefordert werden, starten Sie Ihr System neu, um das Update zu installieren. </p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}