{"title":"UPDATE: Windows Update Etwas ist schief gelaufen. Versuchen Sie, die Einstellungen später erneut zu öffnen (Gelöst)","content":"<p> Wenn der Windows Update-Fehler auftritt: &quot;Etwas ist schief gelaufen. Versuchen Sie, die Einstellungen später erneut zu öffnen&quot; in Windows 10, dann lesen Sie weiter unten, um herauszufinden, wie Sie das Problem beheben können. Der Fehler &quot;Etwas ist schief gelaufen. Versuchen Sie, die Einstellungen später erneut zu öffnen&quot; wird normalerweise angezeigt, wenn der Windows Update-Ordner beschädigt ist oder wenn einer der erforderlichen Windows Update-Dienste deaktiviert ist. </p> <p> </p> <p><img src=\"images/image_thumb-4-854.png\" alt=\"FIX Something went wrong. Try to reopen Settings later in Windows Update\" loading=\"lazy\"></p> <p> Dieses Tutorial enthält Anweisungen zur Behebung des Fehlers &quot;Etwas ist schief gelaufen. Versuchen Sie, die Einstellungen später erneut zu öffnen&quot; in Windows 10 Update. </p> <h4> So beheben Sie ein Windows Update-Problem: Ein Fehler ist aufgetreten. Versuchen Sie später, die Einstellungen erneut zu öffnen. </h4> <h6><strong> Methode 1. </strong> Laden Sie das/die Windows-Update(s) erneut herunter. </h6> <p> Die effektivste Lösung zur Behebung von Windows-Update-Problemen besteht darin, Windows zu zwingen, die Updates von Grund auf herunterzuladen. Das zu tun: </p> <p><strong> Schritt 1: BEENDEN Sie den Windows Update-Dienst. </strong></p> <p> 1. Öffnen Sie die Systemsteuerung der Windows-Dienste: Um das zu tun: </p> <ol> <li> <ol> <li> Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-186.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. </li> <li> Geben Sie in das Suchfeld Folgendes ein: <strong><em> dienste.msc </em></strong> &amp; klicken <strong> OK </strong> . </li> </ol> </li> </ol> <p><img src=\"images/image_thumb-12-569.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. Suchen Sie in der Systemsteuerung &quot;Dienste&quot; das &quot; <strong> Windows Update&quot; </strong> Bedienung. <br> 3. Klicken Sie mit der rechten Maustaste auf <strong> Windows Update </strong> Dienst und wählen Sie &quot; <strong> Halt </strong> &quot;. </p> <p><img src=\"images/image_thumb-9-151.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p><strong><strong> Schritt 2: </strong> Löschen Sie den SoftwareDistribution-Ordner. </strong></p> <p> 1. Öffnen Sie den Windows Explorer und navigieren Sie zu: <strong> C:\\Windows </strong> Mappe. <br> 2. Finden und <strong> Löschen </strong> das &quot; <strong> Softwareverteilung </strong> &quot; Ordner (oder benennen Sie ihn um. z. B. in &quot;SoftwareDistributionOLD&quot;) . * </p> <p> * Hinweis: Wenn Sie den Ordner nicht löschen können, starten Sie Windows im abgesicherten Modus. </p> <p><img src=\"images/image_thumb-10-758.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p><strong><strong> </strong></strong></p> <p><strong><strong> Schritt 3: </strong> STARTEN Sie den Windows Update-Dienst. </strong></p> <p> 1. Öffnen Sie die Systemsteuerung der Windows-Dienste. <br> 2. Klicken Sie mit der rechten Maustaste auf <strong> Windows Update </strong> Dienst und wählen Sie &quot; <strong> Start </strong> &quot;. </p> <p><img src=\"images/image_thumb-11-825.png\" alt=\"start windows update service\" loading=\"lazy\"></p> <p><strong> </strong></p> <p><strong> Schritt 4. </strong> Gehen Sie zu den Windows Update-Optionen und klicken Sie auf <strong> Auf Updates prüfen. </strong></p> <p><strong> </strong></p> <h6> Methode 2. Aktivieren Sie die erforderlichen Windows Update-Dienste, indem Sie die Registrierung ändern. </h6> <p> Um Windows 10-Updates zu aktivieren, müssen Sie die unten genannten Dienste in der Windows-Registrierung aktivieren: </p> <ul> <li> Orchestrator-Dienst aktualisieren (UsoSvc) </li> <li> Windows Update Medic-Dienst (WaaSMedicSvc) </li> <li> Windows Update-Dienst (wuauserv) </li> </ul> <p> 1. Drücken Sie Windows <img src=\"images/image_thumb41-417.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ <strong> regedit </strong> und drücke <strong> Eingeben </strong> . </p> <p><img src=\"images/image_thumb42-796.png\" alt=\"registry editor\" loading=\"lazy\"></p> <p> 3. Suchen Sie im Windows-Registrierungseditor den folgenden Schlüssel: </p> <p><strong> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\UsoSvc </strong></p> <p> 4. Sehen Sie sich das rechte Fenster an und doppelklicken Sie auf <strong> Start </strong> DWORD-Wert. </p> <p><img src=\"images/image_thumb-7-684.png\" alt=\"Windows Update - Something went wrong\" loading=\"lazy\"></p> <p> 5. Ändern Sie die Wertdaten vom Standardwert 4 auf <strong> 2 </strong> und klicke <strong> OK </strong> . * </p> <p> * Dienststartzustände gemäß dem DWORD-Wert &quot;Start&quot;: <br> 0 = Booten <br> 1 = System <br> 2 = Automatisch <br> 3 = Manuell <br> 4 = Deaktiviert </p> <p><img src=\"images/image_thumb-8-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Führen Sie die gleichen Aktionen aus und ändern Sie die Wertdaten von <strong> Start </strong> DWORD-Wert, von 4 bis <strong> 2 </strong> auf folgenden Tasten: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\WaaSMedicSvc </strong></li> <li><strong> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\wuauserv </strong></li> </ul> <p> 7. Wenn Sie fertig sind, <strong> schließen </strong> Registrierungseditor und <strong> neu starten </strong> dein Computer. <br> 8. Navigieren Sie zu Windows Update und prüfen Sie, ob der Fehler „Windows Update Etwas ist schiefgelaufen. Versuchen Sie, die Einstellungen später erneut zu öffnen“ behoben wurde. </p> <p> </p> <h6> Methode 3. Stellen Sie die Windows Update-Einstellungen mit dem Dienstprogramm StopUpdates10 auf Standard zurück. </h6> <p><a href=\"https://greatis.com/stopupdates10/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> StopUpdates10 </strong></a> ist ein kostenloses Programm, das die Windows-Updates in Windows 10 blockieren kann, indem es die Systemeinstellungen ändert. Stattdessen kann das Programm die erforderlichen Einstellungen und Dienste wiederherstellen, um die Updates in Windows 10 wieder zu aktivieren. </p> <p> 1. Laden Sie das herunter und installieren Sie es <a href=\"https://greatis.com/stopupdates10/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> StopUpdates10 </strong></a> Werkzeug auf Ihrem PC. <br> 2. Im letzten Schritt der Installation, <strong> nur überprüft </strong> das <strong> Starten Sie StopUpdates10 </strong> Option und klicken Sie <strong> Fertig. </strong></p> <p><img src=\"images/image_thumb-5-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Klicken Sie auf das <strong> Windows-Updates wiederherstellen </strong> Taste. </p> <p><img src=\"images/image_thumb-6-304.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Wenn der Vorgang abgeschlossen ist, schließen Sie die Anwendung StopUpdates10 und <strong> neu starten </strong> dein PC. <br> 5. Navigieren Sie nach dem Neustart zum Windows Update Center und prüfen Sie, ob der Fehler weiterhin besteht. Ob alles in Ordnung ist, <strong> deinstallieren </strong> das <strong> StopUpdates10 </strong> Werkzeug und Sie sind bereit. </p> <h6> Methode 4. Reparieren Sie Windows 10. </h6> <p> Die nächste Methode zum Beheben des Fehlers &quot;Ein Fehler ist aufgetreten. Versuchen Sie, die Einstellungen später erneut zu öffnen&quot; in Windows Update besteht darin, Windows mithilfe der SFC- und DISM-Befehle zu reparieren. Das zu tun: </p> <p> 1. Öffnen <strong> Eingabeaufforderung als Administrator </strong> . <br> 2. Geben Sie in der Eingabeaufforderung den folgenden Befehl dism ein und drücken Sie <strong> Eingeben: </strong></p> <p> </p> <ul> <li><strong> DISM.exe /Online /Cleanup-Image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-322.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> 3. Wenn der DISM-Vorgang abgeschlossen ist, geben Sie den folgenden Befehl ein und drücken Sie <strong> Eingeben </strong> : </p> <ul> <li><strong> sfc /scannow </strong></li> </ul> <p><img src=\"images/image_thumb31-882.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Warten Sie nun, bis der System File Checker die Windows-Systemdateien repariert. <br> 5. Wenn dies erledigt ist, <strong> neu starten </strong> Ihren Computer und prüfen Sie, ob das Problem behoben ist. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}