{"title":"UPDATE: Sie haben derzeit keine Berechtigung, auf diesen Ordner auf einem externen USB-Laufwerk zuzugreifen (Gelöst)","content":"<p> Dieses Tutorial enthält detaillierte Anweisungen zum Beheben des folgenden Problems beim Versuch, auf einen externen USB-Datenträger auf einem HP-Laptop mit Windows 10 zuzugreifen: &quot;Sie haben derzeit keine Berechtigung zum Zugriff auf diesen Ordner. Klicken Sie auf &quot;Weiter&quot;, um dauerhaft auf diesen Ordner zuzugreifen.&quot; . Der Fehler bleibt bestehen, auch nachdem Sie auf die Schaltfläche &quot;Weiter&quot; gedrückt haben, um auf das Laufwerk zuzugreifen. </p> <p><img src=\"images/image_thumb-18-636.png\" alt=\"You don't have permission to access this folder\" loading=\"lazy\"></p> <p> Der seltsame Fehler &quot;Sie haben keine Berechtigung, auf diesen Ordner zuzugreifen&quot; wird in einem brandneuen <a href=\"http://www8.hp.com/us/en/products/laptops/product-detail.html?oid=17047142\" target=\"_blank\" rel=\"nofollow noopener\"> HP ProBook 450 G5 </a> Laptop, wenn der Benutzer versucht, den Inhalt eines angeschlossenen USB-Laufwerks (Stick, USB-Laufwerk usw.) anzuzeigen. </p> <p> Nachdem ich das Problem untersucht hatte, stellte ich fest, dass das Problem von den Sicherheitsberechtigungen verursacht wird, die auf dem <a href=\"http://www8.hp.com/us/en/solutions/computer-security.html\" target=\"_blank\" rel=\"nofollow noopener\"> HP Client Security Manager </a> Programm. HP Client Security Manager ist ein von Hewlett-Packard entwickeltes Programm, mit dem Sie Ihre Daten, Ihr Gerät und Ihre Identität durch Erhöhung der Sicherheit Ihres Computers schützen können. </p> <h2> Problemlösung: Keine Berechtigung zum Zugriff auf das USB-Laufwerk auf einem HP Laptop (Windows 10/8/7). </h2> <p> 1. Öffnen <strong> HP Client Security-Manager </strong> . </p> <p><img src=\"images/image_thumb-13-716.png\" alt=\"HP Client Security manager\" loading=\"lazy\"></p> <p> </p> <p> 2. Klicken Sie dann auf <strong> Gerätesicherheit. </strong></p> <p><img src=\"images/image_thumb-14-712.png\" alt=\"fix You Don't have permission to access this folder windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. At <strong> Administratoren </strong> setzen Sie die Sicherheit &quot;Speicher entfernen&quot; auf <strong> Zulassen – Vollzugriff </strong> und klicke <strong> Einreichen. </strong></p> <p><img src=\"images/image_thumb-15-364.png\" alt=\"fix You Don't have permission o access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Zusätzlich (wenn du willst) gib <strong> Voller Zugriff </strong> zum Wechselspeichermedium zu <strong> Standardbenutzer </strong> . </p> <p><img src=\"images/image_thumb-19-269.png\" alt=\"no permission to access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Wenn Sie nicht möchten, dass der HP Device Access Manager den Zugriff auf das Laufwerk steuert, gehen Sie zu <strong> Laufwerkseinstellungen </strong> und stellen Sie den entsprechenden Schalter auf OFF. </p> <p><img src=\"images/image_thumb-20-822.png\" alt=\"You don't have permission to access USB drive\" loading=\"lazy\"></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um das Problem zu verbreiten. </p>"}