{"title":"UPDATE: Lexmark Langsames Drucken mehrerer Seiten unter Windows 10 (Gelöst)","content":"<p> Auf einem Windows 10-PC mit installiertem Lexmark-Drucker ist der Druck beim Drucken mehrerer Seiten langsam. Das Problem mit dem langsamen Drucken von Lexmark in Windows 10 ist normalerweise auf den falschen Druckertreiber oder auf falsche Druckereinstellungen (Einstellungen) zurückzuführen. Um das Problem zu beheben, lesen Sie weiter unten. </p> <p><img src=\"images/image_thumb-29-115.png\" alt=\"FIX: Lexmark Slow Printing in Multiple Pages on Windows 10 \" loading=\"lazy\"></p> <p> Lexmark Slow Print Problem im Detail: Unter Windows 10 druckt Ihr Lexmark Drucker beim Drucken einer einzelnen Seite schnell, aber wenn Sie mehrere Seiten drucken möchten, ist der Druck langsam, da der Druckvorgang zu lange dauert und der Drucker dann eine druckt Seite auf einmal alle 1-2 Minuten. </p> <p> Dieses Tutorial enthält Anweisungen zum Beheben des Problems des langsamen Druckens mehrerer Seiten von Lexmark in Windows 10. </p> <ul> <li><strong> Verwandter Artikel: </strong> <a href=\"https://www.repairwin.com/fix-slow-pdf-printing-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> FIX: Langsamer PDF-Druck in Windows 10 </a></li> </ul> <h4> So beheben Sie: Langsamer Druck mehrerer Seiten im Lexmark-Drucker unter Windows 10. </h4> <h6> Methode 1. Ändern Sie die Druckereinstellungen. </h6> <p> 1. Navigieren Sie zu <strong> Schalttafel </strong> -&gt; <strong> Geräte und Drucker. </strong><br> 2. Klicken Sie mit der rechten Maustaste auf Ihren Drucker und wählen Sie <strong> Eigenschaften. </strong></p> <p><img src=\"images/image_thumb-30-253.png\" alt=\"Printer Properties\" loading=\"lazy\"></p> <p> 3. Auf der Registerkarte „Allgemein“ <strong> Klicken Sie auf Eigenschaften ändern. </strong></p> <p><img src=\"images/image_thumb-31-900.png\" alt=\"Change Printer Properties\" loading=\"lazy\"></p> <p> 4. Legen Sie in den Lexmark Druckeinstellungen die <strong> Papiertyp </strong> zu <strong> Einfach </strong> und klicke <strong> OK. * </strong></p> <p> * Hinweis: Andere Einstellungen, die auf Ihrem Drucker angewendet werden können, um die Druckgeschwindigkeit zu verbessern: </p> <ul> <li><strong> Druckauflösung </strong><strong> : </strong> 600 dpi verlangsamt den Drucker. </li> <li><strong> Ruhemodus </strong><strong> : </strong> aus </li> </ul> <p><img src=\"images/image_thumb-32-858.png\" alt=\"FIX Slow Lexmark Printing Lexmark - Windows 10\" loading=\"lazy\"></p> <p> 5. Klicken Sie nun auf <strong> Anwenden </strong> und <strong> OK </strong> im Fenster &quot;Druckereigenschaften&quot;, um die Änderung zu übernehmen. <br> 6. Öffnen Sie ein Dokument mit mehreren Seiten und prüfen Sie, ob das Problem behoben ist. Wenn nicht, fahren Sie mit Methode-2 unten fort. </p> <h6> Methode 2. Ändern Sie den Druckertreiber. </h6> <p> 1. Navigieren Sie zu <strong> Schalttafel </strong> -&gt; <strong> Geräte und Drucker. </strong><br> 2. Klicken Sie mit der rechten Maustaste auf Ihren Drucker und wählen Sie <strong> Gerät entfernen. </strong></p> <p><img src=\"images/image_thumb-33-755.png\" alt=\"Uninstall Printer Windows 10\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 2. Navigieren Sie nach dem Entfernen des Druckers zu <strong> Programme und Funktionen </strong> in der Systemsteuerung und <strong> deinstallieren </strong> das <strong> Lexmark-Software </strong> (von irgendwelchen). </p> <p> 3. Navigieren Sie zu <a href=\"https://www.lexmark.com/en_us/support/download-search.html\" target=\"_blank\" rel=\"nofollow noopener\"> Lexmark Treiber und Downloads </a> -Site und suchen Sie nach verfügbaren Treibern für Ihr Druckermodell und Ihr Betriebssystem. <br> 4. Laden Sie aus der Liste der verfügbaren Treiber einen der folgenden Treiber herunter und installieren Sie ihn: * </p> <ul> <li> <p> Universal-Druckertreiber. </p> </li> <li> <p> Universeller PCL5e-Emulationsdruckertreiber. </p> </li> <li> <p> Druckertreiber für die universelle PostScript 3-Emulation. </p> </li> </ul> <p> * Hinweis: Ich empfehle Ihnen, die Druckertreiber in der oben aufgeführten Reihenfolge auszuprobieren. </p> <p> 5. Wenn die Installation des Druckertreibers abgeschlossen ist, <strong> neu starten </strong> dein PC. <br> 6. Versuchen Sie nach dem Neustart, ein langes Dokument zu drucken. Das Problem mit dem langsamen Drucken sollte behoben sein. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um das Problem zu verbreiten. </p>"}