{"title":"UPDATE: Dienst konnte nicht gestartet werden – Fehler 0x800106ba, in Windows Defender oder Security Essentials (Gelöst)","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben des Fehlers 0x800106ba in Microsoft Security Essentials oder in Defender Antivirus: „Der Dienst konnte nicht gestartet werden. </p> <p> Der Defender Antivirus &amp; Security Essentials-Fehler 0x800106ba „Dienst konnte nicht gestartet werden“, tritt normalerweise auf, wenn ein Antivirenprogramm eines Drittanbieters installiert ist oder ein Malware-Programm den Virenschutz auf Ihrem Computer deaktiviert hat. Um den Fehler 0x800106ba zu beheben, führen Sie die folgenden Schritte aus. </p> <p> </p> <p><img src=\"images/image_thumb-15-373.png\" alt=\"FIX: Error Code 0x800106ba - Security Essentials or Defender Antivirus Service Couldn't be Started \" loading=\"lazy\"></p> <p><strong> Beachtung: </strong> Wenn Sie nach der Installation eines Antivirenprogramms eines Drittanbieters den Security Essentials-Fehler 0x800106ba erhalten, ist dies normal. In diesem Fall müssen Sie das Antivirenprogramm von Drittanbietern deinstallieren, um das Problem zu beheben. </p> <h6> Methode 1. Schalten Sie den Echtzeitschutz manuell ein. </h6> <p> In einigen Fällen kann der Fehler 0x800106ba in Security Essentials &amp; Defender Antivirus einfach durch Aktivieren des Echtzeitschutzes behoben werden. Klicken Sie also auf <strong> Einschalten </strong> und warten Sie, ob das Problem behoben ist. Wenn das Problem nach 1-2 Minuten weiterhin besteht, fahren Sie mit der nächsten Methode fort. </p> <p><img src=\"images/image_thumb-16-326.png\" alt=\"Security Essentials Real Time protection is Off\" loading=\"lazy\"></p> <h6></h6> <h6> Methode 2. Scannen Sie Ihren Computer auf Malware und Viren. </h6> <p> Die nächste Methode zum Beheben des Fehlers „Der Dienst konnte nicht gestartet werden“ in Defender Antivirus (oder in Security Essentials AV) besteht darin, Ihr System zu scannen und von Viren und Malware zu befreien. Befolgen Sie für diese Aufgabe die Anweisungen in dieser Anleitung: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> So scannen Sie Ihren Computer auf Viren und andere bösartige Programme. </a></p> <p> </p> <h6> Methode 3. Aktivieren Sie den Windows Defender-Dienst in der Registrierung. </h6> <p> 1. Öffnen Sie den Registrierungseditor. Das zu tun: </p> <blockquote><p> 1. Drücken Sie Windows <img src=\"images/image_thumb41-831.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ <strong> regedit </strong> und drücke <strong> Eingeben </strong> . </p></blockquote> <p><img src=\"images/image_thumb42-767.png\" alt=\"registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Suchen Sie im Windows-Registrierungseditor den folgenden Schlüssel: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\services\\WinDefend </li> </ul> <p> 4. Doppelklicken Sie im rechten Bereich auf den Startwert und stellen Sie die Wertdaten von 4 auf . ein <strong> 2 </strong> . <br> 5. Wenn Sie fertig sind, klicken Sie auf <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-18-184.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Schließen Sie den Registrierungseditor und <strong> neu starten </strong> dein PC. <br> 7. Wenn das Problem nach dem Neustart weiterhin besteht, fahren Sie mit der nächsten Methode fort. </p> <h6> Methode 4. Aktivieren Sie den Echtzeitschutz aus der Registrierung. </h6> <p> 1. Öffnen Sie die <strong> Registierungseditor. <br> </strong> 2. Navigieren Sie zu folgendem Schlüssel im linken Fensterbereich: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows Defender </li> </ul> <p> 3. Klicken Sie mit der rechten Maustaste auf das <strong> Windows Defender </strong> tasten und klicken <strong> Berechtigungen. </strong></p> <p> </p> <p><img src=\"images/image_thumb-52-207.png\" alt=\"disable windows defender\" loading=\"lazy\"></p> <p> 4. Klicken Sie auf <strong> Fortgeschritten </strong> und dann klick <strong> Veränderung </strong> Inhaber. </p> <p><img src=\"images/image_thumb-60-556.png\" alt=\"disable windows defender windows 8\" loading=\"lazy\"></p> <p> </p> <p> 5. Geben Sie im Feld &quot;Geben Sie den Namen zur Auswahl ein&quot; ein <strong> Administratoren </strong> und klicke <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-54-870.png\" alt=\"turn off windows defender windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. Klicken Sie auf <strong> Besitzer von Untercontainern und Objekten ersetzen </strong> und klicke <strong> Anwenden. </strong></p> <p><img src=\"images/image_thumb-55-987.png\" alt=\"disable defender antivirus windows 10\" loading=\"lazy\"></p> <p> </p> <p> 7. Doppelklicken Sie auf <strong> Administratoren </strong> Eintrag. </p> <p><img src=\"images/image_thumb-56-471.png\" alt=\"disable defender security windows 10\" loading=\"lazy\"></p> <p> </p> <p> 8. Überprüfen Sie die <strong> Volle Kontrolle </strong> Aktivieren Sie das Kontrollkästchen und klicken Sie dann auf <strong> OK </strong> dreimal (3), um Berechtigungseigenschaften zu schließen. </p> <p><img src=\"images/image_thumb-57-123.png\" alt=\"disable defender security\" loading=\"lazy\"></p> <p> </p> <p> 9. <strong> Schließen </strong> Registierungseditor. </p> <p> 10. Wieder- <strong> öffnen </strong> Registrierungseditor und navigieren Sie zum gleichen Registrierungsspeicherort: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows Defender </li> </ul> <p> 11. Doppelklicken Sie im rechten Fensterbereich, um das <strong> AntiSpyware deaktivieren </strong> REG_DWORD-Wert und ändern Sie die Wertdaten in <strong>0</strong></p> <p><img src=\"images/image_thumb-19-953.png\" alt=\"Enable Windows Defender registry\" loading=\"lazy\"></p> <p> </p> <p> 12. Dann öffnen Sie die <strong> AntiVirus deaktivieren </strong> REG_DWORD-Wert und ändern Sie die Wertdaten in <strong>0</strong> . * </p> <p> * Hinweis: Wenn Sie das Betriebssystem Windows 7 besitzen, überspringen Sie diesen und den nächsten Schritt, schließen Sie den Registrierungseditor und starten Sie Ihren PC neu. </p> <p> 13. Navigieren Sie schließlich zu diesem Schlüssel: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SecurityHealthService </li> </ul> <p> 14. Doppelklicken Sie im rechten Bereich auf <strong> Start </strong> REG_DWORD-Wert und ändern Sie die Wertdaten in <strong> 3 </strong> . </p> <p><img src=\"images/image_thumb-20-710.png\" alt=\"Enable Defender Antivirus in Registry\" loading=\"lazy\"></p> <p> fünfzehn. <strong> Schließen </strong> Registrierungseditor und <strong> neu starten </strong> dein Computer. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}