{"title":"UPDATE: Problem mit dem Hintergrundhintergrund in Windows 7 (Gelöst)","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben des Problems mit dem schwarzen Hintergrund, wenn das Hintergrundbild in Windows 7 auf &quot;Stretch&quot; eingestellt ist. Das Problem mit dem schwarzen Hintergrund kann auf Windows 7-basierten Computern nach der Installation des Updates KB4534310 vom 14. Januar 2020 auftreten. </p> <p><img src=\"images/image_thumb-16-423.png\" alt=\"FIX: Back Wallpaper issue in Windows 7\" loading=\"lazy\"></p> <p> Das Problem mit dem schwarzen Hintergrund von Windows 7 ist ein bekannter Fehler nach der Installation des <a href=\"http://www.catalog.update.microsoft.com/Search.aspx?q=KB4534310\" target=\"_blank\" rel=\"nofollow noopener\"> KB4534310 aktualisieren </a> und als Microsoft <a href=\"https://support.microsoft.com/en-us/help/4534310/windows-7-update-kb4534310\" target=\"_blank\" rel=\"nofollow noopener\"> sagt </a> : &quot;Wir arbeiten an einer Lösung und werden in einer kommenden Version ein Update bereitstellen, das für alle Kunden mit Windows 7 und Windows Server 2008 R2 SP1 freigegeben wird.&quot; </p> <p> Wenn Sie das Problem mit dem &quot;schwarzen Hintergrund&quot; beheben möchten, befolgen Sie die nachstehenden Anweisungen, bis Microsoft ein Update veröffentlicht, um es zu beheben. </p> <h4> So beheben Sie das Problem mit dem schwarzen Hintergrund in Windows 7. </h4> <h6> Methode 1. Deinstallieren Sie das KB4534310-Update. </h6> <p> Die erste Methode, um die Probleme mit dem schwarzen Hintergrund in Windows 7 zu beheben, besteht darin, das Update KB4534310 zu entfernen.* </p> <p> * Hinweis: Da das Update KB4534310 Sicherheitsverbesserungen und Fixes für Windows 7 enthält, ist es nicht ratsam, es zu deinstallieren. Wir empfehlen daher, das Problem zu beheben, indem Sie den Anweisungen unter folgen <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Methode-2 </a> unten. </p> <p> So deinstallieren Sie das KB4534310-Update: </p> <p> 1. Klicken Sie mit der rechten Maustaste auf das <strong> Start </strong> Speisekarte <img src=\"images/image_thumb-38-451.png\" alt=\"image\" loading=\"lazy\"> und wähle <strong> Schalttafel </strong> . <br> 2. Stellen Sie die <strong> Anzeigen nach: bis Kleine Symbole </strong> und klicke <strong> Programm &amp; Funktionen. </strong></p> <p><img src=\"images/image_thumb-51-750.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 3. Klicken Sie auf <strong> Zeige installierte Updates </strong> im linken Bereich. </p> <p> </p> <p><img src=\"images/image_thumb-52-942.png\" alt=\"uninstall updates windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Geben Sie im Suchfeld &quot; <strong> KB4534310 </strong> “ und drücken Sie die Eingabetaste. <br> 5. Markieren Sie das &quot;Sicherheitsupdate für Microsoft Windows (KB4534310)&quot; und klicken Sie auf <strong> Deinstallieren </strong> . </p> <p><img src=\"images/image_thumb-12-776.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Methode 2. Ändern Sie die Bildposition außer &quot;Stretch&quot;. </h6> <p> Das Problem mit dem schwarzen Hintergrund in Windows 7 tritt nur auf, wenn das ausgewählte Hintergrundbild gestreckt ist. Die nächste Methode zur Behebung des Problems besteht also darin, eine andere Bildposition für das Hintergrundbild festzulegen. Das zu tun: </p> <p> 1. Klicken Sie mit der rechten Maustaste auf Ihren Desktop und klicken Sie auf <strong> Personifizieren </strong> . </p> <p><img src=\"images/image_thumb-17-501.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Klicken Sie auf <strong> Desktop-Hintergrund </strong></p> <p><img src=\"images/image_thumb-14-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Wenden Sie nun die folgenden Aktionen an: </p> <p> ein. Wählen Sie bei Bildspeicherort <strong> Bildbibliothek. </strong><br> b. Wählen Sie das gewünschte Bild als Hintergrund oder ein anderes benutzerdefiniertes Bild/Foto, das Ihrer Bildschirmauflösung entspricht. * </p> <blockquote> <p> * Tipp: Um die aktuelle Bildschirmauflösung herauszufinden, klicken Sie mit der rechten Maustaste auf Desktop und klicken Sie auf <strong> Bildschirmauflösung </strong> . </p> </blockquote> <p> c. Beim <strong> Bildposition </strong> , wählen Sie eine andere Option außer &quot; <strong> Strecken </strong> “, wie „Füllen“, „Anpassen“, „Kacheln“ oder „Mitte“. <br> d. Wenn Sie fertig sind, klicken Sie auf Speichern <strong> Änderungen </strong> . </p> <p><img src=\"images/image_thumb-15-519.png\" alt=\"image\" loading=\"lazy\"></p> <p> Das ist alles! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}