{"title":"UPDATE: Viren- und Bedrohungsschutz wird von Ihrer Organisation in Windows 10 verwaltet. (Gelöst)","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben des folgenden Problems im Windows Defender Security Center: „Ihr Viren- und Bedrohungsschutz wird von Ihrer Organisation verwaltet“ im Windows 10-Betriebssystem. </p> <p> Die Windows Defender-Meldungen (Fehler): &quot;Ihr Viren- und Bedrohungsschutz wird von Ihrer Organisation verwaltet&quot;, &quot;Einige Einstellungen werden von Ihrer Organisation verwaltet&quot; &amp; <br> &quot;Echtzeitschutz wird von Ihrem Administrator verwaltet&quot; wird häufig auf Unternehmenscomputern angezeigt, auf denen der Virenschutz vom Domänenadministrator verwaltet wird. Wenn der Computer keiner Domäne angehört, werden die oben genannten Fehler nach der Installation eines Antivirenprogramms eines Drittanbieters oder nach einem Virenangriff angezeigt. </p> <p><img src=\"images/image_thumb-25-853.png\" alt=\"FIX: Virus & Threat Protection is Managed by your Organization - Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> So beheben Sie: Ihr Viren- und Bedrohungsschutz wird von Ihrer Organisation in Windows 10 verwaltet. </h4> <h6> Schritt 1. Deinstallieren Sie alle anderen Nicht-Microsoft-Antivirus-Programme. </h6> <p> Der erste Schritt zur Behebung des Windows Defender-Fehlers „Der Viren- und Bedrohungsschutz wird von Ihrer Organisation verwaltet“ besteht darin, alle anderen Antivirenprogramme von Drittanbietern (z. </p> <p> </p> <h6> Schritt 2. Scannen Sie Ihr System auf Viren und Malware. </h6> <p> Der zweite Schritt zum Beheben des Windows Defender-Fehlers „Einige Einstellungen werden von Ihrer Organisation verwaltet“ besteht darin, sicherzustellen, dass Ihr System frei von Viren/Malware ist. Befolgen Sie für diese Aufgabe die Anweisungen in dieser Anleitung: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> So scannen Sie Ihren Computer auf Viren und andere bösartige Programme. </a></p> <p> </p> <h6> Schritt 3. Wiederherstellen der Windows Defender-Einstellungen auf die Standardwerte. </h6> <p> Fahren Sie fort und aktivieren Sie den Echtzeitschutz in Windows Defender, indem Sie eine der folgenden Methoden verwenden: </p> <h4> Methode 1. Aktivieren Sie Defender Antivirus Protection in der Registrierung. </h4> <p> 1. Öffnen <strong> Registierungseditor </strong> : Das zu tun: </p> <ul> <li> Drücken Sie gleichzeitig die Windows <img src=\"images/image_thumb36-979.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. </li> <li> Art <strong> regedit </strong> &amp; Drücken Sie <strong> Eingeben. </strong></li> </ul> <p><img src=\"images/image_thumb7-229.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2. Navigieren Sie zu folgendem Schlüssel im linken Fensterbereich: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Windows Defender </strong></li> </ul> <p> 3. Doppelklicken Sie im rechten Bereich auf <strong> AntiSpyware deaktivieren </strong> REG_DWORD-Wert und ändern Sie die Wertdaten von 1 auf <strong> 0. </strong></p> <p><img src=\"images/image_thumb-26-852.png\" alt=\"enable defender antivirus protection - registry\" loading=\"lazy\"></p> <p> </p> <p> 4. Klicken Sie auf <strong> OK </strong> und <strong> schließen </strong> Registierungseditor. <br> 5. <strong> Neu starten </strong> dein PC. Normalerweise sollte Windows Defender nach dem Neustart aktiviert sein. * </p> <p> * Hinweis: Wenn der Windows Defender nach dem Neustart Ihres PCs immer noch deaktiviert ist, mit dem Status &quot;Ihr Viren- und Bedrohungsschutz wird von Ihrer Organisation verwaltet&quot;, fahren Sie fort und ändern Sie die <br> <strong> Start </strong> REG_DWORD-Wert von 4 bis <strong> 2 </strong> an den folgenden Registrierungsschlüsseln: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SecurityHealthService </li> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\WinDefend </li> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\WdNisSvc </li> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\MpsSvc </li> </ul> <p> </p> <h5> Methode 2. Löschen Sie die <strong> AntiSpyware deaktivieren </strong> Registrierungswert von der Eingabeaufforderung. </h5> <p> 1. Öffnen <strong> Eingabeaufforderung als Administrator </strong> . Das zu tun: </p> <ul> <li> Geben Sie im Suchfeld Folgendes ein: <strong> Eingabeaufforderung </strong> oder <strong> cmd </strong></li> <li> Klicken Sie mit der rechten Maustaste auf <strong> cmd </strong> oder <strong> Eingabeaufforderung </strong> Ergebnis und auswählen <strong> Als Administrator ausführen. </strong></li> </ul> <p><img src=\"images/image_thumb-10-243.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. Geben Sie in der Eingabeaufforderung (Kopieren/Einfügen) den folgenden Befehl ein und drücken Sie <strong> Eingeben: </strong></p> <ul> <li> REG DELETE &quot;HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows Defender&quot; /v DisableAntiSpyware </li> </ul> <p> 3. Drücken Sie dann <strong> Ja </strong> um Ihre Entscheidung zu bestätigen. </p> <p><img src=\"images/image_thumb-28-288.png\" alt=\"enable defender antivirus protection command\" loading=\"lazy\"></p> <p> </p> <p> 4. Eingabeaufforderung schließen und <strong> neu starten </strong> dein Computer. </p> <p> </p> <h5> Methode 3. Aktivieren Sie den Windows Defender-Echtzeitschutz in der Gruppenrichtlinie. </h5> <p> Wenn Sie Windows 10 Professional, Enterprise oder Education Edition besitzen, fahren Sie fort und aktivieren Sie den Windows Defender-Antivirus-Schutz in der Gruppenrichtlinie. Das zu tun: </p> <p> 1. Drücken Sie gleichzeitig die Windows <img src=\"images/image_thumb36-102.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ <strong> gpedit.msc </strong> &amp; Drücken Sie <strong> Eingeben. </strong></p> <p><img src=\"images/image_thumb-78-343.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Navigieren Sie im linken Bereich zu: </p> <ul> <li><strong> Computerkonfiguration\\Administrative Vorlagen\\Windows-Komponenten\\Windows Defender Antivirus </strong></li> </ul> <p> 4. Öffnen Sie im rechten Fenster die <strong> Deaktivieren Sie Windows Defender Antivirus </strong> Rahmen. </p> <p><img src=\"images/image14_thumb-207.png\" alt=\"turn on defender antivirus protection- group policy\" loading=\"lazy\"></p> <p> </p> <p> 5. Setzen Sie die Richtlinieneinstellung auf <strong> Nicht konfiguriert </strong> oder <strong> Deaktiviert </strong> um den Echtzeitschutz zu aktivieren und klicken Sie auf <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-29-337.png\" alt=\"enable defender antivirus protection group policy\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Neu starten </strong> der Computer. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um das Problem zu verbreiten. </p>"}