{"title":"UPDATE: Outlook 0x80042112 – Empfang eines gemeldeten Fehlers (Gelöst)","content":"<p> Outlook 0x80042112 Fehler beim Empfangen gemeldet, tritt normalerweise auf, wenn Outlook versucht, sehr große E-Mails zu empfangen (z. B. E-Mails mit großen Anhängen). In diesem Fall zeigt Outlook während des &#39;Sende-/Empfangs-Fortschritts&#39; folgenden Fehler an: &quot;Aufgabe &#39;%Email-Account% – Empfangen&#39; gemeldeter Fehler (0x80042112): &#39;Die folgenden E-Mail-Nachrichten auf dem Mailserver können nicht heruntergeladen werden. Wenden Sie sich an Ihren Internetdienstanbieter (ISP) oder E-Mail-Administrator, wenn dieser Fehler weiterhin angezeigt wird.&quot; </p> <p><img src=\"images/image_thumb-7-121.png\" alt=\"FIX: Outlook 0x80042112 Receiving reported error. \" loading=\"lazy\"></p> <p> Dieses Tutorial enthält detaillierte Anweisungen zum Beheben des Outlook-Empfangsfehlers 0x80042112. </p> <h4> So beheben Sie den Outlook-Empfangsfehler 0x80042112. </h4> <h6> Schritt 1. Stellen Sie sicher, dass Sie mit dem Internet verbunden sind. </h6> <p> Manchmal tritt der Outlook-Empfangsfehler 0x80042112 auf, weil die Internetverbindung unterbrochen wurde. Stellen Sie daher zunächst sicher, dass Ihre Internetverbindung funktioniert. Öffnen Sie dazu Ihren Internetbrowser und besuchen Sie eine beliebige Website, um Ihre Verbindung zu überprüfen. </p> <p> </p> <h6> Schritt 2. Löschen Sie E-Mail-Nachrichten im Postausgang. </h6> <p> Die zweite Methode zum Beheben des Fehlers 0x80042112 in Outlook besteht darin, alle E-Mail-Nachrichten, die im Postausgang hängengeblieben sind, zu löschen oder in Entwürfe zu verschieben. Das zu tun: </p> <p> 1. Klicken Sie in Outlook auf das <strong> Senden empfangen </strong> Registerkarte, und klicken Sie dann auf <strong> Offline arbeiten </strong> . </p> <p><img src=\"images/image_thumb-8-737.png\" alt=\"Move Outbox Emails to Drafts folder\" loading=\"lazy\"></p> <p> 2. <strong> Neu starten </strong> Ausblick. <br> 3. Wählen Sie die <strong> Postausgang </strong> Ordner (links) und drücken Sie dann <strong> STRG </strong> + <strong> EIN </strong> um alle E-Mails auszuwählen (rechts). <br> 4. Klicken Sie mit der rechten Maustaste auf die ausgewählten E-Mails und verschieben Sie sie nach <strong> Entwürfe </strong> Ordner, indem Sie auf <strong> Verschieben -&gt; Anderer Ordner </strong> , und wählen Sie dann die <strong> Entwürfe </strong> Ordner aus der Liste. </p> <p><img src=\"images/image_thumb-10-352.png\" alt=\"FIX Outlook error 0x80042112\" loading=\"lazy\"></p> <p> </p> <p> 5. Wenn Sie fertig sind, klicken Sie auf <strong> Senden empfangen </strong> Registerkarte und klicken Sie auf <strong> Online arbeiten. <br> </strong> 6. <strong> Neu starten </strong> Outlook und führen Sie ein Senden/Empfangen durch. </p> <h6></h6> <h6> Schritt 3. Führen Sie Outlook ohne Add-Ins aus. </h6> <p> Eine andere Methode zum Beheben des Outlook-Fehlers 0x80042112 beim Empfangen besteht darin, die Outlook-Anwendung im abgesicherten Modus zu starten und alle Add-Ins zu deaktivieren, die den Fehler verursachen können. </p> <p> 1. Um Outlook im abgesicherten Modus zu starten, halten Sie die <strong> STRG </strong> (auf Ihrer Tastatur) und doppelklicken Sie dann auf die Microsoft Outlook-Verknüpfung, oder: </p> <blockquote><p> ein. Drücken Sie gleichzeitig die Windows <img src=\"images/image_thumb36-371.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> b. Art: <strong> Ausblick /sicher </strong> und klicke <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-14-671.png\" alt=\"outlook safe mode\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. Navigieren Sie im abgesicherten Modus von Outlook zu Add-Ins-Optionen und <strong> alle Add-Ins deaktivieren </strong> . Das zu tun: </p> <ul> <li> So deaktivieren Sie Add-Ins in <strong> Ausblick 2007 </strong> : </li> </ul> <blockquote><p> 1. <strong> Auf </strong> das <strong> Werkzeuge </strong> Menü, klick <strong> Trustcenter. </strong><br> 2. Wählen Sie <strong> Add-Ins </strong> im linken Bereich. <br> 3. Wählen Sie im rechten Bereich <strong> COM-Add-Ins </strong> und klicke <strong> Gehen… <br> </strong> 4. <strong> Deaktivieren Sie </strong> alle Kontrollkästchen, um alle Add-Ins zu deaktivieren und klicken Sie auf <strong> OK. </strong></p></blockquote> <ul> <li> So deaktivieren Sie Add-Ins in <strong> Ausblick 2016, 2013 </strong> oder <strong> 2010 </strong> : </li> </ul> <blockquote><p> 1. Klicken Sie auf das <strong> Datei </strong> Menü und wählen Sie <strong> Optionen </strong> . <br> 2. Wählen Sie <strong> Add-Ins bei </strong> das linke Fenster. <br> 3. Wählen Sie im rechten Bereich <strong> COM-Add-Ins </strong> und klicke <strong> Gehen… </strong></p></blockquote> <p><img src=\"images/image_thumb-20-411.png\" alt=\"disable outlook add-ins\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. <strong> Deaktivieren Sie </strong> <strong> alle </strong> die Kontrollkästchen und klicken Sie auf <strong> OK </strong> um alle Add-Ins zu deaktivieren. </p> <p><strong><img src=\"images/image_thumb-21-683.png\" alt=\"turn off outlook add-ins\" loading=\"lazy\"><strong><br> </strong></strong></p> </blockquote> <p> 3. <strong> Neu starten </strong> Ausblick. <br> 4. Versuchen Sie zu senden/empfangen. Wenn der Sende-/Empfangsfortschritt normal endet und ohne den Fehler 0x80042112 anzuzeigen, fahren Sie fort und aktivieren Sie nacheinander alle deaktivierten Plugins und starten Sie Outlook neu, bis Sie feststellen, welches das Problem verursacht. </p> <p> </p> <h6> Schritt 4. Überprüfen Sie Ihre Antivirus- und Firewall-Einstellungen. </h6> <p> Wenn Sie ein Antivirenprogramm mit E-Mail-Scanfunktionen verwenden, deaktivieren Sie das Antivirus-Add-In in Outlook (siehe die Anweisungen in Schritt 3 oben), deaktivieren Sie vorübergehend den Antivirus-Schutz oder deinstallieren Sie das Antivirus-Programm. Überprüfen Sie außerdem Ihre Firewall-Einstellungen und stellen Sie sicher, dass die von Ihnen verwendeten E-Mail-Server-Ports nicht vom Firewall-Programm blockiert werden. Genauer gesagt in Ihren Firewall-Einstellungen: </p> <p> A. Aktivieren Sie die folgenden Dateien, um auf das Internet zuzugreifen: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Aktivieren Sie die folgenden Ports in der Firewall: </p> <ul> <li><strong> Anschluss 110 </strong> (Wenn Sie einen POP3-Posteingangsserver ohne verschlüsselte Verbindung verwenden) * </li> <li><strong> Port 995 </strong> (Wenn Sie einen POP3-Posteingangsserver mit verschlüsselter Verbindung verwenden (SSL aktiviert) </li> </ul> <ul> <li><strong> Port 143 </strong> (wenn Sie einen IMAP Posteingangsserver ohne verschlüsselte Verbindung verwenden) </li> <li><strong> Port 993 </strong> (wenn Sie einen IMAP Posteingangsserver mit verschlüsselter Verbindung verwenden (SSL aktiviert) </li> </ul> <ul> <li><strong> Anschluss 25 </strong> Wenn Ihr SMTP-Server für ausgehende Mail kein SSL verwendet. * </li> <li><strong> Port 465 </strong> oder <strong> 587 </strong> wenn Ihr SMTP-Server für ausgehende Mail SSL verwendet </li> </ul> <p> * Hinweis: Standardmäßig ist Port 25 für den ausgehenden Zugriff und Port 110 für den eingehenden Zugriff. Wenn Sie sich bezüglich der Ports nicht sicher sind, wenden Sie sich an Ihren ISP oder Systemadministrator. </p> <p> </p> <h6> Schritt 5. Reparieren Sie die Outlook PST-Datendatei. </h6> <p> Der nächste Schritt zum Beheben des vom Outlook-Empfang gemeldeten Fehlers 0x80042112 besteht darin, das Posteingangsreparaturtool auszuführen, um Ihre PST-Datei zu reparieren. Die detaillierte Anleitung dazu finden Sie in diesem Tutorial: <a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> So reparieren Sie die Outlook PST-Datendatei </a> . </p> <p> </p> <h6> Schritt 6. Überprüfen Sie die Größe der E-Mail-Nachricht(en) aus dem WEB. </h6> <p> Wenn Sie über das Internet auf Ihr E-Mail-Konto zugreifen können, melden Sie sich mit Ihrem Webbrowser bei Ihrem E-Mail-Konto an und prüfen Sie, ob die Größe einer E-Mail das Problem ist. Wenn Sie beispielsweise eine große E-Mail in Ihrem Posteingang finden, laden Sie deren Anhänge herunter und löschen Sie diese E-Mail. * </p> <p> * Hinweis: Wenn Sie über das Internet keinen Zugriff auf Ihr E-Mail-Konto haben, wenden Sie sich an Ihren E-Mail-Anbieter, um das Problem zu melden. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}