{"title":"UPDATE: Outlook-Empfangsfehler 0x80042108 (Gelöst)","content":"<p> Dieses Tutorial enthält Schritt-für-Schritt-Anleitungen zum Beheben des gemeldeten Outlook-Empfangsfehlers 0x80042108. Der Outlook-Fehler 0x80042108 tritt normalerweise auf, wenn Sie den Namen des POP3-E-Mail-Servers falsch eingegeben haben oder keinen Zugriff auf das Internet haben. </p> <p> Das Problem sind Details. Outlook 2003, 2007, 2010 oder Outlook 2013 zeigt den folgenden Fehler während des Senden-Empfangen-Vorgangs an: &quot;Erhalten gemeldeter Fehler (0x80042108): Outlook kann keine Verbindung zu Ihrem Posteingangsserver (POP3) herstellen , wenden Sie sich an Ihren Serveradministrator oder Internetdienstanbieter (ISP)&quot;. </p> <p><img src=\"images/outlookerror_0x80042108-505.png\" alt=\"Outlook Error 0x80042108\" loading=\"lazy\"></p> <p> Der Outlook-Fehler „0x80042108“ kann in jeder Outlook-Version (2016, 2013, 2010 oder 2007) auftreten und wird angezeigt, wenn das Outlook-E-Mail-Client-Programm keine Verbindung zum E-Mail-Server herstellen kann. </p> <h4> So beheben Sie den Fehler 0x80042108 in Outlook 2007, 2010, 2013 oder 2016. </h4> <h6> Schritt 1. Überprüfen Sie Ihre Internetverbindung. </h6> <p> Der erste Schritt zur Behebung des Outlook 80042108-Empfangsfehlers besteht darin, Ihre Internetverbindung zu überprüfen. Öffnen Sie also Ihren Internetbrowser und besuchen Sie eine beliebige Website, um sicherzustellen, dass Ihre Internetverbindung funktioniert. </p> <h6> Schritt 2. Überprüfen Sie die Einstellungen des POP3-Mailservers. </h6> <p> Der zweite Schritt zur Behebung des Outlook-Empfangsfehlers 0x80042108 besteht darin, zu überprüfen, ob Sie die richtigen E-Mail-Servereinstellungen angegeben haben. Wenden Sie sich also an Ihren E-Mail-Anbieter und vergewissern Sie sich, dass Sie den eingehenden Mailservernamen und die Portnummer richtig eingegeben haben. So zeigen Sie die E-Mail-Servereinstellungen an und ändern sie: </p> <p> 1. Öffnen Sie Outlook. <br> 2. Gehe zu <strong> Datei </strong> –&gt; <strong> Account Einstellungen </strong> . </p> <p><img src=\"images/image_thumb-7-811.png\" alt=\"switch Account Mail Merge \" loading=\"lazy\"></p> <p> </p> <p> 3. In <strong> Email </strong> doppelklicken Sie auf Ihr E-Mail-Konto, um die Einstellungen zu ändern/anzuzeigen. <br> 4. Vergewissern Sie sich, dass Sie im entsprechenden Feld den richtigen Namen des Posteingangsservers festgelegt haben. <br> 5. Wenn Sie fertig sind, klicken Sie auf <strong> Mehr Einstellungen </strong> . </p> <p><img src=\"images/image_thumb-31-256.png\" alt=\"FIX: Outlook Receiving reported error 0x80042108\" loading=\"lazy\"></p> <blockquote><p> </p></blockquote> <p> 6. Klicken Sie auf das <strong> Fortgeschritten </strong> und überprüfen Sie, ob Sie den richtigen Port und die richtige SSL-Einstellung für den Posteingangsserver (POP3) angegeben haben. </p> <p> </p> <p><img src=\"images/image_thumb-33-400.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Wenn Sie fertig sind, klicken Sie auf <strong> OK </strong> und schließen Sie dann alle geöffneten Fenster. <br> 7. Testen Sie Outlook erneut. </p> <h6></h6> <h6> Schritt 3. Überprüfen Sie Ihre Antivirus- und Firewall-Einstellungen. </h6> <p> Wenn Sie ein Antivirenprogramm mit E-Mail-Scanfunktionen verwenden, dann <a href=\"https://www.repairwin.com/how-to-disable-add-ins-in-word-outlook-or-excel-2016-2013-2010-2007-or-2003/\" target=\"_blank\" rel=\"nofollow noopener\"> Deaktivieren Sie das Antivirus-Add-In in Outlook </a> oder deaktivieren Sie vorübergehend den Antivirus-Schutz oder deinstallieren Sie das Antivirus-Programm. Überprüfen Sie außerdem Ihre Firewall-Einstellungen und stellen Sie sicher, dass die von Ihnen verwendeten E-Mail-Server-Ports nicht vom Firewall-Programm blockiert werden. Genauer gesagt in Ihren Firewall-Einstellungen: </p> <p> A. Aktivieren Sie die folgenden Dateien, um auf das Internet zuzugreifen: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Aktivieren Sie die folgenden Ports, um auf das Internet zuzugreifen: </p> <ul> <li><strong> Anschluss 110 </strong> (Wenn Sie einen POP3-Posteingangsserver ohne verschlüsselte Verbindung verwenden) * </li> <li><strong> Port 995 </strong> (Wenn Sie einen POP3-Posteingangsserver mit verschlüsselter Verbindung verwenden (SSL aktiviert) </li> </ul> <ul> <li><strong> Port 143 </strong> (wenn Sie einen IMAP Posteingangsserver ohne verschlüsselte Verbindung verwenden) </li> <li><strong> Port 993 </strong> (wenn Sie einen IMAP Posteingangsserver mit verschlüsselter Verbindung verwenden (SSL aktiviert) </li> </ul> <ul> <li><strong> Anschluss 25 </strong> Wenn Ihr SMTP-Server für ausgehende Mail kein SSL verwendet. * </li> <li><strong> Port 465 </strong> oder <strong> 587 </strong> wenn Ihr SMTP-Server für ausgehende Mail SSL verwendet </li> </ul> <p> * Hinweis: Standardmäßig ist Port 25 für den ausgehenden Zugriff und Port 110 für den eingehenden Zugriff. Wenn Sie sich bezüglich der Ports nicht sicher sind, wenden Sie sich an Ihren ISP oder Systemadministrator. </p> <p> </p> <p><strong> Zusätzliche Hilfe: </strong> Wenn Ihnen die oben genannten Methoden nicht helfen, versuchen Sie Folgendes: </p> <p><strong> EIN. </strong> Entfernen Sie Ihr E-Mail-Konto und fügen Sie es erneut hinzu. <br> <strong> B. </strong><a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Reparieren Sie die Outlook PST-Datendatei </a> . <br> <strong> C. </strong> Trennen Sie die VPN-Verbindung (wenn Sie verbunden sind) <br> <strong> D. </strong> Office-Installation reparieren. Das zu tun: </p> <blockquote><p> 1. Navigieren Sie zu Windows <strong> Schalttafel </strong> &gt; <strong> Programme und Funktionen </strong> . <br> 2. Suchen und wählen Sie die MS Office-Anwendung aus und klicken Sie dann auf <strong> Veränderung </strong> . <br> 3. Wählen Sie dann die <strong> Reparatur </strong> Möglichkeit. </p></blockquote> <p> </p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? </p> <p> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}