{"title":"UPDATE: Remotedesktopverbindung konnte keine Verbindung herstellen, da bereits eine Konsolensitzung läuft (Gelöst).","content":"<p> Die Fehlermeldung zur Remotedesktopverbindung &quot;Ihr Computer konnte keine Verbindung zu einer anderen Konsolensitzung auf dem Remotecomputer herstellen, da bereits eine Konsolensitzung läuft&quot;, wird angezeigt, da der lokale und der Remotecomputer dieselbe IP-Adresse haben. Das Problem tritt normalerweise auf, wenn Sie versuchen, eine Remote-Verbindung zu einem anderen Computer über eine VPN-Verbindung herzustellen, und Sie von Ihrem lokalen Router dieselbe IP-Adresse wie der Remote-Computer &quot;erhalten&quot; haben. Befolgen Sie die nachstehenden Anweisungen, um das Problem zu beheben. </p> <p> </p> <p><img src=\"images/image_thumb-7-243.png\" alt=\"Remote Desktop Connection Could Not Connect because already have a console session in progress\" loading=\"lazy\"></p> <h4> So beheben Sie den RDP-Fehler: Remotedesktop konnte keine Verbindung zu einer anderen Konsolensitzung herstellen, da bereits eine Konsolensitzung ausgeführt wird. </h4> <p> Das Problem bei der Remotedesktopverbindung &quot;Verbindung zu einer anderen Konsolensitzung konnte nicht hergestellt werden, da bereits eine Konsolensitzung läuft&quot; tritt häufig auf, wenn der lokale Computer zufällig (vom DHCP-Server) dieselbe IP-Adresse wie die IP-Adresse der Fernbedienung erhält Computer, den Sie über RDP verbinden möchten. </p> <p> Die einzige Möglichkeit, das obige Problem zu beheben, besteht darin, die automatische Zuweisung der IP-Adresse vom DHCP-Server im lokalen Computer zu deaktivieren und manuell eine IP-Adresse anzugeben. Das zu tun: </p> <p> 1. <strong> Rechtsklick </strong> auf der <strong> Netzwerk </strong> Symbol <img src=\"images/image_thumb-42-527.png\" alt=\"image\" loading=\"lazy\"> in der Taskleiste und klicken Sie auf <strong> Öffnen Sie das Netzwerk- und Freigabecenter. </strong> * </p> <p><img src=\"images/image_thumb-104-485.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Wählen Sie <strong> Ethernet </strong> (oder Wi-Fi) auf der linken Seite und klicken Sie dann im Abschnitt &quot;Zugehörige Einstellungen&quot; auf <strong> Adapteroptionen ändern </strong> . </p> <p><img src=\"images/image_thumb-43-117.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Doppelklick </strong> am aktiven Netzwerkadapter (Ethernet oder Wi-Fi) und klicken Sie auf <strong> Einzelheiten </strong> . </p> <p><img src=\"images/image_thumb-8-177.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Notieren Sie die IP-Adressdetails in den folgenden Feldern und klicken Sie dann auf <strong> Schließen </strong> : </p> <ul> <li> IPv4-Adresse </li> <li> IPv4-Subnetzmaske </li> <li> IPv4-Standardgateway </li> <li> IPv4-DNS-Server </li> </ul> <p><img src=\"images/image_thumb-9-793.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Klicken Sie nun auf <strong> Eigenschaften </strong> . </p> <p><img src=\"images/image_thumb-10-628.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Wählen Sie die <strong> &#39;Internetprotokoll Version 4 (TCP/IPv4) </strong> &#39; und klicke <strong> Eigenschaften </strong></p> <p><img src=\"images/image_thumb-106-954.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 7. Wenden Sie bei den Eigenschaften von Internet Protocol Version 4 (TCP/IPv4) die folgenden Einstellungen an: </p> <p> A. Wählen Sie <strong> Verwenden Sie die folgende IP-Adresse: </strong></p> <blockquote><p> 1. Geben Sie im Feld IP-Adresse a . ein <strong> andere IP-Adresse als die IP-Adresse, die Sie zuvor bemerkt haben </strong> . (Ändern Sie nur die letzte Zahl auf einen höheren Wert). <br> 2. Geben Sie im Feld Subnet mask filed die gleiche Subnet-IP-Adresse ein, die Sie zuvor bemerkt haben. <br> 3. Geben Sie unter Standard-Gateway dasselbe Standard-Gateway ein, das Sie zuvor bemerkt haben. </p></blockquote> <p> B. Wählen Sie <strong> Verwenden Sie die folgenden DNS-Serveradressen </strong> : </p> <blockquote><p> 1. Geben Sie unter Bevorzugter DNS-Server die DNS-Adresse ein, die Sie zuvor bemerkt haben. </p></blockquote> <p> C. Wenn Sie fertig sind, klicken Sie auf <strong> OK </strong> zweimal und <strong> Schließen </strong> um die Eigenschaften des Adapters zu schließen. </p> <blockquote> <p><img src=\"images/image_thumb-11-850.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 8. Versuchen Sie nun, eine Verbindung zum Remotedesktop-Computer herzustellen. Das Problem sollte gelöst werden. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}