{"title":"UPDATE: VeraCrypt reagiert nicht (einfrieren) beim Dismounten in Windows 10 (Gelöst)","content":"<p> Diese Anleitung enthält Anweisungen zum Beheben des folgenden Problems mit VeraCrypt auf einem Windows 10-basierten Computer: VeraCrypt reagiert nicht und friert ein (hängt), wenn das verschlüsselte Volume aufgehoben wird. </p> <p> VeraCrypt reagiert nicht (einfrierend) Problem im Detail: Wenn Sie versuchen, ein Volume aufzuheben (wobei alle Dateien vom gemounteten Volume geschlossen sind), hängt sich VeraCrypt auf und zeigt &quot;Not Responding&quot; an. Wenn dieses Problem auftritt, besteht die einzige Möglichkeit, Windows in einen normalen Zustand wiederherzustellen, darin, den VeraCrypt-Prozess über den Task-Manager zu beenden. </p> <p> gemäß <a href=\"https://www.veracrypt.fr/en/Issues%20and%20Limitations.html\" target=\"_blank\" rel=\"nofollow noopener\"> VeraCrypt </a> Das Problem mit dem Einfrieren wird durch einen Konflikt zwischen dem VeraCrypt-Wartedialog, der während der Mount-/Dismount-Operationen angezeigt wird, und anderer auf dem Computer installierter Software (z. B. Antivirus oder Firewall) verursacht. </p> <h4> Problembehebung: VeraCrypt reagiert nicht auf das Demounten/Mounten des Volumes. </h4> <p> Dieses Problem wird durch einen Konflikt zwischen dem VeraCrypt-Wartedialog, der während Mount-/Dismount-Operationen angezeigt wird, und anderer auf dem Computer installierter Software (z. </p> <p> 1. Von VeraCrypt&#39;s <strong> die Einstellungen </strong> Menü, wählen <strong> Einstellungen </strong> . </p> <p><img src=\"images/image_thumb-63-122.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Prüfen </strong> das <strong> Beim Ausführen von Vorgängen keinen Wartemeldungsdialog anzeigen </strong> Option klicken <strong> OK. </strong></p> <p><img src=\"images/image_thumb-64-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Fahren Sie nun mit dem Mounten/Dismounten von Volumes fort, ohne einzufrieren! </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}