{"title":"UPDATE: Doppelte Benutzernamen im Anmeldebildschirm nach dem Windows 10-Update.","content":"<p> Dieses Tutorial enthält mehrere Methoden, um das Problem mit doppelten Benutzernamen im Anmeldebildschirm nach der Aktualisierung von Windows 10 zu beheben. Das Problem &quot;doppelte Benutzernamen im Anmeldebildschirm&quot; wird von vielen Benutzern gemeldet und nach der Installation von Updates unter Windows 10 verursacht. </p> <p><img src=\"images/image_thumb-44-494.png\" alt=\"FIX: Duplicate User Names in Sign-in Screen Windows 10\" loading=\"lazy\"></p> <p> Problem im Detail: Nach dem Umbenennen Ihres Computers oder nach der Installation von Updates in Windows 10 meldet sich das System nicht automatisch in Ihrem Benutzerkonto mit der Fehlermeldung &quot;Benutzername oder Passwort ist falsch. Versuchen Sie es erneut&quot; und gleichzeitig wird Ihr Benutzername angezeigt zweimal im Anmeldebildschirm. </p> <h4> Problembehebung: Der Windows 10-Anmeldebildschirm zeigt zweimal denselben Benutzer an. </h4> <h6> Methode 1. Entfernen Sie das Duplicate Account aus den Benutzerkontooptionen. </h6> <p> Die erste Methode, um die doppelten Benutzernamen vom Anmeldebildschirm zu entfernen, besteht darin, das doppelte Konto von Ihrem PC zu löschen. </p> <p> 1. Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-923.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Geben Sie im Feld &quot;Öffnen&quot; Folgendes ein: <strong> Benutzerpasswörter kontrollieren2 </strong> &amp; klicken <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-29-663.png\" alt=\"control userpasswords2 \" loading=\"lazy\"></p> <p> 3. Führen Sie bei den Benutzerkontenoptionen die folgenden Aktionen entsprechend Ihrem Fall aus: </p> <ul> <li><strong> Fall A. </strong> Wenn Sie zwei Konten mit demselben Benutzernamen sehen: </li> </ul> <blockquote><p> ein. Wählen Sie das sekundäre Konto aus und klicken Sie auf <strong> Entfernen </strong> . <br> b. Klicken <strong> OK </strong> und <strong> neu starten </strong> dein PC. <br> c. Wenn Ihr Benutzername nach dem Neustart immer noch zweimal auf dem Anmeldebildschirm angezeigt wird, fahren Sie mit Methode 2 fort. </p></blockquote> <p><img src=\"images/image_thumb-37-605.png\" alt=\"User Accounts Options\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Fall B. </strong> Wenn nur ein Konto angezeigt wird: </li> </ul> <blockquote><p> ein. Wählen Sie das Konto aus und klicken Sie auf <strong> Eigenschaften </strong> . <br> b. Kopieren Sie den vollständigen Namen und fügen Sie ihn in das Feld Benutzername ein, um ihn abzugleichen. * <br> c. Klicken <strong> OK </strong> und <strong> neu starten </strong> dein PC. </p></blockquote> <p> * Hinweis: Wenn der Benutzername und der vollständige Name bereits übereinstimmen, fahren Sie mit Methode 2 fort. </p> <p><img src=\"images/image_thumb-38-262.png\" alt=\"Remove Duplicate User Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Methode 2. Deaktivieren Sie die Kennwortanforderung bei der Anmeldung. </h6> <p> 1. Befolgen Sie die Schritte 1 und 2 der vorherigen Methode, um die Optionen für „Benutzerkonten“ zu öffnen. <br> 2. <strong> Deaktivieren Sie </strong> das <strong> Der Benutzer muss einen Benutzernamen und ein Kennwort eingeben, um diesen Computer zu verwenden </strong> und klicke <strong> Anwenden </strong></p> <p><img src=\"images/image_thumb-42-373.png\" alt=\"User must enter a user name and password to use this computer \" loading=\"lazy\"></p> <p> </p> <p> 3. Geben Sie Ihr Passwort ein (zweimal) und klicken Sie auf <strong> OK </strong> zweimal, um alle Fenster zu schließen. </p> <p><img src=\"images/image_thumb-43-970.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. <strong> Neustart </strong> dein Computer. Wenn Ihr Benutzername erneut zweimal erscheint, fahren Sie mit der nächsten Methode fort. </p> <h6></h6> <h6> Methode 3. Ändern Sie die Anmeldeoptionen. </h6> <p> </p> <p> 1. Von Anfang an <img src=\"images/image_thumb-39-183.png\" alt=\"image\" loading=\"lazy\"> Menü, öffnen <strong> die Einstellungen </strong> <img src=\"images/image_thumb-50-520.png\" alt=\"image\" loading=\"lazy\"> und dann klick <strong> Konten </strong> . </p> <p><img src=\"images/image_thumb-43-892.png\" alt=\"How to Add a New User in Windows 10, 8.1.\" loading=\"lazy\"></p> <p> </p> <p> 2. Wählen Sie <strong> Anmeldeoptionen </strong> im linken Bereich und <strong> ausschalten </strong> das <strong> Verwenden Sie meine Anmeldeinformationen, um die Einrichtung meines Geräts automatisch abzuschließen und meine Apps nach dem Update oder Neustart erneut zu öffnen </strong> . </p> <p><img src=\"images/image_thumb-40-207.png\" alt=\"Modify Sign in Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Neu starten </strong> dein PC. </p> <p> </p> <h6> Methode 4. Wechseln Sie zu lokalem Konto. </h6> <p> Die letzte Methode zum Beheben des Problems &quot;doppelte Benutzernamen&quot; besteht darin, sich mit einem lokalen Konto in Windows 10 anzumelden. </p> <p> 1. Von Anfang an <img src=\"images/image_thumb-41-454.png\" alt=\"image\" loading=\"lazy\"> Menü, öffnen <strong> die Einstellungen </strong> <img src=\"images/image_thumb-50-790.png\" alt=\"image\" loading=\"lazy\"> und dann klick <strong> Konten </strong> . <br> 2. Klicken Sie auf <strong> E-Mail und Konten </strong> im linken Bereich. <br> 3. Weiter klicken <strong> Melden Sie sich stattdessen mit einem lokalen Konto an. </strong></p> <p> </p> <p><img src=\"images/image_thumb-37-653.png\" alt=\"sign-in with a local account instead windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Geben Sie Ihr Microsoft-Kontokennwort ein und klicken Sie auf <strong> Nächster </strong> . <br> 5. Geben Sie dann den Benutzernamen und das Passwort (optional) für das neue lokale Konto ein und klicken Sie auf <strong> Nächster </strong> . <br> 6. Geben Sie nach dem Neustart Ihr Kennwort ein, um sich mit dem neuen lokalen Konto anzumelden. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}