{"title":"UPDATE: Kamera-App-Fehler 0xA00F424F (0x8004005) in Windows 10. (Gelöst)","content":"<p> Der Kamera-App-Fehler 0xA00F424F in Windows 10 beim Versuch, Fotos oder Videos aufzunehmen, bedeutet, dass die Kamera-App die Fotos oder Videodateien nicht am angegebenen Speicherort auf Ihrem Computer speichern kann. Der Fehler 0xA00F424F (0x8004005) kann aus vielen Gründen auftreten. Befolgen Sie daher die folgenden Methoden, um ihn zu beheben. </p> <p><img src=\"images/image_thumb-9-592.png\" alt=\"FIX: Camera App Error 0xA00F424F in Windows 10\" loading=\"lazy\"></p> <p> Dieses Tutorial enthält Schritt-für-Schritt-Anleitungen zur Behebung des Fehlers &quot;Etwas ist schief gelaufen. Leider konnten wir keine Fotos speichern&quot; mit Fehler: &quot;0xA00F424F (0x80004005)&quot; oder &quot;PhotoCaptureFileCreationFailed (0x80131500)&quot; </p> <h4> So beheben Sie: Kamera-App – Speicherfehler 0xA00F424F (0x8004005) in Windows 10. </h4> <h6> Methode 1. Erlauben Sie der Kamera-App, auf die Kamera zuzugreifen. </h6> <p> Die erste Methode zum Beheben des Kamerafehlers 0xA00F424F besteht darin, sicherzustellen, dass die Kamera-App Zugriff auf Ihre Kamera hat. Das zu tun: </p> <p> 1. Navigieren Sie zu <strong> die Einstellungen </strong> &gt; <strong> Privatsphäre. <br> </strong> 2. Wählen Sie die <strong> Kamera </strong> app im linken Bereich und im rechten Bereich nehmen Sie die folgenden Einstellungen vor: </p> <p> ein. Schalten Sie die <strong> Apps den Zugriff auf deine Kamera erlauben </strong> wechseln zu <strong> AUF </strong> . <br> b. Scrollen Sie nach unten und unter die <strong> &quot;Wählen Sie aus, welche Microsoft Store-Apps auf Ihre Kamera zugreifen können&quot; </strong> Abschnitt, schalten Sie die <strong> Kamera </strong> Wechsel der App zu <strong> AUF </strong> . * </p> <p><img src=\"images/image_thumb-4-435.png\" alt=\"Allow apps to access your camera in Windows 10\" loading=\"lazy\"></p> <h6> Methode 2. Setzen Sie die Kamera-App-Einstellungen zurück. </h6> <p> 1. Navigieren Sie zu <strong> die Einstellungen </strong> &gt; <strong> Apps </strong> . <br> 2. Wählen Sie in der Liste &quot;Apps &amp; Funktionen&quot; die Kamera-App und klicken Sie dann auf <strong> Erweiterte Optionen </strong> . </p> <p><img src=\"images/image_thumb-5-262.png\" alt=\"Reset Camera App Settings - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Scrollen Sie nach unten und klicken Sie auf <strong> Zurücksetzen. </strong></p> <p><img src=\"images/image_thumb-6-318.png\" alt=\"Reset app settings Windows 10\" loading=\"lazy\"></p> <h6></h6> <h6> Methode 3. Löschen Sie den Ordner &quot;Kamerarolle&quot; und erstellen Sie ihn neu. </h6> <p> Die nächste Methode zum Beheben des Fehlercodes 0xA00F424F (0x80004005) in der Kamera-App besteht darin, sicherzustellen, dass der Ordner „Kamerarolle“ (C:\\Benutzer\\%Benutzername%\\Pictures\\Kamerarolle) der Standardspeicherort für die Fotos und Videos, existiert und hat die richtigen Berechtigungen zum Speichern von Fotos und Videos. Das zu tun: </p> <p> 1. Öffnen Sie den Windows Explorer und geben Sie in die Adressleiste die folgende Adresse ein und drücken Sie <strong> Eingeben </strong> : </p> <ul> <li> %APPDATA%\\Microsoft\\Windows\\Libraries\\Pictures </li> </ul> <p><img src=\"images/image_thumb-10-952.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Öffnen Sie den Ordner „Camera Roll“* und stellen Sie sicher, dass er keine Dateien enthält. (Andernfalls verschieben Sie alle Dateien an einen anderen Speicherort auf Ihrer Festplatte.) </p> <p> * Hinweis: Wenn der Ordner Camera Roll nicht vorhanden ist, fahren Sie mit Schritt 4 fort. </p> <p> 3. Nun, <strong> löschen </strong> das <strong> Filmrolle </strong> Mappe. </p> <p><img src=\"images/image_thumb-11-440.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Erstellen Sie abschließend einen neuen Ordner und benennen Sie ihn &quot; <strong> Filmrolle </strong> &quot; <br> 5. Wenn Sie fertig sind, öffnen Sie die Kamera-App und versuchen Sie, ein Bild oder ein Video aufzunehmen, um zu sehen, ob das Problem behoben ist. </p> <p> </p> <h6> Methode 4. Fügen Sie der Bilderbibliothek den Ordner Camera Roll hinzu. </h6> <p> Die letzte Methode zum Beheben des Kamera-App-Fehlers 0xA00F424F besteht darin, einen anderen Speicherort für die Fotos/Videos anzugeben. Das zu tun: </p> <p> 1. Öffnen Sie den Windows Explorer und geben Sie in die Adressleiste die folgende Adresse ein und drücken Sie <strong> Eingeben </strong> : </p> <ul> <li> %APPDATA%\\Microsoft\\Windows\\Bibliotheken </li> </ul> <p> 2. Klicken Sie mit der rechten Maustaste auf das <strong> Filmrolle </strong> Ordner und wählen Sie <strong> Eigenschaften </strong> . </p> <p><img src=\"images/image_thumb-8-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Führen Sie nun einen der folgenden Schritte aus: </p> <p> ein. Wenn die &quot;Kamerarolle&quot; nicht unter &quot;Bibliotheken-Speicherort&quot; aufgeführt ist, klicken Sie auf das <strong> Hinzufügen </strong> Taste, öffnen Sie die <strong> Bilder </strong> Ordner und wählen Sie dann die <strong> Filmrolle </strong> Ordner als Standardspeicherort für die Fotos und Videos. </p> <p> b. Wenn der Ordner „Camera Roll“ unter „Libraries location“ aufgelistet ist, klicken <strong> Hinzufügen </strong> und geben Sie einen neuen Speicherordner für die Kamera-App an. Wenn Sie fertig sind, klicken Sie auf <strong> Speicherort festlegen </strong> und klicke <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-12-180.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Öffnen Sie schließlich die Kamera-App und versuchen Sie, ein Foto oder Video aufzunehmen. </p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}