{"title":"UPDATE: Die Option VMware Tools installieren ist ausgegraut. (Gelöst)","content":"<p> Wenn Sie die VMware Tools nicht auf dem Gastbetriebssystem installieren können, weil die Option &quot;VMware Tools installieren&quot; ausgegraut ist, lesen Sie weiter unten. Die VMware Tools sind ein kostenloser Satz von Diensten und Modulen, die verschiedene Funktionen in der virtuellen Gastmaschine ermöglichen, wie schnellere Grafikleistung, verbesserte Mausleistung und das Wichtigste: die Möglichkeit zum Kopieren und Einfügen zwischen dem Host und der Gastmaschine. Obwohl das Gastbetriebssystem also ohne die VMware Tools ausgeführt werden kann, müssen die VMware Tools installiert werden, wenn Sie die zusätzlichen VMware-Funktionen aktivieren möchten. </p> <p> Die übliche Methode zur Installation der VMware Tools besteht darin, den Gastcomputer zu starten und dann aus dem Menü &quot;Player&quot; auszuwählen <strong> Verwalten </strong> &gt; <strong> VMware Tools installieren </strong> . Wenn Sie jedoch bei der Installation des Betriebssystems das virtuelle CD/DVD-Laufwerk der virtuellen Maschine mit einer ISO-Image-Datei verbunden haben, ist die Option &quot;VMware Tools installieren&quot; ausgegraut. </p> <p><img src=\"images/image_thumb-45-164.png\" alt=\"FIX VMware Tools option is Grayed Out\" loading=\"lazy\"></p> <p> </p> <p> Dieses Tutorial enthält Anweisungen zum Beheben des folgenden Problems in VMware Workstation Player. Die Option &quot;VMware Tools installieren&quot; ist auf dem Gastcomputer ausgegraut. </p> <h4> So installieren Sie VMware Tools, wenn die Option „VMware Tools installieren“ ausgegraut ist. </h4> <p> </p> <p> 1. Fahren Sie die virtuelle Maschine herunter. <br> 2. Klicken Sie mit der rechten Maustaste auf die virtuelle Maschine und wählen Sie <strong> die Einstellungen </strong> . </p> <p><img src=\"images/image_thumb-39-377.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Wählen Sie die <strong> CD/DVD </strong> fahren und dann klicken <strong> Entfernen </strong> . </p> <p><img src=\"images/image_thumb-43-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Wählen Sie dann die <strong> Diskette </strong> fahren, klicken <strong> Entfernen </strong> und dann klick <strong> OK </strong> um die Einstellungsoptionen zu schließen. </p> <p><img src=\"images/image_thumb-44-469.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Start </strong> die virtuelle Maschine. <br> 6. Wählen Sie im Menü „Player“ die Option <strong> Verwalten </strong> und klicke <strong> Installieren Sie VMware-Tools. </strong></p> <p><img src=\"images/image_thumb-42-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> Das ist alles! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}