{"title":"UPDATE: Schnellzugriff funktioniert nicht und kann nicht in das Suchfeld in Windows 10 eingeben (Gelöst)","content":"<p> Wenn <strong> Schnellzugriff </strong> s-Menü in Windows 10 nicht funktioniert, dann lesen Sie dieses Tutorial, um das Problem zu beheben. Die Schnellzugriffsoption im Datei-Explorer ermöglicht es dem Benutzer, einfach zu den zuletzt geöffneten Dateien und Ordnern zu navigieren. Aber manchmal, insbesondere wenn Sie zuvor eine Datei / einen Ordner von einem externen Laufwerk (z. </p> <p><img src=\"images/image_thumb-2-490.png\" alt=\"FIX: Quick Access Not Working in Windows 10 (Solved)\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> So beheben Sie: Schnellzugriffsfunktion und Suchfunktion funktionieren nicht in Windows 10. </h4> <p> </p> <h6> Methode 1. Starten Sie Windows-Explorer neu. </h6> <p> Die erste Methode, um das Problem mit dem Schnellzugriff zu beheben, besteht darin, den Windows Explorer-Prozess über den Task-Manager neu zu starten. Das zu tun: </p> <p> 1. Drücken Sie <strong> Strg </strong> + <strong> Alt </strong> + <strong> Del </strong> öffnen <strong> Taskmanager </strong> . <br> 2. At <strong> Prozesse </strong> * Registerkarte, markieren Sie die <strong> Windows Explorer </strong> verarbeiten und klicken <strong> Neu starten </strong> . </p> <p> * Hinweis: Wenn die Registerkarte &quot;Prozess&quot; nicht angezeigt wird, klicken Sie auf <strong> Mehr Details. </strong></p> <p><img src=\"images/image_thumb-951.png\" alt=\"restart windows explorer\" loading=\"lazy\"></p> <p><strong> </strong></p> <h6> Methode 2. Aktivieren Sie den Schnellzugriff auf Letzte Elemente und löschen Sie den Datei-Explorer-Verlauf. </h6> <p> 1. Öffnen <strong> Ordneroptionen. </strong> Öffnen Sie dazu den Windows Explorer und gehen Sie im Menü zu <strong> Aussicht </strong> &gt; <strong> Optionen </strong> . </p> <p><img src=\"images/image_thumb-3-949.png\" alt=\"enable quick access windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. In <strong> Allgemeines </strong> stellen Sie sicher, dass die folgenden Kontrollkästchen aktiviert sind. </p> <ul> <li><strong> Zuletzt verwendete Dateien im Schnellzugriff anzeigen </strong></li> <li><strong> Zeigen Sie häufig verwendete Ordner im Schnellzugriff an. </strong></li> </ul> <p> 3. Klicken Sie dann auf <strong> klar </strong> Schaltfläche, um den Verlauf des Datei-Explorers zu löschen. </p> <p><img src=\"images/image_thumb-4-329.png\" alt=\"clear quick access history\" loading=\"lazy\"></p> <p> </p> <p> 3. Klicken Sie auf <strong> OK </strong> und prüfen Sie, ob der Schnellzugriff und die Suchfunktion funktionieren. Wenn nicht, starten Sie den &#39;Datei-Explorer&#39; neu, indem Sie den Task-Manager verwenden (siehe Methode-1 oben) und überprüfen Sie es erneut. Wenn das Problem weiterhin besteht, fahren Sie mit der nächsten Methode fort. </p> <h6> Methode 3. Löschen Sie den Verlauf der letzten Elemente manuell. </h6> <p> Die nächste Methode zum Beheben von Problemen mit dem Schnellzugriff auf zuletzt verwendete Elemente oder mit der Funktion &quot;Suchen&quot; in Windows 10 besteht darin, den Verlauf der letzten Elemente manuell zu löschen. Das zu tun: </p> <p> 1. Öffnen Sie den Windows-Explorer. <br> 2. Kopieren Sie die folgende Adresse und fügen Sie sie in die Adressleiste ein und drücken Sie <strong> Eingeben </strong> : </p> <p> %AppData%\\Microsoft\\Windows\\Recent\\AutomaticDestinations </p> <p><img src=\"images/image_thumb-1-410.png\" alt=\"clear recent items windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3.  Drücken Sie <strong> Strg </strong> + <strong> EIN </strong> (um alle Elemente auszuwählen) und drücken Sie <strong> Löschen </strong> (oder Rechtsklick &gt; <strong> Löschen </strong> ). </p> <p><img src=\"images/image_thumb-5-834.png\" alt=\"Delete Quick Access History\" loading=\"lazy\"></p> <p> </p> <p> 4. Dann kopieren / fügen Sie die folgende Adresse in die Adressleiste ein und drücken Sie <strong> Eingeben </strong> . </p> <p> %AppData%\\Microsoft\\Windows\\Recent\\CustomDestinations </p> <p><img src=\"images/image_thumb-6-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Drücken Sie <strong> Strg </strong> + <strong> EIN </strong> erneut (um alle Elemente auszuwählen) und drücken Sie <strong> Löschen. <br> </strong> 6. Drücken Sie nun <strong> Strg + Alt + Entf </strong> öffnen <strong> Taskmanager </strong> . <br> 7. At <strong> Prozesse </strong> markieren Sie die Registerkarte <strong> Windows Explorer </strong> verarbeiten und klicken <strong> Neu starten </strong> . <br> 8. Normalerweise müssen die Probleme mit der Funktion „Schnellzugriff“ oder mit der Funktion „Suchen“ behoben sein. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}