{"title":"UPDATE: Chrome öffnet immer die Optionen zum Durchsuchen als Gast – Person wechseln beim Start.","content":"<p> Das Tutorial enthält Anweisungen, wie Sie verhindern können, dass Chrome beim Start das Fenster &quot;Person wechseln – Als Gast durchsuchen&quot; anzeigt. Problem im Detail: Auf einem Windows-basierten Computer öffnet der Google Chrome-Browser beim Start immer die Optionen &quot;Browse as Guest&quot; und &quot;Add Person&quot; und der Benutzer muss immer sein Profil auswählen, um den Chrome-Browser zu verwenden. </p> <p><img src=\"images/image_thumb-26-805.png\" alt=\"FIX Remove Chrome Browse as Guest\" loading=\"lazy\"></p> <p> </p> <h4> So entfernen Sie das Optionsfenster &quot;Browser als Gast – Person hinzufügen&quot; beim Chrome-Start. </h4> <h6> Methode 1. Überprüfen Sie, ob Chrome so eingestellt ist, dass er immer im Gastbrowsermodus startet. </h6> <p> Eine der nützlichsten Funktionen des Google Chrome-Browsers besteht darin, mehrere Benutzerprofile zu erstellen, insbesondere wenn Sie Ihren Computer mit anderen teilen oder Ihre Lesezeichen und Einstellungen zwischen Ihren mehreren Konten trennen möchten. In diesem Fall können Sie Chrome immer mit dem Fenster &quot;Person wechseln&quot; starten, indem Sie einen der folgenden Schalter (Texteinträge) in die Chrome-Verknüpfung einfügen: </p> <ul> <li><strong> –profile-directory=&quot;Gastprofil&quot; </strong></li> <li><strong> –bwsi </strong></li> </ul> <p> </p> <p> Überprüfen Sie also zunächst, ob Chrome so eingestellt ist, dass das Fenster &quot;Person wechseln/als Gast durchsuchen&quot; immer geöffnet wird. Das zu tun: </p> <p> 1. Schließen Sie Google Chrome. <br> 2. Klicken Sie mit der rechten Maustaste auf Chrome Shortcut auf Ihrem Desktop und wählen Sie <strong> Eigenschaften </strong> . <br> 3. At <strong> Abkürzung </strong> Registerkarte, sehen Sie sich die <strong> Ziel </strong> Textfeld und (falls vorhanden) <strong> entfernen </strong> die obigen Texteinträge am Ende und dann klick <strong> OK </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-27-916.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Starten Sie Chrome und klicken Sie im Fenster &quot;Person wechseln&quot; auf Ihr Profilsymbol/Bild (&quot;Sie&quot;). <br> 5. <strong> Neu starten </strong> Chrom. </p> <p> </p> <h6> Methode 2. Erstellen Sie ein neues sauberes Google Chrome-Profil. </h6> <p> Standardmäßig speichert Chrome alle Profileinstellungen (Lesezeichen, Passwörter, Erweiterungen usw.) im Ordner &quot;Benutzerdaten&quot; an folgendem Speicherort auf Ihrem Computer: </p> <ul> <li><strong> C:\\Benutzer\\%Benutzername%\\AppData\\Local\\Google\\Chrome\\Benutzerdaten </strong></li> </ul> <p> Wenn der Chrome-Profilordner aus irgendeinem Grund durch Malware beschädigt oder unsachgemäß modifiziert wird, besteht die beste Option darin, Chrome zu zwingen, einen neuen (leeren*) Chrome-Profilordner neu zu erstellen. Das zu tun: </p> <p><strong> * Beachtung: </strong> Denken Sie daran, dass Sie durch das Löschen Ihres Chrome-Profilspeicherordners alle gespeicherten Daten (Lesezeichen, Einstellungen, Erweiterungen, Verlauf usw.) löschen. Bevor Sie Ihr Chrome-Profil löschen, nehmen Sie eine <a href=\"https://www.repairwin.com/backup-restore-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> Sicherung Ihrer Chrome-Lesezeichen </a> falls Sie Chrome erneut installieren möchten. </p> <h5> Schritt 1: Aktivieren Sie die Ansicht Versteckte Dateien und Ordner. </h5> <p> 1. Öffnen <strong> Ordneroptionen </strong> . <br> 2. At <strong> Aussicht </strong> Tab, <strong> prüfen </strong> das <strong> Versteckte Dateien, Ordner und Laufwerke anzeigen </strong> Kontrollkästchen aktivieren und klicken <strong> OK. </strong></p> <p><img src=\"images/image_thumb-6-189.png\" alt=\"enable hidden files folders\" loading=\"lazy\"></p> <h6></h6> <h5> Schritt 2. Erzwingen Sie, dass Chrome einen neuen (sauberen) Profilordner erstellt. </h5> <p> 1. <strong> Schließen </strong> Google Chrome. <br> 2. <strong> Öffnen </strong> Windows Explorer und navigieren Sie zu diesem Speicherort: </p> <ul> <li><strong> C:\\Benutzer\\%USERNAME%\\AppData\\Local\\Google\\Chrome\\ </strong></li> </ul> <p> * Wobei %USERNAME% = Ihr Benutzername. (z.B. wenn Ihr Benutzername &quot;Admin&quot; ist, müssen Sie zu diesem Pfad navigieren: &quot;C:\\Users\\Admin\\AppData\\Local\\Google\\Chrome&quot;) </p> <p> 3. <strong> Umbenennen </strong> den Ordner &quot;Benutzerdaten&quot; in &quot;Benutzerdaten.BAK&quot;. </p> <p><img src=\"images/image_thumb-28-373.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Öffnen Sie nun Google Chrome. (Während des Startvorgangs erstellt Chrome automatisch einen neuen, sauberen Ordner &quot;Benutzerdaten&quot;, um Ihre Lesezeichen und Einstellungen zu speichern). </p> <p> </p> <h6> Zusätzliche Methoden zum Beheben von Chrome-Problemen. </h6> <p><strong> 1. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Überprüfen Sie Ihren Computer auf Viren, Malware usw. </a></p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Chrome vollständig deinstallieren und neu installieren. </a></p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}