{"title":"UPDATE: App wurde zu Ihrem Schutz in Windows 10 blockiert. (Gelöst)","content":"<p> Dieses Tutorial enthält mehrere Methoden zum Beheben des folgenden Fehlers, wenn Sie versuchen, eine Anwendung oder einen Gerätetreiber unter Windows 10 zu installieren: „Diese App wurde zu Ihrem Schutz blockiert. Ein Administrator hat Sie daran gehindert, diese App auszuführen.“ </p> <p><img src=\"images/image_thumb-32-967.png\" alt=\"FIX App Has Been Blocked for your Protection - Windows 10.\" loading=\"lazy\"></p> <p> </p> <h4> So beheben Sie: Ein Programm oder Treiber kann nicht installiert werden, da &quot;App zu Ihrem Schutz blockiert ist&quot;. * </h4> <p><strong> * Wichtig: </strong> Bevor Sie unten fortfahren, um das Problem &quot;App wurde zu Ihrem Schutz blockiert&quot; zu beheben, stellen Sie sicher, dass das blockierte Programm vertrauenswürdig ist. </p> <p> </p> <h6> Methode 1. Führen Sie das blockierte Programm als Administrator aus. </h6> <p> 1. Klicken Sie mit der rechten Maustaste auf die blockierte App und wählen Sie <strong> Als Administrator ausführen </strong> . </p> <p><img src=\"images/image_thumb-36-771.png\" alt=\"App is Blocked for your Protection in Windows 10.\" loading=\"lazy\"></p> <p> </p> <h6> Methode 2. Installieren Sie das blockierte Programm über die Admin-Eingabeaufforderung. </h6> <p> Die nächste Methode, um das Problem &quot;App wurde zu Ihrem Schutz blockiert&quot; zu umgehen, besteht darin, die blockierte App oder den blockierten Treiber über eine Eingabeaufforderung mit erhöhten Rechten zu installieren. </p> <p> 1. Navigieren Sie zum Speicherort des Programms auf der Festplatte. <br> 2. Drücken Sie dann Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 3. Markieren Sie die Anwendung, die Sie ausführen möchten, und ziehen Sie sie in das Feld „Ausführen“. </p> <p><img src=\"images/image_thumb-33-320.png\" alt=\"Run App in Command Prompt Admin\" loading=\"lazy\"></p> <p> </p> <p> 4. Markieren Sie nun den Pfad der Anwendung im Feld &#39;Ausführen&#39; und drücken Sie <strong> Strg </strong> + <strong> C </strong> um den Pfad in Ihre Zwischenablage zu kopieren. </p> <p><img src=\"images/image_thumb-34-686.png\" alt=\"run blocked app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Jetzt öffnen <strong> Eingabeaufforderung als Administrator </strong> . Das zu tun: </p> <blockquote><p> 1. Geben Sie im Suchfeld Folgendes ein: <strong> Eingabeaufforderung </strong> oder <strong> cmd <br> </strong> 2. Klicken Sie mit der rechten Maustaste auf <strong> Eingabeaufforderung </strong> Ergebnis und auswählen <strong> Als Administrator ausführen. </strong></p></blockquote> <p><img src=\"images/image_thumb-10-455.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 6. Drücken Sie in der Eingabeaufforderung <strong> STRG </strong> + <strong> V </strong> einfügen und drücken <strong> Eingeben </strong> , um die Anwendung auszuführen. </p> <p><img src=\"images/image_thumb-35-282.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Methode 3. Führen Sie das blockierte Programm von dem Administratorkonto aus. </h6> <p> Die nächste Methode, um ein blockiertes Programm auszuführen, besteht darin, es über das Administratorkonto auszuführen. Das zu tun: </p> <p> 1. Öffnen <strong> Eingabeaufforderung </strong> wie <strong> Administrator. </strong><br> 2. Geben Sie den folgenden Befehl ein und drücken Sie die Eingabetaste: </p> <ul> <li><strong> Netzbenutzeradministrator /aktiv:ja </strong></li> </ul> <p><img src=\"images/image_thumb-27-315.png\" alt=\"enable administrator account windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Neu starten </strong> der Computer und <strong> Anmeldung </strong> wie <strong> Administrator. <br> </strong> 4. Installieren Sie das blockierte Programm. <br> 5. Wenn die Installation erfolgreich ist, melden Sie sich bei Ihrem normalen Konto an und deaktivieren Sie das Administratorkonto mit diesem Befehl (in der Eingabeaufforderung mit erhöhten Rechten): </p> <ul> <li> Netzbenutzeradministrator /active:no </li> </ul> <p> </p> <h6> Methode 4. Ändern Sie die Eigenschaften von Kryptografiediensten. </h6> <p> 1. Öffnen Sie die Systemsteuerung der Windows-Dienste: Um das zu tun: </p> <ul> <li> Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-948.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. </li> <li> Geben Sie in das Suchfeld Folgendes ein: <strong><em> dienste.msc </em></strong> &amp; klicken <strong> OK </strong> . </li> </ul> <p><img src=\"images/image_thumb-12-894.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. Doppelklicken Sie im rechten Bereich, um die Eigenschaften des &quot; <strong> Kryptografische Dienste </strong> &quot;. <br> 3. At <strong> Einloggen </strong> Registerkarte, ändern Sie das Konto zu <strong> Netzwerkdienst </strong> ,* lösche die Passwortfelder und klicke auf <strong> OK </strong> zweimal. </p> <p> * Hinweis: Wenn es bereits &quot;Netzwerkdienst&quot; ist, fahren Sie mit der nächsten Methode fort, </p> <p><img src=\"images/image_thumb-28-592.png\" alt=\"fix app has been blocked in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Neu starten </strong> das <strong> Kryptografische Dienste </strong> (oder starten Sie Ihren PC neu) und versuchen Sie, die blockierte Anwendung auszuführen. </p> <p> </p> <h6> Methode 5. Deaktivieren Sie das UAC-Steuerelement. </h6> <p> Wenn Sie mit der Bearbeitung von Registrierungen vertraut sind, führen Sie die folgenden Schritte aus, um UAC zu deaktivieren: </p> <p> </p> <p> 1. Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-955.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Geben Sie im Feld &quot;Öffnen&quot; Folgendes ein: <strong> regedit </strong> &amp; klicken <strong> OK </strong> . </p> <p><img src=\"images/image_thumb7-384.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Navigieren Sie im linken Bereich zu dieser Taste: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System </li> </ul> <p> 4. Öffne rechts das <strong> LUA aktivieren </strong> Wert. <br> 5. Ändern Sie die Wertdaten von 1 auf <strong> 0</strong> und klicke <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-29-605.png\" alt=\"disable UAC registry windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Schließen Sie den Registrierungseditor und <strong> neu starten </strong> dein PC. <br> 7. Führen Sie nach dem Neustart die blockierte ausführbare Datei aus. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}