{"title":"UPDATE: Windows 10 läuft nach der Installation von v2004 oder Edge Chromιum extrem langsam (Gelöst)","content":"<p> Viele Benutzer haben berichtet, dass ihr PC nach der Installation des Windows 10 2004-Updates oder nach der Installation der neuen Chromium-basierten Version des Microsoft Edge-Browsers extrem langsam läuft. Wenn eines der oben genannten Probleme auftritt, befolgen Sie die Anweisungen in diesem Artikel, um sie zu beheben. </p> <p> Problem im Detail: Nach dem Upgrade von Windows 10 auf Version 2004 oder nach der Installation des <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> Update, das automatisch den neuen Edge-Browser (Chromium-Version) installiert, dauert das Windows beim Booten lange oder läuft sehr langsam. </p> <h4> So beheben Sie: Probleme mit langsamem Start und langsamer Leistung in Windows 10 2004. </h4> <h6> Methode 1. Installieren Sie verfügbare Windows-Updates und aktualisieren Sie Gerätetreiber. </h6> <p> Die erste Methode zum Beheben der langsamen Leistungsprobleme in Windows 10 besteht darin, die folgenden Schritte auszuführen: </p> <ul> <li><strong> Schritt 1. </strong> Laden Sie alle verfügbaren Windows-Updates herunter und installieren Sie sie. </li> <li><strong> Schritt 2. </strong> Laden Sie die neuesten Windows 10-Treiber für den Display-Adapter herunter und installieren Sie sie. </li> <li><strong> Schritt 3. </strong> Wenn Sie ein Antivirenprogramm eines Drittanbieters verwenden, deinstallieren Sie es und prüfen Sie, ob das Problem mit der langsamen Leistung weiterhin besteht. Wenn nicht, installieren Sie die neueste Version des AV-Programms. </li> </ul> <p> </p> <h6> Methode 2. Deinstallieren Sie die Microsoft Edge Chromium-Version. </h6> <p> Die zweite Methode, um die langsamen Leistungsprobleme in Windows 10 zu beheben, besteht darin, die Microsoft Edge Chromium-Version zu deinstallieren (sofern installiert). </p> <h5> Schritt 1. Überprüfen Sie, ob die neue Chromium-basierte Version von Microsoft Edge installiert ist. </h5> <p> 1. Aus dem Startmenü <img src=\"images/image_thumb2_thumb_thumb-381.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> klicken <strong> die Einstellungen </strong><img src=\"images/image_thumb-66-515.png\" alt=\"image\" loading=\"lazy\"> und klicke <strong> Apps. <br> </strong> 2. Wenn die <strong> Apps &amp; Funktionen </strong> Suchen Sie die Microsoft Edge-App und gehen Sie entsprechend ihrem Symbol wie folgt vor: </p> <ul> <li> Wenn Sie dieses Symbolbild sehen <img src=\"images/image_thumb-32-976.png\" alt=\"image\" loading=\"lazy\"> , bedeutet dies, dass die neue Version von Microsoft Edge basierend auf Chromium bereits auf Ihrem Computer installiert ist. Gehen Sie in diesem Fall zu <strong> <a href=\"#step-2\" target=\"_blank\" rel=\"nofollow noopener\"> Schritt 2 </a></strong> um Edge Chromium von Ihrem PC zu deinstallieren. </li> <li> Wenn Sie dieses Symbolbild sehen <img src=\"images/image_thumb-33-372.png\" alt=\"image\" loading=\"lazy\"> , bedeutet dies, dass die neue Chromium-basierte Version noch nicht auf Ihrem Computer installiert ist. Fahren Sie in diesem Fall mit . fort <a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Methode-3 </strong></a> . </li> </ul> <p><img src=\"images/image_thumb-71-268.png\" alt=\"FIX: Windows 10 Running Extremely Slow after 2004 Update\" loading=\"lazy\"></p> <p> </p> <h5> Schritt 2. Entfernen Sie Edge Chromium vom PC. </h5> <p> So deinstallieren Sie den neuen Chromium-basierten Edge in Windows 10: </p> <p> 1. Navigieren Sie auf Ihrem PC zu folgendem Ordner: * </p> <ul> <li> C:\\Programme (x86)\\Microsoft\\Edge\\Application\\85.0.564.41\\Installer </li> </ul> <p> * Hinweis: Der Ordnername &quot;85.0.564.41&quot; gibt die installierte Version der neuen Chromium-Version an und kann an Ihrem PC abweichen. </p> <p> 2. Wählen Sie den Ordnerpfad in der Adressleiste aus und klicken Sie mit der rechten Maustaste &gt; <strong> Kopieren. </strong></p> <p><img src=\"images/image_thumb-35-379.png\" alt=\"Uninstall Edge Chromiun\" loading=\"lazy\"></p> <p> </p> <p> 3. Öffnen <strong> Eingabeaufforderung als Administrator, </strong> Art <strong> CD </strong> und drücke dann <strong> STRG+V </strong> zum Einfügen in den kopierten Ordnerpfad. Wenn Sie fertig sind, drücken Sie <strong> Eingeben </strong> . * </p> <p> * Bsp.: Im aktuellen Beispiel lautet der Befehl: </p> <p><em> cd C:\\Programme (x86)\\Microsoft\\Edge\\Application\\85.0.564.41\\Installer </em></p> <p><img src=\"images/image_thumb-36-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Geben Sie nun den folgenden Befehl (Kopieren/Einfügen) in der Eingabeaufforderung ein, um die Chromium-Version des Microsoft Edge-Browsers von Ihrem PC zu entfernen. </p> <ul> <li> setup.exe –uninstall –Systemebene –verbose-logging –force-uninstall </li> </ul> <p><img src=\"images/image_thumb-37-229.png\" alt=\"Remove Edge Chromiun\" loading=\"lazy\"></p> <p> 5. Sobald der obige Befehl ausgeführt wurde, wird die alte Version von EDGE wieder aktiviert. Starten Sie Ihren PC neu, um die Änderungen zu übernehmen. <br> 6. Fahren Sie nach dem Neustart mit der manuellen Installation fort <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> neuer Chromium-basierter Edge-Browser </a> auf Ihrem PC, um eine erneute Installation des problematischen Updates KB4559309 zu vermeiden. </p> <p> </p> <h6> Methode 3. Stellen Sie Windows 10 auf die vorherige Version wieder her. </h6> <p> 1. Von der <strong> Start </strong> Speisekarte <img src=\"images/image_thumb2_thumb_thumb-872.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> öffnen <strong> die Einstellungen </strong> <img src=\"images/image_thumb-66-969.png\" alt=\"image\" loading=\"lazy\"> und dann klick <strong> Aktualisierung &amp; Sicherheit. </strong></p> <p> 2. Wählen Sie <strong> Wiederherstellung </strong> auf der linken Seite und klicken Sie dann im Abschnitt &quot;Zurück zur vorherigen Version von Windows 10&quot; auf das <strong> Loslegen </strong> Taste. </p> <p><img src=\"images/image_thumb-4-708.png\" alt=\"Restore Windows to earlier version\" loading=\"lazy\"></p> <p> 3. Befolgen Sie die Anweisungen auf dem Bildschirm, um Windows 10 auf die vorherige Version zurückzusetzen. <br> 4. Nachdem Sie zur vorherigen Version von Windows 10 zurückkehren, sollte Ihr Computer wieder normal und ohne Verzögerungen laufen. </p> <p> </p> <h6> Methode 4. Reparieren Sie Windows 10. </h6> <p> Die nächste Methode zum Beheben der langsamen Leistungsprobleme in Windows 10 besteht darin, Windows mithilfe der SFC- und DISM-Befehle zu reparieren: </p> <p> 1. Öffnen <strong> Eingabeaufforderung als Administrator </strong> . <br> 2. Geben Sie in der Eingabeaufforderung den folgenden Befehl dism ein und drücken Sie <strong> Eingeben: </strong></p> <ul> <li><strong> DISM.exe /Online /Cleanup-Image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-175.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> </p> <p> 3. Wenn der DISM-Vorgang abgeschlossen ist, geben Sie den folgenden Befehl ein und drücken Sie <strong> Eingeben </strong> : </p> <ul> <li><strong> sfc /scannow </strong></li> </ul> <p><img src=\"images/image_thumb31-316.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Warten Sie nun, bis der System File Checker die Windows-Systemdateien repariert. <br> 5. Wenn dies erledigt ist, <strong> neu starten </strong> Ihren Computer und prüfen Sie, ob das Problem behoben ist. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}