{"title":"UPDATE: In diesem Windows-Modus werden nur verifizierte Apps aus dem Store unter Windows 10 ausgeführt.","content":"<p> Der Fehler &quot;Aus Sicherheits- und Leistungsgründen führt dieser Modus von Windows nur verifizierte Apps aus dem Store aus&quot; wird angezeigt, wenn Windows 10 im S-Modus ausgeführt wird oder aufgrund einer Einstellung auf Ihrem Computer, die die Installation von Apps und Software von Drittanbietern einschränkt . </p> <p><img src=\"images/image_thumb-19-156.png\" alt=\"FIX: For security and performance, this mode of Windows only runs verified apps from the Store in Windows 10.\" loading=\"lazy\"></p> <p> Dieses Tutorial enthält Anweisungen zum Beheben des Fehlers „Aus Sicherheits- und Leistungsgründen führt dieser Modus von Windows nur verifizierte Apps aus dem Store aus“, wenn versucht wird, eine Drittanbieteranwendung in Windows 10 zu installieren. </p> <h2> So erlauben Sie die Installation von Drittanbieteranwendungen in Windows 10. </h2> <h5> Schritt 1. Finden Sie die installierte Windows 10-Version heraus. </h5> <p> 1. Drücken Sie die Windows <img src=\"images/image_thumb8_thumb-1-482.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Geben Sie den folgenden Befehl ein und drücken Sie <strong> Eingeben: </strong></p> <ul> <li><strong> winver </strong></li> </ul> <p><img src=\"images/image_thumb-13-360.png\" alt=\"See Windows 10 Installed Version\" loading=\"lazy\"></p> <p> 3. Wenn Sie nun in der Windows Edition sehen, dass Sie Windows 10 Home oder Pro ausführen, befolgen Sie die Anweisungen in <a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Methode 1 </a> , andernfalls, wenn Sie haben <strong> Windows 10 Home S </strong> , befolgen Sie die Anweisungen in <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Methode-2 </a> . </p> <p><img src=\"images/image_thumb-14-709.png\" alt=\"See Installed Windows 10 Edition\" loading=\"lazy\"></p> <p><strong> </strong></p> <p><strong> </strong></p> <h3> Methode 1. Erlauben Sie Windows 10, Apps von überall zu installieren. </h3> <p> 1. Aus dem Startmenü <img src=\"images/image_thumb2_thumb_thumb-909.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> Klicken Sie auf Einstellungen <img src=\"images/image_thumb-66-797.png\" alt=\"image\" loading=\"lazy\"> und dann öffnen <strong> Apps </strong> . </p> <p><img src=\"images/image_thumb-15-604.png\" alt=\"Windows Settings - Apps\" loading=\"lazy\"></p> <p> </p> <p> 2. Wählen Sie unter Apps &amp; Funktionseinstellungen die Option zum Installieren von Apps aus <strong> Irgendwo </strong> . </p> <p><img src=\"images/image_thumb-16-670.png\" alt=\"Install Apps from Anywhere - Windows 10\" loading=\"lazy\"></p> <h3> Methode 2. Wechseln Sie aus dem Windows 10 S-Modus. </h3> <p> Windows 10 im S-Modus ist auf Sicherheit und Leistung ausgelegt und erlaubt aus diesem Grund keine Apps außerhalb des Microsoft Stores auszuführen. Um diese Einschränkung zu umgehen, müssen Sie den S-Modus beenden, was eine sehr einfache Möglichkeit ist. Beachten Sie jedoch, dass Sie nach dem Beenden des S-Modus nicht mehr zu Windows 10 im S-Modus zurückkehren können. </p> <p> So melden Sie sich vom Windows 10 S-Modus bei Windows 10 Home ab: </p> <p> 1. Aus dem Startmenü <img src=\"images/image_thumb2_thumb_thumb-829.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> Klicken Sie auf Einstellungen <img src=\"images/image_thumb-66-853.png\" alt=\"image\" loading=\"lazy\"> und dann öffnen <strong> Update und Sicherheit. </strong></p> <p> 2. Wählen Sie <strong> Aktivierung </strong> links und dann klick <a href=\"//switchwindows\" target=\"_blank\" rel=\"nofollow noopener\"> Zum Laden gehen </a><strong> . </strong></p> <p><img src=\"images/image_thumb-17-920.png\" alt=\"Switch Out S Mode Windows 10\" loading=\"lazy\"></p> <p> 3. Klicken Sie auf der Seite S-Modus wechseln auf <strong> Erhalten </strong> und dann klick <strong> Installieren. </strong> * <br> 4. Endlich klick <strong> Ja, lass uns gehen </strong> um aus dem S-Modus zu wechseln. </p> <p> * Hinweis: Wenn Sie nach dem Klicken auf die Schaltfläche &quot;Installieren&quot; die Fehlermeldung &quot;Etwas ist passiert und wir konnten das Upgrade nicht starten&quot; erhalten, fahren Sie fort und <strong> Installieren Sie alle verfügbaren Windows 10-Updates </strong> , <strong> Starten Sie Ihren PC neu </strong> und versuche es erneut. </p> <p><img src=\"images/image_thumb-18-502.png\" alt=\"Switch Out S Mode\" loading=\"lazy\"></p> <p> </p> <p> 4. Wenn die Installation abgeschlossen ist, werden Sie darüber informiert, dass Sie Apps von außerhalb des Microsoft Store installieren können. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}