{"title":"UPDATE: Outlook Add-In ist für alle Benutzer installiert und kann nicht entfernt werden. (Gelöst)","content":"<p> Wenn Sie ein Outlook-Add-In aufgrund eines Fehlers nicht deaktivieren oder aktivieren können &quot; <em> Das Add-in wird für alle Benutzer auf diesem Computer installiert und kann nur von einem Administrator verbunden oder getrennt werden </em> “, lesen Sie weiter unten, um das Problem zu beheben. </p> <p><img src=\"images/image_thumb-76-527.png\" alt=\"The add-is installed for all users on this computer, and can only be connected or disconnected by an administrator\" loading=\"lazy\"></p> <p> Der Fehler &quot;Add-In kann nur von einem Administrator deaktiviert werden&quot; wird angezeigt, da Sie bei der Installation des Add-Ins auswählen, es für alle Benutzer auf dem Computer zu installieren. In diesem Fall besteht die einzige Lösung zum Beheben des Fehlers darin, das Add-In mit Administratorrechten zu deinstallieren. </p> <h2> Problemlösung: Add-In kann nicht aktiviert oder deaktiviert werden, da es für alle Benutzer in Outlook, Word oder Excel installiert ist </h2> <p> Wenn Sie ein Add-In einer Microsoft Office-Anwendung aufgrund eines Fehlers nicht entfernen oder aktivieren können &quot; <em> Das Add-In wird für alle Benutzer auf diesem Computer installiert und kann nur von einem Administrator verbunden oder getrennt werden&quot;, </em> Starten Sie die entsprechende Anwendung als Administrator und entfernen Sie das Add-In problemlos. Das zu tun: </p> <p><strong> 1. </strong> Klicken Sie mit der rechten Maustaste auf die Office-Anwendung, bei der der oben genannte Fehler (z. B. Outlook) angezeigt wird, und wählen Sie <strong> Als Administrator ausführen. * </strong></p> <p> * Anmerkungen: <strong><br> </strong> 1. Wenn die Option &quot;Administrator ausführen&quot; nicht angezeigt wird, halten Sie die <strong> VERSCHIEBUNG </strong> Schlüssel und <strong> Rechtsklick </strong> In der Office-App steht der Fehler. <br> 2. Wenn Sie unter Windows 10 mit der rechten Maustaste auf die Office-App klicken <strong> Start </strong> Speisekarte <img src=\"images/image_thumb2_thumb_thumb-340.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Programme </strong> , gehe zu <strong> Mehr </strong> &gt; <strong> Als Administrator ausführen. </strong></p> <p><img src=\"images/image_thumb-77-661.png\" alt=\"FIX: Unable to Enable or Disable Add-in \" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Wenn Sie aufgefordert werden, dieser App zu erlauben, Änderungen an Ihrem Gerät vorzunehmen, wählen Sie <strong> Ja. </strong></p> <p><img src=\"images/image_thumb-78-120.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Fahren Sie nach dem Öffnen der Office-Anwendung mit dem Deaktivieren oder Aktivieren des gewünschten Add-Ins fort. Diesmal wird das Add-In problemlos entfernt. </p> <p> Das ist es! Lassen Sie mich wissen, ob dieser Leitfaden Ihnen geholfen hat, indem Sie Ihren Kommentar zu Ihren Erfahrungen hinterlassen. Bitte liken und teilen Sie diesen Leitfaden, um anderen zu helfen. </p>"}