{"title":"UPDATE: Skype-Kamera schwarzer Bildschirm und andere Webcam-Probleme unter Windows 10.","content":"<p> Das Problem mit dem schwarzen/leeren Bildschirm der Skype-Kamera ist eines der häufigsten Probleme unter Windows 10 und kann durch eine Reihe von Gründen verursacht werden. Hier finden Sie eine Schritt-für-Schritt-Anleitung zur Behebung des Problems. </p> <p> In Windows 10 kann ein neues Update viele Probleme mit Ihrer integrierten Webcam verursachen, und die Kamera funktioniert möglicherweise nicht oder die Kamera wird in einigen Anwendungen möglicherweise nicht erkannt, während sie in anderen ordnungsgemäß funktioniert. Zum Beispiel habe ich einen Fall gesehen, in dem die Kamera in den Webex- und Zoom-Anwendungen problemlos funktionierte, aber in Skype einen schwarzen Bildschirm anzeigte. </p> <p> Diese Anleitung enthält Schritt-für-Schritt-Anleitungen zur Behebung verschiedener Probleme mit der integrierten Kamera auf Laptops mit Windows 10: * </p> <ul> <li><em> Webcam/Kamera funktioniert nicht unter Windows 10 </em></li> <li><em><em> Webcam/Kamera </em> Funktioniert nach Update in Windows 10 nicht mehr. </em></li> <li><em> Die Webcam funktioniert bei einigen Anwendungen nicht (Skype, Windows Hello WebEx usw.). </em></li> <li><em> Die Webcam zeigt einen schwarzen (oder leeren) Bildschirm an, wenn sie in Skype verwendet wird. </em></li> <li><em> Webcam funktioniert in Skype, zeigt jedoch einen schwarzen Bildschirm im Kameravorschaufenster an </em> . </li> <li> Anwendungen können die Kamera/Webcam nicht erkennen oder finden </li> </ul> <p><strong> * Hinweis für Besitzer von Lenovo ThinkPads: </strong> Wenn Sie eines der in der folgenden Tabelle aufgeführten ThinkPad-Modelle besitzen, laden Sie es herunter und installieren Sie es <a href=\"/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/DC8297800EA7/Integrated%20Camera%20Driver%20Registry%20Patch%20for%20Windows%2010%20(Version%201709%20or%20later)%20-%20ThinkPad\" target=\"_blank\" rel=\"nofollow noopener\"> Registry-Patch von Lenovo. </a> Der Patch behebt ein Problem, bei dem der integrierte Kameratreiber nach dem Upgrade auf Windows 10, Version 1709 oder höher, möglicherweise nicht richtig funktioniert. </p> <p><img src=\"images/image_thumb-30-725.png\" alt=\"THinkpad Registry Fix for Integrated Camera\" loading=\"lazy\"></p> <h2> So beheben Sie: Webcam-Probleme unter Windows 10. </h2> <p> </p> <h3> Schritt 1. Kamerazugriff auf Apps zulassen. </h3> <p> Unter Windows 10 sind Kamera und Mikrofon möglicherweise aufgrund von Datenschutzeinstellungen, die möglicherweise angewendet wurden, für Anwendungen nicht verfügbar. Fahren Sie also fort und erlauben Sie der Anwendung mit dem Kameraproblem, auf Ihre Kamera zuzugreifen. Wenn Sie beispielsweise bei Skype mit dem Kameraproblem konfrontiert sind, gehen Sie wie folgt vor: </p> <p> 1. Navigieren Sie zu <strong> Start </strong> Speisekarte <img src=\"images/image_thumb-12-696.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> die Einstellungen </strong> -&gt; <strong> Privatsphäre </strong> . <br> 2. Wählen Sie <strong> Kamera </strong> im linken Bereich und rechts: </p> <blockquote><p> ein. Sicher gehen, dass <strong> Kamerazugriff für dieses Gerät </strong> ist <strong> auf. </strong> Wenn nicht, klicke <strong> Veränderung </strong> und stelle auf <strong> AUF. </strong><br> b. Dann auf einstellen <strong> Auf </strong> das <strong> Zulassen, dass Apps auf Ihren Kameraschalter zugreifen </strong> . </p> <p><img src=\"images/image_thumb-20-105.png\" alt=\"Allow Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Scrollen Sie nun nach unten und… </p> <p> c. Wenn das Problem des schwarzen Kamerabildschirms auf <strong> Skype </strong> Store-App, nach unten scrollen und bei <strong> Wählen Sie aus, welche Microsoft Store-Apps auf Ihre Kamera zugreifen können </strong> Abschnitt, Satz <strong> Skype </strong> zu <strong> Auf. </strong></p> <p><img src=\"images/image_thumb-21-826.png\" alt=\"Allow Store Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> d. Wenn Sie ein schwarzes Bildschirmfenster Ihrer Kamera sehen, während Sie das <strong> Skype für Windows </strong> (Desktop-Anwendung) und stellen Sie dann sicher, dass die <strong> Erlaube Desktop-Apps, auf deine Kamera zuzugreifen </strong> Schalter ist <strong> Auf </strong> . </p> <p><img src=\"images/image_thumb-22-558.png\" alt=\"Allow Applications to Access Camera Windows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h3> Schritt 2. Überprüfen Sie, ob Ihre Kamera ordnungsgemäß funktioniert. </h3> <p> Einer der ersten Schritte bei der Fehlerbehebung Ihrer Webcam besteht darin, zu bestätigen, dass sie in der Windows 10-Kamera-App funktioniert. </p> <p> 1. Geben Sie im Suchfeld ein <strong> Kamera </strong> um die Kamera-App zu öffnen. <br> 2. Klicken Sie auf die Lupe und suchen Sie nach &quot; <strong> Kamera </strong> &quot;. <br> 3. Öffnen Sie die <strong> Kamera </strong> Anwendung </p> <p><img src=\"images/image_thumb-23-730.png\" alt=\"Open Camera app Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Gehen Sie nun entsprechend dem Ergebnis wie folgt vor: </p> <blockquote><p> A. Wenn Ihre Kamera funktioniert, sollten Sie Ihr Bild auf dem Bildschirm sehen. Fahren Sie in diesem Fall fort und überprüfen Sie Ihre Kamera in Skype oder in einer anderen App, die Sie verwenden. Wenn die Webcam nicht funktioniert oder einen schwarzen Bildschirm anzeigt, führen Sie die folgenden Schritte der Reihe nach aus: </p> <ol> <li> Versuchen zu <strong> deinstallieren </strong> und <strong> neu installieren </strong> die Anwendung mit dem Kameraproblem (z.B. Skype). </li> <li> Fahren Sie mit dem Aktivieren oder Deaktivieren des Frame-Server-Modus in der Registrierung fort, indem Sie die Anweisungen auf . befolgen <a href=\"#step-3\" target=\"_blank\" rel=\"nofollow noopener\"> Schritt 3 </a> . </li> </ol> <p> B. Wenn Ihre Kamera auch in der Kamera-App nicht funktioniert, kann eines der folgenden Dinge passieren: </p> <ol> <li> Der Gerätetreiber der Kamera ist falsch oder beschädigt. Fahren Sie in diesem Fall mit der Fehlerbehebung bei den Kameratreibern fort, indem Sie die Anweisungen auf befolgen <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> Schritt 4 </a> . </li> <li> Die Kamera ist beschädigt und funktioniert überhaupt nicht. Gehen Sie in diesem Fall zu einer Computerwerkstatt, um Ihre Webcam zu reparieren, oder verwenden Sie eine externe USB-Kamera. </li> </ol> </blockquote> <h3></h3> <h3> Schritt 3. Beheben Sie das Problem mit dem schwarzen Bildschirm der Webcam in der Windows 10-Registrierung. </h3> <p> Wenn die Kamera in einigen Apps erkannt wird und problemlos funktioniert, in anderen jedoch nicht funktioniert oder bei Skype ein schwarzer Bildschirm angezeigt wird, versuchen Sie, den &quot;Frame Server Mode&quot; in der Registrierung zu deaktivieren oder zu aktivieren. </p> <p> 1. Öffnen Sie den Registrierungseditor: um das zu tun: </p> <blockquote><p> 1. Drücken Sie Windows <img src=\"images/image_thumb41-284.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ <strong> regedit </strong> und drücke <strong> Eingeben </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-845.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> 3. Navigieren Sie im Registrierungseditor zum folgenden Schlüssel im linken Bereich: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows Media Foundation\\Platform </li> </ul> <p> 4. <strong> Rechtsklick </strong> an einer freien Stelle im rechten Fenster und wählen Sie <strong> Neu -&gt; DWORD (32-Bit) Wert. </strong></p> <p><img src=\"images/image_thumb-24-839.png\" alt=\"Fix Webcam black Screen Windows 10\" loading=\"lazy\"></p> <p> 5. Gib den Namen an <strong> EnableFrameServerMode </strong> auf den neuen Wert. <br> 6. Doppelklicken Sie auf den neu erstellten Wert und stellen Sie sicher, dass die Wertdaten <strong>0</strong> . (Null). Klicken <strong> OK. </strong></p> <p><img src=\"images/image_thumb-25-764.png\" alt=\"Fix Webcam issues Windows 10\" loading=\"lazy\"></p> <p> 7. Führen Sie nun die gleichen Schritte wie oben (4,5 &amp; 6) aus und nehmen Sie die gleichen Änderungen an dieser Taste vor: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows Media Foundation\\Platform </li> </ul> <p> 8. Wenn Sie fertig sind, <strong> schließen </strong> Registrierungseditor und <strong> neu starten </strong> dein PC. <br> 9. Starten Sie nach dem Neustart Skype und prüfen Sie, ob das Problem mit der WebCam behoben wurde. Wenn nicht, befolge die gleichen Schritte, aber dieses Mal <strong> aktivieren </strong> das <strong> EnableFrameServerMode </strong> indem man seinen Wert von . ändert <strong>0 </strong> zu <strong> 1 </strong> und <strong> neu starten </strong> wieder Ihren PC. </p> <p> </p> <h3> Schritt 4. Fehler beim Webcam-Treiber beheben. </h3> <p> Der nächste Schritt, um Kameraprobleme in Windows 10 zu beheben, besteht darin, die Treiber der Kamera zurückzusetzen oder zu deinstallieren/neu zu installieren. 1. Öffnen <strong> Gerätemanager </strong> . Das zu tun: </p> <blockquote><p> 1. Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-696.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Geben Sie im Feld &quot;Öffnen&quot; Folgendes ein: <strong> devmgmt.msc </strong> &amp; klicken <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-5-837.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Erweitern <strong> Stellen Sie sich Geräte vor </strong> (oder <strong> Kameras </strong> ) <br> 3. <strong> Rechtsklick </strong> auf Ihrem <strong> Kamera </strong> und wähle <strong> Eigenschaften. </strong></p> <p><img src=\"images/image_thumb-26-673.png\" alt=\"Camera Properties\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 4. Wählen Sie die <strong> Treiber </strong> Registerkarte und gehen Sie je nach Fall wie folgt vor: </p> <blockquote><p> A. Wenn Ihre Webcam zuvor funktioniert hat, <strong> Rollback-Treiber </strong> und <strong> neu starten </strong> t Ihren PC. Überprüfen Sie dann, ob Ihre Kamera funktioniert. </p> <p><img src=\"images/image_thumb-27-454.png\" alt=\"Roll Back Driver - Camera\" loading=\"lazy\"></p> <p> </p> <p> B. Wenn Ihre Kamera noch nie funktioniert hat oder Sie Ihre Kamera zum ersten Mal testen (z. B. nach einer Neuinstallation von Windows), versuchen Sie Folgendes in dieser Reihenfolge: </p> <ol> <li> Drücke den <strong> Treiber aktualisieren </strong> Option, um nach einem aktualisierten Treiber für Ihre Kamera zu suchen. Wenn Windows einen neuen Treiber findet, installieren Sie ihn und überprüfen Sie dann Ihre Webcam. Andernfalls… </li> <li> Klicken <strong> Gerät deinstallieren </strong> um die Webcam zu deinstallieren und dann <strong> neu starten </strong> dein PC. Überprüfen Sie nach dem Neustart, ob Ihre Kamera funktioniert. Wenn nicht… </li> <li> Navigieren Sie zur Support-Site Ihres Laptop-Herstellers und prüfen Sie, ob ein neuer Treiber für Ihre Webcam verfügbar ist, und installieren Sie ihn. </li> </ol> </blockquote> <h3> Zusätzliche Hilfe zum Beheben von Kameraproblemen unter Windows 10. </h3> <p> Wenn Sie nach den obigen Schritten immer noch Probleme mit Ihrer Webcam haben, versuchen Sie Folgendes: </p> <ol> <li> <p> Installieren Sie alle verfügbaren Windows 10-Updates ( <strong> Start </strong> -&gt; <strong> die Einstellungen </strong> -&gt; <strong> Update &amp; Sicherheit </strong> und klicke <strong> Auf Updates prüfen). </strong></p> </li> <li> <p> Aktualisieren Sie Windows 10 auf die neueste Version, indem Sie das <strong> Update-Assistent. </strong> (Um das zu tun, navigieren Sie zu diesem <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"noopener\"><strong> Verknüpfung </strong></a> und klicke auf <strong> Jetzt aktualisieren </strong> Taste). </p> </li> <li> <p><a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"noopener\"><strong> Aktualisieren Sie Windows 10 </strong> . </a></p> </li> </ol> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}