{"title":"UPDATE: Windows kann erforderliche Dateien nicht installieren – Fehlercode 0x80070570 (Gelöst)","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben des Windows-Installationsfehlers 0x80070570: &quot;Windows kann erforderliche Dateien nicht installieren. Die Datei ist möglicherweise beschädigt oder fehlt. Stellen Sie sicher, dass alle für die Installation erforderlichen Dateien verfügbar sind, und starten Sie die Installation neu&quot;. Der Windows-Installationsfehler 0x80070570 erscheint normalerweise bei der Installation von Windows 10, 8 oder 7 OS von einem USB 3.0-Installationsmedium. </p> <p><img src=\"images/image_thumb-17-309.png\" alt=\"FIX: Windows Cannot Install Required Files 0x80070570\" loading=\"lazy\"></p> <p> </p> <h4> So beheben Sie, dass Windows erforderliche Dateien nicht installieren kann – Fehlercode 0x80070570 (Windows 10/8/7) </h4> <h6> Schritt 1. Trennen Sie alle angeschlossenen Geräte. </h6> <p> Der erste Schritt zur Behebung des Fehlers 0x80070570 &quot;Windows kann erforderliche Dateien nicht installieren&quot; besteht darin, alle anderen Geräte (z. </p> <p> </p> <h6> Schritt 2. Deaktivieren Sie die <strong> Integriertes Sicherheitsgerät </strong> . </h6> <p> Der Windows 10-Installationsfehler „Windows kann erforderliche Dateien nicht installieren“ erscheint häufig auf HP-PCs, auf denen das „Embedded Security Device“ standardmäßig aktiviert ist. Um den Fehler zu umgehen, fahren Sie fort und deaktivieren Sie das Sicherheitsgerät in den BIOS-Einstellungen. Das zu tun: </p> <p> 1. <strong> Ein </strong> der PC und <strong> Drücken Sie </strong> das <strong> F10 </strong> Taste zum Aufrufen der BIOS-Einstellungen. <br> 2. Navigieren Sie mit den Pfeiltasten zu <strong> Sicherheit </strong> -&gt; <strong> Gerätesicherheit </strong> und drücke <strong> Eingeben. <br> </strong> 3. Stellen Sie die <strong> Integriertes Sicherheitsgerät </strong> von &#39;Gerät verfügbar&#39; bis <strong> Gerät ausgeblendet. </strong></p> <p><img src=\"images/image_thumb-23-480.png\" alt=\"FIX: HP SLOW RESTART\" loading=\"lazy\"></p> <p> </p> <p> 4. Drücken Sie die <strong> F10 </strong> Taste, um die Änderung zu übernehmen. <br> 5. <b> Änderungen speichern und f . beenden </b> rom bios einstellungen. <br> 6. Installieren Sie Windows 10. </p> <h6> Schritt 3. Verwenden Sie einen anderen USB-Port oder ein Installationsmedium. </h6> <p> Der Fehler &quot;Windows kann erforderliche Dateien nicht installieren&quot; tritt häufig auf, wenn Sie Windows 10 von einem USB-Medium einrichten, das an einen USB 3.0-Port angeschlossen ist. Versuchen Sie also Folgendes: </p> <ol> <li> Überprüfen Sie, ob Sie die USB 3.0-Unterstützung in den BIOS-Einstellungen deaktivieren können. </li> <li> Schließen Sie das USB-Laufwerk an einen USB 2.0-Port (oder an einen anderen USB-Port) an. </li> <li> Wenn Ihr PC keinen USB 2.0-Anschluss hat, installieren Sie Windows 10 von einem USB 2.0-Flash-Laufwerk oder von einer DVD. </li> <li> Wenn Sie Windows 10 auf einem UEFI-basierten System installieren möchten, verwenden Sie das RUFUS-Dienstprogramm und erstellen Sie ein USB-Installationsmedium für &quot;UEFI&quot;. Wenn Ihr System UEFI nicht unterstützt, erstellen Sie ein USB-Installationsmedium für ein &quot;Legacy&quot;-basiertes System. (Die detaillierte Anleitung dazu finden Sie hier: <a href=\"https://www.repairwin.com/create-windows-usb-with-rufus-iso-to-usb/\" target=\"_blank\" rel=\"nofollow noopener\"> So erstellen Sie ein Windows-USB-Boot-Laufwerk mit dem Dienstprogramm Rufus. </a></li> <li> Re- <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Laden Sie die Windows-ISO-Datei herunter </a> und erstellen Sie mit RUFUS ein neues Windows-USB-Installationsmedium. </li> </ol> <p> </p> <h6> Schritt 4. Installieren Sie Windows 10 von einem Legacy-USB-Gerät. </h6> <p> Wenn Sie beim Einrichten von Windows 10 von einem für das UEFI-System erstellten USB-Medium die Fehlermeldung &quot;Windows kann erforderliche Dateien nicht installieren&quot; erhalten, erstellen Sie ein neues USB-Medium für ein Legacy-System und starten Sie vom Legacy-USB-Gerät, um Windows 10 zu installieren. </p> <p> </p> <h6> Schritt 5. Diagnose von Speicherproblemen. </h6> <p> Der dritte Schritt zum Beheben des Windows-Setup-Fehlers 0x80070570 besteht darin, Ihren RAM auf Probleme zu diagnostizieren. Um diese Aufgabe auszuführen, befolgen Sie die Anweisungen aus dem folgenden Artikel: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> So diagnostizieren Sie Computerspeicherprobleme mit Memtest86+ </a></li> </ul> <p> </p> <h6> Schritt 6. Überprüfen Sie die Festplatte auf Probleme. </h6> <p> Der Windows-Installationsfehler 0x80070570 kann auftreten, wenn die Festplatte beschädigt ist. Fahren Sie also fort und diagnostizieren Sie die Festplatte auf Fehler und ersetzen Sie die Festplatte bei Bedarf, indem Sie die Anweisungen in dieser Anleitung befolgen: </p> <ul> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Beste Festplattentest- und Diagnosetools, um den Zustand der Festplatte zu überprüfen </a></li> </ul> <h5></h5> <h6> Schritt 7. Überprüfen Sie die Kabelverbindungen und die Hardware. </h6> <p> Wenn nach Durchführung der obigen Schritte der Windows-Installationsfehler 0x80070570 weiterhin angezeigt wird, dann: </p> <p> 1. Überprüfen Sie alle Kabelverbindungen und stellen Sie sicher, dass die Festplatte richtig angeschlossen ist. Wenn Sie einen Desktop-PC besitzen, ersetzen Sie außerdem das Datenkabel der Festplatte. <br> 2. Versuchen Sie Windows zu installieren, indem Sie eine andere Grafikkarte (VGA) verwenden, wenn Sie können. <br> 3. Aktualisieren Sie Ihr BIOS. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um das Problem zu verbreiten. </p>"}