{"title":"UPDATE: Outlook DRAFTS-Ordner fehlt im Navigationsbereich in Outlook 2013, 2010 oder 2007. (Gelöst)","content":"<p> Bei einem meiner Kunden ist folgendes Problem aufgetreten: Plötzlich und ohne ersichtlichen Grund fehlt der Ordner Entwürfe im Navigationsbereich in Outlook 2013. Die erste Aktion, um den fehlenden Ordner Entwürfe wiederherzustellen, besteht darin, in allen anderen Outlook-Ordnern zu suchen Stellen Sie sicher, dass der Ordner nicht versehentlich verschoben oder gelöscht wurde. Wenn Sie den fehlenden Ordner immer noch nicht finden können, fahren Sie unten fort, um das Problem zu beheben. </p> <p><img src=\"images/image_thumb-37-460.png\" alt=\"Drafts folder Missing Outlook\" loading=\"lazy\"></p> <p> </p> <p> Dieses Tutorial enthält Anweisungen zum Wiederherstellen eines fehlenden Ordners in Outlook 2007, 2010, 2013, 2016 oder 365. </p> <h4> So stellen Sie einen fehlenden Ordner aus dem Outlook-Navigationsbereich wieder her </h4> <h6> Methode 1. Scannen Sie Ihr System auf Viren und Malware. </h6> <p> Der erste Schritt zur Behebung des Problems &quot;fehlende Ordner&quot; in Outlook besteht darin, sicherzustellen, dass Ihr System frei von Viren/Malware ist. Befolgen Sie für diese Aufgabe die Anweisungen in dieser Anleitung: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> So scannen Sie Ihren Computer auf Viren und andere bösartige Programme. </a></p> <p> </p> <h6> Methode 2. Outlook-Ordner ZURÜCKSETZEN. </h6> <p> Fahren Sie nach dem Virenscan fort und setzen Sie die Outlook-Ordner auf die Standardeinstellungen zurück, indem Sie den folgenden Prozess verwenden: </p> <p> 1. Schließen Sie die Outlook-Anwendung. <br> 2. Drücken Sie die <strong> Fenster </strong> <img src=\"images/image_thumb8_thumb_thumb-622.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 3. Geben Sie in das Suchfeld Folgendes ein: <strong> Outlook / Ordner zurücksetzen </strong> &amp; klicken <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-36-732.png\" alt=\"outlook reset folders\" loading=\"lazy\"></p> <p> </p> <p> 4. Outlook wird geöffnet und alle fehlenden Ordner werden wiederhergestellt. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? </p> <p> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht zu verbreiten. </p>"}