{"title":"UPDATE: Laptop Dell Inspiron langsame CPU-Geschwindigkeit (gelöst)","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben des Problems mit der sehr langsamen CPU-Geschwindigkeit auf einem Dell Inspiron 5558-Laptop. Vor kurzem brachte ein Freund von mir seinen Dell-Laptop in mein Labor, weil er plötzlich zu langsam wurde. Tatsächlich arbeitete der Laptop in der Vergangenheit schnell, aber jetzt dauert es lange, das Betriebssystem (Windows 10) und die Anwendungen zu laden. </p> <p> Nach der Überprüfung des Laptops und wie Sie auf dem Screenshot unten sehen können, habe ich festgestellt, dass die CPU immer mit 0,48 GHz statt mit 2,20 GHz läuft. Also habe ich mit der Fehlerbehebung begonnen und schließlich die folgenden beiden Methoden gefunden, um das Problem mit der langsamen CPU-Geschwindigkeit zu beheben… </p> <p> (CPU-Geschwindigkeit wurde auf einem Dell-Laptop um 85-87% gedrosselt) </p> <p><img src=\"images/image_thumb-16-354.png\" alt=\"FIX Dell Laptop Slow CPU Speed\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> So beheben Sie das Problem mit der langsamen CPU-Geschwindigkeit auf einem Dell Laptop. </h4> <h6> Methode 1. Ersetzen Sie das Netzteil. </h6> <p> Das Problem mit der langsamen CPU-Geschwindigkeit ist ein bekanntes Problem bei Dell-Laptops, wenn das Netzteil vom Computer nicht richtig erkannt wird. In diesen Fällen und selbst wenn das Netzteil gut zu funktionieren scheint, wird beim Einschalten des Laptops die folgende Warnmeldung angezeigt &quot;Der AC-Netzadaptertyp kann nicht ermittelt werden. Dies verhindert eine optimale Systemleistung&quot;. </p> <p> Die erste Methode zur Behebung Ihres langsamen Leistungsproblems auf Ihrem Dell Laptop besteht also darin, das Netzteil durch ein neues kompatibles Dell AC-Netzteil zu ersetzen. </p> <p> </p> <h6> Methode 2. Stoppen Sie die CPU-Drosselung mit ThrottleStop. </h6> <p> Wenn Ihr Netzteil gut funktioniert und Ihr Laptop nicht überhitzt*, können Sie das Problem mit der langsamen Systemleistung Ihres Dell Laptops auch beheben, indem Sie die Drosselung des unbekannten Netzteils mit dem unknown <strong><a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"> Drosselstopp </a></strong> Nützlichkeit. Das zu tun: </p> <p> 1. Laden Sie die . herunter <a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Drosselstopp </strong></a> Dienstprogramm und entpacken Sie das heruntergeladene Archiv. <br> 2. Doppelklicken Sie im extrahierten Ordner, um die Anwendung &quot;ThorttleStop.exe&quot; auszuführen. * <br> 3. <strong> Deaktivieren Sie </strong> das <strong> BD PROCHOT </strong> *** Checkbox und dann klicken <strong> speichern </strong> . </p> <p> * Anmerkungen: <br> 1. Um die CPU-Temperatur zu überwachen, können Sie die <a href=\"https://www.alcpu.com/CoreTemp/\" target=\"_blank\" rel=\"nofollow noopener\"> CoreTemp </a> Programm. <br> 2. Wenn Sie nach dem Ausführen von ThrottleStop die Fehlermeldung &quot;MFC120U.dll wurde nicht gefunden&quot; oder &quot;MSVCR120.dll fehlt&quot; erhalten, fahren Sie fort und installieren Sie die <a title=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" href=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Visual C++ Redistributable Packages für Visual Studio 2013 </a> . ( <strong> Wichtig: </strong> Wenn Sie Windows 64-Bit besitzen, müssen Sie sowohl die 64-Bit- als auch die 32-Bit-Version des Visual C++-Pakets installieren). <br> 3. BD PROCHOT steht für bidirektionales Prochot. PROCHOT steht für Processor Hot, was das Signal ist, das innerhalb der CPU aktiviert wird, wenn es je nach Modellnummer ungefähr 100 °C bis 105 °C erreicht. Dieses Signal leitet die thermische Drosselung ein, damit die CPU verlangsamen und eine Überhitzung verhindern kann. Wenn Sie PROCHOT deaktivieren, kann Ihre CPU weiterhin mit voller Geschwindigkeit laufen. (Quelle: <a href=\"http://forum.notebookreview.com/threads/the-throttlestop-guide.531329/\" target=\"_blank\" rel=\"nofollow noopener\"> Die ThrottleStop-Anleitung </a> ). </p> <p><img src=\"images/image_thumb-20-666.png\" alt=\"FIX Slow CPU Speed with ThrottleStop\" loading=\"lazy\"></p> <p> 4. Schließen Sie ThrottleStop und Sie sind fertig. Jetzt läuft die CPU mit voller Geschwindigkeit, bis Sie den Laptop neu starten oder ausschalten. * </p> <p> * Hinweis: Sie müssen die ausführen <strong> Drosselstopp </strong> Programm jedes Mal, wenn Sie Ihren Computer starten, wenn Sie mit voller CPU-Geschwindigkeit laufen möchten. Um Ihr Leben einfacher zu machen, befolgen Sie die Schritte in diesem <a href=\"https://www.repairwin.com/how-to-start-throttlestop-at-windows-startup/\" target=\"_blank\" rel=\"nofollow noopener\"> leiten </a> um ThrottleStop beim Windows-Start automatisch zu starten. </p> <p><img src=\"images/image_thumb-21-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}