{"title":"UPDATE: Ihr Computer konnte keine Verbindung zu einer anderen Konsolensitzung herstellen, da bereits eine Konsolensitzung im Gange ist. (Gelöst)","content":"<p> Auf einem Windows-basierten Computer wird in Remotedesktopverbindung der folgende Fehler angezeigt: &quot;Ihr Computer konnte keine Verbindung zur Konsolensitzung auf dem Remotecomputer herstellen, da bereits eine Konsolensitzung ausgeführt wird&quot;. </p> <p> </p> <p><img src=\"images/image_thumb-3-627.png\" alt=\"Your computer could no connect to console session on the remote computer because you already have a console session in progress.\" loading=\"lazy\"></p> <p> </p> <p> Dieses Tutorial enthält Anweisungen zum Beheben des folgenden Remotedesktopverbindungsfehlers: &quot;Ihr Computer konnte keine Verbindung zur Konsolensitzung auf dem Remotecomputer herstellen, da bereits eine Konsolensitzung ausgeführt wird&quot;. </p> <h4> So beheben Sie: Remotedesktopverbindung konnte keine Verbindung herstellen, da bereits eine Konsolensitzung ausgeführt wird. </h4> <p> Der Fehler &quot;Ihr Computer konnte keine Verbindung zur Konsolensitzung auf dem Remotecomputer herstellen, da bereits eine Konsolensitzung ausgeführt wird&quot;, wird verursacht, weil einer der Netzwerkadapter auf Ihrem Computer (RDP von) dieselbe IP-Adresse wie der Computer hat zu dem Sie über den Remote-Desktop eine Verbindung herstellen möchten. </p> <p> Beispiel: Wenn der Remote-Computer die IP-Adresse &quot;192.168.1.157&quot; hat, führen Sie die folgenden Schritte aus: </p> <p> 1. Öffnen <strong> Eingabeaufforderung als Administrator </strong> auf Ihrem Computer (RDP von). <br> 2. Geben Sie den folgenden Befehl ein, um die zugewiesenen IPv4-Adressen auf Ihrem PC anzuzeigen. </p> <ul> <li><strong> ipconfig </strong></li> </ul> <p> </p> <p> 3. Suchen Sie nun, welcher Netzwerkadapter auf Ihrem lokalen Computer (RDP von) dieselbe IP-Adresse hat wie der Remote-Computer (RDP to). <br> 4. Wenn Sie feststellen, welcher LAN-Adapter auf Ihrem lokalen Computer dieselbe IP-Adresse wie der Remote-Computer hat, fahren Sie fort und ändern Sie die IP-Adresse dieses Adapters in eine andere. * </p> <p> z.B. In diesem Beispiel lautet die IP des Remote-Computers: &quot;192.168.1.157&quot;, also müssen wir die IP-Adresse des Ethernet-Adapters (auf dem lokalen Computer) auf eine andere ändern: z.B. zu: &quot;192.168.1.160&quot;. </p> <p><img src=\"images/image_thumb-5-946.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> * Hinweis: Wenn die IP-Adresse in Ihrem lokalen Netzwerk von einem DHCP-Server zugewiesen wird, haben Sie folgende Möglichkeiten, das Problem zu umgehen: </p> <blockquote><p> ein. Um manuell eine andere statische IP-Adresse anzugeben. <br> b. Um Ihren Router (DHCP-Server) neu zu starten, um eine andere IP-Adresse vom DHCP-Server zu &quot;nehmen&quot;. <br> c. Um den DHCP-Server (z. B. auf dem Router) zu konfigurieren, um IP-Adressen einem Bereich zuzuweisen, der nicht die IP-Adresse des entfernten Computers enthält. (z.B. &quot;192.168.1.200-192.168.1.250&quot; </p></blockquote> <p> </p> <p> 5. Nachdem Sie die IP-Adresse auf Ihrem lokalen Computer geändert haben (RDP von), öffnen Sie die Remotedesktopverbindung und versuchen Sie, eine Verbindung zum Remotecomputer herzustellen. Der Fehler „Ihr Computer konnte keine Verbindung zu einer anderen Konsolensitzung herstellen, da bereits eine Konsolensitzung läuft“ sollte behoben sein. </p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? </p> <p> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}