{"title":"UPDATE: Datei hat keine Audio- oder Videostreams in Adobe Premiere.","content":"<p> Wenn beim Importieren einer MP4-Videodatei möglicherweise der Adobe Premiere-Fehler „Dateiimportfehler“ mit der Beschreibung „Die Datei enthält keine Audio- oder Videodatenströme“ angezeigt wird, lesen Sie weiter unten. Der Fehler &quot;Die Datei hat keine Audio- oder Videodatenströme&quot; in Adobe Premiere, kann auftreten, obwohl das Video in anderen Mediaplayern (VLC, Windows Media Player usw.) korrekt wiedergegeben wird. </p> <p><img src=\"images/image_thumb-43-349.png\" alt=\"FIX: File has no audio or video streams on Adobe Premiere\" loading=\"lazy\"></p> <p> </p> <p> Die Adobe Premiere-Fehler beim Importieren einer Videodatei können aus verschiedenen Gründen auftreten. In diesem Tutorial finden Sie alle verfügbaren Methoden zur Behebung des Problems. </p> <h4> Problembehebung: &quot;Die Datei enthält keine Audio- oder Videodatenströme&quot; in Adobe Premiere. </h4> <h6> Methode 1. Installieren Sie QuickTime. </h6> <p> Stellen Sie zunächst sicher, dass Sie die neueste Version installiert haben <a href=\"https://support.apple.com/downloads/quicktime\" target=\"_blank\" rel=\"nofollow noopener\"> Schnelle Zeit </a> Version auf Ihrem PC und versuchen Sie dann, die mp4-Datei in Adobe Premiere zu importieren. </p> <p> </p> <h6> Methode 2. Benennen Sie die Videodatei um. </h6> <p> 1. Erstellen Sie eine Kopie der mp4-Videodatei an einem anderen Ort auf Ihrem PC. (z.B. auf Ihrem Desktop) <br> 2. Benennen Sie die Videodatei wie folgt um: </p> <blockquote><p> ein. Geben Sie der Videodatei einen kürzeren Dateinamen und… <br> b. Entfernen Sie alle Sonderzeichen aus seinem Namen. (Unterstriche, Klammern usw.). </p></blockquote> <p> 3. Öffnen Sie die Videodatei in Adobe Premiere. </p> <p> </p> <h6> Methode 3. Ändern Sie die Dateinamenerweiterung von MP4 in MOV. </h6> <p> Die nächste Methode zum Umgehen des Adobe Premiere-Fehlers &quot;Datei enthält keine Audio- oder Videostreams&quot; besteht darin, die Erweiterung der Videodatei von .mp4 in .mov (oder umgekehrt) zu ändern. Das zu tun: </p> <p> 1. Klicken Sie im Datei-Explorer auf <strong> Aussicht </strong> -&gt; <strong> Optionen </strong> -&gt; <strong> Ordner- und Suchoptionen ändern </strong> . </p> <p><img src=\"images/image_thumb-45-776.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. At <strong> Aussicht </strong> Tab, <strong> klar </strong> das Feld &quot;Erweiterungen für bekannte Dateitypen ausblenden&quot; und klicken Sie auf <strong> OK </strong> . * </p> <p> * Hinweis: Um diese Einstellung dauerhaft zu machen, klicken Sie auf &quot;Auf Ordner anwenden&quot;, bevor Sie auf OK klicken. </p> <p><img src=\"images/image_thumb-46-490.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Fahren Sie nun fort und benennen/ändern Sie die Erweiterung der Videodatei wie folgt: </p> <ul> <li> Wenn die Videodatei im MP4-Format (.mp4) vorliegt, ändern Sie ihre Erweiterung in .mov </li> <li> Wenn die Videodatei im MOV-Format (.mov) vorliegt, ändern Sie ihre Erweiterung in .mp4 </li> </ul> <p><img src=\"images/image_thumb-47-586.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Öffnen Sie abschließend die Videodatei in Adobe Premiere. </p> <p> </p> <p> </p> <h6> Methode 4. Löschen Sie die Medien-Cache-Datenbank und die Cache-Dateien. </h6> <p> Wenn Sie eine Mediendatei (Video oder Audio) importieren und mit dieser Datei in Adobe Premiere arbeiten, erstellt das Programm die Medien-Cache-Dateien für eine schnellere Leistung. Darüber hinaus erstellt das Programm Links für diese Cache-Dateien in der Media Cache Database. Während dieser Zeit können diese Mediencachedateien und die Mediencachedatenbank zu groß oder beschädigt werden und müssen bereinigt werden, um Probleme zu vermeiden. </p> <p> Die nächste Methode, um das Problem &quot;Datei enthält keine Audio- oder Videostreams&quot; in Premiere zu beheben, besteht darin, die &quot;Medien-Cache-Datenbank&quot; zu bereinigen und die Cache-Dateien zu löschen. Das zu tun: * </p> <p><strong> A. So bereinigen Sie die Medien-Cache-Datenbank von Adobe Premiere. </strong></p> <p> 1. Öffnen Sie Adobe Premiere. <br> 2. Gehen Sie im Menü zu <strong> Bearbeiten </strong> -&gt; <strong> Einstellungen </strong> -&gt; <strong> Medien. <br> </strong> 3. Klicken Sie bei der Medien-Cache-Datenbank auf das <strong> Sauber </strong> Taste. </p> <p><img src=\"images/image_thumb-48-167.png\" alt=\"Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> 4. <strong> Neu starten </strong> Adobe Premiere und versuchen Sie, die Videodatei zu öffnen. Wenn der Fehler &quot;Datei enthält keine Audio- oder Videostreams&quot; weiterhin besteht, bereinigen Sie die Cache-Dateien von Adobe Premiere, indem Sie die folgenden Anweisungen befolgen: </p> <p><strong> B. So löschen Sie die Medien-Cache-Dateien von Adobe Premiere. </strong></p> <p> 1. <strong> Öffnen </strong> Adobe Premiere. <br> 2. Gehen Sie im Menü zu <strong> Bearbeiten </strong> -&gt; <strong> Einstellungen </strong> -&gt; <strong> Medien. <br> </strong> 3. Klicken Sie bei Medien-Cache-Dateien auf <strong> Durchsuche </strong> oder notieren Sie den Speicherort der Medien-Cache-Dateien. </p> <p><img src=\"images/image_thumb-49-331.png\" alt=\"FIX: Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Schließen </strong> Adobe Premiere. <br> 5. Im Datei-Explorer, <strong> löschen </strong> den gesamten Inhalt des Ordners &quot;Medien-Cache-Dateien&quot;. <br> 6. Importieren Sie die Videodatei in Premiere. </p> <p> </p> <h6> Methode 5. Codieren Sie die Videodatei neu. </h6> <p> Die letzte Methode zum Auflösen des Problems &quot;Datei enthält keine Audio- oder Videostreams&quot; beim Importieren von Adobe Premiere besteht darin, die Videodatei neu zu codieren. Das zu tun: </p> <p> 1. Herunterladen und installieren <a href=\"https://handbrake.fr/downloads.php\" target=\"_blank\" rel=\"nofollow noopener\"> Handbremse </a> . <br> 2. Öffnen Sie Handbremse und klicken Sie auf <strong> Datei – Öffnen Sie eine einzelne Videodatei </strong> . </p> <p><img src=\"images/image_thumb-50-634.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Wählen Sie die Videodatei aus, die Sie nicht in Adobe Premiere importieren können, und klicken Sie auf <strong> Öffnen </strong> . <br> 4. Stellen Sie das Ausgabeformat auf <strong> MP4, </strong> und dann klick <strong> Durchsuche </strong> und geben Sie den Speicherort und den Dateinamen der ausgegebenen (neu codierten) Videodatei an. </p> <p><img src=\"images/image_thumb-51-817.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. At <strong> Maße </strong> Legen Sie auf der Registerkarte die gleichen Abmessungen wie in der Quelldatei fest. <br> 6. Wenn Sie fertig sind, klicken Sie auf <strong> Codierung starten. </strong></p> <p><img src=\"images/image_thumb-52-713.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Wenn der Kodierungsvorgang abgeschlossen ist, schließen Sie Handbrake. <br> 7. Öffnen Sie die neu codierte Videodatei in Adobe Premiere. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}