{"title":"UPDATE: Vertrauensstellung zwischen dieser Workstation und der primären Domäne fehlgeschlagen (gelöst)","content":"<p> Wenn Sie die Fehlermeldung &quot;Die Vertrauensbeziehung zwischen dieser Arbeitsstation und der primären Domäne ist fehlgeschlagen&quot; erhalten, wenn Sie versuchen, sich in Ihrer Domäne anzumelden oder wenn Sie versuchen, auf einen freigegebenen Ordner auf einem anderen Computer in der Domäne zuzugreifen, lesen Sie weiter unten, um das Problem zu beheben. </p> <p> Der Fehler &quot;Vertrauensstellung zwischen Workstation und primärer Domäne fehlgeschlagen&quot; kann aus folgenden Gründen auftreten: </p> <ul> <li> Der Computer hat denselben Namen wie ein anderer Computer in der Domäne. </li> <li> Die Domänenanmeldeinformationen (Benutzername oder Kennwort) sind ungültig. </li> <li> Das Konto des Computers ist abgelaufen. * </li> </ul> <p> * Hinweis: Einige Organisationen erstellen Computer (oder Computerklone) für die spätere Verwendung vor. Wenn das Konto des Computers abgelaufen ist, kann er sich nicht mehr bei der Domäne authentifizieren. In solchen Fällen müssen Computer, die sich nicht bei der Domäne authentifizieren können, aus der Domäne entfernt und ihr wieder beigetreten werden. (Schritt 4) </p> <p><img src=\"images/image_thumb-32-740.png\" alt=\"FIX: Trust Relationship Between this Workstation and the Primary Domain Failed \" loading=\"lazy\"></p> <h4> So beheben Sie: Vertrauensstellung zwischen Workstation und Domäne fehlgeschlagen. </h4> <h6> Methode 1. Überprüfen Sie, ob die Domänenanmeldeinformationen korrekt sind. </h6> <p> Stellen Sie zunächst sicher, dass die Anmeldeinformationen und insbesondere das Passwort korrekt sind. wenn Sie die Maschine von einem Computer-Image geklont haben, das in der Vergangenheit aufgenommen wurde und sich der Code seitdem geändert hat. </p> <h6> Methode 2. Suchen Sie nach doppelten Computernamen. </h6> <p> Stellen Sie sicher, dass der Computername eindeutig ist und kein anderer Computer mit demselben Namen im Netzwerk vorhanden ist. </p> <h6> Methode 3. Suchen Sie nach doppelten IP-Adressen. </h6> <p> Stellen Sie sicher, dass die IP-Adresse des Computers eindeutig ist und nicht mit einer anderen IP-Adresse im Netzwerk in Konflikt steht. </p> <h6> Methode 4. Entfernen Sie den Computer in der Domäne, und schließen Sie ihn erneut an. </h6> <p> Die übliche Methode zum Korrigieren einer Vertrauensstellung zwischen einem Computer und einer Domäne besteht darin, den betroffenen Computer zu entfernen und der Domäne erneut hinzuzufügen. </p> <h5> Schritt 1. Computerkonto aus der Domäne löschen. </h5> <p> 1. Melden Sie sich beim Active Directory-Server an. <br> 2. Öffnen <strong> Aktive Verzeichnisse Benutzer und Computer. <br> </strong> 3. Erweitern Sie die <strong> Computers </strong> Container. <br> 4. Klicken Sie mit der rechten Maustaste auf den betroffenen Computer und wählen Sie <strong> Löschen. </strong></p> <p><img src=\"images/image_thumb-39-366.png\" alt=\"Delete Computer Account from Domain\" loading=\"lazy\"></p> <h5> Schritt 1. Entfernen Sie den Computer aus der Domäne und schließen Sie ihn erneut an. </h5> <p> 1. Melden Sie sich am betroffenen Computer mit dem LOKALEN Administratorkonto (Computername\\Administrator) an. </p> <p> 2. Drücken Sie Windows <img src=\"images/image_thumb8_thumb-480.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. </p> <p> 2a. Art <strong> sysdm.cpl </strong> &amp; klicken <strong> OK </strong> . </p> <p><img src=\"images/image_thumb7_thumb-169.png\" alt=\"system properties\" loading=\"lazy\"></p> <p> 3. Klicken Sie auf der Registerkarte &#39;Computername&#39; auf <strong> Veränderung </strong> . </p> <p><img src=\"images/image_thumb-37-924.png\" alt=\"Remove Computer from Domain\" loading=\"lazy\"></p> <p> 4. Wählen Sie bei Mitglied von <strong> Arbeitsgruppe </strong> , geben Sie einen Arbeitsgruppennamen ein (z. B. &quot;ARBEITSGRUPPE&quot;) und klicken Sie auf <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-34-169.png\" alt=\"Change Computer Name - Membership\" loading=\"lazy\"></p> <p> 5. Geben Sie die Anmeldeinformationen des Administrators ein und klicken Sie auf <strong> OK </strong> . <br> 6. <strong> Neu starten </strong> der Computer. </p> <p> 7. Führen Sie die Schritte 1-4 erneut aus, aber diesmal wählen Sie bei Schritt-4 <strong> Domain, </strong> Geben Sie den Domainnamen ein und klicken Sie auf <strong> OK. </strong></p> <p><img src=\"images/image_thumb-38-928.png\" alt=\"Add computer to domain\" loading=\"lazy\"></p> <p> 8. Geben Sie die Anmeldeinformationen des Domänenadministrators ein und klicken Sie auf <strong> OK </strong> . <br> 9. <strong> Neu starten </strong> Ihren PC und melden Sie sich mit dem Domänenbenutzerkonto bei der Domäne an. </p> <h6> Methode 5. Computerkonto in Domäne zurücksetzen. </h6> <p> 1. Melden Sie sich beim Active Directory-Server an. <br> 2. Öffnen <strong> Aktive Verzeichnisse Benutzer und Computer. <br> </strong> 3. Erweitern Sie die <strong> Computers </strong> Container. <br> 4. Klicken Sie mit der rechten Maustaste auf den betroffenen Computer und wählen Sie <strong> Konto zurücksetzen. </strong></p> <p><img src=\"images/image_thumb-36-935.png\" alt=\"Reset Computer Account in Domain\" loading=\"lazy\"></p> <p> 5. Schließlich <strong> neu starten </strong> das <strong> betroffene Maschine </strong> und melden Sie sich in der Domäne an. </p> <p> Das war&#39;s Leute! Welche Methode hat bei Ihnen funktioniert? Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}