{"title":"UPDATE: XPS Viewer kann in Windows 10 nicht installiert werden (Gelöst)","content":"<p> In einem früheren Tutorial habe ich die erforderlichen Schritte erwähnt, um <a href=\"https://www.repairwin.com/how-to-install-xps-viewer-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> XPS Viewer unter Windows 10 installieren </a> . Einige Benutzer beschweren sich jedoch darüber, dass sie XPS Viewer nicht installieren können, weil der XPS Viewer nach dem Drücken der Schaltfläche „Funktion hinzufügen“ (Apps &gt; Optionale Funktionen verwalten &gt; Funktion hinzufügen) nicht aufgelistet wird oder nicht installiert werden kann. </p> <p> Dieses Tutorial enthält Anweisungen zur Behebung von Installationsproblemen des XPS-Viewers in den Versionen Windows 10 1803 und 1809. </p> <h4> So beheben Sie XPS Viewer-Installationsprobleme in Windows 10. </h4> <h6> Methode 1. Deinstallieren Sie Microsoft XPS Document Writer und installieren Sie es erneut. </h6> <p> 1. Öffnen <strong> Programme und Funktionen </strong> und dann klick <strong> Schalte Windows Funktionen ein oder aus </strong> . </p> <p><img src=\"images/image_thumb-61-948.png\" alt=\"FIX: Cannot Install XPS Viewer - Windows 10\" loading=\"lazy\"></p> <p> 2. <strong> Deaktivieren Sie </strong> das <strong> Microsoft XPS Document Writer-Box </strong> und schlagen <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-62-338.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Klicken Sie nun auf <strong> Schalte Windows Funktionen ein oder aus </strong> wieder und <strong> prüfen </strong> das <strong> Microsoft XPS-Dokumentenschreiber </strong> Kästchen und klick <strong> OK. <br> </strong> 4. <strong> Neu starten </strong> dein PC. <br> 5. Versuchen Sie, den XPS-Viewer zu installieren. </p> <p> </p> <h6> Methode 2. Installieren Sie XPS Viewer, indem Sie den DISM-Befehl verwenden. </h6> <p> 1. Öffnen <strong> Eingabeaufforderung als Administrator </strong> . <br> 2. Geben Sie in der Eingabeaufforderung den folgenden Befehl ein und drücken Sie <strong> Eingeben </strong> . </p> <ul> <li><strong> dism /Online /Add-Capability /CapabilityName:XPS.Viewer~~~~0.0.1.0 </strong></li> </ul> <p><img src=\"images/image_thumb-65-661.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Methode 3. Laden Sie XPS Viewer von Windows Update anstelle von WSUS herunter. (Windows 10 Pro und Enterprise). </h6> <p> Wenn Sie Windows 10 Pro oder Enterprise verwenden, führen Sie die folgenden Schritte im Gruppenrichtlinien-Editor aus. * </p> <p> * Hinweis: Wenn der Computer zu einer Domäne gehört, müssen Sie die Domänengruppenrichtlinieneinstellungen (GPO) ändern und dann den Befehl &quot;gpupdate /force&quot; ausführen, bevor Sie XPS Viewer installieren. </p> <p> 1. Öffnen Sie den Gruppenrichtlinien-Editor. Das zu tun: </p> <blockquote><p> 1. Drücken Sie gleichzeitig die Windows <img src=\"images/image_thumb36-656.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ <strong> gpedit.msc </strong> &amp; Drücken Sie <strong> Eingeben. </strong></p></blockquote> <p><img src=\"images/image_thumb-78-514.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Navigieren Sie im linken Bereich zu: </p> <ul> <li><strong> Computerkonfiguration </strong> -&gt; <strong> Administrative Vorlagen </strong> -&gt; <strong> System </strong></li> </ul> <p> 3. Doppelklicken Sie im rechten Bereich auf <strong> Legen Sie die Einstellungen für die Installation optionaler Komponenten und die Reparatur von Komponenten fest </strong></p> <p><img src=\"images/image_thumb-63-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Setzen Sie die Richtlinie auf <strong> aktiviert </strong> und dann überprüfe die <strong> Laden Sie Reparaturinhalte und optionale Funktionen direkt von Windows Update statt von Windows Server Update Services (WSUS) herunter. </strong> Box. </p> <p> 5. Wenn Sie fertig sind, klicken Sie auf <strong> Anwenden </strong> und <strong> OK </strong> und <strong> neu starten </strong> dein PC. </p> <p><img src=\"images/image_thumb-64-264.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Versuchen Sie nach dem Neustart, <a href=\"#install-xps-viewer-dism\" target=\"_blank\" rel=\"nofollow noopener\"> Installieren Sie den XPS Viewer mit der DISM-Methode </a> über. <br> 7. Öffnen Sie nach der Installation des XPS-Viewers den Gruppenrichtlinien-Editor und machen Sie die Änderungen rückgängig. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}