{"title":"UPDATE: Just-In-Time-Debugger In Outlook.exe oder einem anderen Programm ist eine unbehandelte Win32-Ausnahme aufgetreten. (Gelöst)","content":"<p> In diesem Lernprogramm finden Sie Anweisungen zum Stoppen des Dialogfelds Just-In-Time-Debugger. Das Dialogfeld &quot;Just-In-Time-Debugger: In Outlook.exe ist eine unbehandelte Win32-Ausnahme aufgetreten&quot; (oder in einem anderen Programm) wird angezeigt, da die im Dialogfeld gemeldete Anwendung nicht gestartet werden kann. </p> <p><img src=\"images/image_thumb-7-733.png\" alt=\"FIX: Just-In-Time Debugger An unhandled win32 exception occurred in Outlook.exe, or in another program\" loading=\"lazy\"></p> <p> Das Dialogfeld &quot;Just-In-Time-Debugger auswählen&quot; bietet Ihnen die Möglichkeit, Visual Studio zu starten, um den Fehler zu beheben. Wenn Visual Studio jedoch nicht installiert ist oder den Fehler nicht beheben kann, stürzt die gemeldete Anwendung ab und wird geschlossen. </p> <p> Wenn Sie verhindern möchten, dass der Dialog &quot;Just-In-Time-Debugger auswählen&quot; angezeigt wird, müssen Sie den Just-In-Time-Debugger deaktivieren, indem Sie die folgenden Anweisungen befolgen. </p> <h4> So stoppen Sie den Just-In-Time-Debugger. * </h4> <p> * Hinweis: Wenn beim Starten von Outlook das Dialogfeld &quot;Just-In-Time-Debugger – Es ist eine unbehandelte Win32-Ausnahme aufgetreten...&quot; angezeigt wird, wenden Sie die folgenden Aktionen an, bevor Sie mit den folgenden Methoden fortfahren: </p> <blockquote><p> 1. <a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Reparieren Sie die Outlook PST-Datendatei </a> und öffnen Sie dann Outlook. </p> <p> 2. <a href=\"https://www.repairwin.com/how-to-repair-office-2016-2013-2010-or-2007/\" target=\"_blank\" rel=\"nofollow noopener\"> Reparieren Sie die Office-Installation. </a></p></blockquote> <p> </p> <h6> Methode 1. Ändern Sie die Datenausführungsverhinderung (DEP) auf Standardeinstellungen. </h6> <p> 1. Rechtsklick auf <strong> Mein PC </strong> und wählen Sie <strong> Eigenschaften </strong> . <br> 2. Klicken Sie auf <strong> Erweiterte Systemeinstellungen </strong> links. </p> <p><img src=\"images/image_thumb-14-901.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Klicken Sie auf der Registerkarte &quot;Erweitert&quot; auf <strong> die Einstellungen </strong> im Abschnitt &#39;Leistung&#39;. </p> <p><img src=\"images/image_thumb-15-391.png\" alt=\"fix High CPU and DISK Usage Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Wählen Sie bei &#39;Leistungsoptionen&#39; die <strong> Verhinderung der Datenausführung </strong> Tab. <br> 5. Wählen Sie <strong> Aktivieren von DEP für Essentials nur für Essentials Windows-Programme und -Dienste </strong> und klicke <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-8-913.png\" alt=\"Turn On DEP for Essentials for Essentials Windows programs \" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Neu starten </strong> Ihren PC und überprüfen Sie, ob das Dialogfeld Just-In-Time-Debugger nicht mehr angezeigt wird. </p> <p> </p> <p> </p> <h6> Methode 2. Deaktivieren Sie den Just-In-Time-Debugger in Visual Studio. </h6> <p> Wenn Sie Visual Studio installiert haben, fahren Sie fort und deaktivieren Sie den Just-In-Time-Debugger in Visual Studio. Das zu tun: </p> <p> 1. Navigieren Sie zu <strong> Schalttafel </strong> -&gt; <strong> Programme und Funktionen. <br> </strong> 2. <strong> Markieren </strong> das <strong> Visual Studio </strong> und klicke <strong> Veränderung. </strong></p> <p><img src=\"images/image_thumb-10-917.png\" alt=\"Visual Studio - Turn off Just In Time Debugger\" loading=\"lazy\"><strong><br> </strong></p> <p> 3. Wählen Sie in einem neu geöffneten Fenster die <strong> Registerkarte Einzelkomponenten. <br> </strong> 4. <strong> Deaktivieren Sie </strong> das <strong> Just-in-Time-Debugger </strong> und klicke <strong> Ändern. </strong></p> <p><img src=\"images/image_thumb-11-499.png\" alt=\"How to Disable Just-In-Time Debugger in Visual Studio\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Methode 3. Deaktivieren Sie den Just-In-Time-Debugger aus der Registrierung. </h6> <p> 1. Öffnen Sie den Registrierungseditor. Das zu tun: </p> <blockquote><p> 1. Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-187.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Geben Sie im Feld &quot;Öffnen&quot; Folgendes ein: <strong> regedit </strong> &amp; klicken <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb7-250.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2. Finden und <strong> Löschen </strong> die folgenden Registrierungseinträge (in Fettdruck): </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\.NETFramework\\ <strong> DbgManagedDebugger </strong></li> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\AeDebug\\ <strong> Debugger </strong></li> </ul> <p><img src=\"images/image_thumb-12-426.png\" alt=\"Disable Just-In-Time Debugger from Registry\" loading=\"lazy\"></p> <p> </p> <p> 3. Wenn Sie ein 64-Bit-Betriebssystem haben, löschen Sie auch die folgenden Registrierungseinträge (in Fettdruck): </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Wow6432Node\\Microsoft\\.NETFramework\\ <strong> DbgManagedDebugger </strong></li> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Wow6432Node\\Microsoft\\Windows NT\\CurrentVersion\\AeDebug\\ <strong> Debugger </strong></li> </ul> <p> 4. Schließen Sie den Registrierungseditor und <strong> neu starten </strong> der Computer. <br> 5. Nach dem Neustart verschwindet der &quot;Just-In-Time Debugger – Eine unbehandelte Win32-Ausnahme ist aufgetreten...&quot;. </p> <p> * Hinweis: Wenn das Dialogfeld Just-In-Time-Debugger weiterhin angezeigt wird, navigieren Sie zu <strong> Schalttafel </strong> -&gt; <strong> Programme und Funktionen </strong> und <strong> deinstallieren </strong> das <strong> Microsoft Visual Studion 2010-Shell (isoliert </strong> ). </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}