{"title":"UPDATE: 2147219196 Dateisystemfehler in der Fotos-App in Windows 10 (Gelöst)","content":"<p> Auf einem Windows 10-basierten Computer mit der App &quot;Fotos&quot; als Standardanwendung zum Öffnen von Bildern erscheint der &quot;Dateisystemfehler &quot;-2147219196&quot;, wenn der Benutzer versucht, ein .JPG- oder .PNG-Bild (mit dem App). </p> <p><img src=\"images/image_thumb-73-456.png\" alt=\"FIX: 2147219196 File system error in Photos app \" loading=\"lazy\"></p> <p> </p> <p> Dieses Tutorial enthält Anweisungen zum Beheben des &quot;Dateisystemfehlers 2147219196&quot; beim Öffnen von Bildern in der Fotos-App in Windows 10. </p> <h4> So beheben Sie: Bilder können nicht mit der App &quot;Fotos&quot; in Windows 10 mit Fehler &quot;Dateisystemfehler 2147219196&quot; geöffnet werden. </h4> <p> Hinweis: Bevor Sie unten fortfahren, stellen Sie sicher, dass Ihr System vollständig aktualisiert ist. </p> <h6> Schritt 1. Führen Sie die Problembehandlung für Windows Store-Apps aus. </h6> <p> 1. Navigieren Sie zu <strong> Start </strong> -&gt; <strong> die Einstellungen </strong> -&gt; <strong> Update und Sicherheit </strong> . <br> 2. Wählen Sie <strong> Fehlerbehebung </strong> von links, und klicken Sie dann auf <strong> Fehlerbehebung für Windows Store-Apps </strong> rechts und klicke <strong> Führen Sie die Fehlerbehebung aus </strong> . </p> <p><img src=\"images/image_thumb-74-400.png\" alt=\"windows store apps troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 3. Folgen Sie den Anweisungen auf dem Bildschirm und lassen Sie die Problembehandlung die Probleme beheben. <br> 4. Wenn die Fehlerbehebung abgeschlossen ist, schließen Sie die Fehlerbehebung und versuchen Sie, eine Image-Datei zu öffnen. Wenn der Fehler weiterhin besteht, fahren Sie mit dem nächsten Schritt fort. </p> <p><img src=\"images/image_thumb-75-371.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Schritt 2. Reparieren Sie die Fotos-App oder setzen Sie sie zurück. </h6> <p> Wenn Sie &quot;2147219196&quot; erhalten, wenn Sie versuchen, eine .JPG- oder .PNG-Datei mit der Fotos-App zu öffnen, versuchen Sie, die App zu reparieren. Das zu tun: </p> <p> 1. Navigieren Sie zu <strong> Start </strong> -&gt; <strong> die Einstellungen </strong> -&gt; <strong> Apps. <br> </strong> 2. At <strong> App &amp; Funktionen, </strong> suchen und wählen Sie die <strong> Microsoft-Fotos </strong> und klicke <strong> Erweiterte Optionen. </strong></p> <p><img src=\"images/image_thumb-76-358.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Klicken Sie unter Erweiterte Optionen auf das <strong> Reparatur </strong> Taste. <br> 4. Wenn der Vorgang abgeschlossen ist, sehen Sie ein Häkchen <img src=\"images/image_thumb-77-553.png\" alt=\"image\" loading=\"lazy\"> neben der Schaltfläche &#39;Reparieren&#39;. Fahren Sie fort und überprüfen Sie, ob der &quot;Dateisystemfehler 2147219196&quot; behoben wurde, indem Sie ein Foto öffnen. <br> 5. Wenn das Problem weiterhin besteht, klicken Sie auf <strong> Zurücksetzen </strong> -Taste, um die Einstellungen der Fotos-App zurückzusetzen. </p> <p><img src=\"images/image_thumb-78-665.png\" alt=\"repair - reset photos app\" loading=\"lazy\"></p> <p> </p> <h6> Schritt 3. Entfernen Sie die Fotos-App vollständig und installieren Sie sie erneut. </h6> <p> Der nächste Schritt, um den &quot;Dateisystemfehler &quot;-2147219196&quot; in der Fotos-App zu beheben, besteht darin, die Entfernung von Ihrem System abzuschließen und die Fotos-App neu zu installieren. </p> <p> 1. Öffnen <strong> Power Shell </strong> wie <strong> Administrator </strong> . <br> 2. Geben Sie bei PowerShell den folgenden Befehl ein und drücken Sie <strong> Eingeben </strong> , um die Fotos-App vollständig zu entfernen: * </p> <ul> <li><strong> Get-AppxPackage *Fotos* | Remove-AppxPackage -allusers </strong></li> </ul> <p> *Info: Der obige Befehl deinstalliert die Fotos-App von Windows 10 und entfernt auch die Installationsdateien und die Reste der Fotos-App aus dem Verzeichnis &quot;C:\\Programme\\WindowsApps\\&quot;. </p> <p><img src=\"images/image_thumb-95-600.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Wenn der Befehl abgeschlossen ist, <strong> neu starten </strong> dein Computer. <br> 4. Öffnen Sie den Microsoft Store und installieren Sie <a href=\"https://www.microsoft.com/en-us/p/microsoft-photos/9wzdncrfjbh4#activetab=pivot:overviewtab\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft-Fotos </a> . </p> <p><img src=\"images/image_thumb-89-238.png\" alt=\"reinstall photos app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Klicken Sie auf <strong> Installieren, </strong> um die Fotos-App auf Ihrem System neu zu installieren. </p> <p><img src=\"images/image_thumb-90-948.png\" alt=\"install photos app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Wenn die Fotos-App installiert ist, öffnen Sie ein Bild. Der Fehler &quot;Dateisystemfehler 2147219196&quot; sollte behoben sein. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}