{"title":"UPDATE: Chrome-Problem mit hoher Speicherauslastung (Gelöst)","content":"<p> Wie Sie vielleicht schon bemerkt haben, öffnet Google Chrome viele Hintergrundprozesse, auch wenn Sie nur wenige Chrome-Fenster / -Tabs geöffnet haben. Dies liegt daran, dass Google Chrome so konzipiert ist, dass es für jedes installierte Plugin oder jede installierte Erweiterung einen individuellen Prozess erstellt, wenn Sie ein neues Fenster oder einen neuen Tab öffnen. </p> <p> Obwohl das Öffnen mehrerer Prozesse von Google Chrome aus ein normales Verhalten ist, ist es tatsächlich ein Problem, da dieses Verhalten eine hohe Speicherauslastung verursacht und den Computer nicht mehr reagiert. </p> <p><img src=\"images/image_thumb-17-610.png\" alt=\"FIX: Multiple Processes in Chrome with High Memory Usage\" loading=\"lazy\"></p> <p> </p> <p> Dieses Tutorial enthält Schritt-für-Schritt-Anleitungen, wie Sie verhindern können, dass Chrome mehrere Prozesse für jedes Fenster oder jeden Tab öffnet, um das Problem mit der hohen Speicherauslastung von Chrome zu beheben. </p> <h4> So deaktivieren Sie mehrere Chrome-Prozesse in Windows 10 </h4> <h6> Schritt 1. Scannen Sie Ihren Computer auf Malware und Viren. </h6> <p> Der erste Schritt vor der Behebung des Fehlers &quot;ERR_CONNECTION_CLOSED&quot; in Chrome besteht darin, sicherzustellen, dass Ihr System frei von Viren/Malware ist. Befolgen Sie für diese Aufgabe die Anweisungen in dieser Anleitung: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> So scannen Sie Ihren Computer auf Viren und andere bösartige Programme. </a></p> <h6></h6> <h6> Schritt 2. Deaktivieren Sie unerwünschte Chrome-Erweiterungen. </h6> <p> Überprüfen Sie zunächst, ob Sie alle installierten Chrome-Erweiterungen benötigen und deaktivieren Sie diejenigen, die Sie nicht benötigen. Das zu tun: </p> <p> 1. Aus dem Chrome-Menü <img src=\"images/image_thumb-47-380.png\" alt=\"image\" loading=\"lazy\"> , gehe zu <strong> Mehr Werkzeuge </strong> -&gt; <strong> Erweiterungen </strong></p> <p><img src=\"images/image_thumb-51-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Entfernen (oder deaktivieren) Sie alle Erweiterungen, die Sie nicht benötigen oder die Sie nicht kennen. </p> <p><img src=\"images/image_thumb-49-442.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Schritt 3. Verhindern, dass Chrome im Hintergrund ausgeführt wird, wenn Chrome geschlossen ist. </h6> <p> 1. Über das Chrome-Menü <img src=\"images/image_thumb-78-665.png\" alt=\"image\" loading=\"lazy\"> wählen <strong> die Einstellungen </strong> . </p> <p><img src=\"images/image_thumb-79-868.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> 2. At <strong> die Einstellungen </strong> Seite, scrollen Sie nach unten und klicken Sie auf <strong> Fortgeschritten </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <p> 3. Setzen Sie den Schalter &quot;Weitere Hintergrund-Apps ausführen, wenn Google Chrome geschlossen ist&quot; auf <strong> AUS </strong> . </p> <p><img src=\"images/image_thumb-18-557.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <p> </p> <h6> Schritt 4. Verhindern, dass Chrome mehrere Prozesse für dieselbe Site öffnet. </h6> <p> 1, <strong> Rechtsklick </strong> auf <strong> Google Chrome </strong> Verknüpfung und wählen Sie <strong> Eigenschaften </strong> . <br> 2. At <strong> Allgemeines </strong> Tab, fügen Sie am Ende der Zielzeile den Schalter &quot; –process-per-site&quot; (ohne Anführungszeichen) hinzu und klicken Sie auf <strong> OK </strong> und <strong> Fortsetzen </strong> um die Änderung zu übernehmen <strong> . * </strong></p> <p> z.B. &quot;C:\\Programme\\Google\\Chrome\\Application\\chrome.exe&quot; –Prozess-pro-Site </p> <p> Hinweis: Es gibt ein Leerzeichen vor –Prozess-pro-Site </p> <p><img src=\"images/image_thumb-19-818.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Schritt 5. Deaktivieren Sie die Google Chrome-Site-Isolierung. </h6> <p> Im Site Isolation-Modus lädt Chrome jede Website in einem eigenen Prozess. Dies ist in der Tat eine zusätzliche Sicherheitsfunktion, um zu verhindern, dass eine Website Ihre Daten von einer anderen Website stiehlt, die in einem anderen Fenster / Tab geöffnet ist. Der Modus &quot;Site Isolation&quot; erhöht jedoch die Speichernutzung von Chrome um etwa 10 %. </p> <p> 1. Geben Sie in der Chrome-Adressleiste ein <a href=\"//flags/#site-isolation-trial-opt-out\" target=\"_blank\" rel=\"nofollow noopener\"> chrome://flags/#site-isolation-trial-opt-out </a> und klicken Sie auf Enter. </p> <p> 2. Stellen Sie die <strong> Site-Isolierung deaktivieren </strong> Modus zu <strong> Deaktiviert </strong> und dann klick <strong> Jetzt neu starten </strong> . * </p> <p> * Hinweis: </p> <p><img src=\"images/image_thumb-20-397.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? </p> <p> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}