{"title":"UPDATE: Laufwerke wurden im Navigationsbereich von Windows 10 zweimal angezeigt (Gelöst)","content":"<p> In diesem Tutorial erhalten Sie Anweisungen, um das folgende seltsame Problem in Windows 10 zu beheben: Laufwerke werden im Navigationsbereich doppelt angezeigt. Das doppelte Erscheinungsbild von Laufwerken im Navigationsbereich ist eine neue Funktion von Windows 10, die dem Benutzer hilft, den Inhalt von das angeschlossene Laufwerk, ohne das Menü &quot;Dieser PC&quot; erweitern zu müssen. Aber dieses Feature wird nervig, denn wenn Sie das Menü &quot;Dieser PC&quot; geöffnet lassen, wird das gleiche Laufwerk zweimal im Navigationsbereich angezeigt. </p> <p><img src=\"images/image_thumb-22-749.png\" alt=\"Drives Displayed Twice in Navigation Pane of Windows 10\" loading=\"lazy\"></p> <p> Wenn Sie in Windows 10 doppelte Einträge Ihrer angeschlossenen USB-Laufwerke oder der Festplattenlaufwerke sehen, befolgen Sie die folgenden Anweisungen, um das Problem zu beheben. </p> <h4> So entfernen Sie die doppelten Laufwerksbuchstaben in Windows 10 Explorer (Navigationsmenü). </h4> <p> Um zu verhindern, dass Windows 10 ein angeschlossenes oder festes Laufwerk zweimal anzeigt, wenden Sie die folgende Registrierungsoptimierung an: </p> <p> 1. Öffnen Sie den Registrierungseditor. das zu tun: </p> <blockquote><p> 1. Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-493.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Geben Sie in das Suchfeld ein <strong> regedit </strong> und drücke <strong> Eingeben </strong> um den Registrierungseditor zu starten. </p></blockquote> <p><img src=\"images/image_thumb7-138.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Navigieren Sie dann zu diesem Registrierungsschlüssel: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Desktop\\NameSpace\\DelegateFolders </li> </ul> <p> 3. Klicken Sie dann mit der rechten Maustaste und löschen Sie die <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> Schlüssel. </p> <p><img src=\"images/image_thumb-23-428.png\" alt=\"remove duplicate drive entries windows 10 navigation pane\" loading=\"lazy\"></p> <p> </p> <p> 4. Navigieren Sie dann zu dieser Taste: * </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Desktop\\NameSpace\\DelegateFolders </li> </ul> <p> 5. Löschen Sie die <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> Schlüssel. </p> <p> 6. Schließen Sie den Registrierungseditor. </p> <p> * Hinweis: Wenn Sie den Schlüssel &quot;WOW6432Node&quot; nicht sehen können, ignorieren Sie die obigen Schritte 4 und 5, da sie nur für 64-Bit-Versionen von Windows 10 gelten. </p> <p><strong> TRINKGELD: </strong> Wenn Sie Ihre Entscheidung in Zukunft ändern, klicken Sie einfach mit der rechten Maustaste auf &#39;DelegateFolders&#39; an den oben genannten Registrierungsspeicherorten, wählen Sie <strong> Neu </strong> -&gt; <strong> Schlüssel </strong> , und erstellen Sie das gelöschte <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> Schlüssel). </p> <p> Das ist alles! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}