{"title":"UPDATE: DISM-Fehler 1009 Die Konfigurationsregistrierungsdatenbank ist beschädigt (Gelöst).","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben des folgenden Problems beim Ausführen des DISM-Befehls in Windows 10: &quot;Fehler 1009: Die Konfigurationsregistrierungsdatenbank ist beschädigt&quot;. Der DISM-Fehler 1009 kann auftreten, wenn Sie versuchen, ein Windows-Image mit einer beschädigten (beschädigten) Registrierung zu reparieren, indem Sie einen der folgenden DISM-Befehle in der Eingabeaufforderung verwenden: </p> <ul> <li> Dism /Online /Cleanup-Image /Restorehealth </li> <li> Dism /Online /Cleanup-image /Restorehealth /source:wim:X:\\sources\\install.wim:1 /LimitAccess </li> </ul> <p> …oder bei Verwendung des DISM-Befehls in der Windows-Wiederherstellungsumgebung (WinRE) </p> <ul> <li> Dism.exe /Image:X:\\ /Cleanup-Image /Restorehealth </li> </ul> <p> </p> <h4> So beheben Sie den DISM-Fehler 1009: Die Registrierungsdatenbank ist beschädigt. </h4> <p><strong> Bedarf </strong> : Um den Fehler dism 1009 zu beheben, müssen Sie Ihren Computer von einem Windows-Installationsmedium (USB oder DVD) booten. Wenn Sie kein Windows-Installationsmedium besitzen, können Sie eines erstellen, indem Sie verwenden <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Das Media Creation-Tool von Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> So erstellen Sie ein Windows 10 USB-Installationsmedium. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> So erstellen Sie ein Windows 10-DVD-Installationsmedium. </a></li> </ul> <p> </p> <h6> Methode 1. Stellen Sie Windows 10 so wieder her, wie es vor der Installation der Updates war. </h6> <p> Der DISM-Fehler 1009 tritt normalerweise nach einer erfolglosen Installation eines Windows-Updates auf. Brechen Sie also zunächst die Installation der Updates ab. Das zu tun: </p> <p> 1. Booten Sie Ihr System von einem Windows-Installationsmedium. <br> 2. Drücken Sie im unteren Bildschirm die <strong> VERSCHIEBUNG </strong> + <strong> F10 </strong> Tasten zum Starten der Eingabeaufforderung. (oder klicke <strong> Nächster </strong> und gehe zu <strong> Meinen Computer reparieren </strong> &gt; <strong> Fehlerbehebung </strong> &gt; <strong> Eingabeaufforderung </strong> ). </p> <p><img src=\"images/image_thumb-72-743.png\" alt=\"FIX DISM Error 1009 -The configuration registry database is corrupt\" loading=\"lazy\"></p> <p> </p> <p> 3. Rufen Sie an der Eingabeaufforderung mit diesem Befehl eine Liste aller Laufwerke auf Ihrem System ab: </p> <ul> <li><strong> Wmic Logicaldisk Name abrufen </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-491.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> 4. Finden Sie dann heraus, welches Laufwerk den Ordner &quot;Windows&quot; enthält, indem Sie diesen Befehl eingeben: * </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * z.B. Um den Inhalt des Laufwerks C: anzuzeigen, geben Sie Folgendes ein: &quot; <strong> dir C: </strong> &quot; (ohne Anführungszeichen). Wenn Sie den Ordner &quot;Windows&quot; auf Laufwerk C: nicht sehen können, fahren Sie mit dem nächsten Laufwerksbuchstaben fort (zB &quot;dir D:&quot;, &quot;dir E:&quot;, etc.), bis Sie das Ordner &quot;Windows&quot; auf einem der aufgelisteten Laufwerke (aus dem obigen Befehl). </p> <p> [Wie Sie im Screenshot unten sehen können, befindet sich der Windows-Ordner (in diesem Fall) auf Laufwerk D:.] </p> <p> </p> <p><img src=\"images/image_thumb-69-704.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Sobald Sie gefunden haben, auf welchem ​​Laufwerk sich das &quot;Windows&quot;-Laufwerk befindet (in diesem Beispiel beispielsweise auf Laufwerk &quot;D:&quot;), navigieren Sie zu diesem Laufwerk, indem Sie DriveLetter . eingeben <strong> : </strong> + <strong> Eingeben </strong> . </p> <p> 6. Erstellen Sie dann einen Scratch-Ordner auf dem Laufwerk, indem Sie diesen Befehl eingeben: </p> <ul> <li><strong> mkdir D:\\Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-186.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Geben Sie dann den folgenden Befehl ein, um Ihr System nach dem erfolglosen Update zurückzusetzen: </p> <ul> <li><strong> DISM /Image:D:\\ /ScratchDir:D:\\Scratch /Cleanup-Image /RevertPendingActions </strong></li> </ul> <p> * Hinweis: Ändern Sie den Laufwerksbuchstaben <strong> D </strong> nach deinem fall. </p> <p> 8. Sobald der obige DISM-Befehl ausgeführt wurde, sollten Sie die folgende Meldung auf dem Bildschirm erhalten: </p> <p><em> &quot;Ausstehende Aktionen aus dem Bild werden rückgängig gemacht…. <br> Der Vorgang wurde abgeschlossen. Nach dem Neustart wird versucht, ausstehende Aktionen rückgängig zu machen <br> Der Vorgang wurde erfolgreich abgeschlossen.&quot; </em></p> <p><img src=\"images/image_thumb-71-222.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. <strong> Schließen </strong> Eingabeaufforderung und <strong> neu starten </strong> dein Computer. * </p> <p> 10. Wenn Windows normal bootet, fahren Sie mit Ihrer Arbeit fort. Wenn Windows nicht startet und erneut versucht, die Updates zu installieren, dann: </p> <blockquote><p> 1. Schalten Sie Ihren PC aus. <br> 2. Starten Sie Ihren Computer erneut vom Windows-Installationsmedium. <br> 3. Starten Sie die Eingabeaufforderung. <br> 4. Geben Sie an der Eingabeaufforderung die folgenden Befehle der Reihe nach ein (vergessen Sie nicht, den Laufwerksbuchstaben zu ändern <strong> D </strong> je nach Fall): </p></blockquote> <ul> <li> <ul> <li> del D:\\Windows\\SoftwareDistribution </li> <li> del D:\\Windows\\WinSxS\\cleanup.xml </li> <li> del D:\\Windows\\WinSxS\\pending.xml </li> </ul> </li> </ul> <blockquote><p> 5. Wenn Sie fertig sind, schließen Sie die Eingabeaufforderung und <strong> neu starten </strong> dein PC. * </p></blockquote> <p> * Hinweis: Wenn der Bootvorgang erneut fehlschlägt, dann booten Sie erneut über die WinRE-Eingabeaufforderung und geben Sie die folgenden Befehle ein (vergessen Sie nicht, den Laufwerksbuchstaben zu ändern <strong> D </strong> je nach Fall): </p> <ul> <li> chkdsk /f D: </li> <li> sfc /scannow /offbootdir=D:\\ /offwindir=D:\\windows </li> <li> dism /image:D:\\ /cleanup-image /restorehealth <ul></ul> </li> </ul> <p> </p> <h6> Methode 2. Wiederherstellen der Windows-Registrierung aus der Sicherung. </h6> <p> Die nächste Methode zum Beheben des Dism-Fehlers 1009 besteht darin, die Windows-Registrierung aus dem Ordner „RegBack“ wiederherzustellen. * </p> <p> * Info: Der Ordner &#39;RegBack&#39; (vollständiger Pfad=Windows\\System32\\Config\\RegBack) ist der Ort, an dem Windows beim Starten des Computers automatisch eine Sicherungskopie der Registrierungsdateien speichert. </p> <p> So stellen Sie die Registrierung aus dem RegBack-Ordner wieder her: </p> <p> 1. Starten Sie Ihr System von einem Windows-Installationsmedium und befolgen Sie dann die Schritte 1-5 von Methode-1 oben, um zum Windows-Laufwerk zu navigieren. (z. B. das &quot;D:&quot; in diesem Beispiel). </p> <p> 2. Erstellen Sie zunächst eine Sicherungskopie der aktuellen Registrierungsdateien, indem Sie die folgenden Befehle der Reihe nach ausführen. (Drücken Sie <strong> Eingeben </strong> nach der Eingabe jedes Befehls): </p> <ul> <li><strong> cd \\windows\\system32\\config </strong></li> <li><strong> md-Backup </strong></li> <li><strong> *.* Backup kopieren </strong></li> </ul> <p><img src=\"images/image_thumb-26-678.png\" alt=\"infinite Automatic Repair loop windows 10 fix\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Navigieren Sie nun zu <strong> RegBack </strong> Ordner mit diesem Befehl: </p> <ul> <li><strong> CD RegBack </strong></li> </ul> <p> 4. Dann tippe <strong> DIR </strong> (um den Inhalt des RegBack-Ordners anzuzeigen). </p> <p> 5. Sehen Sie nun, ob eine der aufgelisteten Dateien <strong> 0</strong> (null) Bytes in ihrer Dateigröße und gehen Sie je nach Fall wie folgt vor: </p> <ul> <li><strong> Fall A. </strong> Wenn eine der aufgelisteten Dateien 0 (Null) Byte in ihrer Größe hat, dann <strong> Halten Sie hier an </strong> , und <strong> weiter zur nächsten Methode </strong> , da die Sicherungsdateien der Registrierung nutzlos oder beschädigt sind. </li> <li><strong> Fall B. </strong> Wenn alle aufgelisteten Dateien eine andere Größe als Null haben (wie im Screenshot unten), fahren Sie mit dem nächsten Schritt fort. </li> </ul> <p><img src=\"images/image_thumb-27-525.png\" alt=\"restore registry from backup\" loading=\"lazy\"></p> <p> </p> <p> 6. Kopieren Sie die Registrierungsdateien vom <strong> Windows\\System32\\Config\\RegBack </strong> Ordner zu <strong> Windows\\System32\\Config\\ </strong> Ordner, indem Sie diesen Befehl eingeben: </p> <p> </p> <ul> <li><strong> Kopieren *.* .. </strong></li> </ul> <p> 7. Wenn Sie dazu aufgefordert werden, drücken Sie <strong> EIN </strong> um die Dateien im Ziel zu überschreiben, nachdem Sie den Kopierbefehl gegeben haben. </p> <p><img src=\"images/image_thumb-28-138.png\" alt=\"fix startup repair loop\" loading=\"lazy\"></p> <p> </p> <p> 8. Wenn der Kopiervorgang abgeschlossen ist, geben Sie <strong> Ausfahrt </strong> und drücke <strong> Eingeben </strong> um die Eingabeaufforderung zu schließen. <br> 9. <strong> Neu starten </strong> Ihren Computer und versuchen Sie, von Windows zu booten. </p> <p> * Hinweis: Wenn Windows erneut nicht booten kann, dann booten Sie erneut über die WinRE-Eingabeaufforderung und geben Sie die folgenden Befehle ein (vergessen Sie nicht, den Laufwerksbuchstaben zu ändern <strong> D </strong> je nach Fall): </p> <ul> <li> chkdsk /f D: </li> <li> sfc /scannow /offbootdir=D:\\ /offwindir=D:\\windows </li> <li> dism /image:D:\\ /cleanup-image /restorehealth </li> </ul> <p> </p> <h6> Methode 3. Wiederherstellen von Windows 10 in einem früheren Arbeitszustand. </h6> <p> Die nächste Methode zum Beheben des Dism-Fehlers &quot;1009 – Die Konfigurationsdatenbank ist beschädigt&quot; besteht darin, Ihr System in einen früheren Arbeitszustand zurückzusetzen. Das zu tun: </p> <p> 1. Booten Sie Ihr System vom Windows-Installationsmedium. <br> 2. Klicken Sie im unteren Bildschirm auf <strong> Nächster </strong> und dann klick <strong> Deinen Computer reparieren </strong> &gt; <strong> Fehlerbehebung. </strong></p> <p><img src=\"images/image_thumb-73-301.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. At <strong> Erweiterte Optionen </strong> klicken <strong> Systemwiederherstellung. * </strong></p> <p> * Hinweis: Wenn die <strong> Zurück zu einem vorherigen Build </strong> Option, ist auf diesem Bildschirm verfügbar, dann wählen Sie diese Option. </p> <p><img src=\"images/image_thumb-76-326.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Klicken Sie im nächsten Bildschirm auf Ihr Betriebssystem. </p> <p><img src=\"images/image_thumb-77-265.png\" alt=\"image\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 5. Klicken Sie dann im Systemwiederherstellungsassistenten auf <strong> Nächster </strong> und wählen Sie dann einen früheren Arbeitsstatus (Datum/Uhrzeit) und klicken Sie auf <strong> Nächster </strong> um den Wiederherstellungsprozess zu starten. </p> <p><img src=\"images/image_thumb-50-788.png\" alt=\"system restore windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Methode 4. Reparieren Sie Windows 10. </h6> <p> Die letzte Methode zum Beheben von Dism-Fehlern besteht darin, <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Reparieren Sie Windows 10 mit In-Place-Upgrade </a> oder um Ihre Dateien zu sichern und dann zu <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Neuinstallation von Windows 10 </a> . </p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}