{"title":"UPDATE: Design kann nicht geändert werden – Aero-Designs in Windows 7 ausgegraut (Gelöst)","content":"<p> Das folgende Problem ist bei einem Windows 7-basierten Computer aufgetreten: Windows hat zum Basisdesign gewechselt und der Benutzer kann das Design nicht ändern, da beim Öffnen der Personalisierungseinstellungen alle Aerodesigns ausgegraut sind. Stattdessen sind alle anderen Einstellungen im Personalisierungsfenster aktiviert (Desktop-Hintergrund, Windows-Farbe, Bildschirmschoner usw.), erwarten Sie, dass Sie ein anderes Thema auswählen. </p> <p><img src=\"images/image_thumb-28-129.png\" alt=\"Cannot Change Theme – Themes Greyed Out\" loading=\"lazy\"></p> <p> </p> <p> Dieses Tutorial enthält Anweisungen zum Beheben des folgenden Problems in Windows 7: Design kann nicht geändert werden – Designs ausgegraut. </p> <h4> So beheben Sie: Design kann nicht geändert werden – Aero-Designs sind ausgegraut. </h4> <h6> Methode 1. Scannen Sie Ihr System auf Viren und Malware. </h6> <p> Der erste Schritt zur Behebung des Problems „Grunddesign kann nicht geändert werden“ besteht darin, sicherzustellen, dass Ihr System frei von Viren/Malware ist. Befolgen Sie für diese Aufgabe die Anweisungen in dieser Anleitung: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> So scannen Sie Ihren Computer auf Viren und andere bösartige Programme. </a></p> <h6> Methode 2. Starten Sie den Designdienst neu. </h6> <p> 1. Öffnen Sie die Systemsteuerung der Windows-Dienste: Um das zu tun: </p> <ul> <li> Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-720.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. </li> <li> Geben Sie in das Suchfeld Folgendes ein: <strong><em> dienste.msc </em></strong> &amp; klicken <strong> OK </strong> . </li> <li> (Akzeptieren Sie die UAC-Warnung, falls angezeigt). </li> </ul> <p><img src=\"images/image_thumb-12-580.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. Klicken Sie in der Systemsteuerung der Dienste mit der rechten Maustaste auf das <strong> Themen </strong> Service und Auswahl <strong> Neu starten </strong> . * </p> <p> * Hinweis: Wenn der Dienst gestoppt ist, klicken Sie auf <strong> Start </strong> . </p> <p><img src=\"images/image_thumb-29-242.png\" alt=\"Themes Greyed Out - restart theme service\" loading=\"lazy\"></p> <p> </p> <h6> Methode 3. Aktivieren Sie visuelle Stile für Fenster und Schaltflächen. </h6> <p> 1. Klicken Sie auf das <strong> Start </strong> Taste, Rechtsklick auf <strong> Computer a </strong> und wählen Sie <strong> Eigenschaften </strong> . </p> <p><img src=\"images/image_thumb-30-382.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2.  Klicken <strong> Erweiterte Systemeinstellungen </strong> links. </p> <p><img src=\"images/image_thumb-31-876.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Klicken Sie auf der Registerkarte &quot;Erweitert&quot; auf <strong> die Einstellungen </strong> im Abschnitt &#39;Leistung&#39;. </p> <p><img src=\"images/image_thumb-15-696.png\" alt=\"fix High CPU and DISK Usage Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. At <strong> Visuelle Effekte </strong> Aktivieren Sie die Option &quot;Visuelle Stile für Fenster und Schaltflächen verwenden&quot; und klicken Sie auf <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-32-631.png\" alt=\"fix Theme cannot be changed - themes greyed out\" loading=\"lazy\"></p> <p> </p> <h6> Methode 4. Installieren Sie die neusten Bildschirmtreiber. </h6> <p><strong> 1. </strong> Navigieren Sie zu <strong> Schalttafel </strong> &gt; <strong> Programme und Funktionen </strong> und <strong> deinstallieren </strong> den aktuell installierten VGA-Treiber. </p> <p><strong> 2. </strong> Wenn der Deinstallationsvorgang abgeschlossen ist <strong> neu starten </strong> dein Computer. </p> <p><strong> 3. </strong> Navigieren Sie nach dem Neustart zur Support-Site Ihres Computerherstellers, um die neuesten Treiber für Ihre Grafikkarte herunterzuladen und zu installieren. Wenn Sie einen Desktop- oder Laptop*-Computer mit einer AMD/ATI- oder NVIDIA-VGA-Karte besitzen, führen Sie die folgenden Schritte aus, um die neueste Treiberversion für Ihre Grafikkarte zu finden, herunterzuladen und zu installieren. </p> <p><strong> * Hinweis: </strong> Wenn Sie die Treiber unter den folgenden Links nicht finden können, navigieren Sie zur Support-Site Ihres Computerherstellers. </p> <p> </p> <p><strong> Für NVIDIA-basierte GPUs. </strong></p> <ol> <li> <ol> <li> Gehe zu <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Seite für die erweiterte NVIDIA-Treibersuche </a> und suchen Sie nach dem entsprechenden Treiber für Ihren Anzeigeadapter. </li> <li> Laden Sie auf der Suchergebnisseite eine frühere Treiberversion herunter. </li> <li> Installieren Sie den heruntergeladenen Treiber und starten Sie Ihren Computer neu. </li> </ol> </li> </ol> <p> </p> <p><strong> Für AMD-basierte GPUs. </strong></p> <ul> <li> <ol> <li> Gehe zu <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> AMD (ATI) Treiber herunterladen </a> und suchen Sie nach dem entsprechenden Treiber für Ihren Anzeigeadapter. </li> <li> Drücken Sie auf der Suchergebnisseite die <strong> Frühere Treiber und Software </strong> rechts verlinken. </li> <li> Installieren Sie den heruntergeladenen Treiber und starten Sie Ihren Computer neu. </li> </ol> </li> </ul> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}