{"title":"UPDATE: Es ist nicht genügend Speicherplatz verfügbar, um diesen Befehl zu verarbeiten – Kann nicht auf freigegebene Ordner zugreifen oder Remotedesktop verwenden (Gelöst)","content":"<p> Der Fehler &quot;Nicht genügend Speicherplatz für die Verarbeitung dieses Befehls verfügbar&quot; kann auftreten, wenn Sie versuchen, auf freigegebene Ordner auf einer anderen Windows-Workstation oder einem Server 2003, 2008, 2012 oder 2016 zuzugreifen oder wenn Sie die Remotedesktopverbindung ), um eine Verbindung zu einem anderen Windows-Computer (Workstation oder Server) herzustellen. </p> <p><img src=\"images/image_thumb-127.png\" alt=\"Not enough storage is available to process this command\" loading=\"lazy\"></p> <p> </p> <p> Dieses Tutorial enthält Anweisungen zur Behebung der folgenden Probleme, die bei allen Windows-Versionen auftreten können (Windows 10, 8/8.1, 7, Vista, XP &amp; Windows Server 2003, 2008, 2012 oder 2016): </p> <p> 1. Wenn Sie versuchen, auf die freigegebenen Ordner auf dem Servercomputer zuzugreifen, erhalten Sie die Fehlermeldung: &quot; <em> Freigegebenen Ordner </em> ist nicht zugänglich. Möglicherweise sind Sie nicht berechtigt, diese Netzwerkressource zu verwenden. Wenden Sie sich an den Administrator dieses Servers, um herauszufinden, ob Sie über Zugriffsberechtigungen verfügen. Es ist nicht genügend Serverspeicher verfügbar, um diesen Befehl zu verarbeiten.&quot; </p> <p> 2. Wenn Sie versuchen, eine Remote-Verbindung (mithilfe von RDP) zu einem anderen Windows-basierten Computer herzustellen, erhalten Sie die Fehlermeldung: &quot;Das System kann Sie aus folgendem Grund nicht anmelden. Nicht genügend Speicherplatz für die Verarbeitung dieses Befehls verfügbar&quot;. </p> <h4> WIE MAN BEHEBT: Fehlermeldung &quot;Nicht genügend Speicherplatz zum Verarbeiten dieses Befehls&quot; in Remote Desktop (RDP) oder beim Versuch, auf freigegebene Ordner zuzugreifen. </h4> <p> Auf dem Windows-&quot;Server&quot;-Rechner, auf dessen Dateien Sie zugreifen oder eine Remote-Verbindung herstellen möchten: </p> <p><strong> 1. </strong> Drücken Sie &quot; <strong> Fenster </strong> ” + “ <strong> R </strong> ”-Tasten zum Öffnen der <em> LAUF </em> Fenster. <br> <strong> 2. </strong> Art <strong> regedit </strong> und drücke <strong> Eingeben </strong> um den Registrierungseditor zu öffnen. </p> <p><img src=\"images/image_thumb7-649.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Navigieren Sie dann zu diesem Schlüssel: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\LanmanServer\\Parameters </strong></li> </ul> <p><img src=\"images/image_thumb-1-198.png\" alt=\"fix Not enough storage - cannot access shared items\" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Doppelklicken Sie im rechten Fensterbereich, um das <strong> IRPStackGröße </strong> Wert <strong> . * </strong></p> <p><strong> * Hinweis: </strong> Wenn Sie das nicht sehen <strong> IRPStackGröße </strong> Wert, dann: </p> <p> </p> <blockquote><p> 1. Klicken Sie mit der rechten Maustaste auf eine leere Stelle (im rechten Fensterbereich) und wählen Sie dann <strong> Neu </strong> –&gt; <strong> DWORD (32-Bit)-Wert </strong></p> <p><img src=\"images/image_thumb-2-236.png\" alt=\"fix Not enough storage using RDP (Remote Desktop)\" loading=\"lazy\"></p> </blockquote> <blockquote><p> 2. Benennen Sie den neuen Wert <strong> IRPStackGröße </strong> und schlagen <strong> Eingeben. </strong></p></blockquote> <p><strong> 5. </strong> Wählen <strong> Dezimal </strong> , ändern Sie die Wertdaten zu <strong> 50 </strong> und klicke <strong> OK </strong> . * </p> <p> * Hinweis: Der Bereich (dezimal) für den Parameter liegt zwischen 1 und 50. </p> <p><img src=\"images/image_thumb-3-255.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 6. </strong> <strong> Schließen </strong> Registrierungseditor und <strong> neu starten </strong> der Kellner. * </p> <p> * Wichtiger Hinweis: Wenn Sie nach dem Neustart dieselbe Fehlermeldung erhalten, wenn Sie die Remotedesktopverbindung verwenden oder versuchen, auf die freigegebenen Dateien auf einem anderen Computer zuzugreifen, wenden Sie die obige Registrierungsänderung auch auf Ihren Computer an. </p> <p> Das ist alles! Hat es bei dir funktioniert? </p> <p> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}