{"title":"UPDATE: Die Option Touchpad deaktivieren fehlt in den Touchpad-Einstellungen unter Windows 10.","content":"<p> Wenn Sie einen Laptop mit Windows 10 verwenden und die Option Touchpad deaktivieren in den Touchpad-Einstellungen fehlt, fahren Sie unten fort, um das Problem zu beheben. </p> <p> Wie Sie vielleicht wissen, müssen Sie Ihr Touchpad beim Arbeiten mit einer externen USB-Maus auf Ihrem Windows 10-Laptop nicht aktiviert lassen, um das Tippen zu erleichtern. Aus diesem Grund können Sie bei den meisten Laptops das Touchpad-Gerät einfach ausschalten (deaktivieren), wenn es nicht benötigt wird, indem Sie eine der folgenden Methoden verwenden: </p> <ol> <li> Durch Drücken einer Funktionstaste (z. B. F3, F4 usw.), mit oder ohne Drücken der <strong> Fn </strong> Schlüssel gleichzeitig. </li> <li> Durch Doppeltippen auf die obere linke Ecke der Touchpad-Oberfläche. (Wenn Ihr Touchpad diese Option unterstützt). </li> <li> Durch Drücken des Ein-/Aus-Schlüsselschalters für das Touchpad. (wenn Ihr Laptop einen solchen Schlüssel hat). </li> <li> Durch Deaktivieren des Touchpads oder Deaktivieren des Touchpads bei angeschlossener Maus in den Windows 10 Touchpad-Einstellungen: </li> </ol> <ul> <li><strong> Start </strong><img src=\"images/image_thumb2_thumb_thumb-929.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> Menü -&gt; <strong> die Einstellungen </strong> <img src=\"images/image_thumb-66-954.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Geräte </strong> -&gt; <strong> Touchpad. </strong></li> </ul> <p><img src=\"images/image_thumb-52-210.png\" alt=\"Turn Off Touchpad Windows 10\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> Auf einigen Windows 10-Laptops gibt es jedoch keine Möglichkeit, das Touchpad aus- oder zu deaktivieren, und viele Benutzer suchen nach einer Lösung für dieses Problem. </p> <p><img src=\"images/image_thumb-42-622.png\" alt=\"Disable Touchpad option missing Windows 10\" loading=\"lazy\"></p> <p> In diesem Tutorial finden Sie Schritt-für-Schritt-Anleitungen, wie Sie das Touchpad unter Windows 10 deaktivieren, wenn der Touchpad-Schalter &quot;Ein-/Ausschalten&quot; und die Optionen &quot;Touchpad eingeschaltet lassen, wenn eine Maus angeschlossen ist&quot; fehlen. </p> <h2> So beheben Sie: Keine Option zum Deaktivieren des Touchpads unter Windows 10. </h2> <h3> Methode 1. Deaktivieren Sie das Touchpad über die Mauseinstellungen in der Systemsteuerung unter Windows 10. </h3> <p> 1. Scrollen Sie in den Touchpad-Einstellungen etwas nach unten und klicken Sie auf <strong> Zusätzliche Einstellungen </strong> im Abschnitt &quot;Zugehörige Einstellungen&quot;. </p> <p> * Alternativ navigieren Sie zu <strong> Schalttafel </strong> und öffne die <strong> Maus </strong> Eigenschaften. </p> <p><img src=\"images/image_thumb-53-308.png\" alt=\"Touchpad additional settings\" loading=\"lazy\"></p> <p> </p> <p> 2. Auf der Registerkarte Touchpad-/Clickpad-Einstellungen: </p> <p> ein. Klicken <strong> ClickPad deaktivieren </strong> um das Touchpad vollständig zu deaktivieren* oder… </p> <p> * Hinweis: Wenden Sie diese Einstellung nur an, wenn Sie immer eine externe USB-Maus verwenden. </p> <p> b. <strong> Prüfen </strong> das Kontrollkästchen <strong> Deaktivieren Sie das interne Zeigegerät, wenn ein externes USB-Zeigegerät angeschlossen ist. </strong> um das Touchpad auszuschalten, wenn Sie Ihre Maus anschließen. </p> <p><img src=\"images/image_thumb-37-193.png\" alt=\"Disable Touchpad from Mouse settings Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h3> Methode 2. Aktivieren Sie alle Touchpad-Funktionen in Windows 10, indem Sie die Precision Touchpad-Treiber von Microsoft installieren. </h3> <p> Wenn Sie alle verfügbaren Windows 10-Touchpad-Funktionen nutzen möchten, können Sie die Precision Touchpad-Treiber von Microsoft installieren. * </p> <p><strong> * Hinweise (Wichtig): </strong> <strong> Bevor Sie mit den folgenden Schritten fortfahren, wird Folgendes empfohlen: </strong><br> 1. <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Einen Wiederherstellungspunkt erstellen </a> , um Windows 10 wiederherzustellen, wenn etwas schief geht. <br> 2. Verwenden Sie eine externe USB-Maus, falls das Touchpad nach der Installation der Precision Touchpad-Treiber nicht funktioniert. </p> <p><strong> So installieren Sie die Precision Touchpad-Treiber von Microsoft in Windows 10. </strong></p> <p><strong> Schritt 1. Laden Sie die Precision Touchpad-Treiber herunter. </strong></p> <p> 1. Laden Sie die Precision Touchpad-Treiber von einem der folgenden Speicherorte auf Ihren PC herunter: </p> <ul> <li> Von der Support-Site des Herstellers des Laptops. </li> <li> Wenn Sie ein Synaptics TouchPad-Gerät besitzen, laden Sie die <a href=\"https://www.anrdoezrs.net/links/3607085/type/am/sid/325347/https://download.lenovo.com/pccbbs/mobiles/n1mgx14w.zip\" target=\"_blank\" rel=\"nofollow noopener\"> Synaptics-Treiber von Lenovo </a> . </li> <li> Wenn Sie ein ELAN TouchPad-Gerät besitzen, laden Sie die <a href=\"https://drivers.softpedia.com/get/Other-DRIVERS-TOOLS/Others/ELAN-Input-Device-for-WDF-Driver-161132-for-Windows-10-64-bit.shtml\" target=\"_blank\" rel=\"nofollow noopener\"> ELAN-Treiber von Softpedia </a> . </li> </ul> <p> 2. Wenn der Download abgeschlossen ist, extrahieren Sie die heruntergeladene ZIP-Datei. </p> <p> </p> <p> Schritt 2 Installieren Sie die Precision Touchpad-Treiber in Windows 10. </p> <p> 1. Öffnen <strong> Gerätemanager </strong> . Das zu tun: </p> <blockquote><p> 1. Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-117.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Geben Sie im Feld &quot;Öffnen&quot; Folgendes ein: <strong> devmgmt.msc </strong> &amp; klicken <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-5-851.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Erweitern Sie die Mäuse und andere Zeigegeräte. <br> 3. <strong> Rechtsklick </strong> auf der <strong> TouchPad </strong> Gerät und wählen Sie <strong> Treiber aktualisieren. </strong></p> <p><img src=\"images/image_thumb-43-313.png\" alt=\"Update Touchpad driver\" loading=\"lazy\"></p> <p> </p> <p> 4. Klicken Sie auf <strong> Durchsuchen Sie meinen Computer nach Treibern. </strong></p> <p><img src=\"images/image_thumb-44-267.png\" alt=\"How to install Precision Touchpad Drivers in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 5. Klicken Sie im nächsten Bildschirm auf <strong> Lassen Sie mich aus einer Liste verfügbarer Treiber auf meinem Computer auswählen. </strong></p> <p><img src=\"images/image_thumb-45-900.png\" alt=\"How to install Microsoft's Precision Touchpad Drivers in Windows 10.\" loading=\"lazy\"></p> <p> 6. Klicken Sie auf <strong> Diskette haben. </strong></p> <p><img src=\"images/image_thumb-46-401.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 7. Navigieren Sie zu dem Ordner, in den Sie die heruntergeladene ZIP-Datei in Schritt 1 extrahiert haben. <br> 8. Wählen Sie die <strong> Autoru </strong> n Datei und klicken Sie auf <strong> Öffnen </strong> und dann klick <strong> OK. </strong></p> <p><img src=\"images/image_thumb-47-271.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. Wählen Sie die <strong> Synaptics Zeigegerät </strong> (oder das „ELAN-Zeigegerät“) aus der Liste der Modelle und klicken Sie auf <strong> Nächster. </strong></p> <p><img src=\"images/image_thumb-48-797.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. Klicken Sie bei der Warnmeldung Treiber aktualisieren auf <strong> Ja. </strong></p> <p><img src=\"images/image_thumb-49-287.png\" alt=\"image\" loading=\"lazy\"></p> <p> 11. Lassen Sie Windows die neuen Treiber installieren und klicken Sie dann auf <strong> Schließen </strong> . </p> <p><img src=\"images/image_thumb-50-445.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. <strong> Neustart </strong> dein PC. </p> <p> 13. Navigieren Sie nach dem Booten von Windows 10 zu <strong> Start </strong><img src=\"images/image_thumb2_thumb_thumb-914.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> Menü -&gt; <strong> die Einstellungen </strong> <img src=\"images/image_thumb-66-325.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Geräte </strong> -&gt; <strong> Touchpad. </strong></p> <p> 14. Wenn alles reibungslos gelaufen ist, sollten Sie alle verfügbaren Touchpad-Einstellungen in Windows 10 sehen. </p> <p><img src=\"images/image_thumb-51-998.png\" alt=\"Turn Touchpad ON-OFf in Windows 10\" loading=\"lazy\"></p> <p> Das war&#39;s Leute! Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}