{"title":"UPDATE: Mikrofon nicht erkannt oder funktioniert nicht in Windows 10 (Gelöst)","content":"<p> Dieses Handbuch enthält Anweisungen zum Beheben der Probleme &quot;Mikrofon nicht erkannt&quot; oder &quot;Mikrofon funktioniert nicht&quot; in Windows 10. Wenn Sie Probleme mit Ihrem Mikrofon in Windows 10 haben, kann dies verschiedene Ursachen haben. Das Problem &quot;Mikrofon funktioniert nicht&quot; ist für viele Windows 10-Benutzer ein Problem und tritt normalerweise nach einem Windows-Update auf. </p> <p> Dieses Tutorial enthält mehrere Lösungen, um Mikrofonprobleme in Windows 10 zu beheben. </p> <h4> So beheben Sie: Windows 10-Mikrofon funktioniert nicht oder wird nicht erkannt. * </h4> <p> * Hinweis: Wenn Sie Probleme mit Ihrem Mikrofon haben, versuchen Sie in einer bestimmten App Folgendes: </p> <blockquote><p> 1. Stellen Sie sicher, dass die jeweilige App das Mikrofon verwenden darf, indem Sie die Anweisungen in Methode 1 unten befolgen. <br> 2. Stellen Sie sicher, dass das Mikrofon in den App-Einstellungen als Standardeingabegerät ausgewählt ist. (z.B. in Skype, gehen Sie zu <strong> die Einstellungen </strong> und stellen Sie sicher, dass Ihr Mikrofon oder Headset ausgewählt ist). <br> 3. Schließen Sie alle anderen Apps, die Ihr Mikrofon verwenden könnten. <br> 4. Starten Sie Ihren PC neu und testen Sie Ihr MIC erneut. </p></blockquote> <h6> Lösung 1. Erlauben Sie Apps, auf Ihr Mikrofon zuzugreifen. </h6> <p> Die erste Methode zum Beheben von Problemen mit Ihrem Mikrofon in Windows 10 besteht darin, sicherzustellen, dass alle Apps Zugriff auf Ihr Mikrofon haben. Das zu tun: </p> <p> 1. . Aus dem Startmenü <img src=\"images/image_thumb2_thumb_thumb-856.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> klicken <strong> die Einstellungen </strong><img src=\"images/image_thumb-66-804.png\" alt=\"image\" loading=\"lazy\"> und dann öffnen <strong> Privatsphäre </strong> . <br> 2.  Wählen Sie <strong> Mikrofon </strong> im linken Bereich und dann <strong> Einschalten </strong> das <strong> Erlauben Sie Apps, auf Ihr Mikrofon zuzugreifen. </strong></p> <p><img src=\"images/image_thumb-34-268.png\" alt=\"How to FIX: Windows 10 Microphone Not Detected or Not Working\" loading=\"lazy\"></p> <p> 3. Scrollen Sie dann nach unten und stellen Sie sicher, dass die App, die Sie mit Ihrem Mikrofon verwenden möchten, darauf zugreifen kann. * </p> <p> * Vorschlag: Deaktivieren Sie aus Datenschutzgründen den Mikrofonzugriff auf alle Apps, die Ihr Mikrofon nicht verwenden soll. </p> <p><img src=\"images/image_thumb-35-517.png\" alt=\" FIX Windows 10 Microphone Not Working\" loading=\"lazy\"></p> <p> 4. Wenn Sie fertig sind, testen Sie Ihr Mikrofon. </p> <h6> Lösung 2. Überprüfen Sie, ob Ihr Mikrofon das Standardeingabegerät (Aufnahmegerät) ist. </h6> <p> 1. . Aus dem Startmenü <img src=\"images/image_thumb2_thumb_thumb-930.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> klicken <strong> die Einstellungen </strong><img src=\"images/image_thumb-66-142.png\" alt=\"image\" loading=\"lazy\"> und dann öffnen <strong> System </strong> . <br> 2. Klicken Sie auf <strong> Klang </strong> im linken Bereich und sprechen Sie dann, um Ihr Mikrofon zu testen. Wenn Ihr Mikrofon funktioniert, sollten Sie unten sehen, wie sich der Schieberegler bewegt. Wenn nicht, dann klicke <strong> Audiogeräte verwalten. </strong></p> <p><img src=\"images/image_thumb-36-254.png\" alt=\"Test Microphone Windows 10\" loading=\"lazy\"></p> <p> 3. Stellen Sie unter „Optionen für Audiogeräte verwalten“ sicher, dass Ihr Mikrofon unter „Eingabegeräte“ als Standardeingabegerät aufgeführt ist und dessen <strong> aktiviert </strong> . Wenn nicht, klicke auf dein Mikrofon und klicke auf <strong> Aktivieren. </strong></p> <p><img src=\"images/image_thumb-37-753.png\" alt=\"Enable Microphone Windows 10\" loading=\"lazy\"></p> <h6> Lösung 3. Überprüfen Sie die Mikrofoneinstellungen in der Systemsteuerung. </h6> <p> 1. Navigieren Sie zu Windows <strong> Schalttafel </strong> und öffnen <strong> Klang. </strong></p> <p><img src=\"images/image_thumb-14-511.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Am <strong> Aufzeichnung </strong> Registerkarte, wählen Sie Ihr Mikrofon aus und klicken Sie auf <strong> Eigenschaften. </strong></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"Microphone Properties\" loading=\"lazy\"></p> <p> 3. Am <strong> Niveau </strong> Tab, <strong> ziehen </strong> der Schieberegler zum <strong> Recht </strong> , um die Mikrofonlautstärke zu erhöhen und sicherzustellen, dass Ihr Mikrofon nicht stummgeschaltet ist (Falls Ihr Mikrofon stummgeschaltet ist, wird das Lautstärkesymbol <img src=\"images/image_thumb-39-434.png\" alt=\"image\" loading=\"lazy\"> , wird mit einem roten Symbol angezeigt <img src=\"images/image_thumb-40-819.png\" alt=\"image\" loading=\"lazy\"> ). Wenn du fertig bist, klicke <strong> OK </strong> und <strong> OK </strong> um die Soundeigenschaften zu schließen. </p> <p><img src=\"images/image_thumb-41-896.png\" alt=\"Microphone Levels\" loading=\"lazy\"></p> <h6> Lösung 4. Ändern Sie den Soundkartentreiber. </h6> <p> Die letzte Methode zum Beheben von Mikrofonproblemen in Windows 10 besteht darin, den Soundtreiber zu ändern, insbesondere wenn Sie ein Realtek Audio-Gerät besitzen. Das zu tun: </p> <p> 1. Öffnen <strong> Gerätemanager </strong> . Das zu tun: </p> <blockquote><p> 1. Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-918.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Geben Sie im Feld &quot;Öffnen&quot; Folgendes ein: <strong> devmgmt.msc </strong> &amp; klicken <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-5-732.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Erweitern </strong> das <strong> Sound-, Video- und Gamecontroller. </strong></p> <p> 3. <strong> Rechtsklick </strong> auf der <strong> Realtek High-Definition-Audio </strong> Gerät und wählen Sie <strong> Treiber aktualisieren. <br> </strong></p> <p><img src=\"images/image_thumb-6-629.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Wählen Sie <strong> Durchsuchen Sie meinen Computer nach Treibern. </strong></p> <p><img src=\"images/image_thumb-7-637.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Wählen Sie <strong> Lassen Sie mich aus einer Liste verfügbarer Treiber auf meinem Computer auswählen </strong> . </p> <p><img src=\"images/image_thumb-8-118.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. Wählen Sie im nächsten Bildschirm die Option <strong> Hochauflösendes Audio-Gerät </strong> und klicke <strong> Nächster. </strong></p> <p><img src=\"images/image_thumb-20-989.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p> 8. Klicken Sie im Fenster „Treiberwarnung aktualisieren“ auf „Ja“, um den neuen Treiber zu installieren. <br> 9. Wenn die Treiberinstallation abgeschlossen ist, <strong> neu starten </strong> dein Computer. <br> 10. Fahren Sie nach dem Neustart fort und testen Sie Ihr Mikrofon. </p> <h6></h6> <h6> Lösung 5. Deinstallieren Sie die Soundkartentreiber und installieren Sie sie erneut. </h6> <p> Die letzte Lösung, um das Problem mit dem Mikrofon funktioniert nicht zu beheben, besteht in Windows 10 darin, die Treiber der Soundkarte vollständig zu deinstallieren und neu zu installieren. </p> <p> 1. Navigieren Sie zu <strong> Schalttafel </strong> &gt; <strong> Programm und Funktionen </strong> und <strong> deinstallieren </strong> jegliche Software im Zusammenhang mit Ihrer Soundkarte. <br> 2. Öffnen <strong> Gerätemanager </strong> und <strong> erweitern </strong> das <strong> Sound-, Video- und Gamecontroller. <br> </strong> 3. <strong> Rechtsklick </strong> auf dem installierten <strong> Audiogerät </strong> und klicke <strong> Gerät deinstallieren. </strong></p> <p><img src=\"images/image_thumb-42-701.png\" alt=\"Uninstall Sound Card Device\" loading=\"lazy\"></p> <p> </p> <p> 4. Wenn Sie fertig sind, navigieren Sie zur Hersteller-Support-Site Ihres Computers oder Laptops und laden Sie den neuesten Treiber für Ihre Soundkarte herunter und installieren Sie ihn. <br> 5. Nach der Installation, <strong> neu starten </strong> Ihren PC und prüfen Sie, ob Ihr Mikrofon funktioniert. </p> <p><strong> Zusätzliche Hilfe: </strong> Wenn Ihr Mikrofon nach Anwendung der oben genannten Lösungen immer noch nicht funktioniert, ist es wahrscheinlich beschädigt. Wenn Sie einen Laptop besitzen, schließen Sie ein externes Mikrofon an, oder verwenden Sie ein anderes Mikrofon, wenn Sie einen Desktop besitzen. </p> <p> Das war&#39;s Leute! Welche Methode hat bei Ihnen funktioniert? Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}