{"title":"UPDATE: Outlook Express-Fehler 0x800c0133 aufgrund einer Größenbeschränkung von 2 GB in der DBX-Datei (Gelöst)","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben des Outlook Express-Fehlers 0x800c0133 aufgrund der Größenbeschränkung von 2 GB. Der Fehler 0x800c0133 in OE tritt auf, weil einer der Outlook-Ordner die Größe von 2 GB überschreitet. </p> <p> Beschreibung des Problems mit der Größenbeschränkung von .DBX 2 GB in Outlook Express. <br> Wenn einer der Hauptordner von Outlook Express (z. B. der &quot;Posteingang&quot; oder der &quot;Gesendet&quot;) die Größe von 2 GB überschreitet, gibt OE während des Sende-/Empfangsvorgangs den Fehler 0x800c0133 zurück und manchmal wird der entsprechende OE-Ordner leer (beschädigt).* Wenn beispielsweise der Ordner &quot;Posteingang&quot; (Inbox.dbx) die Größe von 2 GB überschreitet, kann OE die neuen E-Mails nicht empfangen und zeigt den Fehler 0x800c0133 an. </p> <p> * Hinweis: Wenn einer der OE-Ordner leer ist, ist die zugehörige DBX-Datei beschädigt. Versuchen Sie in diesem Fall, Ihre E-Mails aus dem beschädigten OE-Ordner wiederherzustellen, indem Sie die Anweisungen in diesem Artikel befolgen: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> So stellen Sie die Outlook Express DBX-Datei KOSTENLOS wieder her </a> . </p> <h4> So beheben Sie das Problem mit der 2 GB-Grenze von Outlook Express (Sende-/Empfangsfehler 0x800c0133). </h4> <h6> Schritt 1. Aktivieren Sie die Ansicht versteckter Dateien. </h6> <p> 1. Öffnen Sie den Windows-Explorer. <br> 2. Von der <strong> Werkzeuge </strong> Menü wählen <strong> Ordneroptionen </strong> . <br> 3. Klicken Sie auf der Registerkarte Ansicht auf <strong> Versteckte Dateien und Ordner anzeigen </strong> und klicke <strong> OK. </strong></p> <p><img src=\"images/image_thumb1_thumb-210.png\" alt=\"image_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Schritt 2. Suchen Sie die Outlook Express 2 GB DBX-Datei auf Ihrer Festplatte. </h6> <p> 1. Öffnen Sie den Outlook Express-Speicherordner. Normalerweise befindet sich dieser Ordner unter folgendem Pfad auf Ihrer Festplatte: </p> <ul> <li> C:\\Dokumente und Einstellungen\\Lokale Einstellungen\\Anwendungsdaten\\Identitäten\\{}\\Microsoft\\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> z.B. „C:\\Dokumente und Einstellungen\\Admin\\Lokale Einstellungen\\Anwendungsdaten\\Identitäten\\{D8F3C56D-965E-41AE-8A23-A58460ABAE00}\\Microsoft\\ <strong> Outlook Express </strong> ” </p></blockquote> <p> 3. Aus dem Explorer <strong> Aussicht </strong> Menü wählen <strong> Einzelheiten </strong> . <br> 4. Suchen Sie, welche DBX-Datei die Speichergrenze von 2 GB überschreitet. * </p> <p> * In diesem Beispiel überschreitet die Datei &quot;Inbox.dbx&quot; die Größe von 2 GB. </p> <p><img src=\"images/image_thumb2_thumb-339.png\" alt=\"FIX Outlook Express Error 0x800c0133\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Schritt 3. Verschieben Sie die E-Mails aus dem Ordner für übergroße E-Mails in einen Ordner für neue E-Mails. </h6> <p> 1. Öffnen Sie Outlook Express. <br> 2. Wählen Sie den übergroßen Mailordner aus (mit einer Größe von über 2 GB, z. B. in diesem Beispiel den Ordner &quot;Posteingang&quot;). <br> 3. Wenn Sie Ihre E-Mails in diesem Ordner sehen können (der Ordner ist nicht leer), gehen Sie wie folgt vor: * </p> <p> * Hinweis: Wenn der Ordner leer erscheint (Sie sehen keine E-Mails darauf), dann ist der OE-Ordner (und die zugehörige DBX-Datei) beschädigt. In diesem Fall müssen Sie Ihre E-Mails aus dem beschädigten DBX-Ordner wiederherstellen, indem Sie den Anweisungen in diesem Artikel folgen. </p> <p> 4. Klicken Sie im linken Bereich des OE-Programms mit der rechten Maustaste auf den übergroßen Ordner und wählen Sie <strong> Neuer Ordner </strong> (um einen neuen Mailordner zu erstellen) </p> <p><img src=\"images/image_thumb-6-403.png\" alt=\"outlook express 2gb limit\" loading=\"lazy\"></p> <p> </p> <p> 5. Geben Sie einen erkennbaren Namen für den neuen Ordner gefolgt von einer Jahreszahl ein (z. B. &quot;Posteingang-2016&quot;) </p> <p><img src=\"images/image_thumb-7-434.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Wählen Sie dann aus dem übergroßen Ordner (zB aus &quot;Posteingang&quot;) eine Gruppe von E-Mails aus (zB alle E-Mails aus dem Jahr 2016) und ziehen Sie diese per Drag &amp; Drop (verschieben) Sie diese in den neuen Mail-Ordner, den Sie zuvor erstellt haben (zB nach &quot; Posteingang-2016&quot;). </p> <p><img src=\"images/image_thumb-8-450.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Wiederholen Sie die gleichen Schritte (erstellen Sie beispielsweise verschiedene Ordner nach Jahr und verschieben Sie die Mails aus dem übergroßen Ordner in die neuen Ordner). * </p> <p> * Hinweis: Wenn beim Verschieben Probleme auftreten (z. B. wenn Sie einige Nachrichten nicht in den neuen Ordner verschieben können), dann: </p> <blockquote><p> 1. Schließen Sie Outlook Express. <br> 2. Kopieren (sichern) Sie den Ordner &quot;Outlook Express&quot; vom OE Store-Speicherort an ein anderes Ziel auf Ihrer Festplatte. <br> 3. Folgen Sie dann den Anweisungen in Schritt 4, um die übergroße .dbx-Datei zu löschen. <br> 4. Öffnen Sie Outlook Express. <br> 5. Importieren Sie die E-Mails aus dem OE-Sicherungsordner (Von <strong> Datei </strong> Menü gehe zu -&gt; <strong> Importieren </strong> <strong> Mitteilungen </strong> -&gt; <strong> Microsoft Outlook Express 6 </strong> -&gt; <strong> E-Mails aus dem OE-Speicherverzeichnis importieren… </strong> ). ** </p> <p> ** Wenn beim Importieren weiterhin Probleme auftreten, befolgen Sie die Anweisungen in diesem Artikel, um die beschädigte DBX-Datei zu reparieren. </p></blockquote> <p> </p> <p> 8. Wenn Sie mit der E-Mail-Übertragung fertig sind und der 2 GB-Ordner keine E-Mails mehr enthält (z. B. der &quot;Posteingang&quot; in diesem Beispiel), fahren Sie mit dem nächsten Schritt fort. </p> <p><img src=\"images/image_thumb-10-811.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Schritt 4. Löschen Sie die übergroße Outlook Express DBX-Datei von Ihrer Festplatte. </h6> <p> 1. Öffnen Sie den Outlook Express-Speicherordner auf Ihrer Festplatte. <br> 2. Löschen Sie die übergroße DBX-Datei (z. B. die &quot;Inbox.dbx&quot; in diesem Beispiel). </p> <p><img src=\"images/image_thumb-9-996.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Starten Sie Outlook Express. <br> 4. OE erstellt (automatisch) einen neuen sauberen und fehlerfreien E-Mail-Ordner zum Speichern von E-Mails. * </p> <p> * Hinweis: Wenn Sie immer noch denselben Fehler erhalten, versuchen Sie, den beschädigten OE-Ordner zu reparieren, indem Sie die Anweisungen in diesem Artikel befolgen: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> So stellen Sie die Outlook Express DBX-Datei KOSTENLOS wieder her </a> . </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? </p> <p> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}