{"title":"UPDATE: 0x800707e7, 0x000007E7 Fehler in Windows 10 Update.","content":"<p> Der Windows 10 Update-Fehlercode „0x800707E7 – 0x3000D: Die Installation ist in der FIRST_BOOT-Phase mit einem Fehler während des MIGRATE_DATA-Vorgangs fehlgeschlagen“ tritt normalerweise auf, wenn Windows ein Benutzerprofil nicht migrieren kann. </p> <p> Der Fehler 0x800707E7 in Windows 10 Update tritt häufig auf Computern mit NVIDIA-Grafikkarten auf, die den NVIDIA Update Service verwenden, um Treiber oder andere NVIDIA-Software zu aktualisieren. Genauer gesagt wird auf NVIDIA-Kartensystemen bei der Installation der NVIDIA-Software automatisch ein neuer Benutzer in Windows mit dem Namen &quot;UpdateusUser&quot; erstellt, der vom NVIDIA Update-Dienst verwendet wird. </p> <p> In dieser Anleitung finden Sie Schritt-für-Schritt-Anleitungen, um die folgenden Fehler in Windows 10 Update zu beheben: </p> <ul> <li> <ul> <li> 0x800707E7 – 0x3000D: Die Installation schlug in der FIRST_BOOT-Phase mit einem Fehler während des MIGRATE_DATA-Vorgangs fehl </li> <li> 0x000007E7: ERROR_PROFILE_DOES_NOT_MATCH_DEVICE, Das angegebene Profil ist für ein Gerät eines anderen Typs als das angegebene Gerät vorgesehen. </li> </ul> </li> </ul> <h2> So beheben Sie die Windows 10-Update-Fehler 0x800707e7, 0x000007E7. </h2> <h3> Schritt 1. Deinstallieren Sie die NVIDIA-Software von Ihrem Computer. </h3> <p> Wenn Sie eine NVIDIA-Grafikkarte besitzen, navigieren Sie zu <strong> Schalttafel </strong> -&gt; <strong> Programme und Funktionen </strong> und <strong> Deinstallieren </strong> alle <strong> NVIDIA-Software </strong> .* </p> <p> * Hinweis: Dieser Schritt gilt nur für Systeme mit NVIDIA-Karten. Wenn Sie keine NVIDIA-Grafikkarte besitzen, fahren Sie mit Schritt 2 fort. </p> <p><strong> So deinstallieren Sie die NVIDIA-Software. </strong></p> <p> 1. Navigieren Sie hinein <strong> Programme und Funktionen </strong> in der Systemsteuerung. Das zu tun: </p> <blockquote><p> 1. Drücken Sie gleichzeitig die Windows <img src=\"images/image_thumb36-131.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ: <strong> appwiz.cpl </strong> und klicke <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-24-479.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 2. Wählen Sie nacheinander alle NVIDIA-Software aus und klicken Sie auf <strong> Deinstallieren. </strong></p> <p><img src=\"images/image_thumb-67-843.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Befolgen Sie die Anweisungen auf dem Bildschirm, um die NVIDIA-Software von Ihrem Computer zu entfernen. <br> 4. Wenn die Deinstallation abgeschlossen ist <strong> neu starten </strong> Ihren PC und fahren Sie mit dem nächsten Schritt fort. </p> <h3> Schritt 2. Löschen Sie &quot;UpdatusUser&quot; und alle unbekannten Benutzerprofile. </h3> <p> 1. Klicken Sie im Explorer mit der rechten Maustaste auf das Symbol Ihres Computers (Dieser PC) und wählen Sie <strong> Eigenschaften </strong> . <br> 2. Klicken Sie auf <strong> Erweiterte Systemeinstellungen </strong> . <br> 3. At <strong> Benutzerprofil </strong> , klicken <strong> die Einstellungen </strong> . </p> <p><img src=\"images/image_thumb-68-812.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Wählen Sie und <strong> löschen </strong> das <strong> UpdateBenutzer </strong> Profil oder ein anderes Ihnen unbekanntes Profil ( <strong> außer </strong> dein Profil und die <strong> Standard Profil </strong> ). </p> <p><img src=\"images/image_thumb-69-946.png\" alt=\"Delete User Profile\" loading=\"lazy\"></p> <p> 4. Wenn Sie fertig sind, klicken Sie auf <strong> OK </strong> und fahren Sie mit dem nächsten Schritt fort. </p> <h3></h3> <h3> Schritt 3. Entfernen Sie unbekannte Benutzerprofile in der Registrierung. </h3> <p> 1. Öffnen Sie den Registrierungseditor: um das zu tun: </p> <blockquote><p> 1. Drücken Sie Windows <img src=\"images/image_thumb41-520.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ <strong> regedit </strong> und drücke <strong> Eingeben </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-235.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Navigieren Sie im Registrierungseditor zum folgenden Schlüssel im linken Bereich: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\ProfileList </li> </ul> <p> 4a. Erweitern Sie nun die <strong> Profilliste </strong> -Taste und klicken Sie auf jedes &quot;S-1-5-21-xxxx&quot;-Profil und prüfen Sie, ob eines davon den Wert &quot; <strong> C:\\Benutzer\\UpdateBenutzer&quot; </strong> beim <strong> ProfileImagePath. </strong></p> <p><img src=\"images/image_thumb-70-754.png\" alt=\"FIX: 0x800707e7 or 0x000007E7 errors in Windows 10 Update.\" loading=\"lazy\"></p> <p> 4b. Wenn Sie die &quot; <strong> C:\\Benutzer\\UpdateBenutzer&quot; </strong> Wert <strong> </strong> auf einem Profil, wählen Sie dann das Profil im linken Bereich aus und <strong> Löschen </strong> es. </p> <p><img src=\"images/image_thumb-71-506.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5.  Sehen Sie sich schließlich den vollständigen Namen jedes &quot;S-1-5-21-xxxx&quot;-Profilschlüssels (unter dem &quot;ProfileList-Schlüssel&quot;) an und <strong> löschen </strong> jeder Profilschlüssel mit a <strong> .bak </strong> Erweiterung am Ende des Namens. </p> <p><img src=\"images/image_thumb-72-738.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Wenn Sie fertig sind, schließen Sie den Registrierungseditor und <strong> neu starten </strong> dein PC. <br> 7. Nach Neustart: </p> <blockquote> <p> ein. Navigieren Sie zu <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Download-Site für Windows 10 </a> und klicke auf <strong> Jetzt aktualisieren </strong> Taste. </p> <p><img src=\"images/image_thumb-65-120.png\" alt=\"Download Windows 10 21H1 \" loading=\"lazy\"></p> <p> b. Speichern Sie die Datei &quot;Windows10Upgrade9252.exe&quot; auf Ihrem Desktop. <br> c. Doppelklicken Sie auf die heruntergeladene Datei, um die zu öffnen <strong> Windows-Upgrade-Assistent </strong> . <br> d. Klicken <strong> Jetzt aktualisieren </strong> um das Update zu starten. </p></blockquote> <p> 8. Windows Update sollte nun reibungslos und ohne Fehler 0x800707e7 (oder 0x000007E7) abgeschlossen sein. <br> 9. Schließlich, nach dem Aktualisieren von Windows 10 und wenn Sie eine NVIDIA-Grafikkarte besitzen, fahren Sie fort und installieren Sie die NVIDIA-Software neu. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um das Problem zu verbreiten. </p>"}