{"title":"UPDATE: In Windows 10 sind keine früheren Versionen verfügbar (Gelöst)","content":"<p> Auf einem Windows 10-basierten Computer mit dem <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Systemschutz </a> aktiviert ist, tritt beim Versuch, eine Datei/einen Ordner mit der Funktion &quot;Vorherige Versionen wiederherstellen&quot; wiederherzustellen, das folgende Problem auf: &quot;Es sind keine früheren Versionen verfügbar&quot;. </p> <p> <img src=\"images/image_thumb-39-628.png\" alt=\"There No Previous Versions Available in Windows 10 \" loading=\"lazy\"></p> <p> </p> <p> Der Fehler &quot;Es sind keine früheren Versionen verfügbar&quot; tritt auf, weil in Windows 10 die Funktion &quot;Vorherige Versionen wiederherstellen&quot; nur funktioniert, wenn Sie die &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Dokumentenhistorie </a> “, um Ihre Dateien zu sichern. Dies bedeutet, dass die Funktion &quot;Vorherige Versionen wiederherstellen&quot; in Windows 10 den Sicherungsspeicherort des &quot;Tool zur Sicherung des Dateiverlaufs&quot; untersucht, um eine frühere Version einer Datei/eines Ordners zu finden, und nicht die Systemwiederherstellungspunkte, wie es in Windows der Fall ist 7. Um den Dateiversionsverlauf in Windows 10 zu aktivieren, befolgen Sie die Anweisungen in den folgenden Artikeln: </p> <ul> <li><strong> Zum Thema passende Artikel: </strong></li> <li> <ul> <li><a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> So sichern Sie persönliche Dateien mit dem Dateiversionsverlauf in Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> So erstellen Sie Schattenkopien Ihrer Dateien mit dem Taskplaner in Windows 10 </a></li> </ul> </li> </ul> <h4> So beheben Sie: In Windows 10 sind keine früheren Versionen von Dateien verfügbar. </h4> <p> Wenn &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Dokumentenhistorie </a> &#39; ist auf Ihrem Windows 10-PC bereits aktiviert*, Sie erhalten jedoch die Meldung &quot;Es sind keine früheren Versionen verfügbar&quot;, wenn Sie versuchen, die vorherige Version einer Datei oder eines Ordners wiederherzustellen, befolgen Sie die folgenden Anweisungen: </p> <p> * Hinweis: Die folgenden Anweisungen <strong> funktioniert nicht, wenn die <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Dateiversionsverlauf ist BEREITS aktiviert </a></strong> auf Ihrem Windows 10-PC. </p> <p> 1. Laden Sie das herunter und installieren Sie es <a href=\"http://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> SchattenExplorer </a> Dienstprogramm auf Ihrem PC. <br> 2. Öffnen Sie &#39;ShadowExplorer&#39; und wählen Sie das Datum aus, an dem Sie die Datei wiederherstellen möchten. * </p> <p> * Hinweis: Wenn kein vorheriges Datum angezeigt wird, ist der Dateiversionsverlauf deaktiviert. Denken Sie daran, dass selbst wenn Sie den Dateiversionsverlauf jetzt aktivieren, das Ergebnis dasselbe ist, da der Dateiversionsverlauf ab dem Zeitpunkt der Aktivierung Schnappschüsse Ihrer Dateien erstellt. </p> <p><img src=\"images/image_thumb-40-348.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Navigieren Sie zum Speicherort der Datei/des Ordners, den Sie in der vorherigen Version wiederherstellen möchten. <br> 4. Wenn Sie die Datei finden, die Sie wiederherstellen möchten, klicken Sie mit der rechten Maustaste darauf und wählen Sie <strong> Export </strong> . </p> <p><img src=\"images/image_thumb-41-653.png\" alt=\"restore previous versions shadow explorer\" loading=\"lazy\"></p> <p> </p> <p> 5. Wählen Sie eine andere Festplatte (Speicherort) aus, um die wiederhergestellte Datei zu speichern, und klicken Sie auf <strong> OK </strong> . * </p> <p><strong> Wichtig: </strong> Speichern Sie die wiederhergestellten Dateien auf einem anderen Datenträger (z. B. einem Flash-Laufwerk) und kopieren Sie sie erst, nachdem Sie sichergestellt haben, dass Sie die richtigen Dateien haben, an den ursprünglichen Speicherort, um ein Überschreiben der Originaldateien zu vermeiden. </p> <p><img src=\"images/image_thumb-38-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um das Problem zu verbreiten. </p>"}