{"title":"UPDATE: Es kann keine Verbindung zur Dateifreigabe hergestellt werden, da sie nicht sicher ist und das veraltete SMB1-Protokoll erfordert. (Gelöst)","content":"<p> Wenn Sie versuchen, von einem Windows 10-PC aus eine Verbindung zu einem freigegebenen Netzwerkordner herzustellen, und die Fehlermeldung „Sie können keine Verbindung zur Dateifreigabe herstellen, da sie nicht sicher ist Ihr System angreifen. Ihr System erfordert SMB2 oder höher. Weitere Informationen zur Behebung dieses Problems finden Sie unter: https://go.microsoft.com/fwlink/?linkid=852747&quot;. Fahren Sie dann unten fort, um das Problem zu beheben. </p> <p><img src=\"images/image_thumb-30-812.png\" alt=\"You can't connect to the file share because it's not secure. This share requires the obsolete SMB1 protocol, which is unsafe...\" loading=\"lazy\"></p> <p> In Windows 10 v1709 und späteren Versionen ist das Netzwerkprotokoll Server Message Block Version 1 (SMBv1) nicht standardmäßig installiert und muss manuell aktiviert werden, wenn Sie auf einen freigegebenen Ordner auf einer Arbeitsstation oder einem Server zugreifen möchten, der das SMBv1-Protokoll für Datenaustausch. </p> <p> Dieses Tutorial enthält Anweisungen zum Beheben der folgenden Fehler beim Versuch, eine Verbindung zu einem freigegebenen Ordner in Windows 10 herzustellen: </p> <ul> <li> <p><em> Sie können keine Verbindung zur Dateifreigabe herstellen, da sie nicht sicher ist. Diese Freigabe erfordert das veraltete SMB1-Protokoll, das unsicher ist… </em></p> </li> <li> <p><em> Der angegebene Netzwerkname ist nicht mehr verfügbar </em></p> </li> <li> <p><em> Unbekannter Fehler 0x80004005 </em></p> </li> <li> <p><em> Der angegebene Server kann den angeforderten Vorgang nicht ausführen. </em></p> </li> </ul> <h4> So beheben Sie: Kann keine Verbindung zur Dateifreigabe herstellen, da das SMBv1-Protokoll fehlt (Windows 10) </h4> <p> 1. Navigieren Sie zu <strong> Schalttafel </strong> -&gt; <strong> Programme und Funktionen </strong> . <br> 2. Klicken Sie auf <strong> Schalte Windows Funktionen ein oder aus </strong> von links. </p> <p> </p> <p><img src=\"images/image_thumb-68-359.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Erweitern Sie die Option &#39;SMB 1.0/CIFS File Sharing Support&#39; und <strong> prüfen </strong> das <strong> SMB 1.0/CIFS-Client </strong> Möglichkeit. Klicken <strong> OK </strong> wenn fertig. </p> <p><img src=\"images/image_thumb-29-360.png\" alt=\"Install SMBv1 Windows 10\" loading=\"lazy\"></p> <p> 4. Wenn SMB 1.0/CIFS installiert ist und klicken Sie dann auf <strong> Jetzt neustarten </strong> Taste, um Ihren PC neu zu starten. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}