{"title":"UPDATE: Es sieht so aus, als hätten Sie ein Upgrade gestartet und vom Installationsmedium gebootet (Gelöst)","content":"<p> Das folgende Problem kann auftreten, wenn Sie versuchen, eine Neuinstallation oder ein Reparatur-Upgrade von Windows 10 von einem Installationsmedium durchzuführen: &quot;Es sieht so aus, als hätten Sie ein Upgrade gestartet und von einem Installationsmedium gestartet. Wenn Sie mit dem Upgrade fortfahren möchten, entfernen Sie Medien von Ihrem PC und klicken Sie auf Ja. Wenn Sie stattdessen eine Neuinstallation durchführen möchten, klicken Sie auf Nein&quot;. </p> <p><img src=\"images/image_thumb-36-818.png\" alt=\"FIX: It looks like you started an upgrade and booted from installation media \" loading=\"lazy\"></p> <p> </p> <p> Die obige Fehlermeldung bedeutet, dass Sie das Windows 10-Upgrade nach dem Start unterbrochen haben. Wie die Meldung anzeigt, müssen Sie, wenn Sie eine Neuinstallation von Windows 10 durchführen möchten, &quot;Nein&quot; auswählen, um fortzufahren. Andernfalls entfernen Sie das Installationsmedium und klicken Sie auf &quot;Ja&quot;, um das Windows 10-Upgrade fortzusetzen. </p> <p> Im Allgemeinen ist die obige Meldung kein Problem, wird jedoch zu einem großen Problem, wenn das Windows-Update nicht installiert werden kann oder wenn Windows 10 nach dem Versuch, Updates zu installieren, in einer Schleife hängen bleibt und Sie Windows 10 reparieren möchten, indem Sie von einer Installation booten Medien. </p> <p> In diesem Tutorial finden Sie detaillierte Anweisungen, wie Sie die Meldung &quot;Es sieht so aus, als hätten Sie ein Upgrade gestartet und vom Installationsmedium gestartet&quot; umgehen, indem Sie den aktuell laufenden Update-Prozess von Windows 10 abbrechen, um eine Windows 10-Reparatur durchzuführen Upgrade vom Installationsmedium. </p> <h4> So brechen Sie das laufende Windows 10-Update ab, wenn Windows nicht booten kann * </h4> <p><strong> * Wichtig: </strong> Wenn Sie Windows 10 starten können, das Update jedoch nicht aus der Windows-Umgebung installieren können, wenden Sie zuerst die folgenden Aktionen an: </p> <blockquote><p> 1. Navigieren Sie zu <strong> Start </strong> &gt; <strong> die Einstellungen </strong> &gt; <strong> Update und Sicherheit </strong> und klicken Sie auf &quot;Jetzt neu starten&quot;, um den Update-Vorgang zu starten. <br> 2. Belassen Sie nach dem ersten Neustart den Fortschritt &quot;Working on updates&quot; auf 1-2%. <br> 3. Drücken Sie anschließend die <strong> Leistung </strong> 10-15 Sekunden lang gedrückt, um Ihren PC vollständig herunterzufahren. <br> 4. Schließen Sie das Windows-Installationsmedium an und schalten Sie Ihren PC ein. <br> 5. Befolgen Sie die restlichen Schritte unten, um das laufende Update abzubrechen. </p></blockquote> <p> </p> <h6> Schritt 1. Brechen Sie die ausstehenden Windows Update-Aktionen ab. </h6> <p> 1. Booten Sie Ihr System von einem Windows-Installationsmedium. <br> 2. Wenn die Meldung &quot;Es sieht so aus, als ob Sie ein Upgrade gestartet und vom Installationsmedium gebootet haben...&quot; angezeigt wird, drücken Sie die <strong> VERSCHIEBUNG </strong> + <strong> F10 </strong> Tasten zum Starten der Eingabeaufforderung. </p> <p><img src=\"images/image_thumb-37-729.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Rufen Sie an der Eingabeaufforderung mit diesem Befehl eine Liste aller Laufwerke auf Ihrem System ab: </p> <ul> <li><strong> Wmic Logicaldisk Name abrufen </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-991.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> </p> <p> 4. Finden Sie dann heraus, welches Laufwerk den Ordner &quot;Windows&quot; enthält, indem Sie diesen Befehl eingeben: * </p> <p> </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * z.B. Um den Inhalt des Laufwerks C: anzuzeigen, geben Sie Folgendes ein: &quot; <strong> dir C: </strong> &quot; (ohne Anführungszeichen). Wenn Sie den Ordner &quot;Windows&quot; auf Laufwerk C: nicht sehen können, fahren Sie mit dem nächsten Laufwerksbuchstaben fort (zB &quot;dir D:&quot;, &quot;dir E:&quot;, etc.), bis Sie das Ordner &quot;Windows&quot; auf einem der aufgelisteten Laufwerke (aus dem obigen Befehl). </p> <p> Bsp.: Wie Sie auf dem Screenshot unten sehen können, befindet sich der Windows-Ordner (in diesem Beispiel) unter der <strong> D </strong> : Fahrt.] </p> <p><img src=\"images/image_thumb-69-578.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Sobald Sie gefunden haben, auf welchem ​​Laufwerk sich das &quot;Windows&quot;-Laufwerk befindet (in diesem Beispiel beispielsweise auf Laufwerk &quot;D:&quot;), navigieren Sie zu diesem Laufwerk, indem Sie DriveLetter . eingeben <strong> : </strong> + <strong> Eingeben </strong> . </p> <p> 6. Erstellen Sie dann einen Scratch-Ordner auf dem Windows-Laufwerk, indem Sie diesen Befehl eingeben: </p> <p> </p> <ul> <li><strong> mkdir D:\\Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-229.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Geben Sie dann den folgenden Befehl ein, um die ausstehenden Aktionen des laufenden Updates rückgängig zu machen: </p> <ul> <li><strong> DISM /Image:D:\\ /ScratchDir:D:\\Scratch /Cleanup-Image /RevertPendingActions </strong></li> </ul> <p> * Hinweis: Ändern Sie den Laufwerksbuchstaben <strong> D </strong> nach deinem fall. </p> <p> 8. Sobald der obige DISM-Befehl ausgeführt wurde, sollten Sie die folgende Meldung auf dem Bildschirm erhalten: </p> <p> &quot; <em> Zurücksetzen ausstehender Aktionen aus dem Bild…. <br> Der Vorgang wurde abgeschlossen. Nach dem Neustart wird versucht, ausstehende Aktionen rückgängig zu machen. <br> Der Vorgang wurde erfolgreich abgeschlossen.&quot; </em></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"DISM - RevertPendingActions\" loading=\"lazy\"></p> <p> </p> <p> 9. Schließen Sie das Eingabeaufforderungsfenster, entfernen Sie das Installationsmedium und lassen Sie Windows normal booten. </p> <p> 10. Nach dem Neustart sollten Sie die folgende Meldung auf Ihrem Bildschirm sehen: &quot;An Ihrem Computer vorgenommene Änderungen werden rückgängig gemacht.&quot; Wenn dieser Vorgang beendet ist, sollte Windows normal starten. </p> <p><img src=\"images/image_thumb-39-836.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Schritt 2. Entfernen Sie die Upgrade-Dateien mit der Datenträgerbereinigung. </h6> <p> Nach dem Booten in Windows 10 müssen Sie Windows 10 für die USB-Reparatur/-Aktualisierung vorbereiten, indem Sie die bereits heruntergeladenen Updates mit dem Datenträgerbereinigungstool löschen. Das zu tun: </p> <p> 1. Öffnen Sie den Datei-Explorer, klicken Sie mit der rechten Maustaste auf Laufwerk C: und wählen Sie <strong> Eigenschaften </strong> . <br> 2. Klicken Sie auf das <strong> Fetplattensäuberung </strong> Taste. </p> <p><img src=\"images/image_thumb_thumb-190.png\" alt=\"Disk cleanup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Dann klick <strong> Systemdateien bereinigen </strong> . </p> <p><img src=\"images/image_thumb-40-950.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Überprüfen Sie nun, ob die folgenden Dateien entfernt werden sollen, und klicken Sie auf <strong> OK </strong> : </p> <ul> <li> <ul> <li> <ul> <li> Windows Update-Bereinigung. </li> <li> Windows Defender-Antivirus. </li> <li> Heruntergeladene Programmdateien. </li> <li> Temporäre Internetdateien. </li> <li> Frühere Windows-Installationen. </li> <li> Papierkorb. </li> <li> Temporäre Dateien. </li> <li> Temporäre Windows-Installationsdateien </li> </ul> </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-41-458.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Wenn Sie gefragt werden, <strong> Dateien löschen </strong> . </p> <p><img src=\"images/image_thumb-42-931.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Wenn die Bereinigung abgeschlossen ist, schließen Sie die Datenträgereigenschaften und fahren Sie mit dem nächsten Schritt fort. </p> <p> </p> <h6> Schritt 3. Löschen Sie den Ordner „SoftwareDistribution“. </h6> <p> Das &quot;C:\\Windows\\ <strong> Softwareverteilung </strong> &quot; Ordner, ist der Ort, an dem Windows die Windows-Updates speichert. Dieser Ordner wird oft beschädigt und Sie müssen ihn neu erstellen, um die Updates von Grund auf neu herunterzuladen. Gehen Sie also wie folgt vor: </p> <p><strong> 1. Stoppen Sie den Windows Update-Dienst: </strong> Das zu tun: </p> <blockquote><p> ein. Drücken Sie Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> b. Geben Sie in das Suchfeld Folgendes ein: <strong><em> dienste.msc </em></strong> &amp; klicken <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-12-264.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> c. Suchen Sie in der Systemsteuerung &quot;Dienste&quot; nach &quot; <strong> Windows Update&quot; </strong> Bedienung. <br> d. Klicken Sie mit der rechten Maustaste auf <strong> Windows Update </strong> Dienst und wählen Sie &quot; <strong> Halt </strong> &quot;. </p></blockquote> <p><img src=\"images/image_thumb-9-434.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. Löschen Sie den SoftwareDistribution-Ordner. </strong></p> <blockquote><p> ein. Öffnen Sie den Windows Explorer und navigieren Sie zu: <strong> C:\\Windows </strong> Mappe. <br> b. Finden und <strong> Löschen </strong> das &quot; <strong><em> Softwareverteilung </em></strong> &quot;-Ordner (oder benennen Sie ihn um, z. B. in &quot;SoftwareDistributionOLD&quot;) . </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-10-140.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Starte deinen Computer neu </strong> Änderungen anzuwenden. </p> <p> </p> <h6> Schritt 4. Aktualisieren Sie Windows 10 vom Installationsmedium. </h6> <p> Jetzt können Sie Windows 10 von einem Installationsmedium reparieren oder aktualisieren. Das zu tun: </p> <p> 1. <strong> Neustart </strong> dein Computer und <strong> booten </strong> vom Windows-USB (oder DVD) <strong> Installationsmedien </strong> . <br> 2. Drücken Sie im Windows Setup-Assistenten <strong> Nächster </strong> und dann klick <strong> Jetzt installieren </strong> . <br> 3. <strong> Akzeptieren </strong> die „Lizenzvereinbarung“. <br> 4. Wenn Sie dazu aufgefordert werden, wählen Sie Upgrade <strong> : Windows installieren und Dateien, Einstellungen und Anwendungen behalten </strong> . </p> <blockquote><p><img src=\"images/image_thumb8_thumb-241.png\" alt=\"image_thumb8\" loading=\"lazy\"></p></blockquote> <p> 5. Folgen Sie dann den Anweisungen auf dem Bildschirm, um Windows 10 zu aktualisieren. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}