{"title":"UPDATE: Links von Windows 10 E-Mail oder Outlook in Windows 10 können nicht geöffnet werden. (Gelöst)","content":"<p> Wenn Sie in Windows 10 Mail- und Outlook-Apps keine Links aus E-Mails öffnen können, lesen Sie weiter unten, um das Problem zu beheben. Viele Benutzer haben berichtet, dass sie nach dem Update von Windows 10 keine eingebetteten Links aus E-Mails im Webbrowser öffnen können und einen unbekannten Fehler erhalten. </p> <p> Problem im Detail: Auf einem Windows 10-basierten Computer werden die Hyperlinks von E-Mails von Outlook oder der Windows 10 Mail-App nicht im Webbrowser geöffnet, insbesondere wenn Sie als Standardbrowser Chrome oder Firefox und nicht Microsoft Edge verwenden . </p> <h4> So beheben Sie: Nach dem Windows 10-Update können keine HTML-Links aus E-Mails geöffnet werden. </h4> <h6> Methode 1. Standard-Apps zurücksetzen. </h6> <p> 1. Schließen Sie alle geöffneten Webbrowser. <br> 2. Schließen Sie die von Ihnen verwendete E-Mail-Anwendung (z. B. Windows 10 Mail, Outlook) </p> <p> 3. Aus dem Startmenü <img src=\"images/image_thumb2_thumb_thumb-709.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> klicken <strong> die Einstellungen </strong><img src=\"images/image_thumb-66-594.png\" alt=\"image\" loading=\"lazy\"> und klicke <strong> Apps </strong></p> <p><img src=\"images/image_thumb-72-875.png\" alt=\"Windows 10 Apps\" loading=\"lazy\"></p> <p> 4. Wählen Sie <strong> Standard-Apps </strong> aus dem linken Bereich und klicken Sie dann auf <strong> Zurücksetzen </strong> Schaltfläche, um die von Microsoft empfohlenen Apps zurückzusetzen. </p> <p><img src=\"images/image_thumb-73-622.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 5. Öffnen Sie nun Ihr E-Mail-Programm und öffnen Sie einen Hyperlink aus einer E-Mail. Normalerweise wird der Link problemlos im Microsoft Edge-Browser geöffnet. </p> <p> 6. Nun, <strong> schließen </strong> erneut die Mail-Anwendung. </p> <p> 7. Öffnen Sie den Webbrowser und legen Sie ihn als Standard fest, oder navigieren Sie zu <strong> Einstellungen &gt; </strong> <strong> Apps &gt; Standard-Apps </strong> und bei <strong> Webbrowser </strong> Optionen, klicken Sie auf <strong> Microsoft Edge </strong> und wählen Sie Ihren bevorzugten Browser als Standard-Webbrowser aus. </p> <p><img src=\"images/image_thumb-75-384.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 8. Öffnen Sie die Mail-App erneut und versuchen Sie, einen Hyperlink zu öffnen. Wenn das Problem weiterhin besteht, befolgen Sie die Schritte in Methode-2. </p> <h6> Methode 2. Ändern Sie HTML-Zuordnungen in der Registrierung. </h6> <p> 1. Drücken Sie gleichzeitig die Windows <img src=\"images/image_thumb36-617.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ <strong> regedit </strong> &amp; Drücken Sie <strong> Eingeben. </strong></p> <p><img src=\"images/image_thumb7-779.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2. Navigieren Sie im linken Bereich zu diesem Unterschlüssel: </p> <ul> <li><strong> HKEY_CURRENT_USER\\Software\\Classes\\.html </strong></li> </ul> <p> 3. Jetzt <em> Doppelklick </em> Bei der <strong> (Standard) </strong> String im rechten Bereich und setzen Sie die Wertdaten auf <strong> html-Datei </strong></p> <p><img src=\"images/image_thumb2-467.png\" alt=\"Cannot Open Links from Windows 10 Email or Outlook in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 4. Führen Sie den gleichen Vorgang durch und ändern Sie die <em><strong> Standard </strong></em> Zeichenfolgenwert zu <strong> html-Datei </strong> in diesen Unterschlüsseln: </p> <ul> <li><em> HKEY_CURRENT_USER\\Software\\Classes\\.htm </em></li> <li><em> HKEY_CURRENT_USER\\Software\\Classes\\.shtml </em></li> <li><em> HKEY_CURRENT_USER\\Software\\Classes\\.xhtml </em></li> <li><em> HKEY_CURRENT_USER\\Software\\Classes\\.xht <br> </em></li> </ul> <p> 5. Schließen Sie den Registrierungseditor und <strong> neu starten </strong> dein Computer. <br> 6. Versuchen Sie, Hyperlinks von Ihrem E-Mail-Programm zu öffnen. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht zu verbreiten. </p>"}