{"title":"UPDATE: Outlook-Spaltenleiste (Kopfzeilenleiste) verschwindet in Outlook 2016/2019. (Gelöst)","content":"<p> Vor einigen Tagen hat mich einer meiner Kunden kontaktiert, um mir mitzuteilen, dass die Leiste mit den Spaltentiteln (Senden, Von, Betreff, Empfangen, Größe usw.) in Outlook 2019 fehlt. Genauer gesagt die Zeile mit dem Spaltenüberschriften sind verschwunden, nachdem der Benutzer die &quot;Ansichtseinstellungen&quot; angepasst und die ROW-Schriftgröße erhöht hat. </p> <p><img src=\"images/image_thumb-567.png\" alt=\"FIX: Outlook Columns Bar (Header Bar) Disappear in Outlook 2016/2019\" loading=\"lazy\"></p> <p> Dieses Tutorial enthält Anweisungen zum Beheben des Problems &quot;Outlook-Headerleiste (Spaltenzeile) fehlt&quot; in Outlook 2016/2019. </p> <h4> So beheben Sie: Spaltenüberschriftenzeile fehlt in Outlook 2016/2019. </h4> <p> 1. Wählen Sie im linken Bereich mit den Outlook-Ordnern den Ordner aus, in dem Sie die Zeile mit den Spalten (Kopfzeilen) nicht sehen können. </p> <p> 2. Wählen Sie in der Menüleiste <strong> Aussicht </strong> und dann klick <strong> Einstellungen anzeigen </strong> . </p> <p><img src=\"images/image_thumb-1-535.png\" alt=\"FIX Column Heading Row is Missing Outlook 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Klicken Sie in den Optionen für „Erweiterte Ansichtseinstellungen“ auf <strong> Andere Einstellungen </strong> . </p> <p><img src=\"images/image_thumb-2-711.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. In den &#39;Anderen Einstellungen&#39; Optionen, <strong> deaktivieren </strong> das <strong> Verwenden Sie ein kompaktes Layout mit weniger als 125 Zeichen </strong> Kästchen an und klicke <strong> OK </strong> zweimal, um die Einstellung zu übernehmen und alle Fenster zu schließen. </p> <p><img src=\"images/image_thumb-3-736.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Starten Sie Outlook neu (oder navigieren Sie zu einem anderen Ordner und kehren Sie zu dem Ordner zurück, in dem Sie die Änderung übernommen haben), um die Leiste mit den Spaltenüberschriften wieder anzuzeigen. </p> <p><img src=\"images/image_thumb-4-249.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Das ist alles! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-5.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p>"}