{"title":"UPDATE: Das Ausführen von Skripts ist auf diesem System in Windows 10 deaktiviert (Gelöst)","content":"<p> Wenn Sie versuchen, ein Skript in Windows 10 PowerShell auszuführen und die Fehlermeldung „Kann nicht geladen werden, da das Ausführen von Skripts auf diesem System deaktiviert ist“ erhalten, lesen Sie weiter unten, um das Problem zu beheben. </p> <p><img src=\"images/image_thumb-8-134.png\" alt=\"FIX: script cannot be loaded because is disabled on Windows 10\" loading=\"lazy\"></p> <p> </p> <h2> Gewusst wie: FIX: PowerShell-Skript kann nicht ausgeführt werden, da Sicherheitsrichtlinie verhindert, dass Skripts in Windows 10 ausgeführt werden. </h2> <p> Der PowerShell-Fehler „%ScriptName%.ps1 kann nicht geladen werden, weil auf diesem System deaktiviert“ wird aufgrund einer Sicherheitsrichtlinie angezeigt, die die Ausführung von Skripts verhindert. Um die Einschränkung aufzuheben und das Ausführen von Skripten in Windows 10 zu aktivieren, gehen Sie wie folgt vor: </p> <p> 1. Öffnen <strong> PowerShell als Administrator </strong> . Das zu tun: </p> <blockquote><p> 1. Drücken Sie die <strong> Fenster <img src=\"images/image_thumb-97-958.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> Tasten zum Öffnen des Befehlsfelds &#39;Ausführen&#39; <strong><br> </strong> 2. Typ <strong> Power Shell </strong> und drücke dann <strong> STRG </strong> + <strong> VERSCHIEBUNG </strong> + <strong> EINGEBEN. </strong></p></blockquote> <p><img src=\"images/image_thumb-41-395.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Kopieren Sie bei PowerShell den folgenden Befehl und fügen Sie ihn ein und drücken Sie <strong> Eingeben </strong> : </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Unrestricted </li> </ul> <p> 3. Drücken Sie <strong> Ja </strong> und schlagen <strong> Eingeben </strong> bei der Ausführungsrichtlinien-Warnmeldung, um die Änderung zu akzeptieren. </p> <p><img src=\"images/image_thumb-9-581.png\" alt=\"Enable Running Scripts on Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Nachdem die Richtlinienänderung abgeschlossen ist, <strong> schließen </strong> das PowerShell-Fenster. </p> <p> 5. Führen Sie nun das Skript aus, das Ihnen den Fehler &quot;Scripts is Disabled&quot; mit gegeben hat <strong> Administrator </strong> Privilegien. Der Fehler sollte jetzt weg sein. * </p> <blockquote><p> * Hinweis: Wenn Sie immer noch die Fehlermeldung &quot;Skripte sind auf diesem System deaktiviert&quot; erhalten, geben Sie einen der folgenden Befehle ein und versuchen Sie erneut, Ihr Skript auszuführen: </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy RemoteSigned </li> <li> set-executionpolicy remotesigned </li> </ul> </blockquote> <p> 6. Kehren Sie schließlich zur vorherigen Einstellung der PowerShell-Ausführungsrichtlinie (Einschränkung) zurück, indem Sie diesen Befehl in PowerShell (Admin) ausführen: * </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Restricted </li> </ul> <p> * Hinweis: Nachdem Sie den obigen Befehl ausgeführt haben, erhalten Sie eine Warnmeldung, die die Sicherheitsrisiken einer Änderung der Ausführungsrichtlinie erläutert. Drücken Sie <strong> Ja </strong> , und drücken Sie dann <strong> Eingeben </strong> , um die Änderung zu akzeptieren und zu Ihrer vorherigen Richtlinieneinstellung zurückzukehren. </p> <p><img src=\"images/image_thumb-10-246.png\" alt=\"Disable running scripts windows 10\" loading=\"lazy\"></p> <p> 7. Schließen Sie das PowerShell-Fenster und fertig! </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um diese Lösung bekannt zu machen. </p>"}