{"title":"UPDATE: Net Framework 3.5 0x800F0906 Installationsfehler (Gelöst)","content":"<p> Der Installationsfehler Net Framework 3.5 0x800F0906 auf einem Windows 10/8/8.1-basierten Computer wird angezeigt, weil Windows die Quelldateien, die zum Installieren der .NET Framework 3.5-Funktion erforderlich sind, nicht herunterladen kann. </p> <p><strong> Problembeschreibung: </strong> Das Feature .NET Framework 3.5 kann nicht auf einem Computer mit Windows 10 (oder Windows 8/8.1) installiert werden und die Installation von NET Framework 3.5 wird mit dem Fehlercode 0x800F0906 abgebrochen: &quot;Windows konnte die angeforderten Änderungen nicht abschließen. Windows konnte&quot; t finden die erforderlichen Dateien, um die angeforderten Änderungen abzuschließen. Stellen Sie sicher, dass Sie mit dem Internet verbunden sind, und versuchen Sie es erneut.&quot; (CBS_E_DOWNLOAD_FAILURE) </p> <p><img src=\"images/image_thumb-52-525.png\" alt=\"FIX Net Framework 3.5 0x800F0906 Installation Error \" loading=\"lazy\"></p> <p> </p> <p> Dieses Tutorial enthält Anweisungen zum Beheben des Net Framework 3.5-Installationsfehlers 0x800F0906 in Windows 10/8/8.1. </p> <h4> So beheben Sie: Fehler 0x800F0906 während der Installation von NET FRAMEWORK 3.5. </h4> <p><strong> Wichtig: </strong> Bevor Sie mit den folgenden Methoden fortfahren, navigieren Sie zum Bedienfeld „Dienste“ (Systemsteuerung &gt; Verwaltung &gt; Dienste) und stellen Sie sicher, dass der Dienst „Windows Update“ ausgeführt wird. Wenn der Dienst nicht ausgeführt wird, doppelklicken Sie darauf und stellen Sie die <strong> Starttyp </strong> zu <strong> Automatisch </strong> . Dann klick <strong> OK </strong> und <strong> neu starten </strong> der Computer. Versuchen Sie nach dem Neustart, das .Net Framework zu installieren. Wenn das Problem besteht, fahren Sie mit den folgenden Methoden fort: * </p> <p> * Hinweis: Wenden Sie die folgenden Methoden nur an, wenn der Fehler 0x800F0906 auftritt, nachdem Sie die .Net Framework 3.5-Funktion über die Windows-Funktionen aktiviert haben. (Systemsteuerung -&gt; Programme und Funktionen -&gt; Windows-Funktionen aktivieren oder deaktivieren.) </p> <p><img src=\"images/image_thumb-38-525.png\" alt=\"install net framework 3.5 windows 8 and 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Methode 1. Entfernen Sie .NET FRAMEWORK 4.7 und installieren Sie dann .NET FRAMEWORK 3.5. </h6> <p> 1. Öffnen <strong> Programme und Funktionen </strong> und dann klick <strong> Schalte Windows Funktionen ein oder aus </strong> . </p> <p><img src=\"images/image_thumb-59-814.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Deaktivieren Sie das . <strong> NET-Framework </strong> <strong> 4.7 </strong> Kästchen an und klicke <strong> OK </strong> um die neueste installierte Version von NET FRAMEWORK zu entfernen. </p> <p><img src=\"images/image_thumb-41-739.png\" alt=\"disable net framework windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Aktivieren Sie beim Entfernen das .NET Framework 3.5 und klicken Sie auf <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-42-345.png\" alt=\"install net framework 3.5 windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Befolgen Sie die Anweisungen auf dem Bildschirm zum Herunterladen, um .NET FRAMEWORK 3.5 zu installieren. <br> 5. Wenn die Installation ohne Probleme abgeschlossen ist, aktivieren Sie das NET Framework 4.7 erneut. </p> <p><img src=\"images/image_thumb-43-506.png\" alt=\"enable net framework 3.5 windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Methode 2. Installieren Sie NET FRAMEWORK 3.5, das DISM verwendet. </h6> <p><strong> Bedarf </strong> : Um den „Net Framework 3.5 Installationsfehler 0x800F0906“ zu beheben, benötigen Sie ein Windows-Installationsmedium. Wenn Sie kein Windows-Installationsmedium besitzen, führen Sie das <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Das Media Creation-Tool von Microsoft </a> und laden Sie eine Kopie Ihrer Windows-Version im ISO-Format herunter. </p> <p> 1. Schließen Sie das Installationsmedium an Ihren Computer an (oder mounten Sie die Windows.ISO). <br> 2. Öffnen Sie den Windows Explorer und notieren Sie sich den Laufwerksbuchstaben des Windows-Mediums. <br> 3. Öffnen <strong> Eingabeaufforderung </strong> wie <strong> Administrator </strong> . Das zu tun: </p> <ul> <li> <ul> <li> <p> Geben Sie in das &quot;Suchfeld&quot; ein <strong> cmd </strong> oder <strong> Eingabeaufforderung </strong> . </p> </li> <li> <p> Rechtsklick auf <strong> Eingabeaufforderung </strong> Ergebnis und wählen Sie Als Administrator ausführen. </p> </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-39-800.png\" alt=\"command prompt administrator\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Geben Sie in der Eingabeaufforderung den folgenden Befehl ein und drücken Sie die Eingabetaste: * </p> <ul> <li> DISM /Online /Enable-Feature /FeatureName:NetFx3 /All /LimitAccess /Source:X:\\sources\\sxs </li> </ul> <p> * Hinweis: Ersetzen Sie den Buchstaben &quot;X&quot; im obigen Befehl entsprechend dem Laufwerksbuchstaben des Windows-Mediums. (Beispiel: Wenn der Laufwerksbuchstabe von Windows Media &quot;E&quot; ist, müssen Sie Folgendes eingeben: </p> <p> DISM /Online /Enable-Feature /FeatureName:NetFx3 /All /LimitAccess /Source:E:\\sources\\sxs </p> <p><img src=\"images/image_thumb-44-233.png\" alt=\"install framework 3.5 dism\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Methode 3. Installieren Sie NET FRAMEWORK 3.5 von PowerShell. </h6> <p><strong> Bedarf </strong> : Um den „Net Framework 3.5 Installationsfehler 0x800F0906“ zu beheben, benötigen Sie ein Windows Installationsmedium. Wenn Sie kein Windows-Installationsmedium besitzen, führen Sie das <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Das Media Creation-Tool von Microsoft </a> und laden Sie eine Kopie Ihrer Windows-Version im ISO-Format herunter. </p> <p> 1. Schließen Sie das Installationsmedium an Ihren Computer an (oder mounten Sie die Windows.ISO). <br> 2. Öffnen Sie PowerShell als Administrator. Das zu tun: </p> <ul> <li> <ul> <li> <p> Geben Sie in das &quot;Suchfeld&quot; ein <strong> Power Shell </strong> . </p> </li> <li> <p> Rechtsklick auf <strong> Windows PowerShell </strong> Ergebnis und auswählen <strong> Als Administrator ausführen </strong> . </p> </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-45-735.png\" alt=\"powershell administrator\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Geben Sie bei PowerShell den folgenden Befehl ein und drücken Sie <strong> Eingeben </strong> . </p> <ul> <li> Enable-WindowsOptionalFeature –Online –FeatureName &quot;NetFx3&quot; –Source X:\\sources\\sxs -LimitAccess </li> </ul> <p> * Hinweis: Ersetzen Sie den Buchstaben &quot;X&quot; im obigen Befehl entsprechend dem Laufwerksbuchstaben des Windows-Installationsmediums. </p> <p><img src=\"images/image_thumb-46-500.png\" alt=\"install framework 3.5 powershell\" loading=\"lazy\"></p> <p> </p> <h6> Methode 4. Reparieren Sie Windows 10. </h6> <p> Die letzte Methode zum Beheben des .NET Framework 3.5 0x800F0906-Installationsfehlers besteht darin, <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Reparieren Sie Windows 10 mit In-Place-Upgrade </a> . </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}