{"title":"UPDATE: Mac OS Remote Desktop Connection kann die Identität des Computers, zu dem Sie eine Verbindung herstellen möchten, nicht überprüfen. (Gelöst)","content":"<p> In diesem Tutorial finden Sie Anweisungen zum Beheben des Problems &quot;Remotedesktop-Verbindung kann die Identität des Computers, zu dem Sie eine Verbindung herstellen möchten, nicht überprüfen. Versuchen Sie, die Verbindung zum Windows-basierten Computer erneut herzustellen, oder wenden Sie sich an unseren Administrator.&quot;, wenn Sie dies versuchen Verbinden Sie sich über RDP von einem Mac OS-basierten Computer mit einem Windows RDSH Server 2016. </p> <p><img src=\"images/image_thumb-32-846.png\" alt=\"FIX: MAC OS Remote Desktop Connection cannot verify the identity of the computer that you want to connect to.\" loading=\"lazy\"></p> <p> </p> <h4> So beheben Sie: Die MacOSX Remote Desktop-Verbindung kann die Identität des Computers, zu dem Sie eine Verbindung herstellen möchten, nicht überprüfen. </h4> <h6> Methode 1. Laden Sie den neuesten RDP-Client aus dem MAC App Store herunter. </h6> <p> 1. Herunterladen und installieren und neuestes <a href=\"https://itunes.apple.com/us/app/microsoft-remote-desktop/id715768417?mt=12&ign-mpt=uo%3D4\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Remotedesktop-Client </a> auf deinem MAC. (Wenn Sie ein IOS-Gerät verwenden, laden Sie den RDP-Client herunter von <a href=\"https://itunes.apple.com/us/app/microsoft-remote-desktop/id714464092?mt=8&ign-mpt=uo%3D4\" target=\"_blank\" rel=\"nofollow noopener\"> Hier </a> .) <br> 2. Versuchen Sie nach der Installation erneut, eine Verbindung zum Windows RDP-Server herzustellen. Wenn das Problem weiterhin besteht, fahren Sie mit Methode 2 unten fort. </p> <p> </p> <h6> Methode 2. Ändern Sie die Gruppenrichtlinieneinstellungen auf dem RDSH-Server von Windows. </h6> <p> Ändern Sie auf dem Remotedesktop-Sitzungshostserver (RDSH) 2016 die Gruppenrichtlinie wie folgt: </p> <p> 1. Drücken Sie gleichzeitig die Windows <img src=\"images/image_thumb36-211.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ <strong> gpedit.msc </strong> &amp; Drücken Sie <strong> Eingeben. </strong></p> <p><img src=\"images/image_thumb-78-784.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Navigieren Sie im linken Bereich zu: </p> <ul> <li><strong> Computerkonfiguration </strong> &gt; <strong> Administrative Vorlagen </strong> &gt; <strong> Windows-Komponenten </strong> &gt; <strong> Remotedesktopdienste </strong> &gt; <strong> Host für Remotedesktop-Sitzungen </strong> &gt; <strong> Sicherheit </strong></li> </ul> <p> 4. Öffnen Sie im rechten Fenster die <strong> Erfordern die Verwendung einer bestimmten Sicherheitsschicht für Remote-Verbindungen (RDP) </strong> Rahmen. </p> <p><img src=\"images/image_thumb-36-865.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4a. Prüfen <strong> aktiviert </strong> , setzen Sie die &#39;Sicherheitsschicht&#39; auf <strong> RDP </strong> und klicke <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-37-183.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Öffnen Sie nun die <strong> Erfordern Sie die Benutzerauthentifizierung für Remoteverbindungen mithilfe der Authentifizierung auf Netzwerkebene </strong> Einstellung, stell es auf <strong> Deaktiviert </strong> und klicke <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-38-109.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Schließen </strong> der Gruppenrichtlinien-Editor. <br> 7. <strong> Neu starten </strong> den Computer, um Änderungen zu übernehmen oder eine Eingabeaufforderung mit erhöhten Rechten zu öffnen, und geben Sie den folgenden Befehl ein: </p> <ul> <li><strong> gpupdate /force </strong></li> </ul> <p> Das ist es! Welche Methode hat bei Ihnen funktioniert? <br> Lassen Sie mich wissen, ob dieser Leitfaden Ihnen geholfen hat, indem Sie Ihren Kommentar zu Ihren Erfahrungen hinterlassen. Bitte liken und teilen Sie diesen Leitfaden, um anderen zu helfen. </p>"}