{"title":"UPDATE: Server ist nicht erreichbar. Möglicherweise sind Sie nicht berechtigt, diese Netzwerkressource zu verwenden. Der Verweis ist ungültig. (Gelöst)","content":"<p> Dieses Tutorial enthält Anweisungen zum Beheben des folgenden Fehlers beim Versuch, auf einen freigegebenen Ordner im Netzwerk zuzugreifen: &quot;Server ist nicht zugänglich. Möglicherweise haben Sie keine Berechtigung zur Verwendung dieser Netzwerkressource. Wenden Sie sich an den Administrator dieses Servers, um herauszufinden, ob Sie Zugriff haben Berechtigungen. Das Handle ist ungültig.&quot; </p> <p><img src=\"images/image_thumb-5-437.png\" alt=\"You might not have permission to use this network resource\" loading=\"lazy\"></p> <p> </p> <h2> Wie FIX: Kann nicht auf freigegebene Ordner zugreifen. Möglicherweise sind Sie nicht berechtigt, diese Netzwerkressource zu verwenden. Der Verweis ist ungültig. </h2> <p> Normalerweise tritt das Problem mit der Dateifreigabeverbindung &quot;Sie haben möglicherweise keine Berechtigung zur Verwendung dieser Netzwerkressource&quot; auf, wenn ein Benutzer versucht, auf einen freigegebenen Netzwerkordner zuzugreifen, ohne über die erforderlichen Berechtigungen zu verfügen. In diesem Fall und um das Problem zu beheben, müssen Sie sicherstellen, dass der Benutzer die entsprechenden Zugriffsrechte auf den freigegebenen Ordner hat. </p> <p> Wenn Sie jedoch wissen, dass die Berechtigungen des Benutzers für den freigegebenen Ordner korrekt sind und das Verbindungsproblem &quot;Sie haben möglicherweise keine Berechtigung zur Verwendung dieser Netzwerkressource&quot; plötzlich und ohne ersichtlichen Grund aufgetreten ist, liegt das Problem wahrscheinlich an der Installation eines Windows Aktualisieren. Lesen Sie in diesem Fall weiter unten, um das Problem zu beheben. </p> <p> * Hinweis: Wenn Sie Mitte Januar 2019 mit dem Freigabefehler konfrontiert werden, ist das folgende Windows-Sicherheitsupdate der Schuldige: <a href=\"https://support.microsoft.com/el-gr/help/4480970/windows-7-update-kb4480970\" target=\"_blank\" rel=\"nofollow noopener\"> 8. Januar 2019 – KB4480970 (monatlicher Rollup) </a> . </p> <h6> Methode 1. Deinstallieren Sie das neueste Windows-Update. </h6> <p> Auf dem Computer mit dem freigegebenen Ordner: </p> <p> 1. Klicken Sie mit der rechten Maustaste auf das Symbol „Arbeitsplatz“ und wählen Sie <strong> Eigenschaften </strong> . <br> 2. Klicken Sie auf <strong> Windows Update </strong> . </p> <p><img src=\"images/image_thumb-6-686.png\" alt=\"fix Network Shared Folder is Not Accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. Klicken Sie auf <strong> Installierte Updates </strong> . </p> <p><img src=\"images/image_thumb-7-999.png\" alt=\"fix cannot access shared folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Sortieren Sie die Updates nach dem Installationsdatum, indem Sie auf klicken <strong> Installiert auf. </strong></p> <p><img src=\"images/image_thumb-8-158.png\" alt=\"uninstall windows update\" loading=\"lazy\"></p> <p> </p> <p> 5. Markieren Sie das neueste installierte Update für Windows und klicken Sie auf <strong> Deinstallieren. </strong> * </p> <p> * z.B. Wenn der Freigabefehler Mitte Januar 2019 auftritt, fahren Sie fort und deinstallieren Sie das &quot;Sicherheitsupdate für Microsoft Windows KB4480970&quot;. </p> <p><img src=\"images/image_thumb-9-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Wenn die Installation abgeschlossen ist, <strong> neu starten </strong> der Computer. <br> 7. Versuchen Sie nach dem Neustart erneut, vom Client-Rechner auf den freigegebenen Ordner zuzugreifen. Wenden Sie dann die vorgeschlagenen Aktionen entsprechend Ihrem Fall an: </p> <ul> <li><strong> Fall A: </strong> Wenn das Problem weiterhin besteht, deinstallieren Sie alle zuletzt installierten Updates oder fahren Sie fort mit <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Methode 2 </a> unten. </li> <li><strong> Fall B: </strong> Wenn das Problem behoben ist, verhindern Sie, dass das entfernte Update in Zukunft installiert wird. Das zu tun: </li> </ul> <blockquote><p> 1. Navigieren Sie zu Windows Update und <strong> Auf Updates prüfen </strong> . <br> 2. Klicken Sie auf <strong> Wichtige Aktualisierungen </strong> . </p></blockquote> <p><img src=\"images/image_thumb-22-393.png\" alt=\"view important updates\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 3. Klicken Sie mit der rechten Maustaste auf das problematische Update und klicken Sie auf <strong> Update ausblenden </strong> . <br> 4. Endlich klick <strong> OK </strong> und schließen Sie dann das Windows Update. </p></blockquote> <p><img src=\"images/image_thumb-23-795.png\" alt=\"hide update windows 7\" loading=\"lazy\"></p> <h6> Methode 2. Stellen Sie Ihren PC in einem früheren Arbeitszustand wieder her. </h6> <p> Auf dem Computer mit dem freigegebenen Ordner: </p> <p> 1. Drücken Sie Windows <img src=\"images/image_thumb8_thumb-632.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> -Tasten, um das Befehlsfeld Ausführen zu öffnen. <br> 2. Typ <strong> rstrui </strong> &amp; klicken <strong> OK </strong> um die Systemwiederherstellung zu starten. </p> <p><img src=\"images/rstui-1-300x148-611.png\" alt=\"rstui\" loading=\"lazy\"></p> <p> </p> <p> 3. Klicken Sie auf <strong> Nächster </strong> auf dem ersten Bildschirm. <br> 4. Wählen Sie einen früheren Arbeitsstatus (Datum/Uhrzeit) und klicken Sie auf <strong> Nächster </strong> um den Wiederherstellungsprozess zu starten. </p> <p><img src=\"images/image_thumb-50-355.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Versuchen Sie nach der Systemwiederherstellung erneut, vom Client-Rechner auf den freigegebenen Ordner zuzugreifen. </p> <p> Das war&#39;s Leute! Hat es bei dir funktioniert? <br> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um das Problem zu verbreiten. </p>"}