{"title":"WIE MAN: Internetverlauf, Passwörter und Cookies von Ihrem Webbrowser (Chrome, Firefox, IE) löschen","content":"<p> Wenn Sie mit Ihrem Webbrowser eine Website besuchen, sendet die Website einige Informationen an den Browser und der Browser speichert diese Informationen in kleinen Textdateien namens <strong> Plätzchen </strong> s. Die Cookies speichern die Präferenzen des Benutzers für diese Website, z.B. die Login-Informationen, damit der Benutzer die Login-Daten (Benutzername und/oder Passwort) nicht erneut eingeben muss, wenn er auf dieselbe Website zurückkehrt. Cookies können auch einen Verlauf darüber speichern, welche Seiten der Website der Benutzer besucht hat, sodass sich der Benutzer nicht daran erinnern oder durch alle Seiten der Website navigieren muss, bis er gefunden hat, was er möchte. </p> <p> Gleichzeitig speichert der Browser beim Besuch einer Website eine lokale Kopie aller von Ihnen besuchten Webseiten, um die Verbindungsbandbreite zu sparen und die Ladezeit der Webseiten beim nächsten Besuch zu verkürzen. Diese &quot;lokale Kopie von Webseiten&quot; ist bekannt als &quot; <strong> Temporäre Internetdateien </strong> &quot; von <strong> Zwischenspeicher </strong> . </p> <p> Cookies und Cache können nach einiger Zeit eine beträchtliche Menge Speicherplatz belegen und müssen daher gelöscht werden. In anderen Fällen müssen Sie möglicherweise den Browser-Cache und die Cookies löschen, um den Inhalt der Website vollständig neu zu laden oder aus Sicherheits- und Datenschutzgründen: z.B. Wenn Sie nicht möchten, kann eine dritte Person herausfinden, welche Webseiten Sie besucht haben (auch bekannt als: &quot; <strong> Browser-Verlauf </strong> &quot;) oder Ihre Zugangsdaten zu einer Website (z.B. GMAIL). </p> <p> In diesem Tutorial finden Sie zwei (2) einfache Möglichkeiten zum Löschen des Browserverlaufs, der temporären Internetdateien (Cache) und der Cookies aus Internet Explorer, Chrome und Firefox. </p> <h4> So löschen Sie den Webbrowserverlauf, gespeicherte Passwörter und Cookies in Chrome, Firefox und Internet Explorer. </h4> <h5><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Methode 1. Löschen Sie die Browserdaten aus einem bestimmten Browser. </a></h5> <h5><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Methode 2. Löschen Sie Browserdaten aus allen Webbrowsern mit einem Klick! </a></h5> <p> </p> <h5> Methode 1. Löschen Sie Verlauf, Cache und Cookies von einem bestimmten Browser. </h5> <p> Im Allgemeinen verfügt jeder Webbrowser über Optionen zum Entfernen der gespeicherten Browserdaten über das Menü Einstellungen / Optionen. Wenn Sie jedoch einfach auf diese Optionen zugreifen möchten (ohne mit der Maus durch das Browsermenü navigieren zu müssen), drücken Sie <strong> Strg </strong> + <strong> Verschiebung </strong> + <strong> Löschen </strong> Tasten zusammen in Ihrem geöffneten Browserfenster. So… </p> <p><strong> So löschen Sie den Browserverlauf, den Cache und die Cookies aus dem Internet Explorer: </strong></p> <p> 1. Öffnen Sie Internet Explorer und drücken Sie <strong> Strg </strong> + <strong> Verschiebung </strong> + <strong> Löschen. <br> </strong> 2. Wählen Sie aus, welche Informationen Sie löschen möchten, und klicken Sie auf <strong> Löschen </strong> Taste. </p> <p><img src=\"images/image_thumb-18-750.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> So löschen Sie den Browserverlauf, den Cache und die Cookies von Chrome: </strong></p> <p> 1. Starten Sie Chrome und drücken Sie <strong> Strg </strong> + <strong> Verschiebung </strong> + <strong> Löschen. <br> </strong> 2. Wählen Sie aus, welche Informationen Sie löschen möchten, und drücken Sie dann <strong> DATEN LÖSCHEN </strong> . </p> <p><img src=\"images/image_thumb-19-667.png\" alt=\"clear chrome history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p><strong> So löschen Sie den Browserverlauf, Cache und Cookies von Firefox: </strong></p> <p> 1. Öffnen Sie Firefox und drücken Sie gleichzeitig <strong> Strg </strong> + <strong> Verschiebung </strong> + <strong> Löschen. <br> </strong> 2. Wählen Sie die Daten aus, die Sie aus Firefox entfernen möchten, und klicken Sie auf <strong> Frei Jetzt. </strong></p> <p> </p> <p><img src=\"images/image_thumb-20-864.png\" alt=\"clear firefox history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> Methode 2.Löschen Sie Browserverlauf, Cache und Cookies von allen Webbrowsern gleichzeitig. </h5> <p> Wenn du dir das Leben leichter machen willst, dann kannst du die <a href=\"https://www.ccleaner.com/\" target=\"_blank\" rel=\"nofollow noopener\"> CCleaner </a> Dienstprogramm zum einfachen Löschen der temporären Internetdateien, des Verlaufs und der Cookies von allen von Ihnen verwendeten Webbrowsern mit einem Klick. </p> <p> 1. <a href=\"https://www.ccleaner.com/ccleaner/download\" target=\"_blank\" rel=\"nofollow noopener\"> Herunterladen </a> und installieren Sie die kostenlose Version des Dienstprogramms CCleaner. </p> <p> 2. Starten <strong> CCleaner </strong> und navigieren Sie zum <strong> Fenster </strong> und der <strong> Anwendungen </strong> Registerkartenoptionen, um auszuwählen, welche Informationen Sie aus den Webbrowsern löschen möchten. </p> <p> 3. Wenn Sie fertig sind, klicken Sie auf <strong> Laufreiniger </strong> . </p> <p><img src=\"images/image_thumb-21-173.png\" alt=\"clear internet history cache cookies - ccleaner\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Das ist alles! Hat es bei dir funktioniert? </p> <p> Bitte hinterlassen Sie einen Kommentar im Kommentarbereich unten oder noch besser: Liken und teilen Sie diesen Blogbeitrag in den sozialen Netzwerken, um die Nachricht von dieser Lösung zu verbreiten. </p>"}