{"title":"Cómo cambiar la conexión de la impresora HP de USB a inalámbrica.","content":"<p> Si posee una impresora HP con capacidad inalámbrica, conectada mediante un cable USB y desea cambiar su conexión a inalámbrica, lea este tutorial para realizar esta tarea. Las instrucciones son útiles si no tiene un enrutador compatible con WPS o si desea volver a configurar la configuración inalámbrica de la impresora, en caso de que haya cambiado su enrutador inalámbrico. </p> <h4> Cómo conectar una impresora conectada por USB a la red inalámbrica. </h4> <p> 1. Desde el panel de la impresora, presione el botón Inalámbrico <img src=\"images/image_thumb-55-307.png\" alt=\"image\" loading=\"lazy\"> para encender la conexión inalámbrica. * </p> <p> * Nota: Si ha conectado antes su impresora a otra red inalámbrica, mantenga presionado el <strong> Inalámbrica </strong> botón <img src=\"images/image_thumb-57-212.png\" alt=\"image\" loading=\"lazy\"> y el <strong> Cancelar </strong> botón <strong> X </strong> desde el panel de control de la impresora, para restaurar la configuración de la red inalámbrica a los valores predeterminados. (Este procedimiento funciona en la mayoría de los modelos de impresoras HP. Asegúrese en el manual de la impresora de que el proceso de restablecimiento es correcto). </p> <p> 2. Conecte su impresora a su computadora usando un cable USB. </p> <p> 3. Descargue e instale los últimos controladores y software de funciones completas para su impresora desde <a href=\"https://support.hp.com/us-en/drivers/printers\" target=\"_blank\" rel=\"nofollow noopener\"> Sitio de soporte de impresoras HP </a> . </p> <p> 4. Después de instalar el software de la impresora, abra el icono con el nombre de su impresora para iniciar el <strong> Asistente de impresora HP </strong> . </p> <p> 5. Haga clic en <strong> Configuración y software del dispositivo </strong> . </p> <p><img src=\"images/image_thumb-48-818.png\" alt=\" Change HP Printer Connection from USB to Wireless\" loading=\"lazy\"></p> <p> </p> <p> 6. Haga clic en <strong> Convierta un dispositivo conectado por USB a inalámbrico </strong> . </p> <p><img src=\"images/image_thumb-49-582.png\" alt=\"Connect HP Pinter to Wireless Network using the USB Connection\" loading=\"lazy\"></p> <p> </p> <p> 7. En la configuración inalámbrica, verifique que el nombre de la red inalámbrica (SSID) sea el correcto. Luego… </p> <blockquote><p> 1. Haga clic para <strong> Mostrar contraseña inalámbrica </strong> . </p> <p> 2. Asegúrese de que la contraseña inalámbrica sea correcta (de lo contrario, escriba su contraseña inalámbrica). </p> <p> 3. Seleccione <strong> Sí, quiero usar esta red. </strong> . </p> <p> 4. Haga clic en <strong> próximo </strong> . </p></blockquote> <p><img src=\"images/image_thumb-50-641.png\" alt=\"Connect HP Pinter to Wireless using USB\" loading=\"lazy\"></p> <p> </p> <p> 8. Espere hasta que se complete la configuración inalámbrica. </p> <p><img src=\"images/image_thumb-51-477.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Cuando se le pregunte, haga clic en <strong> sí </strong> en Compartir dispositivo. </p> <p><img src=\"images/image_thumb-52-556.png\" alt=\"Connect HP Pinter to Wireless network using USB\" loading=\"lazy\"></p> <p> </p> <p> 10. Cuando se complete la configuración inalámbrica, retire el cable USB y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb-58-143.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 11. Haga clic en <strong> OK </strong> para verificar la extracción del cable USB. </p> <p><img src=\"images/image_thumb-59-549.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 12. Ahora está listo para usar su impresora HP de forma inalámbrica. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}