{"title":"Cómo abrir PowerShell como administrador en la carpeta actual en el Explorador de archivos (Windows 10)","content":"<p> Si desea abrir PowerShell o PowerShell como administrador, en cualquier ubicación / carpeta en el Explorador de archivos, continúe leyendo este tutorial. Como sabe, las formas habituales de abrir PowerShell en Windows 10 es buscarlo usando la búsqueda de Cortana, o (más rápido) presionar <strong> Ganar <img src=\"images/image_thumb8_thumb_thumb-479.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"></strong> + <strong> X </strong> teclas para abrir el &quot;menú de usuario avanzado&quot; y ejecutar Windows PowerShell desde allí. </p> <p><img src=\"images/image_thumb-54-350.png\" alt=\"PoweShell Admin (Win + X menu)\" loading=\"lazy\"></p> <p> </p> <p> Si bien estos métodos son útiles, a veces es necesario abrir PowerShell en una ubicación / carpeta específica. Para hacer eso, siga las instrucciones a continuación. </p> <h4> Cómo abrir Windows PowerShell en una ubicación específica en Windows 10. </h4> <p> 1. Navegue a la carpeta donde desea abrir PowerShell. <br> 2. <strong> Sujetar </strong> la <strong> CAMBIAR </strong> clave y <strong> botón derecho del ratón </strong> en cualquier lugar dentro de la carpeta. <br> 3. En el menú contextual, seleccione <strong> Abra la ventana de PowerShell aquí </strong> a <strong> </strong> abra una nueva ventana de PowerShell en esa carpeta. </p> <p> </p> <p><img src=\"images/image_thumb-55-793.png\" alt=\"Open PoweShell at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Si desea abrir &#39;PowerShell como administrador&#39; en cualquier carpeta, haga clic en el <strong> Archivo </strong> menú y seleccione <strong> Abra Windows PowerShell como administrador </strong> . * </p> <p> * Nota: Como puede ver en el menú &#39;Archivo&#39;, también puede abrir una ventana de PowerShell &quot;simple&quot;. </p> <p><img src=\"images/image_thumb-56-830.png\" alt=\"Open PoweShell As Administrator at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p><strong> Ayuda adicional: </strong> Si eres fanático de los atajos de teclado, otra forma de abrir PowerShell (Admin) es presionar el botón <strong> Alt </strong> + <strong> F </strong> + <strong> S </strong> + <strong> A </strong> llaves en orden. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}