{"title":"Cómo controlar el mouse con el teclado en Windows 10/8/7.","content":"<p> Este tutorial contiene instrucciones sobre cómo controlar el mouse mediante el teclado, mediante la función &quot;Teclas del mouse&quot; en Windows. El artículo puede ser útil para las personas que no pueden operar el mouse o en los casos en que el mouse deja de funcionar (o no existe) y desea utilizar su teclado como mouse. para trabajar con su computadora para terminar un trabajo urgente. </p> <p> La <strong> Teclas del mouse </strong> La función está integrada en los sistemas operativos Windows 10, 7 o 7 y le permite usar el teclado numérico para mover el puntero del mouse en la pantalla y realizar todas las acciones habituales de un mouse (clic, doble clic, clic derecho). </p> <h4> Cómo usar su teclado como mouse. </h4> <h6> Método 1. Habilite las teclas del mouse mediante el método abreviado de teclado. * </h6> <p> El primer método para mover el cursor del mouse [sin un mouse <img src=\"images/wlemoticon-openmouthedsmile-273.png\" alt=\"Open-mouthed smile\" loading=\"lazy\"> ], es activar las teclas del mouse, de la siguiente manera: </p> <p> 1. Presione <strong> ALT izquierda </strong> + <strong> Shift izquierdo </strong> + <strong> Num lock </strong></p> <p><img src=\"images/image_thumb-10-220.png\" alt=\"How to Control Mouse with Keyboard \" loading=\"lazy\"></p> <p> </p> <p> 2. Cuando aparezca la ventana Teclas del mouse en la pantalla, presione <strong> INGRESAR </strong> para activar MouseKeys. </p> <p><img src=\"images/image_thumb-2-595.png\" alt=\"turn on mouse keys\" loading=\"lazy\"></p> <p> 3. Después de habilitar las teclas del mouse, puede usar su teclado (teclado numérico) para realizar todas las acciones del mouse (mover, hacer clic, hacer clic con el botón derecho, hacer doble clic) como se muestra en la figura siguiente. * </p> <p> * Nota: Si desea aumentar o disminuir la velocidad del puntero, lea las instrucciones del método siguiente. </p> <p><strong> Funciones del mouse desde el teclado numérico </strong></p> <p><img src=\"images/image_thumb-8-332.png\" alt=\"mouse functions numeric keypas\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Método 2. Habilite las teclas del mouse desde el Centro de accesibilidad. </h6> <p> El segundo método para poder controlar el puntero del mouse con su teclado, es encender y configurar la función &#39;Teclas del mouse&#39; desde el centro de Ease Access. Para hacer eso: </p> <p> 1. Vaya al Panel de control de Windows, configure &quot;Ver por&quot; en <strong> Iconos pequeños </strong> y luego abra el <strong> Centro de accesibilidad. </strong></p> <p><img src=\"images/image_thumb-3-309.png\" alt=\"use keyboard as mouse\" loading=\"lazy\"></p> <p> </p> <p> 2. Haga clic en <strong> Facilita el uso del mouse. </strong></p> <p><img src=\"images/image_thumb-4-518.png\" alt=\"enable mouse keys - ease of access\" loading=\"lazy\"></p> <p> </p> <p> 3. Luego haga clic en <strong> Configurar las teclas del mouse </strong> . </p> <p><img src=\"images/image_thumb-9-206.png\" alt=\"Configure Pointer Speed \" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Ahora, revisa el <strong> Encienda las teclas del mouse </strong> cuadro y haga clic en <strong> Solicitar. </strong><br> <strong> 5. </strong> Ahora intente mover el cursor del mouse usando el teclado numérico y configure el <strong> Velocidad del puntero </strong> como desées. (Haga clic en &#39;Aplicar&#39; en cada cambio y en &#39;Aceptar&#39; para cerrar las opciones de &#39;Teclas del mouse&#39;). </p> <p><img src=\"images/image_thumb-7-340.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}