{"title":"Cómo buscar actualizaciones en Office 2019, 2016 o 2013 en Windows 10.","content":"<p> En este tutorial, aprenderá a buscar actualizaciones manualmente en Office 2019, 2016 y Office 2013. En todas las versiones de Office, hay dos formas de instalar las actualizaciones de Office disponibles: automáticamente y manualmente. </p> <h4> Cómo actualizar Office 209/2016/2013/2010 manualmente. </h4> <h6> Método 1. Cómo comprobar manualmente las actualizaciones de Office en Office 2019, 2016 y Office 2013. </h6> <p> Para comprobar e instalar manualmente las actualizaciones de Office disponibles, en todas las versiones de Office: </p> <p> 1. Abra cualquier programa de Office (por ejemplo, Word). <br> 2. Desde <strong> Archivo </strong> menú, elija <strong> Cuenta </strong> . * </p> <p> * Nota: en Office 2010, elija <strong> Ayudar. </strong></p> <p> 3. Expanda el <strong> Opciones de actualización </strong> y haga clic en <strong> Actualizar ahora </strong> . * </p> <p> * Nota: Si las &quot;Opciones de actualización&quot; no están disponibles, siga las instrucciones del Método 2 a continuación. </p> <p><img src=\"images/image_thumb-19-478.png\" alt=\"How to Check for Updates in Office 2019, 2016 or 2013 in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Método 2. Cómo instalar automáticamente las actualizaciones de Office para Office 2019, 2016 y Office 2013. </h6> <p> Si desea que Windows descargue e instale las actualizaciones de Office disponibles automáticamente, navegue hasta la configuración de actualización de Windows y verifique la siguiente configuración: </p> <ul> <li> Reciba actualizaciones para otros productos de Microsoft cuando actualice Windows (Windows 10) </li> <li> Darme actualizaciones para otros productos de Microsoft cuando actualice Windows (Windows 7) </li> </ul> <h5> Para instalar las actualizaciones de Office automáticamente en Windows 10. </h5> <p><strong> 1. </strong> Ir <strong> Ajustes </strong> -&gt; <strong> Actualización y seguridad -&gt; Opciones avanzadas. </strong></p> <p><img src=\"images/image_thumb-20-149.png\" alt=\"Change Update Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> En Opciones de actualización, arrastre el control deslizante &#39;Recibir actualizaciones para otros productos de Microsoft cuando actualice Windows&#39; a <strong> EN. </strong></p> <p><img src=\"images/image_thumb-21-717.png\" alt=\"automatically install office updates windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Navegue a la pantalla anterior y haga clic en el <strong> Buscar actualizaciones </strong> en el que desea instalar las actualizaciones de Office disponibles de inmediato. </p> <p> </p> <h5> Para instalar las actualizaciones de Office automáticamente en Windows 7. </h5> <p> 1. Navega a <strong> Panel de control </strong> -&gt; <strong> actualizacion de Windows </strong> y haga clic en <strong> Cambiar ajustes </strong> . </p> <p><img src=\"images/image_thumb-22-108.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Seleccione el <strong> Darme actualizaciones para otros productos de Microsoft cuando actualice Windows </strong> casilla de verificación y haga clic en <strong> Solicitar </strong> . </p> <p> 3. Haga clic en <strong> Buscar actualizaciones </strong> para instalar todas las Actualizaciones disponibles. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta guía. </p> <p> </p>"}