{"title":"Cómo deshabilitar BitLocker en Windows 10.","content":"<p> Este tutorial contiene instrucciones sobre cómo deshabilitar la protección de Bitlocker y el cifrado de unidad en Windows 10. Como ya sabrá, la función de cifrado de BitLocker que está disponible en Windows 10 pro y las versiones empresariales puede ayudarlo a proteger el contenido de su PC del acceso no autorizado. Pero a veces es necesario deshabilitar Bitlocker en Windows 10, por lo que en esta guía puede encontrar cómo hacerlo. </p> <p> Si su computadora está protegida con BitLocker, cuando inicie el sistema, se le pedirá que conecte la unidad USB que utilizó durante la activación de BitLocker o que ingrese su contraseña de BitLocker para desbloquear la unidad C: para continuar con el arranque. Si no tiene ninguno de estos, presione <strong> ESC </strong> para ingresar su clave de recuperación de BitLocker. * </p> <blockquote><p> * Notas: <br> 1. Si no se acepta la clave de recuperación o la contraseña de Bitlocker al iniciar el sistema, intente desbloquear y descifrar el disco duro en otra computadora con Windows 10 o intente: <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-recovery-environment-winre/\" target=\"_blank\" rel=\"nofollow noopener\"> Desbloquee y descifre la unidad protegida en el entorno de recuperación de Windows (WinRE). </a><br> 2. Si no puede desbloquear la unidad (por ejemplo, si no posee la clave de recuperación de BitLocker o porque no se acepta la clave de BitLocker) y desea eliminar el cifrado de BitLocker para volver a utilizar la unidad protegida, lea este tutorial: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo quitar la protección de BitLocker de una unidad sin la clave o contraseña de recuperación de BitLocker </a> . </p></blockquote> <p><img src=\"images/image_thumb-53-752.png\" alt=\"How to Disable BitLocker in Windows 10 GUI - PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Después de iniciar Windows, siga las instrucciones a continuación para deshabilitar la protección de bitlocker y descifrar la unidad. </p> <h4> Cómo desactivar la protección de BitLocker y descifrar una unidad cifrada con BitLocker en Windows 10. </h4> <p> Para desactivar la protección de Bitlocker, debe tener la contraseña de Bitlocker o la clave de recuperación de Bitlocker para desbloquear la unidad primero y luego descifrarla. </p> <p> La clave de recuperación de Bitlocker es una clave numérica de 48 dígitos y se puede encontrar en las siguientes ubicaciones: </p> <ul> <li> En una impresión que guardó, cuando habilitó Bitlocker. </li> <li> En una unidad USB que utilizó, durante la activación de Bitlocker para guardar la clave de recuperación de Bitlocker. </li> <li> En el <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Claves de recuperación de cuentas de Microsoft </a> , utilizando la cuenta de MS que usa para iniciar sesión en su dispositivo, o ha agregado al dispositivo para descargar aplicaciones de Microsoft Store, o para activar MS Office o por correo electrónico. </li> <li> En tu <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Cuenta Azure </a> para PC de trabajo que inician sesión con una cuenta de Azure Active Directory. </li> </ul> <p> Una vez que encuentre la clave de recuperación de Bitlocker o la contraseña de Bitlocker, proceda a desbloquear la unidad cifrada de Bitlocker y a eliminar el cifrado de Bitlocker mediante una de las siguientes formas: </p> <ul> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Método 1. Deshabilite la protección de BitLocker desde la GUI de Windows. </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Método 2. Deshabilite BitLocker y descifre una unidad cifrada Bitlocker de PowerShell. </a></li> </ul> <p> </p> <h6> Método 1. Cómo desactivar la protección de Bitlocker en la GUI de Windows 10. </h6> <p> Para deshabilitar la protección en su System Drive C: </p> <p> 1. Navega a Windows <strong> Panel de control </strong> -&gt; <strong> Sistema y seguridad </strong> y luego haga clic en <strong> Cifrado de unidad Bit Locker </strong> . </p> <p><img src=\"images/image_thumb-33-233.png\" alt=\"How to turn off or Turn Onn BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Junto a la unidad C: del sistema operativo, haga clic en <strong> Desactivar BitLocker </strong> . * </p> <p> * Notas: <br> 1. Si la opción &quot;Desactivar BitLocker&quot; no está disponible, abra <strong> símbolo del sistema como administrador </strong> y da el siguiente comando: </p> <ul> <li> administrar-bde -off C: </li> </ul> <p> 2. Para ver el estado de descifrado (progreso) de la unidad C:, dé este comando: </p> <ul> <li> administrar-bde -status C: </li> </ul> <p> </p> <p> </p> <p><img src=\"images/image_thumb-43-236.png\" alt=\"turn off bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Después de apagar Bitlocker, haga clic en el icono de Bitlocker en la barra de tareas para ver el proceso de descifrado. </p> <p><img src=\"images/image_thumb-41-694.png\" alt=\"remove bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Para deshabilitar la protección en cualquier otra unidad protegida con BitLocker desde la GUI de Windows: </p> <p> 1. Abra el Explorador de Windows y luego haga doble clic en la unidad bloqueada. <br> 2. Ingrese la contraseña de Bitlocker o haga clic en <strong> Mas opciones </strong> para ingresar la clave de recuperación de Bitlocker, para desbloquear la unidad. </p> <p><img src=\"images/image_thumb-47-646.png\" alt=\"unlock bitlocker windows 10\" loading=\"lazy\"></p> <p> 2. Después de desbloquear la unidad, navegue hasta <strong> Panel de control </strong> -&gt; <strong> Sistema y seguridad </strong> -&gt; <strong> Cifrado de unidad Bit Locker </strong> y después de seleccionar la unidad, haga clic en <strong> Desactivar BitLocker </strong> para descifrar la unidad. (vea las capturas de pantalla de arriba) </p> <p> </p> <h6> Método 2. Cómo desactivar la protección de BitLocker y descifrar una unidad cifrada con Bitlocker de PowerShell en Windows 10. </h6> <p> 1. Abra PowerShell como administrador. Para hacer eso: </p> <ol> <li> <ol> <li> A <strong> Cortana </strong> Cuadro de búsqueda, escriba <strong> potencia Shell </strong></li> <li> Clic derecho en <strong> Windows PowerShell </strong> resultado y seleccione <strong> Ejecutar como administrador. </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb_thumb-1-316.png\" alt=\"disable bitlocker powershell windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Luego, verifique el estado de cifrado de cada unidad en su computadora, escribiendo este comando: </p> <ul> <li><strong> administrar-estado-bde </strong></li> </ul> <p> </p> <p> 3. Tenga en cuenta en qué letra de unidad muestra el estado de bloqueo <strong> Bloqueado </strong> y luego proceda a desbloquear esa unidad, escribiendo este comando: * </p> <ul> <li><strong> manage-bde -unlock drive-letter: -rp BitLocker-recovery-key </strong></li> </ul> <p> * Por ejemplo: si desea desbloquear la unidad &quot;D:&quot; y la clave de recuperación de bitlocker es: &quot;123456-123456-123456-123456-123456-123456&quot;, escriba: </p> <ul> <li> <ul> <li> administrar-bde-desbloquear D: -rp 123456-123456-123456-123456-123456-123456 </li> </ul> </li> </ul> <p> </p> <p> * Nota: Si conoce la contraseña de Bitlocker, proporcione este comando: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -pw BitLocker-Password </strong></li> </ul> <p> * por ejemplo: Si desea desbloquear la unidad &quot;D:&quot; y la contraseña de BitLocker es: &quot;123qwerty&quot;, escriba: * </p> <ul> <li> <ul> <li> administrar-bde-desbloquear D: -contraseña 123qwerty </li> </ul> </li> </ul> <p> </p> <p> 4. Luego, desactive el cifrado bitlocker y descifre la unidad cifrada mediante uno de los siguientes comandos: </p> <ul> <li><strong> Disable-BitLocker -MountPoint &quot;letra de unidad:&quot; </strong></li> <li><strong> manage-bde -off drive-letter: </strong></li> </ul> <p> * por ejemplo: si desea desactivar el cifrado de bitlocker en la unidad &quot;D:&quot;, escriba: </p> <ul> <li> <ul> <li> Deshabilitar BitLocker -MountPoint &quot;D:&quot; </li> </ul> </li> </ul> <blockquote> <p> O escriba ... </p> </blockquote> <ul> <li> <ul> <li> manage-bde –off D: </li> </ul> </li> </ul> <p> 5. Cuando se complete el proceso de descifrado, proceda a verificar nuevamente el estado del cifrado dando este comando: </p> <ul> <li><strong> administrar-estado-bde </strong></li> </ul> <p> 6. Si se muestra &quot;Estado de bloqueo&quot; <strong> Desbloqueado </strong> y el &#39;Estado de conversión&#39; muestra <strong> Totalmente descifrado, </strong> ya terminaste! </p> <p><img src=\"images/image_thumb-50-868.png\" alt=\"view bitlocker status\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este problema. </p>"}