{"title":"Cómo ver y exportar contraseñas de Chrome.","content":"<p> En este tutorial, le mostraré cómo ver, administrar o exportar a un archivo, las contraseñas guardadas para cada sitio web que visite en Google Chrome. Como ya sabe, el navegador Chrome le pide que guarde sus credenciales de inicio de sesión (nombre de usuario y contraseña) la primera vez que visita un sitio web. </p> <p><img src=\"images/image_thumb-97-400.png\" alt=\"view-chrome-passwords\" loading=\"lazy\"></p> <p> Al permitir que Chrome guarde sus credenciales, la próxima vez que inicie sesión en el sitio web, el navegador Chrome completará automáticamente los campos de inicio de sesión. Pero al hacer eso, muchos usuarios (incluido yo), olvidan sus credenciales de inicio de sesión con el tiempo, por lo que en este tutorial encontrará la forma de ver, administrar o guardar en un archivo las contraseñas guardadas de Chrome. </p> <h4> Cómo administrar, mostrar y exportar las contraseñas guardadas en Google Chrome. </h4> <p> 1. Desde el menú de Chrome <img src=\"images/image_thumb-78-707.png\" alt=\"image\" loading=\"lazy\"> Seleccione <strong> Ajustes </strong> . </p> <p><img src=\"images/image_thumb-79-605.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> 2. En las opciones de Autocompletar, haga clic en <strong> Contraseñas </strong> . </p> <p><img src=\"images/image_thumb-80-931.png\" alt=\"manage chrome passwords\" loading=\"lazy\"></p> <p> </p> <p><strong> Cómo ver las contraseñas de Chrome. </strong></p> <p> 1. Para ver la contraseña almacenada en Chrome para un sitio específico, haga clic en el <strong> Mostrar contraseña </strong><img src=\"images/image_thumb-86-925.png\" alt=\"image\" loading=\"lazy\"> icono. </p> <p><img src=\"images/image_thumb-87-291.png\" alt=\"view chrome passwords\" loading=\"lazy\"></p> <p> </p> <p> 2. Escriba la contraseña de inicio de sesión de Windows cuando se le solicite y haga clic en <strong> OK </strong> para revelar la contraseña guardada para el sitio. </p> <p><img src=\"images/image_thumb-88-816.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Para eliminar la contraseña guardada para el sitio, haga clic en el menú de tres puntos <img src=\"images/image_thumb-89-602.png\" alt=\"image\" loading=\"lazy\"> junto al nombre del sitio y haga clic en <strong> Eliminar </strong> . </p> <p><img src=\"images/image_thumb-91-954.png\" alt=\"remove chrome passwords\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Cómo guardar todas las contraseñas de Chrome en un archivo. </strong></p> <p> 1. Para guardar en un archivo de Excel (.csv), todos los nombres de usuario y contraseñas de inicio de sesión guardados para todos los sitios web, haga clic en el menú de tres puntos <img src=\"images/image_thumb-92-183.png\" alt=\"image\" loading=\"lazy\"> junto a &#39;Contraseñas guardadas&#39; y haga clic en <strong> Exportar </strong> . </p> <p><img src=\"images/image_thumb-93-646.png\" alt=\"export chrome passwords\" loading=\"lazy\"></p> <p> </p> <p> 2. En la siguiente ventana, haga clic en <strong> Exportar contraseñas </strong> . </p> <p><img src=\"images/image_thumb-94-438.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Escriba su contraseña de inicio de sesión de Windows cuando se le solicite y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-95-376.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Guarde &quot;Chrome Passwords.csv&quot; en su computadora. </p> <p><img src=\"images/image_thumb-96-130.png\" alt=\"save chrome passwords\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}