{"title":"Cómo iniciar sesión automáticamente en Windows 10/8/7 (sin escribir una contraseña).","content":"<p> Este tutorial contiene instrucciones sobre cómo iniciar sesión automáticamente en Windows 10. De hecho, aprenderá cómo iniciar sesión automáticamente en su cuenta de usuario (cuenta de Microsoft, local o de dominio), sin tener que ingresar sus credenciales al iniciar sesión o en la pantalla de bloqueo. . Las instrucciones se aplican al sistema operativo Windows 10/8/7. </p> <p> Cuando realice una nueva instalación de Windows 10, se le pedirá que especifique una cuenta de usuario y una contraseña para usar la computadora. En este paso, puede usar su cuenta de Microsoft (con la contraseña de su cuenta de MS) o crear una nueva cuenta local y una nueva contraseña para iniciar sesión en Windows. En ambos casos (a menos que cree una cuenta local con una contraseña en blanco), se le pedirá que escriba su contraseña cada vez que inicie Windows. </p> <p> Proteger su propia computadora con una contraseña es una buena medida de seguridad, especialmente si comparte su computadora con otras personas, o cuando viaja con su computadora portátil, o cuando su computadora pertenece a un entorno empresarial. Pero, si es el único usuario de su computadora de escritorio independiente, o si usa su computadora portátil solo en casa, no es necesario que ingrese sus credenciales cada vez que desee usarla. * </p> <p><strong> Advertencia: </strong> NO HABILITE EL INICIO DE SESIÓN AUTOMÁTICO en Windows si comparte su computadora con otras personas, o si viaja con su computadora portátil o tableta, porque todos los que encuentren su computadora tendrán fácil acceso a sus archivos. </p> <h4> Cómo iniciar sesión automáticamente en su cuenta de usuario en Windows 10/8/7 / Vista. (Habilitar inicio de sesión automático) </h4> <h6> Método 1. Active el inicio de sesión automático mediante la utilidad AUTOLOGON. </h6> <p> Microsoft ha diseñado una herramienta para automatizar el proceso de inicio de sesión en Windows. La herramienta se llama &quot;Autologon&quot; y le permite configurar fácilmente Windows para iniciar sesión automáticamente sin tener que escribir sus credenciales en cada inicio. La ventaja de esta herramienta es que la contraseña se almacena cifrada en el registro. </p> <p> 1. Descarga <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/autologon\" target=\"_blank\" rel=\"nofollow noopener\"> Autologon </a> utilidad. <br> 2. Extraiga el archivo descargado. <br> 3. Ejecute &quot;autologon.exe&quot; <br> 4. Escriba su contraseña y haga clic en <strong> Permitir </strong> . </p> <p><img src=\"images/image_thumb-44-251.png\" alt=\"windows auto login\" loading=\"lazy\"></p> <p> * Nota: Si desea desactivar el inicio de sesión automático, vuelva a ejecutar la utilidad y haga clic en <strong> Desactivar </strong> . </p> <p> </p> <h6> Método 2. Habilite el inicio de sesión automático desde el panel de control de Cuentas de usuario. </h6> <p> El segundo método para habilitar el inicio de sesión automático en Windows 10/8/7 es deshabilitar la configuración &quot;Los usuarios deben ingresar un nombre de usuario y contraseña para usar esta computadora&quot; en el panel de control de Cuentas de usuario. Para hacer eso: </p> <p> Nota: si está utilizando una cuenta local, hay otra forma más sencilla de forzar a Windows a iniciar sesión automáticamente: simplemente especifique una nueva contraseña en blanco (vacía) en Configuración&gt; Cuentas&gt; Opciones de inicio de sesión&gt; Cambiar contraseña. Luego escriba su contraseña una vez y luego haga clic en Siguiente dos veces y luego en Finalizar. </p> <p> 1. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-738.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. En el cuadro &quot;Abrir&quot;, escriba: <strong> controlar userpasswords2 </strong> &amp; haga clic <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-29-873.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. En las opciones de Cuentas de usuario (pestaña &quot;Usuarios&quot;), <strong> desmarcar </strong> la <strong> Los usuarios deben ingresar un nombre de usuario y contraseña para usar esta casilla de verificación de computadora </strong> y luego haga clic en <strong> Solicitar. * </strong></p> <p> * Nota: Si desea deshabilitar el inicio de sesión automático en el futuro, simplemente marque esta casilla. </p> <p><img src=\"images/image_thumb-32-315.png\" alt=\"auto login windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Escriba (dos veces) la contraseña de su cuenta y haga clic en <strong> OK </strong> dos veces para cerrar las propiedades de la cuenta de usuario. </p> <p><img src=\"images/image_thumb-31-509.png\" alt=\"Auto Login to Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Método 3. Habilite el inicio de sesión automático en el registro (Windows 10/8/7 / Vista). </h6> <p> El último método para deshabilitar el inicio de sesión con contraseña, en el sistema operativo Windows 10, 8 o 7, es habilitar el registro de inicio de sesión automático. Para hacer eso: </p> <p> 1. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-512.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. En el cuadro &quot;Abrir&quot;, escriba: <strong> regedit </strong> &amp; haga clic <strong> OK </strong> . </p> <p><img src=\"images/image_thumb7-114.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Navegue a esta tecla desde el panel izquierdo: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows NT \\ CurrentVersion \\ Winlogon </li> </ul> <p> 4. En el panel derecho: </p> <blockquote><p> una. Haga clic derecho en un espacio vacío y seleccione <strong> Nuevo </strong> &gt; <strong> Valor de cadena. </strong></p> <p><img src=\"images/image_thumb-38-930.png\" alt=\"image\" loading=\"lazy\"></p> <p> B. Cambie el nombre del nuevo valor a <strong> DefaultUserName </strong> y presione <strong> Ingresar </strong> . <br> C. Abra el valor REG_SZ &#39;DefaultUserName&#39;. <br> D. Escriba el nombre de su cuenta de usuario local o su cuenta de Microsoft y haga clic en <strong> OK </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-42-933.png\" alt=\"enable auto login registry\" loading=\"lazy\"></p> <p> </p> <p> 5a. Realice los mismos pasos y cree un nuevo valor REG_SZ (String) y asígnele el nombre <strong> Contraseña predeterminada </strong> . <br> 5b. Haga doble clic en &#39;DefaultPassword <strong> &#39; </strong> REG_SZ, escriba su contraseña en el cuadro Información del valor y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-43-192.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7a. Finalmente, cree un nuevo valor REG_SZ y asígnele el nombre <b> AutoAdminLogon </b> . <br> 7b. Haga doble clic en el valor &#39;AutoAdminLogon&#39;, escriba <strong> 1 </strong> en el cuadro Información del valor y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-41-705.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Cierre el Editor del Registro y reinicie su PC. * </p> <p> * Notas: <br> 1. Si su computadora es parte de un dominio, entonces debe crear otro valor REG_SZ con el nombre <strong> DefaultDomainName </strong> y luego para escribir en el cuadro de datos de valor el nombre de su dominio. <br> 2. Para deshabilitar el inicio de sesión automático en el futuro, simplemente elimine los valores de cadena recién creados que se mencionaron anteriormente. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}