{"title":"Cómo descifrar archivos cifrados EFS y eliminar cifrado EFS en Windows 10.","content":"<p> En un tutorial anterior había descrito la forma de <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> cifre sus archivos utilizando el cifrado EFS </a> . En este tutorial, descubrirá cómo eliminar el cifrado EFS y cómo descifrar los archivos cifrados EFS después de transferirlos a otra computadora. </p> <h4> Cómo descifrar los archivos cifrados EFS y deshabilitar el cifrado EFS. </h4> <ul> <li> <p><a href=\"#part-1\"> Parte 1. Cómo deshabilitar y eliminar el cifrado EFS en la misma PC. </a></p> </li> <li> <p><a href=\"#part-2\"> Parte 2. Cómo descifrar archivos EFS en otra PC. </a></p> </li> </ul> <h6> Parte 1. Cómo deshabilitar y eliminar el cifrado EFS. </h6> <p> Cuando cifra sus archivos con EFS, la clave de descifrado (certificado) se almacena localmente en su computadora y los archivos ya están descifrados. Si desea deshabilitar el cifrado EFS para dejar de cifrar sus archivos / carpetas: </p> <p> 1. Haga clic con el botón derecho en la carpeta / archivo cifrado y cambie el <strong> Propiedad del archivo </strong> a <strong> Personal </strong> . </p> <p><img src=\"images/image_thumb-26-500.png\" alt=\"how to disable efs encryption\" loading=\"lazy\"></p> <p> 2. Cuando termine, debería ver que la carpeta / archivo está desbloqueado. Simplemente realice los mismos pasos para eliminar el cifrado en todas las demás carpetas y archivos cifrados. </p> <p> 3. Ahora, si no utiliza el cifrado EFS en ningún otro archivo / carpeta y desea eliminar por completo la clave de recuperación EFS (también conocida como &quot;clave de descifrado - certificado&quot;) de su PC: </p> <blockquote> <p> 1. Abra Internet Explorer y desde el <strong> Herramientas </strong> selección de menú <strong> opciones de Internet </strong> . (o, abierto <strong> opciones de Internet </strong> de <strong> Panel de control </strong> .) </p> <p> 2. En <strong> Contenido </strong> haga clic en la pestaña <strong> Certificados </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-27-186.png\" alt=\"how to remove efs certificate-recovery key\" loading=\"lazy\"></p> <blockquote> <p> 3. En la pestaña Personal, seleccione el certificado de descifrado y haga clic en <strong> Eliminar </strong> . * </p> <p><strong> * Atención: </strong> Asegúrese de haber eliminado (detenido) el cifrado de todos los archivos cifrados antes de eliminar el certificado (clave de descifrado) </p> </blockquote> <p><img src=\"images/image_thumb-25-639.png\" alt=\"how to remove efs recovery key\" loading=\"lazy\"></p> <blockquote> <p> 4. <strong> Reanudar </strong> tu computadora. </p> </blockquote> <h6></h6> <h6> Parte 2: Cómo descifrar los archivos cifrados con EFS en otra computadora. </h6> <p> Si ha transferido los archivos cifrados EFS a otra computadora, entonces la única forma de ver (abrir) los archivos EFS es poseer la clave de descifrado. La clave de descifrado es el archivo .pfx del certificado que exportó cuando cifró los archivos. Si no tiene la clave de descifrado EFS, no hay forma de descifrar los archivos EFS. </p> <p><strong> Para descifrar archivos cifrados con EFS, utilizando la clave de descifrado - Certificado: </strong></p> <p> 1. Haga doble clic en la clave de descifrado (archivo .pfx del certificado) para instalarlo. <br> 2. En la pantalla de bienvenida del Asistente de importación de certificados, haga clic en <strong> próximo </strong> . <br> 3. Luego haga clic en <strong> próximo </strong> de nuevo. </p> <p><img src=\"images/image_thumb38_thumb-158.png\" alt=\"How to Decrypt EFS Encrypted files\" loading=\"lazy\"></p> <p> 4. Escriba la contraseña que utilizó cuando exportó la clave del certificado y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb39_thumb-680.png\" alt=\"install efs .pfx certificate\" loading=\"lazy\"></p> <p> 5. Deje la configuración predeterminada en las opciones del almacén de certificados y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb40_thumb-629.png\" alt=\"image_thumb[40]\" loading=\"lazy\"></p> <p> 6. Por último, haga clic en <strong> Terminar </strong> . </p> <p><img src=\"images/image_thumb41_thumb-225.png\" alt=\"image_thumb[41]\" loading=\"lazy\"></p> <p> </p> <p> 7. Ahora puede abrir los archivos cifrados. * </p> <p> * Nota: Después de descifrar los archivos, siga las instrucciones en <a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> parte 1 </a> arriba, para eliminar completamente el cifrado si lo desea. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución </p>"}