{"title":"Cómo quitar la protección de BitLocker de la unidad C del sistema: sin la clave o contraseña de recuperación de BitLocker.","content":"<p> Este artículo contiene instrucciones paso a paso sobre cómo eliminar la protección de BitLocker en la unidad del sistema C: para poder realizar una instalación limpia de Windows 10 en una computadora protegida con BitLocker, si no tiene la clave de recuperación de BitLocker o la contraseña de BitLocker o si no puede desbloquear la unidad BitLocker por algún motivo. </p> <p><img src=\"images/image_thumb-51-648.png\" alt=\"Fix Refresh your PC error: Drive where windows is installed is locked\" loading=\"lazy\"></p> <p> </p> <p> Cuando un dispositivo con Windows 10 (portátil o PC) está protegido con BitLocker, la única forma de acceder a su contenido o restablecer el dispositivo (mediante las funciones &quot;Restablecer esta PC&quot;, &quot;Actualizar su PC&quot;) o reinstalar Windows, consiste en desbloquear la unidad C del sistema operativo: mediante la clave de recuperación de BitLocker o la contraseña de BitLocker. </p> <p> Si no tiene la clave de recuperación de BitLocker o la contraseña de BitLocker para desbloquear la unidad del sistema C: o no se acepta la clave de BitLocker, entonces la única opción que dejó (desafortunadamente) es borrar completamente la unidad y realizar una instalación limpia de Windows. </p> <p> En este tutorial, encontrará instrucciones sobre cómo resolver el siguiente problema al intentar instalar Windows 10 o restablecer un dispositivo Windows 10 a su estado predeterminado de fábrica: &quot;La unidad donde está instalado Windows está bloqueada. Desbloquee la unidad e intente nuevamente &quot;. </p> <h4> Cómo limpiar la instalación de Windows 10 en una computadora protegida con BitLocker (REVISIÓN: No se puede instalar / actualizar Windows 10: la unidad está bloqueada con BitLocker). </h4> <p><strong> Requisito: </strong> <strong> Un medio de instalación de Windows 10 (USB o DVD). </strong><br> Si no posee un medio de instalación de Windows, puede crear uno utilizando <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Herramienta de creación de medios de Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo crear un medio de instalación USB de Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo crear un medio de instalación de DVD de Windows 10. </a></li> </ul> <p> Para realizar una instalación limpia de Windows 10, en una computadora / unidad protegida con BitLocker, siga las instrucciones a continuación: * </p> <p><strong> * PRECAUCIÓN: EL PROCEDIMIENTO A CONTINUACIÓN BORRARÁ TODOS LOS DATOS ALMACENADOS EN LA UNIDAD BLOQUEADA. PROCEDA SOLO SI USTED <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> NO SE PUEDE DESBLOQUEAR LA UNIDAD / COMPUTADORA PROTEGIDA POR BITLOCKER. </a></strong></p> <p> 1. Inicie su sistema desde el medio de instalación de Windows 10. * </p> <p> * Nota: <strong> </strong> Para poder arrancar desde Windows Media (USB o DVD), siga los pasos a continuación: </p> <ul> <li><strong> Método 1: </strong> Después del encendido, presione la tecla de función correspondiente (comúnmente es la tecla &quot;F12&quot; o &quot;F8&quot;) para ver las opciones de &quot;Orden de inicio&quot; o &quot;Menú de inicio&quot;. Luego seleccione el dispositivo USB (o DVD) que contiene los medios de instalación de Windows (archivos) y presione Enter. </li> <li><strong> Método 2: </strong> Ingrese a la Configuración del BIOS (Configuración) y configure los Medios de instalación de Windows como el &quot;Primer dispositivo de inicio&quot; en el menú &quot;Orden de inicio&quot;. Luego <strong> Guardar y Salir </strong> desde la configuración del BIOS. </li> </ul> <p> 2. En la pantalla de abajo presione el <strong> CAMBIAR </strong> + <strong> F10 </strong> teclas para iniciar el símbolo del sistema. (o presione <strong> próximo </strong> &gt; <strong> Reparar mi computadora </strong> &gt; <strong> Solucionar problemas </strong> &gt; <strong> Símbolo del sistema </strong> ). * </p> <p> * Nota: Si solicitó la clave de recuperación, haga clic en <strong> SALTAR esta unidad </strong> . </p> <p><img src=\"images/image_thumb15_thumb-290.png\" alt=\"How to Remove Updates from the Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. En el símbolo del sistema, proporcione los siguientes comandos en orden: </p> <ul> <li><strong> diskpart </strong></li> <li><strong> lista de disco </strong></li> <li><strong> seleccionar disco 0 </strong></li> <li><strong> volumen de lista </strong></li> </ul> <p> 4. Ahora localice cuál de los volúmenes enumerados tiene el tamaño más grande en GB. Por lo general, el volumen más grande es donde se instaló Windows (la unidad bloqueada). * </p> <p> * p.ej. En la siguiente captura de pantalla, el &quot;Volumen 2&quot; tiene el tamaño más grande. </p> <p> </p> <p><img src=\"images/image_thumb-10-992.png\" alt=\"fix drive is locked Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Luego, seleccione el volumen más grande escribiendo este comando: * </p> <ul> <li><strong> seleccionar el número de volumen </strong></li> </ul> <p> * Nota: cambie el número de volumen en el comando anterior según su caso (por ejemplo, &quot;seleccionar volumen 2&quot;) </p> <p> 5. Finalmente elimine el volumen seleccionado dando este comando: </p> <p> </p> <ul> <li><strong> eliminar anulación de volumen </strong></li> </ul> <p><img src=\"images/image_thumb-14-714.png\" alt=\"delete volume override\" loading=\"lazy\"></p> <p> </p> <p> 6. Escriba <strong> Salida </strong> para cerrar la herramienta DISKPART y luego cerrar el símbolo del sistema. <br> 7. Apague y vuelva a encender su dispositivo. <br> 8. Arranque desde los medios de instalación de Windows. <br> 9. Haga clic en <strong> próximo </strong> y entonces <strong> Instalar ahora </strong> . <br> 10. Elija &quot;No tengo una clave de producto&quot; y luego acepte el acuerdo de licencia. <br> 11. Seleccione &quot;Instalación personalizada&quot; y luego elimine todas las particiones / volúmenes restantes en el disco. </p> <p><img src=\"images/image_thumb-12-362.png\" alt=\"cannot reset windows 10 drive locked with bitlocker\" loading=\"lazy\"></p> <p> </p> <p> 12. Cuando termine, elija &quot;Espacio no asignado&quot; y haga clic en <strong> Próximo. <br> </strong> 13. Siga las instrucciones en pantalla para <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> limpiar instalar Windows 10 </a> . </p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este problema. </p>"}