{"title":"Cómo crear instantáneas de archivos con el programador de tareas en Windows 10.","content":"<p> En un tutorial anterior mencioné la forma de hacer una copia de seguridad de sus archivos personales con <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Historial del archivo </a> en Windows 10. En este tutorial, mostraré cómo crear instantáneas de sus archivos personales de forma automática mediante el Programador de tareas. Las instantáneas de sus archivos le permitirán revertir un archivo o carpeta específica a una versión anterior (un momento determinado). </p> <p> La función Instantánea se introdujo por primera vez en Windows Server 2003 y luego se agregó a las versiones de Windows Vista y 7, como parte de la función Restaurar sistema. El proceso de &#39;instantáneas&#39; puede realizar copias de seguridad e instantáneas del estado actual del sistema y de los archivos personales, incluso si está en uso. El proceso de recuperación de archivos de las instantáneas se conoce más comúnmente como &quot;Restaurar versiones anteriores&quot;. </p> <h4> Cómo crear diariamente una instantánea de sus archivos en Windows 10. * </h4> <p><strong> * Notas: </strong><br> 1. Si sigue las instrucciones a continuación, podrá crear instantáneas (instantáneas) diarias de todo el volumen &quot;C: \\&quot;. (Archivos de sistema de Windows y datos personales) <br> 2. Las instantáneas se pueden usar para restaurar sus archivos a un punto anterior en el tiempo, usando la función &#39;Restaurar versión anterior&#39;, o usando una utilidad de terceros que puede acceder a las instantáneas, como la <a href=\"https://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> Explorador de sombras </a> o el <a href=\"https://www.nirsoft.net/utils/shadow_copy_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowCopyView </a> . <br> 3. Las instantáneas <strong> no se puede utilizar para restaurar su sistema </strong> a un punto anterior en el tiempo, utilizando el <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> Restauración del sistema </a> herramienta. Si desea poder restaurar su sistema mediante Restaurar sistema, proceda y <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Active la protección Restaurar sistema. </a> <br> 4. Por último, tenga en cuenta que las instantáneas creadas no son una copia de seguridad confiable, porque las &#39;instantáneas&#39; se almacenan en su disco principal C: \\, y si el disco falla perderá todos sus datos. Para crear una copia de seguridad confiable de sus datos, lea las instrucciones de este artículo: <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo hacer una copia de seguridad de archivos personales con el historial de archivos en Windows 10. </a></p> <p> </p> <p><strong> Para crear versiones anteriores de sus archivos personales mediante instantáneas: </strong></p> <p> 1. Abrir <strong> Programador de tareas </strong> . Si no sabe cómo hacer eso, entonces ... </p> <blockquote><p> 1. En el cuadro de búsqueda, escriba <strong> Tarea </strong> o <strong> Programador de tareas </strong> . <br> 2. Abra el &quot;Programador de tareas&quot; de los resultados de la búsqueda. </p></blockquote> <p><img src=\"images/image_thumb-31-630.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. En el Programador de tareas, haga clic en <strong> Crear tarea </strong> . </p> <p><img src=\"images/image_thumb-23-462.png\" alt=\"How to Start ThrottleStop at Windows Startup\" loading=\"lazy\"></p> <p> </p> <p> 3. En <strong> General </strong> pestaña: </p> <blockquote><p> 1. Escriba &quot;Crear instantánea de mis archivos&quot; como nombre de la tarea. <br> 2. <strong> Cheque </strong> la <strong> Ejecutar con los privilegios más altos </strong> caja. </p></blockquote> <p> Nota: Si desea iniciar la tarea en segundo plano, coloque un punto en <strong> Ejecutar si el usuario está conectado o no </strong> opción y luego escriba su contraseña de inicio de sesión. </p> <p><img src=\"images/image_thumb-62-499.png\" alt=\"create shadow copies task windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Luego seleccione el <strong> Disparadores </strong> pestaña y haga clic en <strong> Nuevo </strong> . <br> 4a. En la ventana &#39;Nuevo activador&#39;, especifique con qué frecuencia crear una instantánea de sus archivos y haga clic <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-63-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Luego seleccione el <strong> Comportamiento </strong> pestaña y haga clic en <strong> Nuevo </strong> . <br> 5a. En la ventana &#39;Nueva acción&#39;: </p> <blockquote><p> 1. Seleccione <strong> Iniciar un programa </strong> . <br> 2. En &quot;Programa / secuencia de comandos&quot;, escriba: <strong> wmic </strong><br> 3. En el tipo de campo &quot;Agregar argumentos (opcional)&quot;: </p> <ul> <li><strong> llamada shadowcopy crear Volumen = C: \\ </strong></li> </ul> <p> 4. Cuando termine, haga clic en <strong> está bien. </strong></p></blockquote> <p><img src=\"images/image_thumb-66-640.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Haga clic en <strong> OK </strong> nuevamente para cerrar las propiedades de la tarea programada. </p> <p><img src=\"images/image_thumb-67-138.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Para crear su primera copia de seguridad, haga clic con el botón derecho en la tarea y seleccione <strong> Correr </strong> . </p> <p><img src=\"images/image_thumb-68-388.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. ¡Has terminado! A partir de ahora, siempre que desee restaurar un archivo / carpeta a su versión anterior, haga clic derecho sobre él y seleccione <strong> Restaurar versiones anteriores </strong> . </p> <p><img src=\"images/image_thumb-69-568.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Información útil: <br> </strong> 1. El espacio máximo asignado que se puede usar para almacenar las instantáneas es la cantidad de espacio que Restaurar sistema podría usar para almacenar en Puntos de restauración. <br> 2. Para averiguar el espacio de almacenamiento usado y el máximo asignado para las instantáneas, ingrese este comando en el símbolo del sistema (administrador): </p> <ul> <li><strong> vssadmin list shadowstorage </strong></li> </ul> <p><img src=\"images/image_thumb-76-672.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Para modificar el espacio máximo asignado para las instantáneas y los puntos de restauración del sistema, navegue hasta <strong> Proteccion del sistema </strong> ajustes para el <strong> Disco local (C :) </strong><br> 4. Si desea eliminar todas las instantáneas guardadas, debe borrar también los puntos de restauración guardados. Si desea hacer eso, haga clic en el <strong> Eliminar todos los puntos de restauración </strong> en la configuración de protección del sistema. </p> <p><img src=\"images/image_thumb-77-662.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}