{"title":"Cómo agregar una nueva cuenta de usuario en Windows 10/8 / 8.1","content":"<p> Una de las capacidades de Windows 10 es agregar una cuenta en línea de Microsoft en su PC (o dispositivo) para usar todos los servicios de Microsoft (correo electrónico, aplicaciones modernas, juegos de Xbox, Skype, OneDrive, etc.) con una cuenta. Además, si configura una cuenta de Microsoft en Windows 10, podrá iniciar sesión desde cualquier otro dispositivo con Windows 10 (que esté conectado a Internet) y sincronizar todas sus aplicaciones, configuraciones y contraseñas en el nuevo dispositivo. </p> <p> Si no está interesado en usar la Tienda Windows, o si no desea aprovechar las ventajas que ofrece el uso de una cuenta en línea de Microsoft, es mejor configurar una cuenta local en Windows 10. En mi opinión, una cuenta local es siempre más segura que una cuenta en línea de Microsoft y siempre funciona, independientemente de la conectividad a Internet. </p> <p> Este tutorial muestra diferentes métodos de árbol (3) para agregar una nueva cuenta de usuario en Windows 10 y Windows 8.1 en caso de que lo necesite. (por ejemplo, si desea compartir su computadora o archivos con otras personas). </p> <h2> Cómo crear un nuevo usuario en Windows 10, 8.1. </h2> <p><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Método 1. Cree una nueva cuenta desde las opciones de Configuración. </a></p> <p><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Método 2. Agregue una nueva cuenta usando la utilidad &#39;Cuentas de usuario&#39; en Windows 10/8. </a></p> <p><a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"> Método 3. Cree un nuevo usuario usando el símbolo del sistema en Windows 10/8. </a></p> <p> </p> <h6> Método 1. Cómo crear una nueva cuenta desde la configuración en Windows 10. </h6> <p> 1. Inicie sesión en Windows con una cuenta de administrador. </p> <p> 2. Abrir <strong> Ajustes </strong> <img src=\"images/image_thumb-50-534.png\" alt=\"image\" loading=\"lazy\"> y luego haga clic en <strong> Cuentas </strong> . </p> <p><img src=\"images/image_thumb-43-324.png\" alt=\"How to Add a New User in Windows 10, 8.1.\" loading=\"lazy\"></p> <p> </p> <p> 3. Elija <strong> Familia y otros usuarios </strong> a la izquierda y luego haga clic en <strong> Agregue a otra persona a esta PC. </strong></p> <p><img src=\"images/image_thumb-49-471.png\" alt=\"create new account windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. En la siguiente pantalla: </p> <blockquote><p> A. si desea agregar una nueva cuenta de Microsoft en la PC, escriba la dirección de correo electrónico de la nueva persona y haga clic en <strong> próximo </strong> . </p> <p> B. Si desea agregar una nueva cuenta local (como en este ejemplo), haga clic en <strong> No tengo la información de inicio de sesión de esta persona </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-665.png\" alt=\"add local account windows 10\" loading=\"lazy\"></p> <p> 5. Luego haga clic en <strong> Agregar un usuario sin una cuenta de Microsoft </strong> . </p> <p><img src=\"images/image_thumb-42-715.png\" alt=\"add a non Microsoft account windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. En la siguiente pantalla, escriba un nombre de usuario y una contraseña para la nueva cuenta. Luego elija y responda las preguntas de seguridad dadas * en caso de que haya olvidado la contraseña y cuando haya terminado haga clic <strong> próximo </strong> . </p> <p> * Nota: Si no desea responder todas estas preguntas de seguridad &quot;estúpidas&quot;, proceda a agregar el nuevo usuario, utilizando el método-1 o el método-2 a continuación. </p> <p><img src=\"images/image_thumb-46-912.png\" alt=\"add new user account windows 10-8\" loading=\"lazy\"></p> <p> </p> <p> 7. En este punto, ha terminado con la creación de un nuevo usuario estándar en Windows 10. Pero, si desea otorgar privilegios administrativos al nuevo usuario: </p> <blockquote><p> una. Seleccione el usuario y haga clic en <strong> Cambiar el tipo de cuenta. </strong></p></blockquote> <p><img src=\"images/image_thumb-47-574.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> B. En la siguiente pantalla, cambie el tipo de cuenta a &#39;Administrador&#39; y haga clic en <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-48-850.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Método 2. Agregue una nueva cuenta usando la utilidad &#39;Cuentas de usuario&#39; en Windows 10/8. </h6> <p> Uno de mis métodos favoritos para agregar (o eliminar) usuarios (en todas las versiones de Windows) es usar la utilidad &#39;Cuentas de usuario&#39;, que brinda todas las opciones necesarias para administrar fácilmente las cuentas de Windows. (Agregar o quitar usuarios, especificar privilegios de usuario o cambiar la contraseña de usuario). </p> <p> 1. Inicie sesión en Windows con una cuenta de administrador. </p> <p> 2. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-578.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 3. En el cuadro &quot;Abrir&quot;, escriba: <strong> controlar userpasswords2 </strong> &amp; haga clic <strong> OK </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-29-910.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. En la pestaña Usuarios, haga clic en el <strong> Agregar </strong> para agregar la cuenta, que desea tener acceso a sus archivos. </p> <p><img src=\"images/image_thumb_thumb1_thumb-455.png\" alt=\"image_thumb_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> 5. Elija <strong> Iniciar sesión sin una cuenta de Microsoft </strong> para crear una cuenta local, complete la dirección de correo electrónico del usuario si desea crear una cuenta de Microsoft </p> <p><img src=\"images/image_thumb-51-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Luego elija <strong> Cuenta local </strong> . </p> <p><img src=\"images/image_thumb-52-375.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Complete los campos obligatorios (nombre de usuario, contraseña y pista de contraseña) y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb-53-204.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. En la última pantalla, haga clic en <strong> Terminar </strong> . </p> <p> 9. Por último, si desea configurar el nuevo usuario como administrador en la computadora: </p> <blockquote><p> una. Resalte el usuario y seleccione <strong> Propiedades </strong></p></blockquote> <p><img src=\"images/image_thumb-54-635.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> B. Entonces en <strong> Membresía de grupo </strong> pestaña, coloque la viñeta para <strong> Administrador </strong> y haga clic en <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-55-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Método 3. Cómo crear o eliminar un usuario con el símbolo del sistema en el sistema operativo Windows 10/8/7. </h6> <p> El método más sencillo para agregar o eliminar usuarios en todas las versiones de Windows es mediante el símbolo del sistema. </p> <p> Para agregar una nueva cuenta desde el símbolo del sistema: </p> <p> 1. Abrir <strong> Símbolo del sistema como administrador </strong> . <br> 2. En el símbolo del sistema, escriba el siguiente comando y presione <strong> Ingresar </strong> : </p> <ul> <li><strong> usuario de red contraseña / agregar </strong></li> </ul> <p> * Nota: En el comando anterior, cambie los campos &quot;nombre de usuario&quot; y &quot;contraseña&quot;, según su elección. </p> <blockquote><p> p.ej. si desea crear una nueva cuenta con el nombre de usuario &quot;John&quot; y la contraseña &quot;Pas123&quot;, escriba: </p> <ul> <li> usuario de red John Pas123 / add </li> </ul> </blockquote> <p><img src=\"images/image_thumb13_thumb-169.png\" alt=\"add account command prompt windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <p> 3. Finalmente, si desea agregar el nuevo usuario al grupo de Administradores, dé este comando: </p> <ul> <li><strong> net localgroup administradores nombre de usuario / agregar </strong></li> </ul> <blockquote><p> p.ej. En nuestro ejemplo, el comando es: </p> <ul> <li> administradores de net localgroup John / add </li> </ul> </blockquote> <p><img src=\"images/image_thumb16_thumb-668.png\" alt=\"image_thumb[16]\" loading=\"lazy\"></p> <p> </p> <p> Para eliminar un usuario del símbolo del sistema: </p> <p> 1. Abrir <strong> Símbolo del sistema como administrador </strong> . <br> 2. En el símbolo del sistema, escriba el siguiente comando y presione <strong> Ingresar </strong> : </p> <ul> <li><strong> nombre de usuario de usuario de red / eliminar </strong></li> </ul> <p> p.ej. si desea eliminar el usuario &quot;John&quot;, escriba: </p> <ul> <li> usuario de red John / eliminar </li> </ul> <p><img src=\"images/image_thumb19_thumb-438.png\" alt=\"image_thumb[19]\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este problema. </p>"}