{"title":"Cómo hacer una copia de seguridad de archivos personales con el historial de archivos en Windows 10.","content":"<p> En este tutorial, le mostraré cómo configurar Windows 10 para crear automáticamente copias e instantáneas de sus archivos utilizando la herramienta de copia de seguridad del historial de archivos, para poder restaurarlos (si es necesario), utilizando la opción &quot;Restaurar versiones anteriores&quot; característica. </p> <p> Como ya habrá notado, de forma predeterminada, Windows 10 no conserva las versiones anteriores de sus archivos o carpetas, como en Windows 7. Esto está sucediendo, porque Windows 10 ya no usa el servicio &#39;Volume Shadow Copy&#39; para toma instantáneas de sus archivos, pero en su lugar utiliza solo la herramienta de respaldo &#39;Historial de archivos&#39;. </p> <p> El &quot;Historial de archivos&quot; es una excelente herramienta de copia de seguridad incorporada en Windows 10, que se puede configurar para realizar copias e instantáneas de sus archivos en una ubicación de almacenamiento alternativa a la unidad principal (por ejemplo, a una unidad USB, red, etc.) . * </p> <p> * Nota: La única limitación de la herramienta &quot;Historial de archivos&quot; es que no le permite elegir la unidad C: como un destino de copia de seguridad alternativo. Si no posee una unidad secundaria disponible para la copia de seguridad, continúe leyendo este tutorial para descubrir cómo evitar esta limitación ... </p> <ul> <li><strong> Artículo relacionado: </strong> <a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo crear instantáneas de sus archivos con el programador de tareas en Windows 10. </a></li> </ul> <h4> Cómo hacer una copia de seguridad de sus archivos personales con la herramienta de copia de seguridad del historial de archivos en Windows 10. </h4> <p> 1. Como mencioné anteriormente, para hacer una copia de seguridad de sus archivos con la herramienta de copia de seguridad del historial de archivos, debe tener una unidad de almacenamiento disponible conectada a su PC (por ejemplo, una unidad USB), o una ubicación de red (por ejemplo, otra computadora en su red o un dispositivo de almacenamiento NAS). * </p> <p> * Nota: Si no posee un dispositivo de almacenamiento alternativo, tiene las siguientes opciones: </p> <blockquote><p> A. Para <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> reducir el tamaño de su unidad principal C: \\ </a> y con el espacio libre disponible para crear una nueva unidad para almacenar la copia de seguridad, o ... </p> <p> B. Para almacenar la copia de seguridad en la unidad principal C: \\. En este caso, cree una nueva carpeta en la unidad C: y asígnele el nombre &quot;FileHistory&quot; (o como desee) y continúe a continuación ... </p></blockquote> <p> 2. Navega a Windows <strong> Panel de control </strong> Y debajo <strong> Sistema y seguridad, </strong> hacer clic <strong> Guardar copia de seguridad </strong><strong> copias de sus archivos con Historial de archivos. </strong></p> <p><img src=\"images/image_thumb-42-924.png\" alt=\"How to Backup & Keep Previous Versions of Files in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 3. Ahora, según su caso, realice lo siguiente: </p> <ul> <li><strong> Caso A. </strong> Si posee una unidad disponible para la copia de seguridad, entonces: </li> </ul> <blockquote><p> una. Haga clic en el <strong> Encender </strong> en la pantalla para habilitar el &#39;Historial de archivos&#39;. <br> B. Continuar a <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> paso 4 </a> a continuación para configurar los ajustes de copia de seguridad del &#39;Historial de archivos&#39;. </p></blockquote> <p><img src=\"images/image_thumb-44-788.png\" alt=\"Turn On File History Windows 10\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Caso B: </strong> Si no posee una unidad disponible para la copia de seguridad del historial de archivos o si desea almacenar la copia de seguridad en la red, entonces: </li> </ul> <blockquote><p> una. Hacer clic <strong> Seleccione una ubicación de red. </strong></p></blockquote> <p><img src=\"images/image_thumb-56-796.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> B. En la siguiente pantalla: </p> <p> 1. Si desea guardar la copia de seguridad en la red, escriba la ruta de red completa de la ubicación de almacenamiento de la copia de seguridad y haga clic en <strong> Seleccione la carpeta </strong> . </p> <p> 2. Si desea guardar la copia de seguridad en su unidad principal C: \\, escriba la ruta de red completa a la carpeta de copia de seguridad local en la unidad C: \\, en este formulario: * </p> <ul> <li> <strong> \\\\ Nombre de computadora \\ C $ \\ FileHistory </strong></li> </ul> <p> * Notas: <br> 1. Reemplace el valor &quot;Computer-Name&quot; con el nombre de su PC. (Para encontrar el nombre de su computadora, haga clic derecho en el icono &quot;Esta PC&quot; en el Explorador de Windows). <br> 2. Tenga en cuenta que guardar la copia de seguridad de sus archivos personales en la misma unidad donde ya estaban almacenados <strong> no es una solución confiable </strong> . Para estar seguro, siempre guarde la copia de seguridad en otro dispositivo de almacenamiento. </p></blockquote> <p> por ejemplo: si el nombre de la computadora es &quot;Pegasus&quot;, escriba: &quot;\\\\ Pegasus \\ C $ \\ FileHistory&quot; </p> <p><img src=\"images/image_thumb-53-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> C. En la siguiente pantalla, haga clic en <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-54-349.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> D. Ahora haga clic en el <strong> Encender </strong> para habilitar la herramienta de copia de seguridad del historial de archivos y luego continúe a continuación para configurar los ajustes de la copia de seguridad. </p></blockquote> <p><img src=\"images/image_thumb-48-620.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Para configurar las opciones de copia de seguridad del &#39;Historial de archivos&#39;, haga clic en <strong> Ajustes avanzados </strong> a la izquierda. </p> <p><img src=\"images/image_thumb-49-919.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4a. Entonces en <strong> Ajustes avanzados </strong> opciones, establezca la frecuencia con la que se realizarán copias de seguridad de sus archivos y durante cuánto tiempo se conservarán las versiones guardadas. Cuando termine, haga clic en <strong> Guardar cambios </strong> . </p> <p><img src=\"images/image_thumb-61-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Por último, haga clic en <strong> Corre ahora </strong> para realizar su primera copia de seguridad. * </p> <p><img src=\"images/image_thumb-55-463.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Ayuda adicional - Notas: <br> 1. De forma predeterminada, el &#39;Historial de archivos&#39; realiza una copia de seguridad de las carpetas de &#39;Bibliotecas&#39; (Escritorio, Documentos, Favoritos, Música, OneDrive, Imágenes y videos). Si desea excluir una de estas carpetas de la copia de seguridad, incluir otras carpetas o revisar todas las opciones de copia de seguridad del historial de archivos, vaya a: </p> <ul> <li> <p><strong> Ajustes <img src=\"images/image_thumb-58-467.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Actualización y seguridad </strong> &gt; <strong> Respaldo </strong> &gt; <strong> Mas opciones. </strong></p> </li> </ul> <p><img src=\"images/image_thumb-57-938.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Para restaurar sus archivos desde la copia de seguridad &#39;Historial de archivos&#39;, navegue a una de las siguientes ubicaciones: </p> <ul> <li><strong> Panel de control </strong> &gt; <strong> Historial del archivo </strong> &gt; <strong> Restaurar archivos personales. </strong></li> <li><strong> Ajustes <img src=\"images/image_thumb-59-275.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Actualización y seguridad </strong> &gt; <strong> Respaldo </strong> &gt; <strong> Mas opciones </strong> &gt; <strong> Restaurar archivos desde una copia de seguridad actual. </strong></li> </ul> <p> 3. Para restaurar selectivamente un archivo o carpeta a su versión anterior, haga clic derecho en el archivo (o carpeta) y seleccione <strong> Restaurar versiones anteriores </strong> . </p> <p><img src=\"images/image_thumb-60-867.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}