{"title":"CÓMO: Eliminar el historial de Internet, las contraseñas y las cookies de su navegador web (Chrome, Firefox, IE)","content":"<p> Cuando visita un sitio web con su navegador web, el sitio web envía cierta información al navegador y el navegador almacena esa información en pequeños archivos de texto llamados <strong> Galleta </strong> s. Las Cookies almacenan las preferencias del usuario en ese sitio web, p. Ej. la información de inicio de sesión, para que el usuario no tenga que volver a ingresar los detalles de inicio de sesión (nombre de usuario y / o contraseña) cuando regrese al mismo sitio web. Las cookies también pueden mantener un historial de qué páginas del sitio web visitó el usuario, para que el usuario no tenga que recordarlas, o navegar por todas las páginas del sitio web, hasta encontrar lo que busca. </p> <p> Al mismo tiempo, cuando visita un sitio web, el navegador almacena una copia local de todas las páginas web que visitó, para ahorrar el ancho de banda de la conexión y disminuir el tiempo de carga de las páginas web, la próxima vez que las visite. Esta &quot;copia local de páginas web&quot; se conoce como &quot; <strong> Archivos temporales de Internet </strong> &quot; de <strong> Cache </strong> . </p> <p> Las cookies y la caché, después de un tiempo, pueden contener una cantidad significativa de espacio en el disco y es necesario borrarlas. En otros casos, es posible que deba eliminar la memoria caché del navegador y las cookies para volver a cargar totalmente el contenido del sitio web o por razones de seguridad y privacidad: p. si no lo desea, una tercera persona para averiguar qué páginas web visitó (también conocido como: &quot; <strong> Historial de navegación </strong> &quot;) o cuáles son sus datos de acceso a un sitio web (por ejemplo, GMAIL). </p> <p> En este tutorial, encontrará dos (2) formas sencillas de eliminar el historial de navegación, los archivos temporales de Internet (caché) y las cookies de Internet Explorer, Chrome y Firefox. </p> <h4> Cómo borrar el historial de navegación web, las contraseñas guardadas y las cookies en Chrome, Firefox e Internet Explorer. </h4> <h5><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Método 1. Borrar datos de navegación de un navegador específico. </a></h5> <h5><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Método 2. ¡Elimine los datos de navegación de todos los navegadores web con un clic! </a></h5> <p> </p> <h5> Método 1. Elimine el historial, la caché y las cookies de un navegador específico. </h5> <p> En general, cada navegador web tiene opciones para eliminar los datos de navegación almacenados a través del menú Configuración / Opciones, pero si desea acceder fácilmente a esas opciones (sin tener que navegar con el mouse por el menú del navegador), presione <strong> control </strong> + <strong> Cambiar </strong> + <strong> Borrar </strong> teclas juntas en la ventana abierta del navegador. Entonces… </p> <p><strong> Para eliminar el historial de navegación, el caché y las cookies de Internet Explorer: </strong></p> <p> 1. Abra Internet Explorer y presione <strong> control </strong> + <strong> Cambiar </strong> + <strong> Borrar. <br> </strong> 2. Seleccione el tipo de información que desea eliminar y haga clic en el <strong> Borrar </strong> botón. </p> <p><img src=\"images/image_thumb-18-750.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> Para eliminar el historial de navegación, el caché y las cookies de Chrome: </strong></p> <p> 1. Inicie Chrome y presione <strong> control </strong> + <strong> Cambiar </strong> + <strong> Borrar. <br> </strong> 2. Elija qué tipo de información desea borrar y luego presione <strong> BORRAR DATOS </strong> . </p> <p><img src=\"images/image_thumb-19-667.png\" alt=\"clear chrome history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p><strong> Para eliminar el historial de navegación, el caché y las cookies de Firefox: </strong></p> <p> 1. Abra Firefox y presione simultáneamente <strong> control </strong> + <strong> Cambiar </strong> + <strong> Borrar. <br> </strong> 2. Seleccione los datos que desea eliminar de Firefox y haga clic en <strong> Despejado ahora. </strong></p> <p> </p> <p><img src=\"images/image_thumb-20-864.png\" alt=\"clear firefox history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> Método 2: Elimine el historial del navegador, la caché y las cookies de todos los navegadores web a la vez. </h5> <p> Si desea hacer su vida más fácil, puede utilizar el <a href=\"https://www.ccleaner.com/\" target=\"_blank\" rel=\"nofollow noopener\"> CCleaner </a> utilidad para eliminar fácilmente los archivos temporales de Internet, el historial y las cookies de todos los navegadores web que utiliza, con un solo clic. </p> <p> 1. <a href=\"https://www.ccleaner.com/ccleaner/download\" target=\"_blank\" rel=\"nofollow noopener\"> Descargar </a> e instale la versión gratuita de la utilidad CCleaner. </p> <p> 2. Lanzamiento <strong> CCleaner </strong> y navega hasta el <strong> Ventanas </strong> y el <strong> Aplicaciones </strong> opciones de la pestaña, para seleccionar qué información desea eliminar de los navegadores web. </p> <p> 3. Cuando termine, haga clic en <strong> Ejecutar más limpio </strong> . </p> <p><img src=\"images/image_thumb-21-173.png\" alt=\"clear internet history cache cookies - ccleaner\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> ¡Eso es todo! ¿Funcionó para ti? </p> <p> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}