{"title":"Cómo abrir siempre Chrome en modo incógnito.","content":"<p> Si está buscando una manera de hacer que Chrome se abra siempre en modo incógnito, continúe leyendo a continuación. Cuando inicia Chrome en modo incógnito, la actividad de su navegador permanece privada de otros usuarios que usan el mismo dispositivo. En el modo de incógnito, Chrome no guardará su historial de navegación, las cookies y la información ingresada en los formularios. </p> <p> La forma manual, para iniciar una nueva sesión de Chrome en modo incógnito, es ir al menú de Chrome <img src=\"images/image_thumb10_thumb-963.png\" alt=\"image_thumb[10]\" loading=\"lazy\"> y seleccionar &quot;Nueva ventana de incógnito&quot;, o presionar CTRL + MAYÚS + N. </p> <p><img src=\"images/image_thumb-42-832.png\" alt=\"Chrome New incognito window\" loading=\"lazy\"></p> <p> </p> <p> En este artículo encontrará instrucciones sobre cómo iniciar siempre Google Chrome en modo incógnito. </p> <h4> Cómo iniciar siempre Google Chrome en modo incógnito. </h4> <p> Si desea iniciar siempre Chrome en modo incógnito, cree un nuevo acceso directo de Chrome y modifique sus propiedades, de la siguiente manera: </p> <p> 1, <strong> Botón derecho del ratón </strong> en <strong> Google Chrome </strong> atajo y seleccione <strong> Propiedades </strong> . <br> 2. En <strong> General </strong> pestaña, agregue el interruptor &quot;–incognito&quot; (sin comillas), al final de la línea de destino y haga clic en <strong> OK </strong> : </p> <p> p.ej. &quot;C: \\ Archivos de programa \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; –incognito </p> <p><img src=\"images/image_thumb-43-798.png\" alt=\"How to Always Open Chrome in Incognito mode.\" loading=\"lazy\"></p> <p> 3. A partir de ahora, cuando inicie Chrome desde el acceso directo modificado, Chrome se abrirá en modo incógnito. * </p> <p><strong> * INCLINAR: </strong> Si desea abrir Chrome en modo incógnito, al abrir un hipervínculo (URL) desde su correo electrónico u otro programa, entonces debe modificar el registro. Para hacer eso: </p> <blockquote> <p> 1. Abra el <strong> Editor de registro </strong> . <br> 2. En el registro, navegue hasta la siguiente clave: </p> <ul> <li> <p> HKEY_CLASSES_ROOT \\ ChromeHTML \\ shell \\ open \\ command </p> </li> </ul> <p> 3. En el panel derecho, haga doble clic en el <strong> Defecto </strong> Valor de cadena REG_SZ. </p> </blockquote> <p><img src=\"images/image_thumb-44-612.png\" alt=\"open url in chrome incognito\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. Agregue el interruptor, agregue la palabra &quot;incógnito&quot; (sin comillas), antes de &quot;% 1&quot; y haga clic en <strong> OK </strong> . </p></blockquote> <blockquote><p> p.ej. Cambie los datos del valor de: </p> <p> &quot;C: \\ Archivos de programa \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; - &quot;% 1&quot; </p> <p> a: </p> <p> &quot;C: \\ Archivos de programa \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; –incognito &quot;% 1&quot; </p></blockquote> <p><img src=\"images/image_thumb-45-148.png\" alt=\"open url chrome incognito - registry\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. A partir de ahora, al hacer clic en una URL (HTML), Chrome la abrirá en modo incógnito. </p></blockquote> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}