{"title":"Cómo encontrar Windows Media Player en Windows 10.","content":"<p> Durante muchos años, Windows Media Player fue la aplicación predeterminada para reproducir música y videos. En Windows 10, el Reproductor de Windows ya no es el reproductor predeterminado para los archivos multimedia y ha sido reemplazado por la aplicación &quot;Películas y TV&quot;. </p> <p> Este artículo está escrito para todos los usuarios que deseen encontrar y utilizar el clásico Reproductor de Windows Media, como el reproductor predeterminado para reproducir su música y videos. </p> <h4> Cómo encontrar Windows Media Player en Windows 10. </h4> <p> La forma más rápida de averiguar si Windows Media Player está instalado en su computadora es buscándolo. Para hacer eso: </p> <p> 1. En el cuadro de búsqueda de Cortana, escriba <strong> reproductor de medios de Windows </strong> . <br> 2. Si el reproductor de Windows Media aparece en los resultados, haga clic en él para iniciar el programa. (Si no está en la lista, continúe a continuación ...) </p> <p><img src=\"images/image_thumb-66-377.png\" alt=\"How to Find Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> INCLINAR: </strong> Para configurar Windows Media Player, como el reproductor predeterminado para sus videos y música: </p> <blockquote><p> 1. Navega a <strong> Comienzo </strong> -&gt; <strong> Ajustes </strong> -&gt; <strong> Aplicaciones </strong> y seleccione <strong> Aplicaciones predeterminadas </strong> A la izquierda. <br> 2. En <strong> Reproductor de música </strong> opciones, haga clic en el <strong> Música Groove </strong> y luego seleccione el <strong> Reproductor de medios de Windows </strong> . <br> 3. <strong> En las opciones del reproductor de video </strong> , haga clic en <strong> Películas y TV </strong> y luego seleccione el <strong> Reproductor de medios de Windows </strong> . </p> <p><img src=\"images/image_thumb-72-358.png\" alt=\"set windows media player default widnows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h4> Cómo instalar el reproductor de Windows Media en Windows 10 Home, Pro. </h4> <p> Si el Reproductor de Windows Media no aparece en la lista, puede instalarlo yendo a: </p> <p> 1. <strong> Panel de control </strong> -&gt; <strong> Programas y características </strong> . <br> 2. Haga clic en <strong> Activar o desactivar las características de windows </strong> desde la izquierda. </p> <p><img src=\"images/image_thumb-68-342.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. En <strong> Funciones multimedia </strong> , Selecciona el <strong> reproductor de medios de Windows </strong> y presione <strong> OK </strong> . * </p> <p> * Nota: si posee la versión de Windows 10 N o KN, o no puede instalar el Reproductor de Windows Media desde las &#39;características de Windows&#39;, continúe leyendo a continuación ... </p> <p><img src=\"images/image_thumb-69-565.png\" alt=\"How to Install Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cómo descargar e instalar el reproductor de Windows Media en las versiones de Windows 10 Home, Pro, N y KN. </h4> <p> Si no puede instalar el Reproductor de Windows siguiendo las instrucciones anteriores, o si posee Windows 10 N o KN, puede descargar el Reproductor de Windows Media para Windows 10 siguiendo las instrucciones a continuación: </p> <p> 1. Descarga el <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48231\" target=\"_blank\" rel=\"nofollow noopener\"> Paquete de características multimedia para las versiones N y KN de Windows 10 </a> . </p> <p> * Nota: descargue el <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package.msu </strong> por <strong> SO de 32 bits, </strong> y el <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package_x64.msu </strong> por <strong> SO de 64 bits. </strong></p> <p> 2. Ejecute el archivo descargado y haga clic en <strong> sí </strong> en la primera pantalla. </p> <p><img src=\"images/image_thumb-70-480.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Aceptar </strong> el Acuerdo de licencia y luego espere hasta que se complete la instalación. </p> <p><img src=\"images/image_thumb-71-400.png\" alt=\"download windows media player windows 10\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}