{"title":"Cómo reinstalar Windows 10 si Windows no arranca.","content":"<p> En este tutorial, encontrará instrucciones detalladas sobre cómo reinstalar Windows 10, si Windows no arranca. En un tutorial anterior mencioné la forma de <a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"nofollow noopener\"> reinstale Windows 10 usando la función &quot;RESTABLECER esta PC </a> . Pero, &quot;RESET this PC&quot; solo está disponible si Windows 10 puede arrancar normalmente, o si puede iniciar el menú &quot;Advanced Startup&quot; después de iniciar Windows (la opción &quot;RESET this PC&quot; no está disponible cuando se inicia desde USB). </p> <p> Este tutorial contiene instrucciones para reinstalar Windows 10 si Windows no arranca, sin perder sus archivos. </p> <h2> Cómo reinstalar el par de Windows 10 si Windows no puede iniciarse. </h2> <p><strong> Requisitos </strong> : Para reinstalar Windows 10 si Windows no se inicia normalmente, deberá iniciar su computadora desde un medio de instalación de Windows (USB o DVD) y habilitar el Menú de opciones avanzadas (menú de la tecla F8). Si no posee un medio de instalación de Windows, puede crear uno usando <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Herramienta de creación de medios de Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo crear un medio de instalación USB de Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo crear un medio de instalación de DVD de Windows 10. </a></li> </ul> <p> 1. Inicie su computadora desde el medio de instalación de Windows. <br> 3. Presione <strong> próximo </strong> en la pantalla de opciones de idioma. <br> 4. Elija <strong> Repara tu computadora </strong> . <br> 5. Luego elija <strong> Solucionar problemas -&gt; </strong><strong> Opciones avanzadas -&gt; Símbolo del sistema. </strong></p> <p> 6. En la ventana del símbolo del sistema, escriba el siguiente comando y presione <strong> Ingresar: </strong></p> <ul> <li><strong> bcdedit / set {predeterminado} bootmenupolicy legacy </strong></li> </ul> <p><img src=\"images/image_thumb-33-821.png\" alt=\"advanced boot options\" loading=\"lazy\"></p> <p> 7. Escriba <strong> Salida </strong> para cerrar la ventana del símbolo del sistema. <br> 8. Quite los medios de instalación de Windows. <br> 9. Cierre todas las ventanas para reiniciar o apagar su PC. </p> <p> 10. <strong> prensa </strong> la <strong> F8 </strong> clave <strong> repetidamente </strong> durante el encendido de la computadora. </p> <p> 11. En &quot;Menú de opciones avanzadas&quot;, resalte &quot; <strong> Repara tu computadora </strong> &quot;opción y luego presione <strong> INGRESAR </strong> . </p> <p><img src=\"images/image_thumb-13-334.png\" alt=\"Repair your Computer in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 12. En la pantalla &quot;Elija una opción&quot;, seleccione <strong> Solucionar problemas </strong> y luego haga clic en <strong> Restablecer esta PC -&gt; Conservar mis archivos. </strong> * </p> <p> Notas: <br> 1. El &quot; <strong> Conservar mis archivos &quot; </strong> opción, eliminará todas sus aplicaciones y configuraciones, pero mantendrá sus archivos personales. <br> 2. El <strong> &quot;Quitar todo&quot; </strong> opción, eliminará todas las aplicaciones, configuraciones y archivos. Al seleccionar esta opción, su PC se restaurará a un estado limpio. <br> 3. Si elige &quot;Eliminar todo&quot;, asegúrese de tener una copia de seguridad reciente de sus archivos personales en otro medio de almacenamiento (por ejemplo, un disco USB); de lo contrario, se perderán todos sus archivos. </p> <p><img src=\"images/image_thumb-14-296.png\" alt=\"How to Reinstall Windows 10 if Windows Won't Boot.\" loading=\"lazy\"></p> <p> </p> <p> 13. En la siguiente pantalla, elija una cuenta con privilegios de administrador. ) y en la siguiente pantalla escriba su contraseña y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb-15-869.png\" alt=\"How to Reinstall Windows 10 if Windows cannot Boot.\" loading=\"lazy\"></p> <p> 14. Escriba la contraseña de la cuenta seleccionada y haga clic en <strong> Continuar. </strong></p> <p><img src=\"images/image_thumb-16-692.png\" alt=\"How to Reinstall Windows 10 if Windows fails to boot.\" loading=\"lazy\"></p> <p> </p> <p> 15. Espere hasta que se complete la instalación. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta guía. </p>"}