{"title":"Cómo deshabilitar los dispositivos de almacenamiento USB en el sistema operativo Windows 10/8/7.","content":"<p> En algunas empresas, existe la necesidad de deshabilitar los dispositivos de almacenamiento USB, para evitar que los empleados copien datos confidenciales de la empresa, o para evitar el riesgo de malware que pueda ejecutarse desde un dispositivo de almacenamiento USB. </p> <p> En este tutorial encontrará instrucciones sobre cómo deshabilitar los dispositivos extraíbles USB, como unidades USB en el sistema operativo Windows 10/8/7 o en Windows Server 2016/2012. </p> <h2> Cómo deshabilitar el acceso a unidades USB en Windows. </h2> <h3> Método 1. Desactive los dispositivos de almacenamiento USB del registro. </h3> <p> * Nota: Este método funciona en todas las ediciones de Windows 10, 8 o 7 (Home y Professional) y en las versiones de Windows Server. </p> <p> Para bloquear unidades USB en Windows usando el Registro: </p> <p> 1. Presione simultáneamente las ventanas <img src=\"images/image_thumb36-173.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> regedit </strong> &amp; prensa <strong> Ingresar. </strong></p> <p><img src=\"images/image_thumb7-312.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Navegue hasta la siguiente tecla en el panel izquierdo: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ UsbStor </strong></li> </ul> <p> 4. En el panel derecho, haga doble clic en <strong> Comienzo </strong> valor. </p> <p><img src=\"images/image_thumb-47-900.png\" alt=\"How to Disable USB Storage Devices - Registry\" loading=\"lazy\"></p> <p> </p> <p> 5. Cambie los datos del valor de 3 a <strong> 4 </strong> y haga clic en <strong> está bien. * </strong></p> <p> * Nota: Cambie los datos de este valor a <strong> 3 </strong> , y los dispositivos de almacenamiento USB se habilitarán nuevamente. </p> <p><img src=\"images/image_thumb-48-559.png\" alt=\"Disable USB Drive \" loading=\"lazy\"></p> <p> </p> <p> 6. Cierre el Editor del registro y <strong> desconectar </strong> cualquier unidad USB. * </p> <p> * Nota: La restricción no funciona para unidades USB ya conectadas. </p> <p> 7. <strong> Reanudar </strong> tu computador. <br> 8. A partir de ahora, todas las unidades USB están bloqueadas y no serán accesibles, con el error: &quot; <em> Ubicación no disponible. No se puede acceder a la unidad. Acceso denegado </em> &quot;. * </p> <p><img src=\"images/image_thumb-53-502.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h3> Método 2. Desactive el acceso a los discos USB mediante la directiva de grupo. * </h3> <p> * Nota: Este método funciona en las versiones de Windows 10, 8 o 7 Professional y en las versiones de Windows Server. </p> <p> Para evitar el acceso a todos los dispositivos de almacenamiento extraíbles en Windows mediante la política: </p> <p> 1. Presione simultáneamente las ventanas <img src=\"images/image_thumb36-342.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> gpedit.msc </strong> &amp; Prensa <strong> Ingresar. </strong></p> <p><img src=\"images/image_thumb-78-178.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. En el panel izquierdo, navegue hasta: </p> <ul> <li><strong> Configuración del equipo&gt; Plantillas administrativas&gt; Sistema&gt; <strong> Acceso a almacenamiento extraíble </strong></strong></li> </ul> <p> 4. En el panel derecho, abra el <strong> Discos extraíbles: denegar el acceso de lectura </strong> política. </p> <p><img src=\"images/image_thumb-51-107.png\" alt=\"Block USB Storage Devices - Policy\" loading=\"lazy\"></p> <p> </p> <p> 5. Establezca la configuración de política en <strong> Activado </strong> y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-52-585.png\" alt=\"Disable Removable Storage Access\" loading=\"lazy\"></p> <p> </p> <p> 6. Cierre el Editor de políticas de grupo y <strong> desconectar </strong> cualquier unidad USB conectada. * </p> <p> * Nota: La restricción no funciona para unidades USB ya conectadas. </p> <p> 7. <strong> Reanudar </strong> tu computador. <br> 8. Después de reiniciar, si conecta un dispositivo de almacenamiento USB e intenta acceder a él, recibirá el error: &quot; <em> Ubicación no disponible. No se puede acceder a la unidad. Acceso denegado </em> &quot;. * </p> <p> ¡Eso es todo amigos! ¿Qué método te funcionó? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}