{"title":"Cómo quitar la opción HAGA CLIC AQUÍ PARA VER MÁS SOBRE MICROSOFT EXCHANGE en Outlook.","content":"<p> Si no desea hacer clic cada vez en el hipervínculo &quot;Haga clic aquí para ver más sobre Exchange&quot; en Outlook, para ver todos los correos electrónicos almacenados en Exchange, continúe leyendo a continuación. El hipervínculo &quot;Haga clic aquí para ver más sobre Exchange&quot; en Outlook aparece porque las carpetas de correo solo muestran los elementos más nuevos (correos electrónicos). Este es un comportamiento predeterminado, porque cuando usa Microsoft Outlook 2019, Outlook 2016, Outlook 2013 o Outlook para Office 365 para conectarse a su buzón de correo de Exchange Server, Outlook muestra uno de los correos electrónicos del año pasado. </p> <p><img src=\"images/image_thumb-19-421.png\" alt=\"How to Remove the \" click here to view more on exchange option in outlook. loading=\"lazy\"></p> <p> </p> <p> Para quitar el hipervínculo &quot;Haga clic aquí para ver más sobre Exchange&quot; que aparezca, para ver todos sus elementos de correo electrónico, cuando esté conectado a un buzón de correo de Exchange, siga los pasos a continuación. </p> <h4> Cómo forzar a Outlook a que muestre todos sus correos electrónicos desde su buzón de Exchange. </h4> <p> Para mostrar todos sus correos electrónicos de Exchange en Outlook: </p> <p> 1. Haga clic en el <strong> Archivo </strong> menú e ir a <strong> Cuenta </strong> &gt; <strong> Configuraciones de la cuenta </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-1-139.png\" alt=\"How to Backup Outlook\" loading=\"lazy\"></p> <p> 2. Resalte la cuenta Exchange y haga clic en <strong> Cambio </strong> . </p> <p><img src=\"images/image_thumb-20-777.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. En la configuración &quot;Descargar correo electrónico para el pasado&quot;, arrastre el control deslizante hasta el final. </p> <p><img src=\"images/image_thumb-17-833.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Cuando termine, haga clic en <strong> próximo </strong> y <strong> Terminar </strong> y luego cierre la Configuración de la cuenta. </p> <p><img src=\"images/image_thumb-18-585.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Reanudar </strong> Panorama. </p> <p> ¡Eso es todo amigos! Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}