{"title":"Cómo evitar que Windows 10 instale impresoras de red automáticamente.","content":"<p> Como ya habrá notado, Windows 10 instala automáticamente los controladores para cualquier impresora u otro dispositivo conectado a la red. Pero, aunque se trata de una función muy útil, también es muy molesta, especialmente en entornos empresariales, donde es posible que no desee que todos los usuarios de la red utilicen todas las impresoras. </p> <p> Por supuesto, si no desea un dispositivo de red y las aplicaciones de su fabricante, puede eliminarlo de su sistema. Pero Windows 10 lo instalará automáticamente de nuevo. Para evitar esto, debe evitar que Windows instale automáticamente los dispositivos conectados a la red (impresoras, escáneres, cámaras, etc.) y sus aplicaciones e íconos personalizados del fabricante. </p> <h3> Cómo DETENER Windows 10 para instalar automáticamente dispositivos y aplicaciones de red. </h3> <p> 1. Navega a <strong> Panel de control </strong> . Para hacer eso: </p> <blockquote><p> una. Escribe &quot;panel de control&quot; en el cuadro de búsqueda de Windows. <br> B. Hacer clic <strong> Panel de control </strong> de los resultados. </p></blockquote> <p><img src=\"images/image_thumb-53-862.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Configure el <strong> Vista por </strong> a <strong> Iconos pequeños </strong> para ver todos los elementos del panel de control y luego haga clic en <strong> Redes y recursos compartidos. </strong></p> <p><img src=\"images/image_thumb-37-625.png\" alt=\"control panel network and sharing center\" loading=\"lazy\"></p> <p> </p> <p> 3. Elija <strong> Configuración avanzada para compartir </strong> a la izquierda <strong> . </strong></p> <p><img src=\"images/image_thumb-38-656.png\" alt=\"Prevent Windows 10 to Install Network Printers Automatically\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Borre el &quot; <strong> Activar la configuración automática de los dispositivos conectados a la red &quot; </strong> y haga clic en <strong> Guardar cambios. </strong></p> <p><img src=\"images/image_thumb-39-992.png\" alt=\"Turn Off automatic setup of network connected devices \" loading=\"lazy\"></p> <p> </p> <p><strong> Opcional: </strong> Si desea evitar que Windows 10 descargue e instale automáticamente las aplicaciones del fabricante y los íconos personalizados, para cualquier dispositivo conectado en su PC, entonces: </p> <blockquote><p> 1. Navega a <strong> Panel de control </strong> -&gt; <strong> Sistema </strong> . <br> 2. Haga clic en <strong> Proteccion del sistema </strong> a la izquierda. <br> 3. En la pestaña Hardware, haga clic en <strong> Configuración de instalación del dispositivo </strong> . </p></blockquote> <p><img src=\"images/image_thumb-40-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. En &#39;Configuración de instalación del dispositivo&#39;, elija &quot; <strong> No (es posible que su dispositivo no funcione como se esperaba) &quot; </strong> y haga clic en <strong> Guardar cambios </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-728.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta guía. </p>"}