{"title":"Cómo ver y exportar contraseñas de Firefox.","content":"<p> En este tutorial, le mostraré cómo ver y administrar las contraseñas guardadas en el navegador web Mozilla Firefox. Como ya sabe, el navegador Firefox le ofrece la opción de guardar su nombre de usuario y contraseña de inicio de sesión la primera vez que visita un sitio web. Si elige guardar sus credenciales, Firefox las recordará y la próxima vez que inicie sesión en el sitio web, no tendrá que volver a escribirlas. </p> <p><img src=\"images/image_thumb-98-507.png\" alt=\"How to View and Export Firefox Passwords.\" loading=\"lazy\"></p> <p> Si, con el tiempo, olvidas tus credenciales de inicio de sesión, lee este tutorial para aprender a ver y exportar las contraseñas almacenadas en Firefox. </p> <h4> Cómo administrar, mostrar y exportar las contraseñas guardadas en Mozilla Firefox. </h4> <p><strong> Cómo ver las contraseñas de Firefox </strong></p> <p> 1. Desde el menú de Firefox <img src=\"images/image_thumb-99-587.png\" alt=\"image\" loading=\"lazy\"> escoger <strong> Inicio de sesión y contraseñas </strong> . </p> <p><img src=\"images/image_thumb-100-999.png\" alt=\"View Saved Passwords Firefox\" loading=\"lazy\"></p> <p> </p> <p> 2. Haga clic en el <strong> Mostrar contraseñas </strong> para ver las contraseñas guardadas en sitios web. Además, en esta ventana, utilice el <strong> Eliminar </strong> para eliminar las contraseñas guardadas de Firefox. </p> <p><img src=\"images/image_thumb-101-863.png\" alt=\"Manage Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p><strong> Cómo guardar todas las contraseñas de Firefox en un archivo. </strong></p> <p> Para ver y exportar todas las contraseñas almacenadas en Firefox: </p> <p> 1. Descarga <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> ContraseñaFox </a> utilidad <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> http://www.nirsoft.net/utils/passwordfox.html </a> ) <br> 2. Extraiga el archivo zip descargado. <br> 3. Desde la carpeta extraída, haga doble clic para ejecutar la aplicación &quot;PasswordFox.exe&quot;. <br> 4. Presione <strong> control </strong> + <strong> A </strong> para seleccionar todos los sitios enumerados, y luego desde el <strong> Archivo </strong> menú elegir <strong> Guardar elementos seleccionados. </strong></p> <p><img src=\"images/image_thumb-102-438.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Escriba un nombre para el archivo .txt y haga clic en <strong> Ahorrar </strong> . </p> <p><img src=\"images/image_thumb-103-923.png\" alt=\"How to Save Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p> 6. Abra el archivo creado en el bloc de notas para ver todas las contraseñas almacenadas en el navegador Mozilla Firefox. </p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}