{"title":"Cómo proteger su PC con BitLocker en Windows 10.","content":"<p> Este tutorial contiene instrucciones paso a paso sobre cómo proteger con contraseña su PC con cifrado BitLocker. BitLocker es una función de cifrado de disco completo incluida en las ediciones Windows 10 Professional y Enterprise y puede ayudarlo a proteger sus datos personales del acceso no autorizado. </p> <p> Imagine el siguiente escenario: su computadora portátil personal es robada o se pierde y sus datos privados están disponibles para ojos indiscretos. Para evitar que esto suceda, lea esta guía y aprenda cómo proteger con contraseña su PC y sus datos valiosos con un cifrado sólido, para que cualquier persona sin la contraseña de descifrado no pueda acceder a ella. </p> <ul> <li><strong> Artículo relacionado: <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo proteger una carpeta con una contraseña. </a></strong></li> </ul> <h4> Cómo usar BitLocker para cifrar y proteger su PC con Windows 10. </h4> <p> Para proteger la unidad del sistema operativo, con BitLocker en Windows 10 Pro o Enterprise: </p> <p> 1. Desde Windows <strong> Panel de control </strong> , haga clic en <strong> Sistema y seguridad </strong> y luego haga clic en <strong> Cifrado de unidad Bit Locker </strong> . </p> <p><img src=\"images/image_thumb-33-320.png\" alt=\"How to Protect your PC with BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Junto a la unidad C: del sistema operativo, haga clic en <strong> Activar BitLocker </strong> . * </p> <p> * Nota: Si después de presionar &#39;Activar BitLocker&#39;, recibe el error &quot;Este dispositivo no puede usar un Módulo de plataforma confiable ...&quot;, lea este artículo para solucionar el problema. </p> <p><img src=\"images/image_thumb-34-100.png\" alt=\"turn on bitlocker operating system drive\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. En la siguiente pantalla, elija cómo desea desbloquear la unidad al inicio. </p> <blockquote><p> 1. Si desea desbloquear su PC mediante un dispositivo USB, haga clic en <strong> Inserte una unidad flash USB. <br> </strong> 2. Si desea desbloquear su PC escribiendo una contraseña, haga clic en <strong> Ingrese una contraseña </strong> . (como en este ejemplo) </p></blockquote> <p><img src=\"images/image_thumb-35-212.png\" alt=\"enable bitlocker protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Ahora escriba una contraseña muy segura y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb-36-435.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Ahora seleccione dónde desea guardar * la clave de recuperación y haga clic en <strong> próximo </strong> . * </p> <p> * Por ejemplo: si inicia sesión en Windows 10 con una cuenta de Microsoft, haga clic en <strong> Guárdelo en su cuenta de Microsoft. </strong> Si inicia sesión en Windows 10 con una cuenta local, elija una de las otras opciones. </p> <p> Notas: <br> 1. Si guarda la clave de recuperación de BitLocker en su cuenta de Microsoft, podrá ver la clave después de iniciar sesión en <a title=\"https://onedrive.live.com/recoverykey.\" href=\"https://onedrive.live.com/recoverykey.\" target=\"_blank\" rel=\"nofollow noopener\"> https://onedrive.live.com/recoverykey. </a><br> 2. Siempre prefiero almacenar la clave de recuperación en una unidad USB, para estar preparado para solucionar problemas de BitLocker. </p> <p> </p> <p><img src=\"images/image_thumb-37-801.png\" alt=\"save bitlocker recovery key\" loading=\"lazy\"></p> <p> </p> <p> 6. En la siguiente pantalla deje la configuración predeterminada si su PC y / o unidad es nueva y luego haga clic en <strong> próximo </strong> de nuevo. </p> <p><img src=\"images/image_thumb-38-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. En las opciones del modo de cifrado, deje la configuración predeterminada y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb-39-785.png\" alt=\"bitlocker encryption mode\" loading=\"lazy\"></p> <p> </p> <p> 8. En la última pantalla, haga clic en <strong> Continuar </strong> , para reiniciar y verificar el sistema antes de habilitar la protección de BitLocker. </p> <p><img src=\"images/image_thumb-40-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Al reiniciar, se le pedirá que ingrese su contraseña de BitLocker. Escriba su contraseña y presione <strong> Ingresar </strong> . * </p> <p> * Nota: Si BitLocker no puede aceptar la contraseña, o si tiene otros problemas, intente una de las siguientes acciones para iniciar sesión en Windows: </p> <blockquote><p> 1. Presione la tecla ESC en la pantalla Contraseña de BitLocker para acceder a las opciones de recuperación. <br> 2. Presione repetidamente la tecla ESC después de encender su PC, para omitir la prueba de BitLocker. </p></blockquote> <p> 10. Si se aprobaron las pruebas de BitLocker, después de iniciar Windows 10, BitLocker comenzará a cifrar la unidad de su sistema operativo. Para ver el estado del proceso de cifrado, haga clic en la notificación de BitLocker en la barra de tareas o vaya a Panel de control&gt; Cifrado de unidad BitLocker. </p> <p><img src=\"images/image_thumb-41-171.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}