{"title":"Cómo localizar las carpetas de inicio en Windows 10/8/7.","content":"<p> La carpeta de Inicio en Windows, es la ubicación donde se almacenan todos los accesos directos de las aplicaciones que comienzan con Windows. Hay dos carpetas de inicio diferentes en Windows: hay una carpeta de inicio que contiene todas las aplicaciones que se ejecutan para todos los usuarios y hay una carpeta de inicio diferente, que contiene solo las aplicaciones que se ejecutan para el usuario actual. </p> <p> Este tutorial contiene instrucciones sobre cómo ubicar las carpetas de inicio en el sistema operativo Windows 10, 8 o 7, para administrar (agregar o eliminar) las aplicaciones que comienzan con Windows. </p> <h4> Cómo ver las carpetas de inicio de Windows - Programas. * </h4> <p> * Nota: Si desea administrar las aplicaciones de inicio (Aplicaciones de la tienda) en Windows 10, navegue hasta: </p> <ul> <li> Ir <strong> Comienzo </strong> menú <img src=\"images/image_thumb-98-474.png\" alt=\"image\" loading=\"lazy\"> , haga clic en <strong> Ajustes </strong> <img src=\"images/image_thumb-150-181.png\" alt=\"image\" loading=\"lazy\"> y luego haga clic en <strong> Aplicaciones </strong> -&gt; <strong> Puesta en marcha. </strong></li> </ul> <p><img src=\"images/image_thumb-95-680.png\" alt=\"manage startup apps windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Para navegar a la carpeta de inicio &quot;Todos los usuarios&quot;. </h6> <p> Si desea localizar la carpeta que contiene todas las aplicaciones que se ejecutan automáticamente al iniciar Windows, <strong> para todas las cuentas de usuario </strong> , abra el Explorador de Windows y navegue hasta la siguiente ruta: * </p> <ul> <li><strong> C: \\ ProgramData \\ Microsoft \\ Windows \\ Menú Inicio \\ Programas \\ Inicio </strong></li> </ul> <p> * Nota: para ver el &quot; <strong> ProgramData </strong> &quot;carpeta en el Explorador de Windows, debe <a href=\"https://www.repairwin.com/how-to-view-hidden-files-in-windows-8-7-vista-xp/\" target=\"_blank\" rel=\"nofollow noopener\"> habilitar la vista de archivos ocultos </a> . </p> <p><strong> INCLINAR: </strong> Para facilitarle la vida, puede utilizar la siguiente forma de navegar hasta la ubicación anterior: </p> <ol> <li> <ol> <li> Presione Windows <img src=\"images/image_thumb8_thumb_thumb-770.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. </li> <li> En el cuadro de búsqueda, escriba: <strong> shell: inicio común </strong> &amp; haga clic <strong> OK </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb-91-505.png\" alt=\"How to Locate the Startup Folder for All Accounts (Users)\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Para navegar a la carpeta de inicio &quot;Cuenta actual&quot;. </h6> <p> Si desea ubicar la carpeta de inicio que contiene todas las aplicaciones que se ejecutan automáticamente al iniciar Windows, <strong> para la cuenta de usuario actual </strong> (solo), abra el Explorador de Windows y navegue hasta la siguiente ruta: * </p> <ul> <li><strong> C: \\ Usuarios \\\\ AppData \\ Roaming \\ Microsoft \\ Windows \\ Menú Inicio \\ Programas \\ Inicio </strong></li> </ul> <p> * Nota: para ver el &quot; <strong> Datos de aplicación </strong> &quot;carpeta en el Explorador de Windows, debe <a href=\"https://www.repairwin.com/how-to-view-hidden-files-in-windows-8-7-vista-xp/\" target=\"_blank\" rel=\"nofollow noopener\"> habilitar la vista de archivos ocultos </a> . </p> <p><strong> INCLINAR: </strong> Aquí hay otra forma más fácil de navegar en la ubicación anterior: </p> <ol> <li> <ol> <li> Presione Windows <img src=\"images/image_thumb8_thumb_thumb-671.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. </li> <li> En el cuadro de búsqueda, escriba: <b> shell: inicio </b> &amp; haga clic <strong> OK </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb-92-234.png\" alt=\" How to Locate the Startup Folder for current Account\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo! ¿Funcionó para ti? </p> <p> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}