{"title":"Cómo transferir el correo electrónico y la configuración de Thunderbird a una computadora nueva.","content":"<p> Este tutorial contiene instrucciones detalladas sobre cómo transferir mensajes de correo electrónico de Thunderbird, configuraciones de cuenta y libretas de direcciones a otra computadora. La aplicación de correo electrónico Thunderbird almacena todos los datos en una carpeta de perfil que tiene la extensión &quot;.default&quot; al final de su nombre. (por ejemplo, &quot;wyhsxcvs.default&quot;). De forma predeterminada, esta carpeta de perfil se almacena en la siguiente ubicación de su computadora: </p> <ul> <li> C: \\ Users \\\\ AppData \\ Roaming \\ Thunderbird \\ Profiles \\ <strong> .defecto </strong></li> </ul> <p><img src=\"images/image_thumb-14-425.png\" alt=\"How to Transfer Thunderbird Emails & Data to a New Computer.\" loading=\"lazy\"></p> <p> Entonces, si desea mover sus datos de Thunderbird a una nueva computadora, debe transferir la carpeta principal &#39;Thunderbird&#39; a la nueva computadora y luego apuntar Thunderbird a esa carpeta. </p> <h4> Cómo mover el perfil de Thunderbird a otra PC. </h4> <h6> Paso 1. Copie la carpeta Thunderbird Profile de la computadora antigua. </h6> <p> </p> <p> En la computadora anterior, navegue hasta la ubicación de almacenamiento de los datos de Thunderbird. Para hacer eso: </p> <p> 1. Abra Thunderbird. <br> 2. Desde el menú <img src=\"images/image_thumb21_thumb-959.png\" alt=\"image_thumb[21]\" loading=\"lazy\"> , escoger <strong> Ayudar </strong> -&gt; <strong> Información para solucionar problemas. <br> </strong> 3. En <strong> Carpeta de perfil </strong> línea, haga clic en <strong> Carpeta abierta </strong> . </p> <p><img src=\"images/image_thumb-8-878.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Cierre la aplicación Thunderbird. <br> 5. En la ventana del Explorador, haga clic en <strong> Itinerancia </strong> . </p> <p><img src=\"images/image_thumb-9-272.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Dupdo </strong> y <strong> Pegar </strong> la <strong> Thunderbird </strong> carpeta a un medio de almacenamiento con suficiente espacio libre. (por ejemplo, una unidad USB externa). </p> <p><img src=\"images/image_thumb-10-958.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Paso 2. Transfiera el perfil de Thunderbird a la nueva computadora. </h6> <p> 1. <a href=\"https://www.thunderbird.net/en-US/download/\" target=\"_blank\" rel=\"nofollow noopener\"> Descargar </a> e instale Thunderbird en la nueva PC. * </p> <p><strong> * Importante: </strong> Al final del proceso de instalación, <strong> desmarcar </strong> la opción &#39;Iniciar Mozilla Thunderbird ahora&#39; y haga clic en <strong> Terminar </strong> . </p> <p><img src=\"images/image_thumb-11-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Conecte la unidad USB (con la carpeta &quot;Thunderbird&quot;) a la nueva computadora. <br> 3. Haga clic con el botón derecho en la carpeta &#39;Thunderbird&#39; y haga clic en <strong> Dupdo </strong> . <br> 4. Presione el botón de Windows <img src=\"images/image_thumb8_thumb-1-464.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 5. Escriba el siguiente comando <strong> </strong> y presione <strong> Ingresar: </strong></p> <ul> <li><strong> %datos de aplicación% </strong></li> </ul> <p><img src=\"images/image_thumb-12-421.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. En las ventanas del Explorador, haga clic con el botón derecho en un espacio vacío y haga clic en <strong> Pegar </strong> . </p> <p><img src=\"images/image_thumb-13-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Inicie Thunderbird y debería ver todos sus correos electrónicos, libretas de direcciones y configuraciones de cuenta, como en su computadora anterior. </p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}