{"title":"Cómo actualizar los componentes de Chrome y Google Chrome manualmente.","content":"<p> Siempre que haya una nueva actualización de Chrome disponible, Google Chrome solicita al usuario que reinicie el navegador para instalar la actualización. Pero a veces, después de aplicar la actualización, Chrome puede fallar o congelarse. Esto sucede porque Chrome incluye varios componentes individuales que es posible que aún no se hayan actualizado y, en este caso, debe actualizarlos manualmente. </p> <p> Este tutorial contiene instrucciones sobre cómo actualizar Chrome y los componentes individuales de Chrome manualmente. </p> <h4> Cómo actualizar manualmente los componentes de Google Chrome y Chrome. </h4> <h6> Parte 1. Cómo actualizar Google Chrome manualmente. </h6> <p> Para instalar la última versión de Google Chrome: </p> <p> 1. Desde el menú de Chrome <img src=\"images/image_thumb-4-667.png\" alt=\"image\" loading=\"lazy\"> hacer clic <strong> Ayuda -&gt; Acerca de Google Chrome </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-39-551.png\" alt=\"How to Update Chrome manually\" loading=\"lazy\"></p> <p> </p> <p> 2. Google Chrome buscará actualizaciones y luego instalará automáticamente la última actualización. </p> <p><img src=\"images/image_thumb-40-825.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Cuando se complete la actualización, haga clic en el <strong> Relanzar </strong> botón. </p> <p><img src=\"images/image_thumb-41-622.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Parte 2. Cómo actualizar componentes individuales de Chrome. </h6> <p> 1. En la barra de direcciones de Chrome, escriba: </p> <ul> <li><strong> chrome: // componentes </strong></li> </ul> <p> 2. Haga clic en el <strong> Buscar actualizaciones </strong> en cada componente de Chrome que desee actualizar. </p> <p><img src=\"images/image_thumb-42-446.png\" alt=\"How to Update Chrome Components\" loading=\"lazy\"></p> <p> </p> <p> 3. Cuando termine de actualizar, reinicie Chrome. </p> <p> Ayuda adicional: si después de actualizar Chrome y sus componentes tiene problemas con su navegador, continúe con <a href=\"https://www.repairwin.com/how-to-uninstall-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> eliminar completamente y reinstalar Chrome </a> . </p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}