{"title":"Cómo desinstalar la versión de Edge Chromium en Windows 10.","content":"<p> Muchos usuarios han informado que después de instalar la nueva versión basada en Chromium del navegador Microsoft Edge en Windows 10, el sistema se volvió demasiado lento o se congela en momentos aleatorios. Si tiene el mismo problema, continúe leyendo a continuación para desinstalar la versión de Edge Chromium de su PC. * </p> <p> * Nota: Si la versión Chromium de Microsoft Edge aún no está instalada en su sistema, lea las instrucciones en este <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> artículo </a> para evitar que Microsoft Edge se instale automáticamente. </p> <p><img src=\"images/image_thumb-38-388.png\" alt=\"Remove Edge Chromium in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> La nueva versión basada en Chromium del navegador Microsoft Edge, se instala automáticamente con el <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> actualizar. Cuando esto sucede, no puede eliminar Microsoft Edge del <strong> Comienzo </strong> menú <img src=\"images/image_thumb2_thumb_thumb-565.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Ajustes </strong><img src=\"images/image_thumb-66-219.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Aplicaciones </strong> -&gt; <strong> Aplicaciones y funciones </strong> opciones, porque el <strong> Desinstalar </strong> La opción está atenuada. Para evitar esta restricción, aplique los pasos a continuación. </p> <p><img src=\"images/image_thumb-39-654.png\" alt=\"How to Uninstall Edge Chromium version in Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Cómo quitar Edge Chromium de Windows 10. </h4> <p> Para desinstalar el nuevo Edge basado en Chromium en Windows 10: </p> <p> 1. Navegue a la siguiente carpeta en su PC: * </p> <ul> <li> C: \\ Archivos de programa (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </li> </ul> <p> * Nota: El nombre de la carpeta &quot;85.0.564.41&quot; indica la versión instalada de la nueva versión de Chromium y puede diferir en su PC. </p> <p> 2. Seleccione la ruta de la carpeta en la barra de direcciones y haga clic con el botón derecho en&gt; <strong> Dupdo. </strong></p> <p><img src=\"images/image_thumb35_thumb-738.png\" alt=\"image_thumb[35]\" loading=\"lazy\"></p> <p> </p> <p> 3. Abrir <strong> Símbolo del sistema como administrador, </strong> tipo <strong> CD </strong> y luego presione <strong> CTRL + V </strong> para pegar en la ruta de la carpeta copiada. Cuando termine, presione <strong> Ingresar </strong> . * </p> <p> * Ej .: En el ejemplo actual, el comando será: </p> <p><em> cd C: \\ Archivos de programa (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </em></p> <p><img src=\"images/image_thumb39_thumb-252.png\" alt=\"Uninstall Edge Chromium\" loading=\"lazy\"></p> <p> </p> <p> 4. Ahora, dé el siguiente comando (Copiar / Pegar) en el símbolo del sistema para eliminar la versión Chromium del navegador Microsoft Edge de su PC. </p> <ul> <li> setup.exe –uninstall –system-level –verbose-logging –force-uninstall </li> </ul> <p><img src=\"images/image_thumb47_thumb-506.png\" alt=\"Uninstall Edge Chromium command\" loading=\"lazy\"></p> <p> 5. Una vez que se ejecute el comando anterior, la versión anterior de EDGE se activará nuevamente. Reinicie su PC para aplicar los cambios. <br> 6. Después de reiniciar, proceda a instalar manualmente el <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> nuevo navegador Edge basado en Chromium </a> en su PC, para evitar la entrega automática o la instalación futura de Edge Chromium, siguiendo las instrucciones de este artículo: <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo evitar que Edge Chromium se instale automáticamente en Windows 10. </a></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}