{"title":"Cómo eliminar la notificación de VISTA PROTEGIDA en todos los documentos de Word o Excel recibidos o descargados.","content":"<p> La &quot;Vista protegida&quot; es una característica que se agregó en las últimas versiones de Office, con el fin de proteger su computadora de cualquier virus que pueda estar incrustado en cualquier archivo descargado de Internet o recibido por correo electrónico. Aunque la alerta &quot;Vista protegida&quot; se puede eliminar fácilmente haciendo clic en &quot;Habilitar edición&quot;, es molesto recibir muchos documentos de fuentes confiables. </p> <p><img src=\"images/image_thumb-19-615.png\" alt=\"How to Remove Protected View Notification in Word-Excel\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Artículo relacionado: </strong> <a href=\"https://www.repairwin.com/fix-file-cannot-be-previewed-in-outlook-word-experienced-an-error-when-opening-attachment/?preview=true\" target=\"_blank\" rel=\"nofollow noopener\"> REVISIÓN: No se puede obtener una vista previa o abrir archivos adjuntos de correo electrónico de Word o Excel en Office 2013, 206, 2019 o 365 </a> . </li> </ul> <h4> Cómo deshabilitar la alerta de vista protegida en Word o Excel. </h4> <p> Para eliminar la alerta de VISTA PROTEGIDA en las versiones 2013, 2016, 2019 o 365 de Microsoft Word o Excel: </p> <p> 1. Desde el <strong> Archivo </strong> haga clic en el menú <strong> Opciones </strong> . <br> 2. En <strong> Centro de confianza </strong> opciones, seleccione <strong> Configuración del centro de confianza </strong> . </p> <p><img src=\"images/image_thumb-16-270.png\" alt=\"fix Word experienced an error trying to open the file\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Desmarcar </strong> todos &quot; <strong> Habilitar la vista protegida ... </strong> &quot;casillas de verificación y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-17-740.png\" alt=\"disable protected view option word - excel\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Por favor, deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a correr la voz sobre esto. </p>"}