{"title":"Cómo recuperar archivos DBX de Outlook Express GRATIS.","content":"<p> Outlook Express es un programa cliente de correo electrónico que se vio por primera vez en Windows XP. Pero incluso hoy (año 2018) algunos clientes todavía lo usan, como su principal programa de correo electrónico. Uno de los principales problemas que tiene Outlook Express es el problema del límite de 2GB. </p> <p> Descripción del problema de límite de tamaño de 2 GB en Outlook Express. <br> Cuando una de las carpetas principales de Outlook Express (por ejemplo, la &quot;Bandeja de entrada&quot; o &quot;Enviados&quot;) excede el tamaño de 2 GB, el archivo de almacenamiento OE DBX correspondiente puede dañarse y la carpeta OE puede parecer vacía. Como resultado del problema, Outlook Express no puede enviar ni recibir correos electrónicos y muestra el error <a href=\"https://www.repairwin.com/fix-outlook-express-error-0x800c0133-due-to-2gb-size-limit/\" target=\"_blank\" rel=\"nofollow noopener\"> 0x800c0133 </a> durante la operación de envío / recepción. </p> <p> En este tutorial, le mostraré cómo reparar un archivo DBX dañado de Outlook Express y recuperar sus correos electrónicos. </p> <h4> Cómo arreglar un archivo DBX de Outlook Express dañado. </h4> <p> Si una de las carpetas de Outlook Express (bandeja de entrada, Enviar, etc.) se daña, siga las instrucciones a continuación para reparar la carpeta de la tienda DBX y recuperar sus correos electrónicos. </p> <h6> Paso 1. Habilite la vista de archivos ocultos. </h6> <p> 1. Abra el Explorador de Windows. <br> 2. Desde el <strong> Herramientas </strong> menú elegir <strong> Opciones de carpeta </strong> . <br> 3. En la pestaña Ver, haga clic en <strong> Mostrar archivos y carpetas ocultas </strong> y haga clic en <strong> está bien. </strong></p> <p><img src=\"images/image_thumb-2-290.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Paso 2. Localice el archivo DBX de Outlook Express dañado en su disco. </h6> <p> 1. Abra la carpeta de la tienda de Outlook Express. Por lo general, esta carpeta se encuentra en la siguiente ruta de su disco: </p> <ul> <li> C: \\ Documents and Settings \\\\ Configuración local \\ Datos de aplicación \\ Identidades \\ {} \\ Microsoft \\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> p.ej. “C: \\ Documents and Settings \\ User \\ Local Settings \\ Application Data \\ Identities \\ {D8F3C56D-965E-41AE-8A23-A58460ABAE00} \\ Microsoft \\ <strong> Outlook Express </strong> &quot; </p></blockquote> <p> 3. De Explorer&#39;s <strong> Vista </strong> menú elegir <strong> Detalles </strong> . <br> 4. Localice qué archivo DBX excede el límite de almacenamiento de 2GB o localice el archivo DBX dañado. (el archivo DBX dañado es la carpeta MAIL que parece vacía en el programa Outlook Express). </p> <p><img src=\"images/image_thumb-3-887.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Copie ese archivo DBX en otra ubicación de su disco (por ejemplo, en una nueva carpeta en su escritorio llamada &quot;CorruptedDBX&quot;). </p> <p> </p> <h6> Paso 3. Descargue UnDBX - Free DBX Outlook Express Recovery Utility. </h6> <p> UnDBX es una herramienta de reparación de Outlook Express DBX excelente y gratuita que puede extraer todos los correos electrónicos de Outlook Express contenidos en formato .eml. Además, tiene la opción de reparar y reparar un archivo .DBX de Outlook Express dañado. </p> <p> Puede descargar UnDBX desde <a href=\"https://sourceforge.net/projects/undbx/\" target=\"_blank\" rel=\"nofollow noopener\"> aquí </a> . </p> <p> </p> <h6> Paso 4. Recupere los correos electrónicos del archivo DBX de Outlook Express dañado. </h6> <p> 1. Para recuperar correos electrónicos del archivo DBX dañado, haga doble clic para ejecutar la utilidad UnDBX. <br> 2. En la utilidad UnDBX: </p> <blockquote><p> 1. Seleccione la carpeta que contiene los archivos .dbx de Outlook Express y luego <strong> cheque </strong> la &quot; <strong> habilitar el modo de recuperación </strong> &quot;opción a continuación. <br> 2. <strong> Elija una carpeta de destino </strong> en su computadora, para almacenar (extraer) los archivos .eml. (por ejemplo, a una carpeta de su escritorio denominada &quot;Bandeja de entrada recuperada&quot;) <br> 3. Por último, haga clic en <strong> Recuperar </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-645.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Cuando se complete la recuperación de UnDBX, abra Outlook Express. <br> 4. Navegue a la carpeta donde UnDBX guardó los archivos .eml extraídos. <br> 5. Arrastre y suelte los correos electrónicos extraídos a la carpeta correspondiente (en Outlook Express). * </p> <p><strong> * Sugerencia: </strong> Para evitar que las carpetas de Outlook Express se corrompan nuevamente (o para evitar el límite de 2GB), sugiero arrastrar y soltar los correos electrónicos en grupos (por ejemplo, por año) y colocarlos en diferentes carpetas en OE. Por ejemplo, seleccione solo los correos electrónicos del año actual y arrástrelos y suéltelos en una nueva carpeta OE con el nombre del año actual (por ejemplo, &quot;Bandeja de entrada 2018&quot;). Luego, repita los mismos pasos de todos los demás correos electrónicos de los años anteriores. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}