{"title":"Cómo bloquear sitios web en Chrome o Firefox.","content":"<p> Si está buscando una manera fácil de bloquear un sitio web en Chrome o Firefox, continúe leyendo a continuación. </p> <p> Aunque Internet para la mayoría de nosotros se ha vuelto necesaria en nuestro día a día para nuestro trabajo o entretenimiento, por otro lado a veces es útil poder bloquear algunos sitios para evitar distracciones. Por ejemplo, nadie quiere que su hijo se distraiga viendo videos en YouTube cuando leen sus lecciones. </p> <p> En esta guía, aprenderá a bloquear sitios web en Chrome y <a href=\"#firefox\" target=\"_blank\" rel=\"nofollow noopener\"> Firefox </a> navegadores. </p> <p> * Nota: Si desea bloquear un sitio web en todos los navegadores, lea este artículo: <a href=\"https://www.repairwin.com/block-youtube-on-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo bloquear YouTube en Windows 10. </a></p> <h2> Cómo bloquear sitios web en Google Chrome. </h2> <p> La forma más fácil de bloquear un sitio web en Chrome es utilizar la famosa extensión BlockSite. La instalación del complemento BlockSite es similar a cualquier otra extensión. </p> <p> 1. Navega a <a href=\"https://chrome.google.com/webstore/detail/blocksite-stay-focused-co/eiimnmioipafcokbfikbljfdeojpcgbh\" target=\"_blank\" rel=\"nofollow noopener\"> Extensión BlockSite </a> en la tienda web de Chrome y haga clic en el <strong> Añadir a Chrome </strong> botón. </p> <p><img src=\"images/image_thumb-4-439.png\" alt=\"how to block websites chrome\" loading=\"lazy\"></p> <p> 2. Cuando se le solicite, haga clic en <strong> Agregar extensión </strong> . </p> <p><img src=\"images/image_thumb-5-782.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Cuando se complete la instalación, vaya al menú de Chrome&gt; Más herramientas&gt; Extensiones. </p> <p><img src=\"images/image_thumb-6-830.png\" alt=\"chrome tools extensions\" loading=\"lazy\"></p> <p> 4. Encuentra el <strong> BlockSite </strong> extensión y haga clic en <strong> Detalles. </strong></p> <p><img src=\"images/image_thumb-7-415.png\" alt=\"Blocksite details\" loading=\"lazy\"></p> <p> 5. <strong> Abierto </strong> la <strong> Opciones de extensión </strong> . </p> <p><img src=\"images/image_thumb-8-135.png\" alt=\"How to Block sites chrome\" loading=\"lazy\"></p> <p> 6. Escriba el nombre del sitio que desea bloquear (p. Ej. <a href=\"http://www.youtube.com\" target=\"_blank\" rel=\"nofollow noopener\"> www.youtube.com </a> ) y presione el símbolo más (+) para agregar el sitio web a la lista de sitios bloqueados. </p> <p><img src=\"images/image_thumb-9-298.png\" alt=\"blocked sites chrome\" loading=\"lazy\"></p> <p> 7. ¡Eso es! A partir de ahora, cuando intente visitar el sitio bloqueado, se le informará que el sitio está bloqueado con la extensión BlockSite. Para modificar la lista de sitios bloqueados, haga clic en <strong> Edita tu lista </strong> para realizar cualquier cambio que desee o para eliminar el sitio bloqueado de la lista. </p> <p><img src=\"images/image_thumb-10-951.png\" alt=\"image\" loading=\"lazy\"></p> <h3> Cómo proteger con contraseña los sitios bloqueados en la extensión BlockSite. </h3> <p> Si desea evitar que los usuarios desbloqueen un sitio bloqueado: </p> <p> 1. Abra el <strong> BlockSite </strong> opciones de extensión. <br> 2. Navega a <strong> Protección de contraseña </strong> ajustes. <br> 3. <strong> Permitir </strong> la opción Proteger <strong> sus opciones preferidas de BlockSite y la página de extensión de Chrome con una contraseña </strong> y luego escriba su correo electrónico y una contraseña y haga clic en <strong> Ahorrar. </strong></p> <p><img src=\"images/image_thumb-11-711.png\" alt=\"password protect blocked sites\" loading=\"lazy\"></p> <p> 4. BlockSite le enviará un correo electrónico con un enlace para verificar su dirección de correo electrónico. Después de la verificación del correo electrónico, la protección con contraseña estará activa. </p> <h2> Cómo bloquear sitios web en Mozilla Firefox. </h2> <p> 1. Navega a <a href=\"https://addons.mozilla.org/en-US/firefox/addon/blocksite/\" target=\"_blank\" rel=\"nofollow noopener\"> Extensión BlockSite </a> en complementos de Firefox. <br> 2. Haga clic en el <strong> Agregar a Firefox </strong> botón. </p> <p><img src=\"images/image_thumb-12-999.png\" alt=\"block websites firefox\" loading=\"lazy\"></p> <p> 2. Cuando se le solicite que permita la instalación de la extensión, haga clic en <strong> Agregar. </strong></p> <p><img src=\"images/image_thumb-13-588.png\" alt=\"Blocksite firefox\" loading=\"lazy\"></p> <p> 3. Cuando se complete la instalación, elija si desea bloquear sitios web en ventanas privadas (incógnito) y haga clic en <strong> Okey </strong> . </p> <p><img src=\"images/image_thumb-14-173.png\" alt=\"how to block site\" loading=\"lazy\"></p> <p> 4. Si desea evitar que la extensión BlockSite lea datos en los sitios que visita, haga clic en la letra Quizás. </p> <p><img src=\"images/image_thumb-15-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Ahora haga clic en el icono BlockSite y <strong> Editar lista de bloqueo </strong> para especificar qué sitios web desea bloquear. </p> <p><img src=\"images/image_thumb-16-657.png\" alt=\"block sites firefox\" loading=\"lazy\"></p> <p> 6. En la pestaña Bloquear sitios, escriba el nombre del sitio que desea bloquear (por ejemplo, &quot;facebook.com&quot;) y luego agréguelo a la lista de sitios web bloqueados. </p> <p><img src=\"images/image_thumb-17-817.png\" alt=\"How to block site Firefox\" loading=\"lazy\"></p> <p> 7. Una vez que haya agregado los sitios que desea bloquear, cierre la configuración de BlockSite y listo. </p> <p> Además de su función principal, la extensión BlockSite también tiene algunas otras funciones útiles como: </p> <ul> <li> <p><strong> Modo de enfoque </strong> : Bloquear sitios durante un tiempo específico (por ejemplo, 25 minutos) </p> </li> <li> <p><strong> Protección de contraseña: </strong> Proteja la configuración de BlockSite contra modificaciones. </p> </li> <li> <p><strong> Bloquear por palabras: </strong> Bloquear URL que contengan palabras específicas. </p> </li> </ul> <p> ¡Eso es todo amigos! Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}