{"title":"Cómo compartir archivos y carpetas en el sistema operativo Windows 10, 8.1 o 7.","content":"<p> La función de uso compartido de archivos en Windows le brinda la posibilidad de compartir fácilmente carpetas y archivos entre los usuarios de su red. Al compartir sus archivos con otros usuarios en la misma red, podrá ver y trabajar con los mismos archivos / carpetas. </p> <p> Este tutorial contiene instrucciones sobre cómo compartir carpetas y / o archivos en los sistemas operativos Windows 10, 8, 8.1 o 7. </p> <h4> Cómo habilitar el uso compartido de archivos en Windows. </h4> <h5> Paso 1. Agregue los usuarios requeridos a su PC. </h5> <p> Antes de continuar compartiendo sus archivos con otros, agregue los usuarios que tendrán acceso a la carpeta compartida en la computadora. Para realizar esa tarea, siga las instrucciones de los siguientes artículos, según su versión de Windows. </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-create-a-new-user-in-windows-7\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo agregar un nuevo usuario en Windows 7. </a></li> <li><a href=\"https://www.repairwin.com/how-to-add-a-new-user-account-in-windows-10-8/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo agregar un nuevo usuario en Windows 10 / 8.1 </a></li> </ul> <p> </p> <h5> Paso 2. Cómo compartir una carpeta o un archivo con otros. </h5> <p> 1. Haga clic con el botón derecho en la carpeta (o archivo) que desea compartir y seleccione <strong> Dar acceso a </strong> -&gt; <strong> Gente especifica. </strong></p> <p><img src=\"images/image_thumb-56-411.png\" alt=\"How to Share Files and Folders in Windows 10, 8.1, 7\" loading=\"lazy\"></p> <p> </p> <p> 2. Al usar el menú desplegable, seleccione el usuario con el que desea compartir sus archivos y luego haga clic en <strong> Agregar </strong> . </p> <p><img src=\"images/image_thumb-57-274.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Ahora haga clic en la flecha hacia abajo, junto al usuario que agregó y especifique sus permisos de acceso (Nivel de permiso) </p> <p><img src=\"images/image_thumb-58-517.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Cuando termine, presione el <strong> Cuota </strong> botón, </p> <p><img src=\"images/image_thumb-59-431.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Observe el enlace proporcionado a la carpeta compartida * y haga clic en <strong> Hecho </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-60-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. En este punto, ha habilitado el uso compartido de archivos en su computadora. Para acceder a la carpeta compartida desde otra PC: </p> <blockquote><p> una. En la barra de direcciones del Explorador, escriba el enlace a la carpeta compartida, como se muestra en el paso anterior. (por ejemplo, &quot;\\\\ DESKTOP-HMG31RD \\ 2Share&quot; sin comillas) <br> B. prensa <strong> Ingresar </strong> . <br> C. Escriba el nombre de usuario y la contraseña del usuario al que le ha dado acceso y presione <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-61-512.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Información adicional: <br> 1. Para cambiar los permisos del usuario, simplemente siga de nuevo el procedimiento anterior y cambie el Nivel de permiso del usuario. <br> 2. Si desea detener el intercambio de archivos, haga clic con el botón derecho en la carpeta / archivo compartido y vaya a <strong> Dar acceso a </strong> -&gt; y seleccione <strong> Quitar acceso </strong> . </p> <p><img src=\"images/image_thumb-62-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este problema. </p>"}