{"title":"Cómo restablecer la configuración de Photoshop a los valores predeterminados.","content":"<p> Si el programa de Photoshop funciona de forma extraña, la forma más rápida de solucionar el problema es restablecer la configuración de Photoshop a los valores predeterminados. En este tutorial encontrará instrucciones detalladas sobre cómo restablecer las Preferencias de Photoshop a sus valores predeterminados. </p> <p> En el programa Adobe Photoshop, todas las personalizaciones (opciones de visualización, opciones de rendimiento, opciones de transparencia, opciones del cursor, etc.) se guardan en el archivo &quot;Preferencias de Adobe Photoshop&quot; al salir de la aplicación. Si el archivo de preferencias se daña, entonces el programa Photoshop actúa de manera extraña y la única forma de solucionar el problema (s) es restaurar la configuración de preferencias a sus valores predeterminados. </p> <h4> Cómo restablecer las preferencias de Photoshop a las predeterminadas. * </h4> <p> * Nota: Los métodos anteriores restablecerán todas las configuraciones de preferencias a sus valores predeterminados. Si desea restablecer una herramienta de Photoshop en particular o todas, aplique las siguientes acciones: </p> <blockquote><p> 1. En el menú de Photoshop, haga clic en <strong> Ventanas </strong> y luego seleccione el <strong> Opciones </strong> Articulo. <br> 2. Luego, seleccione la herramienta que desea restablecer de la Caja de herramientas. <br> 3. Ahora haga clic derecho en la herramienta a la izquierda de la barra de Opciones y seleccione <strong> Herramienta de reinicio </strong> o <strong> Restablecer todas las herramientas. </strong></p></blockquote> <p><img src=\"images/image_thumb-25-673.png\" alt=\"reset tools photoshop\" loading=\"lazy\"></p> <h6></h6> <h6> Método 1. Restablezca las preferencias al iniciar Photoshop. </h6> <p> El primer método para restablecer la configuración en Photoshop es utilizar un atajo de teclado después de iniciar Photoshop. Para hacer eso: </p> <p> 1. <strong> Dejar </strong> Photoshop. <br> 2. <strong> Haga doble clic </strong> en el icono de Photoshop e inmediatamente <strong> sujetar </strong> la <strong> Ctrl + Alt + Mayús </strong> teclas (en Windows) o el <strong> Comando + Opción + Mayús </strong> (en Mac OS). <br> 3. Cuando se le solicite <strong> &quot;¿Eliminar el archivo de configuración de Adobe Photoshop?&quot; </strong> hacer clic <strong> Si. </strong></p> <p><img src=\"images/image_thumb-24-561.png\" alt=\"delete photoshop settings\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Método 2. Restablezca las preferencias desde el menú de Photoshop. </h6> <p> 1. Inicie Photoshop. <br> 2. Desde el <strong> Editar </strong> menú, seleccione <strong> Preferencias </strong> -&gt; <strong> General <br> </strong> 3. Haga clic en <strong> Restablecer preferencias al salir. </strong></p> <p><img src=\"images/image_thumb-21-842.png\" alt=\"Reset Adobe Photoshop Preferences on Quit\" loading=\"lazy\"></p> <p> </p> <p> 4. Haga clic en <strong> OK </strong> cuando se le solicite restablecer las preferencias al salir de Photoshop. </p> <p><img src=\"images/image_thumb-22-194.png\" alt=\"Reset Photoshop Settings on Quit\" loading=\"lazy\"></p> <p> </p> <p> 5. Haga clic en <strong> OK </strong> nuevamente para cerrar el cuadro de diálogo Preferencias. <br> 6. Cierre y vuelva a iniciar Photoshop. </p> <p> </p> <h6> Método 3. Elimine o cambie el nombre del archivo de configuración de Adobe Photoshop. </h6> <p> El último método para restablecer las preferencias de Photoshop a sus valores predeterminados es cambiar el nombre o eliminar el archivo de configuración de Photoshop (Adobe Photoshop% Version% Prefs.psp), en la siguiente ubicación de su PC: * </p> <ul> <li> C: \\ Usuarios \\% Nombre de usuario% \\ AppData \\ Roaming \\ Adobe \\ Adobe Photoshop% Versión% \\ Adobe Photoshop% Versión% Configuración \\ <strong> Adobe Photoshop% Version% Prefs.psp </strong></li> </ul> <p> * Nota: En MAC OS, navegue hasta: </p> <ul> <li> Usuarios \\% Nombre de usuario% \\ Biblioteca \\ Preferencias \\ Adobe Photoshop% Versión% Configuración \\ <strong> Adobe Photoshop% Version% Prefs.psp </strong></li> </ul> <p> Para eliminar las Preferencias de Adobe en el sistema operativo Windows 10, 8, 7: </p> <p> 1. <strong> Dejar </strong> Photoshop. <br> 2. Navegue a la carpeta &quot;C: \\ Users \\% Username% \\ AppData \\ Roaming \\&quot;. Para hacer eso: </p> <blockquote><p> 1. Presione las ventanas <img src=\"images/image_thumb8_thumb_thumb-455.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. En el cuadro de búsqueda, escriba: <strong> %datos de aplicación% </strong> &amp; haga clic <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-66-926.png\" alt=\"Delete Photoshop Preferences file\" loading=\"lazy\"></p> <p> </p> <p> 4. Luego navegue a la carpeta &quot;… \\ Adobe \\ Adobe Photoshop% Version% \\ Adobe Photoshop% Version% Settings \\&quot;. <br> 5. <strong> Borrar </strong> o <strong> rebautizar </strong> el archivo &quot;Adobe Photoshop% Version% Prefs.psp&quot; a Adobe Photoshop% Version% Prefs.OLD &quot;* </p> <p> * Nota: Si posee Photoshop de 64 bits, cambie el nombre o elimine también el archivo &quot;Adobe Photoshop X64% versión% Prefs.psp&quot;. </p> <p><img src=\"images/image_thumb-23-438.png\" alt=\"Re-create Photoshop Settings File\" loading=\"lazy\"></p> <p> </p> <p> 6. Inicie Photoshop. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}