{"title":"Cómo eliminar elementos de Windows Spotlight de la pantalla de bloqueo (como lo que ve, hechos divertidos, consejos, etc.) en Windows 10.","content":"<p> En Windows 10, Microsoft ha agregado la función Windows Spotlight, que es responsable de todas las imágenes de fondo, consejos y enlaces que ves en la pantalla de bloqueo. En este tutorial, encontrará instrucciones detalladas sobre cómo eliminar todos los elementos de Spotlight (como lo que ve, datos curiosos, consejos, etc.). desde la pantalla de bloqueo en las ediciones Windows 10 Home, Pro, Enterprise y Education. </p> <p><img src=\"images/image_thumb-85-983.png\" alt=\"Remove Windows Spotlight items from Windows 10 Lock Screen \" loading=\"lazy\"></p> <p> </p> <h2> Cómo eliminar datos divertidos, consejos, trucos y más ... de la pantalla de bloqueo en Windows 10. </h2> <ul> <li><a href=\"#turn-off-spotight-windows-10-home\" target=\"_blank\" rel=\"nofollow noopener\"> Inicio de Windows 10. </a></li> <li><a href=\"#turn-off-spotight-windows-10-pro\" target=\"_blank\" rel=\"nofollow noopener\"> Windows 10 Professional, Enterprise y Educación. </a></li> </ul> <p> </p> <h6> Cómo desactivar los elementos de Windows Spotlight en Windows 10 Home. </h6> <p> Para eliminar los datos divertidos, consejos y trucos en la pantalla de bloqueo en Windows 10 Home. </p> <p> 1. Haga clic con el botón derecho en un espacio vacío de su escritorio y seleccione <strong> Personalizar </strong> . * </p> <p> * Alternativamente: Ir a <strong> Comienzo </strong> menú <img src=\"images/image_thumb-98-467.png\" alt=\"image\" loading=\"lazy\"> , haga clic en <strong> Ajustes </strong> <img src=\"images/image_thumb-150-399.png\" alt=\"image\" loading=\"lazy\"> y luego haga clic en <strong> Personalización. </strong></p> <p><img src=\"images/image_thumb-86-908.png\" alt=\"Turn-Off Windows Spotlight Windows 10 Home\" loading=\"lazy\"></p> <p> </p> <p> 2. En la configuración de personalización, seleccione <strong> Bloquear pantalla </strong> a la izquierda y luego en las opciones de Fondo, configure una de las otras opciones (por ejemplo, Imagen o Presentación de diapositivas) para deshabilitar Windows Spotlight. </p> <p><img src=\"images/image_thumb-87-515.png\" alt=\"remove spotlight fun facts tricks windows 10 lock screen\" loading=\"lazy\"></p> <p> </p> <p> 3. Entonces <strong> Apagar </strong> el &quot;Obtenga datos divertidos, consejos y más de Windows y Cortana en su pantalla de bloqueo&quot; </p> <p><img src=\"images/image_thumb-88-136.png\" alt=\"turn off like what you see lock screen windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Cómo desactivar los elementos de Spotlight en las versiones Windows 10 Pro, Enterprise y Education. </h6> <p> Para deshabilitar los elementos de Windows Spotlight (como lo que ve, hechos divertidos, consejos, etc.), utilizando el editor de políticas de grupo: </p> <p> 1. Presione simultáneamente las ventanas <img src=\"images/image_thumb36-436.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> gpedit.msc </strong> &amp; Prensa <strong> Ingresar. </strong></p> <p><img src=\"images/image_thumb-78-637.png\" alt=\"turn off spotight group policy\" loading=\"lazy\"></p> <p> 3. En el panel izquierdo, navegue hasta: </p> <ul> <li><strong> Configuracion de Computadora </strong> &gt; <strong> Plantillas Administrativas </strong> &gt; <strong> Panel de control </strong> &gt; <strong> Personalización </strong></li> </ul> <p><strong> 4. </strong> En el panel derecho, haga doble clic en <strong> Forzar una pantalla de bloqueo predeterminada y una imagen de inicio de sesión específicas </strong> . </p> <p><img src=\"images/image_thumb-89-681.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Ahora, modifique esta configuración de política de la siguiente manera y luego haga clic en <strong> OK </strong> : </p> <blockquote><p> una. Cheque <strong> Activado </strong> . <br> B. Escriba la ruta de la imagen completa, de la imagen que desea usar como fondo en la pantalla de bloqueo. * <br> C. <strong> Cheque </strong> &quot;Desactiva datos divertidos, consejos, trucos y más en la pantalla de bloqueo&quot; </p></blockquote> <p> </p> <p> * SUGERENCIA: Puede usar su propia imagen para el fondo de la pantalla de bloqueo, o puede hacer su vida más fácil y usar una de las imágenes predeterminadas de la pantalla de bloqueo de Windows, que están almacenadas en la siguiente carpeta de su PC: C: \\ Windows \\ Web \\ Pantalla\\ </p> <p><img src=\"images/image_thumb-90-124.png\" alt=\"spotlight group policy\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo! ¿Funcionó para ti? </p> <p> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}