{"title":"Cómo proteger con contraseña una carpeta en Windows 10 (Bloquear carpeta con contraseña).","content":"<p> Este tutorial contiene dos métodos gratuitos y seguros diferentes para proteger con contraseña una carpeta en el sistema operativo Windows 10/8/7. Si bloquea una carpeta con una contraseña, nadie más que usted podrá acceder a ella. Proteger una carpeta con una contraseña es útil en los casos en los que comparte su computadora con otras personas y no desea que otra persona acceda y lea sus archivos privados. </p> <ul> <li><strong> Artículo relacionado: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo proteger con contraseña su PC con Windows 10 con BitLocker </a> . </strong></li> </ul> <h4> Cómo bloquear una carpeta con una contraseña en Windows 10. </h4> <h6> Método 1. Cómo bloquear y cifrar archivos con 7-zip (todas las versiones de Windows). </h6> <p> El método más fácil y seguro para proteger una carpeta con una contraseña en Windows es mediante la utilidad de archivado 7-Zip, que también admite el cifrado. Para cifrar y proteger con contraseña una carpeta / archivo con 7-zip: </p> <p> 1. Descargue e instale el <a href=\"https://www.7-zip.org/\" target=\"_blank\" rel=\"nofollow noopener\"> 7 cremalleras </a> programa archivador. <br> 2. Haga clic con el botón derecho en la carpeta (o archivo) que desea proteger con una contraseña y elija: <strong> 7 cremalleras </strong> &gt; <strong> Añadir al archivo </strong> . </p> <p><img src=\"images/image_thumb-28-978.png\" alt=\"How to Password Protect a Folder\" loading=\"lazy\"></p> <p> </p> <p> 3. En las opciones &quot;Agregar al archivo&quot;, especifique una contraseña segura y luego haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-29-728.png\" alt=\"set password to archive with 7-zip\" loading=\"lazy\"></p> <p> </p> <p> 4. Luego, elimine la carpeta (o archivo) sin comprimir y listo. </p> <h6> Método 2. Cómo cifrar una carpeta con protección EFS (Windows Pro y Enterprise). </h6> <p> La protección EFS es una herramienta de cifrado incorporada, en las ediciones Windows 10 Professional y Enterprise. Si protege una carpeta o un archivo con cifrado EFS, es muy difícil para otros acceder a los archivos cifrados, sin tener la clave de descifrado (clave de certificado PFX). </p> <p> La única desventaja del cifrado EFS es que el cifrado se eliminará si copia los archivos cifrados en otra computadora de la red o si envía los archivos cifrados por correo electrónico. </p> <p> Además, cuando cifra sus archivos EFS, la clave de descifrado (certificado) se almacena localmente en su computadora. Esto significa que cualquier persona con su contraseña también tendrá acceso a sus archivos cifrados. Por esa razón, si cifra sus archivos con el cifrado EFS, especifique una contraseña de inicio de sesión segura y no la comparta con otras personas. </p> <ul> <li><strong> Artículo relacionado: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo descifrar archivos cifrados EFS y eliminar cifrado EFS. </a></strong></li> </ul> <p><strong> Para cifrar una carpeta o archivo con EFS: </strong><br> 1. Haga clic con el botón derecho en la carpeta (o archivo) que desea proteger y seleccione <strong> Propiedades </strong> . <br> 2. En la pestaña General, haga clic en <strong> Avanzado </strong> . </p> <p><img src=\"images/image_thumb-13-582.png\" alt=\"enable efs protection\" loading=\"lazy\"></p> <p> </p> <p> 3. Seleccione <strong> Cifre archivos para proteger los datos </strong> y luego haga clic en <strong> está bien. </strong></p> <p><img src=\"images/image_thumb-14-983.png\" alt=\"How to Lock Folder with Password - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Luego haga clic en <strong> Solicitar </strong> y <strong> OK </strong> nuevamente para guardar los cambios y salir. <br> 5. En este punto, Windows le pedirá que haga una copia de seguridad de la clave de recuperación. Hacer clic <strong> Haga una copia de seguridad de su clave de cifrado de archivos. </strong></p> <p><img src=\"images/image_thumb-2-823.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Luego haga clic en <strong> Hacer copia de seguridad ahora (recomendado) </strong> y guarde la clave del certificado de descifrado en una unidad USB. </p> <p><img src=\"images/image_thumb-15-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. En el asistente de exportación de certificados, haga clic en <strong> próximo </strong> en la pantalla de bienvenida. <br> 8. Luego haga clic en <strong> próximo </strong> nuevamente en la pantalla Exportar formato de archivo. </p> <p><img src=\"images/image_thumb-4-842.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. En las opciones de seguridad: </p> <blockquote> <p> 1. <strong> Cheque </strong> la <strong> Contraseña </strong> caja. <br> 2. Escriba una contraseña para la clave del certificado exportado. <br> 3. Seleccione <strong> AES256-SHA256 </strong> cifrado <br> 4. Haga clic en <strong> próximo </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-16-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. Haga clic en <strong> Navegar </strong> y <strong> Ahorrar </strong> el archivo de certificado (.pfx) en su computadora. <br> 11. Cuando termine, haga clic en <strong> próximo </strong> continuar. </p> <p><img src=\"images/image_thumb-17-804.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. Por último, haga clic en <strong> Terminar </strong> . </p> <p><img src=\"images/image_thumb-18-449.png\" alt=\"image\" loading=\"lazy\"></p> <p> 13. Cuando se complete la exportación, guarde la clave del certificado exportado (archivo .pfx) en otra ubicación segura (por ejemplo, en un disco USB). </p> <p><strong> INCLINAR: </strong> Cuando cifra una carpeta (o archivos) con EFS, la clave de descifrado (certificado) se almacena en su carpeta de perfil de usuario. Por lo tanto, si otro usuario tiene su contraseña de inicio de sesión de Windows, puede abrir y leer los archivos cifrados. Para evitar que esto suceda, no comparta su contraseña de inicio de sesión o elimine (desinstale) el certificado de descifrado de su perfil cuando salga de su PC y vuelva a instalarlo cuando regrese. * </p> <p> * Nota: Para eliminar y volver a importar la clave de recuperación (certificado), vaya a: </p> <blockquote> <p> una. <strong> Panel de control </strong> &gt; <strong> Opciones de Internet. <br> </strong> B. En &#39;Opciones de Internet&#39;, haga clic en el <strong> Contenido </strong> pestaña y luego haga clic en <strong> Certificado </strong> s. <br> C. En la pestaña &#39;Personal&#39;, haga clic en el <strong> Eliminar </strong> , para eliminar la clave de descifrado (certificado), o haga clic en el <strong> Importar </strong> para volver a instalar el certificado de descifrado de la unidad USB. </p> </blockquote> <ul> <li> <p><strong> Artículo relacionado: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"noopener noreferrer\"> Cómo descifrar archivos cifrados EFS y eliminar cifrado EFS. </a></strong></p> </li> </ul> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución </p>"}