{"title":"Cómo reiniciar un servidor HP desde la interfaz de iLO.","content":"<p> En este tutorial, encontraremos instrucciones paso a paso sobre cómo reiniciar un servidor HP de forma remota, utilizando la interfaz iLO de HP. HP Integrated Lights-Out (iLO) es un componente de hardware de los servidores HP, que generalmente está integrado en la placa del sistema. El componente iLO tiene su propia conexión de red, dirección IP e interfaz web y puede ayudar al usuario a acceder y administrar de forma remota el servidor. </p> <h4> Cómo reiniciar un servidor HP mediante la interfaz web de iLO 5. </h4> <p> Para reiniciar un servidor si se cuelga, desde la interfaz de iLO: </p> <p> 1. Desde otra computadora, abra un navegador web y en la barra de direcciones, escriba la dirección IP de la interfaz de iLO en el servidor que desea reiniciar. <br> 2. Escriba el nombre de usuario y la contraseña de iLO y haga clic en <strong> Iniciar sesión </strong> . </p> <p><img src=\"images/image_thumb-8-790.png\" alt=\"restart hp proliant server from ilo\" loading=\"lazy\"></p> <p> </p> <p> 3. Elija <strong> Energía y Térmica </strong> a la izquierda. <br> 4. En la sección Botón de encendido virtual, haga clic en el <strong> Reiniciar </strong> para reiniciar su servidor HP. * </p> <p> * Info: </p> <ul> <li> Lo virtual <strong> Reiniciar </strong> El botón tiene la misma función que el <strong> Reanudar </strong> comando en el sistema operativo (arranque en caliente). </li> <li> Lo virtual <strong> Arranque en frío </strong> tiene la misma acción que el <strong> Cerrar </strong> comando en el sistema operativo. Si presiona el botón &#39;Arranque en frío&#39;, el servidor se apagará y se reiniciará después de aproximadamente 8 segundos. </li> </ul> <p> <img src=\"images/image_thumb-9-784.png\" alt=\"How to Reboot an HP Server using iLO 5 web interface.\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}