{"title":"Cómo ocultar o mostrar las barras de desplazamiento en el menú Inicio, la configuración o las aplicaciones de Windows 10.","content":"<p> Como habrás notado, en Windows 10, cuando inicias el menú Inicio, la aplicación Configuración o cuando trabajas en una aplicación de la tienda, la barra de desplazamiento es invisible por defecto y solo aparece cuando mueves el cursor hacia el lado derecho de la ventana abierta. ventana. Este comportamiento fue un poco molesto y afortunadamente Microsoft en la última actualización de funciones de Windows 10 1803 (abril de 2018) agregó la opción de mostrar siempre la barra de desplazamiento en todas las ventanas abiertas (por ejemplo, en el menú Inicio en la aplicación Configuración, etc.) . </p> <p><img src=\"images/image_thumb-446.png\" alt=\"Show Scroll Bar in Windows 10 \" loading=\"lazy\"></p> <p> Este tutorial contiene instrucciones sobre cómo ocultar o mostrar siempre las barras de desplazamiento en todas las ventanas y aplicaciones abiertas, en Windows 10 v1803 (o posterior). </p> <h4> Cómo mostrar u ocultar la barra de desplazamiento en el menú Inicio, la configuración o las aplicaciones de Windows 10. </h4> <p> 1. Desde el <strong> Comienzo </strong> <img src=\"images/image_thumb-38-810.png\" alt=\"image\" loading=\"lazy\"> menú elegir <strong> Ajustes </strong> <img src=\"images/image_thumb-44-476.png\" alt=\"image\" loading=\"lazy\"> . </p> <p> 2. Abrir <strong> Fácil acceso </strong> ajustes. </p> <p><img src=\"images/image_thumb-1-268.png\" alt=\"display scroll bar windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Haga clic en Pantalla a la izquierda y luego &quot;arrastre&quot; el <strong> Ocultar automáticamente las barras de desplazamiento en Windows </strong> cambiar a <strong> Apagado. </strong></p> <p><img src=\"images/image_thumb-3-742.png\" alt=\"always show scroll bars windows 10\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}