{"title":"El formulario de contacto 7 no funciona: se produjo un error al enviar su mensaje. Por favor, inténtelo de nuevo más tarde. (Resuelto)","content":"<p> Si el formulario de contacto 7 en su sitio de WordPress no funciona, continúe leyendo a continuación para solucionar el problema. Contact Form 7, es uno de los complementos gratuitos de WordPress más famosos, que le ayuda a crear, administrar y personalizar el formulario de contacto en su sitio de WordPress. Recientemente, descubrí que el complemento &quot;Formulario de contacto 7&quot; en mi sitio (y en muchos otros) dejó de funcionar con el error &quot;Hubo un error al enviar su mensaje. Vuelva a intentarlo más tarde&quot;, que está rodeado por un rectángulo naranja , después de enviar el formulario. </p> <p><img src=\"images/image_thumb-14-729.png\" alt=\"Contact Form 7: There was an error to send your message. Please try again later\" loading=\"lazy\"></p> <p> Este tutorial contiene instrucciones para corregir el error &quot;Hubo un error al enviar su mensaje. Vuelva a intentarlo más tarde&quot; dentro de un cuadro naranja, después de enviar el formulario de contacto. </p> <h4> Cómo CORREGIR: El formulario de contacto no funciona con el error &quot;Hubo un error al enviar su mensaje&quot;. </h4> <p> Si su Formulario de contacto 7 en su sitio de WordPress ya no funciona, siga los pasos a continuación: </p> <h6> Paso 1. Validar el formulario de contacto 7. </h6> <p> 1. Navegue a su panel de administración de WordPress y haga clic en <strong> Contacto </strong> &gt; <strong> Formularios de contacto. </strong><br> 2. En la parte superior de la página, compruebe si hay un mensaje de error que diga &quot;La configuración incorrecta provocó una falla en la entrega del correo u otros problemas. Valide sus formularios de contacto ahora&quot;. <br> 3. Si ve ese mensaje, * entonces <strong> hacer clic </strong> la <strong> Validar la configuración del Formulario de contacto 7 </strong> Enlace. </p> <p> * Nota: Si no ve ese mensaje, vaya al paso 2. </p> <p><img src=\"images/image_thumb-813.png\" alt=\"Validate Contact Form 7 Configuration \" loading=\"lazy\"></p> <p> 4. En la siguiente pantalla, haga clic en el <strong> Validar 2 formularios de contacto ahora </strong> botón. </p> <p><img src=\"images/image_thumb-1-270.png\" alt=\"Validate Contact Form\" loading=\"lazy\"></p> <p> 5. Cuando se complete la validación de la configuración, debería recibir el mensaje &quot;No se encontró ningún formulario de contacto no válido&quot;. </p> <p><img src=\"images/image_thumb-17-318.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Pruebe su formulario de contacto y, si el error persiste, continúe con el paso 2 a continuación. </p> <h6> Paso 2. Configure el Formulario de contacto 7 con las teclas reCAPTCHA V3. </h6> <p> Durante mi investigación, descubrí que las últimas versiones del Formulario de contacto 7 (v5.1 y posteriores) utilizan la API reCAPTCHA v3 para protegerte contra el spam y otros tipos de abuso automatizado. Entonces, en base a esto, tiene las siguientes dos opciones para resolver el error del formulario de contacto &quot;Hubo un error al enviar su mensaje. Vuelva a intentarlo más tarde&quot;: * </p> <ul> <li> <p><strong> Opción 1. </strong> Para configurar el Formulario de contacto 7 con las teclas reCAPTCHA V3. </p> </li> <li> <p><strong> Opcion 2. </strong> Usar el <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"noopener noreferrer\"> Formulario de contacto 7 - reCaptcha v2 </a> complemento para sus formularios de contacto. </p> </li> </ul> <p> * Nota: En este artículo, le mostraré cómo configurar el Formulario de contacto 7 con las teclas reCAPTCHA V3. Si no desea utilizar la protección reCAPTCHA V3, desinstale el complemento &#39;Formulario de contacto 7&#39; e instale el <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"nofollow noopener\"> Formulario de contacto 7 - reCaptcha v2 </a> enchufar. </p> <p><strong> Para configurar el Formulario de contacto 7 con las teclas reCAPTCHA V3: </strong></p> <p> 1. Inicie sesión en su cuenta de Google, que utilizó para configurar reCAPTCHA en su sitio y navegue hasta <a href=\"https://www.google.com/recaptcha/admin\" target=\"_blank\" rel=\"nofollow noopener\"> Consola de administración reCAPTCHA de Google. </a></p> <p> 2. Haga clic en Configuración <img src=\"images/image_thumb-2-494.png\" alt=\"image\" loading=\"lazy\"> icono. </p> <p><img src=\"images/image_thumb-3-786.png\" alt=\"Setup Contact Form 7 with recaptcha v3\" loading=\"lazy\"></p> <p> 3. Haga clic en el <strong> Papelera de reciclaje </strong> icono <img src=\"images/image_thumb-4-167.png\" alt=\"image\" loading=\"lazy\"> y <strong> Eliminar </strong> la <strong> Claves reCAPTCHA V2. </strong></p> <p><img src=\"images/image_thumb-5-757.png\" alt=\"Recaptcha v3\" loading=\"lazy\"></p> <p> 4. Haga clic en el icono Más <img src=\"images/image_thumb-6-851.png\" alt=\"image\" loading=\"lazy\"> para registrar nuevamente su sitio. </p> <p><img src=\"images/image_thumb-7-337.png\" alt=\"Register Site with Recaptcha\" loading=\"lazy\"></p> <p> 5. En la pantalla &quot;Registrar un sitio nuevo&quot;: </p> <blockquote> <p> una. <strong> Escriba un nombre </strong> para identificar su sitio en el futuro, <br> B. <strong> Escoger </strong> la <strong> reCAPTCHA v3 </strong> tipo. <br> C. <strong> Tipo </strong> la <strong> nombre de dominio </strong> de su sitio. <br> D. <strong> Aceptar </strong> la <strong> Condiciones de servicio de reCAPTCHA. </strong><br> mi. Hacer clic <strong> ENVIAR. </strong></p> </blockquote> <p><img src=\"images/image_thumb-8-227.png\" alt=\"Register Site with Recaptcha V3\" loading=\"lazy\"></p> <p> 6. Después del registro, verá una pantalla con el <strong> CLAVE DEL SITIO </strong> y el <strong> LLAVE SECRETA </strong> . <br> 7. Haga clic en <strong> CLAVE DEL SITIO DE COPIA </strong> y <strong> NO CERRAR </strong> esta ventana. </p> <p><img src=\"images/image_thumb-9-995.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. En otra ventana del navegador, navegue hasta el panel de administración de WordPress y haga clic en <strong> Contacto </strong> &gt; <strong> Integración. </strong></p> <p> 9. Haga clic en el <strong> Integración de configuración </strong> botón. </p> <p><img src=\"images/image_thumb-10-834.png\" alt=\"Integrate Recaptcha in Contact Form 7\" loading=\"lazy\"></p> <p> 10. Haga clic en el <strong> Quitar llaves </strong> para eliminar las claves reCAPTCHA V2. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"image\" loading=\"lazy\"></p> <p> 11. <strong> Pegar </strong> el nuevo <strong> Clave del sitio </strong> y luego copiar y pegar el nuevo <strong> Llave secreta </strong> desde la consola de administración de reCAPTCHA y haga clic en <strong> Guardar cambios. </strong></p> <p><img src=\"images/image_thumb-12-147.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. <strong> Borrar </strong> la <strong> Cache </strong> en tu sitio. <br> 13. Abra una nueva ventana del navegador y pruebe su formulario de contacto. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}