{"title":"FIX El servicio de amenazas de Windows 10 se ha detenido y no se puede iniciar (resuelto)","content":"<p> En esta guía encontrará instrucciones paso a paso para resolver el &quot;Error inesperado, lo sentimos, encontramos un problema&quot;, luego de presionar el botón &#39;Reiniciar ahora&#39; para iniciar el servicio de amenazas y solucionar el problema &quot;El servicio de amenazas se detuvo Reinícielo ahora &quot;en el sistema operativo Windows 10. </p> <p><img src=\"images/image_thumb-689.png\" alt=\"Threat Service has Stopped and Cannot Start\" loading=\"lazy\"></p> <p> </p> <p> Problemas en detalle: la función Virus y amenazas en el antivirus de Windows Defender muestra &quot;Desconocido&quot; y debido a que el servicio de amenazas se ha detenido y no puede comenzar con un error (s): </p> <ul> <li><em> Error inesperado. Lo sentimos, encontramos un problema. Inténtalo de nuevo. </em></li> <li><em> Página no disponible. Su administrador de TI tiene acceso limitado a algunas áreas de esta aplicación y el elemento al que intentó acceder no está disponible. Póngase en contacto con el servicio de asistencia técnica de TI para obtener más información. </em></li> </ul> <p><img src=\"images/image_thumb-1-155.png\" alt=\"Unable to Start Threat Service. Page not available.\" loading=\"lazy\"></p> <p> </p> <h4> Cómo solucionarlo: el servicio de amenazas se ha detenido y no se puede iniciar en Windows 10 Defender. </h4> <h6> Paso 1. Elimine cualquier otro antivirus. </h6> <p> El primer paso para corregir el error &quot;El servicio de amenazas se ha detenido&quot; es desinstalar cualquier otro antivirus de su PC. </p> <p> </p> <h6> Paso 2. Habilite la política de Windows Defender. </h6> <p> 1. Abrir <strong> Editor de registro </strong> : Para hacer eso: </p> <ul> <li> Presione simultáneamente las ventanas <img src=\"images/image_thumb36-454.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. </li> <li> Tipo <strong> regedit </strong> &amp; Prensa <strong> Ingresar. </strong></li> </ul> <p><img src=\"images/image_thumb7-613.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Navegue hasta la siguiente tecla en el panel izquierdo: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Políticas \\ Microsoft \\ Windows Defender </li> </ul> <p> 4. En el panel derecho, cambie el valor &#39;DisableAntiSpyware&#39; de 1 a <strong> 0 * </strong></p> <p> * Nota: Si no encuentra el valor &#39;DisableAntiSpyware&#39;, haga clic derecho en un espacio vacío y seleccione <strong> Nuevo </strong> -&gt; <strong> Valor DWORD (32 bits) </strong> y luego darle al valor el nombre &quot; <strong> DisableAntiSpyware </strong> &quot; </p> <p><img src=\"images/image_thumb-2-284.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Cierre el Editor del registro y <strong> Reanudar </strong> tu computador. <br> 6. Ahora verifique si la Protección contra amenazas está bien y si el problema persiste, continúe con el siguiente paso. </p> <p> </p> <h6> Paso 3. Habilite el servicio antivirus de Windows Defender en el registro. </h6> <p> 1. Abra el Editor del registro. <br> 2. Navegue hasta la siguiente tecla en el panel izquierdo: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ WinDefend </li> </ul> <p> 3. En el panel derecho, modifique el <strong> Comienzo </strong> valor de 4 a <strong> 2 </strong> . * </p> <p> * Nota: Si no puede modificar el valor del registro, inicie Windows 10 en modo seguro y vuelva a intentarlo. </p> <p><img src=\"images/image_thumb-3-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Cierre el Editor del registro y <strong> Reanudar </strong> tu computador. <br> 6. Ahora verifique si la Protección contra amenazas está bien y si el problema persiste, continúe con el siguiente paso. </p> <p> </p> <h6> Paso 4. SOLUCIONAR problemas de Windows Defender con DISM. </h6> <p> El siguiente método para resolver el error del Centro de seguridad de Windows 10 Defender &quot;El servicio de amenazas se ha detenido y no se puede iniciar&quot; es reparar Windows mediante la herramienta System Update Readiness (DISM). </p> <p> 1. Abrir <strong> Símbolo del sistema como administrador </strong> . Para hacer eso: </p> <ul> <li> En el cuadro de búsqueda, escriba: <strong> símbolo del sistema </strong> o <strong> cmd </strong></li> <li> Haga clic derecho en <strong> Símbolo del sistema </strong> resultado y seleccione <strong> Ejecutar como administrador. </strong></li> </ul> <p><img src=\"images/image_thumb-10-227.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. En el símbolo del sistema, proporcione el siguiente comando dism y presione <strong> Ingresar: </strong></p> <ul> <li><strong> DISM.exe / En línea / Imagen de limpieza / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-140.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> </p> <p> 3. Cuando se complete la operación DISM, escriba el siguiente comando y presione <strong> Ingresar </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb31-197.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Ahora espere hasta que el Comprobador de archivos de sistema repare los archivos de sistema de Windows. <br> 5. Una vez hecho esto, <strong> Reanudar </strong> tu computadora. </p> <p> </p> <h6> Paso 5. Repare Windows 10 con la actualización in situ. </h6> <p> El último método para resolver los problemas de instalación de Windows 10 Update es <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> repare Windows 10 con actualización local. </a></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}