{"title":"REVISIÓN: La ejecución de scripts está deshabilitada en este sistema en Windows 10 (resuelto)","content":"<p> Si intenta ejecutar una secuencia de comandos en Windows 10 PowerShell y recibe el mensaje de error &quot;No se puede cargar porque la ejecución de secuencias de comandos está deshabilitada en este sistema&quot;, continúe leyendo a continuación para solucionar el problema. </p> <p><img src=\"images/image_thumb-8-134.png\" alt=\"FIX: script cannot be loaded because is disabled on Windows 10\" loading=\"lazy\"></p> <p> </p> <h2> Cómo CORREGIR: No se puede ejecutar el script de PowerShell porque la política de seguridad impide que los scripts se ejecuten en Windows 10. </h2> <p> El error de PowerShell &quot;% ScriptName% .ps1 no se puede cargar porque está deshabilitado en este sistema&quot;, aparece debido a una política de seguridad que impide la ejecución de scripts. Para eliminar la restricción y habilitar la ejecución de scripts en Windows 10, proceda de la siguiente manera: </p> <p> 1. Abrir <strong> PowerShell como administrador </strong> . Para hacer eso: </p> <blockquote><p> 1. Presione el <strong> Ventanas <img src=\"images/image_thumb-97-958.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> teclas para abrir el cuadro de comando &#39;Ejecutar&#39; <strong><br> </strong> 2. Tipo <strong> potencia Shell </strong> y luego presione <strong> CONTROL </strong> + <strong> CAMBIAR </strong> + <strong> INGRESAR. </strong></p></blockquote> <p><img src=\"images/image_thumb-41-395.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. En PowerShell, copie / pegue el siguiente comando y presione <strong> Ingresar </strong> : </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy sin restricciones </li> </ul> <p> 3. Presione <strong> Y </strong> y golpea <strong> Ingresar </strong> en el mensaje de advertencia de la política de ejecución para aceptar el cambio. </p> <p><img src=\"images/image_thumb-9-581.png\" alt=\"Enable Running Scripts on Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Una vez completado el cambio de política, <strong> cerca </strong> la ventana de PowerShell. </p> <p> 5. Ahora, ejecute la secuencia de comandos que le dio el error &quot;Las secuencias de comandos están deshabilitadas&quot; con <strong> administración </strong> privilegios. El error debería desaparecer ahora. * </p> <blockquote><p> * Nota: Si aún recibe el error &quot;Los scripts están deshabilitados en este sistema&quot;, proporcione uno de los siguientes comandos e intente ejecutar su script nuevamente: </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy RemoteSigned </li> <li> set-executionpolicy remotesigned </li> </ul> </blockquote> <p> 6. Finalmente, vuelva a la configuración anterior de la política de ejecución de PowerShell (restricción), ejecutando este comando en PowerShell (Admin): * </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy restringido </li> </ul> <p> * Nota: Después de ejecutar el comando anterior, recibirá un mensaje de advertencia que explica los riesgos de seguridad de un cambio de política de ejecución. prensa <strong> Y </strong> y luego presione <strong> Ingresar </strong> para aceptar el cambio y volver a la configuración de política anterior. </p> <p><img src=\"images/image_thumb-10-246.png\" alt=\"Disable running scripts windows 10\" loading=\"lazy\"></p> <p> 7. Cierre la ventana de PowerShell y listo. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}