{"title":"REVISIÓN: Windows no puede instalar los archivos necesarios - Código de error 0x80070570 (resuelto)","content":"<p> Este tutorial contiene instrucciones para corregir el error de instalación de Windows 0x80070570: &quot;Windows no puede instalar los archivos necesarios. El archivo puede estar dañado o faltar. Asegúrese de que todos los archivos necesarios para la instalación estén disponibles y reinicie la instalación&quot;. El error de instalación de Windows 0x80070570 generalmente aparece al instalar el sistema operativo Windows 10, 8 o 7 desde un medio de instalación USB 3.0. </p> <p><img src=\"images/image_thumb-17-309.png\" alt=\"FIX: Windows Cannot Install Required Files 0x80070570\" loading=\"lazy\"></p> <p> </p> <h4> Cómo REPARAR Windows no puede instalar los archivos requeridos - Código de error 0x80070570 (Windows 10/8/7) </h4> <h6> Paso 1. Desconecte cualquier dispositivo conectado. </h6> <p> El primer paso para solucionar el error 0x80070570 &quot;Windows no puede instalar los archivos necesarios&quot; es desconectar cualquier otro dispositivo (por ejemplo, unidades de disco duro, disco duro USB, tarjeta inalámbrica USB) que no sea necesario para instalar Windows. </p> <p> </p> <h6> Paso 2. Desactive el <strong> Dispositivo de seguridad integrado </strong> . </h6> <p> El error de instalación de Windows 10 &quot;Windows no puede instalar los archivos necesarios&quot;, suele aparecer en las PC HP donde el &quot;Dispositivo de seguridad integrado&quot; está habilitado de forma predeterminada. Para evitar el error, proceda y desactive el dispositivo de seguridad en la configuración del BIOS. Para hacer eso: </p> <p> 1. <strong> Encendido </strong> la PC y <strong> prensa </strong> la <strong> F10 </strong> para entrar en la configuración del BIOS. <br> 2. Con las teclas de flechas, navegue hasta <strong> Seguridad </strong> -&gt; <strong> Seguridad del dispositivo </strong> y presione <strong> Ingresar. <br> </strong> 3. Configure el <strong> Dispositivo de seguridad integrado </strong> de &#39;Dispositivo disponible&#39; a <strong> Dispositivo oculto. </strong></p> <p><img src=\"images/image_thumb-23-480.png\" alt=\"FIX: HP SLOW RESTART\" loading=\"lazy\"></p> <p> </p> <p> 4. Presione el <strong> F10 </strong> clave para aplicar el cambio. <br> 5. <b> Guardar cambios y salir f </b> rom bios settings. <br> 6. Instale Windows 10. </p> <h6> Paso 3. Utilice otro puerto USB o medio de instalación. </h6> <p> El error &quot;Windows no puede instalar los archivos necesarios&quot;, ocurre comúnmente si configura Windows 10 desde un medio USB que está conectado a un puerto USB 3.0. Entonces, intente lo siguiente: </p> <ol> <li> Compruebe si puede deshabilitar la compatibilidad con USB 3.0 desde la configuración del BIOS. </li> <li> Conecte la unidad USB a un puerto USB 2.0 (oa otro puerto USB). </li> <li> Si su PC no tiene un puerto USB 2.0, instale Windows 10 desde una unidad flash USB 2.0 o desde un DVD. </li> <li> Si desea instalar Windows 10 en un sistema basado en UEFI, utilice la utilidad RUFUS y cree un medio de instalación USB para &quot;UEFI&quot;. Si su sistema no es compatible con UEFI, cree un medio de instalación USB para un sistema basado en &quot;Legacy&quot;. (Las instrucciones detalladas para hacerlo se pueden encontrar aquí: <a href=\"https://www.repairwin.com/create-windows-usb-with-rufus-iso-to-usb/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo crear una unidad de arranque USB de Windows con la utilidad Rufus. </a></li> <li> Re- <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> descargar el archivo ISO de Windows </a> y cree un nuevo medio de instalación USB de Windows, utilizando RUFUS. </li> </ol> <p> </p> <h6> Paso 4. Instale Windows 10 desde un dispositivo USB heredado. </h6> <p> Si recibe el error &quot;Windows no puede instalar los archivos necesarios&quot;, cuando configure Windows 10 desde un medio USB creado para el sistema UEFI, cree un nuevo medio USB para un sistema heredado y arranque desde el dispositivo USB heredado para instalar Windows 10. </p> <p> </p> <h6> Paso 5. Diagnostique la memoria en busca de problemas. </h6> <p> El tercer paso para resolver el error de configuración de Windows 0x80070570 es diagnosticar problemas en la RAM. Para realizar esta tarea, siga las instrucciones del siguiente artículo: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo diagnosticar problemas de memoria de la computadora con Memtest86 + </a></li> </ul> <p> </p> <h6> Paso 6. Compruebe si hay problemas en el disco duro. </h6> <p> Puede ocurrir el error de instalación de Windows 0x80070570, si el disco duro está dañado. Por lo tanto, proceda y diagnostique el disco duro en busca de errores y reemplace el disco duro si es necesario, siguiendo las instrucciones de esta guía: </p> <ul> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Las mejores herramientas de prueba y diagnóstico de disco duro para verificar la salud del disco duro </a></li> </ul> <h5></h5> <h6> Paso 7. Verifique las conexiones de cables y el hardware. </h6> <p> Si después de realizar los pasos anteriores, sigue apareciendo el error de instalación de Windows 0x80070570, entonces: </p> <p> 1. Verifique todas las conexiones de los cables y asegúrese de que el disco duro esté conectado correctamente. Además, si posee una PC de escritorio, reemplace el cable de datos del HDD. <br> 2. Intente instalar Windows usando una tarjeta de video (VGA) diferente si puede. <br> 3. Actualice su BIOS. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este problema. </p>"}