{"title":"REVISIÓN: No se pueden abrir enlaces desde el correo electrónico de Windows 10 o Outlook en Windows 10. (resuelto)","content":"<p> Si no puede abrir enlaces de correos electrónicos en las aplicaciones de Windows 10 Mail y Outlook, continúe leyendo a continuación para solucionar el problema. Muchos usuarios han informado que después de actualizar Windows 10, no podrán abrir enlaces incrustados de correos electrónicos en el navegador web y recibirán un error desconocido. </p> <p> Problema en detalles: en una computadora con Windows 10, los hipervínculos de los correos electrónicos de Outlook o la aplicación de correo de Windows 10 no se abren en el navegador web, especialmente si está usando como navegador predeterminado Chrome o Firefox y no Microsoft Edge . </p> <h4> Cómo CORREGIR: No se pueden abrir enlaces HTML desde correos electrónicos después de la actualización de Windows 10. </h4> <h6> Método 1. Restablecer aplicaciones predeterminadas. </h6> <p> 1. Cierre todos los navegadores web abiertos. <br> 2. Cierre la aplicación de correo electrónico que está utilizando (por ejemplo, Windows 10 Mail, Outlook). </p> <p> 3. Desde el menú Inicio <img src=\"images/image_thumb2_thumb_thumb-709.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> hacer clic <strong> Ajustes </strong><img src=\"images/image_thumb-66-594.png\" alt=\"image\" loading=\"lazy\"> y haga clic en <strong> Aplicaciones </strong></p> <p><img src=\"images/image_thumb-72-875.png\" alt=\"Windows 10 Apps\" loading=\"lazy\"></p> <p> 4. Elija <strong> Aplicaciones predeterminadas </strong> en el panel izquierdo y luego haga clic en el <strong> Reiniciar </strong> para restablecer las aplicaciones recomendadas por Microsoft. </p> <p><img src=\"images/image_thumb-73-622.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 5. Ahora abra su programa de correo electrónico y abra un hipervínculo desde un correo electrónico. Normalmente, el enlace se abrirá en el navegador Microsoft Edge sin problema. </p> <p> 6. Ahora, <strong> cerca </strong> la aplicación de correo de nuevo. </p> <p> 7. Abra el navegador web y configúrelo como predeterminado, o navegue hasta <strong> Configuraciones&gt; </strong> <strong> Aplicaciones&gt; Aplicaciones predeterminadas </strong> y en <strong> Navegador web </strong> opciones, haga clic en <strong> Microsoft Edge </strong> y seleccione su navegador favorito como navegador web predeterminado. </p> <p><img src=\"images/image_thumb-75-384.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 8. Vuelva a abrir la aplicación Correo e intente abrir un hipervínculo. Si el problema persiste, siga los pasos del método 2. </p> <h6> Método 2. Cambie las asociaciones HTML en el registro. </h6> <p> 1. Presione simultáneamente las ventanas <img src=\"images/image_thumb36-617.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> regedit </strong> &amp; prensa <strong> Ingresar. </strong></p> <p><img src=\"images/image_thumb7-779.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2. En el panel izquierdo, navegue hasta esta subclave: </p> <ul> <li><strong> HKEY_CURRENT_USER \\ Software \\ Classes \\ .html </strong></li> </ul> <p> 3. Ahora <em> haga doble clic </em> en el <strong> (Defecto) </strong> Cadena en el panel derecho y establezca los datos del valor en <strong> htmlfile </strong></p> <p><img src=\"images/image_thumb2-467.png\" alt=\"Cannot Open Links from Windows 10 Email or Outlook in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 4. Realice la misma operación y modifique el <em><strong> Defecto </strong></em> valor de cadena a <strong> htmlfile </strong> en estas subclaves: </p> <ul> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .htm </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .shtml </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .xhtml </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .xht <br> </em></li> </ul> <p> 5. Cierre el editor del registro y <strong> Reanudar </strong> tu computadora. <br> 6. Intente abrir hipervínculos desde su programa de correo electrónico. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Por favor, deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a correr la voz sobre esto. </p>"}