{"title":"REVISIÓN: Problema de uso elevado de CPU de Chrome (resuelto)","content":"<p> Si su sistema funciona con un uso elevado de la CPU cuando abre Chrome, probablemente una extensión de Chrome instalada o un programa de malware sea el culpable. Para solucionar fácilmente los problemas de uso elevado de la CPU en Google Chrome, siga los pasos a continuación. </p> <p><img src=\"images/image_thumb-46-593.png\" alt=\"FIX Chrome High CPU Usage\" loading=\"lazy\"></p> <p> </p> <h4> Cómo arreglar el uso elevado de CPU en Google Chrome. </h4> <h6> Paso 1. Escanee su computadora en busca de malware y virus. </h6> <p> El primer paso antes de solucionar el error &quot;ERR_CONNECTION_CLOSED&quot; en Chrome es asegurarse de que su sistema esté libre de virus / malware. Para esa tarea, siga las instrucciones de esta guía: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo escanear su computadora en busca de virus y otros programas maliciosos. </a></p> <p> </p> <h6> Paso 2. Desactive las extensiones de Chrome no deseadas. </h6> <p> 1. Desde el menú de Chrome <img src=\"images/image_thumb-47-125.png\" alt=\"image\" loading=\"lazy\"> , ir <strong> Más herramientas </strong> -&gt; <strong> Extensiones </strong></p> <p><img src=\"images/image_thumb-51-680.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Elimine (o desactive) cualquier extensión que no necesite o que no reconozca. </p> <p><img src=\"images/image_thumb-49-396.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Reanudar </strong> Google Chrome y compruebe si se ha resuelto el problema de uso elevado de la CPU cuando se ejecuta Chrome. Si el problema persiste, desactive o, mejor aún, elimine todas las extensiones instaladas y reinicie Chrome nuevamente. </p> <p> </p> <h6> Paso 3. Cree un nuevo perfil de Chrome. </h6> <p> 1. <strong> Cerca </strong> Cromo. <br> 2. Navegue a la siguiente ubicación (según su sistema operativo). </p> <blockquote><p> A. Si usa <strong> Windows 10, 8, 7 </strong> o <strong> Vista </strong> navegar a: </p> <ul> <li><strong> C: \\ Usuarios \\% Nombre de usuario% \\ AppData \\ Local \\ Google \\ Chrome \\ </strong></li> </ul> <p> </p> <p> * p.ej. Si su nombre de usuario es &quot;Usuario1&quot;, la carpeta de perfil de Chrome &quot; <strong> Datos del usuario </strong> &quot;, se almacena en&quot; C: \\ Users \\ User1 \\ AppData \\ Local \\ Google \\ Chrome \\ <strong> Datos del usuario </strong> &quot; </p> <p> B. Si usa <strong> Windows XP </strong> navegar a <strong> : </strong></p> <ul> <li><strong> C: \\ Documents and Settings \\\\% Username% \\ Local Settings \\ Application Data \\ Google \\ Chrome \\ </strong></li> </ul> <p> * p.ej. &quot;Si su nombre de usuario es&quot; Usuario1 &quot;, la carpeta del perfil de Chrome&quot; <strong> Datos del usuario </strong> &quot;se almacena en&quot; C: \\ Documents and Settings \\ User1 \\ Local Settings \\ Application Data \\ Google \\ Chrome \\ <strong> Datos del usuario&quot; </strong></p></blockquote> <p> 3. <strong> Rebautizar </strong> la &quot; <strong> Datos del usuario </strong> &quot;carpeta a&quot; <strong> Datos de usuario. </strong> &quot;. </p> <p><img src=\"images/image_thumb-50-745.png\" alt=\"create new chrome profile\" loading=\"lazy\"></p> <p> 4. Abra Google Chrome y compruebe si el problema persiste. Si Chrome funciona correctamente * y no hace que la CPU funcione a niveles altos, cierre Chrome y copie el archivo &quot;Marcadores&quot; de la carpeta &quot;User Data.OLD \\ Default&quot; a la carpeta &quot; <strong> Datos de usuario \\ Predeterminado </strong> carpeta \\ &quot;, para restaurar sus marcadores. </p> <p> * Nota: si Google Chrome todavía hace que la CPU funcione al 100%, entonces <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> desinstale completamente y vuelva a instalar Chrome. </a></p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}