{"title":"REVISIÓN: Problema de uso elevado de disco de SrTasks.exe (resuelto)","content":"<p> El siguiente problema puede aparecer en una computadora con Windows 10. El &quot;SrTasks.exe&quot; hace que el disco funcione al 100%. El proceso &quot;SrTasks.exe&quot; (Tareas en segundo plano de protección del sistema de Microsoft) es un proceso legítimo de Windows y se utiliza para iniciar el Servicio de instantáneas de volumen y el servicio Proveedor de instantáneas de software de Microsoft. </p> <p> El proceso &quot;SrTasks.exe&quot; inicia los servicios relacionados necesarios para crear puntos de restauración y normalmente no debería afectar el rendimiento del sistema de forma continua, y especialmente en sistemas donde la &quot;Protección del sistema&quot; está deshabilitada. </p> <p><img src=\"images/image_thumb-58-374.png\" alt=\"FIX SrTasks.exe High Disk Usage - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contiene instrucciones para resolver el problema de uso del disco 100% de SrTasks.exe en Windows 10. </p> <h4> Cómo reparar el uso elevado de disco de SrTasks.exe en Windows 10. </h4> <p> </p> <h6> Método 1. Analice su computadora en busca de malware y virus. </h6> <p> El primer paso para solucionar el problema de &quot;uso elevado del disco SrTasks.exe&quot; es asegurarse de que su sistema esté libre de virus / malware. Para esa tarea, siga las instrucciones de esta guía: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo escanear su computadora en busca de virus y otros programas maliciosos. </a></p> <p> </p> <h6> Método 2. Desactive la protección del sistema. </h6> <p> El segundo método para resolver el problema de uso elevado del disco causado por el proceso &quot;SrTasks.exe&quot; es deshabilitar la protección de restauración del sistema en su PC. Para hacer eso: </p> <p> 1. Abra el explorador de Windows, haga clic con el botón derecho en &quot;Esta PC&quot; y elija <strong> Propiedades </strong> . </p> <p><img src=\"images/image_thumb-70-978.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Elija <strong> Proteccion del sistema </strong> A la izquierda. </p> <p><img src=\"images/image_thumb-71-135.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Resalte el <strong> Disco local C: (Sistema) </strong> y haga clic en <strong> Configure. </strong></p> <p><img src=\"images/image_thumb-59-973.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. En las opciones de Protección del sistema, seleccione <strong> Deshabilitar la protección del sistema </strong> y haga clic en <strong> está bien. * </strong></p> <p> </p> <p> * Nota: Si la &quot;Protección del sistema&quot; ya está deshabilitada, continúe con el siguiente método. </p> <p><img src=\"images/image_thumb-60-732.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Reanudar </strong> su PC y luego verifique si se ha resuelto el problema de uso elevado del disco. Si el problema persiste, vuelva a habilitar la protección del sistema y continúe con el siguiente método. </p> <p> </p> <h6> Método 3. Desactive el servicio Superfetch. </h6> <p> En muchos casos, el problema del uso del disco al 100% se resuelve después de deshabilitar el servicio Superfetch. Para deshabilitar el servicio &quot;Superfetch&quot;: </p> <p> 1. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-289.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. En el cuadro de búsqueda, escriba: <strong><em> services.msc </em></strong> &amp; haga clic <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-12-431.png\" alt=\"services.msc\" loading=\"lazy\"></p> <p> </p> <p> 3. En la lista de servicios, haga doble clic en el servicio Superfetch para abrir sus propiedades. <br> 4. Establezca el &quot;Tipo de inicio&quot; en <strong> Discapacitado </strong> y entonces <strong> está bien. </strong></p> <p><img src=\"images/image_thumb-61-575.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Reanudar </strong> tu computadora. Si después de reiniciar el problema persiste, vuelva a habilitar el servicio &quot;SuperFetch&quot; y continúe con el siguiente método. </p> <p> </p> <h6> Método 4. Ejecute Comprobar disco para encontrar y corregir errores del disco duro. </h6> <p> 1. Abrir <strong> Símbolo del sistema como administrador </strong> . Para hacer eso: </p> <p> </p> <p> 1. Presione el <strong> Ventanas <img src=\"images/image_thumb-97-652.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> teclas para abrir el cuadro de comando &#39;Ejecutar&#39; <strong><br> </strong> 2. Tipo <strong> CMD </strong> y luego presione <strong> CONTROL </strong> + <strong> CAMBIAR </strong> + <strong> INGRESAR. </strong></p> <p><img src=\"images/image_thumb-35-581.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. En el símbolo del sistema, dé el siguiente comando para reparar su disco y presione <strong> Ingresar </strong> . </p> <ul> <li><strong> chkdsk C: / F / R </strong></li> </ul> <p> 3. Presione el <strong> Y </strong> para programar la comprobación en el próximo reinicio. <br> 4. <strong> Reanudar </strong> tu computadora. </p> <p><img src=\"images/image_thumb-62-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Ahora espere a que finalice el proceso de verificación del disco. (tardará varias horas). <br> 6. Cuando se complete el proceso de comprobación del disco, compruebe si se ha resuelto el &quot;Uso elevado de disco de SrTasks.exe&quot;. </p> <p> </p> <p> </p> <h6> Método 5. Solucione los problemas de Windows ejecutando las tareas de mantenimiento. </h6> <p> 1. Navega a <strong> Panel de control </strong> y abrir <strong> Solución de problemas </strong> . * </p> <p> * Nota: si no ve el <strong> Solución de problemas </strong> , establezca la opción &#39;Ver por&#39; en <strong> Iconos pequeños. </strong></p> <p><img src=\"images/image_thumb-63-494.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. En &quot;Sistema y seguridad&quot;, seleccione <strong> Ejecutar tareas de mantenimiento </strong> . </p> <p><img src=\"images/image_thumb-27-812.png\" alt=\"run maintenance in windows 10 & Windows 8\" loading=\"lazy\"></p> <p> </p> <p> 3. Presione <strong> próximo </strong> y luego espere hasta que la utilidad de mantenimiento del sistema detecte problemas. <br> 4. Siga las instrucciones en pantalla para solucionar los problemas encontrados. </p> <p> </p> <h6> Método 6. Reparar archivos de sistema de Windows. </h6> <p> Otro método para resolver el problema de uso elevado del disco SrTasks.exe en Windows 10 es reparar Windows mediante los comandos DISM y SFC. </p> <p> 1. Abrir <strong> Símbolo del sistema como administrador </strong> . <br> 2. En el símbolo del sistema, dé el siguiente comando y presione <strong> Ingresar: </strong></p> <ul> <li><strong> DISM.exe / En línea / Imagen de limpieza / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-583.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Cuando se complete la operación DISM, escriba el siguiente comando y presione <strong> Ingresar </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-428.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Ahora espere hasta que el Comprobador de archivos de sistema repare los archivos de sistema de Windows. <br> 5. Una vez hecho esto, <strong> Reanudar </strong> tu computadora. </p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}