{"title":"REVISIÓN: Error inteligente de HP - Estado de la impresora desconocido (resuelto)","content":"<p> Este tutorial contiene instrucciones para resolver el <a href=\"https://www.hpsmart.com/us/en\" target=\"_blank\" rel=\"nofollow noopener\"> HP inteligente </a> error de la aplicación &quot;Estado de la impresora desconocido&quot; en el sistema operativo Windows 10. El &quot;Estado de la impresora desconocido&quot; en la aplicación HP SMART puede aparecer por razones desconocidas y evita que el usuario utilice la función Escanear o Imprimir en la impresora. </p> <p> Problema en detalles: en una computadora con Windows 10 con una impresora HP instalada, aparece el error &quot;Estado de la impresora desconocido&quot; en la aplicación HP Smart, a pesar de que la impresora imprime sin problemas desde la Web u otras aplicaciones. El principal problema de este error es que el usuario no puede utilizar la opción ESCANEAR en la aplicación HP Smart para escanear un documento. </p> <p> </p> <p> </p> <p><img src=\"images/image_thumb-23-787.png\" alt=\"FIX: HP Smart \" printer status unknown loading=\"lazy\"></p> <h4> REVISIÓN: &quot;Estado de la impresora desconocido&quot; en la aplicación HP Smart. (Windows 10). </h4> <p> 1. Desde el menú Inicio <img src=\"images/image_thumb2_thumb_thumb-697.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> haga clic en Configuración <img src=\"images/image_thumb-66-822.png\" alt=\"image\" loading=\"lazy\"> y luego abrir <strong> Aplicaciones </strong> . </p> <p><img src=\"images/image_thumb-25-257.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Haga clic en <strong> Aplicación HP Smart </strong> y luego haga clic en <strong> Opciones avanzadas </strong> . </p> <p><img src=\"images/image_thumb-26-912.png\" alt=\"FIX: Printer Status unknown on HP Smart app\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Haga clic en el <strong> Reiniciar </strong> botón. </p> <p><img src=\"images/image_thumb-27-494.png\" alt=\"Fix Printer Status Unknow on HP Smart app\" loading=\"lazy\"></p> <p> 4. Cuando se complete el reinicio, cierre todas las ventanas y abra el <strong> HP inteligente </strong> aplicación. <br> 5. Normalmente, el error &quot;Estado de la impresora desconocido&quot; debería resolverse. Simplemente haga clic en el <strong> Configuración </strong> para habilitar todas las funciones de HP Smart y listo. * </p> <p><img src=\"images/image_thumb-28-849.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Nota: Si el error de HP Smart &quot;Estado de la impresora desconocido&quot; persiste, intente lo siguiente: </p> <blockquote><p> 1. <strong> Cerrar </strong> el ordenador. <br> 2. <strong> Desconectar </strong> la <strong> cable de alimentación de la impresora </strong> durante 1 minuto. <br> 3. Después de 1 minuto, <strong> encendido </strong> tu <strong> ordenador </strong> . <br> 4. Después de iniciar Windows 10, <strong> vuelva a conectar el cable de alimentación de la impresora </strong> y compruebe si se ha resuelto el error &quot;Estado de la impresora desconocido&quot; en la aplicación HP Smart. Si el error persiste, proceda a desinstalar y reinstalar la impresora y el software de la impresora en su PC. </p></blockquote> <p> ¡Eso es todo amigos! Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}