{"title":"REVISIÓN: No pudimos conectarnos al servicio de actualización. Asegúrese de estar conectado a Internet en Windows 10 (resuelto)","content":"<p> Este tutorial contiene instrucciones para corregir el siguiente error en la actualización de Windows 10: &quot;No pudimos conectarnos al servicio de actualización. Intentaremos nuevamente más tarde, o puede verificar ahora. Si aún no funciona, asegúrese de estás conectado a Internet &quot;. </p> <p><img src=\"images/image_thumb-46-713.png\" alt=\"We couldn't connect to the update service. Make sure you're connected to the Internet in Windows 10 update\" loading=\"lazy\"></p> <p> </p> <p> Microsoft es consciente del problema de actualización anterior y, como ha <a href=\"https://support.microsoft.com/en-us/help/4464619/windows-10-update-history\" target=\"_blank\" rel=\"nofollow noopener\"> anunciado el 4 de febrero de 2019 </a> : &quot;El servicio Windows Update se vio afectado por un problema de corrupción de datos en una interrupción global del proveedor de servicios DNS externo el 29 de enero de 2019. El problema se resolvió el mismo día y Windows Update ahora funciona normalmente, pero algunos clientes han continuado informar problemas de conexión con el servicio Windows Update. Esperamos que estos problemas desaparezcan a medida que los servidores DNS descendentes se actualicen con las entradas DNS de Windows Update corregidas &quot;. </p> <p> Debido a que muchos usuarios informaron que el problema aún no se ha solucionado y que también afecta a Windows Defender (no se pueden actualizar las definiciones de Defender) y a Microsoft Store (la tienda no funciona), lea las instrucciones a continuación para resolver cualquier problema de actualización en Windows 10, o en Windows Defender y en la Tienda Windows. </p> <h2> Cómo CORREGIR: No se pudo conectar al servicio de actualización en Windows 10. </h2> <h6> Método 1. Cambiar la configuración de DNS </h6> <p> 1. <strong> Botón derecho del ratón </strong> sobre el <strong> La red </strong> icono <img src=\"images/image_thumb-42-546.png\" alt=\"image\" loading=\"lazy\"> en la barra de tareas y haga clic en <strong> Red abierta y centro de intercambio de. </strong> * </p> <p><img src=\"images/image_thumb-104-256.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> </p> <p> 2. Seleccione <strong> Ethernet </strong> (o Wi-Fi) a la izquierda, y luego en la sección &#39;Configuraciones relacionadas&#39;, haga clic en <strong> Cambiar las opciones del adaptador </strong> . </p> <p><img src=\"images/image_thumb-43-363.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3. Haga clic con el botón derecho en el adaptador de red activo (Ethernet o Wi-Fi) y seleccione <strong> Propiedades </strong> . </p> <p><img src=\"images/image_thumb-44-396.png\" alt=\"network properties\" loading=\"lazy\"></p> <p> 4. Seleccione el <strong> ‘Protocolo de Internet versión 4 (TCP / IPv4) </strong> &quot;Y haga clic en <strong> Propiedades </strong></p> <p><img src=\"images/image_thumb-106-941.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 5. En las propiedades del Protocolo de Internet versión 4 (TCP / IPv4): </p> <blockquote><p> una. <strong> Cheque </strong> la <strong> Utilice las siguientes direcciones de servidor DNS: </strong> boton de radio. <br> B. Luego, escriba las siguientes direcciones de servidor DNS (servidores DNS públicos de Google) y haga clic en <strong> está bien. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> </blockquote> <p><img src=\"images/image_thumb-109-998.png\" alt=\"google dns settings\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Reanudar </strong> tu computadora. </p> <p> </p> <h6> Método 2. Ejecute el solucionador de problemas de Windows Update. </h6> <h6> Método 2. Ejecute el solucionador de problemas de Windows Update. </h6> <p> 1. Navega a Windows <strong> Panel de control </strong> , establezca &quot;Ver por&quot; en <strong> Iconos pequeños </strong> y abrir <strong> Solución de problemas. </strong></p> <p><img src=\"images/image_thumb-5-213.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. En las opciones de solución de problemas, haga clic en <strong> Solucione problemas con Windows Update. </strong></p> <p><img src=\"images/image_thumb-9-911.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Haga clic en <strong> próximo </strong> para solucionar problemas de actualización de Windows. </p> <p><img src=\"images/image_thumb-8-372.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Cuando se complete el proceso de solución de problemas, <strong> cerca </strong> el solucionador de problemas y <strong> Reanudar </strong> tu computador. <br> 6. Busque actualizaciones. </p> <h6> Método 3. <strong> Elimina la carpeta de la tienda de actualizaciones. </strong></h6> <p> &quot;C: \\ Windows \\ SoftwareDistribution&quot;, es la ubicación donde Windows almacena las actualizaciones de Windows. Muchas veces, esta carpeta se daña y debe volver a crearla para descargar actualizaciones e instalarlas desde cero. Para reconstruir (volver a crear) la carpeta &quot;SoftwareDistribution&quot;, siga los pasos a continuación: </p> <p><strong> Paso 1: Detenga el servicio de actualización de Windows. </strong></p> <p> 1. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-610.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. En el cuadro de búsqueda, escriba: <strong> services.msc </strong> &amp; haga clic <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-12-860.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 3. En el panel de control de Servicios, ubique el <strong> actualizacion de Windows </strong> Servicio. <br> 4. Haga clic derecho en <strong> actualizacion de Windows </strong> servicio y seleccione <strong> Detener </strong> . </p> <p><img src=\"images/image_thumb-9-707.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Paso 2: Elimine la carpeta SoftwareDistribution. </strong></p> <p> 1. Abra el Explorador de Windows y navegue hasta: <strong> C: \\ Windows </strong> carpeta. <br> 2. Encuentra y <strong> Borrar </strong> la <strong> Distribución de software </strong> carpeta (o cámbiele el nombre, por ejemplo, a &quot;SoftwareDistributionOLD&quot;). </p> <p> </p> <p><img src=\"images/image_thumb-10-148.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p><strong> Paso 3: inicie el servicio de actualización de Windows. </strong></p> <p> 1. Abra el panel de control de Servicios de Windows. <br> 2. Haga clic derecho en <strong> actualizacion de Windows </strong> servicio y seleccione <strong> Comienzo </strong> . </p> <p><img src=\"images/image_thumb-11-233.png\" alt=\"start windows update service\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Paso 4: Verifique e instale la actualización de Windows 10. </strong></p> <p> 1. Navega a <strong> Ajustes </strong> -&gt; <strong> Actualización y seguridad </strong> y haga clic en <strong> Buscar actualizaciones </strong> . </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}