{"title":"REVISIÓN: No se puede encontrar la aplicación de Skype en Windows 10 (resuelto)","content":"<p> Después de una actualización de Windows 10, puede aparecer el siguiente error al iniciar: &quot;Windows no puede encontrar &#39;C: \\ Archivos de programa \\ WindowsApps \\ Microsoft.SkypeApp… \\ Skype \\ Skype.exe&#39;. Asegúrese de escribir el nombre correctamente y vuelva a intentar . &quot; Si se encuentra con el error &quot;No se puede encontrar la aplicación de Skype&quot; al iniciar Windows 10, continúe leyendo a continuación. </p> <p><img src=\"images/image_thumb-200.png\" alt=\"FIX: Cannot Find Skype App in Windows 10 \" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contiene instrucciones para resolver el error &quot;No se puede encontrar la aplicación de Skype&quot; en Windows 10. </p> <h4> REVISIÓN: La aplicación de Skype no se puede iniciar; Windows no puede encontrar la aplicación de Skype. </h4> <h6> Paso 1. Desinstale la aplicación Skype. </h6> <p> 1. Desde el menú Inicio <img src=\"images/image_thumb2_thumb_thumb-866.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> hacer clic <strong> Ajustes </strong> <img src=\"images/image_thumb-66-964.png\" alt=\"image\" loading=\"lazy\"> y luego abrir <strong> Aplicaciones </strong> . <br> 2. <strong> Seleccione </strong> la <strong> Skype </strong> aplicación en la lista y haga clic en <strong> Desinstalar </strong> . </p> <p><img src=\"images/image_thumb-4-857.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Cuando se complete la desinstalación, <strong> Reanudar </strong> tu computador. </p> <p> 4. Después de reiniciar, si aún recibe el error &quot;No se puede encontrar la aplicación de Skype&quot;, continúe con el paso 2 </p> <p> </p> <h6> Paso 2. Vuelva a instalar la aplicación Skype. </h6> <p> 1. Abra el <strong> Microsoft Store </strong> . <br> 2. Tipo <strong> Skype </strong> en la barra de búsqueda y luego haga clic en el <strong> Aplicación de Skype </strong> en la lista. </p> <p><img src=\"images/image_thumb-5-853.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Haga clic en <strong> Obtener </strong> para instalar Skype en su PC. </p> <p><img src=\"images/image_thumb-6-971.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Cuando se complete la instalación, <strong> Reanudar </strong> tu computador. Normalmente, el mensaje &quot;No se puede encontrar la aplicación de Skype&quot; ya no debería aparecer. * </p> <p> * Nota: Si aún recibe el mensaje &quot;No se puede encontrar la aplicación de Skype&quot; (no se pudo encontrar la aplicación de Skype), siga las instrucciones del paso 1 anterior para desinstalar la aplicación de Skype de su PC y luego instalar la <a href=\"https://www.skype.com/en/get-skype/download-skype-for-desktop/\" target=\"_blank\" rel=\"nofollow noopener\"> Aplicación Skype para escritorio </a> . </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}