{"title":"REVISIÓN: La relación de confianza entre esta estación de trabajo y el dominio principal falló (resuelto)","content":"<p> Si recibe el error &quot;Falló la relación de confianza entre esta estación de trabajo y el dominio principal&quot; cuando intenta iniciar sesión en su dominio o cuando intenta acceder a una carpeta compartida en otra máquina del dominio, continúe leyendo a continuación para resolver el problema. </p> <p> El error &quot;Falló la relación de confianza entre la estación de trabajo y el dominio principal&quot;, puede aparecer por las siguientes razones: </p> <ul> <li> La computadora tiene el mismo nombre que otra computadora en el dominio. </li> <li> Las credenciales de dominio (nombre de usuario o contraseña) no son válidas. </li> <li> La cuenta de la computadora ha expirado. * </li> </ul> <p> * Nota: Algunas organizaciones preconstruyen computadoras (o clones de computadoras) para su uso posterior. Si la cuenta de la computadora ha expirado, ya no podrá autenticarse con el dominio. En tales casos, los equipos que no pueden autenticarse con el dominio deben eliminarse del dominio y volver a unirse a él. (paso 4) </p> <p><img src=\"images/image_thumb-32-740.png\" alt=\"FIX: Trust Relationship Between this Workstation and the Primary Domain Failed \" loading=\"lazy\"></p> <h4> Cómo CORREGIR: Error en la relación de confianza entre la estación de trabajo y el dominio. </h4> <h6> Método 1. Verifique que las credenciales de dominio sean correctas. </h6> <p> En primer lugar, asegúrese de que las credenciales sean correctas y especialmente la contraseña. si ha clonado la máquina a partir de una imagen de computadora tomada en el pasado y desde entonces el código ha cambiado. </p> <h6> Método 2. Compruebe si hay nombres de equipos duplicados. </h6> <p> Asegúrese de que el nombre de la computadora sea único y que no haya ninguna otra computadora en la red con el mismo nombre. </p> <h6> Método 3. Compruebe si hay direcciones IP duplicadas. </h6> <p> Asegúrese de que la dirección IP de la computadora sea única y no entre en conflicto con otra dirección IP en la red. </p> <h6> Método 4. Quite y vuelva a unir la computadora en el dominio. </h6> <p> El método habitual para corregir una relación de confianza entre una computadora y un dominio es eliminar y volver a agregar la computadora afectada al dominio. </p> <h5> Paso 1. Elimine la cuenta de computadora del dominio. </h5> <p> 1. Inicie sesión en el servidor de Active Directory. <br> 2. Abrir <strong> Directorio activo de usuarios y computadoras. <br> </strong> 3. Expanda el <strong> Ordenadores </strong> envase. <br> 4. Haga clic con el botón derecho en la computadora afectada y seleccione <strong> Borrar. </strong></p> <p><img src=\"images/image_thumb-39-366.png\" alt=\"Delete Computer Account from Domain\" loading=\"lazy\"></p> <h5> Paso 1. Quite y vuelva a unirse a la computadora en el dominio. </h5> <p> 1. Inicie sesión en la computadora afectada con la cuenta de administrador LOCAL (Nombre de la computadora \\ Administrador). </p> <p> 2. Presione Windows <img src=\"images/image_thumb8_thumb-480.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. </p> <p> 2a. Tipo <strong> sysdm.cpl </strong> &amp; haga clic <strong> OK </strong> . </p> <p><img src=\"images/image_thumb7_thumb-169.png\" alt=\"system properties\" loading=\"lazy\"></p> <p> 3. En la pestaña &quot;Nombre del equipo&quot;, haga clic en <strong> Cambio </strong> . </p> <p><img src=\"images/image_thumb-37-924.png\" alt=\"Remove Computer from Domain\" loading=\"lazy\"></p> <p> 4. En Miembro de, seleccione <strong> Grupo de trabajo </strong> , escriba un nombre de grupo de trabajo (por ejemplo, &quot;GRUPO DE TRABAJO&quot;) y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-34-169.png\" alt=\"Change Computer Name - Membership\" loading=\"lazy\"></p> <p> 5. Escriba las credenciales del administrador y haga clic en <strong> OK </strong> . <br> 6. <strong> Reanudar </strong> el ordenador. </p> <p> 7. Realice los pasos del 1 al 4 de nuevo, pero esta vez, en el paso 4, seleccione <strong> Dominio, </strong> escriba el nombre de dominio y haga clic en <strong> está bien. </strong></p> <p><img src=\"images/image_thumb-38-928.png\" alt=\"Add computer to domain\" loading=\"lazy\"></p> <p> 8. Escriba las credenciales de administrador de dominio y haga clic en <strong> OK </strong> . <br> 9. <strong> Reanudar </strong> su PC e inicie sesión en el dominio utilizando la cuenta de usuario del dominio. </p> <h6> Método 5. Restablezca la cuenta del equipo en el dominio. </h6> <p> 1. Inicie sesión en el servidor de Active Directory. <br> 2. Abrir <strong> Directorio activo de usuarios y computadoras. <br> </strong> 3. Expanda el <strong> Ordenadores </strong> envase. <br> 4. Haga clic con el botón derecho en la computadora afectada y seleccione <strong> Restablecer cuenta. </strong></p> <p><img src=\"images/image_thumb-36-935.png\" alt=\"Reset Computer Account in Domain\" loading=\"lazy\"></p> <p> 5. Finalmente, <strong> Reanudar </strong> la <strong> máquina afectada </strong> e inicie sesión en el dominio. </p> <p> ¡Eso es todo amigos! ¿Qué método te funcionó? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}