{"title":"REVISIÓN: El servidor no es accesible. Es posible que no tenga permiso para utilizar este recurso de red. El mango no es válido. (Resuelto)","content":"<p> Este tutorial contiene instrucciones para corregir el siguiente error al intentar acceder a una carpeta compartida en la red: &quot;El servidor no es accesible. Es posible que no tenga permiso para utilizar este recurso de red. Póngase en contacto con el administrador de este servidor para averiguar si tiene acceso permisos. El identificador no es válido. &quot; </p> <p><img src=\"images/image_thumb-5-437.png\" alt=\"You might not have permission to use this network resource\" loading=\"lazy\"></p> <p> </p> <h2> Cómo REPARAR: No se puede acceder a la carpeta compartida. Es posible que no tenga permiso para utilizar este recurso de red. El mango no es válido. </h2> <p> Normalmente, el problema de conexión para compartir archivos &quot;Es posible que no tenga permiso para usar este recurso de red&quot; aparece cuando un usuario intenta acceder a una carpeta compartida de red, sin tener los permisos necesarios. En este caso y para resolver el problema, debe asegurarse de que el usuario tenga los permisos de acceso adecuados en la carpeta compartida. </p> <p> Sin embargo, si sabe que los permisos del usuario en la carpeta compartida son correctos y el problema de conexión &quot;Es posible que no tenga permiso para usar este recurso de red&quot; apareció repentinamente y sin una razón obvia, entonces el problema probablemente se deba a la instalación de Windows Actualizar. En este caso, continúe leyendo a continuación para solucionar el problema. </p> <p> * Nota: si se enfrenta al error de compartir a mediados de enero de 2019, el culpable es la siguiente actualización de seguridad de Windows: <a href=\"https://support.microsoft.com/el-gr/help/4480970/windows-7-update-kb4480970\" target=\"_blank\" rel=\"nofollow noopener\"> 8 de enero de 2019: KB4480970 (paquete acumulativo mensual) </a> . </p> <h6> Método 1. Desinstale la última actualización de Windows. </h6> <p> En la máquina con la carpeta compartida: </p> <p> 1. Haga clic con el botón derecho en el icono &#39;Mi PC&#39; y seleccione <strong> Propiedades </strong> . <br> 2. Haga clic en <strong> actualizacion de Windows </strong> . </p> <p><img src=\"images/image_thumb-6-686.png\" alt=\"fix Network Shared Folder is Not Accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. Haga clic en <strong> Actualizaciones instaladas </strong> . </p> <p><img src=\"images/image_thumb-7-999.png\" alt=\"fix cannot access shared folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Ordene las actualizaciones por la fecha de instalación, haciendo clic en <strong> Instalado. </strong></p> <p><img src=\"images/image_thumb-8-158.png\" alt=\"uninstall windows update\" loading=\"lazy\"></p> <p> </p> <p> 5. Resalte la última actualización instalada para Windows y haga clic en <strong> Desinstalar </strong> * </p> <p> * p.ej. Si se enfrenta al error de compartir a mediados de enero de 2019, proceda y desinstale la &quot;Actualización de seguridad para Microsoft Windows KB4480970&quot;. </p> <p><img src=\"images/image_thumb-9-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Cuando se complete la instalación, <strong> Reanudar </strong> el ordenador. <br> 7. Después de reiniciar, intente nuevamente acceder a la carpeta compartida desde la máquina cliente. Luego aplique las acciones sugeridas según su caso: </p> <ul> <li><strong> Caso A: </strong> Si el problema persiste, proceda a desinstalar todas las últimas actualizaciones instaladas o continúe <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> método 2 </a> debajo. </li> <li><strong> Caso B: </strong> Si el problema se resuelve, evite que la actualización eliminada se instale en el futuro. Para hacer eso: </li> </ul> <blockquote><p> 1. Navegue a Windows Update y <strong> Buscar actualizaciones </strong> . <br> 2. Haga clic en <strong> Actualizaciones importantes </strong> . </p></blockquote> <p><img src=\"images/image_thumb-22-393.png\" alt=\"view important updates\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 3. Haga clic con el botón derecho en la actualización problemática y haga clic en <strong> Ocultar actualización </strong> . <br> 4. Finalmente haga clic en <strong> OK </strong> y luego cierre Windows Update. </p></blockquote> <p><img src=\"images/image_thumb-23-795.png\" alt=\"hide update windows 7\" loading=\"lazy\"></p> <h6> Método 2. Restaure su PC a un estado de trabajo anterior. </h6> <p> En la máquina con la carpeta compartida: </p> <p> 1. Presione Windows <img src=\"images/image_thumb8_thumb-632.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> rstrui </strong> &amp; haga clic <strong> OK </strong> para iniciar Restaurar sistema. </p> <p><img src=\"images/rstui-1-300x148-611.png\" alt=\"rstui\" loading=\"lazy\"></p> <p> </p> <p> 3. Haga clic en <strong> próximo </strong> en la primera pantalla. <br> 4. Elija un estado de trabajo anterior (fecha / hora) y haga clic en <strong> próximo </strong> para iniciar el proceso de restauración. </p> <p><img src=\"images/image_thumb-50-355.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Después de restaurar el sistema, intente nuevamente acceder a la carpeta compartida desde la máquina cliente. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este problema. </p>"}