{"title":"REVISIÓN: Thunderbird no responde o se congela. (Resuelto)","content":"<p> Si Thunderbird no responde, continúe a continuación para resolver el problema. Thunderbird es un popular cliente de correo electrónico de código abierto que está disponible para todas las plataformas. Pero a veces Thunderbird deja de responder en absoluto, o se congela durante 4-5 minutos antes de que se pueda volver a utilizar. </p> <p><img src=\"images/image_thumb-18-762.png\" alt=\"Thunderbird is not responding or freezing - fix\" loading=\"lazy\"></p> <p> Es posible que Thunderbird no funcione por las siguientes razones: </p> <ul> <li> El programa antivirus puede impedir que Thunderbird se conecte a Internet. </li> <li> La función de búsqueda de Windows en los mensajes de Thunderbird puede hacer que Thunderbird se congele. </li> <li> Una configuración o complemento problemático de Thunderbird. </li> <li> Los archivos de indexación de Thunderbird (archivos MSF) pueden estar dañados. </li> </ul> <p> Debido a que Thunderbird puede no responder por varias razones, en este tutorial le mostraremos todas las formas disponibles para resolver el problema. </p> <h2> Cómo CORREGIR: Thunderbird no responde o se congela en Windows 10. </h2> <h3> Método 1. Analice su computadora en busca de virus. </h3> <p><strong> Importante: </strong> Muchos virus o programas maliciosos pueden causar problemas con la actualización de Windows. Entonces, antes de continuar con los pasos de solución de problemas a continuación, use este <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Guía de eliminación y escaneo de malware </a> para verificar y eliminar virus y / y programas maliciosos que puedan estar ejecutándose en su computadora. </p> <h3></h3> <h3> Método 2. Desactive la búsqueda de Windows en los mensajes de Thunderbird. </h3> <p> 1. En el menú de Thunderbird, seleccione <strong> Herramientas </strong> &gt; <strong> Opciones </strong> . </p> <p> 2. En Configuración general, <strong> desmarcar </strong> la opción <strong> Permitir que Windows Search busque mensajes </strong> . </p> <p><img src=\"images/image_thumb-24-636.png\" alt=\"Disable Windows Search in Thunderbird Messages\" loading=\"lazy\"></p> <p> 3. <strong> Reanudar </strong> Thunderbird. </p> <p> </p> <h3> Método 3. Agregue Thunderbird a las excepciones de Antivirus. </h3> <p> Si está utilizando un antivirus de terceros en su máquina, continúe y agregue el programa ejecutable &quot;thunderbird.exe&quot; a las excepciones de su programa antivirus. </p> <p> Por ejemplo, si posee AVG Antivirus: </p> <p> 1. Ir a <strong> Menú </strong> &gt; <strong> Ajustes </strong> . <br> 2. En <strong> General </strong> pestaña, haga clic en <strong> Excepciones </strong> &gt; <strong> Añadir excepción </strong> . <br> 3. Haga clic en el <strong> Navegar </strong> y localice el <strong> thunderbird.exe </strong> archivo, (o <strong> Copiar </strong> Y <strong> pegue la línea de abajo) </strong> y luego haga clic en <strong> Añadir excepción. * </strong></p> <ul> <li> C: \\ Archivos de programa (x86) \\ Mozilla Thunderbird \\ thunderbird.exe </li> </ul> <p><strong> * Nota: </strong> Si después de agregar el archivo &quot;thunderbird.exe en sus excepciones AV el problema persiste, <strong> agregar </strong> además <strong> a las excepciones AV </strong> la <strong> carpeta donde se ha instalado Thunderbird </strong> y el <strong> Carpeta de perfil de Thunderbird </strong> . </p> <p><img src=\"images/image_thumb-19-734.png\" alt=\"add thunderbird to antivirus exceptions\" loading=\"lazy\"></p> <p> </p> <p> </p> <h3> Método 4. Desactivar: desinstale sus programas antivirus. </h3> <p> Dado que el problema de &quot;no responde&quot; en el programa Thunderbird, generalmente se debe al programa Antivirus, sugiero que <strong> desactivar </strong> o para <strong> desinstalar completamente </strong> su programa antivirus y para ver si el problema persiste. </p> <h3></h3> <p> </p> <h3> Método 5. Inicie Thunderbird en modo seguro. </h3> <p> Thunderbird puede congelarse y no responder si una extensión instalada causa problemas o está dañada. Para solucionar problemas con los complementos de Thunderbird, proceda de la siguiente manera. </p> <p> 1. Presione y <strong> sujetar </strong> la <strong> CAMBIAR </strong> tecla en su teclado y abra <strong> Thunderbird. </strong></p> <p> 2. En la siguiente ventana, haga clic en <strong> Continuar en modo seguro. </strong></p> <p><img src=\"images/image_thumb-21-196.png\" alt=\"Strat Thunderbird in Safe Mode\" loading=\"lazy\"></p> <p> </p> <p> 3. Si Thunderbird no se congela en Modo seguro, entonces un complemento instalado puede causar el problema. En este caso: </p> <ol> <li> Cierre Thunderbird. </li> <li> Presione la tecla MAYÚS e inicie Thunderbird nuevamente. </li> <li> En la siguiente ventana <strong> cheque </strong> <strong> Deshabilitar todos los complementos </strong> y haga clic en <strong> Realizar cambios y reiniciar </strong> . </li> </ol> <p><img src=\"images/image_thumb-22-149.png\" alt=\"Disable Thunderbird add-ons\" loading=\"lazy\"></p> <p> 4. Si Thunderbird no responde de nuevo, continúe con el siguiente método. </p> <h3> Método 5. Restablezca las barras de herramientas y los controles de Thunderbird. </h3> <p> 1. Presione y <strong> sujetar </strong> la <strong> CAMBIAR </strong> tecla en su teclado y abra <strong> Thunderbird. </strong></p> <p> 2. En la siguiente ventana, elija <strong> Restablecer barras de herramientas y controles </strong> y haga clic en <strong> Realice cambios y reinicie. </strong></p> <p><img src=\"images/image_thumb-23-344.png\" alt=\"Reset Thunderbird Toolbars\" loading=\"lazy\"></p> <p> </p> <h3> Método 6. Elimine los archivos de índice de Thunderbird (.msf). </h3> <p> En algunos casos, Thunderbird se congela porque los archivos de indexación (también conocidos como archivos MSF) se corrompen. Por lo tanto, el método final para resolver el problema &quot;Thunderbird no responde&quot; es eliminar los archivos .MSF. * </p> <p><strong> * IMPORTANTE: </strong> Aunque los archivos MSF (Archivos de resumen de correo) se pueden eliminar de forma segura porque solo contienen los encabezados y el estado del correo electrónico (leído, no leído, etc.), y no el correo electrónico real, se recomienda <a href=\"https://www.repairwin.com/how-to-transfer-thunderbird-email-and-settings-to-a-new-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> copia de seguridad de la carpeta de perfil de Thunderbird </a> antes de eliminar archivos MSF. </p> <p><strong> Paso 1. Cierre Thunderbird. </strong></p> <p><strong> Paso 2. Habilite la vista de archivos ocultos. </strong></p> <p> 1. Navega a Windows <strong> Panel de control </strong> y abre el <strong> Opciones de carpeta </strong> . (o el <strong> Opciones del Explorador de archivos </strong> en Windows 10). </p> <p> 2. Seleccione el <strong> Vista </strong> pestaña, y debajo de la <strong> &#39;Archivos y carpetas ocultos&#39; </strong> sección, <strong> cheque </strong> la <strong> Mostrar archivos, carpetas y unidades ocultos </strong> opción y haga clic en <strong> está bien. </strong></p> <p><img src=\"images/image_thumb-34-553.png\" alt=\"Show Hidden files\" loading=\"lazy\"></p> <p> </p> <p><strong> Paso 3. Elimina los archivos .MSF </strong></p> <p> 1. Navegue a la carpeta de perfil de Thunderbird en su disco y abra el <strong> Correo </strong> carpeta: * </p> <ul> <li> C: \\ Users \\ username \\ AppData \\ Roaming \\ Thunderbird \\ Profiles \\ ProfileName <strong> .predeterminado \\ Correo </strong></li> </ul> <p> * Donde nombre de usuario es su nombre de usuario de Windows y ProfileName es el nombre de perfil de Mozilla en el que se almacenan los correos electrónicos. </p> <p> 2. Ahora explore todas las carpetas contenidas dentro del <strong> Correo </strong> carpeta, para ver cuál contiene los archivos .msf. (en instalaciones predeterminadas, con una sola cuenta de correo electrónico, los archivos MSF se encuentran en la carpeta &quot;Carpetas locales&quot;. </p> <p> 3. <strong> Borrar </strong> todas <strong> .msf </strong> archivos, o -mejor- <strong> moverse </strong> a una carpeta (nueva) en su escritorio. </p> <p><img src=\"images/image_thumb-25-355.png\" alt=\"Delete Thunderbird MSF files\" loading=\"lazy\"></p> <p> 4. Cuando termine, abra Thunderbird y espere a que Thunderbird vuelva a crear los archivos de indexación (archivos MSF). </p> <p> ¡Eso es todo amigos! Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}