{"title":"REVISIÓN: Parece que inició una actualización y arrancó desde el medio de instalación (resuelto)","content":"<p> El siguiente problema puede aparecer si intenta realizar una instalación limpia o una actualización de reparación de Windows 10 desde un medio de instalación: &quot;Parece que inició una actualización y arrancó desde el medio de instalación. Si desea continuar con la actualización, elimine el media desde su PC y haga clic en Sí. Si desea realizar una instalación limpia en su lugar, haga clic en No &quot;. </p> <p><img src=\"images/image_thumb-36-818.png\" alt=\"FIX: It looks like you started an upgrade and booted from installation media \" loading=\"lazy\"></p> <p> </p> <p> El mensaje de error anterior significa que ha interrumpido la actualización de Windows 10 una vez que se inició. Como indica el mensaje, si desea realizar una instalación limpia de Windows 10, debe seleccionar &quot;No&quot; para continuar, de lo contrario, quite el medio de instalación y haga clic en &quot;Sí&quot; para continuar con la actualización de Windows 10. </p> <p> En general, el mensaje anterior no es un problema, pero se convierte en un gran problema si la actualización de Windows no se instala o si Windows 10 se atasca después de intentar instalar actualizaciones, y desea reparar Windows 10 arrancando desde una instalación. medios de comunicación. </p> <p> En este tutorial encontrará instrucciones detalladas sobre cómo omitir el mensaje &quot;Parece que inició una actualización y arrancó desde el medio de instalación&quot;, cancelando el proceso de actualización de Windows 10 que se está ejecutando actualmente, para realizar una reparación de Windows 10. actualizar desde el medio de instalación. </p> <h4> Cómo cancelar la actualización de Windows 10 en curso si Windows no puede arrancar * </h4> <p><strong> * Importante: </strong> Si puede iniciar Windows 10, pero no puede instalar la actualización desde el entorno de Windows, primero aplique las siguientes acciones: </p> <blockquote><p> 1. Navega a <strong> Comienzo </strong> &gt; <strong> Ajustes </strong> &gt; <strong> Actualización y seguridad </strong> y haga clic en &quot;Reiniciar ahora&quot; para iniciar el proceso de actualización. <br> 2. Después del primer reinicio, deje el progreso &quot;Trabajando en actualizaciones&quot; para ir al 1-2%. <br> 3. Una vez hecho esto, presione el <strong> Energía </strong> durante 10-15 segundos, para apagar completamente su PC. <br> 4. Conecte el medio de instalación de Windows y encienda su PC. <br> 5. Siga los pasos restantes a continuación para cancelar la actualización en curso. </p></blockquote> <p> </p> <h6> Paso 1. Cancele las acciones pendientes de Windows Update. </h6> <p> 1. Inicie su sistema desde un medio de instalación de Windows. <br> 2. Cuando aparezca el mensaje &quot;Parece que inició una actualización y arrancó desde el medio de instalación ...&quot;, presione el botón <strong> CAMBIAR </strong> + <strong> F10 </strong> teclas para iniciar el símbolo del sistema. </p> <p><img src=\"images/image_thumb-37-729.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. En el símbolo del sistema, obtenga una lista de todas las unidades en su sistema con este comando: </p> <ul> <li><strong> wmic logicaldisk obtener nombre </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-991.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> </p> <p> 4. A continuación, averigüe qué unidad contiene la carpeta &quot;Windows&quot; escribiendo este comando: * </p> <p> </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * p.ej. Para ver el contenido de la unidad C :, escriba: &quot; <strong> dir C: </strong> &quot;(sin comillas). Si no puede ver la carpeta&quot; Windows &quot;en la unidad C:, continúe con la siguiente letra de unidad (por ejemplo,&quot; dir D: &quot;,&quot; dir E: &quot;, etc.), hasta que vea la Carpeta &quot;Windows&quot; en una de las unidades enumeradas (del comando anterior). </p> <p> ej .: Como puede ver en la captura de pantalla a continuación, la carpeta de Windows (en este ejemplo) se encuentra en el <strong> D </strong> : manejar.] </p> <p><img src=\"images/image_thumb-69-578.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Una vez que encuentre en qué unidad se encuentra la unidad &quot;Windows&quot; (por ejemplo, en la unidad &quot;D:&quot; en este ejemplo), navegue hasta esa unidad escribiendo DriveLetter <strong> : </strong> + <strong> Ingresar </strong> . </p> <p> 6. Luego, cree una carpeta temporal en la unidad de Windows escribiendo este comando: </p> <p> </p> <ul> <li><strong> mkdir D: \\ Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-229.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Luego, ejecute el siguiente comando para revertir las acciones pendientes de la actualización en curso: </p> <ul> <li><strong> DISM / Imagen: D: \\ / ScratchDir: D: \\ Scratch / Cleanup-Image / RevertPendingActions </strong></li> </ul> <p> * Nota: cambie la letra de la unidad <strong> D </strong> según tu caso. </p> <p> 8. Una vez que se ejecuta el comando DISM anterior, debería recibir el siguiente mensaje en la pantalla: </p> <p> &quot; <em> Revirtiendo acciones pendientes de la imagen…. <br> La operación se completó. Se intentará revertir las acciones pendientes después del reinicio. <br> La operación se completó con éxito &quot;. </em></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"DISM - RevertPendingActions\" loading=\"lazy\"></p> <p> </p> <p> 9. Cierre la ventana del símbolo del sistema, elimine el medio de instalación y deje que Windows se inicie normalmente. </p> <p> 10. Después de reiniciar, debería ver el siguiente mensaje en su pantalla: &quot;Deshaciendo los cambios realizados en su computadora&quot;. Cuando finalice este proceso, Windows debería iniciarse normalmente. </p> <p><img src=\"images/image_thumb-39-836.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Paso 2. Elimine los archivos de actualización con el Liberador de espacio en disco. </h6> <p> Después de arrancar en Windows 10, debe preparar Windows 10 para la reparación / actualización de USB, eliminando las actualizaciones ya descargadas con la herramienta Liberador de espacio en disco. Para hacer eso: </p> <p> 1. Abra el Explorador de archivos, haga clic con el botón derecho en la unidad C: y seleccione <strong> Propiedades </strong> . <br> 2. Haga clic en el <strong> Limpieza de disco </strong> botón. </p> <p><img src=\"images/image_thumb_thumb-190.png\" alt=\"Disk cleanup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Luego haga clic en <strong> Limpiar archivos del sistema </strong> . </p> <p><img src=\"images/image_thumb-40-950.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Ahora verifique para eliminar los siguientes archivos y haga clic en <strong> OK </strong> : </p> <ul> <li> <ul> <li> <ul> <li> Limpieza de Windows Update. </li> <li> Antivirus de Windows Defender. </li> <li> Archivos de programa descargados. </li> <li> Archivos temporales de Internet. </li> <li> Instalaciones anteriores de Windows. </li> <li> Papelera de reciclaje. </li> <li> Archivos temporales. </li> <li> Archivos temporales de instalación de Windows </li> </ul> </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-41-458.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Cuando se le preguntó, <strong> Borrar archivos </strong> . </p> <p><img src=\"images/image_thumb-42-931.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Cuando se complete la limpieza, cierre las propiedades del disco y continúe con el siguiente paso. </p> <p> </p> <h6> Paso 3. Elimine la carpeta &#39;SoftwareDistribution&#39;. </h6> <p> El &quot;C: \\ Windows \\ <strong> Distribución de software </strong> &quot;, es la ubicación donde Windows almacena las actualizaciones de Windows. Muchas veces, esta carpeta se daña y debe volver a crearla para volver a descargar las actualizaciones desde cero. Por lo tanto, proceda de la siguiente manera: </p> <p><strong> 1. Detenga el servicio de actualización de Windows: </strong> Para hacer eso: </p> <blockquote><p> una. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> B. En el cuadro de búsqueda, escriba: <strong><em> services.msc </em></strong> &amp; haga clic <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-12-264.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> C. En el panel de control de Servicios, busque el &quot; <strong> Actualizacion de Windows&quot; </strong> Servicio. <br> D. Haga clic derecho en <strong> actualizacion de Windows </strong> servicio y seleccione &quot; <strong> Detener </strong> &quot;. </p></blockquote> <p><img src=\"images/image_thumb-9-434.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. Elimine la carpeta SoftwareDistribution. </strong></p> <blockquote><p> una. Abra el Explorador de Windows y navegue hasta: <strong> C: \\ Windows </strong> carpeta. <br> B. Encontrar y <strong> Borrar </strong> la &quot; <strong><em> Distribución de software </em></strong> &quot;(o cámbiele el nombre, por ejemplo, a&quot; SoftwareDistributionOLD &quot;). </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-10-140.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Reinicia tu computadora </strong> para aplicar cambios. </p> <p> </p> <h6> Paso 4. Actualice Windows 10 desde el medio de instalación. </h6> <p> Ahora, está listo para reparar y actualizar Windows 10 desde un medio de instalación. Para hacer eso: </p> <p> 1. <strong> Reiniciar </strong> tu computadora y <strong> bota </strong> desde el USB (o DVD) de Windows <strong> medios de instalación </strong> . <br> 2. En el asistente de configuración de Windows, presione <strong> próximo </strong> y luego haga clic en <strong> Instalar ahora </strong> . <br> 3. <strong> Aceptar </strong> el &#39;Acuerdo de licencia&#39;. <br> 4. Cuando se le solicite, seleccione Actualizar <strong> : Instale Windows y conserve archivos, configuraciones y aplicaciones </strong> . </p> <blockquote><p><img src=\"images/image_thumb8_thumb-241.png\" alt=\"image_thumb8\" loading=\"lazy\"></p></blockquote> <p> 5. Luego, siga las instrucciones en pantalla para actualizar Windows 10. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}