{"title":"REVISIÓN: Error de recepción de Outlook 0x80004005 - La operación falló (resuelto)","content":"<p> Si se enfrenta al error de recepción de Outlook 0x80004005, continúe leyendo a continuación para aprender cómo solucionar el problema. Este tutorial contiene instrucciones para corregir el &quot;Error al recibir el informe (0x80004005): la operación falló&quot;, en el Progreso de envío y recepción de Outlook (Outlook 2007, Outlook 2010, Outlook 2013 u Outlook 2016). </p> <p><img src=\"images/image_thumb-15-598.png\" alt=\"FIX: Outlook Receiving error 0x80004005 - The Operation failed\" loading=\"lazy\"></p> <p> </p> <p> El error &quot;0x80004005&quot; de Outlook puede ocurrir en cualquier versión de Outlook (2003, 2007, 2010 o 2013) y generalmente significa que el archivo de datos PST de Outlook o el perfil de Outlook se han corrompido o dañado debido a una corrupción de energía, daño del disco otras razones desconocidas. </p> <h4> Cómo resolver el error de recepción 0x80004005 en Outlook 2003, 2007, 2010 o 2013. </h4> <h6> Método 1. Desactive temporalmente la protección antivirus. </h6> <p> Si está utilizando un programa antivirus con funciones de análisis de correo electrónico, intente desactivarlo temporalmente y vuelva a comprobar Outlook. </p> <p> </p> <h6> Método 2. Desactive la notificación de correo nuevo en Outlook. </h6> <p> En algunos casos, puede experimentar el error 0x80004005 en el proceso de recepción de Outlook, si las notificaciones de correo nuevo están habilitadas. Para deshabilitar las alertas de correo nuevo en Outlook 2010, 2013 o 2016: * </p> <p> 1. Desde el <strong> Archivo </strong> menú, haga clic en <strong> Opciones </strong> . <br> 2. Seleccione <strong> Correo </strong> en el panel izquierdo, y luego <strong> deseleccionar </strong> todas las casillas de verificación en la sección &#39;Recepción de mensajes&#39; (en el panel derecho). <br> 3. Haga clic en <strong> OK </strong> y <strong> Reanudar </strong> Panorama. * </p> <p> * Nota: Para desactivar la nueva alerta de notificación por correo electrónico en Outlook 2007: </p> <blockquote><p> 1.Haga clic en <strong> Herramientas </strong> -&gt; <strong> Opciones </strong> . <br> 2. Haga clic en <strong> Configuración de correo electrónico </strong> y luego haga clic en <strong> Opciones de correo electrónico avanzadas </strong> . <br> 3. <strong> Claro </strong> todas las casillas de verificación en las opciones &quot;Cuando lleguen nuevos elementos a mi bandeja de entrada&quot;. <br> 4. Cuando termine, haga clic en <strong> OK </strong> dos veces para cerrar las opciones de correo electrónico. <br> 5. Cierre y reinicie Outlook. </p></blockquote> <p><img src=\"images/image_thumb-16-303.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Si Outlook aún muestra el error 0x80004005 durante el envío y recepción, deshaga los cambios que realizó y continúe con el método siguiente. </p> <p> </p> <h6> Método 3. Repare el archivo de datos .PST de Outlook. </h6> <h5> Paso 1. Localice el archivo OUTLOOK PST DATA en el disco. </h5> <p> 1. <strong> Cerca </strong> Panorama. <br> 2. Navega a <strong> Panel de control </strong> y abrir <strong> Correo </strong> . (Si no ve el elemento Correo, cambie el <strong> Vista por </strong> : a <strong> Iconos pequeños </strong> ) </p> <p> </p> <p><img src=\"images/image_thumb-40-648.png\" alt=\"control panel all items\" loading=\"lazy\"></p> <p> </p> <p> 3. Haga clic en <strong> Archivos de información </strong> botón. </p> <p><img src=\"images/image_thumb-35-600.png\" alt=\"How to find Outlook data files location.\" loading=\"lazy\"></p> <p> </p> <p> 4. Anote la ubicación (ruta) donde se almacena el archivo de datos de Outlook (por ejemplo, Outlook.pst) en su computadora y luego cierre Opciones de correo. </p> <p><img src=\"images/image_thumb-36-798.png\" alt=\"outlook data file location\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h5> Paso 2. Repare el archivo de datos PST de Outlook con SCANPST </h5> <p> 1. Para reparar los archivos de datos PST de Outlook, haga doble clic en &quot; <strong> SCANPST.EXE </strong> &quot;, desde la siguiente ubicación en su disco: * </p> <ul> <li><strong> C: \\ Archivos de programa \\ Microsoft Office \\% OfficeVersion% \\ SCANPST.EXE </strong></li> </ul> <p> * Nota: La ubicación de &quot;scanpst.exe&quot; es diferente para cada versión de Outlook y Windows que haya instalado. A continuación se mencionan las ubicaciones del archivo &quot;SCANPST.EXE&quot;, según la versión de Windows y Office instalada. </p> <blockquote><p><strong> Outlook 2013 y 2016 </strong><br> Windows de 32 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office15 <br> Windows de 64 bits&gt; C: \\ Archivos de programa (x86) \\ Microsoft Office \\ Office15 <br> Outlook de 64 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office15 <br> Hacer clic y ejecutar&gt; C: \\ Archivos de programa \\ Microsoft Office 15 \\ root \\ office15 <br> <strong> Outlook 2010 </strong><br> Windows de 32 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office14 <br> Windows de 64 bits&gt; C: \\ Archivos de programa (x86) \\ Microsoft Office \\ Office14 <br> Outlook de 64 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office14 <br> <strong> Outlook 2007 </strong><br> Windows de 32 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office12 <br> Windows de 64 bits&gt; C: \\ Archivos de programa (x86) \\ Microsoft Office \\ Office12 <br> <strong> Outlook 2003 </strong><br> Windows de 32 bits&gt; C: \\ Archivos de programa \\ Archivos comunes \\ Sistema \\ MSMAPI \\ <br> Windows de 64 bits&gt; C: \\ Archivos de programa (x86) \\ Archivos comunes \\ Sistema \\ MSMAPI \\ </p> <p><img src=\"images/image_thumb-37-648.png\" alt=\"Repair Outlook PST Inbox Repair Tool\" loading=\"lazy\"></p></blockquote> <p> </p> <p> 2. Haga clic en <strong> Navegar </strong> y navegue hasta la ubicación donde se almacena el archivo de datos de Outlook. </p> <p><img src=\"images/image_thumb-42-299.png\" alt=\"How to Repair Outlook PST Data File(s) with Inbox Repair Tool (SCANPST).\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Seleccione el archivo de datos de Outlook que desea reparar. (por ejemplo, Outlook.pst) y haga clic en <strong> OK </strong> . <br> 4. Finalmente presione <strong> Comienzo </strong> para iniciar la reparación. </p> <p><img src=\"images/image_thumb-39-524.png\" alt=\"How to Repair Outlook PST Data Files\" loading=\"lazy\"></p> <p> 5. Espere hasta que se complete la reparación de Outlook PST y luego cierre la utilidad Herramienta de reparación de la bandeja de entrada. <br> 6. Abra Outlook, haga clic en el botón &quot;Enviar y recibir&quot; para comprobar si se ha resuelto el error 0x80004005. Si el problema persiste, continúe con el siguiente método. </p> <p> </p> <h6> Método 4. Elimine y vuelva a crear el perfil de Outlook. </h6> <p> 1. <strong> Cerca </strong> Panorama. <br> 2. Navega a <strong> Panel de control </strong> y abrir <strong> Correo </strong> . (Si no ve el elemento Correo, cambie el <strong> Vista por </strong> : a <strong> Iconos pequeños </strong> ) </p> <p> 3. Haga clic en <strong> Mostrar perfiles. * </strong></p> <p><strong> * Nota IMPORTANTE: </strong> Si usa más de una cuenta de correo electrónico, verifique si el error aparece en todas las cuentas de correo electrónico. Si el error aparece solo en una cuenta, intente eliminar y volver a agregar solo la cuenta con el problema mediante el siguiente procedimiento: </p> <blockquote><p> una. Haga clic en el <strong> Cuentas de correo electrónico </strong> y elimine la cuenta de correo electrónico con el problema. <br> B. Luego haga clic en <strong> Archivos de información </strong> y elimine el archivo de datos de Outlook asociado a la cuenta eliminada. <br> C. Finalmente haga clic en <strong> Cuentas de correo electrónico </strong> nuevamente y vuelva a agregar la cuenta de correo electrónico eliminada. </p></blockquote> <p><img src=\"images/image_thumb-2-659.png\" alt=\"Create Secondary Outlook Profile\" loading=\"lazy\"></p> <p> </p> <p> 4. Seleccione el perfil actual y haga clic en <strong> Eliminar </strong> . Luego haga clic en <strong> sí </strong> para confirmar su decisión. </p> <p><img src=\"images/image_thumb-53-516.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Luego haga clic en el <strong> Agregar </strong> y proporcione un nombre para el perfil: (por ejemplo, &quot;Outlook&quot;). </p> <p><img src=\"images/image_thumb-54-154.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Siga los pasos del asistente &quot;Agregar cuenta&quot; y vuelva a configurar su cuenta de correo. </p> <p> </p> <p><img src=\"images/image_thumb-9-723.png\" alt=\"outlook account setup\" loading=\"lazy\"></p> <p> </p> <p> 7. Después de agregar su cuenta, abra Outlook y verifique si se ha resuelto el &quot;Error al recibir el informe (0x80004005): la operación falló&quot;. * </p> <p> * Nota: Si Outlook funciona bien y recibe correos electrónicos sin problemas, proceda y restaure sus correos electrónicos desde el antiguo archivo de datos .PST de Outlook, siguiendo las instrucciones a continuación: </p> <ol> <li> <ol> <li> De <strong> panorama </strong> &#39;s <strong> Archivo </strong> menú, seleccione <strong> Abrir y exportar </strong> &gt; <strong> Importación y exportación </strong> . </li> <li> En las opciones &#39;Elija una acción para realizar&#39;, seleccione <strong> Importar desde otro programa o archivo </strong> &amp; haga clic <strong> Próximo. </strong></li> <li> En las opciones &quot;Seleccionar tipo de archivo para importar&quot;, seleccione <strong> Archivo de datos de Outlook (.pst) </strong> &amp; haga clic <strong> próximo </strong> . </li> <li> En &#39;Archivo para importar la pantalla&#39;, haga clic en <strong> Navegar. </strong></li> <li> Seleccione el antiguo archivo PST de Outlook desde el que desea importar sus correos electrónicos y haga clic en <strong> Abierto. </strong></li> <li> Hacer clic <strong> próximo </strong> Y <strong> Terminar. </strong></li> </ol> </li> </ol> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}