{"title":"REVISIÓN: ERROR BSOD DE VIOLACIÓN DE DPC WATCHDOG. (Resuelto)","content":"<p> En una computadora con Windows 10, 8 o 7, puede aparecer el siguiente error BSOD: &quot;DPC_WATCHDOG_VIOLATION&quot;. El problema de la pantalla azul &quot;DPC WATCHDOG VIOLATION&quot; comúnmente ocurre ocasionalmente, incluso si el sistema está inactivo y comúnmente es causado por un controlador de dispositivo no válido o dañado y en algunos otros casos está relacionado con problemas de hardware especialmente con la tarjeta gráfica. </p> <p><img src=\"images/image_thumb-2-618.png\" alt=\"FIX DPC WATCHDOG VIOLATION BLUE SCREEN ERROR\" loading=\"lazy\"></p> <p> </p> <p> Esta guía de resolución de problemas contiene varios métodos para resolver el <strong> VIOLACIÓN DE DPC WATCHDOG </strong> Problema de BSOD en el sistema operativo Windows 10, 8 / 8.1 o 7. </p> <p> </p> <h2> Cómo SOLUCIONAR el problema BoSD de VIOLACIÓN DE DPC WATCHDOG en Windows 10/8/7. </h2> <p> El problema de la pantalla azul DPC WATCHDOG VIOLATION puede deberse a varias razones, p. Ej. dispositivos o controladores de software defectuosos, RAM o unidad de disco dañadas, etc. Por lo tanto, para resolver el problema BSOD &quot;DPC WATCHDOG VIOLATION&quot;, siga los pasos a continuación: </p> <h6> Método 1. Analice su sistema en busca de virus y malware. </h6> <p> El primer paso para resolver el problema de la pantalla azul &quot;DPC WATCHDOG VIOLATION&quot; es asegurarse de que su sistema esté libre de virus / malware. Para esa tarea, siga las instrucciones de esta guía: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo escanear su computadora en busca de virus y otros programas maliciosos. </a></p> <p> </p> <h6> Método 2. Desinstale su software antivirus / de seguridad. </h6> <p> El problema de la pantalla azul &quot;DPC WATCHDOG VIOLATION&quot; puede deberse a la actualización automática de su programa Antivirus / Seguridad (especialmente si está utilizando AVAST o AVG). Entonces, proceda y desinstale completamente su programa antivirus de su sistema y reinicie su computadora. <br> - Si el problema de BSOD no ocurre después de la eliminación del antivirus, proceda a descargar y reinstalar la última versión de su software de seguridad en su sistema. </p> <p> </p> <h6> Método 3. Inicie Windows en estado de inicio limpio. </h6> <p> El siguiente método, para resolver el problema BSOD &quot;DPC WATCHDOG VIOLATION&quot;, es iniciar Windows en un <a href=\"https://www.repairwin.com/how-to-start-windows-in-clean-boot-state/\" target=\"_blank\" rel=\"nofollow noopener\"> &quot;bota limpia </a> &quot;, para identificar qué programa hace que su sistema se bloquee. </p> <p> Para iniciar Windows en estado de arranque limpio: </p> <p> 1. Presione las ventanas <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> msconfig </strong> y presione <strong> Ingresar </strong> . </p> <p><img src=\"images/image_thumb-47-307.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. En la pestaña Servicios, <strong> Esconder todos los servicios de Microsoft </strong> casilla de verificación y luego presione el <strong> Desactivar todo </strong> , para evitar que todos los servicios que no sean de Microsoft se inicien al iniciar Windows. </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-257.png\" alt=\"clean boot state\" loading=\"lazy\"></p> <p> 4. Luego seleccione el <strong> Puesta en marcha </strong> pestaña y <strong> Desactivar </strong> todos los demás programas que se inician durante el inicio de Windows y se ejecutan en segundo plano. * </p> <p> * Nota: Activado <strong> Windows 10 </strong> o <strong> 8 </strong> , Seleccione <strong> Abrir el Administrador de tareas </strong> para deshabilitar los programas de inicio. </p> <p><img src=\"images/image_thumb-29-129.png\" alt=\"Windows clean boot\" loading=\"lazy\"></p> <p> </p> <p> 5. Cuando termine, haga clic en <strong> OK </strong> y <strong> Reanudar </strong> tu computadora. <br> 6. Si después de reiniciar, su computadora está funcionando bien y sin problemas de BSOD, inicie nuevamente la utilidad Configuración del sistema y habilite uno por uno todos los elementos deshabilitados y reinicie su sistema, hasta que descubra cuál causa el problema de BSoD. * </p> <p> * Nota a <strong> Salida </strong> de <strong> Arranque limpio </strong> estado, inicie la utilidad de configuración del sistema y en el <strong> General </strong> Tab elegir <strong> Inicio normal. </strong></p> <p> </p> <h6> Método 4. Compruebe la memoria (RAM) y el disco duro (HDD) en busca de problemas. </h6> <p> Problemas de pantalla azul, pueden deberse a un módulo RAM dañado o un disco duro defectuoso. Para probar y diagnosticar problemas en los componentes de RAM y HDD, siga las instrucciones de estas guías: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo diagnosticar problemas de memoria de la computadora con Memtest86 + </a></li> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Las mejores herramientas de prueba y diagnóstico de disco duro para comprobar el estado del disco duro </a></li> </ul> <p> </p> <p> </p> <h6> Método 5. Actualice los controladores de red y pantalla. </h6> <p> En algunos casos, el problema BSOD &quot;DPC WATCHDOG VIOLATION&quot;, se produce debido a un controlador de dispositivo no válido o dañado. Entonces, proceda y actualice los controladores de los siguientes dispositivos en su computadora: * </p> <p> 1. Adaptador de gráficos (VGA). <br> 2. Adaptador Ethernet y adaptador Wi-Fi (si existe). </p> <p> * Notas: <br> 1. Si el problema de BSOD persiste, después de actualizar los controladores anteriores, proceda y actualice todos los demás controladores de su sistema (chipset, controladores de audio, etc.). <br> 2. En algunos casos, puede ocurrir el error &quot;DPC_WATCHDOG_VIOLATION&quot; si tiene una unidad de estado sólido (SSD). Entonces, si posee una unidad SSD, proceda y actualice el firmware en la unidad. Para obtener instrucciones sobre cómo actualizar el firmware SSD, consulte el sitio web del fabricante de su SSD. </p> <p> </p> <h6> Método 6. Actualice el controlador iaStor.sys. </h6> <p> 1. Navegue al Administrador de dispositivos. <br> 2. Expanda Controladores IDE ATA / ATAPI. <br> 3. Haga doble clic en <strong> Controlador SATA / AHCI </strong> . </p> <p><img src=\"images/image_thumb-3-252.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Seleccione el <strong> Conductor </strong> pestaña y haga clic en <strong> Detalles del conductor </strong> . </p> <p><img src=\"images/image_thumb-4-105.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Si está utilizando el <strong> controlador iaStor.sys </strong> , luego haga clic en <strong> OK </strong> y proceda a cambiar el controlador como se menciona a continuación; de lo contrario, omita los pasos restantes. </p> <p><img src=\"images/image_thumb-5-421.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Haga clic en <strong> Actualizar controlador </strong> . </p> <p><img src=\"images/image_thumb-6-840.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Seleccione <strong> Buscar en mi computadora el software del controlador </strong> . </p> <p><img src=\"images/image_thumb-7-251.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Haga clic en <strong> Permítame elegir de una lista de controladores de dispositivo en mi computadora </strong> . </p> <p><img src=\"images/image_thumb-8-330.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Resalte el <strong> Controlador SATA AHCI estándar </strong> y haga clic en <strong> próximo </strong> . <br> 10. Cuando se complete la instalación del controlador, <strong> cerca </strong> todas las ventanas abiertas y <strong> Reanudar </strong> tu computadora. </p> <p> </p> <h6> Método 7. <strong> Analizar Minidump. </strong></h6> <p> Cuando Windows se bloquea con una pantalla azul, almacena los detalles de la pantalla BSoD en archivos pequeños, que se denominan &quot; <strong> MiniDump </strong> &quot;. El análisis de la <strong> Minidump </strong> Los archivos pueden ayudarlo a solucionar problemas y resolver el problema de la pantalla azul. Para realizar esta tarea, siga las instrucciones de este artículo: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo analizar archivos MiniDump con BlueScreenView </a> . </p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}