{"title":"REVISIÓN: Error de Outlook Express 0x800c0133 debido al límite de tamaño de 2 GB en el archivo DBX (resuelto)","content":"<p> Este tutorial contiene instrucciones para corregir el error 0x800c0133 de Outlook Express debido al límite de tamaño de 2 GB. El error 0x800c0133 en OE, se produce porque una de las carpetas de Outlook supera el límite de 2 GB de tamaño. </p> <p> Descripción del problema de límite de tamaño de .DBX 2GB en Outlook Express. <br> Cuando una de las carpetas principales de Outlook Express (por ejemplo, la &quot;Bandeja de entrada&quot; o &quot;Enviados&quot;) excede el tamaño de 2 GB, OE devuelve el error 0x800c0133 durante la operación de envío / recepción y, a veces, la carpeta OE correspondiente se vacía (dañada). * Por ejemplo, si la carpeta &quot;Bandeja de entrada&quot; (Inbox.dbx) supera los 2 GB de tamaño, entonces OE no puede recibir los nuevos correos electrónicos y muestra el error 0x800c0133. </p> <p> * Nota: Si una de las carpetas de OE está vacía, el archivo DBX asociado está dañado. En ese caso, intente recuperar sus correos electrónicos de la carpeta OE dañada siguiendo las instrucciones de este artículo: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo recuperar archivos DBX de Outlook Express GRATIS </a> . </p> <h4> Cómo solucionar el problema de límite de 2GB de Outlook Express (Error de envío / recepción 0x800c0133). </h4> <h6> Paso 1. Habilite la vista de archivos ocultos. </h6> <p> 1. Abra el Explorador de Windows. <br> 2. Desde el <strong> Herramientas </strong> menú elegir <strong> Opciones de carpeta </strong> . <br> 3. En la pestaña Ver, haga clic en <strong> Mostrar archivos y carpetas ocultas </strong> y haga clic en <strong> está bien. </strong></p> <p><img src=\"images/image_thumb1_thumb-210.png\" alt=\"image_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Paso 2. Localice el archivo DBX de Outlook Express 2GB en su disco. </h6> <p> 1. Abra la carpeta de la tienda de Outlook Express. Por lo general, esta carpeta se encuentra en la siguiente ruta de su disco: </p> <ul> <li> C: \\ Documents and Settings \\\\ Configuración local \\ Datos de aplicación \\ Identidades \\ {} \\ Microsoft \\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> p.ej. “C: \\ Documents and Settings \\ Admin \\ Local Settings \\ Application Data \\ Identities \\ {D8F3C56D-965E-41AE-8A23-A58460ABAE00} \\ Microsoft \\ <strong> Outlook Express </strong> &quot; </p></blockquote> <p> 3. De Explorer&#39;s <strong> Vista </strong> menú elegir <strong> Detalles </strong> . <br> 4. Busque qué archivo DBX supera el límite de almacenamiento de 2 GB. * </p> <p> * En este ejemplo, el archivo &quot;Inbox.dbx&quot; supera los 2 GB de tamaño. </p> <p><img src=\"images/image_thumb2_thumb-339.png\" alt=\"FIX Outlook Express Error 0x800c0133\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Paso 3. Mueva los correos electrónicos de la carpeta de correo de gran tamaño a una carpeta de correo nuevo. </h6> <p> 1. Abra Outlook Express. <br> 2. Seleccione la carpeta de correo de gran tamaño (con un tamaño superior a 2 GB, por ejemplo, la carpeta &quot;Bandeja de entrada&quot; en este ejemplo). <br> 3. Si puede ver sus correos electrónicos en esa carpeta (la carpeta no está vacía), proceda de la siguiente manera: * </p> <p> * Aviso: si la carpeta parece vacía (no ve ningún correo electrónico en ella), entonces la carpeta OE (y el archivo DBX asociado) está dañado. En ese caso, debe recuperar sus correos electrónicos de la carpeta DBX dañada siguiendo las instrucciones de este artículo. </p> <p> 4. En el panel izquierdo, del programa OE, haga clic con el botón derecho en la carpeta de gran tamaño y elija <strong> Nueva carpeta </strong> (para crear una nueva carpeta de correo) </p> <p><img src=\"images/image_thumb-6-403.png\" alt=\"outlook express 2gb limit\" loading=\"lazy\"></p> <p> </p> <p> 5. Escriba un nombre reconocible para la nueva carpeta seguido de un año (p. Ej., &quot;Bandeja de entrada-2016&quot;). </p> <p><img src=\"images/image_thumb-7-434.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Luego, desde la carpeta de gran tamaño (por ejemplo, desde &quot;Bandeja de entrada&quot;), seleccione un grupo de correos electrónicos (por ejemplo, todos los correos electrónicos del año 2016) y arrástrelos y suéltelos (muévalos) a la nueva carpeta de Correo que creó antes (por ejemplo, a &quot; Bandeja de entrada-2016 &quot;). </p> <p><img src=\"images/image_thumb-8-450.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Repita los mismos pasos (cree carpetas diferentes por año, por ejemplo, y mueva los correos de la carpeta de gran tamaño a las carpetas nuevas). * </p> <p> * Aviso: si tiene problemas durante la operación de movimiento (por ejemplo, si no puede mover algunos mensajes a la nueva carpeta), entonces: </p> <blockquote><p> 1. Cierre Outlook Express. <br> 2. Copie (haga una copia de seguridad) de la carpeta &quot;Outlook Express&quot; desde la ubicación de la Tienda OE a otro destino en su disco. <br> 3. Luego, siga las instrucciones del paso 4 para eliminar el archivo .dbx de gran tamaño. <br> 4. Abra Outlook Express. <br> 5. Importe los correos electrónicos de la carpeta de copia de seguridad de OE (Desde <strong> Archivo </strong> menú ir a -&gt; <strong> Importar </strong> <strong> Mensajes </strong> -&gt; <strong> Microsoft Outlook Express 6 </strong> -&gt; <strong> Importar correo desde el directorio de la tienda OE… </strong> ). ** </p> <p> ** Si aún tiene problemas durante la importación, siga las instrucciones de este artículo para reparar el archivo DBX dañado. </p></blockquote> <p> </p> <p> 8. Cuando termine con la transferencia de correo electrónico y la carpeta de 2GB se vacíe de los correos electrónicos (por ejemplo, la &quot;Bandeja de entrada&quot; en este ejemplo), continúe con el siguiente paso. </p> <p><img src=\"images/image_thumb-10-811.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Paso 4. Elimine el archivo DBX de Outlook Express de gran tamaño de su disco. </h6> <p> 1. Abra la carpeta de la tienda Outlook Express en su disco. <br> 2. Elimine el archivo DBX de gran tamaño (por ejemplo, &quot;Inbox.dbx&quot; en este ejemplo). </p> <p><img src=\"images/image_thumb-9-996.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Inicie Outlook Express. <br> 4. OE creará (automáticamente) una nueva carpeta de correo limpia y saludable para almacenar correos electrónicos. * </p> <p> * Nota: Si aún recibe el mismo error, intente reparar la carpeta OE dañada siguiendo las instrucciones de este artículo: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo recuperar archivos DBX de Outlook Express GRATIS </a> . </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? </p> <p> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}