{"title":"REVISIÓN: Versión más reciente de Adobe Acrobat Reader DC ya instalada - Error 1722 (resuelto)","content":"<p> Se encontró el siguiente problema en una computadora con Windows: Adobe Acrobat Reader DC no se puede instalar porque &quot;Ya se instaló una versión más nueva&quot;. Lo raro de este problema es que Adobe Reader DC no se ha instalado en la máquina, porque no existe ningún rastro del programa Adobe Reader o archivos en Agregar / Quitar programas o en el disco duro. </p> <p><img src=\"images/image_thumb-19-522.png\" alt=\"Adobe Acrobat Reader DC Newer Version already installed – Error 1722 - fix\" loading=\"lazy\"></p> <p> </p> <p> Además, al solucionar el problema de instalación &quot;una nueva versión ya instalada&quot; del programa Adobe Reader DC, se produjo el siguiente mensaje de error al intentar instalar el programa utilizando el <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Paquete de distribución de Adobe Acrobat Reader DC </a> : &quot;Error 1722. Hay un problema con este paquete de Windows Installer. Un programa que se ejecutó como parte de la instalación no finalizó como se esperaba. Comuníquese con su personal de soporte o proveedor del paquete ...&quot; </p> <p><img src=\"images/image_thumb-20-398.png\" alt=\"Acrobat reader Error 1722 There is a problem with this Windows Installer package\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contiene pasos detallados e instrucciones para resolver los siguientes errores al instalar Adobe Reader DC: &quot;Una nueva versión ya instalada&quot; y &quot;Error 1722. Hay un problema con este paquete de Windows Installer&quot; en el sistema operativo Windows 10/8/7. </p> <h4> Cómo SOLUCIONAR problemas de instalación de Adobe Acrobat Reader DC: Ya se instaló una versión más nueva - Error 1722 Problema con el paquete de instalación. </h4> <h6> Método 1. Elimine los productos de Adobe Acrobat con la herramienta Acrobat Cleaner. </h6> <p> El primer paso para solucionar los problemas de instalación de Adobe Reader DC, es eliminar todas las instalaciones anteriores de Adobe Acrobat &amp; Adobe Reader, utilizando el <a href=\"https://labs.adobe.com/downloads/acrobatcleaner.html\" target=\"_blank\" rel=\"nofollow noopener\"> Utilidad de limpieza de Acrobat Reader DC y Adobe Acrobat DC </a> * y luego instalar <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> Adobe Reader DC </a> . </p> <p> * La herramienta Adobe Reader y Acrobat Cleaner está diseñada para limpiar instalaciones corruptas de Adobe Acrobat y Adobe Reader, incluida la eliminación o reparación de archivos corruptos, la eliminación o modificación de entradas de registro de permisos, etc. </p> <p><img src=\"images/image_thumb-21-370.png\" alt=\"Acrobat Reader DC & Adobe Acrobat DC Cleanup tool\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Método 2. Ejecute el solucionador de problemas de instalación y desinstalación de programas de Microsoft. </h6> <p> 1. Descarga el <a href=\"https://support.microsoft.com/en-us/help/17588/fix-problems-that-block-programs-from-being-installed-or-removed\" target=\"_blank\" rel=\"nofollow noopener\"> Solucionador de problemas de instalación y desinstalación del programa </a> de Microsoft. <br> 2. Ejecute el programa descargado y haga clic en Siguiente en la primera pantalla. <br> 3. Cuando se le solicite, haga clic en <strong> Desinstalar </strong></p> <p><img src=\"images/image_thumb-22-965.png\" alt=\"Program Install & Uninstall Troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 4. Seleccione el <strong> Adobe Acrobat Reader DC </strong> programar y seleccionar <strong> próximo </strong> . * Luego, siga las instrucciones en pantalla para solucionar el problema. </p> <p> * Nota: Si no ve el &#39;Adobe Acrobat Reader DC&#39; en la lista, haga clic en <strong> Cancelar </strong> y vuelva a ejecutar el solucionador de problemas. Pero esta vez elija &quot;Instalar&quot; cuando se le solicite. </p> <p><img src=\"images/image_thumb-23-917.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Método 3. Instale Adobe Reader utilizando el paquete completo de instalación de Acrobat Reader DC. </h6> <p> Intente instalar Adobe Reader DC utilizando el <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Paquete de distribución de Adobe Acrobat Reader DC </a> . </p> <p> </p> <h6> Método 4. Inicie el servicio de instalador de Windows. </h6> <p> 1. Abra el panel de control de Servicios de Windows: Para ello: </p> <ul> <li> Presione Windows <img src=\"images/image_thumb8_thumb_thumb-698.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. </li> <li> En el cuadro de búsqueda, escriba: <strong> services.msc </strong> &amp; haga clic <strong> OK </strong> . </li> <li> (Acepte la advertencia de UAC si aparece). </li> </ul> <p><img src=\"images/image_thumb-12-635.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. En el panel de control de Servicios, haga clic con el botón derecho en <strong> Instalador de Windows </strong> servicio y haga clic en <strong> Comienzo </strong> . * </p> <p> * Nota: Si se inicia el servicio, haga clic en <strong> Reanudar </strong> . </p> <p><img src=\"images/image_thumb-24-258.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Método 5. Vuelva a registrar el servicio de instalador de Windows. </h6> <p> 1. Abrir <strong> Símbolo del sistema como administrador. <br> </strong> 2. Escriba los siguientes comandos en orden (presione Entrar después de escribir cada comando) </p> <ul> <li><strong> msiexec / anular el registro </strong></li> <li><strong> msiexec / regserver </strong></li> </ul> <p><img src=\"images/image_thumb-25-162.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Cierre la ventana del símbolo del sistema y <strong> Reanudar </strong> tu computadora. <br> 4. Intente instalar Acrobat Reader DC. </p> <p> </p> <h6> Método 6. Instale las actualizaciones de Windows y Visual C ++. </h6> <p> 1. Instale todas las actualizaciones de Windows disponibles. <br> 2. Instale las versiones x86 y x64 del <a href=\"https://www.microsoft.com/en-in/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Paquetes redistribuibles de Visual C ++ para Visual Studio 2013 </a><br> 3. Instale las versiones x86 y x64 del <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48145\" target=\"_blank\" rel=\"nofollow noopener\"> Paquetes redistribuibles de Visual C ++ para Visual Studio 2015 </a><br> 4. Intente instalar Acrobat Reader DC. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}