{"title":"REVISIÓN: Impresión lenta de PDF en Windows 10 (resuelto)","content":"<p> Este tutorial contiene instrucciones para resolver el problema de impresión lenta de PDF desde Acrobat Reader en Windows 10. Entonces, si está intentando imprimir un archivo PDF usando Adobe Acrobat y la impresión es lenta, continúe leyendo a continuación. </p> <p> Problema en detalles: cuando intenta imprimir un archivo PDF en una impresora local o de red, la impresión lleva mucho tiempo porque después de que se envía el trabajo de impresión, la impresora comienza a imprimir la primera página muy lentamente y luego debe esperar más minutos para que se impriman las páginas restantes. Al mismo tiempo, el problema de la impresión lenta no ocurre cuando se imprime desde otros programas. (por ejemplo, de Word, Excel, etc.) </p> <p> La impresión lenta de documentos PDF de Adobe en Windows 10 puede aparecer por varias razones, por lo que este tutorial contiene varios métodos para solucionar el problema. </p> <h4> Cómo CORREGIR: La impresión de archivos PDF es muy lenta en Windows 10. </h4> <h6> Método 1. Imprima el documento PDF como imagen. </h6> <p> 1. Abra Acrobat Reader y haga clic en el <strong> Impresión </strong> botón. <br> 2. En el cuadro de diálogo Imprimir, haga clic en <strong> Avanzado. </strong></p> <p><img src=\"images/image_thumb-345.png\" alt=\"FIX: Slow PDF Printing in Windows 10\" loading=\"lazy\"></p> <p> 3. Seleccione el <strong> Imprimir como imagen </strong> casilla de verificación y haga clic en <strong> está bien. </strong></p> <p><img src=\"images/image_thumb-1-653.png\" alt=\"FIX PDF Slow Printing in Windows 10\" loading=\"lazy\"></p> <p> 4. Intente imprimir su archivo PDF. </p> <h6><br clear=\"all\"> Método 2. Deje que la impresora determine los colores. </h6> <p> 1. Abra Acrobat Reader y haga clic en el <strong> Impresión </strong> botón. <br> 2. En el cuadro de diálogo Imprimir, haga clic en <strong> Avanzado. </strong></p> <p> 3. <strong> Desmarcar </strong> la <strong> Imprimir como imagen </strong> casilla de verificación (si está marcada), y <strong> cheque </strong> la <strong> Permitir que la impresora determine los colores </strong> caja. <br> 4. Haga clic en <strong> OK </strong> para guardar la configuración e intentar imprimir el archivo PDF. * </p> <p> * Nota: Si la impresión es baja nuevamente, entonces <strong> desmarcar </strong> la <strong> &#39;Permitir que la impresora determine los colores&#39; </strong> opción y continúe con el método siguiente. </p> <p><img src=\"images/image_thumb-2-580.png\" alt=\"FIX Adobe Acrobat Slow PDF Print\" loading=\"lazy\"></p> <h6> Método 3. Reinstale o cambie el controlador de la impresora. </h6> <p> Como último recurso, para solucionar la impresión lenta de documentos PDF, realice las siguientes acciones. </p> <p><strong> Paso 1. Vuelva a instalar los controladores de la impresora. </strong></p> <p> 1. Navegue hasta Panel de control&gt; <strong> Dispositivos e impresoras </strong> . <br> 2. Haga clic con el botón derecho en la impresora y haga clic en <strong> Retire el dispositivo </strong> . </p> <p><img src=\"images/image_thumb-3-877.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Luego, navegue hasta Panel de control&gt; <strong> Programas y características </strong> y <strong> desinstalar </strong> el software de la impresora. <br> 4. <strong> Reanudar </strong> tu computador. <br> 5. Desde el sitio de asistencia del fabricante de la impresora, descargue los controladores más recientes para su impresora. <br> 6. Instale los controladores de la impresora e intente imprimir. Si la impresión vuelve a ser lenta, continúe con el Paso 2. </p> <p><strong> Paso 2. Cambie el controlador de la impresora. </strong></p> <p> Vaya de nuevo al sitio de asistencia del fabricante de su impresora y compruebe si se ofrece algún otro tipo de controlador para su impresora. (por ejemplo, impresión universal, PostScript, PCL6, etc.). Si es así, descargue e instale uno de los otros tipos de controladores e intente imprimir. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}