{"title":"REVISIÓN: El período de tiempo de espera del semáforo ha expirado al copiar archivos (resuelto)","content":"<p> El error &quot;El tiempo de espera del semáforo ha expirado&quot; puede aparecer cuando intenta copiar archivos grandes a través de la red o cuando transfiere archivos desde una unidad USB externa a su computadora. En otros casos, el &quot;Error 0x80070079: El tiempo de espera del semáforo ha expirado&quot;, aparece cuando intenta copiar archivos desde un dispositivo USB conectado (por ejemplo, desde su cámara de fotos, teléfono móvil, etc.). </p> <p><img src=\"images/image_thumb-4-812.png\" alt=\"Semaphore Timeout Period has Expired\" loading=\"lazy\"></p> <p> </p> <p> En esta guía encontrará varias formas de resolver el &quot;tiempo de espera del semáforo ha expirado. Error 0x80070079&quot; al copiar archivos desde / hacia la red o USB, en Windows 10, 8, 8.1, 7 o Vista. </p> <h4> Cómo CORREGIR: Error al copiar archivo o carpeta. El período del semáforo ha expirado. </h4> <p><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> PARTE 1. CORREGIR &#39;El período del semáforo ha expirado&#39; al copiar archivos desde USB. </a></p> <p><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> PARTE 2. CORREGIR &#39;El período del semáforo ha expirado&#39; al copiar archivos de la red. </a></p> <p> </p> <h6> PARTE 1. CORREGIR &#39;El período del semáforo ha expirado&#39; al copiar archivos desde USB. </h6> <p> Si recibe el error &#39;El período del semáforo ha expirado&#39; cuando copia archivos desde un dispositivo USB (por ejemplo, desde un disco USB externo o desde su cámara digital), intente lo siguiente para solucionar el problema: </p> <p><strong> 1. </strong> Cierre todos los programas abiertos y <strong> Reanudar </strong> tu computadora. <br> <strong> 2. </strong> Conecte el dispositivo USB a <strong> otro puerto USB </strong> . Si su computadora posee un puerto USB 2.0, conecte el dispositivo USB en ese puerto. <br> <strong> 3. </strong> Usar una <strong> diferente cable USB </strong> para conectar el dispositivo USB con su computadora. <br> <strong> 4. </strong> Si desea copiar archivos desde un dispositivo USB (por ejemplo, su teléfono móvil o su cámara digital), que posee una tarjeta SD, entonces <strong> retirar </strong> y <strong> reinsertar </strong> la <strong> tarjeta SD </strong> . Además, retire la tarjeta SD del dispositivo USB y conéctela a un <strong> lector de tarjetas </strong> (si tiene uno). <br> <strong> 5. </strong> <strong> Cheque </strong> y <strong> reparar errores </strong> en la unidad USB usando el &#39; <strong> chkdsk </strong> &#39;comando. Para hacer eso: </p> <blockquote><p> 1. Lanzamiento <strong> Símbolo del sistema como administrador </strong> . </p></blockquote> <p><img src=\"images/image_thumb-30-765.png\" alt=\"command prompt administrator\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 2. En la ventana del símbolo del sistema, escriba el siguiente comando y presione <strong> Ingresar </strong> : * </p></blockquote> <ul> <li> <ul> <li> <ul> <li><strong> chkdsk X: / F / R </strong></li> </ul> </li> </ul> </li> </ul> <p><strong> * Nota: </strong> Reemplace la letra de la unidad X de acuerdo con la letra de la unidad USB. </p> <p> </p> <p> </p> <h6> PARTE 2. CORREGIR &#39;El período del semáforo ha expirado&#39; al copiar archivos a través de la red. </h6> <p> Si recibe el error &#39;El período del semáforo ha expirado&#39; cuando intenta copiar archivos a través de la red, intente lo siguiente: </p> <h2> Método 1. Utilice una dirección IP estática. </h2> <p> Si está utilizando DHCP, desactívelo y especifique una dirección IP estática en ambas computadoras de la red. </p> <p> </p> <h2> Método 2. Actualice los controladores de red en ambos equipos. </h2> <ul> <li> Si posee una computadora portátil, intente lo siguiente: <ul> <li> Si está conectado a través de Wi-Fi, intente copiar los archivos mediante la conexión Ethernet (LAN) o ... </li> <li> Navegue al sitio de soporte del fabricante de su computadora portátil para descargar e instalar los controladores de red más recientes. </li> </ul> </li> <li> Si posee una computadora de escritorio, descargue los controladores más recientes para su tarjeta de red, desde el sitio de soporte del fabricante de la placa base. </li> </ul> <p><strong> INCLINAR: </strong> Si no puede encontrar el modelo de su computadora portátil o su placa base, haga lo siguiente: </p> <blockquote><p> 1. Presione el <strong> Ventanas </strong> <img src=\"images/image_thumb8_thumb_thumb-904.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo: <strong> devmgmt.msc </strong> &amp; haga clic <strong> OK </strong> para abrir &#39;Administrador de dispositivos&#39; <strong> . </strong></p></blockquote> <p><img src=\"images/image_thumb-1-166.png\" alt=\"device manager\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> </p> <p> 3. En el Administrador de dispositivos, expanda el <strong> Adaptadores de red. <br> </strong> 4. Haga clic con el botón derecho en su Adaptador de red y haga clic en <strong> Actualizar controlador </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-946.png\" alt=\"update driver\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Deje que Windows busque automáticamente un controlador de actualización para el adaptador de red. * </p></blockquote> <p><strong> *Nota: </strong> Si Windows no puede encontrar un controlador actualizado, utilice el nombre del adaptador (por ejemplo, &quot;Adaptador de red Broadcom 802.11g&quot;) y busque un controlador actualizado manualmente. </p> <p><img src=\"images/image_thumb-6-471.png\" alt=\"search for drivers\" loading=\"lazy\"></p> <p> </p> <p> </p> <h2> Método 3. Desactive el antivirus o el cortafuegos temporalmente. </h2> <p> El siguiente método para solucionar el problema &quot;El período del semáforo ha expirado&quot; es deshabilitar temporalmente el Firewall de Windows y su programa Antivirus. Para deshabilitar el Firewall de Windows: </p> <p> 1. Presione el <strong> Ventanas </strong> <img src=\"images/image_thumb8_thumb_thumb-462.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo: <strong> control </strong> &amp; haga clic <strong> OK </strong><strong> . </strong></p> <p><img src=\"images/image_thumb7-807.png\" alt=\"control panel command\" loading=\"lazy\"></p> <p> </p> <p> 3. Configure &quot;Ver por:&quot; en <strong> Iconos pequeños </strong> para mostrar todos los elementos del panel de control. </p> <p> </p> <p><img src=\"images/image_thumb8-567.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Abrir <strong> firewall de Windows </strong> (o &quot;Firewall de Windows Defender&quot; en Windows 10). </p> <p><img src=\"images/image_thumb-7-921.png\" alt=\"disable firewall wiindows\" loading=\"lazy\"></p> <p> </p> <p> 5. Haga clic en <strong> Activar o desactivar el Firewall de Windows </strong> . </p> <p><img src=\"images/image_thumb-8-655.png\" alt=\"turn off windows defender firewall\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Cheque </strong> la &quot; <strong> Apague el Firewall de Windows (no recomendado) </strong> &quot;opción y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-9-907.png\" alt=\"turn off windows firewall\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Reanudar </strong> su computadora y luego copie los archivos. * </p> <p> * Nota: Después de copiar los archivos, siga los pasos anteriores para volver a habilitar el Firewall de Windows. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}