{"title":"REVISIÓN: Restablecer el período de gracia de 120 días en el servidor RDS 2016/2012.","content":"<p> Si ha instalado un servidor RDS 2016 con fines de prueba y el período de gracia de la licencia de RDS ha expirado, continúe leyendo a continuación para aprender cómo restablecer el período de gracia de 120 días. Como sabrá cuando instale el servidor RDS 2016, tiene 120 días para instalar las licencias de acceso de cliente RD (RD CAL), de lo contrario, los usuarios ya no podrán establecer sesiones RDP en el servidor Host de sesión RD, con el error la sesión de escritorio se desconectó porque no hay servidores de licencias de escritorio remoto disponibles para proporcionar una licencia &quot;. </p> <p><img src=\"images/image_thumb-32-368.png\" alt=\"Reset 120 Days Grace Period on RDS Server 2012/2016\" loading=\"lazy\"></p> <p> </p> <h4> Cómo restablecer el período de gracia de licencias de RDS en el servidor 2012 o 2016. * </h4> <p><strong> * Importante: </strong> Aplique las instrucciones a continuación, solo si está utilizando RDS Server 2016 en un entorno de prueba. Si desea utilizar el servidor RDS en un entorno de producción, proceda y compre RD CAL. </p> <p> Para extender el período de gracia de 120 días en el servidor de licencias de RDS: </p> <p> 1. Abra el Editor del registro y navegue hasta la siguiente tecla: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Control \\ Terminal Server \\ RCM \\ GracePeriod </li> </ul> <p> 2. Haga clic con el botón derecho en la tecla &#39;GracePeriod&#39; y seleccione <strong> Permisos. </strong></p> <p><img src=\"images/image_thumb-33-473.png\" alt=\"Reset Grace Period RDS 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Luego haga clic en <strong> Avanzado </strong> . </p> <p><img src=\"images/image_thumb-34-585.png\" alt=\"Reset RDS Grace Period\" loading=\"lazy\"></p> <p> </p> <p> 4. Seleccione el <strong> Administradores </strong> objeto y haga clic en <strong> Editar </strong> . </p> <p><img src=\"images/image_thumb-18-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Cambie los permisos a <strong> Control total </strong> y haga clic en <strong> está bien. </strong></p> <p><img src=\"images/image_thumb-19-737.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Haga clic con el botón derecho en el valor &quot;L $ RTMTIMEBOMB ...&quot; y seleccione <strong> Borrar </strong> . </p> <p><img src=\"images/image_thumb-35-208.png\" alt=\"Reset RDS Licensing Grace Pariod\" loading=\"lazy\"></p> <p> </p> <p> 7. Cierre el Editor del registro y reinicie el servidor RDS. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}