{"title":"REVISIÓN: Falta la carpeta DRAFTS de Outlook en el panel de navegación en Outlook 2013, 2010 o 2007 (resuelto)","content":"<p> El siguiente problema ha ocurrido en uno de mis clientes: De repente y sin una razón obvia, la carpeta Borradores falta en el panel de navegación en Outlook 2013. La primera acción para restaurar la carpeta Borradores que falta es buscar en todas las demás carpetas de Outlook para hacer asegúrese de que la carpeta no se haya movido o eliminado por error. Si aún no puede encontrar la carpeta que falta, continúe a continuación para solucionar el problema. </p> <p><img src=\"images/image_thumb-37-460.png\" alt=\"Drafts folder Missing Outlook\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contiene instrucciones sobre cómo restaurar una carpeta que falta en Outlook 2007, 2010, 2013, 2016 o 365. </p> <h4> Cómo restaurar una carpeta perdida desde el panel de navegación de Outlook. </h4> <h6> Método 1. Analice su sistema en busca de virus y malware. </h6> <p> El primer paso para resolver el problema de las &quot;carpetas faltantes&quot; en Outlook es asegurarse de que su sistema esté libre de virus / malware. Para esa tarea, siga las instrucciones de esta guía: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo escanear su computadora en busca de virus y otros programas maliciosos. </a></p> <p> </p> <h6> Método 2. RESTABLECER las carpetas de Outlook. </h6> <p> Después del análisis de virus, proceda y restablezca las carpetas de Outlook a sus valores predeterminados mediante el proceso siguiente: </p> <p> 1. Cierre la aplicación Outlook. <br> 2. Presione el <strong> Ventanas </strong> <img src=\"images/image_thumb8_thumb_thumb-622.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 3. En el cuadro de búsqueda, escriba: <strong> Outlook / Resetfolders </strong> &amp; haga clic <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-36-732.png\" alt=\"outlook reset folders\" loading=\"lazy\"></p> <p> </p> <p> 4. Outlook se abrirá y se recuperarán todas las carpetas que faltan. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? </p> <p> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este tema. </p>"}