{"title":"REVISIÓN: Office no tiene la licencia adecuada: no se puede verificar la licencia en Office 2019, 2016.","content":"<p> Si instaló Microsoft Office 2019 u Office 2016 con una licencia legítima de Office y recibe el error &quot;Office no tiene la licencia adecuada y podría ser víctima de una falsificación de software. Manténgase seguro con Office original hoy&quot;, continúe a continuación para solucionar el problema . </p> <p> Los mensajes / errores de Office &quot;No se puede verificar la licencia&quot; y &quot;Office no tiene la licencia adecuada y es posible que usted sea víctima de una falsificación de software&quot;, por lo general aparecen en computadoras sin una licencia de Office legítima o con una licencia de Office obtenida de un tercero. vendedor y no Microsoft. </p> <p><img src=\"images/image_thumb-31-132.png\" alt=\"FIX: Office isn't licensed properly - Cannot verify license\" loading=\"lazy\"></p> <p> </p> <h2> Cómo CORREGIR: No se puede verificar la licencia: Office no tiene la licencia adecuada en Office 2016/2019. </h2> <p> Si tiene una licencia de Office 2016/2019 válida obtenida de Microsoft que se activó y funcionaba bien antes, pero ahora ve el mensaje &quot;Obtenga Office original&quot; o &quot;No se puede verificar la licencia para este producto&quot; en cualquier aplicación de Office (Word, , Outlook, etc.), continúe a continuación para solucionar el problema. </p> <h3> Método 1. Ejecute aplicaciones de Office en modo de compatibilidad. </h3> <p> 1. <strong> Cerca </strong> todas las aplicaciones de Office. <br> 2. Abra el Explorador y, según su tipo de instalación de Office, navegue hasta la carpeta correspondiente a continuación: </p> <p><strong> Tipo de instalación basada en MSI de Office: </strong></p> <ul> <li> C: \\ Archivos de programa \\ Microsoft Office \\ Office16 </li> <li> C: \\ Archivos de programa (x86) \\ Microsoft Office \\ Office16 </li> </ul> <p> </p> <p><strong> Tipo de instalación de Office Click-to-Run: </strong></p> <ul> <li> C: \\ Archivos de programa \\ Microsoft Office \\ root \\ Office16 </li> <li> C: \\ Archivos de programa (x86) \\ Microsoft Office \\ root \\ Office16 </li> </ul> <p> 3. Ubique y <strong> botón derecho del ratón </strong> en la aplicación de Office muestra el error de licencia (por ejemplo, Word&gt; &quot;WINWORD.EXE&quot;) y seleccione <strong> Propiedades </strong> . <br> 4. En <strong> Compatibilidad </strong> pestaña: </p> <blockquote> <p> una. <strong> Desmarcar </strong> la opción <strong> Ejecuta este programa en modo compatibilidad para <br> </strong> B. Hacer clic <strong> Cambie la configuración de todos los usuarios. </strong></p> <p><strong><strong><img src=\"images/image_thumb-32-197.png\" alt=\"run program in compatibility mode\" loading=\"lazy\"></strong></strong></p> <p> C. En <strong> Compatibilidad </strong> para todas las opciones de los usuarios <strong> , desmarcar </strong> la opción <strong> Ejecute este programa en modo de compatibilidad </strong> y haga clic en <strong> OK </strong> dos veces. </p> <p><img src=\"images/image_thumb-33-697.png\" alt=\"run in compatibility mode\" loading=\"lazy\"></p> </blockquote> <p> 5. Ahora abra la aplicación de Office y compruebe si el problema persiste. </p> <h3> Método 2. Reparación de la instalación de Office. </h3> <p> El segundo método para solucionar problemas con la licencia de MS Office es reparar Microsoft Office. Para hacer eso: </p> <p> 1. <strong> Cerca </strong> todas las aplicaciones de Office. <br> 2. Navega a <strong> Programas y características </strong> . Para hacer eso: </p> <blockquote><p> 1. Presione simultáneamente las ventanas <img src=\"images/image_thumb36-291.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo: <strong> appwiz.cpl </strong> y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-24-317.png\" alt=\"programs and features\" loading=\"lazy\"></p> </blockquote> <p> 3. En Programas y características, seleccione el producto de Microsoft Office que se instaló en su sistema y haga clic en <strong> Cambio. </strong></p> <p><img src=\"images/image_thumb-25-386.png\" alt=\"office repair\" loading=\"lazy\"></p> <p> 4. Finalmente haga clic en <strong> Reparar </strong> y siga los pasos restantes para reparar Microsoft Office. * </p> <p> * Aviso: si después de hacer clic en &#39;Reparar&#39;, recibe el mensaje &quot; <strong> ¿Cómo le gustaría reparar sus programas de Office? </strong> &quot;pantalla, seleccione la <strong> Reparación rápida </strong> opción, que comprueba y reemplaza los archivos dañados o faltantes. Si después de la &quot;Reparación rápida&quot;, los problemas no se solucionan, elija el <strong> Reparación en línea </strong> opción para reinstalar su producto de Office. (requiere una conexión a Internet). </p> <p><img src=\"images/image_thumb-26-803.png\" alt=\"Repair Office\" loading=\"lazy\"></p> <p> 5. Cuando se complete la reparación, inicie las aplicaciones de Office y verifique si el problema se resolvió. </p> <h3> Método 3. Restaurar MS Office a la versión anterior. </h3> <p> Si el problema de la licencia de Office aparece después de actualizar MS Office, intente lo siguiente: </p> <p> 1. <strong> Cerca </strong> todas las aplicaciones de Office. <br> 2. Abrir <strong> Símbolo del sistema como administrador </strong> . Para hacer eso: </p> <blockquote> <ol> <li> En el cuadro de búsqueda, escriba: <strong> símbolo del sistema </strong> o <strong> cmd </strong></li> <li> Haga clic derecho en <strong> cmd </strong> o <strong> Símbolo del sistema </strong> resultado y seleccione <strong> Ejecutar como administrador. </strong></li> </ol> <p><img src=\"images/image_thumb-10-974.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> </blockquote> <p> 3. En el símbolo del sistema, escriba estos comandos en orden (presione <strong> Ingresar </strong> después de escribir cada comando) </p> <ul> <li> <p> CD\\ </p> </li> <li> <p> cd C: \\ Archivos de programa \\ Archivos comunes \\ microsoft shared \\ ClickToRun </p> </li> <li> <p> officec2rclient.exe / update user updatetoversion = 16.0.13628.20274 </p> </li> </ul> <p><img src=\"images/image_thumb-34-389.png\" alt=\"Office isn't licensed properly - fix\" loading=\"lazy\"></p> <p> 4. Espere de 4 a 5 minutos para que el proceso de &quot;Configuración de Office&quot; actualice los archivos necesarios. <br> 5. Una vez hecho esto, abra cualquier aplicación de Office y compruebe si se ha resuelto el problema de la licencia. Si es así, proceda y <strong> apagar </strong> la <strong> Actualizaciones de Office </strong> , haciendo lo siguiente: </p> <blockquote> <p> 1. Abra cualquier aplicación de Office y vaya a <strong> Archivo </strong> menú -&gt; <strong> Cuenta. <br> </strong> 2. Haga clic en <strong> Opciones de actualización </strong> y <strong> Desactivar actualizaciones. </strong></p> <p><img src=\"images/image_thumb-35-367.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <h3> Método 4. Quite y reinstale Microsoft Office. </h3> <p> El método final para solucionar los problemas de licencia de Office es desinstalar completamente todas las versiones instaladas de MS Office de su PC y luego reinstalar MS Office: </p> <p> 1. Descarga el <a href=\"https://aka.ms/SaRA-officeUninstallFromPC\" target=\"_blank\" rel=\"nofollow noopener\"> Asistente de soporte y recuperación de Microsoft (SARA) </a> utilidad. <br> 2. Cuando se complete la descarga <strong> haga doble clic </strong> para ejecutar el <strong> SetupProd_OffScrub.exe </strong> solicitud. <br> 3. Haga clic en <strong> Instalar en pc </strong> para instalar la utilidad SARA. </p> <p><img src=\"images/image_thumb-5-418.png\" alt=\"Microsoft Support and Recovery Assistant\" loading=\"lazy\"></p> <p> 4. Cuando se complete la instalación, haga clic en <strong> Estar de acuerdo </strong> y luego haga clic en <strong> Si. </strong></p> <p><img src=\"images/image_thumb-6-584.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Espere hasta que el &#39;Asistente de recuperación y soporte de Microsoft&#39; solucione el problema. <br> 6. Seleccione la casilla de verificación a la izquierda del nombre del producto de Office para <strong> seleccione todos los productos de Office instalados </strong> y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb-7-227.png\" alt=\"Unistall Office Tool\" loading=\"lazy\"></p> <p> </p> <p> 7. Ahora espere hasta que se complete el proceso de eliminación de Office y cuando termine, <strong> Reanudar </strong> tu computadora. <br> 8. Después de reiniciar, proceda y reinstale Office siguiendo las instrucciones de estos enlaces: </p> <ul> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Oficina 365 </a></li> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Oficina 2019 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Oficina 2016 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Oficina 2013 </a></li> </ul> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}