{"title":"REVISIÓN: ERROR FATAL DE VIDEO DXGKRNL en Windows 10 (resuelto)","content":"<p> Si se encuentra con el error de pantalla azul &quot;VIDEO DXGKRNL FATAL ERROR&quot; en Windows 10, siga las instrucciones a continuación para solucionar el problema. </p> <p> El error BSOD de Windows 10 &quot; <em> Su PC tuvo un problema y necesita reiniciarse. Solo estamos recopilando información de error y luego lo reiniciaremos. Si desea saber más, puede buscar en línea más tarde este error: VIDEO DXGKRNL FATAL ERROR &quot;, </em> normalmente indica un problema con los controladores de vídeo. </p> <p><img src=\"images/image_thumb-7-129.png\" alt=\"FIX: VIDEO DXGKRNL FATAL ERROR in Windows 10\" loading=\"lazy\"></p> <p> Este tutorial contiene instrucciones paso a paso para resolver el error de pantalla azul &quot;VIDEO DXGKRNL FATAL ERROR&quot; en Windows 10. </p> <h2> Cómo arreglar: Windows 10 VIDEO DXGKRNL FATAL ERROR. </h2> <h3> Paso 1. Arregle VIDEO DXGKRNL FATAL ERROR desinstalando / reinstalando los controladores de video. </h3> <p> 1. Abrir <strong> Administrador de dispositivos </strong> . Para hacer eso: </p> <ol> <li> <ol> <li> Presione Windows <img src=\"images/image_thumb8_thumb_thumb-153.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. </li> <li> En el cuadro &quot;Abrir&quot;, escriba: <strong> devmgmt.msc </strong> &amp; haga clic <strong> OK </strong> . </li> </ol> </li> </ol> <blockquote> <p><img src=\"images/image_thumb-5-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p></blockquote> <p> 2. <strong> Expandir </strong> la <strong> Adaptadores de pantalla. <br> </strong> 3. <strong> Botón derecho del ratón </strong> en los adaptadores de pantalla instalados y seleccione <strong> Desinstalar dispositivo. </strong></p> <p><img src=\"images/image_thumb-46-240.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. En la siguiente ventana, si tiene la opción: &quot; <strong> Eliminar el software del controlador para este dispositivo </strong> &quot;, selecciónelo y luego haga clic en <strong> OK </strong> para quitar los controladores instalados de la computadora. </p> <p> 5. Después de la desinstalación, <strong> Reanudar </strong> su computadora y navegue hasta <strong> Administrador de dispositivos </strong> de nuevo. <br> 6. Haga clic con el botón derecho en el Nombre de la computadora (en la parte superior) y seleccione <strong> Busque cambios de hardware. </strong></p> <p><img src=\"images/image_thumb-8-911.png\" alt=\"Scan for hardware changes\" loading=\"lazy\"></p> <p> </p> <p> 7. Deje que Windows detecte e instale los controladores de pantalla y luego <strong> Reanudar </strong> su computadora nuevamente y verifique si el &quot;VIDEO DXGKRNL FATAL ERROR&quot; persiste. * </p> <p> * Nota: Si Windows no puede instalar automáticamente los controladores de pantalla automáticamente o si aún enfrenta el error de pantalla azul, continúe con el siguiente paso. </p> <p> </p> <h3><br clear=\"all\"> Paso 2. Vuelva a instalar los controladores de video desde el sitio del fabricante. </h3> <p> 1. Navega a <strong> Administrador de dispositivos </strong> y <strong> desinstalar </strong> el adaptador de pantalla instalado. * </p> <p> * Nota: Si posee una computadora portátil con dos (2) adaptadores de pantalla, desinstale ambos. </p> <p> 2. Vaya al sitio de asistencia del fabricante de su computadora (o tarjeta gráfica) y descargue los controladores más recientes para sus tarjetas gráficas. </p> <ul> <li> <ul> <li> Para <strong> NVIDIA </strong> basadas en GPU, navegue hasta <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Página de búsqueda avanzada de controladores de NVIDIA </a> . </li> <li> Para <strong> AMD </strong> basadas en GPU, navegue hasta <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Centro de descarga de controladores AMD (ATI). </a></li> <li> Para <strong> Intel </strong> basadas en GPU, navegue hasta <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Centro de descarga de gráficos Intel. </a></li> </ul> </li> </ul> <p> 3. Continúe e instale el controlador descargado. * </p> <p><strong> * Nota IMPORTANTE: </strong> Si posee una computadora portátil con dos (2) adaptadores de pantalla, primero proceda a instalar los controladores para el adaptador AMD o NVIDIA y reinicie su computadora portátil. Después de reiniciar, proceda e instale los controladores para el adaptador de pantalla INTEL y luego reinicie su computadora portátil nuevamente. </p> <p> 4. Después de la instalación, <strong> Reanudar </strong> su PC y verifique si el VIDEO DXGKRNL FATAL ERROR está resuelto. Si no es así, continúe con el siguiente paso. </p> <p> </p> <h3><br clear=\"all\"> Paso 3. Repare DirectX para arreglar VIDEO DXGKRNL FATAL ERROR. </h3> <p> El VIDEO DXGKRNL FATAL ERROR indica un problema en los controladores DirectX de Microsoft. Entonces, proceda a reparar DirectX. </p> <p> 1. Descarga el <a href=\"https://www.microsoft.com/en-us/download/details.aspx?displaylang=en&id=35\" target=\"_blank\" rel=\"nofollow noopener\"> Instalador web de tiempo de ejecución de usuario final de DirectX </a> . <br> 2. Ejecute el archivo descargado (dxwebsetup.exe) y siga las instrucciones en pantalla para instalar los componentes opcionales de DirectX Runtime. </p> <p><img src=\"images/image_thumb-9-847.png\" alt=\"Install DirectX Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Cuando se complete la instalación <strong> Reanudar </strong> tu computador. </p> <p> 4. Después de reiniciar, vaya a <strong> Comienzo <img src=\"images/image_thumb-55-571.png\" alt=\"image\" loading=\"lazy\"> -&gt; Configuración </strong> -&gt; <strong> Actualización y seguridad -&gt; </strong> y haga clic en <strong> Busque actualizaciones. </strong></p> <p><img src=\"images/image_thumb-76-281.png\" alt=\"Windows 10 - Check For Updates \" loading=\"lazy\"></p> <p> 5. Después de la instalación de las actualizaciones, reinicie su PC nuevamente y verifique si el error BSOD está resuelto. Si no es así, continúe con el siguiente paso. </p> <p> </p> <h3><br clear=\"all\"> Paso 4. Repare los archivos de sistema de Windows 10. </h3> <p> 1. Abrir <strong> Símbolo del sistema como administrador </strong> . <br> 2. En el símbolo del sistema, dé el siguiente comando y presione <strong> Ingresar: </strong></p> <ul> <li><strong> DISM.exe / En línea / Imagen de limpieza / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-176.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Cuando se complete la operación DISM, escriba el siguiente comando y presione <strong> Ingresar </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-464.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Ahora espere hasta que el Comprobador de archivos de sistema repare los archivos de sistema de Windows. <br> 5. Una vez hecho esto, <strong> Reanudar </strong> su computadora y verifique si el error persiste. </p> <p> </p> <h3><br clear=\"all\"> Paso 5. Analizar el archivo de registro de minivolcado (BSOD). </h3> <p> Cuando Windows se bloquea con una pantalla azul, almacena los detalles de la pantalla BSoD en archivos pequeños, que se denominan &quot; <strong> MiniDump </strong> &quot;. El análisis de la <strong> Minidump </strong> archivo (s) pueden ayudarlo a solucionar problemas y resolver el problema de la pantalla azul VIDEO DXGKRNL FATAL ERROR. Para realizar esta tarea, siga las instrucciones de este artículo: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo analizar archivos MiniDump con BlueScreenView </a> . </p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}