{"title":"REVISIÓN: Chrome siempre abre las opciones Explorar como invitado: cambiar de persona al inicio.","content":"<p> El tutorial contiene instrucciones sobre cómo evitar que Chrome muestre la ventana &quot;Cambiar de persona: navegar como invitado&quot; al inicio. Problema en detalles: en una computadora con Windows, el navegador Google Chrome siempre abre las opciones &quot;Buscar como invitado&quot; y &quot;Agregar persona&quot; al inicio y el usuario siempre debe seleccionar su perfil para usar el navegador Chrome. </p> <p><img src=\"images/image_thumb-26-805.png\" alt=\"FIX Remove Chrome Browse as Guest\" loading=\"lazy\"></p> <p> </p> <h4> Cómo quitar la ventana de opciones &quot;Navegador como invitado - Agregar persona&quot; en el inicio de Chrome. </h4> <h6> Método 1. Compruebe si Chrome está configurado para Iniciar siempre en el modo de navegación de invitado. </h6> <p> Una de las características más útiles del navegador Google Chrome es crear múltiples perfiles de usuario, especialmente si comparte su computadora con otros, o si desea separar sus marcadores y configuraciones entre sus múltiples cuentas. En este caso, siempre puede iniciar Chrome con la ventana &quot;Cambiar de persona&quot;, agregando uno de los siguientes interruptores (entradas de texto) en el acceso directo de Chrome: </p> <ul> <li><strong> –Profile-directory = &quot;Perfil de invitado&quot; </strong></li> <li><strong> –Bwsi </strong></li> </ul> <p> </p> <p> En primer lugar, compruebe si Chrome está configurado para abrir siempre la ventana &quot;Cambiar de persona / Navegar como invitado&quot;. Para hacer eso: </p> <p> 1. Cierre Google Chrome. <br> 2. Haga clic con el botón derecho en el acceso directo de Chrome en su escritorio y seleccione <strong> Propiedades </strong> . <br> 3. En <strong> Atajo </strong> pestaña, mira la <strong> Objetivo </strong> cuadro de texto y (si está presente) <strong> retirar </strong> las entradas de texto anteriores al final y luego haga clic en <strong> OK </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-27-916.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Inicie Chrome y en la ventana &quot;Cambiar de persona&quot;, haga clic en el icono / imagen de su perfil (&quot;Usted&quot;). <br> 5. <strong> Reanudar </strong> Cromo. </p> <p> </p> <h6> Método 2. Cree un nuevo perfil limpio de Google Chrome. </h6> <p> De forma predeterminada, Chrome almacena toda la configuración del perfil (marcadores, contraseñas, extensiones, etc.) dentro de la carpeta &quot;Datos del usuario&quot; en la siguiente ubicación de su computadora: </p> <ul> <li><strong> C: \\ Users \\% Username% \\ AppData \\ Local \\ Google \\ Chrome \\ User Data </strong></li> </ul> <p> Si por alguna razón, la carpeta de perfil de Chrome se corrompe o se modifica incorrectamente por un malware, entonces la mejor opción que tiene es forzar a Chrome a volver a crear una nueva carpeta de perfil de Chrome (vacía *). Para hacer eso: </p> <p><strong> * Atención: </strong> Tenga en cuenta que, al eliminar la carpeta de almacenamiento de su perfil de Chrome, elimina todos los datos almacenados (Marcadores, Configuración, Extensiones, Historial, etc.). Entonces, antes de eliminar su perfil de Chrome, tome un <a href=\"https://www.repairwin.com/backup-restore-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> copia de seguridad de sus marcadores de Chrome </a> en caso de que desee volver a instalar Chrome. </p> <h5> Paso 1: habilite la vista de archivos y carpetas ocultos. </h5> <p> 1. Abrir <strong> Opciones de carpeta </strong> . <br> 2. En <strong> Vista </strong> pestaña, <strong> cheque </strong> la <strong> Mostrar archivos, carpetas y unidades ocultos </strong> casilla de verificación y haga clic en <strong> está bien. </strong></p> <p><img src=\"images/image_thumb-6-189.png\" alt=\"enable hidden files folders\" loading=\"lazy\"></p> <h6></h6> <h5> Paso 2. Obligar a Chrome a crear una carpeta de perfil nueva (limpia). </h5> <p> 1. <strong> Cerca </strong> Google Chrome. <br> 2. <strong> Abierto </strong> Explorador de Windows y navegue hasta esta ubicación: </p> <ul> <li><strong> C: \\ Users \\% USERNAME% \\ AppData \\ Local \\ Google \\ Chrome \\ </strong></li> </ul> <p> * Donde% USERNAME% = Su nombre de usuario. (por ejemplo, si su nombre de usuario es &quot;Admin&quot;, entonces debe navegar a esta ruta: &quot;C: \\ Users \\ Admin \\ AppData \\ Local \\ Google \\ Chrome&quot;) </p> <p> 3. <strong> Rebautizar </strong> la carpeta &quot;Datos de usuario&quot; a &quot;Datos de usuario.BAK&quot;. </p> <p><img src=\"images/image_thumb-28-373.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Ahora abra Google Chrome. (Durante el inicio, Chrome creará automáticamente una nueva carpeta limpia &quot;Datos de usuario&quot; para almacenar sus marcadores y configuraciones). </p> <p> </p> <h6> Métodos adicionales para resolver problemas de Chrome. </h6> <p><strong> 1. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Revise su computadora en busca de virus, malware, etc. </a></p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Desinstale y vuelva a instalar Chrome por completo. </a></p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}