{"title":"REVISIÓN: El programa no se puede iniciar porque falta VCRUNTIME140.DLL (resuelto)","content":"<p> Este tutorial contiene instrucciones para corregir el siguiente error en el inicio de Windows 10 o cuando intenta ejecutar o instalar un programa: &quot;El programa no se puede iniciar porque VCRUNTIME140.dll no se encuentra en su computadora. Intente reinstalar el programa para solucionar este problema ”. </p> <p><img src=\"images/image_thumb-31-814.png\" alt=\"FIX Program can’t start because VCRUNTIME140.DLL is missing\" loading=\"lazy\"></p> <p> </p> <p> El archivo &quot;VCRUNTIME140.dll&quot; es parte de Microsoft Visual C ++ 2015 y es requerido por las aplicaciones que se desarrollan con Visual Studio 2015. Si el archivo &quot;VCRUNTIME140.dll&quot; falta o está dañado, entonces el sistema muestra el &quot;VCRUNTIME140.DLL Falta &quot;error siempre que se requiera el archivo&quot; VCRUNTIME140.DLL &quot;para ejecutar una aplicación. </p> <h4> Cómo CORREGIR: Falta VCRUNTIME140.DLL. </h4> <p> 1. Descarga el <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=52685\" target=\"_blank\" rel=\"nofollow noopener\"> Paquete redistribuible de Microsoft Visual C ++ 2015 </a> . </p> <p><img src=\"images/image_thumb-32-401.png\" alt=\"fix VCRUNTIME140.DLL is missing\" loading=\"lazy\"></p> <p> </p> <p> 2. En la siguiente pantalla, seleccione según su arquitectura de Windows (32 o 64 bits), el archivo &quot;vc_redist.exe&quot; correspondiente para descargar (o descargue ambos archivos si no está seguro). </p> <p><img src=\"images/image_thumb-33-787.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Cuando se complete la descarga, haga doble clic en &quot;vc_redist.exe&quot; que descargó. <br> 4. <strong> Aceptar </strong> los términos de la licencia y haga clic en <strong> Instalar en pc </strong> . </p> <p><img src=\"images/image_thumb-34-802.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este problema. </p>"}