{"title":"REVISIÓN: El menú de inicio de Windows 10, la configuración, Cortana o la barra de tareas no funcionan. (Resuelto)","content":"<p> Este tutorial contiene instrucciones para solucionar los siguientes problemas en Windows 10: el menú Inicio no se abre, la búsqueda de Cortana no funciona, la aplicación Configuración no se inicia, los iconos de la barra de tareas no se abren. </p> <p> Muchos usuarios de Windows 10 informaron problemas con el menú Inicio, la barra de tareas, Cortana y Configuración, por lo que en esta guía enumero los métodos más comunes para resolver los problemas anteriores. </p> <h2> Cómo CORREGIR: barra de tareas de Windows 10, menú Inicio, configuración o problemas de Cortana. </h2> <h3> Método 1. Desinstale la última actualización de Windows 10. </h3> <p> Muchos usuarios han informado que los problemas mencionados en este artículo se resuelven después de desinstalar <strong><a href=\"https://support.microsoft.com/en-us/topic/august-11-2020-kb4566782-os-build-19041-450-ec5cf4b6-86ed-b0d3-539c-5fbe1b17f56a\" target=\"_blank\" rel=\"nofollow noopener\"> KB4566782 </a></strong> Actualizar. </p> <p> Si no puede encontrar la actualización KB4566782 en la lista de actualizaciones instaladas, verifique e instale todas las actualizaciones disponibles y, si el problema persiste, intente <strong><a href=\"https://www.repairwin.com/how-to-uninstall-updates-in-windows-10/#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> desinstale las últimas actualizaciones instaladas. </a></strong></p> <h3> Método 2. Reinicie Windows 10 en modo seguro. </h3> <p> 1. Presione las ventanas <img src=\"images/image_thumb8_thumb_thumb-268.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> msconfig </strong> y presione <strong> Ingresar </strong> . </p> <p><img src=\"images/image_thumb-47-537.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. En <strong> Bota </strong> pestaña seleccione la <strong> Arranque seguro </strong> opción, luego haga clic en <strong> OK </strong> y reinicie su computadora. </p> <p><img src=\"images/image_thumb-48-665.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 4. Después de reiniciar y mientras está en Modo seguro, verifique si sus problemas persisten. <br> 5. Luego, ejecute la herramienta &#39;msconfig&#39; nuevamente y en el <strong> General </strong> pestaña, verifique la <strong> Inicio normal </strong> y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-859.png\" alt=\"normal startup windows\" loading=\"lazy\"></p> <p> 6. <strong> Reanudar </strong> tu computadora. <br> 7. Después de reiniciar, verifique si el problema persiste; de ​​lo contrario, continúe con el siguiente método. </p> <p> </p> <h2> Método 3. Realice un inicio limpio. </h2> <p> 1. Ejecute la herramienta &#39;msconfig&#39;. <br> 2. En la pestaña Servicios, <strong> cheque </strong> la <strong> Esconder todos los servicios de Microsoft </strong> casilla de verificación y luego presione <strong> Desactivar todo </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-333.png\" alt=\"clean boot windows\" loading=\"lazy\"></p> <p> </p> <p> 3. Luego seleccione el <strong> Puesta en marcha </strong> pestaña y haga clic en <strong> Abra el Administrador de tareas. <br> </strong> 4. <strong> </strong> Seleccione uno por uno todos los programas enumerados y haga clic en <strong> Desactivar. </strong></p> <p><img src=\"images/image_thumb-1-399.png\" alt=\"clean boot windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Cuando termine, cierre esa ventana y luego haga clic en <strong> OK </strong> en la utilidad &#39;Configuración del sistema&#39; para <strong> Reanudar </strong> tu computadora. <br> 6. Después de reiniciar, si su computadora funciona bien y sin problemas, * luego abra la utilidad &#39;Configuración del sistema&#39; (msconfig) nuevamente y habilite uno por uno todos los programas deshabilitados y reinicie su PC, hasta que descubra qué programa causa el problema. problema. </p> <p> * Nota: Si el problema persiste, incluso en el estado de inicio limpio, continúe con el siguiente método. </p> <h3> Método 4. Reinstale y vuelva a registrar todas las aplicaciones integradas de Windows 10. </h3> <p> El siguiente método para resolver problemas con la barra de tareas, el menú Inicio, Cortana, etc. en Windows 10 es reinstalar y volver a registrar todas las aplicaciones integradas. </p> <p> 1. Abra PowerShell como administrador. Para hacer eso: </p> <blockquote><p> 1. En <strong> Cortana </strong> cuadro de búsqueda de, escriba <strong> potencia Shell <br> </strong> 2. Haga clic derecho en <strong> Windows PowerShell </strong> resultado y seleccione <strong> Ejecutar como administrador. </strong></p></blockquote> <p><img src=\"images/image_thumb-51-691.png\" alt=\"FIX: Windows 10 Start Menu, Settings, Cortana or Taskbar icons Not Working.\" loading=\"lazy\"></p> <p> </p> <p> 3. En PowerShell, escriba (copie y pegue) el siguiente comando y presione <strong> Ingresar </strong> : </p> <ul> <li> Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register &quot;$ ($ _. InstallLocation) \\ AppXManifest.xml&quot;} </li> </ul> <p><img src=\"images/image_thumb-2-985.png\" alt=\"register re-install windows 10 apps\" loading=\"lazy\"></p> <p> 4. Espere a que se ejecute el comando e ignore los errores (en letras rojas). <br> 5. <strong> Reanudar </strong> su computadora y luego verifique si su problema está solucionado. </p> <p> </p> <h3> Método 5. Cree una nueva cuenta. </h3> <p> Otro método para solucionar varios problemas en Windows 10 es crear una nueva cuenta y transferir sus archivos y datos personales a la nueva cuenta. Para hacer eso: </p> <p> 1. Abrir <strong> Símbolo del sistema como administrador </strong> . <br> 2. En el símbolo del sistema, escriba el siguiente comando y presione <strong> Ingresar </strong> : </p> <ul> <li><strong> contraseña de la cuenta de usuario de red / agregar </strong></li> </ul> <p> * Nota: En el comando anterior, reemplace los campos &quot;cuenta&quot; y &quot;contraseña&quot; con su elección. </p> <p> p.ej. si desea crear una nueva cuenta con el nombre de usuario &quot;Admin1&quot; y la contraseña &quot;Admin123&quot;, escriba: <em> usuario neto Admin1 Admin123 / agregar </em></p> <p><img src=\"images/image_thumb-3-388.png\" alt=\"add user windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Luego proceda y agregue la nueva cuenta, al grupo de Administradores, con este comando: </p> <ul> <li><strong> cuenta de administradores de net localgroup / agregar </strong></li> </ul> <p> p.ej. En nuestro ejemplo, el comando es: <em> administradores net localgroup Admin1 / add </em></p> <p><img src=\"images/image_thumb-4-429.png\" alt=\"fix windows 10 start menu, cortana, settings\" loading=\"lazy\"></p> <p> </p> <p> 4. Cierre la ventana del símbolo del sistema y <strong> Reanudar </strong> tu computadora. <br> 5. Después de reiniciar, inicie sesión con una nueva cuenta. <br> 6. Compruebe si el problema persiste. Si se soluciona el problema, transfiera sus datos y archivos a la nueva cuenta y listo. </p> <p> </p> <h3> Método 6. Reparar Windows 10. </h3> <p> El último método para resolver los problemas de Windows 10 es <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> reparar Windows 10 con actualización local </a> . </p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}