{"title":"REVISIÓN: La actualización de Windows 10 no pudo desinstalar Avira AntiVir (resuelto)","content":"<p> En una computadora con Windows 10, aparece el siguiente mensaje al intentar actualizar Windows 10 a la versión 1803 o 1809: &quot;Algunas aplicaciones deben desinstalarse: estos programas deben desinstalarse porque no son compatibles con la actualización: Avira Antivirus&quot; y al presionar el botón &quot;Desinstalar y continuar&quot;, aparece el siguiente error: &quot;No pudimos desinstalar estas aplicaciones: Avira AntiVir&quot;. Lo curioso de este problema es que el Avira Antivir (Antivirus) no está instalado en la PC (no aparece en los programas instalados). </p> <p><img src=\"images/image_thumb-10-929.png\" alt=\"Windows 10 Update Couldn't uninstall Avira AntiVir\" loading=\"lazy\"></p> <p> El problema &quot;No se pudo desinstalar Avira AntiVir&quot; durante la actualización de Windows 10 v1803, se debe a que el programa de actualización encuentra algunos archivos en su PC que están asociados con Avira Antivirus y no se han eliminado durante la desinstalación de Avira. * </p> <p> * Nota: Si realmente tiene el programa &quot;Avira Antivirus&quot; instalado en su máquina, desinstálelo usando la opción &quot;Programas y características&quot; en el panel de control y luego proceda a actualizar su sistema a Windows 10 v1803 (o 1809). Después de la actualización, descargue e instale la última versión de Avira Antivirus en su sistema. </p> <h4> Cómo corregir el error de actualización de Windows 10: no se pudo desinstalar Avira AntiVir. </h4> <p> </p> <p> 1. Inicie Windows en <strong> Modo seguro </strong> . Para hacer eso: </p> <ul> <li> <ul> <li> Presione las ventanas <img src=\"images/image_thumb8_thumb_thumb-432.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. </li> <li> Tipo <strong> msconfig </strong> y presione <strong> Ingresar </strong> . </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-47-667.png\" alt=\"msconfig\" loading=\"lazy\"></p> <ul> <li> <ul> <li> A <strong> Bota </strong> pestaña seleccione la <strong> Arranque seguro </strong> opción, luego haga clic en <strong> OK </strong> y reinicie su computadora. </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-48-342.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Después de reiniciar, abra el explorador de archivos y elimine el <strong> avipbb.sys </strong> archivo de las siguientes ubicaciones: </p> <ul> <li> C: \\ Windows \\ System32 \\ drivers </li> <li> C: \\ Windows \\ SysWOW64 \\ drivers </li> </ul> <p> </p> <p> 3. Proceda a eliminar de las ubicaciones anteriores todos los demás archivos nombrados <strong> avipbb </strong> a pesar de su extensión. </p> <p> 4. Luego, elimine el <strong> Avira </strong> carpeta de la siguiente ubicación: </p> <ul> <li> (Windows de 64 bits): C: \\ Archivos de programa (x86) \\ <strong> Avira \\ Antivirus </strong></li> <li> (Windows de 32 bits): C: \\ Archivos de programa \\ <strong> Avira \\ Antivirus </strong></li> </ul> <p> 5. Ejecutar <strong> msconfig </strong> de nuevo. <br> 6. En la pestaña General, haga clic en Inicio normal y haga clic en <strong> OK </strong> , para reiniciar su computadora normalmente. </p> <p><img src=\"images/image_thumb-11-949.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Verifique e instale actualizaciones. * </p> <p> * Nota: Si sigue apareciendo el error &quot;No se pudo desinstalar Avira AntiVir&quot; durante la actualización, descargue y ejecute el <a href=\"https://www.avira.com/en/support-download-avira-registrycleaner/1//\" target=\"_blank\" rel=\"nofollow noopener\"> Limpiador de registro Avira </a> . </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}