{"title":"REVISIÓN: Nombres de usuario duplicados en la pantalla de inicio de sesión después de la actualización de Windows 10.","content":"<p> Este tutorial contiene varios métodos para solucionar el problema de los nombres de usuario duplicados en la pantalla de inicio de sesión después de actualizar Windows 10. Muchos usuarios informan del problema de &quot;nombres de usuario duplicados en la pantalla de inicio de sesión&quot; y se producen después de que se instalan las actualizaciones en Windows 10. </p> <p><img src=\"images/image_thumb-44-494.png\" alt=\"FIX: Duplicate User Names in Sign-in Screen Windows 10\" loading=\"lazy\"></p> <p> Problema en detalles: después de cambiar el nombre de su computadora o después de instalar actualizaciones en Windows 10, el sistema no inicia sesión automáticamente en su cuenta de usuario con el error &quot;el nombre de usuario o la contraseña son incorrectos. Vuelva a intentarlo&quot; y al mismo tiempo aparece su nombre de usuario dos veces en la pantalla de inicio de sesión. </p> <h4> Cómo solucionarlo: la pantalla de inicio de sesión de Windows 10 muestra el mismo usuario dos veces. </h4> <h6> Método 1. Elimine la cuenta duplicada de las opciones de la cuenta de usuario. </h6> <p> El primer método para eliminar los nombres de usuario duplicados de la pantalla de inicio de sesión es eliminar la cuenta duplicada de su PC. </p> <p> 1. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-923.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. En el cuadro &quot;Abrir&quot;, escriba: <strong> controlar userpasswords2 </strong> &amp; haga clic <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-29-663.png\" alt=\"control userpasswords2 \" loading=\"lazy\"></p> <p> 3. En las opciones de Cuentas de usuario, realice las siguientes acciones según su caso: </p> <ul> <li><strong> Caso A. </strong> Si ve dos cuentas con el mismo nombre de usuario: </li> </ul> <blockquote><p> una. Seleccione la cuenta secundaria y haga clic en <strong> Eliminar </strong> . <br> B. Hacer clic <strong> OK </strong> y <strong> Reanudar </strong> tu computador. <br> C. Si después de reiniciar, todavía ve su nombre de usuario dos veces en la pantalla de inicio de sesión, continúe con el Método 2. </p></blockquote> <p><img src=\"images/image_thumb-37-605.png\" alt=\"User Accounts Options\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Caso B. </strong> Si ve solo una cuenta: </li> </ul> <blockquote><p> una. Seleccione la cuenta y haga clic en <strong> Propiedades </strong> . <br> B. Copie el nombre completo y péguelo en el campo Nombre de usuario para que coincida. * <br> C. Hacer clic <strong> OK </strong> y <strong> Reanudar </strong> tu computador. </p></blockquote> <p> * Nota: Si el nombre de usuario y el nombre completo ya coinciden, vaya al método 2. </p> <p><img src=\"images/image_thumb-38-262.png\" alt=\"Remove Duplicate User Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Método 2. Desactive el requisito de contraseña al iniciar sesión. </h6> <p> 1. Siga los pasos 1 y 2 del método anterior para abrir las opciones de &#39;Cuentas de usuario&#39;. <br> 2. <strong> Desmarcar </strong> la <strong> El usuario debe ingresar un nombre de usuario y contraseña para usar esta computadora </strong> y haga clic en <strong> Solicitar </strong></p> <p><img src=\"images/image_thumb-42-373.png\" alt=\"User must enter a user name and password to use this computer \" loading=\"lazy\"></p> <p> </p> <p> 3. Escriba su contraseña (dos veces) y haga clic en <strong> OK </strong> dos veces para cerrar todas las ventanas. </p> <p><img src=\"images/image_thumb-43-970.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. <strong> Reiniciar </strong> tu computadora. Si su nombre de usuario vuelve a aparecer dos veces, continúe con el siguiente método. </p> <h6></h6> <h6> Método 3. Modifique las opciones de inicio de sesión. </h6> <p> </p> <p> 1. Desde el inicio <img src=\"images/image_thumb-39-183.png\" alt=\"image\" loading=\"lazy\"> menú, abrir <strong> Ajustes </strong> <img src=\"images/image_thumb-50-520.png\" alt=\"image\" loading=\"lazy\"> y luego haga clic en <strong> Cuentas </strong> . </p> <p><img src=\"images/image_thumb-43-892.png\" alt=\"How to Add a New User in Windows 10, 8.1.\" loading=\"lazy\"></p> <p> </p> <p> 2. Seleccione <strong> Opciones de inicio de sesión </strong> en el panel izquierdo, y <strong> apagar </strong> la <strong> Usar mi información de inicio de sesión para terminar de configurar mi dispositivo automáticamente y volver a abrir mis aplicaciones después de actualizar o reiniciar </strong> . </p> <p><img src=\"images/image_thumb-40-207.png\" alt=\"Modify Sign in Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Reanudar </strong> tu computador. </p> <p> </p> <h6> Método 4. Cambie a Cuenta local. </h6> <p> El último método para resolver el problema de los &quot;nombres de usuario duplicados&quot; es utilizar una cuenta local para iniciar sesión en Windows 10. Para ello: </p> <p> 1. Desde el inicio <img src=\"images/image_thumb-41-454.png\" alt=\"image\" loading=\"lazy\"> menú, abrir <strong> Ajustes </strong> <img src=\"images/image_thumb-50-790.png\" alt=\"image\" loading=\"lazy\"> y luego haga clic en <strong> Cuentas </strong> . <br> 2. Haga clic en <strong> Correo electrónico y cuentas </strong> en el panel izquierdo. <br> 3. Siguiente clic <strong> En su lugar, inicie sesión con una cuenta local. </strong></p> <p> </p> <p><img src=\"images/image_thumb-37-653.png\" alt=\"sign-in with a local account instead windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Ingrese la contraseña de su cuenta de Microsoft y haga clic en <strong> próximo </strong> . <br> 5. Luego escriba el nombre de usuario, la contraseña (opcional) para la nueva cuenta local y haga clic en <strong> próximo </strong> . <br> 6. Después de reiniciar, escriba su contraseña para iniciar sesión con la nueva cuenta local. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}