{"title":"REVISIÓN: Laptop Dell Inspiron Velocidad lenta de CPU (resuelto)","content":"<p> Este tutorial contiene instrucciones para solucionar el problema de velocidad de CPU muy lenta en una laptop Dell Inspiron 5558. Recientemente, un amigo mío trajo su computadora portátil Dell a mi laboratorio porque de repente se volvió demasiado lenta. De hecho, el portátil funcionaba rápido en el pasado, pero ahora lleva mucho tiempo cargar el sistema operativo (Windows 10) y las aplicaciones. </p> <p> Después de revisar la computadora portátil, y como puede ver en la captura de pantalla a continuación, descubrí que la CPU funciona siempre a 0.48GHz en lugar de 2.20GHz. Entonces, comencé la solución de problemas y finalmente encontré los siguientes dos métodos para resolver el problema de la velocidad lenta de la CPU ... </p> <p> (La velocidad de la CPU se redujo entre un 85 y un 87% en una computadora portátil Dell) </p> <p><img src=\"images/image_thumb-16-354.png\" alt=\"FIX Dell Laptop Slow CPU Speed\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cómo SOLUCIONAR un problema de velocidad lenta de la CPU en una computadora portátil Dell. </h4> <h6> Método 1. Reemplace el adaptador de alimentación de CA. </h6> <p> El problema de la velocidad lenta de la CPU es un problema conocido en las computadoras portátiles Dell, cuando el adaptador de alimentación de CA no se reconoce correctamente en la computadora. En estos casos, e incluso si el adaptador de corriente parece funcionar bien, se muestra el siguiente mensaje de advertencia cuando enciende la computadora portátil &quot;No se puede determinar el tipo de adaptador de corriente CA. Esto impedirá un rendimiento óptimo del sistema&quot;. </p> <p> Por lo tanto, el primer método para resolver su problema de rendimiento lento en su computadora portátil Dell es reemplazar el adaptador de corriente con un nuevo adaptador de corriente de CA compatible de Dell. </p> <p> </p> <h6> Método 2. DETENGA la aceleración de la CPU con ThrottleStop. </h6> <p> Si su adaptador de CA funciona bien y su computadora portátil no se sobrecalienta, * entonces, otro método para solucionar el problema de rendimiento lento del sistema en su computadora portátil Dell es desactivar la limitación del adaptador de energía desconocido, con el <strong><a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"> Acelerador </a></strong> utilidad. Para hacer eso: </p> <p> 1. Descarga el <a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Acelerador </strong></a> utilidad y extraiga el archivo que descargó. <br> 2. Desde la carpeta extraída, haga doble clic para ejecutar la aplicación &quot;ThorttleStop.exe&quot;. * <br> 3. <strong> Desmarcar </strong> la <strong> BD PROCHOT </strong> *** casilla de verificación y luego haga clic en <strong> Ahorrar </strong> . </p> <p> * Notas: <br> 1. Para controlar la temperatura de la CPU, puede utilizar el <a href=\"https://www.alcpu.com/CoreTemp/\" target=\"_blank\" rel=\"nofollow noopener\"> CoreTemp </a> programa. <br> 2. Si recibe el error &quot;No se encontró MFC120U.dll&quot; o &quot;Falta MSVCR120.dll&quot;, después de ejecutar ThrottleStop, proceda e instale el <a title=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" href=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Paquetes redistribuibles de Visual C ++ para Visual Studio 2013 </a> . ( <strong> Importante: </strong> Si posee Windows de 64 bits, debe instalar tanto la versión de 64 bits como la de 32 bits del paquete Visual C ++). <br> 3. BD PROCHOT significa prochot bidireccional. PROCHOT significa procesador en caliente, que es la señal que se activa dentro de la CPU cuando alcanza aproximadamente 100C a 105C dependiendo del número de modelo. Esta señal es lo que inicia la regulación térmica para que la CPU pueda ralentizarse y evitar el sobrecalentamiento. La desactivación de PROCHOT permitirá que su CPU continúe funcionando a toda velocidad. (Fuente: <a href=\"http://forum.notebookreview.com/threads/the-throttlestop-guide.531329/\" target=\"_blank\" rel=\"nofollow noopener\"> La guía ThrottleStop </a> ). </p> <p><img src=\"images/image_thumb-20-666.png\" alt=\"FIX Slow CPU Speed with ThrottleStop\" loading=\"lazy\"></p> <p> 4. Cierre ThrottleStop y listo. Ahora la CPU funcionará a toda velocidad, hasta que reinicie o apague la computadora portátil. * </p> <p> * Nota: debe ejecutar el <strong> Acelerador </strong> programe cada vez que inicie su computadora, si desea ejecutar a la velocidad máxima de la CPU. Para facilitarle la vida, siga los pasos de este <a href=\"https://www.repairwin.com/how-to-start-throttlestop-at-windows-startup/\" target=\"_blank\" rel=\"nofollow noopener\"> guía </a> para iniciar ThrottleStop automáticamente al iniciar Windows. </p> <p><img src=\"images/image_thumb-21-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}