{"title":"REVISIÓN: El archivo no tiene secuencias de audio o video en Adobe Premiere.","content":"<p> Si recibe el error de Adobe Premiere &quot;Fallo en la importación de archivos&quot; con la descripción &quot;El archivo no tiene secuencias de audio o video&quot; puede aparecer al importar un archivo de video MP4, continúe leyendo a continuación. El error &quot;El archivo no tiene secuencias de audio o video&quot; en Adobe Premiere, puede aparecer aunque el video se reproduzca correctamente en cualquier otro reproductor multimedia (VLC, Windows Media Player, etc.). </p> <p><img src=\"images/image_thumb-43-349.png\" alt=\"FIX: File has no audio or video streams on Adobe Premiere\" loading=\"lazy\"></p> <p> </p> <p> Los errores de Adobe Premiere, al importar un archivo de video, pueden aparecer por varias razones, por lo que en este tutorial encontrará todos los métodos disponibles para solucionar el problema. </p> <h4> Cómo solucionarlo: &quot;El archivo no tiene secuencias de audio o video&quot; en Adobe Premiere. </h4> <h6> Método 1. Instale QuickTime. </h6> <p> En primer lugar, asegúrese de haber instalado la última <a href=\"https://support.apple.com/downloads/quicktime\" target=\"_blank\" rel=\"nofollow noopener\"> Tiempo rapido </a> versión en su PC y luego intente importar el archivo mp4 en Adobe Premiere. </p> <p> </p> <h6> Método 2. Cambie el nombre del archivo de vídeo. </h6> <p> 1. Cree una copia del archivo de video mp4 en otra ubicación de su PC. (por ejemplo, en su escritorio) <br> 2. Cambie el nombre del archivo de video de la siguiente manera: </p> <blockquote><p> una. Pon un nombre de archivo más corto en el archivo de video y… <br> B. Elimina cualquier carácter especial de su nombre. (guiones bajos, paréntesis, etc.). </p></blockquote> <p> 3. Abra el archivo de video en Adobe Premiere. </p> <p> </p> <h6> Método 3. Cambie la extensión del nombre de archivo de MP4 a MOV. </h6> <p> El siguiente método para evitar el error de Adobe Premiere &quot;El archivo no tiene secuencias de audio o video&quot; es cambiar la extensión del archivo de video, de .mp4 a .mov (o viceversa). Para hacer eso: </p> <p> 1. En el Explorador de archivos, haga clic en <strong> Vista </strong> -&gt; <strong> Opciones </strong> -&gt; <strong> Cambiar carpeta y opciones de búsqueda </strong> . </p> <p><img src=\"images/image_thumb-45-776.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. En <strong> Vista </strong> pestaña, <strong> claro </strong> el cuadro &quot;Ocultar extensiones para tipos de archivo conocidos&quot; y haga clic en <strong> OK </strong> . * </p> <p> * Nota: Para que esta configuración sea permanente, haga clic en &#39;Aplicar a carpetas&#39;, antes de hacer clic en Aceptar. </p> <p><img src=\"images/image_thumb-46-490.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Ahora, proceda y cambie el nombre / cambie la extensión del archivo de video, de la siguiente manera: </p> <ul> <li> Si el archivo de video está en formato MP4 (.mp4), cambie su extensión a .mov </li> <li> Si el archivo de video está en formato MOV (.mov), cambie su extensión a .mp4 </li> </ul> <p><img src=\"images/image_thumb-47-586.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Finalmente, abra el archivo de video en Adobe Premiere. </p> <p> </p> <p> </p> <h6> Método 4. Borre la base de datos de caché de medios y los archivos de caché. </h6> <p> Cuando importa un archivo multimedia (vídeo o audio) y mientras trabaja con este archivo en Adobe Premiere, el programa crea los archivos de caché multimedia para un rendimiento más rápido. Además, el programa crea enlaces para estos archivos de caché en la base de datos de caché de medios. Durante el tiempo, estos archivos de caché de medios y la base de datos de caché de medios pueden volverse demasiado grandes o dañados y deben limpiarse para evitar problemas. </p> <p> Por lo tanto, el siguiente método para resolver el &quot;Archivo no tiene secuencias de audio o video&quot; en Premiere es limpiar la &quot;Base de datos de caché de medios&quot; y eliminar los archivos de caché. Para hacer eso: * </p> <p><strong> A. Cómo limpiar la base de datos de la caché de medios de Adobe Premiere. </strong></p> <p> 1. Abra Adobe Premiere. <br> 2. Desde el menú, vaya a <strong> Editar </strong> -&gt; <strong> Preferencias </strong> -&gt; <strong> Medios de comunicación. <br> </strong> 3. En Media Cache Database, haga clic en el <strong> Limpio </strong> botón. </p> <p><img src=\"images/image_thumb-48-167.png\" alt=\"Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> 4. <strong> Reanudar </strong> Adobe Premiere e intente abrir el archivo de video. Si el error &quot;El archivo no tiene secuencias de audio o video&quot; persiste, proceda a limpiar los archivos de caché de Adobe Premiere siguiendo las instrucciones a continuación: </p> <p><strong> B. Cómo borrar los archivos de caché de medios de Adobe Premiere. </strong></p> <p> 1. <strong> Abierto </strong> Adobe Premiere. <br> 2. Desde el menú, vaya a <strong> Editar </strong> -&gt; <strong> Preferencias </strong> -&gt; <strong> Medios de comunicación. <br> </strong> 3. En Archivos de caché de medios, haga clic en el <strong> Navegar </strong> o anote la ubicación de los archivos de caché de medios. </p> <p><img src=\"images/image_thumb-49-331.png\" alt=\"FIX: Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Cerca </strong> Adobe Premiere. <br> 5. En el Explorador de archivos, <strong> Eliminar </strong> todo el contenido de la carpeta &quot;Archivos de caché de medios&quot;. <br> 6. Importe el archivo de video en Premiere. </p> <p> </p> <h6> Método 5. Vuelva a codificar el archivo de vídeo. </h6> <p> El método final para resolver el &quot;archivo no tiene secuencias de audio o video&quot; en el proceso de importación de Adobe Premiere es volver a codificar el archivo de video. Para hacer eso: </p> <p> 1. Descarga e instala <a href=\"https://handbrake.fr/downloads.php\" target=\"_blank\" rel=\"nofollow noopener\"> Freno de mano </a> . <br> 2. Abra Handbrake y haga clic en <strong> Archivo: abre un solo archivo de video </strong> . </p> <p><img src=\"images/image_thumb-50-634.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Seleccione el archivo de video que no puede importar en Adobe Premiere y haga clic en <strong> Abierto </strong> . <br> 4. Establezca el formato de salida en <strong> MP4, </strong> y luego haga clic en <strong> Navegar </strong> y especifique la ubicación de la tienda y el nombre de archivo del archivo de video de salida (recodificado). </p> <p><img src=\"images/image_thumb-51-817.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. En <strong> Dimensiones </strong> pestaña, establezca las mismas dimensiones que el archivo de origen. <br> 6. Cuando termine, haga clic en <strong> Inicie la codificación. </strong></p> <p><img src=\"images/image_thumb-52-713.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Cuando se complete el proceso de codificación, cierre Handbrake. <br> 7. Abra el archivo de video recodificado en Adobe Premiere. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}