{"title":"REVISIÓN: El video de YouTube no se carga en Firefox (resuelto)","content":"<p> Si no puede reproducir videos de YouTube con el navegador Mozilla Firefox, lea este tutorial sobre cómo resolver el problema. (El video de YouTube no se carga / no se reproduce en Firefox). </p> <p><img src=\"images/image_thumb-26-287.png\" alt=\"FIX YouTube Video Not Loading on Firefox \" loading=\"lazy\"></p> <h4></h4> <h4> Cómo CORREGIR: Los videos de YouTube no funcionan en Mozilla Firefox. </h4> <p> Cuando los videos de YouTube no se cargan en Firefox, proceda a resolver el problema siguiendo los pasos a continuación. </p> <h6> Paso 1. Verifique si puede ver videos con otro navegador. </h6> <p> El primer paso es determinar si el problema &quot;YouTube no funciona&quot; solo se encuentra en Mozilla Firefox u otros navegadores instalados. Para hacer eso. abra cualquier otro navegador web (por ejemplo, &quot;Internet Explorer&quot;) y compruebe si puede ver videos de YouTube. Si tiene el mismo problema, verifique su conexión a Internet y, si está bien, actualice los controladores en su adaptador de pantalla. Si puede ver videos de YouTube con otro navegador, continúe con el siguiente paso. </p> <p> </p> <h6> Paso 2. Desactive la aceleración de hardware en Firefox. </h6> <p> El siguiente paso para resolver el problema &quot;Los videos de YouTube no se cargan en Firefox&quot; es desactivar la aceleración de hardware en el navegador Firefox. Para hacer eso: </p> <p> 1. Desde el menú de Firefox <img src=\"images/image_thumb-99-998.png\" alt=\"image\" loading=\"lazy\"> escoger <strong> Opciones </strong> . </p> <p><img src=\"images/image_thumb-20-408.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Desplácese hacia abajo y luego debajo de la configuración de Rendimiento. <strong> desmarcar </strong> la &quot; <strong> Utilice la configuración de rendimiento recomendada </strong> &quot;caja y luego <strong> desmarcar </strong> la &#39; <strong> Usar aceleración de hardware cuando este disponible </strong> &quot; caja. </p> <p><img src=\"images/image_thumb-21-429.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Cierre y reinicie Firefox e intente reproducir un video en YouTube. Si el problema persiste, continúe con el paso siguiente. </p> <p> </p> <h6> Paso 3. Borre los datos de navegación (cookies, caché, etc.). </h6> <p> El siguiente paso para resolver el problema &quot;El video de YouTube no se carga&quot; en Firefox es eliminar los datos de navegación. Para ello: </p> <p> 1. Abra Firefox y presione simultáneamente <strong> control </strong> + <strong> Cambiar </strong> + <strong> Borrar. <br> </strong> 2. Elija Todo en la parte superior y luego haga clic en <strong> Despejado ahora. </strong></p> <p><img src=\"images/image_thumb-22-346.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Reanudar </strong> Firefox e intente ver videos de YouTube. </p> <p> </p> <h6> Paso 4. Restablece Firefox a la configuración predeterminada. </h6> <p> A veces, los videos de YouTube no se cargan en Mozilla Firefox debido a una extensión de Firefox dañada. Para evitar el problema, proceda y restablezca Firefox a la configuración predeterminada. Para hacer eso: </p> <p> 1. Desde el menú de Firefox <img src=\"images/image_thumb-99-692.png\" alt=\"image\" loading=\"lazy\"> escoger <strong> Ayudar </strong> &gt; <strong> Información para solucionar problemas </strong> . </p> <p><img src=\"images/image_thumb-23-384.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Haga clic en <strong> Reinicie con los complementos deshabilitados. </strong></p> <p><img src=\"images/image_thumb-24-987.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Después de reiniciar Firefox, intente reproducir un video en YouTube y, según el efecto, realice la acción sugerida: </p> <ul> <li><strong> Caso A. </strong> Si el problema se resuelve y puede ver videos, proceda y desactive uno por uno los complementos (extensiones) instalados hasta que descubra cuál es la causa del problema. </li> <li><strong> Caso B. </strong> Si aún no puede reproducir videos en YouTube, navegue nuevamente a la pantalla &quot;Información de solución de problemas&quot; y haga clic en <strong> Actualizar Firefox </strong> para restablecer el navegador a la configuración predeterminada. </li> </ul> <p><img src=\"images/image_thumb-25-312.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Otras soluciones para resolver el problema &quot;Los videos de YouTube no se abren en Firefox&quot;. </h6> <blockquote><p><strong> 1. </strong> Actualice Mozilla Firefox yendo a: menú de Firefox <img src=\"images/image_thumb-99-394.png\" alt=\"image\" loading=\"lazy\"> &gt; <strong> Ayudar </strong> &gt; <strong> Acerca de Firefox. </strong></p> <p><strong> 2. </strong><a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Revise su computadora en busca de virus, malware, etc. </a></p> <p><strong> 3. </strong> Actualice los controladores del Adaptador de pantalla. </p> <p><strong> 4. </strong> <a href=\"https://www.repairwin.com/how-to-completely-uninstall-firefox-remove-user-data/\" target=\"_blank\" rel=\"nofollow noopener\"> Desinstale y vuelva a instalar completamente Firefox </a> . </p> <p><strong> 5. </strong> Utilice otro navegador web. </p></blockquote> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}