{"title":"REVISIÓN: Adobe Reader DC - Guardar como está en blanco (resuelto)","content":"<p> Después de una actualización automática de Adobe Reader DC, ocurrió el siguiente problema: La función &quot;Guardar como&quot; muestra una ventana en blanco (vacía) que no permite al usuario guardar el documento PDF. </p> <p><img src=\"images/image_thumb-38-290.png\" alt=\"Adobe Reader DC - Save As is blank - fix\" loading=\"lazy\"></p> <p> Este tutorial contiene instrucciones para resolver el siguiente problema: La función &quot;Guardar como&quot; no funciona en Adobe Reader DC en Windows o MAC OS. </p> <h4> Cómo FIX: Guardar como está en blanco en Adobe Reader DC. </h4> <h6> Método 1. Analice su sistema en busca de virus y malware. </h6> <p> El primer paso para resolver el problema de las &quot;carpetas faltantes&quot; en Outlook es asegurarse de que su sistema esté libre de virus / malware. Para esa tarea, siga las instrucciones de esta guía: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo escanear su computadora en busca de virus y otros programas maliciosos. </a></p> <p> </p> <h6> Método 2. Desactive el almacenamiento en línea al guardar archivos. </h6> <p> 1. De Adobe Reader DC <strong> Editar </strong> haga clic en el menú <strong> Preferencias </strong> . </p> <p><img src=\"images/image_thumb-39-749.png\" alt=\"save as not working fix in Adobe Reader DC\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Desmarcar </strong> la <strong> Mostrar almacenamiento en línea al guardar archivos </strong> y haga clic en <strong> está bien. * </strong></p> <p> * Nota: Opcionalmente, desmarque también la función &quot;Mostrar almacenamiento en línea al abrir archivos&quot;. </p> <p><img src=\"images/image_thumb-40-312.png\" alt=\"save as blank - abobe reader DC - fix\" loading=\"lazy\"></p> <p> </p> <p> 3. Ahora intente utilizar la función Guardar como en Adobe DC. El problema debe resolverse. </p> <p> </p> <h6> Método 3. Desinstale y vuelva a instalar Adobe Reader DC. </h6> <p> El método final para resolver las ventanas en blanco en la función &quot;Guardar como&quot; en Adobe DC es desinstalar completamente Adobe Reader DC y luego descargar y reinstalar la última versión del programa desde <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> aquí </a> . </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este tema. </p>"}