{"title":"REVISIÓN: Error de instalación de la actualización de Windows 10 0x800711C7 - 0x2000A (resuelto)","content":"<p> Este tutorial contiene instrucciones para corregir el error de actualización de Windows 10 0x800711C7 - 0x2000A: &quot;La instalación falló en la fase SAFE_OS con un error durante PREPARE_FIRST_BOOT&quot;. </p> <p> </p> <p><img src=\"images/image_thumb-51-797.png\" alt=\"FIX Error 0x800711C7 - 0x2000A installation failed in the SAFE_OS phase during PREPARE_FIRST_BOOT\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Problema de actualización de Windows 10 0x800711C7 - 0x2000A en detalles: Cuando intenta actualizar Windows 10 a la última versión (compilación), la instalación se detiene con el error &quot;No pudimos instalar Windows 10 - 0x800711C7 - 0x2000A - La instalación falló en la fase SAFE_OS un error durante PREPARE_FIRST_BOOT &quot;, y luego vuelve a la versión anterior de Windows. </p> <h4> Cómo reparar el error de instalación de la actualización de Windows 10 v1809 0x800711C7 - 0x2000A </h4> <p> </p> <h6> Método 1. Desactive Device Guard de PowerShell. </h6> <p> El error 0x800711C7 - 0x2000A en la actualización de Windows 10, aparece en sistemas con el &quot; <a href=\"https://techcommunity.microsoft.com/t5/iis-support-blog/windows-10-device-guard-and-credential-guard-demystified/ba-p/376419\" target=\"_blank\" rel=\"nofollow noopener\"> Guardia del dispositivo </a> &quot;habilitado. Por lo tanto, el primer método para resolver el error 0x800711C7 - 0x2000A en la actualización de Windows 10 es deshabilitar Device Guard en su sistema. </p> <p> 1. Continúe y descargue el <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=53337\" target=\"_blank\" rel=\"nofollow noopener\"> Herramienta de preparación de hardware Device Guard y Credential Guard </a> de Microsoft. <br> 2. Cuando se complete la descarga, extraiga el archivo &quot;dgreadiness&quot; _v3.6.zip. <br> 3. Abra la carpeta extraída y en el menú Archivo elija Abrir Windows PowerShell como administrador. </p> <p><img src=\"images/image_thumb-52-765.png\" alt=\"FIX Error 0x800711C7 - 0x2000A Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. En PowerShell, escriba el siguiente comando para <strong> permitir (establecer) la política de ejecución para ejecutar scripts </strong> (Prensa <strong> A </strong> cuando se le solicite cambiar la política de ejecución). </p> <ul> <li> Set-ExecutionPolicy sin restricciones </li> </ul> <p> 5. Luego dé este comando a <strong> desactivar </strong> la <strong> Guardia del dispositivo </strong> y el <strong> Guardia de credenciales </strong> : </p> <ul> <li> . \\ DG_Readiness_Tool_v3.6 -Desactivar </li> </ul> <p><img src=\"images/image_thumb-53-648.png\" alt=\"Disable Device Guard and Credential Guard Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Después de la ejecución del comando, <strong> reiniciar </strong> el ordenador. <br> 7. Intente actualizar Windows 10. * </p> <p> * Nota: Después de actualizar Windows 10, siga el mismo procedimiento para habilitar Device Guard y Credential Guard, con estos comandos: </p> <ul> <li> Set-ExecutionPolicy sin restricciones </li> <li> . \\ DG_Readiness_Tool_v3.6 -Enable </li> </ul> <p> </p> <h6> Método 2. Deshabilite Hyper-V desde el símbolo del sistema. </h6> <p> El siguiente método para resolver el error 0x800711C7 - 0x2000A en la actualización de Windows 10 es deshabilitar el hipervisor en el arranque de Windows. </p> <p> 1. Abrir <strong> símbolo del sistema como administrador </strong> . <br> 2. Escriba el siguiente comando para deshabilitar Hyper-V al iniciar Windows. </p> <ul> <li> bcdedit / establecer hypervisorlaunchtype off </li> </ul> <p><img src=\"images/image_thumb-50-768.png\" alt=\"Disable Hyper-V Command Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Reiniciar </strong> tu computador. <br> 4. Intente instalar la actualización. * </p> <p> * Nota: Después de actualizar Windows 10, dé el siguiente comando para iniciar automáticamente Hypervisor cuando se inicie la computadora: </p> <ul> <li> bcdedit / set hypervisorlaunchtype auto </li> </ul> <p> </p> <h6> Método 3. Desactive el arranque seguro desde la configuración del BIOS. </h6> <p> Otra causa del error de actualización de Windows 10 0x800711C7 - 0x2000A es el arranque seguro. Entonces, proceda y desactive el Arranque seguro desde la configuración del BIOS. Para hacer eso: </p> <p> 1. Encienda su sistema y presione inmediatamente la tecla correspondiente * para ingresar <strong> CONFIGURACIÓN DEL BIOS. </strong></p> <p> </p> <p> * Nota: Por lo general, para ingresar en BIOS, debe presionar el <strong> DEL </strong> o <strong> F1 </strong> o <strong> F2 </strong> o el <strong> F10 </strong> clave. (depende del fabricante) </p> <p> 2. Mira <strong> Seguridad </strong> o en <strong> Opciones de arranque, </strong> o en <strong> Autenticación </strong> configuración, * para encontrar la <strong> Arranque seguro </strong> opción y <strong> Desactivar </strong> eso <strong> . </strong></p> <p> * Notas: <br> 1. La ubicación de la configuración de &#39;Arranque seguro&#39; en BIOS depende del fabricante del dispositivo. <br> 2. Si no puede encontrar la configuración de &#39;Arranque seguro&#39;, entonces <strong> Desactivar </strong> la <strong> Soporte CSM </strong> y entonces <strong> Guardar y Salir </strong> formar la configuración del BIOS. Luego, ingrese nuevamente a la configuración del BIOS para encontrar el Arranque seguro. </p> <p><img src=\"images/image_thumb-23-385.png\" alt=\"Disable Secure Boot\" loading=\"lazy\"></p> <p> 3. <strong> Ahorrar </strong> ajustes y <strong> SALIDA </strong> Configuración del BIOS. <br> 4. Deje que Windows se inicie normalmente e intente instalar la actualización. Si la actualización falla nuevamente, vuelva a habilitar el &#39;Arranque seguro&#39; y continúe con el siguiente método. </p> <p> </p> <h6> Método 4. Actualice Windows 10 utilizando el Asistente de actualización </h6> <p> 1. Navega a <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Sitio de descarga de Windows 10 </a> y haga clic en el <strong> Actualizar ahora </strong> botón. </p> <p><img src=\"images/image_thumb_thumb-680.png\" alt=\"Update Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Guarde el archivo &quot;Windows10Upgrade9252.exe&quot; en su escritorio. <br> 3. Haga doble clic en el archivo descargado para abrir el <strong> Asistente de actualización de Windows </strong> . <br> 4. Haga clic en <strong> Actualizar ahora </strong> para iniciar la actualización. </p> <p><img src=\"images/image_thumb4_thumb-918.png\" alt=\"Windows 10 Update Assistant\" loading=\"lazy\"></p> <p> 5. Deje que Windows termine la descarga y la verificación. <br> 6. Cuando la verificación llega al 100%, <strong> desconecta tu computadora de Internet </strong> o configúrelo en &quot; <strong> Modo avión </strong> &quot;. <br> 7. Espere hasta que Windows actualice su sistema. <br> 8. Cuando se le solicite, reinicie su sistema para instalar la actualización. </p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}