{"title":"REVISIÓN: Su computadora no pudo conectarse a otra sesión de consola porque ya tiene una sesión de consola en progreso. (Resuelto)","content":"<p> En una computadora con Windows, aparece el siguiente error en Conexión a Escritorio remoto: &quot;Su computadora no pudo conectarse a la sesión de consola en la computadora remota porque ya tiene una sesión de consola en progreso&quot;. </p> <p> </p> <p><img src=\"images/image_thumb-3-627.png\" alt=\"Your computer could no connect to console session on the remote computer because you already have a console session in progress.\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contiene instrucciones para resolver el siguiente error de Conexión a Escritorio remoto: &quot;Su computadora no pudo conectarse a la sesión de consola en la computadora remota porque ya tiene una sesión de consola en progreso&quot;. </p> <h4> Cómo CORREGIR: No se pudo conectar la conexión a escritorio remoto porque ya tiene una sesión de consola en curso. </h4> <p> El error &quot;Su computadora no pudo conectarse a la sesión de consola en la computadora remota porque ya tiene una sesión de consola en curso&quot;, se debe a que uno de los adaptadores de red en su computadora (RDP de), tiene la misma dirección IP que la computadora al que está intentando conectarse, a través del escritorio remoto. </p> <p> Por ejemplo: si la computadora remota tiene la dirección IP: &quot;192.168.1.157&quot;, siga los pasos a continuación: </p> <p> 1. Abrir <strong> Símbolo del sistema como administrador </strong> en su computadora (RDP desde). <br> 2. Dé el siguiente comando para ver las direcciones IPv4 asignadas en su PC. </p> <ul> <li><strong> ipconfig </strong></li> </ul> <p> </p> <p> 3. Ahora localice qué adaptador de red en su computadora local (RDP desde), tiene la misma dirección IP que la computadora remota (RDP a). <br> 4. Cuando encuentre qué adaptador LAN en su computadora local tiene la misma dirección IP que la computadora remota, proceda y cambie la dirección IP en ese adaptador por una diferente. * </p> <p> p.ej. En este ejemplo, la IP de la computadora remota es: &quot;192.168.1.157&quot;, por lo que debemos cambiar la dirección IP del adaptador Ethernet (en la computadora local) a una diferente: p. Ej. a: &quot;192.168.1.160&quot;. </p> <p><img src=\"images/image_thumb-5-946.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> * Nota: Si la dirección IP en su red local es asignada por un servidor DHCP, entonces tiene las siguientes opciones para evitar el problema: </p> <blockquote><p> una. Para especificar manualmente una dirección IP estática diferente. <br> B. Para reiniciar su enrutador (servidor DHCP), para &quot;tomar&quot; una dirección IP diferente del servidor DHCP. <br> C. Para configurar el servidor DHCP (por ejemplo, en el enrutador), para dar direcciones IP a un rango que no incluye la dirección IP de la computadora remota. (por ejemplo, &quot;192.168.1.200-192.168.1.250&quot; </p></blockquote> <p> </p> <p> 5. Después de cambiar la dirección IP en su computadora local (RDP desde), abra la conexión de Escritorio remoto e intente conectarse a la computadora remota. Se debe solucionar el error &quot;Tu computadora no pudo conectarse a otra sesión de consola porque ya tienes una sesión de consola en progreso&quot;. </p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? </p> <p> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}