{"title":"REVISIÓN: Monitor PNP genérico en Windows 10 (resuelto)","content":"<p> El problema del monitor PNP genérico en Windows 10 se produce porque el sistema no reconoce correctamente el monitor conectado. El problema del &quot;Monitor PNP genérico&quot; aparece en computadoras de escritorio o cuando está usando un monitor externo con su computadora portátil, y se debe a una de las siguientes tres (3) razones: </p> <ol> <li> <ol> <li> <p> El controlador del adaptador de pantalla (VGA) es incorrecto o no está instalado. </p> </li> <li> <p> El controlador del monitor no está instalado correctamente. </p> </li> <li> <p> El cable de video tiene un problema. </p> </li> </ol> </li> </ol> <p><img src=\"images/image_thumb-71-767.png\" alt=\"FIX Generic PNP Monitor on Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contiene instrucciones paso a paso sobre cómo resolver el problema del &#39;Monitor PNP genérico&#39; en Windows 10. </p> <h4> Cómo REPARAR: Monitor PNP genérico en Windows 10. </h4> <h6> Método 1. Instale todas las actualizaciones de Windows 10 disponibles. </h6> <p> Si el problema del monitor PNP genérico aparece después de instalar o después de actualizar Windows 10, proceda e instale todas las actualizaciones disponibles. Para hacer eso, </p> <p> 1. Ir a <strong> Comienzo <img src=\"images/image_thumb-55-849.png\" alt=\"image\" loading=\"lazy\"> -&gt; Configuración </strong> -&gt; <strong> Actualización y seguridad -&gt; </strong> y haga clic en <strong> Busque actualizaciones. </strong></p> <p><img src=\"images/image_thumb-76-951.png\" alt=\"Windows 10 - Check For Updates \" loading=\"lazy\"></p> <p> 2. Descargue e instale todas las actualizaciones de Windows y luego <strong> Reanudar </strong> tu computador. </p> <h6><br clear=\"all\"> Método 2. Instalar o revertir los controladores del adaptador de pantalla. </h6> <p> El segundo paso para solucionar el problema del monitor PNP genérico es instalar (o revertir) los controladores del adaptador gráfico. Para hacer eso: </p> <p> 1. Abrir <strong> Administrador de dispositivos </strong> . Para hacer eso: </p> <ol> <li> <ol> <li> Presione Windows <img src=\"images/image_thumb8_thumb_thumb-458.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. </li> <li> En el cuadro &quot;Abrir&quot;, escriba: <strong> devmgmt.msc </strong> &amp; haga clic <strong> OK </strong> . </li> </ol> </li> </ol> <blockquote> <p><img src=\"images/image_thumb-5-538.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. En el Administrador de dispositivos, expanda el <strong> Adaptadores de pantalla. <br> </strong> 3. Ahora realice la acción correspondiente, según su caso: </p> <p><strong> Caso A. </strong> Si el adaptador de pantalla instalado aparece como &quot; <strong> Adaptador de pantalla básico de Microsoft </strong> &quot;(como en la captura de pantalla a continuación), esto significa que los controladores de su tarjeta gráfica no están instalados. </p> <p><img src=\"images/image_thumb-61-521.png\" alt=\"image\" loading=\"lazy\"></p> <p> En este caso, para solucionar el problema del &#39;Monitor PNP genérico&#39;: </p> <blockquote> <p> una. <strong> Botón derecho del ratón </strong> sobre el <strong> Adaptador de pantalla básico de Microsoft </strong> y seleccione <strong> Actualizar controlador. </strong></p> </blockquote> <p><img src=\"images/image_thumb-62-511.png\" alt=\"image\" loading=\"lazy\"></p> <blockquote> <p> B. En la siguiente pantalla, haga clic en <strong> Buscar conductores automáticamente </strong> y deje que Windows descargue e instale los controladores para el dispositivo de visualización. * </p> </blockquote> <p><img src=\"images/image_thumb-69-707.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Nota: Si Windows no puede encontrar un controlador diferente para su adaptador de gráficos, navegue al sitio de soporte del fabricante de su computadora (o tarjeta gráfica) y descargue e instale los controladores más recientes para su tarjeta gráfica. </p> <ul> <li> <ul> <li> Para <strong> NVIDIA </strong> basadas en GPU, navegue hasta <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Página de búsqueda avanzada de controladores de NVIDIA </a> . </li> <li> Para <strong> AMD </strong> basadas en GPU, navegue hasta <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Centro de descarga de controladores AMD (ATI). </a></li> <li> Para <strong> Intel </strong> basadas en GPU, navegue hasta <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Centro de descarga de gráficos Intel. </a></li> </ul> </li> </ul> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/07/image-56.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p><strong> Caso B. </strong> Si ve que su adaptador de gráficos se reconoce correctamente desde Windows 10, es probable que el controlador de gráficos instalado sea incorrecto. </p> <p> En este caso, proceda e instale los controladores más recientes para su tarjeta gráfica desde el sitio de soporte del fabricante o, si aparece el problema &quot;Generic PNP Monitor&quot; después de una actualización de Windows 10, continúe y deshaga los controladores de video. </p> <p> Para revertir los controladores de gráficos: </p> <blockquote> <p> una. Haga clic con el botón derecho en el adaptador de pantalla instalado y haga clic en <strong> Propiedades. </strong></p> </blockquote> <p><img src=\"images/image_thumb-64-665.png\" alt=\"image\" loading=\"lazy\"></p> <blockquote> <p> B. Selecciona el <strong> Conductor </strong> pestaña y luego haga clic en <strong> Controlador de retroceso </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-58-555.png\" alt=\"Roll Back Driver\" loading=\"lazy\"></p> <blockquote><p> C. Seleccione un motivo para la reversión del paquete de controladores y haga clic en <strong> Si. </strong></p></blockquote> <p><img src=\"images/image_thumb-19-797.png\" alt=\"image\" loading=\"lazy\"></p> <blockquote><p> D. Cuando se completa la reversión del controlador, <strong> Reanudar </strong> tu computadora. </p></blockquote> <h6> Método 3. Desinstale el dispositivo de monitor PNP genérico y vuelva a conectar el monitor. </h6> <p> 1. Navega a <strong> Administrador de dispositivos </strong> . <br> 2. Expandir <strong> Monitores. </strong><br> 3. <strong> Botón derecho del ratón </strong> a <strong> Monitor PnP genérico </strong> y seleccione <strong> Desinstalar dispositivo. </strong></p> <p><img src=\"images/image_thumb-59-687.png\" alt=\"Generic PNP Monitor\" loading=\"lazy\"></p> <p> </p> <p> 4. Haga clic en <strong> Desinstalar </strong> para confirmar su decisión. </p> <p><img src=\"images/image_thumb-60-394.png\" alt=\"Unisntall Generic PNP Monitor\" loading=\"lazy\"></p> <p> 5. <strong> Cerrar </strong> tu computadora. <br> 6. <strong> Apagar </strong> tu <strong> monitor </strong> y <strong> quitar su cable de alimentación </strong> del enchufe. <br> 7. <strong> Desconectar </strong> la <strong> cable de video </strong> desde la computadora. <br> 8. Deje los cables desenchufados durante 2-3 minutos y luego vuelva a conectar todos los cables. <br> 9. Encienda su PC y verifique si el problema está resuelto. </p> <h6><br clear=\"all\"> Método 4. Instale el controlador de monitor genérico que no es PNP. </h6> <p> 1. Navega a <strong> Administrador de dispositivos </strong> . <br> 2. Expandir <strong> Monitores. <br> </strong> 3. <strong> Botón derecho del ratón </strong> en <strong> Monitor PNP genérico </strong> y seleccione <strong> Actualizar controlador. </strong></p> <p><img src=\"images/image_thumb-65-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Haga clic en <strong> Busque controladores en mi computadora. </strong></p> <p><img src=\"images/image_thumb-66-706.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Seleccione <strong> Permítame elegir de una lista de controladores disponibles en mi computadora </strong> . </p> <p><img src=\"images/image_thumb-67-249.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Cheque </strong> la <strong> Mostrar hardware compatible </strong> casilla de verificación y seleccione e instale uno de los otros controladores compatibles, o el controlador &#39;Generic Non-PNP Monitor&#39;. </p> <p><img src=\"images/image_thumb-68-287.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Método 5. Pruebe con otro cable de video. </h6> <p> El método final para resolver el problema del &#39;Monitor PNP genérico&#39; en Windows 10 es conectar su PC con su monitor con un cable diferente. Para hacer eso: </p> <p> * Nota: Este método se aplica solo a computadoras de escritorio o cuando usa un monitor externo con su computadora portátil. </p> <p> 1. <strong> Cerrar </strong> tu computador. <br> 2. <strong> Reemplazar </strong> la <strong> cable de video </strong> con uno similar, pero de un fabricante diferente. <br> 3. <strong> Encendido </strong> tu computador. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}