{"title":"REVISIÓN: No se puede iniciar sesión en las aplicaciones de escritorio de Office: la ventana de credenciales no aparece (resuelto)","content":"<p> Hace unos días, solucioné el siguiente problema en una computadora con Windows 10 que ejecuta Microsoft Office: el usuario no puede iniciar sesión en ninguna aplicación de Office (Word, Outlook, etc.), porque el sistema nunca muestra la ventana de credenciales para ingresar a Office 365 contraseña. Por lo tanto, si no puede iniciar sesión en las aplicaciones de escritorio de Office, porque el cuadro de contraseña nunca aparece, continúe leyendo a continuación. </p> <p> Descripción del problema: después de abrir cualquier aplicación de escritorio de Office (Word, Excel, etc.), el sistema le solicita que inicie sesión con las credenciales de su cuenta de Microsoft. Sin embargo, después de ingresar su nombre de usuario, la ventana de inicio de sesión se cierra y la solicitud de contraseña nunca se muestra. Como resultado de eso, no puede usar la aplicación de Office o enfrenta otros problemas. El problema mencionado puede aparecer en Microsoft Office 2013 y Office 2016. </p> <p> Este tutorial contiene instrucciones para resolver el siguiente problema en Windows 10: No se puede iniciar sesión en las aplicaciones de escritorio de Microsoft Office, utilizando las credenciales de Office 365, porque la ventana de credenciales no aparece. </p> <h4> Cómo CORREGIR: No se puede iniciar sesión con su cuenta de MS en ninguna aplicación de escritorio de Office. (Oficina 2013/2016/2019). </h4> <h6> Método 1. Elimine las credenciales de Office almacenadas del Panel de control. </h6> <p> El primer método para resolver el problema de inicio de sesión en las aplicaciones de escritorio de Office es eliminar las credenciales de Microsoft almacenadas en su PC. Para hacer eso: </p> <p> 1. Cierre todos los programas de Office. <br> 2. Navega a Windows <strong> Panel de control </strong> y abre el <strong> Administrador de Credenciales </strong> . </p> <p><img src=\"images/image_thumb-23-297.png\" alt=\"Control Panel - Credential Manager\" loading=\"lazy\"></p> <p> 3. En <strong> Credenciales de Windows </strong> , elimine las credenciales de Microsoft Office. </p> <p><img src=\"images/image_thumb-24-389.png\" alt=\"Remove Office Credentials\" loading=\"lazy\"></p> <p> </p> <p> 4. Abra cualquier aplicación de Office e intente iniciar sesión con su cuenta de Microsoft nuevamente. Si aún no puede iniciar sesión en su cuenta, aplique los pasos del método 2 a continuación. </p> <p> </p> <h6> Método 2. Desactive la autenticación moderna. </h6> <p> El segundo método, para resolver el problema de inicio de sesión en las aplicaciones de Office, es deshabilitar la autenticación moderna en Office. Para hacer eso: </p> <p> 1. Abra el Editor del registro y navegue hasta esta clave: </p> <ul> <li> HKEY_CURRENT_USER \\ Software \\ Microsoft \\ Office \\ 16.0 \\ Common \\ Identity </li> </ul> <p> 2. En el panel derecho, compruebe si puede ver un valor con nombre: <strong> EnableADAL. </strong> Si no entonces… </p> <blockquote> <p> una. Haga clic con el botón derecho en un espacio vacío y seleccione <strong> Nuevo </strong> &gt; <strong> Valor DWORD (32 bits). </strong></p> </blockquote> <p><img src=\"images/image_thumb-25-384.png\" alt=\"Disable Modern Authentication\" loading=\"lazy\"></p> <p> </p> <blockquote><p> B. Nombra el nuevo valor: <strong> HabilitarADAL </strong> y presione <strong> Ingresar. </strong></p></blockquote> <p><img src=\"images/image_thumb-26-875.png\" alt=\"Turn Off Modern Authentication\" loading=\"lazy\"></p> <p> 3. Haga doble clic en el <strong> HabilitarADAL </strong> valor, establezca los datos del valor en <strong>0 </strong> y haga clic en <strong> está bien. </strong></p> <p><img src=\"images/image_thumb-27-612.png\" alt=\"EnableADAL \" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Cerca </strong> el Editor del Registro y <strong> Reanudar </strong> la PC. <br> 5. Abra cualquier aplicación de Office e intente iniciar sesión nuevamente. </p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}