{"title":"REVISIÓN: Error de actualización de Windows 10 0XC1900101 - 0x20017. Error de instalación en la fase SAFE_OS durante la operación BOOT.","content":"<p> </p><div id=\"body\" class=\"clearfix\"> <div id=\"layout\" class=\"pagewidth clearfix\"> <div id=\"content\" class=\"clearfix\"> <div id=\"loops-wrapper\" class=\"loops-wrapper sidebar1 list-thumb-image\"> <div class=\"post-content\"> <div class=\"entry-content\"> <div id=\"8817bc62-7927-473e-ae46-7000d673a519\" class=\"postBody\"> <p> Este tutorial contiene instrucciones para corregir el error de actualización de Windows 10 0XC1900101 - 0x20017: &quot;La instalación falló en la fase SAFE_OS con un error durante la operación de arranque&quot;. El error 0XC1900101 - 0x20017 puede aparecer al actualizar Windows 10 a la última versión, o cuando actualiza su sistema de Windows 7 u 8 a Windows 10. Cuando ocurre el error, la actualización se detiene y luego el sistema vuelve a la versión anterior de Windows. </p> </div> </div> </div> </div> </div> </div> </div>  <p><img src=\"images/image_thumb-68-870.png\" alt=\"fix Windows 10 Update Error 0XC1900101 – 0x20017\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cómo corregir el error de actualización de Windows 10 0XC1900101 - 0x20017 &quot;La instalación falló en la fase SAFE_OS con un error durante la operación de ARRANQUE&quot; </h4> <p> Por lo general, el error de actualización 0XC1900101 - 0x20017 en Windows 10 indica un problema con los controladores del dispositivo y, en la mayoría de los casos, con los controladores del adaptador de red. Por lo tanto, antes de continuar aplicando los métodos a continuación, verifique e intente lo siguiente: </p> <p> 1. En primer lugar, asegúrese de que la configuración de Fecha y hora sea correcta. <br> 2. Luego, asegúrese de tener suficiente espacio libre. Su dispositivo requiere al menos 20 GB de espacio libre para actualizar un sistema operativo de 32 bits o 32 GB para un sistema operativo de 64 bits. Para liberar espacio en disco, use <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Limpieza de disco </a> . <br> 3. Instale los controladores más recientes para todos los dispositivos de su sistema, especialmente para el adaptador Ethernet e inalámbrico (si corresponde). * <br> 4. Desinstale temporalmente cualquier software de seguridad que no sea de Microsoft (antivirus, cortafuegos). <br> 5. Desactive el cifrado del disco duro (si está habilitado). <br> 6. Después del primer reinicio del sistema y antes del inicio de Windows: </p> <p> </p><div id=\"body\" class=\"clearfix\"> <div id=\"layout\" class=\"pagewidth clearfix\"> <div id=\"content\" class=\"clearfix\"> <div id=\"loops-wrapper\" class=\"loops-wrapper sidebar1 list-thumb-image\"> <div class=\"post-content\"> <div class=\"entry-content\"> <div id=\"8817bc62-7927-473e-ae46-7000d673a519\" class=\"postBody\"> <blockquote><p> una. Desconecte todos los dispositivos externos que no sean necesarios durante la instalación (por ejemplo, unidades USB, impresoras, etc.). <br> B. Desactive el adaptador inalámbrico y Bluetooth desde la configuración del BIOS. </p></blockquote> <p><strong> * Nota: </strong> Si después de aplicar todas las sugerencias anteriores y los métodos a continuación, la instalación de la actualización de Windows 10 aún falla, continúe y actualice también el BIOS (firmware) en su sistema. </p> </div> </div> </div> </div> </div> </div> </div>  <p> </p> <h6> Método 1. <strong> Deshabilite el arranque seguro. </strong></h6> <p> 1. Encienda su sistema y presione la tecla correspondiente * para ingresar <strong> CONFIGURACIÓN DEL BIOS. </strong></p> <p> * Nota: Por lo general, para ingresar en BIOS, debe presionar el <strong> DEL </strong> o <strong> F1 </strong> o <strong> F2 </strong> o <strong> F10 </strong> clave. (depende del fabricante) </p> <p> 2. Mira <strong> Seguridad </strong> o en <strong> Opciones de arranque </strong> configuración, * para encontrar la <strong> Arranque seguro </strong> opción y <strong> Desactivar </strong> eso <strong> . </strong></p> <p> * Nota: La ubicación de la configuración de &#39;Arranque seguro&#39; en BIOS, depende del fabricante del dispositivo. </p> <p> 3. <strong> Ahorrar </strong> ajustes y <strong> SALIDA </strong> Configuración del BIOS. <br> 4. Deje que Windows se inicie normalmente e intente instalar la actualización. Si la actualización falla nuevamente, continúe con el siguiente método. </p> <h6></h6> <h6> Método 2. Ejecute el solucionador de problemas de Windows Update. </h6> <p> El primer método para corregir el error de actualización de Windows 10 0XC1900101 - 0x20017 es ejecutar el Solucionador de problemas de Windows Update. </p> <p> 1. Navega a Windows <strong> Panel de control </strong> , establezca &quot;Ver por&quot; en <strong> Iconos pequeños </strong> y abrir <strong> Solución de problemas. </strong></p> <p><img src=\"images/image_thumb-5-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. En las opciones de solución de problemas, haga clic en <strong> Solucione problemas con Windows Update. </strong></p> <p><img src=\"images/image_thumb-9-899.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Haga clic en <strong> próximo </strong> para solucionar problemas de actualización de Windows. </p> <p><img src=\"images/image_thumb-8-236.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Cuando se complete el proceso de solución de problemas, <strong> cerca </strong> el solucionador de problemas y <strong> Reanudar </strong> tu computador. <br> 6. Busque actualizaciones. </p> <h6></h6> <h6> Método 3. <strong> Elimine la carpeta de distribución de software. </strong></h6> <p> &quot;C: \\ Windows \\ SoftwareDistribution&quot;, es la ubicación donde Windows almacena las actualizaciones de Windows. Muchas veces, esta carpeta se daña y debe volver a crearla para descargar actualizaciones e instalarlas desde cero. Para reconstruir (volver a crear) la carpeta &quot;SoftwareDistribution&quot;, siga los pasos a continuación: </p> <p><strong> Paso 1: Detenga el servicio de actualización de Windows. </strong></p> <p> 1. Abra el panel de control de Servicios de Windows: Para ello: </p> <ul> <li> Presione Windows <img src=\"images/image_thumb8_thumb_thumb-515.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. </li> <li> En el cuadro de búsqueda, escriba: <strong><em> services.msc </em></strong> &amp; haga clic <strong> OK </strong> . </li> <li> (Acepte la advertencia de UAC si aparece). </li> </ul> <p><img src=\"images/image_thumb-12-902.png\" alt=\"services\" loading=\"lazy\"></p> <p> 2. En el panel de control de Servicios, ubique el <strong><em> actualizacion de Windows </em></strong> Servicio. <br> 3. Haga clic derecho en <strong> actualizacion de Windows </strong> servicio y seleccione &quot; <strong> Detener </strong> ”. </p> <p><img src=\"images/image_thumb-9-281.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Paso 2: Elimine la carpeta SoftwareDistribution. </strong></p> <p> 1. Abra el Explorador de Windows y navegue hasta: <strong> C: \\ Windows </strong> carpeta. <br> 2. Encuentra y <strong> Borrar </strong> la &quot; <strong><em> Distribución de software </em></strong> &quot;(O cámbiele el nombre, por ejemplo, a&quot; SoftwareDistributionOLD &quot;). </p> <p><img src=\"images/image_thumb-10-498.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p><strong> Paso 3: inicie el servicio de actualización de Windows. </strong></p> <p> 1. Abra el panel de control de Servicios de Windows. <br> 2. Haga clic derecho en <strong> actualizacion de Windows </strong> servicio y seleccione &quot; <strong> Comienzo </strong> ”. </p> <p><img src=\"images/image_thumb-11-792.png\" alt=\"start windows update service\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Paso 4: Verifique e instale la actualización de Windows 10. </strong></p> <p> 1. Navega a <strong> Ajustes </strong> -&gt; <strong> Actualización y seguridad </strong> y haga clic en <strong> Buscar actualizaciones </strong> . </p> <p> </p> <h6> Método 4. Desactive la tecnología de virtualización Intel. </h6> <p> En algunos casos, aparece el error de actualización de Windows 10 0XC1900101 - 0x20017 si la tecnología virtual Intel está habilitada en su sistema. Entonces, proceda y desactive la tecnología Intel_VT desde la configuración de Bios. Para hacer eso: </p> <p> 1. Ingrese a la configuración del BIOS. <br> 2. <strong> Desactivar </strong> la <strong> Intel </strong> <strong> VT-d </strong> características en <strong> Avanzado </strong> configuración -&gt; <strong> Chipset </strong> . <br> 3. <strong> Guardar y Salir </strong> desde la configuración del BIOS. <br> 4. Intente instalar la actualización. </p> <p> </p> <h6> Método 5. Reparar Windows 10. </h6> <p> El último método para resolver los problemas de instalación de Windows 10 Update es <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> reparar Windows 10 con actualización local </a> . </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}