{"title":"REVISIÓN: La opción Instalar VMware Tools está atenuada. (Resuelto)","content":"<p> Si no puede instalar VMware Tools en el invitado en funcionamiento porque la opción &quot;Instalar VMware Tools&quot; está atenuada, continúe leyendo a continuación. VMware Tools es un conjunto gratuito de servicios y módulos que habilitan varias funciones en la máquina virtual invitada, como un rendimiento gráfico más rápido, un rendimiento mejorado del mouse y lo más importante: la capacidad de copiar y pegar entre el host y la máquina invitada. Por lo tanto, aunque el sistema operativo invitado puede ejecutarse sin VMware Tools, es necesario instalar las herramientas de VMware si desea habilitar las funciones adicionales de VMware. </p> <p> La forma habitual de instalar VMware Tools es iniciar la máquina invitada y luego en el menú &quot;Reproductor&quot; elegir <strong> Gestionar </strong> &gt; <strong> Instalar VMware Tools </strong> . Pero, si conectó la unidad de CD / DVD virtual de la máquina virtual a un archivo de imagen ISO cuando instaló el sistema operativo, la opción &quot;Instalar VMware Tools&quot; aparece atenuada. </p> <p><img src=\"images/image_thumb-45-164.png\" alt=\"FIX VMware Tools option is Grayed Out\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contiene instrucciones para solucionar el siguiente problema en VMware Workstation Player. La opción &quot;Instalar VMware Tools&quot; está atenuada en la máquina invitada. </p> <h4> Cómo instalar VMware Tools si la opción &#39;Instalar VMware Tools&#39; está atenuada. </h4> <p> </p> <p> 1. Apague la máquina virtual. <br> 2. Haga clic derecho en la máquina virtual y seleccione <strong> Ajustes </strong> . </p> <p><img src=\"images/image_thumb-39-377.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Seleccione el <strong> CD / DVD </strong> conducir y luego haga clic en <strong> Eliminar </strong> . </p> <p><img src=\"images/image_thumb-43-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Luego seleccione el <strong> Flexible </strong> conducir, haga clic en <strong> Eliminar </strong> y luego haga clic en <strong> OK </strong> para cerrar las opciones de configuración. </p> <p><img src=\"images/image_thumb-44-469.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Comienzo </strong> la máquina virtual. <br> 6. En el menú &quot;Reproductor&quot;, seleccione <strong> Gestionar </strong> y haga clic en <strong> Instale VMware Tools. </strong></p> <p><img src=\"images/image_thumb-42-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}