{"title":"REVISIÓN: La barra de columnas de Outlook (barra de encabezado) desaparece en Outlook 2016/2019. (Resuelto)","content":"<p> Hace unos días, uno de mis clientes se puso en contacto conmigo para informarme que faltaba la barra con los títulos de las columnas (Enviar, De, Asunto, Recibido, Tamaño, etc.) en Outlook 2019. Más específicamente, la fila con el Los encabezados de las columnas han desaparecido después de que el usuario personalizara la &#39;Configuración de vista&#39; y aumentara el tamaño de fuente de la FILA. </p> <p><img src=\"images/image_thumb-567.png\" alt=\"FIX: Outlook Columns Bar (Header Bar) Disappear in Outlook 2016/2019\" loading=\"lazy\"></p> <p> Este tutorial contiene instrucciones sobre cómo solucionar el problema &quot;Falta la barra de encabezado de Outlook (fila de columnas)&quot; en Outlook 2016/2019. </p> <h4> Cómo CORREGIR: Falta la fila de encabezado de columna en Outlook 2016/2019. </h4> <p> 1. En el panel izquierdo, con las carpetas de Outlook, seleccione la carpeta donde no puede ver la Fila con las Columnas (encabezados). </p> <p> 2. En la barra de menú, elija <strong> Vista </strong> y luego haga clic en <strong> Ver configuraciones </strong> . </p> <p><img src=\"images/image_thumb-1-535.png\" alt=\"FIX Column Heading Row is Missing Outlook 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. En las opciones de &quot;Configuración de vista avanzada&quot;, haga clic en <strong> Otros ajustes </strong> . </p> <p><img src=\"images/image_thumb-2-711.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. En las opciones de &quot;Otras configuraciones&quot;, <strong> desmarcar </strong> la <strong> Utilice un diseño compacto con menos de 125 caracteres </strong> casilla de verificación y haga clic en <strong> OK </strong> dos veces para aplicar la configuración y cerrar todas las ventanas. </p> <p><img src=\"images/image_thumb-3-736.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Reinicie Outlook (o navegue a otra carpeta y vuelva a la carpeta en la que aplicó el cambio), para ver la barra con los encabezados de columna en su lugar. </p> <p><img src=\"images/image_thumb-4-249.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-5.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p>"}