{"title":"REVISIÓN: No se puede instalar XPS Viewer en Windows 10 (resuelto)","content":"<p> En un tutorial anterior mencioné los pasos necesarios para <a href=\"https://www.repairwin.com/how-to-install-xps-viewer-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> instalar XPS Viewer en Windows 10 </a> . Sin embargo, algunos usuarios se quejan de que no pueden instalar XPS Viewer porque el visor XPS no aparece en la lista después de presionar el botón &#39;Agregar una función&#39; (Aplicaciones&gt; Administrar funciones opcionales&gt; Agregar una función), o no se puede instalar. </p> <p> Este tutorial contiene instrucciones sobre cómo solucionar problemas de instalación del visor XPS en las versiones de Windows 10 1803 y 1809. </p> <h4> Cómo resolver problemas de instalación de XPS Viewer en Windows 10. </h4> <h6> Método 1. Desinstale y vuelva a instalar Microsoft XPS Document Writer. </h6> <p> 1. Abrir <strong> Programas y características </strong> y luego haga clic en <strong> Activar o desactivar las características de windows </strong> . </p> <p><img src=\"images/image_thumb-61-948.png\" alt=\"FIX: Cannot Install XPS Viewer - Windows 10\" loading=\"lazy\"></p> <p> 2. <strong> Desmarcar </strong> la <strong> Caja del escritor de documentos de Microsoft XPS </strong> y golpea <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-62-338.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Ahora haga clic en el <strong> Activar o desactivar las características de windows </strong> de nuevo y <strong> cheque </strong> la <strong> Escritor de documentos Microsoft XPS </strong> cuadro y haga clic en <strong> está bien. <br> </strong> 4. <strong> Reanudar </strong> tu computador. <br> 5. Intente instalar XPS Viewer. </p> <p> </p> <h6> Método 2. Instale XPS Viewer mediante el comando DISM. </h6> <p> 1. Abrir <strong> Símbolo del sistema como administrador </strong> . <br> 2. En el símbolo del sistema, proporcione el siguiente comando y presione <strong> Ingresar </strong> . </p> <ul> <li><strong> dism / Online / Add-Capability /CapabilityName:XPS.Viewer~~~~0.0.1.0 </strong></li> </ul> <p><img src=\"images/image_thumb-65-661.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Método 3. Descargue XPS Viewer desde Windows Update en lugar de WSUS. (Windows 10 Pro y Enterprise). </h6> <p> Si está utilizando Windows 10 Pro o Enterprise, aplique los siguientes pasos en el Editor de políticas de grupo. * </p> <p> * Nota: Si la computadora pertenece a un dominio, debe modificar la configuración de la política del grupo de dominio (GPO) y luego ejecutar el comando &quot;gpupdate / force&quot; antes de instalar XPS Viewer. </p> <p> 1. Abra el Editor de políticas de grupo. Para hacer eso: </p> <blockquote><p> 1. Presione simultáneamente las ventanas <img src=\"images/image_thumb36-656.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> gpedit.msc </strong> &amp; Prensa <strong> Ingresar. </strong></p></blockquote> <p><img src=\"images/image_thumb-78-514.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. En el panel izquierdo, navegue hasta: </p> <ul> <li><strong> Configuracion de Computadora </strong> -&gt; <strong> Plantillas Administrativas </strong> -&gt; <strong> Sistema </strong></li> </ul> <p> 3. En el panel derecho, haga doble clic en <strong> Especificar la configuración para la instalación y reparación de componentes opcionales </strong></p> <p><img src=\"images/image_thumb-63-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Establezca la política en <strong> Activado </strong> y luego verifique el <strong> Descargue el contenido de reparación y las características opcionales directamente desde Windows Update en lugar de Windows Server Update Services (WSUS) </strong> caja. </p> <p> 5. Cuando termine, haga clic en <strong> Solicitar </strong> y <strong> OK </strong> y <strong> Reanudar </strong> tu computador. </p> <p><img src=\"images/image_thumb-64-264.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Después de reiniciar, intente <a href=\"#install-xps-viewer-dism\" target=\"_blank\" rel=\"nofollow noopener\"> instale XPS Viewer utilizando el método DISM </a> sobre. <br> 7. Después de la instalación del visor XPS, abra el Editor de políticas de grupo y deshaga los cambios. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}