{"title":"REVISIÓN: Error de actualización de Windows 10 0xC1900101 - 0x30017 - La instalación falló en la fase FIRST_BOOT. (Resuelto)","content":"<p> El siguiente problema apareció en una computadora con Windows 10, al intentar instalar la actualización de características 1903: La instalación se detiene con el error &quot;No pudimos instalar Windows 10, 0xC1900101 - 0x30017. La instalación falló en la fase de PRIMER ARRANQUE con un error durante BOOT operation &quot;, y luego vuelve a la versión / compilación anterior de Windows 10. </p> <p> </p> <p><img src=\"images/image_thumb-21-154.png\" alt=\"FIX 0xC1900101 – 0x30017: Installation failed in FIRST_BOOT phase in Windows 10 Update. \" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contiene instrucciones para corregir el error de actualización de Windows 10 0xC1900101 - 0x30017: &quot;La instalación falló en la fase FIRST_BOOT con un error durante la operación de ARRANQUE&quot;. </p> <h4> Cómo corregir el error de actualización de Windows 10 0xC1900101 - 00 × 30017 &quot;La instalación falló en la fase FIRST_BOOT con un error durante la operación de ARRANQUE&quot; </h4> <p> El código de error 0xC1900101 - 0x30017 en la actualización de Windows 10 indica un problema con un dispositivo, controlador o programa incompatible en el sistema. Entonces, antes de continuar con los métodos a continuación, aplique lo siguiente: </p> <p> </p> <p> 1. Asegúrese de que <strong> Fecha y hora </strong> los ajustes son correctos. <br> 2. Luego, asegúrese de tener <strong> suficiente espacio libre </strong> . Windows 10 requiere al menos 32 GB de espacio libre para actualizar. Para liberar espacio en disco, use <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Limpieza de disco </a> . <br> 3. Instale los controladores más recientes para todos los dispositivos de su sistema, especialmente para el adaptador Ethernet e inalámbrico (si corresponde). * <br> 4. <strong> Desconecte todas las unidades USB externas y tarjetas SD </strong> y cualquier otro dispositivo USB que no sea necesario. <br> 5. Si utiliza un tercero <strong> programa antivirus </strong> , luego temporalmente <strong> desactivar </strong> o -mejor- desinstálelo. <br> 6. <strong> Desactivar </strong> la <strong> Cifrado de disco duro </strong> (BitLocker, VeraCrypt, etc.). <br> 7. Finalmente, antes de reiniciar su computadora para instalar la actualización, <strong> desconectarse de la red </strong> . (por ejemplo, desenchufe el cable Ethernet o desactive el adaptador Wi-Fi). </p> <p><strong> * Nota: </strong> Si después de aplicar las instrucciones de este artículo, la instalación de actualización de Windows 10 aún falla, continúe y <strong> actualizar </strong> también el <strong> BIOS </strong> (Firmware) en su sistema. </p> <p> </p> <h6> Método 1. <strong> Deshabilite el arranque seguro. </strong></h6> <p> El primer método para resolver el error 0xC1900101 - 0x30017, en la actualización de Windows 10, es deshabilitar la función de arranque seguro en BIOS. Para hacer eso: </p> <p> 1. Encienda su sistema y presione inmediatamente la tecla correspondiente * para ingresar <strong> CONFIGURACIÓN DEL BIOS. </strong></p> <p> * Nota: Por lo general, para ingresar en BIOS, debe presionar el <strong> DEL </strong> o <strong> F1 </strong> o <strong> F2 </strong> o el <strong> F10 </strong> clave. (depende del fabricante) </p> <p> </p> <p> 2. Mira <strong> Seguridad </strong> o en <strong> Opciones de arranque, </strong> o en <strong> Autenticación </strong> configuración, * para encontrar la <strong> Arranque seguro </strong> opción y <strong> Desactivar </strong> eso <strong> . </strong></p> <p> * Notas: <br> 1.La ubicación de la configuración de &#39;Arranque seguro&#39; en BIOS depende del fabricante del dispositivo. <br> 2. Si no puede encontrar la configuración de &#39;Arranque seguro&#39;, entonces <strong> Desactivar </strong> la <strong> Soporte CSM </strong> y entonces <strong> Guardar y Salir </strong> formar la configuración del BIOS. Luego ingrese nuevamente a la configuración del BIOS para encontrar el Arranque seguro. </p> <p><img src=\"images/image_thumb-23-719.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. <strong> Ahorrar </strong> ajustes y <strong> SALIDA </strong> Configuración del BIOS. <br> 4. Deje que Windows se inicie normalmente e intente instalar la actualización. Si la actualización falla nuevamente, vuelva a habilitar el &#39;Arranque seguro&#39; y continúe con el siguiente método. </p> <p> </p> <h6> Método 2. <strong> Elimine la carpeta &#39;SoftwareDistribution&#39;. </strong></h6> <p> El &quot;C: \\ Windows \\ <strong> Distribución de software </strong> “Carpeta, es la ubicación donde Windows almacena las actualizaciones de Windows. Muchas veces, esta carpeta se daña y debe volver a crearla para descargar las actualizaciones desde cero. Para reconstruir (volver a crear) la carpeta &quot;SoftwareDistribution&quot;, siga los pasos a continuación: </p> <p><strong> Paso 1: Detenga el servicio de actualización de Windows. </strong></p> <p> 1. Abra el panel de control de Servicios de Windows: Para ello: </p> <ul> <li> Presione Windows <img src=\"images/image_thumb8_thumb_thumb-239.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. </li> <li> En el cuadro de búsqueda, escriba: <strong><em> services.msc </em></strong> &amp; haga clic <strong> OK </strong> . </li> <li> (Acepte la advertencia de UAC si aparece). </li> </ul> <p><img src=\"images/image_thumb-12-752.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. En el panel de control de Servicios, busque el &quot; <strong> Actualizacion de Windows&quot; </strong> Servicio. <br> 3. Haga clic derecho en <strong> actualizacion de Windows </strong> servicio y seleccione &quot; <strong> Detener </strong> ”. </p> <p><img src=\"images/image_thumb-9-254.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Paso 2: Elimine la carpeta SoftwareDistribution. </strong></p> <p> 1. Abra el Explorador de Windows y navegue hasta: <strong> C: \\ Windows </strong> carpeta. <br> 2. Encuentra y <strong> Borrar </strong> la &quot; <strong><em> Distribución de software </em></strong> &quot;(O cámbiele el nombre, por ejemplo, a&quot; SoftwareDistributionOLD &quot;). </p> <p> </p> <p><img src=\"images/image_thumb-10-311.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p><strong> Paso 3: inicie el servicio de actualización de Windows. </strong></p> <p> 1. Abra el panel de control de Servicios de Windows. <br> 2. Haga clic derecho en <strong> actualizacion de Windows </strong> servicio y seleccione &quot; <strong> Comienzo </strong> ”. </p> <p><img src=\"images/image_thumb-11-133.png\" alt=\"start windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Paso 4: Verifique e instale la actualización de Windows 10. </strong></p> <p> 1. Navega a <strong> Ajustes </strong> -&gt; <strong> Actualización y seguridad </strong> y haga clic en <strong> Buscar actualizaciones </strong> . </p> <p> </p> <h6> Método 3. Actualice Windows 10 utilizando el Asistente de actualización </h6> <p> 1. Navega a <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Sitio de descarga de Windows 10 </a> y haga clic en el <strong> Actualizar ahora </strong> botón. </p> <p><img src=\"images/image_thumb_thumb-625.png\" alt=\"image_thumb\" loading=\"lazy\"></p> <p> 2. Guarde el archivo &quot;Windows10Upgrade9252.exe&quot; en su escritorio. <br> 3. Haga doble clic en el archivo descargado para abrir el <strong> Asistente de actualización de Windows </strong> . <br> 4. Haga clic en <strong> Actualizar ahora </strong> para iniciar la actualización. </p> <p><img src=\"images/image_thumb4_thumb-258.png\" alt=\"image_thumb4\" loading=\"lazy\"></p> <p> </p> <p> 5. Deje que Windows termine la descarga y la verificación. <br> 6. Cuando la verificación llega al 100%, <strong> desconecta tu computadora de Internet </strong> o configúrelo en &quot; <strong> Modo avión </strong> &quot;. <br> 7. Espere hasta que Windows actualice su sistema. <br> 8. Cuando se le solicite, reinicie su sistema para instalar la actualización. </p> <h6></h6> <h6> Método 4. Actualice Windows desde el archivo ISO de Windows 10. </h6> <p> El siguiente método del error de actualización de Windows 10 &quot;0xC1900101 - 0x30017: La instalación falló en la fase FIRST_BOOT&quot; es actualizar Windows 10, desde el archivo ISO de Windows. Para hacer eso: </p> <p><strong> Paso 1. Descargue Windows 10 en un archivo ISO. </strong></p> <p> 1. Navega a <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Página de descarga de Windows 10 </a> y descarga el <strong> Herramienta de creación de medios </strong> . </p> <p><img src=\"images/image_thumb5_thumb-958.png\" alt=\"image_thumb5\" loading=\"lazy\"></p> <p> </p> <p> 2. Ejecute la &#39;Herramienta de creación de medios&#39; y <strong> Aceptar </strong> los términos de la licencia en la primera pantalla. <br> 3. Seleccione <strong> Cree medios de instalación para otra PC </strong> . </p> <p><img src=\"images/image_thumb1_thumb-733.png\" alt=\"create Windows 10 DVD\" loading=\"lazy\"></p> <p> </p> <p> 4. En la pantalla &quot;Idioma, arquitectura y edición&quot;, haga clic en <strong> Próximo. <br> </strong> 5. Seleccione <strong> Archivo ISO </strong> y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb-30-348.png\" alt=\"download windows 10 iso\" loading=\"lazy\"></p> <p> 6. <strong> Ahorrar </strong> el archivo &#39;Windows.iso&#39; en su escritorio. <br> 7. La herramienta de creación de medios comenzará ahora a descargar Windows 10 en formato ISO. <br> 8. Cuando se complete la descarga, <strong> cerca </strong> la herramienta de creación de medios. </p> <p> </p> <p><strong> Paso 2. Actualice Windows 10 desde el archivo ISO. </strong></p> <p> 1. <strong> Desconecte su computadora de Internet </strong> , (o configúrelo en &quot;Modo avión&quot; si posee una computadora portátil). <br> 2. <strong> Desactivar </strong> o <strong> desinstalar temporalmente </strong> alguna <strong> antivirus de terceros </strong> . <br> 3. Luego, haga clic derecho en el archivo &quot;Windows.iso&quot; (en su escritorio) y haga clic en <strong> Montar </strong> . <br> 4. Haga doble clic en <strong> Configuración </strong> solicitud. </p> <p><img src=\"images/image_thumb-36-323.png\" alt=\"windows 10 setup\" loading=\"lazy\"></p> <p> </p> <p> 5. En la siguiente pantalla, elija <strong> &#39;No ahora&#39; </strong> y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb-11-747.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Siga las demás instrucciones en pantalla para actualizar su sistema. </p> <h4></h4> <h6> Método 5. Instalación limpia de Windows 10. </h6> <p> El último método, para solucionar los problemas de actualización de Windows 10, es realizar una instalación limpia de Windows 10 en su sistema. </p> <p><strong> Importante: </strong> La instalación limpia de Windows 10 significa que todos sus archivos y configuraciones se perderán durante el proceso de instalación. Entonces, proceda y <strong> Haga una copia de seguridad de todos sus archivos y configuraciones importantes en otro medio de almacenamiento antes de continuar </strong> . (por ejemplo, a una unidad USB externa). </p> <p> Para realizar una instalación limpia de Windows 10, lea las instrucciones de este artículo: <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo limpiar instalar Windows 10 </a></p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}