{"title":"REVISIÓN: Este modo de Windows solo ejecuta aplicaciones verificadas de la Tienda en Windows 10.","content":"<p> El error &quot;Por seguridad y rendimiento, este modo de Windows solo ejecuta aplicaciones verificadas de la Tienda&quot; aparece cuando Windows 10 se ejecuta en Modo S, o debido a una configuración en su computadora, que restringe la instalación de aplicaciones y software de terceros. . </p> <p><img src=\"images/image_thumb-19-156.png\" alt=\"FIX: For security and performance, this mode of Windows only runs verified apps from the Store in Windows 10.\" loading=\"lazy\"></p> <p> Este tutorial contiene instrucciones para resolver el error &quot;Por seguridad y rendimiento, este modo de Windows solo ejecuta aplicaciones verificadas de la Tienda&quot;, al intentar instalar una aplicación de terceros en Windows 10. </p> <h2> Cómo permitir la instalación de aplicaciones de terceros en Windows 10. </h2> <h5> Paso 1. Descubra la versión de Windows 10 instalada. </h5> <p> 1. Presione las ventanas <img src=\"images/image_thumb8_thumb-1-482.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Escriba el siguiente comando y presione <strong> Ingresar: </strong></p> <ul> <li><strong> winver </strong></li> </ul> <p><img src=\"images/image_thumb-13-360.png\" alt=\"See Windows 10 Installed Version\" loading=\"lazy\"></p> <p> 3. Ahora, si ve en Windows Edition que está ejecutando Windows 10 Home o Pro, siga las instrucciones en <a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Método 1 </a> , de lo contrario, si tienes <strong> Windows 10 Home S </strong> , siga las instrucciones en <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Método 2 </a> . </p> <p><img src=\"images/image_thumb-14-709.png\" alt=\"See Installed Windows 10 Edition\" loading=\"lazy\"></p> <p><strong> </strong></p> <p><strong> </strong></p> <h3> Método 1. Permita que Windows 10 instale aplicaciones desde cualquier lugar. </h3> <p> 1. Desde el menú Inicio <img src=\"images/image_thumb2_thumb_thumb-909.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> haga clic en Configuración <img src=\"images/image_thumb-66-797.png\" alt=\"image\" loading=\"lazy\"> y luego abrir <strong> Aplicaciones </strong> . </p> <p><img src=\"images/image_thumb-15-604.png\" alt=\"Windows Settings - Apps\" loading=\"lazy\"></p> <p> </p> <p> 2. En Configuración de aplicaciones y funciones, seleccione para instalar aplicaciones desde <strong> En cualquier lugar </strong> . </p> <p><img src=\"images/image_thumb-16-670.png\" alt=\"Install Apps from Anywhere - Windows 10\" loading=\"lazy\"></p> <h3> Método 2. Salga del modo S de Windows 10. </h3> <p> Windows 10 en modo S está diseñado para la seguridad y el rendimiento y, por esa razón, no permite ejecutar aplicaciones fuera de Microsoft Store. Para sortear esta limitación, debe salir del modo S, que es una forma muy fácil, pero tenga en cuenta que una vez que salga del modo S, no podrá volver a Windows 10 en modo S .. </p> <p> Para cerrar sesión en Windows 10 S Mode en Windows 10 Home: </p> <p> 1. Desde el menú Inicio <img src=\"images/image_thumb2_thumb_thumb-829.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> haga clic en Configuración <img src=\"images/image_thumb-66-853.png\" alt=\"image\" loading=\"lazy\"> y luego abrir <strong> Actualización y seguridad. </strong></p> <p> 2. Seleccione <strong> Activación </strong> a la izquierda y luego haga clic en <a href=\"//switchwindows\" target=\"_blank\" rel=\"nofollow noopener\"> Ir a la tienda </a><strong> . </strong></p> <p><img src=\"images/image_thumb-17-920.png\" alt=\"Switch Out S Mode Windows 10\" loading=\"lazy\"></p> <p> 3. En la página Cambiar fuera del modo S, haga clic en <strong> Obtener </strong> y luego haga clic en <strong> Instalar en pc. </strong> * <br> 4. Finalmente haga clic en <strong> Si vamos </strong> para salir del modo S. </p> <p> * Nota: Si después de hacer clic en el botón &#39;Instalar&#39; recibe el error &quot;Algo sucedió y no pudimos iniciar la actualización&quot;, proceda y <strong> instalar todas las actualizaciones de Windows 10 disponibles </strong> , <strong> reinicia tu PC </strong> e intenta de nuevo. </p> <p><img src=\"images/image_thumb-18-502.png\" alt=\"Switch Out S Mode\" loading=\"lazy\"></p> <p> </p> <p> 4. Cuando se complete la instalación, se le informará que podrá instalar aplicaciones desde fuera de Microsoft Store. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}