{"title":"REVISIÓN: Lexmark Impresión lenta de varias páginas en Windows 10 (resuelto)","content":"<p> En una PC con Windows 10, con una impresora Lexmark instalada, la impresión es lenta cuando se imprimen varias páginas. El problema de impresión lenta de Lexmark en Windows 10, generalmente se debe a un controlador de impresora incorrecto oa una configuración incorrecta de la impresora (Preferencias). Para resolver el problema, continúe leyendo a continuación. </p> <p><img src=\"images/image_thumb-29-115.png\" alt=\"FIX: Lexmark Slow Printing in Multiple Pages on Windows 10 \" loading=\"lazy\"></p> <p> Problema de impresión lenta de Lexmark en detalles: en Windows 10, su impresora Lexmark imprime rápidamente cuando imprime una sola página, pero cuando desea imprimir varias páginas, la impresión es lenta porque el proceso de impresión tarda demasiado en comenzar y luego la impresora imprime una. página a la vez cada 1-2 minutos. </p> <p> Este tutorial contiene instrucciones para resolver el problema de impresión lenta de varias páginas de Lexmark en Windows 10. </p> <ul> <li><strong> Artículo relacionado: </strong> <a href=\"https://www.repairwin.com/fix-slow-pdf-printing-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> REVISIÓN: Impresión lenta de PDF en Windows 10 </a></li> </ul> <h4> Cómo CORREGIR: Impresión lenta de varias páginas en la impresora Lexmark en Windows 10. </h4> <h6> Método 1. Modifique la configuración de la impresora. </h6> <p> 1. Navega a <strong> Panel de control </strong> -&gt; <strong> Dispositivos e impresoras. </strong><br> 2. Haga clic con el botón derecho en su impresora y seleccione <strong> Propiedades. </strong></p> <p><img src=\"images/image_thumb-30-253.png\" alt=\"Printer Properties\" loading=\"lazy\"></p> <p> 3. En la pestaña &quot;General&quot;, <strong> haga clic en Cambiar propiedades. </strong></p> <p><img src=\"images/image_thumb-31-900.png\" alt=\"Change Printer Properties\" loading=\"lazy\"></p> <p> 4. En Preferencias de impresión de Lexmark, configure el <strong> Tipo de papel </strong> a <strong> Llanura </strong> y haga clic en <strong> está bien. * </strong></p> <p> * Nota: Otras configuraciones que se pueden aplicar a su impresora para mejorar la velocidad de impresión: </p> <ul> <li><strong> Resolución de impresión </strong><strong> : </strong> 600 ppp ralentizará la impresora. </li> <li><strong> Modo silencioso </strong><strong> : </strong> Apagado </li> </ul> <p><img src=\"images/image_thumb-32-858.png\" alt=\"FIX Slow Lexmark Printing Lexmark - Windows 10\" loading=\"lazy\"></p> <p> 5. Ahora, haga clic en <strong> Solicitar </strong> y <strong> OK </strong> en la ventana &quot;Propiedades de la impresora&quot; para aplicar el cambio. <br> 6. Abra un documento con varias páginas y compruebe si se solucionó el problema. Si no es así, continúe con el método 2 a continuación. </p> <h6> Método 2. Cambie el controlador de la impresora. </h6> <p> 1. Navega a <strong> Panel de control </strong> -&gt; <strong> Dispositivos e impresoras. </strong><br> 2. Haga clic con el botón derecho en su impresora y seleccione <strong> Retire el dispositivo. </strong></p> <p><img src=\"images/image_thumb-33-755.png\" alt=\"Uninstall Printer Windows 10\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 2. Después de quitar la impresora, navegue hasta <strong> Programas y características </strong> en el Panel de control y <strong> desinstalar </strong> la <strong> Software de Lexmark </strong> (de cualquier). </p> <p> 3. Navega a <a href=\"https://www.lexmark.com/en_us/support/download-search.html\" target=\"_blank\" rel=\"nofollow noopener\"> Controladores y descargas de Lexmark </a> sitio y busque los controladores disponibles para su modelo de impresora y sistema operativo. <br> 4. De la lista de controladores disponibles, descargue e instale uno de los siguientes controladores: * </p> <ul> <li> <p> Controlador de impresión universal. </p> </li> <li> <p> Controlador de impresión de emulación universal PCL5e. </p> </li> <li> <p> Controlador de impresión de emulación Universal PostScript 3. </p> </li> </ul> <p> * Nota: le sugiero que pruebe los controladores de impresión en el orden indicado anteriormente. </p> <p> 5. Cuando se complete la instalación del controlador de la impresora, <strong> Reanudar </strong> tu computador. <br> 6. Después de reiniciar, intente imprimir un documento largo. El problema de la impresión lenta debería solucionarse. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este problema. </p>"}