{"title":"REVISIÓN: Problemas de instalación de Windows 10 21H1.","content":"<p> Microsoft lanzó el 18 de mayo de 2021 la última actualización importante para Windows 10 (también conocida como &quot;Actualización destacada de Windows 10, versión 21H1&quot;), principalmente con mejoras de seguridad en el trabajo remoto y en la apertura de documentos, mientras que Windows Defender Application Guard lo protege de posibles amenazas de seguridad. </p> <p> En el momento de redactar este artículo, Microsoft solo ha anunciado los siguientes problemas con la actualización de Windows 21H1: </p> <ul> <li><b><a href=\"https://docs.microsoft.com/en-us/windows/release-health/status-windows-10-21h1#1605msgdesc\" target=\"_blank\" rel=\"nofollow noopener\"> Es posible que se escuche un ruido agudo al usar audio 5.1 con ciertas configuraciones </a></b><br> Ciertas combinaciones de aplicaciones, dispositivos de audio y configuraciones de Windows pueden producir un ruido agudo al usar audio 5.1 <br> Compilación del SO 19043.906. </li> <li><b><a href=\"https://docs.microsoft.com/en-us/windows/release-health/status-windows-10-21h1#1528msgdesc\" target=\"_blank\" rel=\"nofollow noopener\"> Es posible que la entrada automática de Furigana no funcione como se esperaba </a></b><br> En determinadas circunstancias, es posible que la función de conversión / entrada automática de Furigana no funcione como se esperaba en las aplicaciones. </li> </ul> <p> * Nota: Este error se descubre por primera vez después de instalar después de instalar el <a href=\"https://support.microsoft.com/help/5000842\" target=\"_blank\" rel=\"nofollow noopener\"> KB5000842 </a> actualizar. Para mitigar este problema, puede probar una o más de las siguientes opciones: </p> <ol> <li> Transmitir el video o el audio en un navegador web o una aplicación diferente, en lugar de la aplicación afectada por este problema. </li> <li> Permitir <b> Sonido espacial </b> ajustes haciendo clic derecho o presionando prolongadamente el <b> icono de volumen </b> en el <b> área de notificación </b> , seleccionando <b> Sonido espacial (desactivado) </b> y seleccionando cualquiera de las opciones disponibles. </li> </ol> <h5> Cómo obtener la actualización de Windows 10 de mayo de 2021 (21H1). </h5> <p> Para actualizar su sistema a Windows 10, versión 21H1, debe ejecutar Windows 10, versión 2004 o 20H2. Para averiguar la versión de Windows 10 instalada, vaya a <strong> Comienzo </strong> -&gt; <strong> Ajustes </strong> -&gt; <strong> Sistema </strong> -&gt; <strong> Acerca de. </strong></p> <p><img src=\"images/image_thumb-64-863.png\" alt=\"Find Out Windows 10 version\" loading=\"lazy\"></p> <p> </p> <p> Para instalar Feature Update en Windows 10, versión 21H1, vaya a <strong> Comienzo </strong> -&gt; <strong> Ajustes </strong> -&gt; <strong> Actualización y seguridad </strong> y haga clic en <strong> Busque actualizaciones. </strong> Si la actualización está disponible para su dispositivo, aparecerá después de la comprobación de la actualización. </p> <p> Si quieres instalar la actualización de Windows 10 21H1 sin problemas, <strong> no presionar </strong> la <strong> Descargar e instalar </strong> enlace ahora y siga las instrucciones a continuación para evitar o resolver problemas de instalación. </p> <p><img src=\"images/image_thumb-61-537.png\" alt=\"How to Install Windows 10 21H1 Update\" loading=\"lazy\"></p> <h2> Cómo evitar problemas de instalación de la actualización de Windows 10 21H1. </h2> <p> Antes de instalar la actualización de Windows 10 21H1, realice las siguientes acciones: </p> <ul> <li><strong> Paso 1. </strong> Asegúrate de tener <strong> suficiente espacio libre </strong> en su disco. Windows 10 requiere al menos 32 GB de espacio libre para actualizar. </li> <li><strong> Paso 2. </strong> Correr <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Limpieza de disco </a> y borre todos los archivos inútiles. </li> <li><strong> Paso 3. </strong> Descarga y <strong> Instalar en pc </strong> último <a href=\"https://portal.msrc.microsoft.com/en-us/security-guidance/advisory/ADV990001\" target=\"_blank\" rel=\"nofollow noopener\"> Pila de servicio </a> Actualice según su versión de Windows 10. </li> <li><strong> Paso 4. </strong> <strong> Desconecte todas las unidades USB y tarjetas SD externas </strong> y cualquier otro dispositivo USB que no sea necesario para instalar Windows. </li> <li><strong> Paso 5. </strong> <strong> Desinstalar temporalmente </strong> alguna <strong> Antivirus / seguridad que no son de Microsoft </strong> software. </li> <li><strong> Paso 6. </strong> <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Deshabilitar BitLocker </a> cifrado de unidad (si está habilitado). </li> <li><strong> Paso 7 </strong> . <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Crear un punto de restauración del sistema </a> del estado actual de Windows, para restaurar su sistema si falla la actualización. </li> <li><strong> Paso 8. </strong> <strong> Deshabilitar programas de inicio </strong> . Para hacer eso, presione el <strong> CONTROL </strong> + <strong> CAMBIAR </strong> + <strong> ESC </strong> teclas para abrir el Administrador de tareas. En el Administrador de tareas, seleccione el <strong> Puesta en marcha </strong> pestaña y <strong> desactivar </strong> todos los programas que se ejecutan cuando se inicia Windows. </li> </ul> <p><img src=\"images/image_thumb-62-351.png\" alt=\"image\" loading=\"lazy\"></p> <p> Después de realizar las acciones anteriores, navegue hasta <strong> Comienzo </strong> -&gt; <strong> Ajustes </strong> -&gt; <strong> Actualización y seguridad </strong> y haga clic en el <strong> Descargar e instalar </strong> para instalar el <strong> Actualización de funciones a Windows 10, versión 21H1. </strong> Ahora espere (unos 20-30 minutos), hasta que Windows le indique <strong> Reiniciar ahora </strong> su sistema para terminar de instalar la actualización. </p> <p><img src=\"images/image_thumb-63-447.png\" alt=\"FIX Windows 10 21H1 Installation Problems.\" loading=\"lazy\"></p> <p> </p> <p> Después de algunos reinicios y si todo va bien, la actualización 21H1 se instalará en su sistema sin problemas. Si esto no sucede y la Actualización 21H1 de Windows 10 falla con un error (por ejemplo, &quot;No se pudo instalar la actualización de la función a Windows 10, versión 21H1 - Código de error: 0x800f0984&quot;), continúe leyendo a continuación para resolver el problema. </p> <h2> Cómo SOLUCIONAR los problemas de instalación de la actualización de Windows 10 21H1. </h2> <p> Si no se pudo instalar la actualización de Windows 10 21H1, siga los métodos a continuación para resolver el problema. </p> <h3> Método 1. Actualice a Windows 10 21H1 utilizando el Asistente de actualización. </h3> <p> 1. Navega a <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Sitio de descarga de Windows 10 </a> y haga clic en el <strong> Actualizar ahora </strong> botón. </p> <p><img src=\"images/image_thumb-65-764.png\" alt=\"Download Windows 10 21H1 \" loading=\"lazy\"></p> <p> 2. Guarde el archivo &quot;Windows10Upgrade9252.exe&quot; en su escritorio. <br> 3. Haga doble clic en el archivo descargado para abrir el <strong> Asistente de actualización de Windows </strong> . <br> 4. Haga clic en <strong> Actualizar ahora </strong> para iniciar la actualización. </p> <p><img src=\"images/image_thumb-61-394.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Deje que Windows termine la descarga y la fase de verificación. <br> 6. Cuando la verificación llega al 100%, <strong> desconecta tu computadora de Internet </strong> , (o configúrelo en &quot; <strong> Modo avión </strong> &quot;si tienes una computadora portátil). <br> 7. Luego, espere hasta que la actualización de Windows 10 21H1 esté instalada en su sistema. <br> 8. Por último, cuando se le solicite, <strong> Reanudar </strong> su sistema para instalar la actualización. </p> <p> </p> <h3> Método 2. Actualice a Windows 10 21H1 desde ISO o USB. </h3> <p> El siguiente método para evitar problemas al instalar la actualización 21H1 en Windows 10 es actualizar Windows desde un archivo ISO. Para hacer eso: </p> <p><strong> Paso 1. Descargue Windows 10 en un archivo ISO. </strong></p> <p> 1. Navega a <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Página de descarga de Windows 10 </a> y haga clic en <strong> Descarga la herramienta ahora </strong> para descargar el <strong> Herramienta de creación de medios </strong> . </p> <p><img src=\"images/image_thumb-66-613.png\" alt=\"Update to Windows 10 21H1 \" loading=\"lazy\"></p> <p> 2. Ejecute la &#39;Herramienta de creación de medios&#39; y <strong> Aceptar </strong> los términos de la licencia en la primera pantalla. <br> 3. Seleccione <strong> Cree medios de instalación para otra PC </strong> . </p> <p><img src=\"images/image_thumb1_thumb-386.png\" alt=\"create Windows 10 DVD\" loading=\"lazy\"></p> <p> 4. En la pantalla &quot;Idioma, arquitectura y edición&quot;, haga clic en <strong> Próximo. <br> </strong> 5. Seleccione <strong> Archivo ISO </strong> y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb-30-314.png\" alt=\"download windows 10 iso\" loading=\"lazy\"></p> <p> 6. <strong> Ahorrar </strong> el archivo &#39;Windows.iso&#39; en su escritorio. <br> 7. La herramienta de creación de medios comenzará a descargar Windows 10 en formato ISO. <br> 8. Cuando se complete la descarga, <strong> cerca </strong> la herramienta de creación de medios. </p> <p><strong> Paso 2. Actualice Windows 10 desde el archivo ISO. </strong></p> <p> 1. <strong> Haga doble clic </strong> en el <strong> Windows.ISO </strong> archivo en su escritorio. <br> 2. Abra el Explorador de archivos y explore el contenido de la nueva letra de unidad creada después de abrir el archivo ISO. <br> 3. <strong> Haga doble clic </strong> a <strong> setup.exe </strong> y luego haga clic en <strong> próximo </strong> para instalar Windows 10. </p> <p><img src=\"images/image_thumb-58-627.png\" alt=\"FIX Error 0x8007025D-0x2000C Windows 10 Update\" loading=\"lazy\"></p> <p> 4. <strong> Aceptar </strong> los Términos de la licencia y luego haga clic en <strong> Instalar en pc. </strong></p> <p><img src=\"images/image_thumb-59-853.png\" alt=\"Install Windows from ISO file\" loading=\"lazy\"></p> <p> 5. Ahora espere a que se complete el proceso de actualización. * </p> <p> * Nota: Si la actualización falla nuevamente, <a href=\"https://www.repairwin.com/create-windows-usb-with-rufus-iso-to-usb/\" target=\"_blank\" rel=\"nofollow noopener\"> grabar el archivo ISO de Windows en una unidad USB </a> y luego intentar <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> reparar y actualizar Windows 10 desde USB. </a></p> <p> </p> <h3> Método 3. Reparar el almacén de componentes de Windows y los archivos del sistema. </h3> <p> 1. Abrir <strong> Símbolo del sistema como administrador </strong> . <br> 2. En el símbolo del sistema, dé el siguiente comando y presione <strong> Ingresar: </strong></p> <ul> <li><strong> DISM / Online / Cleanup-Image / StartComponentCleanup </strong></li> </ul> <p><img src=\"images/image_thumb6_thumb-396.png\" alt=\"image_thumb[6]\" loading=\"lazy\"></p> <p> 3. Cuando se complete el proceso, dé el siguiente comando: </p> <ul> <li><strong> DISM.exe / En línea / Imagen de limpieza / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-789.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Cuando se complete la operación DISM, escriba el siguiente comando y presione <strong> Ingresar </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-729.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Ahora espere hasta que el Comprobador de archivos de sistema repare los archivos de sistema de Windows. <br> 6. Una vez hecho esto, <strong> Reanudar </strong> tu computadora. <br> 7. Después de reiniciar, abra <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Limpieza de disco </a> y abrir <strong> Limpiar archivos de sistema. </strong> Seleccione para eliminar los siguientes archivos y haga clic en <strong> OK: </strong></p> <ul> <li> Archivos de instalación temporales de Windows </li> <li> Limpieza de Windows Update </li> <li> Archivos de registro de actualización de Windows. </li> </ul> <p><img src=\"images/image_thumb-60-389.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. Cuando termine, use las instrucciones del método 1 anterior para actualizar Windows usando el Asistente de actualización de Windows 10 21H1 </p> <p> </p> <h3> Método 4. Instalación limpia de Windows 10. </h3> <p> El último método, para solucionar los problemas de actualización de Windows 10 21H1, es realizar una instalación limpia de Windows 10 en su sistema. * Para hacerlo, lea las instrucciones de este artículo: <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Cómo limpiar instalar Windows 10 </strong></a> . </p> <p><strong> * Importante: </strong> La instalación limpia de Windows 10 significa que todos sus archivos y configuraciones se perderán durante el proceso de instalación. Entonces, proceda y <strong> Haga una copia de seguridad de todos sus archivos y configuraciones importantes en otro medio de almacenamiento </strong> (por ejemplo, a una unidad USB externa) antes de continuar con la instalación limpia de Windows 10. </p> <p> ¡Eso es todo amigos! Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}