{"title":"REVISIÓN: El programa no se puede iniciar porque falta MSVCP100.dll o MSVCR100.dll (resuelto)","content":"<p> El siguiente error puede aparecer al iniciar Windows o al intentar iniciar un programa: &quot;El programa no puede iniciarse porque falta MSVCP100.dll en su computadora. Intente reinstalar el programa para solucionar este problema&quot;. </p> <p><img src=\"images/image_thumb-14-145.png\" alt=\"MSVCP100.dll is Missing - fix\" loading=\"lazy\"></p> <p> </p> <p> Los problemas &quot;Falta MSVCP100.dll&quot; o &quot;Falta MSVCR100.dll&quot; ocurren comúnmente después de actualizar su sistema a la última versión de Windows (por ejemplo, después de migrar su sistema de Windows 8.1 a Windows 10) o después de restaurar su sistema a una punto de restauración anterior mediante la función &quot;Restaurar sistema&quot; de Windows. </p> <p> En este tutorial encontrará instrucciones para resolver los errores &quot;falta msvcr100.dll&quot; o &quot;falta msvcp100.dll&quot; en los sistemas operativos Windows 10, 8 / 8.1 o 7. </p> <h4> Cómo corregir: &quot;El programa no se puede iniciar porque falta MSVCP100.DLL o MSVCR100.DLL&quot;. </h4> <h6> Método 1. Desinstale y vuelva a instalar Adobe Acrobat Reader DC. </h6> <p> El primer método para resolver el problema &quot;Falta MSVCP100.dll&quot; es eliminar y luego reinstalar el programa &quot;Acrobat Reader DC&quot; en su sistema. </p> <p><strong> 1. </strong> Navega a Windows <strong> Panel de control </strong> y abrir <strong> Programas y características </strong> . <br> <strong> 2. </strong> Selecciona el <strong> Adobe Acrobat Reader DC </strong> y haga clic en <strong> Desinstalar </strong> para eliminarlo. </p> <p><img src=\"images/image_thumb-9-944.png\" alt=\"fix MSVCP100.dll is Missing \" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Siga las instrucciones en pantalla para eliminar Acrobat Reader y luego <strong> Reanudar </strong> tu computadora. <br> <strong> 4. </strong> Después de reiniciar, abra su navegador web y navegue hasta <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> Página de descarga de Acrobat Reader DC </a> y haga clic en el <strong> Instalar ahora </strong> , para descargar e instalar la última versión de Acrobat Reader para su sistema. </p> <p><img src=\"images/image_thumb-10-958.png\" alt=\"fix MSVCR100.dll is Missing \" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Método 2. Repare todas las versiones del paquete redistribuible de Microsoft Visual C ++. </h6> <p> El segundo método para solucionar los problemas de &quot;MSVCR100.dll - MSVCp100.dll messing&quot; es reparar todas las versiones instaladas * de Microsoft Visual C ++ Redistributable Package. ** </p> <p><strong> 1. </strong> Navega a Windows <strong> Panel de control </strong> y abrir <strong> Programas y características </strong> . <br> <strong> 2. </strong> Busque y repare una por una * todas las versiones instaladas de &quot;Microsoft Visual C ++ Redistributable Package (s)&quot;. </p> <p> * p.ej. Seleccione el &quot;Paquete redistribuible de Microsoft Visual C ++ 2013 (x86)&quot;, haga clic en <strong> Cambio </strong> y luego haga clic en <strong> Repai </strong> botón r. Cuando se complete el proceso de reparación, resalte el &quot;Paquete redistribuible de Microsoft Visual C ++ 2013 (x64)&quot; y siga los mismos pasos ( <strong> Cambio </strong> &gt; <strong> Reparar </strong> ). </p> <p> ** Nota: Si no puede encontrar (ninguna versión de) el &quot;Paquete redistribuible de Microsoft Visual C ++&quot; en los programas instalados, continúe con el método 3 a continuación para instalarlo. </p> <p><img src=\"images/image_thumb-11-929.png\" alt=\"Program Can't Start MSVCr100.dll is Missing \" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> 3. </strong> Cuando se complete la reparación, <strong> Reanudar </strong> tu computadora. </p> <p> </p> <h6> Método 3. Desinstale y vuelva a instalar el último paquete redistribuible de Microsoft Visual C ++. </h6> <p> El siguiente método para resolver el problema &quot;El programa no se puede iniciar porque falta MSVCP100.dll&quot; es eliminar todas las versiones instaladas de Microsoft Visual C ++ Redistributable Package y luego descargar e instalar la última versión. </p> <p><strong> 1. </strong> Navega a Windows <strong> Panel de control </strong> y abrir <strong> Programas y características </strong> . <br> <strong> 2. </strong> Busque y elimine (una por una) todas las versiones instaladas de &quot;Paquetes redistribuibles de Microsoft Visual C ++&quot;. </p> <p><img src=\"images/image_thumb-12-326.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Después de la desinstalación, <strong> Reanudar </strong> tu computadora. <br> <strong> 4. </strong> Después de reiniciar, abra su navegador web y navegue hasta <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48145\" target=\"_blank\" rel=\"nofollow noopener\"> Página de descarga de Visual C ++ Redistributable para Visual Studio 2015 </a> para descargar e instalar la última versión del paquete redistribuible de Microsoft Visual C ++. * </p> <p><strong> * Nota IMPORTANTE: </strong> Descargue e instale ambas versiones. (&quot;vc_redist.x86.exe&quot; y &quot;vc_redist.x64.exe&quot;) </p> <p> </p> <h6> Método 4. Copie los archivos que faltan en la ubicación correcta. </h6> <p> En algunos casos, los problemas &quot;Falta MSVCR100.dll&quot; y &quot;Falta MSVCP100.dll&quot;, suelen aparecer después de la actualización de Windows (por ejemplo, de Windows 8.1 a Windows 10). En estos casos, realice los siguientes pasos para resolver sus problemas: </p> <p><strong> 1. </strong> Copiar los archivos &quot; <strong> msvcp100.dll </strong> &quot;&amp;&quot; <strong> msvcr100.dll </strong> &quot; de &quot; <strong> C: \\ Windows.old \\ WINDOWS \\ SysWOW64 </strong> &quot;carpeta a&quot; <strong> C: \\ Windows \\ SysWOW64 </strong> &quot;carpeta. <br> <strong> 2. </strong> <strong> Reanudar </strong> tu computadora. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}