{"title":"REVISIÓN: El acceso rápido no funciona y no se puede escribir en el cuadro de búsqueda en Windows 10 (resuelto)","content":"<p> Si <strong> Acceso rápido </strong> El menú s no funciona en Windows 10, luego lea este tutorial para solucionar el problema. La opción de acceso rápido en el Explorador de archivos permite al usuario navegar fácilmente a los archivos y carpetas abiertos recientemente. Pero a veces, especialmente cuando ha abierto previamente un archivo / carpeta desde una unidad externa (por ejemplo, su disco USB), que ahora está fuera de línea, el acceso rápido no muestra los archivos recientes o no puede escribir en la barra &#39;Buscar&#39;. </p> <p><img src=\"images/image_thumb-2-490.png\" alt=\"FIX: Quick Access Not Working in Windows 10 (Solved)\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cómo REPARAR: La función de acceso rápido y la función de búsqueda no funcionan en Windows 10. </h4> <p> </p> <h6> Método 1. Reinicie el Explorador de Windows. </h6> <p> El primer método para solucionar el problema de acceso rápido es reiniciar el proceso del Explorador de Windows desde el Administrador de tareas. Para hacer eso: </p> <p> 1. Presione <strong> control </strong> + <strong> Alt </strong> + <strong> Del </strong> abrir <strong> Administrador de tareas </strong> . <br> 2. En <strong> Procesos </strong> * pestaña, resalte la <strong> Explorador de Windows </strong> proceso y haga clic en <strong> Reanudar </strong> . </p> <p> * Nota: Si no ve la pestaña &#39;Proceso&#39;, haga clic en <strong> Más detalles. </strong></p> <p><img src=\"images/image_thumb-951.png\" alt=\"restart windows explorer\" loading=\"lazy\"></p> <p><strong> </strong></p> <h6> Método 2. Habilite los elementos recientes de acceso rápido y borre el historial del explorador de archivos. </h6> <p> 1. Abrir <strong> Opciones de carpeta. </strong> Para hacer eso, abra el Explorador de Windows y desde el menú, vaya a <strong> Vista </strong> &gt; <strong> Opciones </strong> . </p> <p><img src=\"images/image_thumb-3-949.png\" alt=\"enable quick access windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. En <strong> General </strong> pestaña, asegúrese de que las siguientes casillas de verificación estén seleccionadas. </p> <ul> <li><strong> Mostrar archivos usados ​​recientemente en Acceso rápido </strong></li> <li><strong> Muestra carpetas de uso frecuente en Acceso rápido. </strong></li> </ul> <p> 3. Luego haga clic en el <strong> Claro </strong> para borrar el historial del Explorador de archivos. </p> <p><img src=\"images/image_thumb-4-329.png\" alt=\"clear quick access history\" loading=\"lazy\"></p> <p> </p> <p> 3. Haga clic en <strong> OK </strong> y compruebe si el acceso rápido y la función de búsqueda funcionan. Si no es así, reinicie el &#39;Explorador de archivos&#39; utilizando el Administrador de tareas (consulte el método 1 anterior) y vuelva a verificar. Si el problema persiste, continúe con el siguiente método. </p> <h6> Método 3. Limpiar el historial de elementos recientes manualmente. </h6> <p> El siguiente método para resolver problemas con los elementos recientes de acceso rápido o con la función &#39;Buscar&#39; en Windows 10 es eliminar el historial de elementos recientes manualmente. Para hacer eso: </p> <p> 1. Abra el Explorador de Windows. <br> 2. Copie y pegue la siguiente dirección en la barra de direcciones y presione <strong> Ingresar </strong> : </p> <p> % AppData% \\ Microsoft \\ Windows \\ Recent \\ AutomaticDestinations </p> <p><img src=\"images/image_thumb-1-410.png\" alt=\"clear recent items windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Presione <strong> control </strong> + <strong> A </strong> (para seleccionar todos los elementos) y presione <strong> Borrar </strong> (o haga clic derecho&gt; <strong> Borrar </strong> ). </p> <p><img src=\"images/image_thumb-5-834.png\" alt=\"Delete Quick Access History\" loading=\"lazy\"></p> <p> </p> <p> 4. Luego copie / pegue la siguiente dirección en la barra de direcciones y presione <strong> Ingresar </strong> . </p> <p> % AppData% \\ Microsoft \\ Windows \\ Recent \\ CustomDestinations </p> <p><img src=\"images/image_thumb-6-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Presione <strong> control </strong> + <strong> A </strong> de nuevo (para seleccionar todos los elementos) y presione <strong> Borrar. <br> </strong> 6. Ahora presione <strong> Ctrl + Alt + Supr </strong> abrir <strong> Administrador de tareas </strong> . <br> 7. En <strong> Procesos </strong> pestaña, resalte la <strong> Explorador de Windows </strong> proceso y haga clic en <strong> Reanudar </strong> . <br> 8. Normalmente, los problemas con la función &#39;Acceso rápido&#39; o con la función &#39;Buscar&#39; &quot;deben haberse resuelto. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}