{"title":"REVISIÓN: Error 0x8007000e en la actualización de Windows 10 1903 (resuelto)","content":"<p> Varios usuarios se quejan de que no pueden actualizar su sistema a la última versión de Windows 10, versión 1903, porque la actualización no se instala con el error 0x8007000E. El código de error &quot;0x8007000E&quot; en la actualización de Windows 10 v1903 generalmente se debe a que el archivo de actualización descargado está dañado o debido a un controlador de dispositivo o software no compatible. </p> <p><img src=\"images/image_thumb-428.png\" alt=\"FIX: Windows 10 1903 Update Failed with error 0x8007000e\" loading=\"lazy\"></p> <p> Esta guía contiene instrucciones paso a paso para resolver el error &quot;0x8007000E&quot; en la instalación de la actualización de Windows 10 v1903: &quot;Las actualizaciones fallaron. No podemos finalizar la actualización. Intente reiniciar su dispositivo e intentaremos nuevamente&quot;. </p> <h2> Cómo solucionarlo: Error al instalar la actualización de Windows 10 con el código de error 0x8007000E. </h2> <p><strong> Requisitos previos importantes antes de instalar la actualización de Windows 10 v1903. </strong></p> <p> 1. <strong> Desactivar </strong> o <strong> desinstalar temporalmente </strong> tu <strong> Seguridad / Antivirus </strong> software y vuelva a instalarlo después de que se haya completado la instalación de la actualización. <br> 2. Asegúrese de tener al menos <strong> 32 GB de espacio libre en disco </strong> . Para liberar espacio en disco, use <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Limpieza de disco </a> . <br> 3. <strong> Desconectar </strong> todas <strong> Dispositivos USB </strong> Y <strong> Tarjetas SD </strong> (por ejemplo, discos flash USB, el receptor inalámbrico USB para su mouse o teclado, etc.). <br> 4. Según la versión instalada y la arquitectura de Windows 10 (por ejemplo, &quot;v1809 - 64 bits&quot;), <strong> Instalar en pc </strong> lo último <strong><a href=\"https://portal.msrc.microsoft.com/en-us/security-guidance/advisory/ADV990001\" target=\"_blank\" rel=\"nofollow noopener\"> actualización de la pila de servicio para Windows 10. </a> </strong><br> 5. Navegue al sitio de asistencia del fabricante de su PC o computadora portátil para descargar y <strong> instalar los controladores de dispositivo más recientes </strong> . * </p> <p><strong> * Nota: </strong> Si después de aplicar todas las instrucciones (y métodos) de este artículo, la instalación de Windows 10 1903 aún falla, continúe y <strong> actualizar </strong> la <strong> BIOS </strong> (Firmware). </p> <p> 6. Desactive el cifrado del disco duro (si está habilitado). <br> 7. Después de completar el proceso de descarga de la actualización y durante la fase de instalación, desconéctese de la red. </p> <p> </p> <h6> Método 1. <strong> Elimine la carpeta &#39;SoftwareDistribution&#39;. </strong></h6> <p> El &quot;C: \\ Windows \\ <strong> Distribución de software </strong> “Carpeta, es la ubicación donde Windows almacena las actualizaciones de Windows. Muchas veces, esta carpeta se daña y debe volver a crearla para descargar las actualizaciones desde cero. Para reconstruir (volver a crear) la carpeta &quot;SoftwareDistribution&quot;, siga los pasos a continuación: </p> <p><strong> Paso 1: Detenga el servicio de actualización de Windows. </strong></p> <p> 1. Abra el panel de control de Servicios de Windows: Para ello: </p> <ul> <li> Presione Windows <img src=\"images/image_thumb8_thumb_thumb-526.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. </li> <li> En el cuadro de búsqueda, escriba: <strong><em> services.msc </em></strong> &amp; haga clic <strong> OK </strong> . </li> <li> (Acepte la advertencia de UAC si aparece). </li> </ul> <p><img src=\"images/image_thumb-12-193.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. En el panel de control de Servicios, busque el &quot; <strong> Actualizacion de Windows&quot; </strong> Servicio. <br> 3. Haga clic derecho en <strong> actualizacion de Windows </strong> servicio y seleccione &quot; <strong> Detener </strong> ”. </p> <p><img src=\"images/image_thumb-9-851.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Paso 2: Elimine la carpeta SoftwareDistribution. </strong></p> <p> 1. Abra el Explorador de Windows y navegue hasta: <strong> C: \\ Windows </strong> carpeta. <br> 2. Encuentra y <strong> Borrar </strong> la &quot; <strong><em> Distribución de software </em></strong> &quot;(O cámbiele el nombre, por ejemplo, a&quot; SoftwareDistributionOLD &quot;). </p> <p> </p> <p><img src=\"images/image_thumb-10-240.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p><strong> Paso 3: inicie el servicio de actualización de Windows. </strong></p> <p> 1. Abra el panel de control de Servicios de Windows. <br> 2. Haga clic derecho en <strong> actualizacion de Windows </strong> servicio y seleccione &quot; <strong> Comienzo </strong> ”. </p> <p><img src=\"images/image_thumb-11-697.png\" alt=\"start windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Paso 4: Verifique e instale la actualización de Windows 10. </strong></p> <p> 1. Navega a <strong> Ajustes </strong> -&gt; <strong> Actualización y seguridad </strong> y haga clic en <strong> Buscar actualizaciones </strong> . </p> <p> </p> <h6> Método 2. Actualice Windows 10 utilizando el Asistente de actualización </h6> <p> 1. Navega a <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Sitio de descarga de Windows 10 </a> y haga clic en el <strong> Actualizar ahora </strong> botón. </p> <p><img src=\"images/image_thumb_thumb_thumb_thumb-773.png\" alt=\"image_thumb_thumb_thumb\" loading=\"lazy\"></p> <p> 2. Guarde el archivo &quot;Windows10Upgrade9252.exe&quot; en su escritorio. <br> 3. Haga doble clic en el archivo descargado para abrir el <strong> Asistente de actualización de Windows </strong> . <br> 4. Haga clic en <strong> Actualizar ahora </strong> para iniciar la actualización. </p> <p><img src=\"images/image_thumb4_thumb_thumb_thumb-714.png\" alt=\"image_thumb[4]_thumb_thumb\" loading=\"lazy\"></p> <p> </p> <p> 5. Deje que Windows termine la descarga y la verificación. <br> 6. Cuando la verificación llega al 100%, <strong> desconecta tu computadora de Internet </strong> o configúrelo en &quot; <strong> Modo avión </strong> &quot;. <br> 7. Espere hasta que Windows actualice su sistema. <br> 8. Cuando se le solicite, reinicie su sistema para instalar la actualización. </p> <h6></h6> <h6> Método 3. Actualice Windows 10 desde ISO / USB. </h6> <p> El siguiente método del error de actualización de Windows 10 0x80070643 &quot;es actualizar Windows 10, desde el archivo ISO de Windows. Para hacer eso: </p> <p><strong> Paso 1. Descargue Windows 10 en un archivo ISO. </strong></p> <p> 1. Navega a <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Página de descarga de Windows 10 </a> y descarga el <strong> Herramienta de creación de medios </strong> . </p> <p><img src=\"images/image_thumb5_thumb_thumb_thumb-955.png\" alt=\"image_thumb[5]_thumb_thumb\" loading=\"lazy\"></p> <p> </p> <p> 2. Ejecute la &#39;Herramienta de creación de medios&#39; y <strong> Aceptar </strong> los términos de la licencia en la primera pantalla. <br> 3. Seleccione <strong> Cree medios de instalación para otra PC </strong> . </p> <p><img src=\"images/image_thumb1_thumb-422.png\" alt=\"create Windows 10 DVD\" loading=\"lazy\"></p> <p> </p> <p> 4. En la pantalla &quot;Idioma, arquitectura y edición&quot;, haga clic en <strong> Próximo. <br> </strong> 5. Seleccione <strong> Archivo ISO </strong> y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb-30-671.png\" alt=\"download windows 10 iso\" loading=\"lazy\"></p> <p> 6. <strong> Ahorrar </strong> el archivo &#39;Windows.iso&#39; en su escritorio. <br> 7. La herramienta de creación de medios comenzará ahora a descargar Windows 10 en formato ISO. <br> 8. Cuando se complete la descarga, <strong> cerca </strong> la herramienta de creación de medios. </p> <p> </p> <p><strong> Paso 2. Actualice Windows 10 desde el archivo ISO. </strong></p> <p> 1. <strong> Desconecte su computadora de Internet </strong> , (o configúrelo en &quot;Modo avión&quot; si posee una computadora portátil). <br> 2. <strong> Desactivar </strong> o <strong> desinstalar temporalmente </strong> alguna <strong> antivirus de terceros </strong> . <br> 3. Luego, haga clic derecho en el archivo &quot;Windows.iso&quot; (en su escritorio) y haga clic en <strong> Montar </strong> . <br> 4. Haga doble clic en <strong> Configuración </strong> solicitud. </p> <p><img src=\"images/image_thumb-36-185.png\" alt=\"windows 10 setup\" loading=\"lazy\"></p> <p> </p> <p> 5. En la siguiente pantalla, elija <strong> &#39;No ahora&#39; </strong> y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb-11-241.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Siga las demás instrucciones en pantalla para actualizar su sistema. </p> <p> </p> <h6> Método 4. Instalación limpia de Windows 10. </h6> <p> El último método, para solucionar los problemas de actualización de Windows 10, es realizar una instalación limpia de Windows 10 en su sistema. </p> <p><strong> Importante: </strong> La instalación limpia de Windows 10 significa que todos sus archivos y configuraciones se perderán durante el proceso de instalación. Entonces, proceda y <strong> Haga una copia de seguridad de todos sus archivos y configuraciones importantes en otro medio de almacenamiento antes de continuar </strong> . (por ejemplo, a una unidad USB externa). </p> <p> Para realizar una instalación limpia de Windows 10, lea las instrucciones de este artículo: <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo limpiar instalar Windows 10 </a></p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}