{"title":"REVISIÓN: No hay versiones anteriores disponibles en Windows 10 (resuelto)","content":"<p> En una computadora basada en Windows 10 con <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Proteccion del sistema </a> habilitado, el siguiente problema aparece al intentar restaurar un archivo / carpeta usando la función &#39;Restaurar versiones anteriores&#39;: &quot;No hay versiones anteriores disponibles&quot;. </p> <p> <img src=\"images/image_thumb-39-628.png\" alt=\"There No Previous Versions Available in Windows 10 \" loading=\"lazy\"></p> <p> </p> <p> El error &quot;No hay versiones anteriores disponibles&quot; ocurre porque en Windows 10 la función &quot;Restaurar versiones anteriores&quot; solo funciona si ha configurado el <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Historial del archivo </a> &#39;para hacer una copia de seguridad de sus archivos. Esto significa que la función &#39;Restaurar versiones anteriores&#39; en Windows 10, busca en la ubicación de la copia de seguridad de la &quot;Herramienta de copia de seguridad del historial de archivos&quot; para encontrar una versión anterior de un archivo / carpeta, y no en los Puntos de restauración del sistema, como sucede en Windows 7. Para habilitar el Historial de archivos en Windows 10, siga las instrucciones de los siguientes artículos: </p> <ul> <li><strong> Artículos relacionados: </strong></li> <li> <ul> <li><a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo hacer una copia de seguridad de archivos personales con el historial de archivos en Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo crear instantáneas de sus archivos con el programador de tareas en Windows 10 </a></li> </ul> </li> </ul> <h4> Cómo REPARAR: No hay versiones anteriores de archivos disponibles en Windows 10. </h4> <p> Si &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Historial del archivo </a> &#39;ya está habilitado * en su PC con Windows 10, pero recibe el mensaje &quot;No hay versiones anteriores disponibles&quot;, cuando intenta restaurar la versión anterior de un archivo o carpeta, siga las instrucciones a continuación: </p> <p> * Nota: las siguientes instrucciones <strong> no funciona si el <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> El historial de archivos YA no está habilitado </a></strong> en su PC con Windows 10. </p> <p> 1. Descargue e instale el <a href=\"http://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> Explorador de sombras </a> utilidad en su PC. <br> 2. Abra &#39;ShadowExplorer&#39; y seleccione la fecha desde la que desea restaurar el archivo. * </p> <p> * Nota: Si no ve una fecha anterior, significa que el Historial de archivos está desactivado. Tenga en cuenta que incluso si activa el historial de archivos ahora, el resultado será el mismo, porque el historial de archivos crea instantáneas de sus archivos desde el momento en que se activa y luego. </p> <p><img src=\"images/image_thumb-40-348.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Navegue hasta la ubicación de almacenamiento del archivo / carpeta que desea restaurar a su versión anterior. <br> 4. Cuando encuentre el archivo que desea restaurar, haga clic derecho sobre él y seleccione <strong> Exportar </strong> . </p> <p><img src=\"images/image_thumb-41-653.png\" alt=\"restore previous versions shadow explorer\" loading=\"lazy\"></p> <p> </p> <p> 5. Seleccione un disco diferente (ubicación) para guardar el archivo restaurado y haga clic en <strong> OK </strong> . * </p> <p><strong> Importante: </strong> Guarde los archivos restaurados en otro disco (por ejemplo, una unidad flash) y, solo después de asegurarse de tener los archivos correctos, cópielos en la ubicación original para evitar sobrescribir los archivos originales. </p> <p><img src=\"images/image_thumb-38-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este problema. </p>"}