{"title":"REVISIÓN: El complemento de Outlook está instalado para todos los usuarios y no se puede eliminar. (Resuelto)","content":"<p> Si no puede deshabilitar o habilitar un complemento de Outlook debido a un error &quot; <em> El complemento está instalado para todos los usuarios de esta computadora y solo un administrador puede conectarlo o desconectarlo </em> &quot;, continúe leyendo a continuación para resolver el problema. </p> <p><img src=\"images/image_thumb-76-527.png\" alt=\"The add-is installed for all users on this computer, and can only be connected or disconnected by an administrator\" loading=\"lazy\"></p> <p> Aparece el error &quot;El complemento solo puede ser deshabilitado por un administrador&quot; porque cuando instaló el complemento, elige instalarlo para todos los usuarios del equipo. En este caso, la única solución para resolver el error es desinstalar el complemento mediante privilegios administrativos. </p> <h2> Cómo corregirlo: No se puede habilitar o deshabilitar el complemento porque está instalado para todos los usuarios en Outlook, Word o Excel. </h2> <p> Si no puede eliminar o activar un complemento de una aplicación de Microsoft Office, debido a un error &quot; <em> El complemento está instalado para todos los usuarios de esta computadora y solo un administrador puede conectarlo o desconectarlo &quot;, </em> Lanza la aplicación correspondiente como Administrador y procede a eliminar el Complemento sin problemas. Para hacer eso: </p> <p><strong> 1. </strong> Haga clic con el botón derecho en la aplicación de Office, donde se encuentra con el error mencionado anteriormente (por ejemplo, Outlook), y seleccione <strong> Ejecutar como administrador. * </strong></p> <p> * Notas: <strong><br> </strong> 1. Si no ve la opción &quot;Ejecutar administrador&quot;, mantenga presionada la tecla <strong> CAMBIAR </strong> clave y <strong> botón derecho del ratón </strong> en la aplicación de Office se enfrenta al error. <br> 2. Si hace clic con el botón derecho en la aplicación de Office desde Windows 10 <strong> Comienzo </strong> menú <img src=\"images/image_thumb2_thumb_thumb-340.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Programas </strong> , ir <strong> Más </strong> &gt; <strong> Ejecutar como administrador. </strong></p> <p><img src=\"images/image_thumb-77-661.png\" alt=\"FIX: Unable to Enable or Disable Add-in \" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Cuando se le solicite que permita que esta aplicación realice cambios en su dispositivo, elija <strong> Si. </strong></p> <p><img src=\"images/image_thumb-78-120.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Después de abrir la aplicación de Office, proceda a deshabilitar o habilitar el complemento que desee. Esta vez, el complemento se eliminará sin problemas. </p> <p> ¡Eso es! Déjame saber si esta guía te ha ayudado dejando tu comentario sobre tu experiencia. Por favor, haga clic en Me gusta y comparta esta guía para ayudar a otros. </p>"}