{"title":"REVISIÓN: HDMI No hay sonido en la TV o HDMI no se muestra en los dispositivos de reproducción (resuelto).","content":"<p> Si conectó su televisor a su computadora portátil con un cable HDMI y no hay salida de sonido mientras reproduce un video, o el HDMI no se muestra como un dispositivo de reproducción, continúe leyendo este tutorial. </p> <p> Problema en detalles: en una computadora portátil con Windows 10, el dispositivo de salida digital (HDMI) no aparece como dispositivo de reproducción y no hay salida de sonido cuando se conecta al televisor con un cable HDMI. </p> <p> El problema &quot;No hay salida de sonido desde HDMI&quot; en Windows 10 puede aparecer por varias razones, por lo que en esta guía encontrará instrucciones paso a paso para solucionar el problema. </p> <h2> Cómo FIX: No hay salida de sonido de HDMI y HDMI no se muestra en los dispositivos de reproducción en Windows 10 * </h2> <p> * Sugerencias: antes de continuar con los pasos a continuación: </p> <ul> <li><strong> Botón derecho del ratón </strong> en el <strong> icono de sonido </strong><img src=\"images/image_thumb-11-109.png\" alt=\"image\" loading=\"lazy\"> en la barra de tareas para <strong> Mezclador de volumen abierto </strong> y asegúrese de que el <strong> Dispositivo de salida digital </strong> no está silenciado. </li> <li> Asegúrese de que el cable HDMI esté conectado correctamente tanto en la computadora portátil como en el televisor. </li> <li> Después de conectar el cable HDMI, <strong> Reanudar </strong> tu computadora. </li> <li> En el televisor, configure el puerto HDMI correcto como dispositivo de entrada de video. </li> <li> Si tiene una computadora portátil, cierre la tapa o presione el botón de encendido una vez para ponerla en suspensión. Luego presione nuevamente el botón de encendido y verifique el sonido del HDMI nuevamente. </li> <li> Compruebe si el problema persiste con otro cable HDMI. </li> </ul> <p> </p> <h3> Paso 1. Configure HDMI como dispositivo de reproducción predeterminado. </h3> <p> El primer paso para resolver los problemas de audio HDMI en Windows 10 es configurar HDMI como el dispositivo de audio predeterminado. </p> <p> 1. Navega a Windows <strong> Panel de control </strong> y abrir <strong> Sonar. </strong></p> <p><img src=\"images/image_thumb-14-686.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2.Asegúrate de que <strong> Salida digital </strong> (HDMI) es el <strong> Defecto </strong> dispositivo de reproducción; de lo contrario, seleccione el <strong> Salida digital </strong> dispositivo y haga clic en el <strong> Establecer predeterminado </strong> botón. Cuando termine, reproduzca un video para probar el sonido HDMI y, si el problema persiste, continúe con el siguiente paso. * </p> <p><img src=\"images/image_thumb-43-106.png\" alt=\"FIX: HDMI No Sound Output \" loading=\"lazy\"></p> <p> </p> <p> * Notas: Intente lo siguiente, según su caso: </p> <p> 1. Si el <strong> Salida digital </strong> dispositivo es <strong> discapacitado </strong> , haga clic derecho sobre él y haga clic en <strong> Permitir </strong> . Luego resáltalo y presiona <strong> Establecer predeterminado </strong> . </p> <p><img src=\"images/image_thumb-44-233.png\" alt=\"FIX: HDMI Not Listed in Playback devices \" loading=\"lazy\"></p> <p> 2. Si el dispositivo de salida digital no se muestra como un dispositivo de reproducción: </p> <blockquote><p> una. Haga clic con el botón derecho en un espacio en blanco y asegúrese de que tanto el <strong> Mostrar dispositivos deshabilitados </strong> y el <strong> Mostrar dispositivos desconectados </strong> las opciones están seleccionadas (marcadas). Si alguna de las opciones anteriores no está seleccionada, haga clic en ella para seleccionarla. </p></blockquote> <p><img src=\"images/image_thumb-45-410.png\" alt=\"Enable HDMI DIgital Output\" loading=\"lazy\"></p> <blockquote><p> B. Luego haga clic derecho en Dispositivo de salida digital y elija <strong> Permitir. <br> C. </strong> Cuando termine, establezca como <strong> defecto </strong> la <strong> Salida digital </strong> dispositivo. </p> </blockquote> <h3><br clear=\"all\"> Paso 2. Revertir el controlador de la tarjeta de sonido. </h3> <p> En algunos casos, el problema &quot;HDMI no hay sonido en el televisor&quot; puede aparecer después de una actualización automática del controlador. Entonces, proceda y deshaga el controlador de audio. </p> <p> 1. Abrir <strong> Administrador de dispositivos </strong> . Para hacer eso: </p> <blockquote><p> 1. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-781.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. En el cuadro &quot;Abrir&quot;, escriba: <strong> devmgmt.msc </strong> &amp; haga clic <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-5-389.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Expandir </strong> la <strong> Controladores de sonido, video y juegos. <br> 3. Haga clic derecho </strong> sobre el <strong> Dispositivo de audio de alta definición </strong> y seleccione <strong> Propiedades. </strong></p> <p><img src=\"images/image_thumb-17-970.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. En la pestaña Controlador, haga clic en <strong> Controlador de retroceso </strong> botón. <strong> * </strong></p> <p> * Nota: Si el botón Revertir controlador está inactivo, continúe con el siguiente paso. </p> <p><img src=\"images/image_thumb-18-921.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> 5. Seleccione un motivo para la reversión del paquete de controladores y haga clic en <strong> Si. </strong></p> <p><img src=\"images/image_thumb-19-748.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Cuando se complete la reversión del controlador, <strong> Reanudar </strong> tu computadora. <br> 5. Después de reiniciar, proceda y pruebe el sonido del HDMI. Si aún no puede escuchar el sonido en su televisor, continúe con el siguiente paso. </p> <h3> Paso 3. Cambie el controlador de la tarjeta de sonido. </h3> <p> La ausencia de sonido a menudo se debe a un controlador de tarjeta de sonido incorrecto. Para solucionar este problema: </p> <p> 1. Abrir <strong> Administrador de dispositivos. </strong><br> 2. <strong> Expandir </strong> la <strong> Controladores de sonido, video y juegos. <br> </strong> 3. <strong> Botón derecho del ratón </strong> a <strong> Realtek High Definition Audio </strong> dispositivo y seleccione <strong> Actualizar controlador. <br> </strong></p> <p><img src=\"images/image_thumb-6-937.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Seleccione <strong> Busque controladores en mi computadora. </strong></p> <p><img src=\"images/image_thumb-7-874.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Seleccione <strong> Permítame elegir de una lista de controladores disponibles en mi computadora </strong> . </p> <p><img src=\"images/image_thumb-8-498.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. En la siguiente pantalla, seleccione el <strong> Dispositivo de audio de alta definición </strong> y haga clic en <strong> Próximo. </strong></p> <p><img src=\"images/image_thumb-20-756.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/07/image-10.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 8. Cuando se complete la instalación del controlador, <strong> Reanudar </strong> tu computadora. <br> 9. Después de reiniciar, continúe y pruebe el sonido de los parlantes de la computadora portátil. </p> <h3> Paso 4. Desinstale y vuelva a instalar el controlador de la tarjeta de sonido. </h3> <p> 1. Abrir <strong> Administrador de dispositivos. </strong><br> 2. <strong> Expandir </strong> la <strong> Controladores de sonido, video y juegos. <br> </strong> 3. <strong> Botón derecho del ratón </strong> a <strong> Audio de alta definición </strong> dispositivo y seleccione <strong> Desinstalar dispositivo. </strong></p> <p><img src=\"images/image_thumb-21-678.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. Después de la desinstalación, <strong> Reanudar </strong> su computadora y deje que Windows instale los controladores de sonido automáticamente. Si esto no sucede, navegue hasta <strong> Ajustes </strong> &gt; <strong> Actualización y seguridad </strong> y obligar a Windows a <strong> Busque actualizaciones. </strong></p> <p> </p> <h3> Paso 5. Desinstale y vuelva a instalar el adaptador de pantalla. </h3> <p> 1. Abrir <strong> Administrador de dispositivos. <br> </strong> 2. <strong> Expandir </strong> la <strong> Adaptadores de pantalla. <br> </strong> 3. <strong> Botón derecho del ratón </strong> en el adaptador de pantalla instalado y seleccione <strong> Desinstalar dispositivo. </strong></p> <p><img src=\"images/image_thumb-46-871.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. Después de la desinstalación, <strong> Reanudar </strong> su computadora y deje que Windows instale los controladores de pantalla automáticamente. Si esto no sucede, o si aún tiene el problema, navegue hasta el sitio de soporte del fabricante de su computadora portátil y descargue los controladores de pantalla más recientes según el modelo de su computadora portátil. </p> <p> ¡Eso es todo amigos! ¿Qué método te funcionó? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}