{"title":"REVISIÓN: YouTube no funciona en Chrome (resuelto)","content":"<p> Unos días antes, encontré el siguiente problema en una computadora con Windows: YouTube no funciona en Chrome (los videos no se reproducen). Si no puede ver videos en YouTube u otros sitios web con Google Chrome, porque la ventana del video está en negro, lea este tutorial para solucionar el problema. </p> <p><img src=\"images/image_thumb-19-778.png\" alt=\"FIX YouTube Not Working on Chrome \" loading=\"lazy\"></p> <h4> Cómo CORREGIR: YouTube o videos en línea que no se cargan en el navegador Chrome. </h4> <p> Cuando los videos de YouTube no se cargan en Chrome, proceda a resolver el problema siguiendo los pasos a continuación. </p> <h6> Paso 1. Verifique si puede ver videos con otro navegador. </h6> <p> El primer paso es determinar si el problema de &quot;YouTube no funciona&quot; reside solo en Google Chrome o en todos los demás navegadores instalados. Por lo tanto, abra cualquier otro navegador web (por ejemplo, &#39;Internet Explorer&#39;) y verifique si puede ver videos de YouTube. Si tiene el mismo problema, verifique su conexión a Internet y, si está bien, actualice los controladores en su adaptador de pantalla. Si puede ver videos de YouTube con otro navegador, continúe con el siguiente paso. </p> <p> </p> <h6> Paso 2. Desactive la aceleración de hardware en Chrome. </h6> <p> El siguiente paso para resolver el problema &quot;Los videos de YouTube no se cargan en Chrome&quot; es desactivar la aceleración de hardware en el navegador Chrome. Para hacer eso: </p> <p> 1. Desde el menú de Chrome <img src=\"images/image_thumb-78-483.png\" alt=\"image\" loading=\"lazy\"> Seleccione <strong> Ajustes </strong> . </p> <p><img src=\"images/image_thumb-79-661.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. En <strong> Ajustes </strong> página, desplácese hacia abajo y haga clic en <strong> Avanzado </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Arrastre el <strong> Usar aceleración de hardware cuando este disponible </strong> cambiar a <strong> APAGADO </strong> y luego haga clic en <strong> Relanzar. </strong></p> <p><img src=\"images/image_thumb-16-156.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Compruebe si puede ver videos de YouTube ahora. Si no es así, continúe con el paso 3. </p> <p> </p> <h6> Paso 3. Borre los datos de navegación (cookies, caché, etc.). </h6> <p> El siguiente paso para resolver el problema &quot;El video de YouTube no se carga&quot; en Chrome es eliminar los datos de navegación. Para ello: </p> <p> 1. Desde el menú de Chrome <img src=\"images/image_thumb-78-896.png\" alt=\"image\" loading=\"lazy\"> Seleccione <strong> Más herramientas </strong> &gt; <strong> Eliminar datos de navegación </strong> . </p> <p><img src=\"images/image_thumb-17-593.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. En Borrar opciones de datos de navegación, seleccione <strong> Todo el tiempo </strong> (en &#39;Intervalo de tiempo&#39;) y luego haga clic en <strong> Borrar datos </strong> . </p> <p><img src=\"images/image_thumb-18-321.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Reinicie Chrome e intente ver un video de YouTube. Si el problema persiste, continúe con la siguiente solución. </p> <p> </p> <h6> Paso 4: Elimina la configuración y los datos almacenados en tu perfil de Chrome. </h6> <p> A veces, el navegador Chrome no funciona normalmente si el perfil de Chrome está dañado. Por lo tanto, un método sencillo para resolver los problemas de Chrome es volver a crear la carpeta del perfil de Chrome. Para hacer eso: </p> <p><strong> 1. </strong> <strong> Simultaneamente </strong> prensa &quot; <strong> Ventanas </strong> &quot;+&quot; <strong> R </strong> &quot;Teclas para abrir el <em> CORRER </em> ventana. </p> <p><strong> 2. </strong> En <em> CORRER </em> ventana copie y pegue el siguiente comando de acuerdo con su sistema operativo Windows y presione <strong> OK </strong> : </p> <ul> <li><strong> Windows 10, 8, 7 o Vista: </strong> <ul> <li><strong> % LOCALAPPDATA% \\ Google \\ Chrome \\ </strong></li> </ul> </li> </ul> <p><img src=\"images/image_thumb4-325.png\" alt=\"chrome profile data\" loading=\"lazy\"></p> <ul> <li><strong> Windows XP: </strong> <ul> <li><strong> % PERFIL DE USUARIO% \\ Configuración local \\ Datos de aplicación \\ Google \\ Chrome \\ </strong></li> </ul> </li> </ul> <p> </p> <p> 3. <strong> Rebautizar </strong> la carpeta &#39;Datos de usuario&#39; a &quot;Datos de usuario.OLD&quot;, o <strong> Eliminar* </strong> la carpeta &#39;Datos de usuario&#39;. </p> <p><strong> * Nota IMPORTANTE: </strong> Tenga en cuenta que, al eliminar la carpeta de almacenamiento de su perfil de Chrome, elimina todos los datos almacenados (Marcadores, Contraseñas, Configuración, Extensiones, Historial, etc.). Entonces, antes de eliminar su perfil, tome un <a href=\"https://www.repairwin.com/how-to-backup-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> copia de seguridad de sus marcadores de Chrome </a> y <a href=\"https://www.repairwin.com/how-to-view-and-export-chrome-passwords/\" target=\"_blank\" rel=\"nofollow noopener\"> almacenar sus contraseñas de Chrome. </a></p> <p> </p> <p><img src=\"images/image_thumb11_thumb-690.png\" alt=\"chrome profile storage folder\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Abierto </strong> Google Chrome, intente ver un video de YouTube. </p> <h6></h6> <h6> Otras soluciones para resolver el problema &quot;Los videos de YouTube no se abren en Chrome&quot;. </h6> <blockquote><p><strong> 1. </strong> Actualiza Google Chrome. (Desde el menú de Chrome <img src=\"images/image_thumb-78-732.png\" alt=\"image\" loading=\"lazy\"> hacer clic <strong> Ayudar </strong> y luego seleccione <strong> Acerca de Google Chrome </strong> .) </p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Revise su computadora en busca de virus, malware, etc. </a></p> <p><strong> 3. </strong> Actualice los controladores del Adaptador de pantalla. </p> <p><strong> 4. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Desinstale y vuelva a instalar Chrome por completo </a> . </p> <p><strong> 5. </strong> Utilice otro navegador web. </p></blockquote> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}