{"title":"REVISIÓN: El instalador de Microsoft Office encontró un problema debido a los programas de Office basados ​​en el instalador de Hacer clic para ejecutar (resuelto).","content":"<p> Este tutorial contiene instrucciones para resolver el error de instalación de Office &quot;¡Encontramos un problema! Lo sentimos, el instalador de Microsoft Office encontró un problema porque tiene estos programas de Office basados ​​en hacer clic y ejecutar instalados en su computadora: Microsoft Office Professional&quot;. </p> <p> El error anterior aparece comúnmente cuando intenta instalar Visio, Project, Skype for Business o OneDrive for Business, mientras tiene Microsoft Office 2019, 2016 o 2013 Professional Plus o Standard, ya instalado en su computadora. </p> <p><img src=\"images/image_thumb-12-962.png\" alt=\"FIX: Microsoft Office Installer encountered a problem because of Click to Run installer based Office programs \" loading=\"lazy\"></p> <p> El error &quot;Lo sentimos, el instalador de hacer clic y ejecutar de Office encontró un problema porque tiene estos programas de Office basados ​​en el instalador de Windows instalados en su computadora&quot;, aparece porque las versiones más recientes de Office (2013, 2016, 2019, 365) usan la tecnología &quot;Click-to-Run&quot; para la instalación, mientras que las ediciones por volumen de estas versiones utilizan la &quot;tecnología Windows Installer (MSI)&quot;. Esto significa que solo puede tener instalado un tipo de instalador a la vez. </p> <h4> Cómo CORREGIR: El instalador de Microsoft Office encontró un problema debido a los programas de Office basados ​​en el instalador Click to Run. </h4> <h6> Método 1. Desinstalar Haga clic para ejecutar los instaladores. </h6> <p> 1. Presione <strong> Ventanas </strong> <img src=\"images/image_thumb41-136.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> instalador </strong> y presione <strong> Ingresar </strong> para navegar a la carpeta &quot;C: \\ Windows \\ Installer&quot;. </p> <p><img src=\"images/image_thumb5_thumb-550.png\" alt=\"image_thumb[5]\" loading=\"lazy\"></p> <p> 3. Desde el <strong> Vista </strong> menú, haga clic en <strong> Agregar columnas </strong> y luego haga clic en <strong> Elija columnas </strong></p> <p><img src=\"images/image_thumb9_thumb-870.png\" alt=\"image_thumb[9]\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Cheque </strong> la <strong> Sujeto </strong> y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb13_thumb-850.png\" alt=\"image_thumb[13]\" loading=\"lazy\"></p> <p><a href=\"file:///C:/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/supfiles10B8394/image%5B20%5D.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 5. Ordene los resultados por Asunto y luego desplácese hacia abajo hasta que encuentre el &quot; <em> Componente de localización de hacer clic y ejecutar de Office 16 &quot; </em> . </p> <p><img src=\"images/image_thumb-16-433.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Cuando lo encuentre, haga clic derecho sobre él y elija <strong> Desinstalar </strong> . * </p> <p> * Nota: si se usa, vea más de uno &quot; <em> Componentes de localización de hacer clic y ejecutar de Office 16 &quot;, </em> luego proceda y desinstálelos todos. </p> <p><img src=\"images/image_thumb-17-609.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7. Cuando se complete la desinstalación, proceda a instalar Microsoft Office nuevamente. * </p> <p> * Nota: Si aún recibe el mismo error, proceda y desinstale todos los &quot;Componentes de hacer clic y ejecutar de Office 16&quot; e intente configurar Office nuevamente. </p> <h6></h6> <h6> Método 2. Descargue e instale la versión comercial del producto de Microsoft Office. </h6> <p> 1. Navega a <a href=\"https://www.heidoc.net/joomla/technology-science/microsoft/67-microsoft-windows-iso-download-tool\" target=\"_blank\" rel=\"nofollow noopener\"> HeiDoc.net </a> y descarga el <strong><a href=\"https://www.heidoc.net/php/Windows-ISO-Downloader.exe\" target=\"_blank\" rel=\"nofollow noopener\"> Herramienta de descarga ISO de Windows </a></strong> . <br> 2. Haga doble clic para ejecutar el archivo descargado &quot;Windows-ISO-Downloader.exe&quot;. <br> 3. En el panel derecho, seleccione el <strong> Oficina </strong> y luego seleccione la versión e idioma del producto de Office que desea instalar. <br> 4. Cuando termine, haga clic en <strong> Descargar. </strong></p> <p><img src=\"images/image_thumb-13-868.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Cuando se complete la descarga, haga clic con el botón derecho en el archivo de imagen descargado y haga clic en <strong> Montar. </strong></p> <p><img src=\"images/image_thumb-18-609.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Haga doble clic en <strong> Setup.exe </strong> para instalar el producto de Office. </p> <p><img src=\"images/image_thumb-15-851.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Método 3. Complete la desinstalación de la versión instalada de Office. </h6> <p> 1. Descarga el <a href=\"http://go.microsoft.com/?linkid=9815935\" target=\"_blank\" rel=\"nofollow noopener\"> Desinstalar Microsoft Office Fix </a> herramienta para eliminar automáticamente la versión de Windows Installer de Office 365, Office 2019, Office 2016 u Office 2013. </p> <p> 2. Ejecute &quot;Desinstalar Microsoft Office Fix&quot; y presione <strong> próximo </strong> en la primera pantalla. </p> <p><img src=\"images/image_thumb-19-947.png\" alt=\"office uninstall tool\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Deje que el proceso resuelva los problemas con Office Desinstale y elimine el software de Office de su computadora. </p> <p><img src=\"images/image_thumb-20-436.png\" alt=\"cannot uninstall office\" loading=\"lazy\"></p> <p> 4. Cuando se complete la desinstalación, reinicie su máquina e intente instalar Microsoft Office nuevamente. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Por favor, deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a correr la voz sobre esto. </p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-22.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p>"}