{"title":"REVISIÓN: No se puede conectar al recurso compartido de archivos porque no es seguro y requiere el protocolo SMB1 obsoleto. (Resuelto)","content":"<p> Si intenta conectarse a una carpeta compartida de red desde una PC con Windows 10 y recibe el error &quot;No puede conectarse al recurso compartido de archivos porque no es seguro. Este recurso compartido requiere el protocolo SMB1 obsoleto, que no es seguro y podría exponer su sistema para atacar. Su sistema requiere SMB2 o superior. Para obtener más información sobre cómo resolver este problema, consulte: https://go.microsoft.com/fwlink/?linkid=852747 &quot;, luego continúe a continuación para solucionar el problema. </p> <p><img src=\"images/image_thumb-30-812.png\" alt=\"You can't connect to the file share because it's not secure. This share requires the obsolete SMB1 protocol, which is unsafe...\" loading=\"lazy\"></p> <p> En Windows 10 v1709 y versiones posteriores, el protocolo de red Server Message Block versión 1 (SMBv1) no está instalado de manera predeterminada y debe habilitarse manualmente si desea acceder a una carpeta compartida en una estación de trabajo o servidor, que utiliza el protocolo SMBv1 para compartición de archivos. </p> <p> Este tutorial contiene instrucciones para resolver los siguientes errores al intentar conectarse a una carpeta compartida en Windows 10: </p> <ul> <li> <p><em> No puede conectarse al recurso compartido de archivos porque no es seguro. Este recurso compartido requiere el protocolo SMB1 obsoleto, que no es seguro ... </em></p> </li> <li> <p><em> El nombre de red especificado ya no está disponible </em></p> </li> <li> <p><em> Error no especificado 0x80004005 </em></p> </li> <li> <p><em> El servidor especificado no puede realizar la operación solicitada. </em></p> </li> </ul> <h4> Cómo CORREGIR: No se puede conectar al recurso compartido de archivos porque falta el protocolo SMBv1 (Windows 10) </h4> <p> 1. Navega a <strong> Panel de control </strong> -&gt; <strong> Programas y características </strong> . <br> 2. Haga clic en <strong> Activar o desactivar las características de windows </strong> desde la izquierda. </p> <p> </p> <p><img src=\"images/image_thumb-68-359.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Expanda la opción &#39;Soporte para compartir archivos SMB 1.0 / CIFS&#39; y <strong> cheque </strong> la <strong> Cliente SMB 1.0 / CIFS </strong> opción. Hacer clic <strong> OK </strong> cuando termine. </p> <p><img src=\"images/image_thumb-29-360.png\" alt=\"Install SMBv1 Windows 10\" loading=\"lazy\"></p> <p> 4. Cuando esté instalado SMB 1.0 / CIFS y luego haga clic en el <strong> Reiniciar ahora </strong> para reiniciar su PC. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}