{"title":"REVISIÓN: Drenaje de la batería en Windows 10 (resuelto)","content":"<p> Con Windows 10, muchos usuarios se quejan de que la batería de su computadora portátil se agota rápidamente incluso con poco uso o incluso cuando se apaga por completo. Este problema de &quot;descarga de batería&quot; en Windows 10 ocurre por dos razones básicas. La primera razón es que Windows 10 carga demasiadas aplicaciones en segundo plano que consumen energía de la batería incluso si no se están utilizando. </p> <p> La siguiente razón, que causa la descarga de la batería, incluso en el apagado completo, es la función de &quot;Inicio rápido&quot;. Windows 10 (y Windows 8 / 8.1) tiene habilitada de forma predeterminada la función &quot;Inicio rápido&quot;, que permite que el sistema se inicie y se inicie más rápido. De hecho, cuando el &quot;Inicio rápido&quot; está habilitado, Windows 10 no realiza un apagado completo del sistema y se reanuda desde un estado de hibernación. </p> <p> En este tutorial encontrará instrucciones para evitar que Windows 10 agote la energía de la batería. </p> <h4> Cómo SOLUCIONAR el problema del drenaje de la batería en Windows 10. </h4> <p> </p> <h6> Paso 1. Evite que las aplicaciones se ejecuten en segundo plano. </h6> <p> El primer paso para resolver el problema de descarga de la batería en Windows 10 es evitar que las aplicaciones se ejecuten en segundo plano. Para deshabilitar las aplicaciones en segundo plano: </p> <p> 1. Navega a <strong> Comienzo </strong> -&gt; <strong> Ajustes </strong> -&gt; <strong> Intimidad </strong> . <br> 2. Seleccione <strong> Aplicaciones en segundo plano </strong> a la izquierda, y luego a la derecha, ponga el &quot; <strong> Dejar que las aplicaciones se ejecuten en segundo plano &quot; </strong> cambiar a <strong> Apagado, </strong> o elija individualmente las aplicaciones que no desea ejecutar en segundo plano y desactívelas. </p> <p><img src=\"images/image_thumb-8-676.png\" alt=\"Prevent Apps from Running in the Background - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Paso 2. Encienda el Ahorro de batería. </h6> <p> El siguiente paso es habilitar el ahorro de batería para extender la vida útil de la batería al limitar la actividad en segundo plano. </p> <p> 1. Navega a <strong> Comienzo </strong> -&gt; <strong> Ajustes </strong> -&gt; <strong> Sistema </strong> . <br> 2. En <strong> Batería </strong> opciones: </p> <blockquote> <p> una. Haga clic en &quot;Ver qué aplicaciones están afectando la duración de la batería&quot; para averiguar el uso de la batería de las aplicaciones abiertas. <br> B. <strong> Cheque </strong> la &quot; <strong> Activar el ahorro de batería automáticamente si mi batería falla a continuación &quot; </strong> casilla de verificación y mueva el control deslizante a una posición adecuada. <br> C. Además, seleccione &quot;Reducir el brillo de la pantalla mientras está en modo de ahorro de batería. </p> </blockquote> <p><img src=\"images/image_thumb-9-289.png\" alt=\"turn on battery saver Windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Paso 3. Desactive el inicio rápido. </h6> <p> El siguiente paso es forzar el cierre completo de Windows 10, desactivando la función de inicio rápido. </p> <p> 1. Navega a <strong> Comienzo </strong> -&gt; <strong> Ajustes </strong> -&gt; <strong> Sistema </strong> . <br> 2. En <strong> Energía </strong> opciones haga clic en <strong> Configuraciones de energía adicionales. </strong></p> <p><img src=\"images/image_thumb-10-405.png\" alt=\"FIX Battery Drain in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Seleccione <strong> Elige lo que hacen los botones de encendido </strong> A la izquierda. </p> <p><img src=\"images/image_thumb-11-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Luego haga clic en <strong> Cambiar la configuración que actualmente no está disponible </strong> . </p> <p><img src=\"images/image_thumb-12-235.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> Desmarcar </strong> la <strong> Activar inicio rápido (recomendado) </strong> opción y haga clic en <strong> Guardar cambios. * </strong></p> <p> * Nota: Si la opción de inicio rápido ya estaba desmarcada, márquela y reinicie su computadora. Después de reiniciar, desmárquelo y reinicie su computadora nuevamente. </p> <p><img src=\"images/image_thumb-13-410.png\" alt=\"Turn Off Fast Startup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Reanudar </strong> tu computadora. </p> <h6></h6> <h6> Paso 4. Desactive la hibernación. </h6> <p> La &#39;Hibernación&#39; es una función de energía, que usa menos energía que la suspensión y cuando enciendes la PC nuevamente, estás de regreso donde lo dejaste. En algunos casos, la función de hibernación hace que su PC con Windows 10 no se apague por completo. Para deshabilitar la hibernación: </p> <p> </p> <p> 1. En el cuadro de búsqueda, escriba: <strong> símbolo del sistema </strong> o <strong> cmd <br> </strong> 2. Haga clic derecho en <strong> Símbolo del sistema y seleccione Ejecutar como administrador </strong></p> <p><img src=\"images/image_thumb-14-379.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. En el símbolo del sistema, dé el siguiente comando y presione <strong> Ingresar. </strong></p> <ul> <li><strong> powercfg -h off </strong></li> </ul> <p><img src=\"images/image_thumb-15-234.png\" alt=\"Disable Hibernate Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. <strong> Reanudar </strong> tu computadora. * </p> <p> * Nota: Si desea volver a habilitar la función &#39;Hibernar&#39;, simplemente escriba este comando en el símbolo del sistema administrativo: </p> <ul> <li> <ul> <li> powercfg -h off </li> </ul> </li> </ul> <p> </p> <h6> Paso 5. Modifique la configuración de energía en el adaptador de red. </h6> <p> El siguiente método para solucionar el problema de descarga de la batería en Windows 10 es modificar la configuración de energía en los adaptadores de red. </p> <p> 1. Abrir <strong> Administrador de dispositivos </strong> . <br> 2. Expandir <strong> Adaptadores de red </strong> . <br> 3. Haga clic con el botón derecho en el adaptador de red instalado y seleccione <strong> Propiedades </strong> . <br> 3. Seleccione el <strong> Gestión de energía </strong> pestaña. <br> 4. <strong> Desmarcar </strong> la <strong> &#39;Permita que este dispositivo active la computadora </strong> &#39;casilla de verificación y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-7-574.png\" alt=\"modify power settings\" loading=\"lazy\"></p> <h6></h6> <h6> Paso 6. Revertir el controlador de interfaz del motor de administración Intel. </h6> <p> Si el problema de descarga de la batería aparece después de instalar una actualización de Windows 10, proceda y deshaga el controlador para la interfaz del motor de administración Intel. Para hacer eso: </p> <p> 1. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-592.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo: <strong> devmgmt.msc </strong> &amp; haga clic <strong> OK </strong> . <br> 3. Expandir <strong> Dispositivos de sistema </strong> . <br> 4. Haga clic derecho en <strong> Interfaz del motor de administración Intel </strong> y seleccione <strong> Propiedades </strong> . </p> <p><img src=\"images/image_thumb-5-532.png\" alt=\"device properties\" loading=\"lazy\"></p> <p> </p> <p> 5. Seleccione la pestaña Controlador y haga clic en <strong> Controlador de retroceso </strong> . * </p> <p> </p> <p> * Si el <strong> Controlador de retroceso </strong> El botón está atenuado, luego navegue al sitio de asistencia del fabricante de su computadora portátil o placa base para descargar e instalar una versión anterior del controlador para la interfaz del motor de administración Intel. </p> <p><img src=\"images/image_thumb-6-551.png\" alt=\"roll back driver\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Reanudar </strong> tu computadora. </p> <h6> Paso 7. Otras sugerencias para resolver el problema del drenaje de la batería. </h6> <p> 1. Reemplace el cargador de la computadora portátil y utilice siempre un cargador de marca para prolongar la vida útil de la batería. <br> 2. Si la batería de su computadora portátil es vieja, probablemente su capacidad haya bajado y deba ser reemplazada. Para diagnosticar el estado de la batería, utilice el <a href=\"http://www.nirsoft.net/utils/battery_information_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> BatteryInfoView </a> utilidad. </p> <p><img src=\"images/image_thumb-16-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este problema. </p>"}