{"title":"REVISIÓN: El registro del sistema contiene rutas no válidas en la actualización de Windows 10.","content":"<p> Si se encuentra con el error &quot;El registro del sistema contiene rutas de archivo no válidas. La instalación no puede continuar&quot; cuando intenta actualizar Windows 10 a una versión más reciente, continúe leyendo a continuación para solucionar el problema. </p> <p> El error de actualización de Windows 10 &quot;El registro del sistema contiene rutas no válidas&quot;, generalmente ocurre en computadoras portátiles donde Windows viene preinstalado por el fabricante, o en computadoras que carecen de actualizaciones importantes requeridas para la actualización. </p> <p> Problema en detalles: al intentar actualizar a Windows 10 usando el Asistente de actualización de Windows, la actualización de Windows 10 falla con el error &quot;El registro del sistema contiene rutas de archivo no válidas. La instalación no puede continuar. Esta imagen del sistema se aplicó sin garantizar que la asignación de letra de unidad coincidir en todas las computadoras &quot;, y el sistema vuelve a la versión anterior de Windows 10 con el mensaje:&quot; Cualquier cambio realizado en la computadora se deshará ... &quot; </p> <p><img src=\"images/image_thumb-63-716.png\" alt=\"image\" loading=\"lazy\"></p> <h2> Cómo REPARAR: El registro del sistema contiene rutas no válidas en Windows 10 Update / Upgrade. </h2> <p><strong> IMPORTANTE: </strong> Antes de continuar con el método siguiente, aplique las siguientes acciones: </p> <ol> <li> <p><strong> Instale todas las actualizaciones disponibles </strong> . ( <strong> Comienzo </strong> <img src=\"images/image_thumb2_thumb_thumb-898.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Ajustes </strong> <img src=\"images/image_thumb-66-786.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Actualización y seguridad -&gt; Buscar actualizaciones </strong> ) <strong> . </strong></p> </li> <li> <p> Descarga y <strong> Instalar en pc </strong> lo último <a href=\"https://portal.msrc.microsoft.com/en-us/security-guidance/advisory/ADV990001\" target=\"_blank\" rel=\"noopener\"> Pila de servicio </a> Actualice según su versión de Windows 10. </p> </li> </ol> <p> </p> <p> </p> <h3> Método 1. Eliminar entradas en variables de sistema. </h3> <p> A veces, el error &quot;El registro del sistema contiene rutas no válidas&quot; se produce debido a entradas no válidas o duplicadas en Variables de entorno del sistema. Entonces, proceda de la siguiente manera: </p> <p> 1. Haga clic con el botón derecho en el icono de su computadora (Esta PC) en el Explorador y seleccione <strong> Propiedades </strong> . <br> 2. Haga clic en <strong> Configuración avanzada del sistema </strong> . <br> 3. Haga clic en Variables de entorno. </p> <p><img src=\"images/image_thumb-64-288.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. En <strong> Variables del sistema </strong> Seleccione <strong> Camino </strong> y haga clic en <strong> Editar </strong> . </p> <p><img src=\"images/image_thumb-65-174.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Seleccione y <strong> Eliminar </strong> cualquier otra variable <strong> excepto lo siguiente </strong> : </p> <ul> <li> <p> % SystemRoot% \\ system32 </p> </li> <li> <p> % SystemRoot% </p> </li> <li> <p> % SystemRoot% \\ System32 \\ Wbem </p> </li> <li> <p> % SYSTEMROOT% \\ System32 \\ WindowsPowerShell \\ v1.0 \\ </p> </li> <li> <p> % SYSTEMROOT% \\ System32 \\ OpenSSH \\ </p> </li> </ul> <p> 6. Cuando termine, haga clic en <strong> OK </strong> 3 veces para aplicar el cambio y cerrar todas las ventanas. </p> <p><img src=\"images/image_thumb-66-470.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. <strong> Reanudar </strong> tu computador. </p> <p> 7. Intente instalar la actualización. </p> <h3> Método 2. Eliminar la letra de unidad en la partición reservada del sistema. </h3> <p> El segundo método para resolver el error de actualización de Windows 10 &quot;El registro del sistema contiene rutas no válidas&quot; es eliminar la letra de la unidad de la partición &quot;Sistema reservado&quot;. Para hacer eso: </p> <p> 1. Presione “ <strong> Ventanas </strong> &quot;+&quot; <strong> R </strong> ”Para abrir la ventana EJECUTAR. <br> 2. En el cuadro &quot;Abrir&quot; de la ventana &quot;EJECUTAR&quot;, escriba: <strong> diskmgmt.msc </strong> &amp; Prensa <strong> Ingresar. </strong></p> <p><img src=\"images/image_thumb-15-712.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. En Administración de discos, verifique si la partición reservada del sistema tiene una letra de unidad. * Si es así, <strong> botón derecho del ratón </strong> en él y seleccione <strong> Cambie las letras y las rutas de las unidades. </strong></p> <p><strong> * Nota: </strong> Si la partición reservada del sistema no tiene una letra de unidad, continúe con el método siguiente. </p> <p><img src=\"images/image_thumb-67-820.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Haga clic en <strong> Eliminar </strong> y <strong> está bien. </strong></p> <p><img src=\"images/image_thumb-68-195.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Intente actualizar Windows 10. </p> <p> </p> <h3> Método 3. FIX Error &quot;El registro del sistema contiene rutas no válidas&quot; mediante la reparación de archivos de sistema de Windows 10. </h3> <p> 1. Abrir <strong> Símbolo del sistema como administrador </strong> . <br> 2. En el símbolo del sistema, dé el siguiente comando y presione <strong> Ingresar: </strong></p> <ul> <li><strong> DISM.exe / En línea / Imagen de limpieza / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-732.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Cuando se complete la operación DISM, escriba el siguiente comando y presione <strong> Ingresar </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-950.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Ahora espere hasta que el Comprobador de archivos de sistema repare los archivos de sistema de Windows. <br> 5. Una vez hecho esto, <strong> Reanudar </strong> su computadora e intente instalar la actualización. </p> <p> </p> <h3> Método 4. Actualice Windows desde el archivo ISO de Windows 10. </h3> <p> El siguiente método para el error de actualización de Windows 10 &quot;El registro del sistema contiene rutas no válidas&quot; es actualizar Windows 10, desde el archivo ISO de Windows. Para hacer eso: </p> <h5> Paso 1. Descargue Windows 10 en un archivo ISO. </h5> <p> 1. Navega a <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Página de descarga de Windows 10 </a> y haga clic en <strong> Descargar la herramienta ahora </strong> descargar <strong> Herramienta de creación de medios </strong> . <br> 2. Ejecute el archivo descargado y <strong> Aceptar </strong> los términos de la licencia en la primera pantalla. <br> 3. Seleccione <strong> Cree medios de instalación para otra PC </strong> . </p> <p><img src=\"images/image_thumb23_thumb-798.png\" alt=\"image_thumb[23]\" loading=\"lazy\"></p> <p> 4. En la pantalla &quot;Idioma, arquitectura y edición&quot;, haga clic en <strong> Próximo. <br> </strong> 5. Seleccione <strong> Archivo ISO </strong> y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb22_thumb-275.png\" alt=\"image_thumb[22]\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Ahorrar </strong> el archivo &#39;Windows.iso&#39; en su escritorio. <br> 7. La herramienta de creación de medios comenzará a descargar Windows 10 en formato ISO. <br> 8. Cuando se complete la descarga, <strong> cerca </strong> la herramienta de creación de medios. </p> <h5> Paso 2. Ejecute el Liberador de espacio en disco. </h5> <p> 1. <strong> Botón derecho del ratón </strong> en coche <strong> C: </strong> y seleccione <strong> Propiedades. <br> </strong> 2. En <strong> Pestaña General </strong> , haga clic en <strong> Limpieza de disco. </strong></p> <p><img src=\"images/image_thumb15_thumb-662.png\" alt=\"image_thumb[15]\" loading=\"lazy\"></p> <p> </p> <p> 3. En la ventana &quot;Liberador de espacio en disco&quot;, haga clic en <strong> Limpiar archivos del sistema. </strong></p> <p><img src=\"images/image_thumb16_thumb-577.png\" alt=\"image_thumb[16]\" loading=\"lazy\"></p> <p> 4. Además de los archivos seleccionados para eliminar, seleccione lo siguiente y haga clic en <strong> OK </strong> para eliminarlos. </p> <ul> <li> <p><strong> Limpieza de Windows Update </strong></p> </li> <li> <p><strong> Archivos de registro de actualización de Windows </strong></p> </li> <li> <p><strong> Archivos de instalación temporales de Windows </strong></p> </li> </ul> <p><img src=\"images/image_thumb-69-524.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Cerca </strong> la <strong> Limpieza de disco </strong> herramienta y continúe con el paso siguiente. </p> <p><strong> </strong></p> <h5> Paso 3. Ejecute las herramientas DISM y SFC para reparar Windows 10. </h5> <p> Ahora, siga los pasos del Método 2 anterior y ejecute las herramientas DISM y SFC para reparar Windows 10. </p> <h5></h5> <h5> Paso 4. Actualice Windows 10 desde el archivo ISO. </h5> <p> 1. <strong> IMPORTANTE: </strong> <strong> Desconecte su computadora de Internet </strong> , (o configúrelo en &quot;Modo avión&quot; si posee una computadora portátil). <br> 2. <strong> IMPORTANTE: </strong><strong> Desactivar </strong> o <strong> desinstalar temporalmente </strong> alguna <strong> antivirus de terceros </strong> . <br> 3. Luego, haga clic derecho en el archivo &quot;Windows.iso&quot; (en su escritorio) y haga clic en <strong> Montar </strong> . <br> 4. Haga doble clic en <strong> Configuración </strong> solicitud. </p> <p><img src=\"images/image_thumb24_thumb-764.png\" alt=\"image_thumb[24]\" loading=\"lazy\"></p> <p> 5. Haga clic en <strong> próximo </strong> para instalar Windows 10. </p> <p><img src=\"images/image_thumb25_thumb-628.png\" alt=\"image_thumb[25]\" loading=\"lazy\"></p> <p> 6. Siga el resto de instrucciones en pantalla para actualizar su sistema. </p> <h6></h6> <h3></h3> <h3> Método 5. Instalación limpia de Windows 10. </h3> <p> El último método, para solucionar los problemas de actualización de Windows 10, es realizar una instalación limpia de Windows 10 en su sistema. </p> <p><strong> Importante: </strong> La instalación limpia de Windows 10 significa que todos sus archivos y configuraciones se perderán durante el proceso de instalación. Entonces, proceda y <strong> Haga una copia de seguridad de todos sus archivos y configuraciones importantes en otro medio de almacenamiento antes de continuar </strong> . (por ejemplo, a una unidad USB externa). </p> <p> Para realizar una instalación limpia de Windows 10, lea las instrucciones de este artículo: <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo limpiar instalar Windows 10 </a></p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}