{"title":"REVISIÓN: DWM.EXE Alto uso de CPU mientras se conecta a través de RDP en Windows 10 (resuelto)","content":"<p> El siguiente problema puede aparecer en una computadora basada en Windows 10, mientras que otros clientes están conectados a ella, a través de RDP (Conexión de escritorio remoto): El proceso &quot;DWM.EXE&quot;, causa una alta utilización de la CPU en el host remoto, o falla y finaliza el sesión de escritorio remoto. El problema suele aparecer si la máquina host de escritorio remoto ejecuta Windows 10 v1903 y posee un adaptador de pantalla (GPU) basado en Intel. </p> <p><img src=\"images/image_thumb-35-158.png\" alt=\"FIX: Event 1000, Application error dwm.exe\" loading=\"lazy\"></p> <p> </p> <p> Problema en detalles: cuando una máquina cliente está conectada a través de RDP a una máquina host de Windows 10 (destino), la máquina host desconecta el cliente de escritorio remoto porque el proceso de Desktop Windows Manager (dwm.exe) va al 100% del uso de la CPU. Cuando ocurre el problema, el siguiente evento se registra en el Visor de eventos: </p> <p><em> &quot;Nombre de la aplicación con errores: dwm.exe, versión: 10.0.17134.1, marca de tiempo: 0xf5178e97 <br> Nombre del módulo con errores: desconocido, versión: 0.0.0.0, marca de tiempo: 0x00000000 <br> Código de excepción: 0x8898009b <br> Desplazamiento de falla: 0x0000000000000000 <br> Id. Del proceso con errores: 0x3a8 <br> Hora de inicio de la aplicación con errores: 0x01d51ae025b941b3 <br> Ruta de la aplicación con errores: C: \\ WINDOWS \\ system32 \\ dwm.exe <br> Ruta del módulo con fallas: desconocida <br> ID de informe: fba8573a-ee4e-4430-b40c-3627888dbfd9 &quot; </em></p> <p> </p> <p> Este tutorial contiene instrucciones para resolver el uso elevado de CPU de DWM.EXE en una máquina host remota con Windows 10, después de conectarse con el escritorio remoto (RDP). </p> <h4> Cómo reparar la alta utilización de CPU de DWM.EXE en el host de Windows 10 de escritorio remoto. </h4> <p> Para resolver el alto uso de CPU de DWM.EXE, aplique las instrucciones de los siguientes métodos a la computadora con Windows 10 a la que se conecta a través de la conexión de escritorio remoto (PC host): </p> <h6> Método 1. Forzar conexiones de escritorio remoto para utilizar el controlador de pantalla de gráficos XDDM. </h6> <p> 1. Presione simultáneamente las ventanas <img src=\"images/image_thumb36-341.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> gpedit.msc </strong> &amp; Prensa <strong> Ingresar. </strong></p> <p><img src=\"images/image_thumb-78-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. En el panel izquierdo, navegue hasta: </p> <ul> <li><strong> Configuracion de Computadora </strong> &gt; <strong> Plantillas Administrativas </strong> &gt; <strong> Componentes de Windows </strong> &gt; <strong> Servicios de escritorio remoto </strong> &gt; <strong> Host de sesión de escritorio remoto </strong> &gt; <strong> Entorno de sesión remota </strong></li> </ul> <p> 4. En el panel derecho, haga doble clic en <strong> Utilice el controlador de pantalla de gráficos WDDM para conexiones de escritorio remoto </strong></p> <p><img src=\"images/image_thumb-24-327.png\" alt=\"FIX: DWM.EXE High CPU Usage while using RDP \" loading=\"lazy\"></p> <p> </p> <p> 5. Establezca la configuración de gobierno en <strong> Discapacitado </strong> y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-25-498.png\" alt=\"FIX: DWM.EXE High CPU Usage while connecting through RDP in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Cierre el editor de políticas de grupo y <strong> reiniciar </strong> el ordenador. </p> <p> </p> <p> </p> <h6> Método 2. Instale el controlador de pantalla básico de Microsoft. </h6> <p> 1. Navegue al Administrador de dispositivos. Para hacer eso: </p> <blockquote><p> 1. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-301.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo: <strong> devmgmt.msc </strong> &amp; haga clic <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-26-428.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. Expandir <strong> Adaptadores de pantalla </strong> . <br> 3. Haga clic con el botón derecho en el adaptador de pantalla instalado y seleccione <strong> Propiedades </strong> . <br> 4. Seleccione el <strong> Conductor </strong> pestaña y luego haga clic en <strong> Actualizar controlador </strong> . </p> <p><img src=\"images/image_thumb-27-371.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Haga clic en <strong> Buscar en mi computadora el software del controlador </strong> . </p> <p><img src=\"images/image_thumb-28-269.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Elija <strong> Permítame elegir de una lista de controladores disponibles en mi computadora </strong> . </p> <p><img src=\"images/image_thumb-29-401.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Elija el <strong> Adaptador de pantalla básico de Microsoft </strong> y haga clic en <strong> próximo </strong> . </p> <p><img src=\"images/image_thumb-30-520.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Cuando se complete la instalación, cierre todas las ventanas abiertas y listo. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este problema. </p>"}