{"title":"REVISIÓN: Windows 10 se está ejecutando extremadamente lento después de instalar v2004 o Edge Chromιum (resuelto)","content":"<p> Muchos usuarios han informado que su PC funciona extremadamente lento después de instalar la actualización de Windows 10 2004 o después de instalar la nueva versión basada en Chromium del navegador Microsoft Edge. Si se enfrenta a uno de los problemas mencionados anteriormente, siga las instrucciones de este artículo para resolverlos. </p> <p> Problema en detalles: después de actualizar Windows 10 a la versión 2004, o después de instalar el <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> actualización, que instala automáticamente el nuevo navegador Edge (versión Chromium), Windows tarda mucho en el proceso de arranque o se está ejecutando muy lento. </p> <h4> Cómo CORREGIR: Arranque lento y problemas de rendimiento lento en Windows 10 2004. </h4> <h6> Método 1. Instale las actualizaciones de Windows disponibles y actualice los controladores de dispositivo. </h6> <p> El primer método para resolver los problemas de rendimiento lento en Windows 10 es realizar los siguientes pasos: </p> <ul> <li><strong> Paso 1. </strong> Descargue e instale todas las actualizaciones de Windows disponibles. </li> <li><strong> Paso 2. </strong> Descargue e instale los últimos controladores de Windows 10 para el Adaptador de pantalla. </li> <li><strong> Paso 3. </strong> Si está utilizando un programa antivirus de terceros, desinstálelo y compruebe si persiste el problema de rendimiento lento. Si no es así, instale la última versión del programa AV. </li> </ul> <p> </p> <h6> Método 2. Desinstale la versión de Microsoft Edge Chromium. </h6> <p> El segundo método para solucionar los problemas de rendimiento lento en Windows 10 es desinstalar la versión de Microsoft Edge Chromium (si está instalada). </p> <h5> Paso 1. Compruebe si está instalada la nueva versión basada en Chromium de Microsoft Edge. </h5> <p> 1. Desde el menú Inicio <img src=\"images/image_thumb2_thumb_thumb-381.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> hacer clic <strong> Ajustes </strong><img src=\"images/image_thumb-66-515.png\" alt=\"image\" loading=\"lazy\"> y haga clic en <strong> Aplicaciones. <br> </strong> 2. Si el <strong> Aplicaciones y funciones </strong> localice la aplicación Microsoft Edge y según su icono proceda de la siguiente manera: </p> <ul> <li> Si ves esta imagen de icono <img src=\"images/image_thumb-32-976.png\" alt=\"image\" loading=\"lazy\"> , significa que la nueva versión de Microsoft Edge basada en Chromium ya está instalada en su computadora. En este caso, vaya a <strong> <a href=\"#step-2\" target=\"_blank\" rel=\"nofollow noopener\"> paso 2 </a></strong> para desinstalar Edge Chromium de su PC. </li> <li> Si ves esta imagen de icono <img src=\"images/image_thumb-33-372.png\" alt=\"image\" loading=\"lazy\"> , significa que la nueva versión basada en Chromium aún no está instalada en su computadora. En este caso, pase a <a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"><strong> método-3 </strong></a> . </li> </ul> <p><img src=\"images/image_thumb-71-268.png\" alt=\"FIX: Windows 10 Running Extremely Slow after 2004 Update\" loading=\"lazy\"></p> <p> </p> <h5> Paso 2. Retire Edge Chromium de la PC. </h5> <p> Para desinstalar el nuevo Edge basado en Chromium en Windows 10: </p> <p> 1. Navegue a la siguiente carpeta en su PC: * </p> <ul> <li> C: \\ Archivos de programa (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </li> </ul> <p> * Nota: El nombre de la carpeta &quot;85.0.564.41&quot; indica la versión instalada de la nueva versión de Chromium y puede diferir en su PC. </p> <p> 2. Seleccione la ruta de la carpeta en la barra de direcciones y haga clic con el botón derecho en&gt; <strong> Dupdo. </strong></p> <p><img src=\"images/image_thumb-35-379.png\" alt=\"Uninstall Edge Chromiun\" loading=\"lazy\"></p> <p> </p> <p> 3. Abrir <strong> Símbolo del sistema como administrador, </strong> tipo <strong> CD </strong> y luego presione <strong> CTRL + V </strong> para pegar en la ruta de la carpeta copiada. Cuando termine, presione <strong> Ingresar </strong> . * </p> <p> * Ej .: En el ejemplo actual, el comando será: </p> <p><em> cd C: \\ Archivos de programa (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </em></p> <p><img src=\"images/image_thumb-36-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Ahora, dé el siguiente comando (Copiar / Pegar) en el símbolo del sistema para eliminar la versión Chromium del navegador Microsoft Edge de su PC. </p> <ul> <li> setup.exe –uninstall –system-level –verbose-logging –force-uninstall </li> </ul> <p><img src=\"images/image_thumb-37-229.png\" alt=\"Remove Edge Chromiun\" loading=\"lazy\"></p> <p> 5. Una vez que se ejecute el comando anterior, la versión anterior de EDGE se activará nuevamente. Reinicie su PC para aplicar los cambios. <br> 6. Después de reiniciar, proceda a instalar manualmente el <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> nuevo navegador Edge basado en Chromium </a> en su PC, para evitar instalar nuevamente la problemática actualización KB4559309. </p> <p> </p> <h6> Método 3. Restaure Windows 10 a su versión anterior. </h6> <p> 1. Desde el <strong> Comienzo </strong> menú <img src=\"images/image_thumb2_thumb_thumb-872.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> abierto <strong> Ajustes </strong> <img src=\"images/image_thumb-66-969.png\" alt=\"image\" loading=\"lazy\"> y luego haga clic en <strong> Actualización y seguridad. </strong></p> <p> 2. Elija <strong> Recuperación </strong> a la izquierda y luego, en la sección &#39;Volver a la versión anterior de Windows 10&#39;, haga clic en el <strong> Empezar </strong> botón. </p> <p><img src=\"images/image_thumb-4-708.png\" alt=\"Restore Windows to earlier version\" loading=\"lazy\"></p> <p> 3. Siga las instrucciones en pantalla para restaurar Windows 10 a su versión anterior. <br> 4. Después de regresar a la versión anterior de Windows 10, su computadora debería funcionar normalmente nuevamente y sin demoras. </p> <p> </p> <h6> Método 4. Reparar Windows 10. </h6> <p> El siguiente método para resolver los problemas de rendimiento lento en Windows 10 es reparar Windows utilizando los comandos SFC y DISM: </p> <p> 1. Abrir <strong> Símbolo del sistema como administrador </strong> . <br> 2. En el símbolo del sistema, proporcione el siguiente comando dism y presione <strong> Ingresar: </strong></p> <ul> <li><strong> DISM.exe / En línea / Imagen de limpieza / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-175.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> </p> <p> 3. Cuando se complete la operación DISM, escriba el siguiente comando y presione <strong> Ingresar </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb31-316.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Ahora espere hasta que el Comprobador de archivos de sistema repare los archivos de sistema de Windows. <br> 5. Una vez hecho esto, <strong> Reanudar </strong> su computadora y vea si el problema está resuelto. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}