{"title":"REVISIÓN: Outlook Receiving informó el error 0x80042108 (resuelto)","content":"<p> Este tutorial contiene instrucciones paso a paso para corregir el error 0x80042108 de Outlook Receiving Reported. El error Outlook 0x80042108 generalmente ocurre cuando ha escrito incorrectamente el nombre del servidor de correo electrónico POP3 o porque no tiene acceso a Internet. </p> <p> El problema son los detalles. Outlook 2003, 2007, 2010 o Outlook 2013, muestra el siguiente error durante el procedimiento de envío y recepción: &quot;Recibiendo el error informado (0x80042108): Outlook no puede conectarse a su servidor de correo electrónico entrante (POP3). Si continúa recibiendo este mensaje , comuníquese con el administrador del servidor o el proveedor de servicios de Internet (ISP) &quot;. </p> <p><img src=\"images/outlookerror_0x80042108-505.png\" alt=\"Outlook Error 0x80042108\" loading=\"lazy\"></p> <p> El error &quot;0x80042108&quot; de Outlook puede ocurrir en cualquier versión de Outlook (2016, 2013, 2010 o 2007) y aparece cuando el programa cliente de correo electrónico de Outlook no puede conectarse al servidor de correo electrónico. </p> <h4> Cómo reparar el error 0x80042108 en Outlook 2007, 2010, 2013 o 2016. </h4> <h6> Paso 1. Verifique su conexión a Internet. </h6> <p> El primer paso para resolver el error de recepción de Outlook 80042108 es verificar su conectividad a Internet. Por lo tanto, abra su navegador de Internet y visite cualquier sitio web para asegurarse de que su conexión a Internet esté funcionando. </p> <h6> Paso 2. Verifique la configuración del servidor de correo POP3. </h6> <p> El segundo paso para corregir el error de recepción de Outlook 0x80042108 es verificar si ha especificado la configuración correcta del servidor de correo electrónico. Entonces, comuníquese con su proveedor de correo electrónico y verifique con él que ha escrito correctamente el nombre del servidor de correo entrante y el número de puerto. Para ver y modificar la configuración del servidor de correo electrónico: </p> <p> 1. Abra Outlook. <br> 2. Ir a <strong> Archivo </strong> -&gt; <strong> Configuraciones de la cuenta </strong> . </p> <p><img src=\"images/image_thumb-7-811.png\" alt=\"switch Account Mail Merge \" loading=\"lazy\"></p> <p> </p> <p> 3 en <strong> Correo electrónico </strong> pestaña, haga doble clic en su cuenta de correo electrónico, para modificar / ver su configuración. <br> 4. Verifique que haya configurado el nombre correcto del servidor de correo entrante en el cuadro correspondiente. <br> 5. Cuando termine, haga clic en <strong> Más ajustes </strong> . </p> <p><img src=\"images/image_thumb-31-256.png\" alt=\"FIX: Outlook Receiving reported error 0x80042108\" loading=\"lazy\"></p> <blockquote><p> </p></blockquote> <p> 6. Haga clic en el <strong> Avanzado </strong> pestaña y verifique que haya especificado el puerto correcto y la configuración SSL para el servidor entrante (POP3). </p> <p> </p> <p><img src=\"images/image_thumb-33-400.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Cuando termine, haga clic en <strong> OK </strong> y luego cierre todas las ventanas abiertas. <br> 7. Pruebe Outlook nuevamente. </p> <h6></h6> <h6> Paso 3. Verifique la configuración de su antivirus y firewall. </h6> <p> Si está utilizando un programa antivirus con funciones de análisis de correo electrónico, entonces <a href=\"https://www.repairwin.com/how-to-disable-add-ins-in-word-outlook-or-excel-2016-2013-2010-2007-or-2003/\" target=\"_blank\" rel=\"nofollow noopener\"> deshabilitar el complemento antivirus en Outlook </a> o deshabilite temporalmente la protección antivirus o desinstale el programa antivirus. Además, verifique la configuración de su Firewall y asegúrese de que los puertos del servidor de correo electrónico que está utilizando no estén bloqueados del programa Firewall. Más específicamente, en la configuración de su Firewall: </p> <p> A. Habilite los siguientes archivos para acceder a Internet: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Habilite los siguientes puertos para acceder a Internet: </p> <ul> <li><strong> Puerto 110 </strong> (Si está utilizando un servidor de correo entrante POP3 sin conexión encriptada) * </li> <li><strong> Puerto 995 </strong> (Si utiliza un servidor de correo entrante POP3 con conexión cifrada (SSL habilitado) </li> </ul> <ul> <li><strong> Puerto 143 </strong> (si está utilizando un servidor de correo entrante IMAP sin conexión cifrada) </li> <li><strong> Puerto 993 </strong> (si está utilizando un servidor de correo entrante IMAP con conexión cifrada (SSL habilitado) </li> </ul> <ul> <li><strong> Puerto 25 </strong> Si su servidor de correo saliente SMTP no utiliza SSL. * </li> <li><strong> Puerto 465 </strong> o <strong> 587 </strong> si su servidor de correo saliente SMTP utiliza SSL </li> </ul> <p> * Nota: De forma predeterminada, el puerto 25 es para acceso saliente y el puerto 110 es para acceso entrante. Si no está seguro acerca de los puertos, comuníquese con su ISP o administrador del sistema. </p> <p> </p> <p><strong> Ayuda adicional: </strong> Si los métodos anteriores no le ayudan, intente lo siguiente: </p> <p><strong> UNA. </strong> Elimine y agregue su cuenta de correo electrónico nuevamente. <br> <strong> B. </strong><a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Reparar el archivo de datos PST de Outlook </a> . <br> <strong> C. </strong> Desconéctese de la conexión VPN (si está conectado) <br> <strong> D. </strong> Instalación de oficina de reparación. Para hacer eso: </p> <blockquote><p> 1. Navega a Windows <strong> Panel de control </strong> &gt; <strong> Programas y características </strong> . <br> 2. Busque y seleccione la aplicación MS Office y luego haga clic en <strong> Cambio </strong> . <br> 3. Luego seleccione el <strong> Reparar </strong> opción. </p></blockquote> <p> </p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? </p> <p> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}