{"title":"REVISIÓN: Actualmente no tiene permiso para acceder a esta carpeta en la unidad USB externa (resuelto)","content":"<p> Este tutorial contiene instrucciones detalladas para resolver el siguiente problema, al intentar acceder a un disco USB externo en una computadora portátil HP con Windows 10: &quot;Actualmente no tiene permiso para acceder a esta carpeta. Haga clic en Continuar para obtener acceso permanente a esta carpeta&quot;. . El error persiste, incluso después de presionar el botón &quot;Continuar&quot; para acceder a la unidad. </p> <p><img src=\"images/image_thumb-18-636.png\" alt=\"You don't have permission to access this folder\" loading=\"lazy\"></p> <p> El extraño error &quot;No tiene permiso para acceder a esta carpeta&quot; apareció en una nueva <a href=\"http://www8.hp.com/us/en/products/laptops/product-detail.html?oid=17047142\" target=\"_blank\" rel=\"nofollow noopener\"> HP ProBook 450 G5 </a> computadora portátil, cuando el usuario intenta ver el contenido de un disco USB conectado (Pen drive, USB Drive, etc.). </p> <p> Después de investigar el problema, descubrí que el problema se debe a los permisos de seguridad que se han aplicado en el <a href=\"http://www8.hp.com/us/en/solutions/computer-security.html\" target=\"_blank\" rel=\"nofollow noopener\"> Administrador de seguridad del cliente HP </a> programa. HP Client Security Manager, es un programa desarrollado por Hewlett-Packard y le permite proteger sus datos, dispositivo e identidad aumentando la seguridad de su computadora. </p> <h2> Cómo corregirlo: Sin permiso para acceder a la unidad USB en una computadora portátil HP (Windows 10/8/7). </h2> <p> 1. Abrir <strong> Administrador de HP Client Security </strong> . </p> <p><img src=\"images/image_thumb-13-716.png\" alt=\"HP Client Security manager\" loading=\"lazy\"></p> <p> </p> <p> 2. Luego haga clic en <strong> Seguridad del dispositivo. </strong></p> <p><img src=\"images/image_thumb-14-712.png\" alt=\"fix You Don't have permission to access this folder windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. En <strong> Administradores </strong> pestaña, configure la seguridad &#39;Almacenamiento de eliminación&#39; en <strong> Permitir: acceso completo </strong> y haga clic en <strong> Enviar. </strong></p> <p><img src=\"images/image_thumb-15-364.png\" alt=\"fix You Don't have permission o access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Además (si lo desea), proporcione <strong> Acceso completo </strong> al medio de almacenamiento extraíble para <strong> Usuarios estándar </strong> . </p> <p><img src=\"images/image_thumb-19-269.png\" alt=\"no permission to access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Por último, si no desea que HP Device Access Manager controle el acceso a la unidad, vaya a <strong> Configuración de la unidad </strong> y coloque el interruptor correspondiente en OFF. </p> <p><img src=\"images/image_thumb-20-822.png\" alt=\"You don't have permission to access USB drive\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este problema. </p>"}