{"title":"REVISIÓN: Error de restauración del sistema 0x8100010B (resuelto)","content":"<p> Este tutorial contiene instrucciones para resolver el error de restauración del sistema 0x8100010B en Windows 10. El error 0x8100010B puede aparecer cuando intenta aumentar el uso máximo de espacio para la protección del sistema o cuando intenta eliminar todos los puntos de restauración anteriores. </p> <p><img src=\"images/image_thumb-19-393.png\" alt=\"FIX System Restore Error 0x8100010B\" loading=\"lazy\"></p> <p> Más específicamente, este artículo contiene instrucciones para resolver el siguiente problema en Restaurar sistema: </p> <p><strong> 1. No se puede aumentar el espacio máximo en disco para la protección del sistema. </strong> con el error: &quot;Hubo un <strong> error inesperado en la página de propiedades </strong> : La sintaxis del nombre de archivo, directorio o etiqueta de volumen es incorrecta. (0x8007007B)). </p> <p><strong> 2. No se pueden eliminar los puntos de restauración </strong> en Windows 10 con el error: &quot;Los puntos de restauración no se pudieron eliminar por el siguiente motivo: Windows no pudo eliminar todas las instantáneas. Vuelva a intentarlo o consulte el registro de eventos para obtener más información. (0x8100010B)&quot;. </p> <h2> Cómo CORREGIR: Error 0x8100010B en Protección de restauración del sistema. </h2> <p> 1. <strong> Reanudar </strong> tu computador. </p> <p> 2. Navega a <strong> Proteccion del sistema </strong> ajustes: </p> <ul> <li><b> Panel de control&gt; Sistema&gt; Configuración avanzada del sistema&gt; Propiedades del sistema&gt; Protección del sistema </b></li> </ul> <p> 3. Resalte el <strong> Disco local C: (Sistema) </strong> y haga clic en <strong> Configure. </strong></p> <p><img src=\"images/image_thumb-22-902.png\" alt=\"0x8100010B System Protection\" loading=\"lazy\"></p> <p> </p> <p> 4. Seleccione <strong> Deshabilitar la protección del sistema </strong> y haga clic en <strong> Aplicar&gt; Aceptar. </strong> * </p> <p> * Nota: Esta acción eliminará permanentemente todos los puntos de restauración anteriores. Si desea aumentar el uso máximo de espacio para la protección del sistema, sin perder los puntos de restauración, ejecute el siguiente comando en un símbolo del sistema elevado y luego vea si el problema se ha solucionado. </p> <ul> <li> vssadmin cambiar el tamaño de almacenamiento de sombras / For = C: / On = C: / MaxSize = 15% </li> </ul> <p><img src=\"images/image_thumb-23-863.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Cerca </strong> y <strong> reabrir </strong> la configuración de protección del sistema. </p> <p> 6. Ahora seleccione <strong> Encienda la protección del sistema </strong> , configure el uso máximo y haga clic en <strong> OK </strong> . </p> <p> 7. En las opciones de Protección del sistema, seleccione <strong> Encienda la protección del sistema </strong> y haga clic en <strong> está bien. </strong></p> <p><img src=\"images/image_thumb-73-430.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}