{"title":"REVISIÓN: No hay sonido de los altavoces internos en la computadora portátil HP OMEN (resuelto)","content":"<p> Este tutorial contiene instrucciones paso a paso para resolver el problema &quot;no hay sonido en los altavoces internos&quot;, en un <a href=\"https://support.hp.com/ph-en/document/c05576170\" target=\"_blank\" rel=\"nofollow noopener\"> Laptop Omen de HP - 17-an009nv </a> . El problema de &quot;no hay audio en los altavoces de la computadora portátil&quot;, puede ocurrir en cualquier modelo de computadora portátil HP, y generalmente ocurre después de instalar una actualización del controlador de Windows para el dispositivo de audio de alta definición Realtek. </p> <p> Problema en detalles: en una computadora portátil HP que ejecuta Windows 10, los parlantes internos no emiten sonido al reproducir música o videos, pero los parlantes funcionan normalmente cuando se ejecutan las pruebas de diagnóstico de HP fuera del sistema operativo. Además, el problema de &quot;no hay sonido&quot; solo ocurre con los parlantes del portátil y no con los parlantes o auriculares externos. </p> <h4> Cómo REPARAR: Los altavoces de la computadora portátil no suenan en Windows 10. </h4> <h6> Paso 1. Aumente el volumen del sonido </h6> <p> 1. <strong> Botón derecho del ratón </strong> en el <strong> icono de sonido </strong><img src=\"images/image_thumb-11-503.png\" alt=\"image\" loading=\"lazy\"> en la barra de tareas y seleccione <strong> Mezclador de volumen abierto. </strong></p> <p><img src=\"images/image_thumb-12-807.png\" alt=\"Open Volume Mixer\" loading=\"lazy\"></p> <p> 2. Arrastre el control deslizante Altavoces al <strong> Cima </strong> y compruebe si puede oír el sonido. </p> <p><img src=\"images/image_thumb-13-813.png\" alt=\"Adjust Sound Volume\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Paso 2. Configure los altavoces como dispositivo de reproducción predeterminado. </h6> <p> 1. Navega a Windows <strong> Panel de control </strong> y abrir <strong> Sonar. </strong></p> <p><img src=\"images/image_thumb-14-315.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2.Asegúrate de que <strong> Altavoces </strong> es el <strong> Defecto </strong> dispositivo de reproducción; de lo contrario, seleccione los altavoces y haga clic en el <strong> Establecer predeterminado </strong> botón. Cuando termine, pruebe sus altavoces y si el problema persiste, continúe con el siguiente paso. </p> <p><img src=\"images/image_thumb-15-993.png\" alt=\"Set Speakers as Default Playback Device\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Paso 3. Pruebe los altavoces internos fuera de las ventanas. </h6> <p> El siguiente paso para resolver el problema de &quot;no hay sonido en los parlantes internos&quot; en su computadora portátil es probar si los parlantes funcionan, al ejecutar las pruebas de diagnóstico de hardware de HP. Para hacer eso: </p> <p> 1. <strong> Apagar </strong> tu computadora portatil. <br> 2. Encienda su computadora portátil y presione inmediatamente el <strong> ESC </strong> tecla repetidamente. <br> 3. Cuando aparezca el menú, presione el <strong> F2 </strong> clave. <br> 4. En el menú principal, haga clic en <strong> Pruebas de componentes </strong> y luego haga clic en <strong> AUDIO. <br> </strong> 5. Si escucha sonido de los altavoces durante las pruebas de audio, continúe con el paso 3 a continuación. * </p> <p><strong> * Nota: </strong> Si no escucha el sonido de los altavoces, deténgase aquí porque hay un problema de hardware que solo puede solucionarlo un técnico especializado en computadoras portátiles (servicio). </p> <p><img src=\"images/image_thumb-22-211.png\" alt=\"HP Diagnostics - Component Test\" loading=\"lazy\"></p> <p> </p> <h6><br clear=\"all\"> Paso 4. Revertir el controlador de la tarjeta de sonido. </h6> <p> 1. Abrir <strong> Administrador de dispositivos </strong> . Para hacer eso: </p> <blockquote><p> 1. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-958.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. En el cuadro &quot;Abrir&quot;, escriba: <strong> devmgmt.msc </strong> &amp; haga clic <strong> OK </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-5-510.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Expandir </strong> la <strong> Controladores de sonido, video y juegos. </strong></p> <p> 3. <strong> Botón derecho del ratón </strong> sobre el <strong> Realtek High Definition Audio </strong> dispositivo y seleccione <strong> Propiedades. </strong></p> <p><img src=\"images/image_thumb-17-678.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. En la pestaña Controlador, haga clic en <strong> Controlador de retroceso </strong> botón. <strong> * </strong></p> <p><strong> * Nota: </strong> Si el botón Revertir controlador está inactivo, continúe con el siguiente paso. </p> <p><img src=\"images/image_thumb-18-178.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> </p> <p> 5. Seleccione un motivo para la reversión del paquete de controladores y haga clic en <strong> Si. </strong></p> <p><img src=\"images/image_thumb-19-167.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Cuando se complete la reversión del controlador, <strong> Reanudar </strong> tu computadora. <br> 5. Después de reiniciar, continúe y pruebe el sonido de los parlantes de la computadora portátil. Si aún no puede escuchar el audio de los parlantes de su computadora portátil, continúe con el siguiente paso. </p> <p> </p> <h6><br clear=\"all\"> Paso 5. Cambie el controlador de la tarjeta de sonido. </h6> <p> 1. Abrir <strong> Administrador de dispositivos. </strong><br> 2. <strong> Expandir </strong> la <strong> Controladores de sonido, video y juegos. <br> </strong> 3. <strong> Botón derecho del ratón </strong> a <strong> Realtek High Definition Audio </strong> dispositivo, {o en el <strong> Audio de alta definición Realtek (SST) </strong> dispositivo} y seleccione <strong> Actualizar controlador. <br> </strong></p> <p><img src=\"images/image_thumb-6-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Seleccione <strong> Busque controladores en mi computadora. </strong></p> <p><img src=\"images/image_thumb-7-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Seleccione <strong> Permítame elegir de una lista de controladores disponibles en mi computadora </strong> . </p> <p><img src=\"images/image_thumb-8-771.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> </p> <p> 6. En la siguiente pantalla, aplique una de las siguientes acciones, según su caso: </p> <p><strong> Caso A. </strong> Si en el cuadro &#39;Mostrar hardware compatible&#39;, ve los dispositivos &quot;Dispositivo de audio de alta definición&quot; y &quot;Audio de alta definición Realtek&quot; en la lista, seleccione el <strong> Dispositivo de audio de alta definición </strong> y haga clic en <strong> Próximo. </strong></p> <p><img src=\"images/image_thumb-20-130.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p><strong> Caso B. </strong> Si en el cuadro &#39;Mostrar hardware compatible&#39;, solo verá el <strong> Audio de alta definición Realtek (SST) </strong> dispositivo, entonces: </p> <blockquote><p> una. <strong> Desmarcar </strong> la <strong> Mostrar casilla de verificación de hardware compatible. </strong></p></blockquote> <p><img src=\"images/image_thumb-9-565.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> B. Selecciona el <strong> Realtek High Definition Audio </strong> controlador y haga clic en <strong> Próximo. </strong></p></blockquote> <p><img src=\"images/image_thumb-10-248.png\" alt=\"FIX No Sound from Internal Speakers on Laptop\" loading=\"lazy\"></p> <p> </p> <p> 8. Cuando se complete la instalación del controlador, <strong> Reanudar </strong> tu computadora. <br> 9. Después de reiniciar, continúe y pruebe el sonido de los parlantes de la computadora portátil. </p> <p> </p> <h6><br clear=\"all\"> Paso 6. Desinstale y vuelva a instalar el controlador de la tarjeta de sonido. </h6> <p> 1. Abrir <strong> Administrador de dispositivos. </strong><br> 2. <strong> Expandir </strong> la <strong> Controladores de sonido, video y juegos. <br> </strong> 3. <strong> Botón derecho del ratón </strong> a <strong> Realtek High Definition Audio </strong> dispositivo y seleccione <strong> Desinstalar dispositivo. </strong></p> <p><img src=\"images/image_thumb-21-889.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. Después de la desinstalación, <strong> Reanudar </strong> su computadora y deje que Windows instale los controladores de sonido automáticamente. Si esto no sucede, navegue hasta <strong> Ajustes </strong> &gt; <strong> Actualización y seguridad </strong> y obligar a Windows a <strong> Busque actualizaciones, </strong> o continúe con el paso 7 a continuación. </p> <p> </p> <h6><br clear=\"all\"> Paso 7. Actualice los controladores de la tarjeta de sonido. </h6> <p> Navegue al sitio de soporte del fabricante de su computadora portátil y descargue e instale el controlador más reciente para su tarjeta de sonido. Si no puede encontrar un controlador para la tarjeta de sonido en el sitio de soporte del fabricante, o si aún enfrenta el problema de &quot;no hay sonido de los parlantes internos&quot; después de instalar el nuevo controlador, intente lo siguiente si posee un dispositivo de audio Realtek HD. </p> <p> 1. Lea las instrucciones de este <a href=\"https://www.repairwin.com/how-to-download-realtek-audio-manager-realtek-audio-drivers-windows-10-8-1-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> artículo </strong></a> a <strong> descargar </strong> la <strong> Controlador de audio Realtek HD v2.82. <br> </strong> 2. Después de la descarga, proceda y <strong> Instalar en pc </strong> la <strong> Controlador de audio Realtek HD. <br> </strong> 3. Después de la instalación <strong> Reanudar </strong> su PC y pruebe el sonido de los altavoces. * </p> <p><strong> Nota final: </strong> Si el problema de sonido de los altavoces persiste, busque en el Administrador de dispositivos, y si el dispositivo de sonido aparece como &quot;Realtek High Definition Audio (SST)&quot;, siga las instrucciones del paso 5 anterior y cambie el &quot;Realtek High Definition Audio (SST) &quot;controlador para&quot; Realtek High Definition Audio &quot;. </p> <p> ¡Eso es todo amigos! ¿Qué método te funcionó? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}