{"title":"REVISIÓN: Viber, Yahoo y otras aplicaciones se bloquean en dispositivos Android: marzo de 2021 (resuelto).","content":"<p> Varios usuarios en las últimas horas han informado que muchas aplicaciones de Android están fallando (22 de marzo de 2021). En particular, Gmail, Viber, Google Chrome y otras aplicaciones importantes no se abren ni se cierran inmediatamente después de abrirse. El problema afecta a muchos dispositivos Android y especialmente a los dispositivos de Samsung. Si tiene un problema similar, continúe leyendo a continuación para aprender cómo solucionarlo. </p> <p> Actualización (23 de marzo de 2021): Google identificó rápidamente el problema y descubrió que el <strong> WebView de Android </strong> La aplicación fue la culpable y la solucionó presionando actualizaciones para ella y otras aplicaciones de Chrome. </p> <h4> Cómo FIX: Android Google Apps, Viber, etc. Problema de bloqueo (22 de marzo de 2021). </h4> <p> 1. Abra Android <strong> Ajustes. </strong></p> <p> 2. Toque <strong> Administrar aplicaciones </strong> (o <strong> Aplicaciones y notificaciones </strong> o <strong> Aplicaciones </strong> en algunos dispositivos Android). </p> <p><img src=\"images/image_thumb-27-815.png\" alt=\"FIX: Android Apps are Crashing on Samsung or other Devices.\" loading=\"lazy\"></p> <p> </p> <p> 3. Haga clic en el menú con el <strong> tres puntos </strong><img src=\"images/image_thumb-28-382.png\" alt=\"image\" loading=\"lazy\"> en la esquina superior derecha y seleccione <strong> Mostrar todas las aplicaciones </strong> (o <strong> Mostrar aplicaciones del sistema </strong> ). </p> <p><img src=\"images/image_thumb-29-272.png\" alt=\"FIX Android GMAIL or Viber Crash \" loading=\"lazy\"></p> <p> </p> <p> 3. Encuentra el <strong> WebView del sistema Android </strong> aplicación (o <strong> WebView de Android </strong> ) en la lista y ábralo. </p> <p><img src=\"images/image_thumb-30-842.png\" alt=\"FIX GMAIL Chrome or Viber Crash on Android - March 2021\" loading=\"lazy\"></p> <p> </p> <p> 4. Haga clic en <strong> Desinstalar actualizaciones. </strong></p> <p><img src=\"images/image_thumb-31-471.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Toque <strong> OK </strong> en el mensaje de advertencia. </p> <p> 6. <strong> Reanudar </strong> su dispositivo y el problema debería desaparecer. </p> <p> ¡Eso es todo amigos! ¿Qué método te funcionó? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}