{"title":"REVISIÓN: Problema de uso de memoria alta de Chrome (resuelto)","content":"<p> Como ya habrá notado, Google Chrome abre muchos procesos en segundo plano, incluso cuando solo ha abierto algunas ventanas / pestañas de Chrome. Esto sucede porque Google Chrome está diseñado de tal manera que crea un proceso individual para cada complemento o extensión instalado cuando abre una nueva ventana o pestaña. </p> <p> Aunque la apertura de múltiples procesos desde Google Chrome es un comportamiento normal, en realidad es un problema, porque este comportamiento provoca un gran uso de memoria y hace que la computadora no responda. </p> <p><img src=\"images/image_thumb-17-610.png\" alt=\"FIX: Multiple Processes in Chrome with High Memory Usage\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contiene instrucciones paso a paso sobre cómo evitar que Chrome abra múltiples procesos para cada ventana o pestaña, con el fin de resolver el problema de alto uso de memoria de Chrome. </p> <h4> Cómo deshabilitar varios procesos de Chrome en Windows 10. </h4> <h6> Paso 1. Escanee su computadora en busca de malware y virus. </h6> <p> El primer paso antes de solucionar el error &quot;ERR_CONNECTION_CLOSED&quot; en Chrome es asegurarse de que su sistema esté libre de virus / malware. Para esa tarea, siga las instrucciones de esta guía: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo escanear su computadora en busca de virus y otros programas maliciosos. </a></p> <h6></h6> <h6> Paso 2. Desactive las extensiones de Chrome no deseadas. </h6> <p> En primer lugar, compruebe si necesita todas las extensiones de Chrome instaladas y deshabilite las que no necesita. Para hacer eso: </p> <p> 1. Desde el menú de Chrome <img src=\"images/image_thumb-47-380.png\" alt=\"image\" loading=\"lazy\"> , ir <strong> Más herramientas </strong> -&gt; <strong> Extensiones </strong></p> <p><img src=\"images/image_thumb-51-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Elimine (o desactive) cualquier extensión que no necesite o que no reconozca. </p> <p><img src=\"images/image_thumb-49-442.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Paso 3. Evite que Chrome se ejecute en segundo plano cuando Chrome esté cerrado. </h6> <p> 1. Desde el menú de Chrome <img src=\"images/image_thumb-78-665.png\" alt=\"image\" loading=\"lazy\"> Seleccione <strong> Ajustes </strong> . </p> <p><img src=\"images/image_thumb-79-868.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> 2. En <strong> Ajustes </strong> página, desplácese hacia abajo y haga clic en <strong> Avanzado </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <p> 3. Establezca el interruptor &quot;Continuar ejecutando aplicaciones en segundo plano cuando Google Chrome esté cerrado&quot; en <strong> APAGADO </strong> . </p> <p><img src=\"images/image_thumb-18-557.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <p> </p> <h6> Paso 4. Evite que Chrome abra varios procesos para el mismo sitio. </h6> <p> 1, <strong> Botón derecho del ratón </strong> en <strong> Google Chrome </strong> atajo y seleccione <strong> Propiedades </strong> . <br> 2. En <strong> General </strong> pestaña, agregue el interruptor &quot;–proceso por sitio&quot; (sin comillas), al final de la línea de destino y haga clic en <strong> OK </strong> y <strong> Continuar </strong> para aplicar el cambio <strong> . * </strong></p> <p> p.ej. &quot;C: \\ Archivos de programa \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; –proceso por sitio </p> <p> Nota: hay un espacio antes de –process-per-site </p> <p><img src=\"images/image_thumb-19-818.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Paso 5. Desactive el aislamiento de sitios de Google Chrome. </h6> <p> En el modo de aislamiento del sitio, Chrome cargará cada sitio web en su propio proceso. De hecho, esta es una característica de seguridad adicional para evitar que un sitio web robe sus datos de otro sitio web que esté abierto en otra ventana / pestaña. Pero el modo &quot;Aislamiento del sitio&quot; aumentará el uso de memoria de Chrome en aproximadamente un 10%. </p> <p> 1. En la barra de direcciones de Chrome, escriba <a href=\"//flags/#site-isolation-trial-opt-out\" target=\"_blank\" rel=\"nofollow noopener\"> chrome: // flags / # site-aislamiento-trial-opt-out </a> y haga clic en entrar. </p> <p> 2. Configure el <strong> Deshabilitar el aislamiento del sitio </strong> modo a <strong> Discapacitado </strong> y luego haga clic en <strong> Relanzar ahora </strong> . * </p> <p> * Nota: </p> <p><img src=\"images/image_thumb-20-397.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? </p> <p> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}