{"title":"REVISIÓN: Error de la aplicación de cámara 0xA00F424F (0x8004005) en Windows 10. (resuelto)","content":"<p> El error de la aplicación Cámara 0xA00F424F en Windows 10, al intentar tomar fotos o videos, significa que la aplicación Cámara no puede guardar las fotos o los archivos de video en la ubicación de almacenamiento especificada en su computadora. El error 0xA00F424F (0x8004005) puede aparecer por muchas razones, así que siga los métodos a continuación para solucionarlo. </p> <p><img src=\"images/image_thumb-9-592.png\" alt=\"FIX: Camera App Error 0xA00F424F in Windows 10\" loading=\"lazy\"></p> <p> Este tutorial contiene instrucciones paso a paso para resolver el error &quot;Algo salió mal. Lo sentimos, no pudimos guardar fotos&quot; con el error: &quot;0xA00F424F (0x80004005)&quot; o &quot;PhotoCaptureFileCreationFailed (0x80131500)&quot; </p> <h4> Cómo REPARAR: Aplicación de cámara - Guardar error 0xA00F424F (0x8004005) en Windows 10. </h4> <h6> Método 1. Permita que la aplicación de la cámara acceda a la cámara. </h6> <p> El primer método para corregir el error de la cámara 0xA00F424F es asegurarse de que la aplicación de la cámara tenga acceso a su cámara. Para hacer eso: </p> <p> 1. Navega a <strong> Ajustes </strong> &gt; <strong> Intimidad. <br> </strong> 2. Seleccione el <strong> Cámara </strong> app en el panel izquierdo y en el panel derecho, realice los siguientes ajustes: </p> <p> una. Alternar el <strong> Permitir que las aplicaciones accedan a su cámara </strong> cambiar a <strong> EN </strong> . <br> B. Desplácese hacia abajo y debajo del <strong> &#39;Elija qué aplicaciones de Microsoft Store pueden acceder a su cámara&#39; </strong> sección, alternar el <strong> Cámara </strong> cambio de la aplicación a <strong> EN </strong> . * </p> <p><img src=\"images/image_thumb-4-435.png\" alt=\"Allow apps to access your camera in Windows 10\" loading=\"lazy\"></p> <h6> Método 2. Restablezca la configuración de la aplicación de la cámara. </h6> <p> 1. Navega a <strong> Ajustes </strong> &gt; <strong> Aplicaciones </strong> . <br> 2. En la lista &quot;Aplicaciones y funciones&quot;, seleccione la aplicación Cámara y luego haga clic en <strong> Opciones avanzadas </strong> . </p> <p><img src=\"images/image_thumb-5-262.png\" alt=\"Reset Camera App Settings - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Desplácese hacia abajo y haga clic en <strong> Reiniciar. </strong></p> <p><img src=\"images/image_thumb-6-318.png\" alt=\"Reset app settings Windows 10\" loading=\"lazy\"></p> <h6></h6> <h6> Método 3. Elimine y vuelva a crear la carpeta &#39;Camera Roll&#39;. </h6> <p> El siguiente método para corregir el código de error 0xA00F424F (0x80004005) en la aplicación Cámara es asegurarse de que la carpeta &#39;Camera Roll&#39; (C: \\ Users \\% Username% \\ Pictures \\ Camera Roll), que es la ubicación predeterminada para guardar fotos y videos, existe y tiene los permisos correctos para guardar fotos y videos. Para hacer eso: </p> <p> 1. Abra el Explorador de Windows y en la barra de direcciones escriba la siguiente dirección y presione <strong> Ingresar </strong> : </p> <ul> <li> % APPDATA% \\ Microsoft \\ Windows \\ Libraries \\ Pictures </li> </ul> <p><img src=\"images/image_thumb-10-952.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Abra la carpeta &quot;Camera Roll&quot; * y asegúrese de que no tenga archivos. (De lo contrario, mueva todos sus archivos a otra ubicación en su disco). </p> <p> * Nota: Si la carpeta Camera Roll no existe, salte al paso 4. </p> <p> 3. Ahora, <strong> Eliminar </strong> la <strong> Rollo de la cámara </strong> carpeta. </p> <p><img src=\"images/image_thumb-11-440.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Por último, cree una nueva carpeta y asígnele el nombre &quot; <strong> Rollo de la cámara </strong> &quot; <br> 5. Cuando termine, abra la aplicación Cámara e intente tomar una foto o grabar un video para ver si el problema está solucionado. </p> <p> </p> <h6> Método 4. Agregue la carpeta Camera Roll a la Biblioteca de imágenes. </h6> <p> El método final para corregir el error de la aplicación de la cámara 0xA00F424F es especificar otra ubicación para almacenar las fotos / videos. Para hacer eso: </p> <p> 1. Abra el Explorador de Windows y en la barra de direcciones escriba la siguiente dirección y presione <strong> Ingresar </strong> : </p> <ul> <li> % APPDATA% \\ Microsoft \\ Windows \\ Libraries </li> </ul> <p> 2. Haga clic derecho en el <strong> Rollo de la cámara </strong> carpeta y seleccione <strong> Propiedades </strong> . </p> <p><img src=\"images/image_thumb-8-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Ahora, realice una de las siguientes acciones: </p> <p> una. Si el &quot;Rollo de la cámara&quot; no aparece en la &quot;Ubicación de las bibliotecas&quot;, haga clic en el <strong> Agregar </strong> botón, abra el <strong> Fotos </strong> carpeta y luego seleccione la <strong> Rollo de la cámara </strong> carpeta como la ubicación predeterminada para guardar las fotos y videos. </p> <p> B. Si la carpeta &#39;Camera Roll&#39; aparece debajo de la &#39;Ubicación de bibliotecas&#39;, haga clic en <strong> Agregar </strong> y especifique una nueva carpeta de almacenamiento para la aplicación de la cámara. Cuando termine, haga clic en <strong> Establecer ubicación para guardar </strong> y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-12-180.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Por último, abra la aplicación Cámara e intente tomar una foto o un video. </p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}