{"title":"REVISIÓN: Error en la operación de Outlook. Las interfaces de mensajería han devuelto un error desconocido en Outlook 2016, 2013, 2010 o 2007 (resuelto)","content":"<p> El error de Outlook &quot;Falló la operación. Las interfaces de mensajería han devuelto un error desconocido. Si el error persiste, reinicie Outlook. No se puede resolver el destinatario&quot;, puede aparecer en la versión de Outlook 2003, 2007, 2010 o 2013 y puede deberse a varias razones. Entonces, en este tutorial, encontrará varios métodos para resolverlo. </p> <p><img src=\"images/image_thumb-59-377.png\" alt=\"The Operation failed. The messaging interfaces has returned an unknown error. If the error persists, restart Outlook\" loading=\"lazy\"></p> <p> El error &quot;Falló la operación. La interfaz de mensajería ha devuelto un error desconocido&quot; en Outlook, puede aparecer en los siguientes casos: </p> <blockquote><p> 1. Cuando intenta ver o eliminar correos electrónicos en una carpeta de Outlook. </p> <p> 2. Al imprimir un correo electrónico o una tarea de calendario. </p> <p> 3. Cuando intenta crear un nuevo perfil de Outlook. </p></blockquote> <p> </p> <h4> Cómo CORREGIR: La interfaz de mensajería de Outlook ha devuelto un error desconocido. No se puede resolver el destinatario. </h4> <h6> Método 1. Restaurar la vista de carpetas de Outlook. </h6> <p> Si una o más vistas personalizadas están rotas, evita que Outlook muestre algunos elementos / carpetas. Por lo tanto, el siguiente método para resolver las &quot;interfaces de mensajería ha devuelto un error desconocido&quot; en Outlook es restaurar todas las vistas de carpetas de Outlook a su configuración predeterminada. Para hacer eso: </p> <p> 1. Cierre Outlook. <br> 2. Presione el <strong> Ventanas </strong> <img src=\"images/image_thumb8_thumb_thumb-501.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 3. En el cuadro &quot;Abrir&quot;, escriba el siguiente comando y presione <strong> Ingresar </strong> . </p> <ul> <li><strong> outlook / cleanviews </strong></li> </ul> <p><img src=\"images/image_thumb-57-310.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Outlook debería iniciarse normalmente. Compruébelo y si el error persiste, continúe con el siguiente paso. </p> <p> </p> <h6> Método 2. Elimine la configuración de Estilo de impresión de Outlook. </h6> <p> Outlook almacena la configuración de estilo de impresión en el archivo &quot;OutlPrnt&quot;. Si este archivo está dañado, puede causar el problema &quot;las interfaces de mensajería han devuelto un desconocido&quot; al imprimir en Outlook. En este caso: </p> <p> 1. Cierre Outlook. <br> 2. Presione el <strong> Ventanas </strong> <img src=\"images/image_thumb8_thumb_thumb-409.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 3. En el cuadro &quot;Abrir&quot;, escriba el siguiente comando y presione <strong> Ingresar </strong> . </p> <ul> <li> C: \\ Usuarios \\% nombre de usuario% \\ AppData \\ Roaming \\ Microsoft \\ Outlook \\ </li> </ul> <p> 4. <strong> Rebautizar </strong> la &quot; <strong> OutlPrnt </strong> &quot;archivo a&quot; <strong> OutlPrnt.old </strong> &quot;. </p> <p><img src=\"images/image_thumb-58-286.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Inicie Outlook y compruebe si se ha resuelto el error. (Cuando se inicie Outlook, reconstruirá el archivo &quot;Outlprnt&quot;). </p> <h6></h6> <h6> Método 3. Repare el archivo de datos de Outlook. </h6> <p> Según su caso, siga las instrucciones a continuación para reparar los daños en el archivo de datos de Outlook. </p> <p><strong> Caso 1: para cuentas Exchange (IMAP) (.OST) <br> </strong> Si está utilizando una cuenta de Exchange (IMAP), obligue a Outlook a volver a crear el archivo .OST de Outlook dañado haciendo lo siguiente: </p> <p> 1. <strong> Cerca </strong> panorama. <br> 2. <strong> Rebautizar </strong> el OST de la cuenta que está causando el problema. <br> 3. Abra Outlook. (Outlook volverá a crear el archivo OST). <br> 4. Si el error persiste, continúe con el paso 2 a continuación. </p> <p> </p> <p><strong> Caso 2: Para cuentas POP3 (PST) <br> </strong> Si está utilizando una cuenta POP3, repare el archivo .PST de Outlook dañado haciendo lo siguiente: </p> <p><strong> 1. </strong> <strong> Cerca </strong> Panorama. <br> <strong> 2. </strong> Abra el explorador de Windows y busque el <strong> scanpst.exe </strong> herramienta de reparación en esta ubicación: * </p> <ul> <li> C: \\ Archivos de programa \\ Microsoft Office \\% OfficeVersion% \\ SCANPST.EXE </li> </ul> <p> * Ubicación del archivo &quot;SCANPST.EXE&quot; según su versión de Office: * </p> <blockquote><p><strong> Outlook 2013 y Outlook 2016 </strong><br> Windows de 32 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office15 <br> Windows de 64 bits&gt; C: \\ Archivos de programa (x86) \\ Microsoft Office \\ Office15 <br> Outlook de 64 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office15 <br> Hacer clic y ejecutar&gt; C: \\ Archivos de programa \\ Microsoft Office 15 \\ root \\ office15 <br> <strong><br> Outlook 2010 </strong><br> Windows de 32 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office14 <br> Windows de 64 bits&gt; C: \\ Archivos de programa (x86) \\ Microsoft Office \\ Office14 <br> Outlook de 64 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office14 <br> <strong><br> Outlook 2007 </strong><br> Windows de 32 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office12 <br> Windows de 64 bits&gt; C: \\ Archivos de programa (x86) \\ Microsoft Office \\ Office12 </p></blockquote> <p> </p> <p> * Nota: Si no puede encontrar el &quot;scanpst.exe&quot; en las ubicaciones anteriores, busque en: </p> <ul> <li> C: \\ Archivos de programa (x86) \\ Microsoft Office \\ root \\ Office16. </li> </ul> <p><strong> 3. </strong> Haga doble clic para <strong> abierto </strong> el SCANPST.EXE <br> <strong> 4. </strong> Hacer clic <strong> Navegar </strong> . </p> <p><img src=\"images/image_thumb-55-702.png\" alt=\"scanpst.exe\" loading=\"lazy\"></p> <p> </p> <p><strong> 5. </strong> Busque el archivo de datos de Outlook dañado (por ejemplo, Outlook.pst) en esta ubicación: </p> <p> </p> <p><strong> Windows XP </strong></p> <ul> <li><strong> C: \\ Documentos y configuración \\% Nombre de usuario% \\ Configuración local \\ Datos de programa \\ Microsoft \\ Outlook \\ Outlook.pst </strong></li> </ul> <p><strong> Windows 7 o Vista </strong></p> <ul> <li><strong> C: \\ Usuarios \\% Nombre de usuario% \\ AppData \\ Local \\ Microsoft \\ Outlook \\ Outlook.pst </strong></li> </ul> <p> * Nota: en Outlook 2016, 2013 y 2010, el archivo de datos de Outlook se almacena de forma predeterminada en: </p> <ul> <li><strong> C: \\ Usuarios \\% Nombre de usuario% \\ Documentos \\ Archivos de Outlook \\ Outlook.pst </strong></li> </ul> <p><strong> 6. </strong> presione el <strong> Escanear </strong> y tenga paciencia hasta que la herramienta de reparación de la bandeja de entrada repare el archivo dañado. * </p> <p> * Nota: En la fase final de reparación, se le preguntará si desea crear una copia de seguridad. Respuesta &quot; <strong> sí </strong> &quot;para continuar la operación de reparación. </p> <p><img src=\"images/image_thumb-56-936.png\" alt=\"Outlook Inbox Repair Tool\" loading=\"lazy\"></p> <p> </p> <p> 7. Cuando se complete el proceso de reparación, abra Outlook y compruebe si el problema &quot;la interfaz de mensajería ha devuelto un error desconocido&quot; se ha resuelto. </p> <p> </p> <h6> Método 4. Elimine y vuelva a crear el perfil de Outlook. </h6> <p> El método final para resolver el problema &quot;La interfaz de mensajería ha devuelto un error desconocido&quot; es eliminar y volver a crear el perfil de Outlook. </p> <p> 1. Navegue hasta el Panel de control de Windows. Para hacer eso: </p> <blockquote><p> una. Escribe &quot;panel de control&quot; en el cuadro de búsqueda de Windows. <br> B. Hacer clic <strong> Panel de control </strong> de los resultados. </p></blockquote> <p><img src=\"images/image_thumb-53-981.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Configure el <strong> Vista por </strong> a <strong> Iconos pequeños </strong> para ver todos los elementos del panel de control y luego haga clic en <strong> Correo </strong> . </p> <p><img src=\"images/image_thumb-54-839.png\" alt=\"control panel mail options\" loading=\"lazy\"></p> <p> </p> <p> 3. Haga clic en <strong> Mostrar perfiles. * </strong></p> <p><strong> * Nota IMPORTANTE: </strong> Si usa más de una cuenta de correo electrónico, verifique si el error aparece en todas las cuentas de correo electrónico. Si el error aparece solo en una cuenta, intente eliminar y volver a agregar solo la cuenta con el problema mediante el siguiente procedimiento: </p> <blockquote><p> una. Haga clic en el <strong> Cuentas de correo electrónico </strong> y elimine la cuenta de correo electrónico con el problema. <br> B. Luego haga clic en <strong> Archivos de información </strong> y elimine el archivo de datos de Outlook asociado a la cuenta eliminada. <br> C. Finalmente haga clic en <strong> Cuentas de correo electrónico </strong> nuevamente y vuelva a agregar la cuenta de correo electrónico eliminada. </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-2-573.png\" alt=\"Create Secondary Outlook Profile\" loading=\"lazy\"></p> <p> </p> <p> 4. Seleccione el perfil actual y haga clic en <strong> Eliminar </strong> . Luego haga clic en <strong> sí </strong> para confirmar su decisión. </p> <p><img src=\"images/image_thumb-53-706.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Luego haga clic en el <strong> Agregar </strong> y proporcione un nombre para el perfil: (por ejemplo, &quot;Outlook&quot;). </p> <p><img src=\"images/image_thumb-54-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Siga los pasos del asistente &quot;Agregar cuenta&quot; para reconfigurar su cuenta de correo. </p> <p> </p> <p><img src=\"images/image_thumb-9-658.png\" alt=\"outlook account setup\" loading=\"lazy\"></p> <p> </p> <p> 7. Después de agregar su cuenta, abra Outlook y compruebe si se ha resuelto el mensaje &quot;Las interfaces de mensajería han devuelto un error desconocido&quot;. * </p> <p> * Nota: Si Outlook funciona bien y sin errores y desea restaurar los correos electrónicos del antiguo archivo de datos .PST de Outlook, siga las instrucciones a continuación: </p> <ol> <li> <ol> <li> De <strong> panorama </strong> &#39;s <strong> Archivo </strong> menú, seleccione <strong> Abrir y exportar </strong> &gt; <strong> Importación y exportación </strong> . </li> <li> En &quot;Elija una acción para realizar las opciones, seleccione <strong> Importar desde otro programa o archivo </strong> &amp; haga clic <strong> Próximo. </strong></li> <li> En las opciones &quot;Seleccionar tipo de archivo para importar&quot;, seleccione <strong> Archivo de datos de Outlook (.pst) </strong> &amp; haga clic <strong> próximo </strong> . </li> <li> En &#39;Archivo para importar la pantalla&#39;, haga clic en <strong> Navegar. </strong></li> <li> Seleccione el antiguo archivo PST de Outlook desde el que desea importar sus correos electrónicos y haga clic en <strong> Abierto. </strong></li> <li> Hacer clic <strong> próximo </strong> Y <strong> Terminar. </strong></li> </ol> </li> </ol> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}