{"title":"REVISIÓN: No se pudieron instalar las herramientas de corrección de Office 2016 (resuelto)","content":"<p> Si no pudo instalar las herramientas de corrección de Office 2016 con el error &quot;¡Vaya! Se requiere una versión compatible de Microsoft Office antes de poder instalar herramientas de corrección adicionales&quot;, continúe leyendo a continuación para resolver el problema. </p> <p> </p> <p><img src=\"images/image_thumb-23-190.png\" alt=\"Couldn't Install Office 2016 Proofing Tools - Oops! A compatible version of Microsoft Office is required \" loading=\"lazy\"></p> <p> </p> <p> El error de instalación de Microsoft Office Proofing Tools 2016 &quot;Se requiere una versión compatible de Microsoft Office antes de poder instalar herramientas de revisión adicionales&quot;, aparece comúnmente si intenta instalar una versión incompatible de las herramientas de revisión para la versión y arquitectura de Office instaladas, o si ha instalado una versión de 32 bits de Office 2016 en un sistema operativo Windows de 64 bits. </p> <h4> Cómo solucionarlo: no se pueden instalar las herramientas de corrección en Office 2016 u Office 2019. </h4> <p> </p> <h6> Método 1. Descargue las herramientas Correct Proofing. </h6> <p> En primer lugar, asegúrese de haber descargado el archivo instalador de las herramientas de corrección correcto, de acuerdo con la versión y arquitectura de Office instalada (32 o 64 bits). Para hacer eso: </p> <p> 1. Abra cualquier aplicación de Office (por ejemplo, Word). <br> 2. Desde el <strong> Archivo </strong> haga clic en el menú <strong> Cuenta </strong> (o <strong> Ayudar </strong> ). <br> 3. Ahora haga clic en el <strong> Acerca de Word </strong> en el panel derecho. <br> 4. Observe la versión de Office instalada (por ejemplo, &quot;2016&quot;) y la arquitectura (por ejemplo, &quot;64 bits&quot;). </p> <p><img src=\"images/image_thumb-24-106.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Ahora según la versión de Office: </p> <ul> <li> Para <strong> Oficina 2016 </strong> descargue las herramientas de revisión desde aquí: <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=52668\" target=\"_blank\" rel=\"nofollow noopener\"> Herramientas de corrección de Office 2016 </a> . </li> <li> Para <strong> Oficina 2019 </strong> descargue las herramientas de revisión desde aquí: <a href=\"https://support.office.com/en-us/article/language-accessory-pack-for-office-82ee1236-0f9a-45ee-9c72-05b026ee809f?ui=en-US&rs=en-US&ad=US\" target=\"_blank\" rel=\"nofollow noopener\"> Herramientas de corrección de Office 2019 </a></li> </ul> <p> 6. Luego, elija el idioma deseado para las herramientas de corrección. <br> 7. Finalmente, según la arquitectura de Office (32 o 64 bits): </p> <ul> <li> Para Office de 32 bits, descargue el archivo de instalación x86. (por ejemplo, &quot;proofingtools2016_en-us-x86.exe) </li> <li> Para Office de 64 bits, descargue el archivo de instalación x64. (p. ej., &quot;proofingtools2016_en-us-x64.exe) </li> </ul> <p> 8. Haga doble clic en el archivo .exe descargado para instalar las herramientas de corrección. </p> <p> </p> <h6> Método 2. Reparación de la instalación de Office. </h6> <p> 1. Navega a <strong> Programas y </strong><strong> Características. </strong> Para hacer eso: </p> <blockquote><p> 1. Presione simultáneamente las ventanas <img src=\"images/image_thumb36-318.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo: <strong> appwiz.cpl </strong> y haga clic en <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-24-189.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. En Programas y características, seleccione el producto de Microsoft Office que se instaló en su sistema y haga clic en <strong> Cambio </strong> . </p> <p><img src=\"images/image_thumb-2-328.png\" alt=\"repair office 2016 and office 2019\" loading=\"lazy\"></p> <p> </p> <p> 3. Por último, haga clic en <strong> Reparar </strong> y siga los pasos restantes para reparar Microsoft Office. * </p> <p> * Aviso: si después de hacer clic en Reparar, recibe el mensaje &quot; <strong> ¿Cómo le gustaría reparar sus programas de Office? </strong> &quot;, seleccione la <strong> Reparación rápida </strong> opción, que comprueba y reemplaza los archivos dañados o faltantes. Si después de la &quot;Reparación rápida&quot;, los problemas no se solucionan, elija el <strong> Reparación en línea </strong> opción para reinstalar su producto de Office. (requiere una conexión a Internet). </p> <p><img src=\"images/image_thumb-26-143.png\" alt=\"Repair Office\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Cuando se complete la reparación, reinicie su PC. <br> 5. Instale las herramientas de corrección. </p> <p> </p> <h6> Método 3. Desinstale y vuelva a instalar Office 2016 de 64 bits. </h6> <p> El siguiente método para resolver los problemas de instalación de las herramientas de corrección de Office es quitar y volver a instalar Office 2016 en su sistema. Para hacer eso: </p> <h2> Paso 1. Desinstale Office de su sistema. </h2> <p> 1. Descarga el <a href=\"http://go.microsoft.com/?linkid=9815935\" target=\"_blank\" rel=\"nofollow noopener\"> Desinstalar Microsoft Office Fix </a> herramienta para desinstalar automáticamente Office 365, Office 2016 u Office 2013. <br> 2. Ejecute &quot;Desinstalar Microsoft Office Fix&quot; y presione <strong> próximo </strong> en la primera pantalla. </p> <p><img src=\"images/image_thumb-19-681.png\" alt=\"office uninstall tool\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Deje que el proceso resuelva los problemas con Office Desinstale y elimine el software de Office de su computadora. </p> <p><img src=\"images/image_thumb-20-361.png\" alt=\"cannot uninstall office\" loading=\"lazy\"></p> <p> </p> <h2> Paso 2. Descargue e instale Office 2016. </h2> <p> 1. Navega a <a href=\"https://www.heidoc.net/joomla/technology-science/microsoft/67-microsoft-windows-iso-download-tool\" target=\"_blank\" rel=\"nofollow noopener\"> HeiDoc.net </a> y descarga el <strong><a href=\"https://www.heidoc.net/php/Windows-ISO-Downloader.exe\" target=\"_blank\" rel=\"nofollow noopener\"> Herramienta de descarga ISO de Windows </a></strong> . <br> 2. Haga doble clic para ejecutar el archivo descargado &quot;Windows-ISO-Downloader.exe&quot;. <br> 3. En la herramienta de descarga de Windows ISO: </p> <blockquote><p> una. Elegir la <strong> Oficina </strong> pestaña en el panel derecho. <br> B. <strong> Seleccione </strong> la <strong> Versión de Office </strong> que desea descargar. (por ejemplo, &quot;Office 2016&quot;). <br> C. Luego, a la izquierda, elija el <strong> Edición </strong> de Office y el deseado <strong> idioma </strong> debajo. <br> D. Cuando termine, haga clic en <strong> Descargar </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-595.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Cuando se complete la descarga, haga doble clic en el archivo de imagen descargado (ProPlusRetail.img) para montarlo en Explorer. <br> 5. Explore el contenido de la imagen montada (unidad) y abra la carpeta &quot;Office&quot;. <br> 6. Haga doble clic en &quot;setup32.exe&quot; para instalar la versión de Office de 32 bits, o en &quot;setup64.exe&quot; para instalar la versión de Office de 64 bits. * </p> <p> * Nota: le sugiero que, si tiene una versión de Windows de 64 bits, instale la versión de 64 bits de Office (setup64.exe). </p> <p><img src=\"images/image_thumb-25-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Cuando se complete la instalación, use su clave de licencia para activar Office. <br> 8. Siga las instrucciones del método 1 anterior para instalar las herramientas de corrección. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}