{"title":"REVISIÓN: No hay suficiente almacenamiento disponible para procesar este comando: no se puede acceder a las carpetas compartidas o usar el escritorio remoto (resuelto)","content":"<p> El error &quot;No hay suficiente almacenamiento disponible para procesar este comando&quot;, puede aparecer cuando intenta acceder a las carpetas compartidas en otra estación de trabajo de Windows o en un servidor 2003, 2008, 2012 o 2016, o cuando está utilizando la Conexión de escritorio remoto (RDP ), para conectarse a otra computadora con Windows (estación de trabajo o servidor). </p> <p><img src=\"images/image_thumb-127.png\" alt=\"Not enough storage is available to process this command\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contiene instrucciones para resolver los siguientes problemas, que pueden aparecer en todas las versiones de Windows (Windows 10, 8 / 8.1, 7, Vista, XP y Windows Server 2003, 2008, 2012 o 2016): </p> <p> 1. Cuando intenta acceder a las carpetas compartidas en la máquina del servidor, recibe el mensaje de error: &quot; <em> Carpeta compartida </em> no es accesible. Es posible que no tenga permiso para utilizar este recurso de red. Póngase en contacto con el administrador de este servidor para averiguar si tiene permisos de acceso. No hay suficiente almacenamiento de servidor disponible para procesar este comando &quot;. </p> <p> 2. Cuando intenta conectarse de forma remota (usando RDP) a otra máquina basada en Windows, aparece el mensaje de error: &quot;El sistema no puede iniciar sesión debido a la siguiente razón. No hay suficiente almacenamiento disponible para procesar este comando&quot;. </p> <h4> CÓMO REPARAR: Mensaje de error &quot;No hay suficiente almacenamiento disponible para procesar este comando&quot; en el Escritorio remoto (RDP) o al intentar acceder a las carpetas compartidas. </h4> <p> En la máquina &quot;servidor&quot; de Windows, que desea acceder a sus archivos o conectarse remotamente: </p> <p><strong> 1. </strong> Prensa &quot; <strong> Ventanas </strong> &quot;+&quot; <strong> R </strong> &quot;Teclas para abrir el <em> CORRER </em> ventana. <br> <strong> 2. </strong> Tipo <strong> regedit </strong> y presione <strong> Ingresar </strong> para abrir el Editor del registro. </p> <p><img src=\"images/image_thumb7-649.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Luego navega hasta esta tecla: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ LanmanServer \\ Parameters </strong></li> </ul> <p><img src=\"images/image_thumb-1-198.png\" alt=\"fix Not enough storage - cannot access shared items\" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> En el panel derecho, haga doble clic para abrir el <strong> IRPStackSize </strong> valor <strong> . * </strong></p> <p><strong> * Nota: </strong> Si no ves el <strong> IRPStackSize </strong> valor, entonces: </p> <p> </p> <blockquote><p> 1. Haga clic derecho en un espacio vacío (en el panel derecho) y luego seleccione <strong> Nuevo </strong> -&gt; <strong> Valor DWORD (32 bits) </strong></p> <p><img src=\"images/image_thumb-2-236.png\" alt=\"fix Not enough storage using RDP (Remote Desktop)\" loading=\"lazy\"></p> </blockquote> <blockquote><p> 2. Nombra el nuevo valor <strong> IRPStackSize </strong> y golpea <strong> Ingresar. </strong></p></blockquote> <p><strong> 5. </strong> Seleccione <strong> Decimal </strong> , cambie los datos del valor a <strong> 50 </strong> y haga clic en <strong> OK </strong> . * </p> <p> * Nota: El rango (en decimal) del parámetro está entre 1 y 50. </p> <p><img src=\"images/image_thumb-3-255.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 6. </strong> <strong> Cerca </strong> editor de registro y <strong> Reanudar </strong> el servidor. * </p> <p> * Nota importante: si después de reiniciar, recibe el mismo mensaje de error, cuando está utilizando la Conexión de escritorio remoto, o cuando intenta acceder a los archivos compartidos en otra computadora, aplique la modificación de registro anterior a su computadora también. </p> <p> ¡Eso es todo! ¿Funcionó para ti? </p> <p> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}