{"title":"REVISIÓN: No podemos instalar Office debido a Office 16 Haga clic para ejecutar el registro del componente de extensibilidad. (Resuelto)","content":"<p> Si no puede instalar Office debido al &quot;Registro de componentes de extensibilidad de hacer clic para ejecutar de Office 16&quot;, continúe leyendo este tutorial, que contiene instrucciones detalladas para resolver los siguientes problemas de instalación de Office: </p> <p><strong> Problema No1: </strong> Al intentar instalar una versión de 32 bits de Microsoft Office, recibe el error: <br> <em> &quot;No podemos instalar la versión de 32 bits de Office porque encontramos los siguientes programas de 64 bits en su PC: <br> Registro de 64 bits del componente de extensibilidad de hacer clic y ejecutar de Office 16 <br> Desinstale todos los programas de Office de 64 bits y vuelva a intentar instalar Office de 32 bits. Si desea instalar Office de 64 bits en su lugar, ejecute la configuración de 64 bits &quot;. </em></p> <p><img src=\"images/image_thumb-6-215.png\" alt=\"FIX: We can't Install Office because of Office 16 Click to Run Extensibility Component Registration\" loading=\"lazy\"></p> <p> </p> <p><strong> Problema No2 </strong> : Al intentar instalar una versión de 64 bits de Microsoft Office, recibe el error: <br> <em> &quot;No podemos instalar la versión de 64 bits de Office porque encontramos los siguientes programas de 32 bits en su PC: <br> <em> Registro de 32 bits del componente de extensibilidad de hacer clic y ejecutar de Office 16 <br> <em> Desinstale todos los programas de Office de 32 bits y vuelva a intentar instalar Office de 64 bits. Si desea instalar Office de 32 bits en su lugar, ejecute la configuración de 32 bits &quot;. </em></em></em></p> <p> </p> <h2> Cómo REPARAR: No podemos instalar esta versión de Office porque encontramos los siguientes programas en su PC: Registro de 32 bits del componente de extensibilidad de hacer clic y ejecutar de Office 16. </h2> <p> 1. Presione <strong> Ventanas </strong> <img src=\"images/image_thumb41-277.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> instalador </strong> y presione <strong> Ingresar </strong> para navegar a la carpeta &quot;C: \\ Windows \\ Installer&quot;. </p> <p><img src=\"images/image_thumb-7-594.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Desde el <strong> Vista </strong> menú, haga clic en <strong> Agregar columnas </strong> y luego haga clic en <strong> Elija columnas </strong></p> <p><img src=\"images/image_thumb-8-367.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Cheque </strong> la <strong> Sujeto </strong> y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-9-532.png\" alt=\"image\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-43.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 5. Ordene los resultados por Asunto y luego desplácese hacia abajo hasta que encuentre el &quot; <em> Componente de extensibilidad de hacer clic y ejecutar de Office 16 &quot; </em> que se menciona en el mensaje de error de instalación de Office. </p> <p><img src=\"images/image_thumb-10-106.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Cuando lo encuentre, haga clic derecho sobre él y elija <strong> Desinstalar </strong> . </p> <p><img src=\"images/image_thumb-11-389.png\" alt=\"Remove office Click to Run installer\" loading=\"lazy\"></p> <p> 7. Cuando se complete la desinstalación, proceda a instalar Microsoft Office nuevamente. * </p> <p> * Nota: Si sigue recibiendo el mismo error, entonces ... </p> <p> 1. Continúe y desinstale todos los &quot;Componentes de hacer clic y ejecutar de Office 16&quot; y, si la instalación vuelve a fallar ... <br> 2. Desinstale completamente Microsoft Office de su PC, siguiendo las instrucciones de este <a href=\"https://www.repairwin.com/fix-couldnt-uninstall-office-365-2016-2013-2010-or-2007/\" target=\"_blank\" rel=\"nofollow noopener\"> tutorial </a> y luego proceda a reinstalar Office. </p> <ul> <li> <p> Artículo relacionado: : <a href=\"https://www.repairwin.com/fix-couldnt-uninstall-office-365-2016-2013-2010-or-2007/\" target=\"_blank\" rel=\"noopener noreferrer\"> REVISIÓN: No se puede desinstalar Office 365, 2016, 2013, 2010 o 2007. </a></p> </li> </ul> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Por favor, deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a correr la voz sobre esto. </p>"}