{"title":"REVISIÓN: Su organización administra la protección contra virus y amenazas en Windows 10. (resuelto)","content":"<p> Este tutorial contiene instrucciones para resolver el siguiente problema en el Centro de seguridad de Windows Defender: &quot;Su organización administra la protección contra virus y amenazas&quot; en el sistema operativo Windows 10. </p> <p> Los mensajes (errores) de Windows Defender: &quot;Su organización administra la protección contra virus y amenazas&quot;, &quot;Su organización administra algunas configuraciones&quot; y <br> &quot;La protección en tiempo real es administrada por su administrador&quot;, comúnmente aparece en computadoras comerciales donde la protección antivirus es administrada por el administrador del dominio. Si la computadora no pertenece a un dominio, los errores anteriores aparecen después de instalar un antivirus de terceros o después de un ataque de virus. </p> <p><img src=\"images/image_thumb-25-853.png\" alt=\"FIX: Virus & Threat Protection is Managed by your Organization - Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Cómo CORREGIR: Su organización administra la protección contra virus y amenazas en Windows 10. </h4> <h6> Paso 1. Desinstale cualquier otro antivirus que no sea de Microsoft. </h6> <p> El primer paso para resolver el error de Windows Defender &quot;La protección contra virus y amenazas es administrada por su organización&quot; es desinstalar cualquier otro antivirus de terceros (por ejemplo, Avast, MacAfee, MalwareBytes, etc.) de su sistema. </p> <p> </p> <h6> Paso 2. Analice su sistema en busca de virus y malware. </h6> <p> El segundo paso para resolver el error de Windows Defender &quot;Algunas configuraciones son administradas por su organización&quot; es asegurarse de que su sistema esté libre de virus / malware. Para esa tarea, siga las instrucciones de esta guía: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo escanear su computadora en busca de virus y otros programas maliciosos. </a></p> <p> </p> <h6> Paso 3. Restaure la configuración de Windows Defender a los valores predeterminados. </h6> <p> Continúe y habilite la protección en tiempo real en Windows Defender, utilizando uno de los métodos siguientes: </p> <h4> Método 1. Active la protección antivirus de Defender en el registro. </h4> <p> 1. Abrir <strong> Editor de registro </strong> : Para hacer eso: </p> <ul> <li> Presione simultáneamente las ventanas <img src=\"images/image_thumb36-979.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. </li> <li> Tipo <strong> regedit </strong> &amp; prensa <strong> Ingresar. </strong></li> </ul> <p><img src=\"images/image_thumb7-229.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2 .. Navegue hasta la siguiente tecla en el panel izquierdo: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Políticas \\ Microsoft \\ Windows Defender </strong></li> </ul> <p> 3. En el panel derecho, haga doble clic en <strong> DisableAntiSpyware </strong> REG_DWORD valor y cambie los datos del valor de 1 a <strong> 0. </strong></p> <p><img src=\"images/image_thumb-26-852.png\" alt=\"enable defender antivirus protection - registry\" loading=\"lazy\"></p> <p> </p> <p> 4. Haga clic en <strong> OK </strong> y <strong> cerca </strong> Editor de registro. <br> 5. <strong> Reanudar </strong> tu computador. Normalmente, después de reiniciar, Windows Defender debería estar habilitado. * </p> <p> * Nota: Si después de reiniciar su PC, Windows Defender aún está deshabilitado, con el estado &quot;Su organización administra la protección contra virus y amenazas&quot;, proceda y modifique el <br> <strong> Comienzo </strong> Valor REG_DWORD de 4 a <strong> 2 </strong> en las siguientes claves de registro: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ SecurityHealthService </li> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ WinDefend </li> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ WdNisSvc </li> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ MpsSvc </li> </ul> <p> </p> <h5> Método 2. Elimine el <strong> DisableAntiSpyware </strong> Valor de registro desde el símbolo del sistema. </h5> <p> 1. Abrir <strong> Símbolo del sistema como administrador </strong> . Para hacer eso: </p> <ul> <li> En el cuadro de búsqueda, escriba: <strong> símbolo del sistema </strong> o <strong> cmd </strong></li> <li> Haga clic derecho en <strong> cmd </strong> o <strong> Símbolo del sistema </strong> resultado y seleccione <strong> Ejecutar como administrador. </strong></li> </ul> <p><img src=\"images/image_thumb-10-243.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. En el símbolo del sistema, escriba (Copiar / Pegar) el siguiente comando y presione <strong> Ingresar: </strong></p> <ul> <li> REG BORRAR &quot;HKLM \\ SOFTWARE \\ Políticas \\ Microsoft \\ Windows Defender&quot; / v DisableAntiSpyware </li> </ul> <p> 3. Luego presione <strong> Y </strong> para confirmar su decisión. </p> <p><img src=\"images/image_thumb-28-288.png\" alt=\"enable defender antivirus protection command\" loading=\"lazy\"></p> <p> </p> <p> 4. Cierre el símbolo del sistema y <strong> Reanudar </strong> tu computadora. </p> <p> </p> <h5> Método 3. Active la protección en tiempo real de Windows Defender en la directiva de grupo. </h5> <p> Si posee Windows 10 Professional, Enterprise o Education Edition, continúe y habilite las protecciones Antivirus de Windows Defender en la Política de grupo. Para hacer eso: </p> <p> 1. Presione simultáneamente las ventanas <img src=\"images/image_thumb36-102.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> gpedit.msc </strong> &amp; Prensa <strong> Ingresar. </strong></p> <p><img src=\"images/image_thumb-78-343.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. En el panel izquierdo, navegue hasta: </p> <ul> <li><strong> Configuración del equipo \\ Plantillas administrativas \\ Componentes de Windows \\ Antivirus de Windows Defender </strong></li> </ul> <p> 4. En el panel derecho, abra el <strong> Apague el antivirus de Windows Defender </strong> configuración. </p> <p><img src=\"images/image14_thumb-207.png\" alt=\"turn on defender antivirus protection- group policy\" loading=\"lazy\"></p> <p> </p> <p> 5. Establezca la configuración de política en <strong> No configurado </strong> o <strong> Discapacitado </strong> para habilitar la protección en tiempo real y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-29-337.png\" alt=\"enable defender antivirus protection group policy\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Reanudar </strong> el ordenador. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir este problema. </p>"}