{"title":"REVISIÓN: CORRUPCIÓN DE MEMORIA DETECTADA EN UN POOL ESPECIAL causado por ntoskrnl.exe BSOD 0x000000c1 (resuelto)","content":"<p> En una computadora con Windows 10, aparece el siguiente error BSOD: &quot;SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION, causado por el archivo ntoskrnl.exe con el código de error 0x000000c1. El error de verificación de errores&quot; 0x000000c1 - SPECIAL POOL DETECTED MEMORY CORRUPTION &quot;generalmente se debe a un software instalado o un dispositivo controlador y no se debe a un problema de hardware. </p> <p><strong> PISCINA ESPECIAL DETECTADA CORRUPCIÓN DE MEMORIA, Código de verificación de error 0x000000c1 Error de BSOD en los detalles: </strong><br> &quot; <em> Se ha detectado un problema y se ha cerrado Windows para evitar daños <br> a tu computador. <br> </em><em> El problema parece deberse al siguiente archivo: ntoskrnl.exe <br> SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION <br> … .. <br> *** DETENER: 0x000000c1 (0xfffff30dd554cfc0, 0xfffff30dd554c22c, 0x0000000000034038, <br> 0x0000000000000032) </em></p> <p><em> *** ntoskrnl.exe - Dirección 0xfffff803c544aca0 base en 0xfffff803c52a2000 DateStamp <br> 0x5b63c7b5 &quot; </em></p> <p><img src=\"images/image_thumb-1-562.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contiene instrucciones detalladas para resolver el error de pantalla azul 0x000000c1 - CORRUPCIÓN DE MEMORIA DETECTADA EN PISCINA ESPECIAL causada por el archivo &quot;ntoskrnl.exe&quot;. </p> <p> </p> <h2> Cómo FIX STOP 0x000000C1: PISCINA ESPECIAL DETECTADA CORRUPCIÓN DE MEMORIA CAUSADA POR NTOSKENL.EXE. </h2> <p> El problema de la pantalla azul &quot;Detener 0x000000C1: CORRUPCIÓN DE MEMORIA DETECTADA EN PISCINA ESPECIAL&quot; puede deberse a varias razones, p. controladores de dispositivos defectuosos, archivos de sistema dañados, ataques de virus o de un programa que se ejecuta en segundo plano. Para solucionar el problema, siga los métodos a continuación: </p> <h6> Método 1. Analice su sistema en busca de virus y malware. </h6> <p> El primer paso para resolver los problemas de la pantalla azul &quot;PISCINA ESPECIAL DETECTADA CORRUPCIÓN DE MEMORIA&quot; es asegurarse de que su sistema esté libre de virus / malware. Para esa tarea, siga las instrucciones de esta guía: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo escanear su computadora en busca de virus y otros programas maliciosos. </a></p> <p> </p> <h6> Método 2. Desinstale su software antivirus / de seguridad. </h6> <p> &quot;El problema de la pantalla azul&quot; CORRUPCIÓN DE MEMORIA DETECTADA PISCINA ESPECIAL &quot;, puede ser causado después de la actualización automática de su programa Antivirus / Seguridad (especialmente si está usando AVAST o AVG). Por lo tanto, proceda y desinstale completamente su programa antivirus de su sistema y reinicia tu computadora. <br> - Si el problema de BSOD no ocurre después de la eliminación del antivirus, proceda a descargar y reinstalar la última versión de su software de seguridad en su sistema. </p> <p> </p> <h6> Método 3. Inicie Windows en estado de inicio limpio. </h6> <p> El siguiente método, para resolver el problema de BSOD &quot;PISCINA ESPECIAL DETECTADA CORRUPCIÓN DE MEMORIA&quot;, es iniciar Windows en un <a href=\"https://www.repairwin.com/how-to-start-windows-in-clean-boot-state/\" target=\"_blank\" rel=\"nofollow noopener\"> &quot;bota limpia </a> &quot;, para identificar qué programa hace que su sistema se bloquee. </p> <p> Para iniciar Windows en estado de arranque limpio: </p> <p> 1. Presione las ventanas <img src=\"images/image_thumb8_thumb_thumb-465.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> msconfig </strong> y presione <strong> Ingresar </strong> . </p> <p><img src=\"images/image_thumb-47-632.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. En la pestaña Servicios, <strong> Esconder todos los servicios de Microsoft </strong> casilla de verificación y luego presione el <strong> Desactivar todo </strong> , para evitar que todos los servicios que no sean de Microsoft se inicien al iniciar Windows. </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-480.png\" alt=\"clean boot state\" loading=\"lazy\"></p> <p> 4. Luego seleccione el <strong> Puesta en marcha </strong> pestaña y <strong> Desactivar </strong> todos los demás programas que se inician durante el inicio de Windows y se ejecutan en segundo plano. * </p> <p> * Nota: Activado <strong> Windows 10 </strong> o <strong> 8 </strong> , Seleccione <strong> Abrir el Administrador de tareas </strong> para deshabilitar los programas de inicio. </p> <p><img src=\"images/image_thumb-29-570.png\" alt=\"Windows clean boot\" loading=\"lazy\"></p> <p> </p> <p> 5. Cuando termine, haga clic en <strong> OK </strong> y <strong> Reanudar </strong> tu computadora. <br> 6. Si después de reiniciar, su computadora está funcionando bien y sin problemas de BSOD, inicie nuevamente la utilidad Configuración del sistema y habilite uno por uno todos los elementos deshabilitados y reinicie su sistema, hasta que descubra cuál causa el problema de BSoD. * </p> <p> * Nota a <strong> Salida </strong> de <strong> Arranque limpio </strong> estado, inicie la utilidad de configuración del sistema y en el <strong> General </strong> Tab elegir <strong> Inicio normal. </strong></p> <p> </p> <h6> Método 4. Compruebe la memoria (RAM) y el disco duro (HDD) en busca de problemas. </h6> <p> Problemas de pantalla azul, pueden deberse a un módulo RAM dañado o un disco duro defectuoso. Para probar y diagnosticar problemas en los componentes de RAM y HDD, siga las instrucciones de estas guías: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo diagnosticar problemas de memoria de la computadora con Memtest86 + </a></li> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Las mejores herramientas de prueba y diagnóstico de disco duro para comprobar el estado del disco duro </a></li> </ul> <p> </p> <p> </p> <h6> Método 5. Actualice los controladores del dispositivo. </h6> <p> En algunos casos, el problema BSOD &quot;SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION causado por el módulo ntoskrnl.exe&quot;, se produce debido a un controlador de dispositivo no válido o dañado. Entonces, proceda y actualice los controladores de los siguientes dispositivos en su computadora con este orden: </p> <p> 1. Adaptador de video (VGA). <br> 2. Chipset. <br> 3. Adaptador Ethernet. <br> 4. Adaptador de Wi-Fi (si existe). </p> <p> </p> <h6> Método 6. <strong> Analizar Minidump. </strong></h6> <p> Cuando Windows se bloquea con una pantalla azul, almacena los detalles de la pantalla BSoD en archivos pequeños, que se denominan &quot; <strong> MiniDump </strong> &quot;. El análisis de la <strong> Minidump </strong> Los archivos pueden ayudarlo a solucionar problemas y resolver el problema de la pantalla azul. Para realizar esta tarea, siga las instrucciones de este artículo: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo analizar archivos MiniDump con BlueScreenView </a> . </p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}