{"title":"REVISIÓN: Error de corrupción de archivos de datos de Outlook. (Resuelto)","content":"<p> El tutorial contiene instrucciones detalladas sobre cómo reparar la corrupción del archivo de datos de Outlook en Outlook 2019, 2016, 2013, 2010 o 2007. La corrupción del archivo de datos de Outlook puede deberse a varias razones. (por ejemplo, después de un corte de energía, disco duro dañado, problemas de conectividad de red, etc.), y cuando sucede, impide que Outlook se inicie normalmente con el error &quot;Se detectaron problemas con uno de los archivos de datos de Outlook en uso. Este proceso y todos los demás el uso de este archivo se cerrará en x segundos. Deberá reiniciar Outlook para reparar su archivo &quot;. </p> <p><img src=\"images/image_thumb-3-839.png\" alt=\"FIX: Outlook Data File Corruption\" loading=\"lazy\"></p> <p> Para reparar el archivo de datos de Outlook dañado y resolver el error de corrupción del archivo de datos de Outlook, siga los pasos a continuación. </p> <h4> Cómo corregir: corrupción de archivos de datos de Outlook. </h4> <p> 1. Navegue hasta el Panel de control de Windows. Para hacer eso: </p> <blockquote><p> una. Escribe &quot;panel de control&quot; en el cuadro de búsqueda de Windows. <br> B. Hacer clic <strong> Panel de control </strong> de los resultados. </p></blockquote> <p><img src=\"images/image_thumb-53-981.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> 2. Configure el <strong> Vista por </strong> a <strong> Iconos pequeños </strong> para ver todos los elementos del panel de control y luego haga clic en <strong> Correo </strong> . </p> <p><img src=\"images/image_thumb-54-211.png\" alt=\"control panel mail options\" loading=\"lazy\"></p> <p> 3. Haga clic en el <strong> Archivos de información </strong> botón. </p> <p><img src=\"images/image_thumb4_thumb-710.png\" alt=\"image_thumb[4]\" loading=\"lazy\"></p> <p> 4. Observe el nombre y la ubicación del archivo de datos &quot;Outlook.pst&quot; y cierre todas las ventanas abiertas. * </p> <p> * Nota: si tiene una cuenta de Exchange (cuenta IMAP), verá un archivo de datos .OST (por ejemplo, &quot;Outlook.ost&quot;). En este caso, obligue a Outlook a volver a crear el archivo &quot;Outlook .OST dañado&quot;, haciendo lo siguiente: </p> <blockquote><p> 1. Haga clic en <strong> Abrir localización de archivo </strong> . <br> 2. <strong> Rebautizar </strong> los datos OST de la cuenta que está causando el problema (si tiene más de una cuenta IMAP). <br> 3. Abra Outlook para volver a crear el archivo OST… </p> <p><img src=\"images/image_thumb6_thumb-615.png\" alt=\"image_thumb[6]\" loading=\"lazy\"></p> </blockquote> <p> 5. Abra el explorador de Windows y busque el <strong> scanpst.exe </strong> herramienta de reparación en esta ubicación: * </p> <ul> <li> C: \\ Archivos de programa \\ Microsoft Office \\% OfficeVersion% \\ SCANPST.EXE </li> </ul> <p> * Nota: A continuación se mencionan las ubicaciones del archivo &quot;SCANPST.EXE&quot; según la versión de Office instalada. Si no puede encontrar el &quot;scanpst.exe&quot; en las ubicaciones anteriores, busque en: </p> <ul> <li> <ul> <li> C: \\ Archivos de programa (x86) \\ Microsoft Office \\ root \\ Office16. </li> </ul> </li> </ul> <blockquote><p><strong> Outlook 2013 </strong><br> Windows de 32 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office15 <br> Windows de 64 bits&gt; C: \\ Archivos de programa (x86) \\ Microsoft Office \\ Office15 <br> Outlook de 64 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office15 <br> Hacer clic y ejecutar&gt; C: \\ Archivos de programa \\ Microsoft Office 15 \\ root \\ office15 <br> <strong><br> Outlook 2010 </strong><br> Windows de 32 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office14 <br> Windows de 64 bits&gt; C: \\ Archivos de programa (x86) \\ Microsoft Office \\ Office14 <br> Outlook de 64 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office14 <br> <strong><br> Outlook 2007 </strong><br> Windows de 32 bits&gt; C: \\ Archivos de programa \\ Microsoft Office \\ Office12 <br> Windows de 64 bits&gt; C: \\ Archivos de programa (x86) \\ Microsoft Office \\ Office12 </p></blockquote> <p> 6. Haga doble clic para <strong> abierto </strong> el SCANPST.EXE <br> 7. Haga clic en <strong> Navegar </strong> . </p> <p><img src=\"images/image_thumb-55-340.png\" alt=\"scanpst.exe\" loading=\"lazy\"></p> <p> </p> <p> 8. Busque y seleccione el archivo de datos de Outlook dañado (por ejemplo, Outlook.pst) y haga clic en <strong> está bien. </strong></p> <p> 9. Presione el <strong> Escanear </strong> y tenga paciencia hasta que la herramienta de reparación de la bandeja de entrada repare el archivo dañado. * </p> <p> * Nota: En la fase final de reparación, se le preguntará si desea crear una copia de seguridad. Respuesta &quot; <strong> sí </strong> &quot;para continuar la operación de reparación. </p> <p><img src=\"images/image_thumb-56-120.png\" alt=\"Outlook Inbox Repair Tool\" loading=\"lazy\"></p> <p> </p> <p> 10. Cuando se complete el proceso de reparación, abra Outlook. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}