{"title":"REVISIÓN: 2147219196 Error del sistema de archivos en la aplicación Fotos en Windows 10 (resuelto)","content":"<p> En una computadora basada en Windows 10 con la aplicación &#39;Fotos&#39; como la aplicación predeterminada para abrir imágenes, aparece el &quot;Error del sistema de archivos&quot; -2147219196 &quot;cuando el usuario intenta abrir una imagen .JPG o .PNG (con las &#39;FOTOS&#39; aplicación). </p> <p><img src=\"images/image_thumb-73-456.png\" alt=\"FIX: 2147219196 File system error in Photos app \" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contiene instrucciones para resolver el &quot;Error del sistema de archivos 2147219196&quot; al abrir imágenes en la aplicación Fotos en Windows 10. </p> <h4> Cómo CORREGIR: No se pueden abrir imágenes con la aplicación &#39;Fotos&#39; en Windows 10 con el error &quot;Error del sistema de archivos 2147219196&quot;. </h4> <p> Nota: Antes de continuar a continuación, asegúrese de que su sistema esté completamente actualizado. </p> <h6> Paso 1. Ejecute el solucionador de problemas de aplicaciones de la Tienda Windows. </h6> <p> 1. Navega a <strong> Comienzo </strong> -&gt; <strong> Ajustes </strong> -&gt; <strong> Actualización y seguridad </strong> . <br> 2. Elija <strong> Solucionar problemas </strong> desde la izquierda y luego haga clic en <strong> Solucionador de problemas de aplicaciones de la Tienda Windows </strong> a la derecha y haga clic en <strong> Ejecute el solucionador de problemas </strong> . </p> <p><img src=\"images/image_thumb-74-400.png\" alt=\"windows store apps troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 3. Siga las instrucciones en pantalla y deje que el solucionador de problemas solucione los problemas. <br> 4. Cuando termine la resolución de problemas, cierre el solucionador de problemas e intente abrir un archivo de imagen. Si el error persiste, continúe con el siguiente paso. </p> <p><img src=\"images/image_thumb-75-371.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Paso 2. Repare o restablezca la aplicación Fotos. </h6> <p> Si recibe el mensaje &quot;2147219196&quot;, cuando intenta abrir un archivo .JPG o .PNG con la aplicación Fotos, intente reparar la aplicación. Para hacer eso: </p> <p> 1. Navega a <strong> Comienzo </strong> -&gt; <strong> Ajustes </strong> -&gt; <strong> Aplicaciones. <br> </strong> 2. En <strong> Aplicación y características, </strong> localizar y seleccionar el <strong> Fotos de Microsoft </strong> y haga clic en <strong> Opciones avanzadas. </strong></p> <p><img src=\"images/image_thumb-76-358.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. En Opciones avanzadas, haga clic en el <strong> Reparar </strong> botón. <br> 4. Cuando se complete el proceso, verá una marca de verificación <img src=\"images/image_thumb-77-553.png\" alt=\"image\" loading=\"lazy\"> junto al botón &#39;Reparar&#39;. Continúe y compruebe si el &quot;Error del sistema de archivos 2147219196&quot; se ha resuelto abriendo una foto. <br> 5. Si el problema persiste, haga clic en el <strong> Reiniciar </strong> para restablecer la configuración de la aplicación Fotos. </p> <p><img src=\"images/image_thumb-78-665.png\" alt=\"repair - reset photos app\" loading=\"lazy\"></p> <p> </p> <h6> Paso 3. Quite y reinstale completamente la aplicación Fotos. </h6> <p> El siguiente paso para corregir el &quot;Error del sistema de archivos&quot; -2147219196 &quot;en la aplicación Fotos es completar la eliminación de su sistema y volver a instalar la aplicación Fotos. Para ello: </p> <p> 1. Abrir <strong> Potencia Shell </strong> como <strong> Administrador </strong> . <br> 2. En PowerShell, dé el siguiente comando y presione <strong> Ingresar </strong> , para eliminar completamente la aplicación Fotos: * </p> <ul> <li><strong> Get-AppxPackage * fotos * | Remove-AppxPackage -allusers </strong></li> </ul> <p> * Información: El comando anterior desinstalará la aplicación Fotos de Windows 10 y también eliminará los archivos de instalación y los restos de la aplicación Fotos, del directorio &quot;C: \\ Archivos de programa \\ WindowsApps \\&quot;. </p> <p><img src=\"images/image_thumb-95-600.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Cuando se completa el comando, <strong> Reanudar </strong> tu computadora. <br> 4. Abra Microsoft Store e instale <a href=\"https://www.microsoft.com/en-us/p/microsoft-photos/9wzdncrfjbh4#activetab=pivot:overviewtab\" target=\"_blank\" rel=\"nofollow noopener\"> Fotos de Microsoft </a> . </p> <p><img src=\"images/image_thumb-89-238.png\" alt=\"reinstall photos app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Haga clic en <strong> Instalar en pc, </strong> para reinstalar la aplicación Fotos en su sistema. </p> <p><img src=\"images/image_thumb-90-948.png\" alt=\"install photos app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Cuando esté instalada la aplicación Fotos, abra una imagen. El error &quot;Error del sistema de archivos 2147219196&quot; debería haberse resuelto. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}