{"title":"REVISIÓN: Pantalla negra de la cámara de Skype y otros problemas de la cámara web en Windows 10.","content":"<p> El problema de la pantalla negra / en blanco de la cámara de Skype es uno de los problemas más comunes en Windows 10 y puede deberse a varias razones, por lo que aquí hay una guía paso a paso sobre cómo solucionarlo. </p> <p> En Windows 10, una nueva actualización puede causar muchos problemas con su cámara web integrada, y es posible que la cámara no funcione o que la cámara no sea reconocida en algunas aplicaciones mientras funciona correctamente en otras. Por ejemplo, he visto un caso en el que mientras la cámara funcionaba sin ningún problema en las aplicaciones Webex y Zoom, mostraba una pantalla negra en Skype. </p> <p> Esta guía contiene instrucciones paso a paso para solucionar varios problemas con la cámara integrada en computadoras portátiles con Windows 10: * </p> <ul> <li><em> La cámara web / cámara no funciona en Windows 10 </em></li> <li><em><em> Webcam / Cámara </em> Dejó de funcionar después de la actualización en Windows 10. </em></li> <li><em> La cámara web no funciona en algunas aplicaciones (Skype, Windows Hello WebEx, etc.). </em></li> <li><em> La cámara web muestra una pantalla negra (o en blanco) cuando se usa en Skype. </em></li> <li><em> La cámara web funciona en Skype pero muestra una pantalla negra en la ventana de vista previa de la cámara </em> . </li> <li> Las aplicaciones no pueden reconocer o encontrar la cámara / cámara web </li> </ul> <p><strong> * Aviso para los propietarios de Lenovo ThinkPad: </strong> Si posee uno de los modelos ThinkPad enumerados en la siguiente tabla, proceda a descargar e instalar este <a href=\"/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/DC8297800EA7/Integrated%20Camera%20Driver%20Registry%20Patch%20for%20Windows%2010%20(Version%201709%20or%20later)%20-%20ThinkPad\" target=\"_blank\" rel=\"nofollow noopener\"> parche de registro de Lenovo. </a> El parche soluciona un problema por el cual el controlador de cámara integrado podría no funcionar correctamente después de actualizar a Windows 10 versión 1709 o posterior. </p> <p><img src=\"images/image_thumb-30-725.png\" alt=\"THinkpad Registry Fix for Integrated Camera\" loading=\"lazy\"></p> <h2> Cómo SOLUCIONAR: Problemas con la cámara web en Windows 10. </h2> <p> </p> <h3> Paso 1. Permita el acceso de la cámara a las aplicaciones. </h3> <p> En Windows 10, es posible que la cámara y el micrófono no estén disponibles para las aplicaciones debido a la configuración de privacidad que se haya aplicado. Entonces, proceda y permita que la aplicación con el problema de la cámara acceda a su cámara. Por ejemplo, si se enfrenta al problema de la cámara en Skype, proceda de la siguiente manera: </p> <p> 1. Navega para ir a <strong> Comienzo </strong> menú <img src=\"images/image_thumb-12-696.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Ajustes </strong> -&gt; <strong> Intimidad </strong> . <br> 2. Seleccione <strong> Cámara </strong> en el panel izquierdo y en el derecho: </p> <blockquote><p> una. Asegurarse de que <strong> Acceso a la cámara para este dispositivo </strong> es <strong> en. </strong> Si no, haga clic en <strong> Cambio </strong> y establecer en <strong> EN. </strong><br> B. Luego configúrelo en <strong> En </strong> la <strong> Permitir que las aplicaciones accedan al interruptor de su cámara </strong> . </p> <p><img src=\"images/image_thumb-20-105.png\" alt=\"Allow Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Ahora, desplácese hacia abajo y ... </p> <p> C. Si experimenta el problema de la pantalla negra de la cámara en <strong> Skype </strong> tienda de aplicaciones, desplácese hacia abajo y en <strong> Elija qué aplicaciones de Microsoft Store pueden acceder a su cámara </strong> sección, establecer <strong> Skype </strong> a <strong> En. </strong></p> <p><img src=\"images/image_thumb-21-826.png\" alt=\"Allow Store Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> D. Si ve una ventana de pantalla negra de su cámara mientras usa el <strong> Skype para Windows </strong> (aplicación de escritorio), luego asegúrese de que el <strong> Permitir que las aplicaciones de escritorio accedan a su cámara </strong> interruptor es <strong> En </strong> . </p> <p><img src=\"images/image_thumb-22-558.png\" alt=\"Allow Applications to Access Camera Windows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h3> Paso 2. Compruebe si su cámara funciona correctamente. </h3> <p> Uno de los primeros pasos para solucionar problemas de su cámara web es confirmar que funciona en la aplicación Cámara de Windows 10. </p> <p> 1. En el cuadro de búsqueda, escriba <strong> cámara </strong> para abrir la aplicación Cámara. <br> 2. Haga clic en la lupa y busque &quot; <strong> cámara </strong> &quot;. <br> 3. Abra el <strong> Cámara </strong> solicitud </p> <p><img src=\"images/image_thumb-23-730.png\" alt=\"Open Camera app Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Ahora, según el resultado, proceda de la siguiente manera: </p> <blockquote><p> R. Si su cámara está funcionando, debería ver su imagen en la pantalla. En este caso, proceda y compruebe su cámara en Skype o en cualquier otra aplicación que utilice. Si la cámara web no funciona o muestra una pantalla en negro, aplique los pasos a continuación en orden: </p> <ol> <li> Intentar <strong> desinstalar </strong> y <strong> reinstalar </strong> la aplicación con el problema de la cámara (por ejemplo, Skype). </li> <li> Proceda a habilitar o deshabilitar el modo de servidor de marcos en el registro siguiendo las instrucciones en <a href=\"#step-3\" target=\"_blank\" rel=\"nofollow noopener\"> paso 3 </a> . </li> </ol> <p> B. Si su cámara tampoco funciona en la aplicación Cámara, puede suceder una de las siguientes cosas: </p> <ol> <li> El controlador del dispositivo de la cámara es incorrecto o está dañado. En este caso, proceda a solucionar los problemas de los controladores de la cámara siguiendo las instrucciones en <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> paso 4 </a> . </li> <li> La cámara está dañada y no funciona en absoluto. En este caso, vaya a un taller de reparación de computadoras para reparar su cámara web o use una cámara USB externa. </li> </ol> </blockquote> <h3></h3> <h3> Paso 3. Solucione el problema de la pantalla negra de la cámara web en el registro de Windows 10. </h3> <p> Si la cámara es reconocida y funciona sin problemas en algunas aplicaciones, pero no funciona en otras, o muestra una pantalla negra en Skype, intente deshabilitar o habilitar el &quot;Modo de servidor de marcos&quot; en el registro. </p> <p> 1. Abra el Editor del Registro: para hacer eso: </p> <blockquote><p> 1. Presione Windows <img src=\"images/image_thumb41-284.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> regedit </strong> y presione <strong> Ingresar </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-845.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> 3. En el Editor del registro, navegue hasta la siguiente tecla en el panel izquierdo: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows Media Foundation \\ Platform </li> </ul> <p> 4. <strong> Botón derecho del ratón </strong> en un espacio vacío en el panel derecho y seleccione <strong> Nuevo -&gt; Valor DWORD (32 bits). </strong></p> <p><img src=\"images/image_thumb-24-839.png\" alt=\"Fix Webcam black Screen Windows 10\" loading=\"lazy\"></p> <p> 5. Dar el nombre <strong> EnableFrameServerMode </strong> al nuevo valor. <br> 6. Haga doble clic en el valor recién creado y asegúrese de que los datos del valor sean <strong>0</strong> . (Cero). Hacer clic <strong> está bien. </strong></p> <p><img src=\"images/image_thumb-25-764.png\" alt=\"Fix Webcam issues Windows 10\" loading=\"lazy\"></p> <p> 7. Ahora, siga los mismos pasos anteriores (4, 5 y 6) y realice los mismos cambios en esta tecla: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ WOW6432Node \\ Microsoft \\ Windows Media Foundation \\ Platform </li> </ul> <p> 8. Cuando termine, <strong> cerca </strong> Editor de registro y <strong> Reanudar </strong> tu computador. <br> 9. Después de reiniciar, inicie Skype y compruebe si se ha resuelto el problema con WebCam. Si no, siga los mismos pasos, pero esta vez <strong> permitir </strong> la <strong> EnableFrameServerMode </strong> cambiando su valor de <strong>0 </strong> a <strong> 1 </strong> y <strong> Reanudar </strong> su PC de nuevo. </p> <p> </p> <h3> Paso 4. Solucione los problemas del controlador de la cámara web. </h3> <p> El siguiente paso, para solucionar los problemas de la cámara en Windows 10, es retroceder o desinstalar / reinstalar los controladores de la cámara. 1. Abrir <strong> Administrador de dispositivos </strong> . Para hacer eso: </p> <blockquote><p> 1. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-696.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. En el cuadro &quot;Abrir&quot;, escriba: <strong> devmgmt.msc </strong> &amp; haga clic <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-5-837.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Expandir <strong> Imagine dispositivos </strong> (o <strong> Cámaras </strong> ) <br> 3. <strong> Botón derecho del ratón </strong> en tu <strong> Cámara </strong> y elige <strong> Propiedades. </strong></p> <p><img src=\"images/image_thumb-26-673.png\" alt=\"Camera Properties\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 4. Seleccione el <strong> Conductor </strong> pestaña y proceda de la siguiente manera según su caso: </p> <blockquote><p> A. Si su cámara web funcionaba antes, <strong> Controlador de retroceso </strong> y <strong> restar </strong> t su PC. Luego, verifique si su cámara está funcionando. </p> <p><img src=\"images/image_thumb-27-454.png\" alt=\"Roll Back Driver - Camera\" loading=\"lazy\"></p> <p> </p> <p> B. Si su cámara nunca ha funcionado antes, o si es la primera vez que prueba su cámara (por ejemplo, después de una nueva instalación de Windows), intente lo siguiente en este orden: </p> <ol> <li> Haga clic en el <strong> Actualizar controlador </strong> opción, para buscar un controlador actualizado de su cámara. Si Windows encuentra un nuevo controlador, instálelo y luego verifique su cámara web. De lo contrario… </li> <li> Hacer clic <strong> Desinstalar dispositivo </strong> para desinstalar la cámara web y luego <strong> Reanudar </strong> tu computador. Después de reiniciar, verifique si su cámara está funcionando. Si no… </li> <li> Navegue al sitio de soporte del fabricante de su computadora portátil y verifique si hay un nuevo controlador disponible para su cámara web e instálelo. </li> </ol> </blockquote> <h3> Ayuda adicional para solucionar problemas de la cámara en Windows 10. </h3> <p> Si aún tiene problemas con su cámara web después de los pasos anteriores, intente lo siguiente: </p> <ol> <li> <p> Instale todas las actualizaciones de Windows 10 disponibles ( <strong> Comienzo </strong> -&gt; <strong> Ajustes </strong> -&gt; <strong> Actualización y seguridad </strong> y haga clic en <strong> Busque actualizaciones). </strong></p> </li> <li> <p> Actualice Windows 10 a la última versión utilizando el <strong> Asistente de actualización. </strong> (Para hacer eso navega a este <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"noopener\"><strong> Enlace </strong></a> y haga clic en el <strong> Actualizar ahora </strong> botón). </p> </li> <li> <p><a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"noopener\"><strong> Actualizar Windows 10 </strong> . </a></p> </li> </ol> <p> ¡Eso es todo amigos! ¿Funcionó para ti? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}