{"title":"REVISIÓN: Unidades mostradas dos veces en el panel de navegación de Windows 10 (resuelto)","content":"<p> En este tutorial, obtendrá instrucciones para solucionar el siguiente problema extraño en Windows 10: Las unidades se muestran dos veces en el panel de navegación. La apariencia duplicada de las unidades en el panel de navegación es una nueva característica de Windows 10, que ayuda al usuario a explorar fácilmente el contenido de la unidad adjunta, sin tener que expandir el menú &quot;Esta PC&quot;, pero esta función se vuelve molesta, porque si usa para mantener abierto el menú &quot;Esta PC&quot;, la misma unidad se muestra dos veces en el panel de navegación. </p> <p><img src=\"images/image_thumb-22-749.png\" alt=\"Drives Displayed Twice in Navigation Pane of Windows 10\" loading=\"lazy\"></p> <p> Si ve entradas duplicadas de sus unidades USB conectadas o de las unidades fijas en Windows 10, siga las instrucciones a continuación para resolver el problema. </p> <h4> Cómo eliminar las letras de unidad duplicadas en el Explorador de Windows 10 (menú de navegación). </h4> <p> Para evitar que Windows 10, para mostrar dos veces una unidad fija o adjunta, aplique el siguiente ajuste de registro: </p> <p> 1. Abra el Editor del registro. Para hacer eso: </p> <blockquote><p> 1. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-493.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. En el cuadro de búsqueda, escriba <strong> regedit </strong> y presione <strong> Ingresar </strong> para iniciar el Editor del registro. </p></blockquote> <p><img src=\"images/image_thumb7-138.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Luego navegue hasta esta clave de registro: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows \\ CurrentVersion \\ Explorer \\ Desktop \\ NameSpace \\ DelegateFolders </li> </ul> <p> 3. Luego haga clic derecho y elimine el <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> clave. </p> <p><img src=\"images/image_thumb-23-428.png\" alt=\"remove duplicate drive entries windows 10 navigation pane\" loading=\"lazy\"></p> <p> </p> <p> 4. Luego navegue hasta esta tecla: * </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ WOW6432Node \\ Microsoft \\ Windows \\ CurrentVersion \\ Explorer \\ Desktop \\ NameSpace \\ DelegateFolders </li> </ul> <p> 5. Elimine el <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> clave. </p> <p> 6. Cierre el Editor del registro. </p> <p> * Nota: Si no puede ver la clave &quot;WOW6432Node&quot;, ignore los pasos 4 y 5 anteriores, ya que solo se aplican a las versiones de 64 bits de Windows 10. </p> <p><strong> INCLINAR: </strong> Si cambia su decisión en el futuro, simplemente haga clic derecho en &#39;DelegateFolders&#39; en las ubicaciones de registro anteriores, seleccione <strong> Nuevo </strong> -&gt; <strong> Clave </strong> y recrear el borrado <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> llaves). </p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}