{"title":"REVISIÓN: La ubicación no está disponible: el archivo o directorio está dañado e ilegible (resuelto)","content":"<p> Este tutorial contiene instrucciones para resolver el siguiente error, cuando intenta acceder a una unidad o carpeta en el sistema operativo Windows 10/8/7: &quot;La ubicación no está disponible. Unidad no accesible. El archivo o directorio está dañado y no se puede leer (0x80070570) &quot;. </p> <p><img src=\"images/image_thumb-21-253.png\" alt=\"FIX Locations is not available - File or Directory is Corrupted and Unreadable 0x80070570\" loading=\"lazy\"></p> <p> </p> <p> El error 0x80070570 &quot;El archivo o directorio está dañado y es ilegible&quot; generalmente ocurre si no ha desconectado correctamente la unidad USB previamente (sin usar la opción &quot;Eliminación de seguridad&quot;). En otros casos, aparece el error si la unidad está dañada. </p> <h4> Cómo REPARAR: Unidad no accesible: el archivo o directorio está dañado e ilegible (0x80070570). </h4> <p> </p> <h6> Método 1. Desconecte y vuelva a conectar la unidad. </h6> <p> Si recibe el error &quot;Unidad no accesible&quot;, cuando intente ver el contenido en una unidad USB, primero intente desconectar y volver a conectar la unidad USB o intente conectarla a otro puerto USB u otra computadora. </p> <p> </p> <h6> Método 2. Utilice Comprobar disco para reparar la unidad dañada. </h6> <p> El segundo método para resolver el error &quot;Unidad no accesible&quot; o &quot;Carpeta no accesible&quot; es intentar reparar la unidad dañada mediante el comando &quot;CHKDSK&quot;. </p> <p> 1. Abrir <strong> Símbolo del sistema como administrador </strong> . Para hacer eso: </p> <ul> <li> En <strong> Windows 7, Vista, XP </strong> : Navegar a <strong> Comienzo </strong> -&gt; <strong> Programas </strong> -&gt; <strong> Accesorios. </strong> Luego, haga clic derecho en <strong> Símbolo del sistema </strong> y seleccione <strong> Ejecutar como administrador. </strong></li> </ul> <p><img src=\"images/image_thumb16-914.png\" alt=\"command-prompt-admin-windows-7-vista\" loading=\"lazy\"></p> <ul> <li> En <strong> Windows 10, 8 </strong> : En el cuadro de búsqueda, escriba: <strong> símbolo del sistema </strong> o <strong> cmd. </strong> Luego haga clic derecho en <strong> Símbolo del sistema </strong> resultado y seleccione <strong> Ejecutar como administrador. </strong></li> </ul> <p><img src=\"images/image_thumb-10-340.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. En la ventana del símbolo del sistema, escriba el siguiente comando y presione <strong> Ingresar </strong> : * </p> <ul> <li><strong> chkdsk D: / F / R </strong></li> </ul> <p><strong> * Nota: </strong> En este ejemplo, la letra del controlador del disco dañado es la &quot;D&quot;. Reemplace la letra del controlador según su caso. </p> <p><img src=\"images/image_thumb-22-172.png\" alt=\"fix drive not accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. Tipo <strong> Y </strong> y presione <strong> Ingresar </strong> para desmontar el volumen (si se le pide) </p> <p><img src=\"images/image_thumb-23-496.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Espere hasta que el proceso Check Disk corrija la unidad dañada. </p> <p><img src=\"images/image_thumb-24-722.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Cuando la verificación del disco esté completa, intente explorar el contenido de la unidad. <br> 6. Si puede acceder a la unidad, copie todo su contenido en su computadora y luego diagnostique la unidad en busca de problemas, siguiendo las instrucciones de este tutorial: <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Las mejores herramientas de diagnóstico y prueba de disco duro para comprobar la salud del disco duro </a> . </p> <p> </p> <h6> Método 3. Utilice PhotoRec para recuperar sus archivos. </h6> <p> Si los métodos anteriores no funcionan, utilice el método gratuito <a href=\"http://www.cgsecurity.org/wiki/PhotoRec\" target=\"_blank\" rel=\"nofollow noopener\"> PhotoRec </a> Utilidad de recuperación, para recuperar los archivos perdidos de la unidad dañada. Para hacer eso: </p> <p><strong> Paso 1. Descargue Photorec. </strong></p> <p> </p> <p> 1. Navegue a: <a href=\"http://www.cgsecurity.org/wiki/TestDisk_Download\" target=\"_blank\" rel=\"nofollow noopener\"> http://www.cgsecurity.org/wiki/TestDisk_Download </a> página y haga clic en el <strong> &#39;TestDisk - Descarga gratuita&#39; </strong> botón, o haga clic en <a href=\"http://www.cgsecurity.org/Download_and_donate.php/testdisk-7.0.win.zip\" target=\"_blank\" rel=\"nofollow noopener\"> aquí </a> para descargar directamente TestDisk. </p> <p> 2. Extraiga el archivo &quot;testdisk-7.0.win.zip&quot;. </p> <p> </p> <p><strong> Paso 2. Recupere los archivos dañados con PhotoRec. </strong></p> <p> 1. Explore la carpeta &quot;testdisk-7.0&quot; y abra el <strong> qphotorec_win </strong> solicitud. </p> <p> </p> <p><img src=\"images/image_thumb-4-696.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Elija el disco del que desea recuperar sus datos. </p> <p><img src=\"images/image_thumb-7-484.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Luego elija todo el disco o la partición para recuperar archivos. * </p> <p><strong> * Nota: </strong> Si no quiere perderse nada, seleccione &quot; <strong> Sin partición &quot; </strong> . PhotoRec escaneará todo el disco. (El escaneo lleva más tiempo) </p> <p><img src=\"images/image_thumb-8-229.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Seleccione: <strong> Entero: extrae archivos de toda la partición, </strong> si desea recuperar datos dañados * </p> <p><strong> * Nota: </strong> Si desea recuperar archivos eliminados, seleccione: &quot; <em> Gratis: escanee en busca de archivos solo desde el espacio no asignado &quot; </em> . </p> <p><img src=\"images/image_thumb-9-232.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Luego elija un destino en su disco * para guardar los archivos recuperados. </p> <p><strong> * Nota: </strong> Nunca guarde los archivos recuperados en el disco dañado. </p> <p><img src=\"images/image_thumb-10-286.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. (Opcional) Haga clic en el <strong> Formatos de archivo </strong> y elija qué tipo de archivos desea recuperar. (por ejemplo, &quot;jpg - Imagen JPG&quot;). </p> <p><img src=\"images/image_thumb-11-487.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Finalmente presione el <strong> Buscar </strong> botón. </p> <p><img src=\"images/image_thumb-12-520.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. Cuando se complete el proceso de escaneo y recuperación, navegue hasta la carpeta que seleccionó (antes) para ver los archivos recuperados. </p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}