{"title":"REVISIÓN: El panel táctil no funciona o se congela en Windows 10 (resuelto)","content":"<p> En los últimos años, he solucionado muchos problemas del panel táctil en Windows 10 en varias computadoras portátiles (por ejemplo, el panel táctil no funciona, el panel táctil se congela, etc.), por lo que decidí escribir un tutorial para solucionar estos problemas. </p> <p> Si posee una computadora portátil, es posible que de vez en cuando tenga problemas con el dispositivo de panel táctil. Especialmente si tiene Windows 10, el panel táctil a menudo puede dejar de funcionar o no funcionar correctamente después de instalar una actualización. Por supuesto, los problemas del panel táctil pueden indicar un problema de hardware, pero en muchos casos el mal funcionamiento del panel táctil se debe a problemas de software. </p> <p> En Windows 10, es posible que el panel táctil de la computadora portátil no funcione por varias razones, por lo que este tutorial cubrirá todos los métodos para resolver el problema. </p> <h2> Cómo SOLUCIONAR problemas con el panel táctil en Windows 10. </h2> <p> Siga estos pasos antes de continuar con los siguientes métodos para abordar los problemas de la pantalla táctil. </p> <ol> <li> Asegúrese de que Windows 10 no esté congelado, presionando ALT + CTRL + SUPR y vea si se abre el Administrador de tareas. </li> <li> Si su computadora portátil tiene una combinación de teclas de función para deshabilitar y habilitar el panel táctil. (por ejemplo, Fn + F3), luego presione la combinación de teclas Fn para encender el panel táctil. (En algunas computadoras portátiles, el panel táctil se puede encender / apagar tocando dos veces la superficie del panel táctil) </li> <li> Reinicia tu computadora. </li> <li> Realice un apagado completo de Windows 10 y luego encienda su computadora portátil nuevamente. (Para realizar un apagado completo: presione y mantenga presionado el <strong> CAMBIAR </strong> clave y luego haga clic en <strong> Comienzo </strong> &gt; <strong> Energía </strong> &gt; <strong> Cerrar </strong> ). </li> </ol> <p><strong> </strong></p> <h3> Método 1. Habilite el panel táctil en Windows 10. </h3> <p> Windows 10 tiene la capacidad de deshabilitar o apagar el panel táctil cuando se conecta un mouse externo. Por lo tanto, proceda y asegúrese de que el panel táctil esté habilitado en la configuración del panel táctil. </p> <p> 1. Navega a <strong> Comienzo </strong><img src=\"images/image_thumb2_thumb_thumb-670.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menú -&gt; <strong> Ajustes </strong> <img src=\"images/image_thumb-66-512.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Dispositivos. <br> </strong> 2. Seleccione <strong> Panel táctil </strong> en el panel izquierdo y en el derecho, asegúrese de que el interruptor del panel táctil esté <strong> EN </strong> y también <strong> cheque </strong> la <strong> Deje el panel táctil encendido cuando se conecte un mouse </strong> opción. * </p> <p><img src=\"images/image_thumb-38-467.png\" alt=\"Disable Touchpad Windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Nota: Si no puede encontrar aquí el interruptor / palanca del panel táctil ... </p> <p> 1. Abrir <strong> Ajustes adicionales </strong> bajo la <strong> Configuraciones relacionadas </strong> sección. </p> <ul> <li> Artículo relacionado: <a href=\"https://www.repairwin.com/disable-touchpad-option-missing-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Desactive la opción de panel táctil que falta en Windows 10. </strong></a></li> </ul> <p><img src=\"images/image_thumb-39-742.png\" alt=\"touchpad additional settings\" loading=\"lazy\"></p> <p> 2. Habilite el panel táctil en las opciones de Propiedades del mouse. (Si el panel táctil ya está habilitado, intente inhabilitarlo y habilitarlo nuevamente). </p> <p><img src=\"images/image_thumb-31-122.png\" alt=\"enable touchpad windows 10\" loading=\"lazy\"></p> <h3> Método 2. Restablezca la configuración del panel táctil en Windows 10. </h3> <p> Un método común para resolver los problemas del panel táctil en Windows 10 es restablecer la configuración del panel táctil a su valor predeterminado. </p> <p> 1. Navega a <strong> Comienzo </strong><img src=\"images/image_thumb2_thumb_thumb-596.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menú -&gt; <strong> Ajustes </strong> <img src=\"images/image_thumb-66-851.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Dispositivos. <br> </strong> 2. En <strong> Panel táctil </strong> opciones <strong> , </strong> desplácese hacia abajo y haga clic <strong> Reiniciar </strong> debajo <strong> Reinicia tu panel táctil. * </strong></p> <p><img src=\"images/image_thumb-40-277.png\" alt=\"reset touchpad windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Nota: Si no puede ver el <strong> Reiniciar </strong> botón… </p> <p> 1. Abra el <strong> Ajustes adicionales </strong> . <br> 2. Haga clic en <strong> Restablecer dispositivos </strong> en las opciones de Propiedades del mouse. </p> <p><img src=\"images/image_thumb-33-928.png\" alt=\"reset touchpad settings windows 10\" loading=\"lazy\"></p> <h3> Método 3. Desinstale y vuelva a instalar el controlador del dispositivo Touchpad. </h3> <p> Otra solución para solucionar los problemas del panel táctil en Windows 10 es desinstalar y reinstalar completamente los controladores del panel táctil. </p> <p> 1. Abrir <strong> Administrador de dispositivos </strong> . Para hacer eso: </p> <blockquote><p> 1. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-140.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. En el cuadro &quot;Abrir&quot;, escriba: <strong> devmgmt.msc </strong> &amp; haga clic <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-5-568.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Expanda los ratones y otros dispositivos señaladores. <br> 3. <strong> Botón derecho del ratón </strong> sobre el <strong> TouchPad </strong> dispositivo y haga clic en <strong> Desinstalar </strong></p> <blockquote> <p><img src=\"images/image_thumb-34-656.png\" alt=\"uninstall touchpad windows 10\" loading=\"lazy\"></p> </blockquote> <p> 4. Después de reiniciar, espere de 4 a 5 minutos para que Windows reinstale el controlador del panel táctil y compruebe si funciona. Si su panel táctil no funciona nuevamente, intente instalar su controlador desde el sitio de soporte del fabricante de su computadora portátil. </p> <h3> Método 4. Deshabilite y habilite el panel táctil en BIOS. * </h3> <p> * Nota: Este método no se aplica a todos los modelos de portátiles, pero sé que funciona en muchos portátiles ASUS. </p> <p> 1. Apague completamente su computadora portátil presionando y manteniendo presionada la tecla MAYÚS mientras hace clic en <strong> Comienzo </strong> &gt; <strong> Energía </strong> &gt; <strong> Cerrar </strong><br> 2. Encienda la computadora portátil y presione la tecla de función correspondiente para ingresar a la configuración del BIOS. (por ejemplo, F2, F10, etc.), <br> 3. En la configuración del BIOS, compruebe si hay una configuración para el panel táctil o el dispositivo señalador interno o el dispositivo trackpad (normalmente, esta configuración se puede encontrar en <strong> Avanzado </strong> &#39; sección). Si es así, <strong> Desactivar </strong> la <strong> dispositivo touchpad </strong> y <strong> Guardar y Salir </strong> desde la configuración del BIOS. <br> 4. Deje que Windows 10 se cargue. <br> 5. Apague y vuelva a encender su computadora portátil. <br> 6. Vuelva a ingresar en la configuración del BIOS y vuelva a <strong> habilitar el panel táctil </strong> Y <strong> Guardar la salida </strong> . <br> 7. Después de iniciar Windows 10, el panel táctil debería funcionar. </p> <p><strong> Conclusión: </strong> Si, después de los pasos anteriores, su panel táctil aún no funciona, esto indica un problema de hardware. En este caso, use un mouse externo o vaya a un taller de reparación de computadoras portátiles para reparar el dispositivo de panel táctil. </p> <p> ¡Eso es todo amigos! Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}