{"title":"REVISIÓN: Conexión a escritorio remoto de Mac OS no puede verificar la identidad de la computadora a la que desea conectarse. (Resuelto)","content":"<p> En este tutorial encontrará instrucciones para resolver el problema &quot;La conexión a Escritorio remoto no puede verificar la identidad de la computadora a la que desea conectarse. Intente volver a conectarse a la computadora con Windows o comuníquese con nuestro administrador&quot;, cuando intente conectarse a través de RDP desde una computadora con sistema operativo Mac a un servidor Windows RDSH 2016. </p> <p><img src=\"images/image_thumb-32-846.png\" alt=\"FIX: MAC OS Remote Desktop Connection cannot verify the identity of the computer that you want to connect to.\" loading=\"lazy\"></p> <p> </p> <h4> Cómo CORREGIR: La conexión de escritorio remoto de MacOSX no puede verificar la identidad de la computadora a la que desea conectarse. </h4> <h6> Método 1. Descargue el último cliente RDP de MAC App Store. </h6> <p> 1. Descargue e instale la última <a href=\"https://itunes.apple.com/us/app/microsoft-remote-desktop/id715768417?mt=12&ign-mpt=uo%3D4\" target=\"_blank\" rel=\"nofollow noopener\"> Cliente de escritorio remoto de Microsoft </a> en tu MAC. (Si está utilizando un dispositivo IOS, descargue el cliente RDP de <a href=\"https://itunes.apple.com/us/app/microsoft-remote-desktop/id714464092?mt=8&ign-mpt=uo%3D4\" target=\"_blank\" rel=\"nofollow noopener\"> aquí </a> .) <br> 2. Después de la instalación, intente conectarse nuevamente al servidor RDP de Windows. Si el problema persiste, continúe con el método 2 a continuación. </p> <p> </p> <h6> Método 2. Modifique la configuración de la directiva de grupo en el servidor RDSH de Windows. </h6> <p> En el servidor host de sesión de escritorio remoto (RDSH) 2016, modifique la política de grupo de la siguiente manera: </p> <p> 1. Presione simultáneamente las ventanas <img src=\"images/image_thumb36-211.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. Tipo <strong> gpedit.msc </strong> &amp; Prensa <strong> Ingresar. </strong></p> <p><img src=\"images/image_thumb-78-784.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. En el panel izquierdo, navegue hasta: </p> <ul> <li><strong> Configuracion de Computadora </strong> &gt; <strong> Plantillas Administrativas </strong> &gt; <strong> Componentes de Windows </strong> &gt; <strong> Servicios de escritorio remoto </strong> &gt; <strong> Host de sesión de escritorio remoto </strong> &gt; <strong> Seguridad </strong></li> </ul> <p> 4. En el panel derecho, abra el <strong> Requerir el uso de una capa de seguridad específica para conexiones remotas (RDP) </strong> configuración. </p> <p><img src=\"images/image_thumb-36-865.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4a. Cheque <strong> Activado </strong> , establezca la &#39;Capa de seguridad&#39; en <strong> RDP </strong> y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-37-183.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Ahora, abra el <strong> Requerir autenticación de usuario para conexiones remotas mediante autenticación de nivel de red </strong> ajuste, configúrelo en <strong> Discapacitado </strong> y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-38-109.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Cerca </strong> el Editor de políticas de grupo. <br> 7. <strong> Reanudar </strong> la computadora para aplicar cambios o abrir un símbolo del sistema elevado y dar el siguiente comando: </p> <ul> <li><strong> gpupdate / force </strong></li> </ul> <p> ¡Eso es! ¿Qué método te funcionó? <br> Déjame saber si esta guía te ha ayudado dejando tu comentario sobre tu experiencia. Por favor, haga clic en Me gusta y comparta esta guía para ayudar a otros. </p>"}