{"title":"REVISIÓN: VeraCrypt no responde (congelación) al desmontar en Windows 10 (resuelto)","content":"<p> Esta guía contiene instrucciones para solucionar el siguiente problema con VeraCrypt en una computadora con Windows 10: VeraCrypt no responde y se bloquea (cuelga) al desmontar el volumen cifrado. </p> <p> VeraCrypt no responde (congelación) problema en detalles: cuando intentas desmontar un volumen (con todos los archivos cerrados del volumen montado), VeraCrypt se cuelga y muestra &quot;No responde&quot;. Cuando aparece este problema, la única forma de restaurar Windows a un estado normal es finalizar el proceso de VeraCrypt desde el Administrador de tareas. </p> <p> Según <a href=\"https://www.veracrypt.fr/en/Issues%20and%20Limitations.html\" target=\"_blank\" rel=\"nofollow noopener\"> VeraCrypt </a> El problema de congelación se debe a un conflicto entre el cuadro de diálogo de espera de VeraCrypt que se muestra durante las operaciones de montaje / desmontaje y otro software instalado en la máquina (por ejemplo, Antivirus o Firewall). </p> <h4> Cómo solucionarlo: VeraCrypt no responde al desmontar / montar el volumen. </h4> <p> Este problema se debe a un conflicto entre el diálogo de espera de VeraCrypt que se muestra durante las operaciones de montaje / desmontaje y otro software instalado en la máquina (por ejemplo, Outpost Firewall Pro). </p> <p> 1. De VeraCrypt&#39;s <strong> Ajustes </strong> menú, seleccione <strong> Preferencias </strong> . </p> <p><img src=\"images/image_thumb-63-122.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Cheque </strong> la <strong> No mostrar el cuadro de diálogo de mensaje de espera al realizar operaciones </strong> hacer clic en la opción <strong> está bien. </strong></p> <p><img src=\"images/image_thumb-64-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. ¡Ahora proceda a montar / desmontar volúmenes sin congelar! </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}