{"title":"REVISIÓN: Micrófono no detectado o no funciona en Windows 10 (resuelto)","content":"<p> Esta guía contiene instrucciones para solucionar los problemas de &quot;micrófono no detectado&quot; o &quot;micrófono no funciona&quot; en Windows 10. Si tiene problemas con su micrófono en Windows 10, esto puede deberse a varias razones. El problema de &quot;micrófono no funciona&quot; es un problema para muchos usuarios de Windows 10 y generalmente aparece después de una actualización de Windows. </p> <p> Este tutorial contiene varias soluciones para resolver problemas de micrófonos en Windows 10. </p> <h4> Cómo REPARAR: El micrófono de Windows 10 no funciona o no se detecta. * </h4> <p> * Nota: Si tiene problemas con su micrófono, en una aplicación en particular, intente lo siguiente: </p> <blockquote><p> 1. Asegúrese de que la aplicación en particular pueda usar el micrófono, siguiendo las instrucciones del método 1 a continuación. <br> 2. Asegúrese de que el micrófono esté seleccionado como dispositivo de entrada predeterminado en la configuración de la aplicación. (por ejemplo, en Skype, vaya a <strong> Ajustes </strong> y asegúrese de que su micrófono o auricular esté seleccionado). <br> 3. Cierre cualquier otra aplicación que pueda usar su micrófono. <br> 4. Reinicie su PC y pruebe su MIC nuevamente. </p></blockquote> <h6> Solución 1. Permita que las aplicaciones accedan a su micrófono. </h6> <p> El primer método, para resolver problemas con su micrófono en Windows 10, es asegurarse de que todas las aplicaciones tengan acceso a su micrófono. Para hacer eso: </p> <p> 1.. Desde el menú Inicio <img src=\"images/image_thumb2_thumb_thumb-856.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> hacer clic <strong> Ajustes </strong><img src=\"images/image_thumb-66-804.png\" alt=\"image\" loading=\"lazy\"> y luego abrir <strong> Intimidad </strong> . <br> 2. Seleccione <strong> Micrófono </strong> en el panel izquierdo y luego <strong> Encender </strong> la <strong> Permita que las aplicaciones accedan a su micrófono. </strong></p> <p><img src=\"images/image_thumb-34-268.png\" alt=\"How to FIX: Windows 10 Microphone Not Detected or Not Working\" loading=\"lazy\"></p> <p> 3. Luego, desplácese hacia abajo y asegúrese de que la aplicación que desea usar con su micrófono pueda acceder a ella. * </p> <p> * Sugerencia: para su privacidad, desactive el acceso al micrófono en cualquier aplicación que no desee que use su micrófono. </p> <p><img src=\"images/image_thumb-35-517.png\" alt=\" FIX Windows 10 Microphone Not Working\" loading=\"lazy\"></p> <p> 4. Cuando termine, pruebe su micrófono. </p> <h6> Solución 2. Compruebe si su micrófono es el dispositivo de entrada predeterminado (dispositivo de grabación). </h6> <p> 1.. Desde el menú Inicio <img src=\"images/image_thumb2_thumb_thumb-930.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> hacer clic <strong> Ajustes </strong><img src=\"images/image_thumb-66-142.png\" alt=\"image\" loading=\"lazy\"> y luego abrir <strong> Sistema </strong> . <br> 2. Haga clic en <strong> Sonar </strong> en el panel izquierdo y luego hable para probar su micrófono. Si su micrófono está funcionando, debería ver la barra deslizante moviéndose debajo. Si no es así, haga clic en <strong> Gestionar dispositivos de sonido. </strong></p> <p><img src=\"images/image_thumb-36-254.png\" alt=\"Test Microphone Windows 10\" loading=\"lazy\"></p> <p> 3. En &#39;Administrar opciones de dispositivos de sonido, asegúrese de que su micrófono esté en la lista&#39; Dispositivos de entrada &#39;como el dispositivo de entrada predeterminado, y su <strong> Activado </strong> . Si no es así, haga clic en su micrófono y haga clic en <strong> Permitir. </strong></p> <p><img src=\"images/image_thumb-37-753.png\" alt=\"Enable Microphone Windows 10\" loading=\"lazy\"></p> <h6> Solución 3. Compruebe la configuración del micrófono en el Panel de control. </h6> <p> 1. Navega a Windows <strong> Panel de control </strong> y abrir <strong> Sonar. </strong></p> <p><img src=\"images/image_thumb-14-511.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. En el <strong> Grabación </strong> pestaña, seleccione su micrófono y haga clic en <strong> Propiedades. </strong></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"Microphone Properties\" loading=\"lazy\"></p> <p> 3. En el <strong> Nivel </strong> pestaña, <strong> arrastrar </strong> el control deslizante al <strong> derecho </strong> , para aumentar el volumen del micrófono y asegurarse de que no esté silenciado (en caso de que su micrófono esté silenciado, su icono de volumen <img src=\"images/image_thumb-39-434.png\" alt=\"image\" loading=\"lazy\"> , se mostrará con un símbolo rojo <img src=\"images/image_thumb-40-819.png\" alt=\"image\" loading=\"lazy\"> ). Cuando termine, haga clic en <strong> OK </strong> y <strong> OK </strong> para cerrar las Propiedades de sonido. </p> <p><img src=\"images/image_thumb-41-896.png\" alt=\"Microphone Levels\" loading=\"lazy\"></p> <h6> Solución 4. Cambie el controlador de la tarjeta de sonido. </h6> <p> El método final para resolver los problemas del micrófono en Windows 10 es cambiar el controlador de sonido, especialmente si posee un dispositivo de audio Realtek. Para hacer eso: </p> <p> 1. Abrir <strong> Administrador de dispositivos </strong> . Para hacer eso: </p> <blockquote><p> 1. Presione Windows <img src=\"images/image_thumb8_thumb_thumb-918.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> 2. En el cuadro &quot;Abrir&quot;, escriba: <strong> devmgmt.msc </strong> &amp; haga clic <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-5-732.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Expandir </strong> la <strong> Controladores de sonido, video y juegos. </strong></p> <p> 3. <strong> Botón derecho del ratón </strong> sobre el <strong> Realtek High Definition Audio </strong> dispositivo y seleccione <strong> Actualizar controlador. <br> </strong></p> <p><img src=\"images/image_thumb-6-629.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Seleccione <strong> Busque controladores en mi computadora. </strong></p> <p><img src=\"images/image_thumb-7-637.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Seleccione <strong> Permítame elegir de una lista de controladores disponibles en mi computadora </strong> . </p> <p><img src=\"images/image_thumb-8-118.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. En la siguiente pantalla, seleccione el <strong> Dispositivo de audio de alta definición </strong> y haga clic en <strong> Próximo. </strong></p> <p><img src=\"images/image_thumb-20-989.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p> 8. En la ventana &#39;Advertencia de actualización del controlador&#39;, haga clic en &quot;Sí&quot; para instalar el nuevo controlador. <br> 9. Cuando se complete la instalación del controlador, <strong> Reanudar </strong> tu computadora. <br> 10. Después de reiniciar, proceda y pruebe su micrófono. </p> <h6></h6> <h6> Solución 5. Desinstale y vuelva a instalar los controladores de la tarjeta de sonido. </h6> <p> La solución final para solucionar el problema del micrófono que no funciona, en Windows 10 es desinstalar y reinstalar completamente los controladores de la tarjeta de sonido. </p> <p> 1. Navega a <strong> Panel de control </strong> &gt; <strong> Programa y características </strong> y <strong> desinstalar </strong> cualquier software relacionado con su tarjeta de sonido. <br> 2. Abrir <strong> Administrador de dispositivos </strong> y <strong> expandir </strong> la <strong> Controladores de sonido, video y juegos. <br> </strong> 3. <strong> Botón derecho del ratón </strong> en el instalado <strong> Dispositivo de audio </strong> y haga clic en <strong> Desinstalar dispositivo. </strong></p> <p><img src=\"images/image_thumb-42-701.png\" alt=\"Uninstall Sound Card Device\" loading=\"lazy\"></p> <p> </p> <p> 4. Cuando haya terminado, vaya al sitio de asistencia del fabricante de su computadora o computadora portátil y descargue e instale el controlador más reciente para su tarjeta de sonido. <br> 5. Después de la instalación, <strong> Reanudar </strong> su pc y verifique si su micrófono está funcionando. </p> <p><strong> Ayuda adicional: </strong> Si después de aplicar las soluciones anteriores, su micrófono aún no funciona, probablemente esté dañado. Para asegurarse, si posee una computadora portátil, conecte un micrófono externo, o use otro micrófono si posee una computadora de escritorio. </p> <p> ¡Eso es todo amigos! ¿Qué método te funcionó? Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}