{"title":"REVISIÓN: Problema de fondo de pantalla en Windows 7 (resuelto)","content":"<p> Este tutorial contiene instrucciones para solucionar el problema del papel tapiz negro cuando la imagen de fondo está configurada en &quot;Estirar&quot; en el sistema operativo Windows 7. El problema del papel tapiz negro puede aparecer en computadoras con Windows 7 después de instalar la actualización KB4534310 del 14 de enero de 2020. </p> <p><img src=\"images/image_thumb-16-423.png\" alt=\"FIX: Back Wallpaper issue in Windows 7\" loading=\"lazy\"></p> <p> El problema del fondo negro de Windows 7 es un error conocido después de instalar el <a href=\"http://www.catalog.update.microsoft.com/Search.aspx?q=KB4534310\" target=\"_blank\" rel=\"nofollow noopener\"> actualización KB4534310 </a> y como Microsoft <a href=\"https://support.microsoft.com/en-us/help/4534310/windows-7-update-kb4534310\" target=\"_blank\" rel=\"nofollow noopener\"> dice </a> : &quot;Estamos trabajando en una resolución y proporcionaremos una actualización en una próxima versión, que se lanzará a todos los clientes que ejecutan Windows 7 y Windows Server 2008 R2 SP1&quot;. </p> <p> Si desea resolver el problema del &quot;papel tapiz negro&quot;, hasta que Microsoft publique una actualización para solucionarlo, siga las instrucciones a continuación. </p> <h4> Cómo SOLUCIONAR el problema del papel tapiz negro en Windows 7. </h4> <h6> Método 1. Desinstale la actualización KB4534310. </h6> <p> El primer método para solucionar los problemas del papel tapiz negro en Windows 7 es eliminar la actualización KB4534310. * </p> <p> * Nota: Dado que la actualización KB4534310 incluye mejoras y correcciones de seguridad para Windows 7, no es recomendable desinstalarla. Por lo tanto, sugerimos solucionar el problema siguiendo las instrucciones en <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Método 2 </a> debajo. </p> <p> Para desinstalar la actualización KB4534310: </p> <p> 1. Haga clic con el botón derecho en el <strong> Comienzo </strong> menú <img src=\"images/image_thumb-38-451.png\" alt=\"image\" loading=\"lazy\"> y elige <strong> Panel de control </strong> . <br> 2. Configure el <strong> Ver por: a Iconos pequeños </strong> y haga clic en <strong> Programa y características. </strong></p> <p><img src=\"images/image_thumb-51-750.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 3. Haga clic en <strong> Ver actualizaciones instaladas </strong> en el panel izquierdo. </p> <p> </p> <p><img src=\"images/image_thumb-52-942.png\" alt=\"uninstall updates windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. En el cuadro de búsqueda, escriba &quot; <strong> KB4534310 </strong> &quot;y presione Entrar. <br> 5. Resalte la &quot;Actualización de seguridad para Microsoft Windows (KB4534310)&quot; y haga clic en <strong> Desinstalar </strong> . </p> <p><img src=\"images/image_thumb-12-776.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Método 2. Cambie la posición de la imagen a otra que &quot;Estirar&quot;. </h6> <p> El problema del papel tapiz negro en Windows 7 aparece solo cuando la imagen de fondo seleccionada se estira. Entonces, el siguiente método para solucionar el problema es establecer otra posición de imagen para la imagen de fondo. Para hacer eso: </p> <p> 1. Haga clic derecho en su escritorio y haga clic en <strong> Personalizar </strong> . </p> <p><img src=\"images/image_thumb-17-501.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Haga clic en <strong> Fondo de escritorio </strong></p> <p><img src=\"images/image_thumb-14-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Ahora, aplique las siguientes acciones: </p> <p> una. En Ubicación de la imagen, seleccione <strong> Biblioteca de imágenes. </strong><br> B. Seleccione la imagen que desee para el fondo o cualquier otra imagen / foto personalizada que coincida con la resolución de su pantalla. * </p> <blockquote> <p> * Sugerencia: para conocer la resolución de pantalla actual, haga clic con el botón derecho en Escritorio y haga clic en <strong> Resolución de la pantalla </strong> . </p> </blockquote> <p> C. A <strong> Posición de la imagen </strong> , seleccione cualquier otra opción excepto &quot; <strong> Estirarse </strong> &quot;, como&quot; Rellenar &quot;,&quot; Encajar &quot;,&quot; Mosaico &quot;o&quot; Centro &quot;. <br> D. Cuando termine, haga clic en Guardar <strong> cambios </strong> . </p> <p><img src=\"images/image_thumb-15-519.png\" alt=\"image\" loading=\"lazy\"></p> <p> ¡Eso es todo! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}