{"title":"REVISIÓN: Error de DISM 1016 Se produjo un error al intentar acceder a la imagen (resuelto)","content":"<p> Este tutorial contiene instrucciones para resolver el siguiente error al ejecutar el comando DISM en Windows 10: &quot;Error 1016: se produjo un error al intentar acceder a la imagen&quot;. El error DISM 1016 puede aparecer cuando intenta reparar una imagen de Windows dañada mediante uno de los siguientes comandos DISM en el símbolo del sistema de Windows 10: </p> <ul> <li> Dism / Online / Cleanup-Image / Restorehealth </li> <li> Dism / Online / Cleanup-image / Restorehealth /source:wim:X:\\sources\\install.wim:1 / LimitAccess </li> </ul> <p> ... o al usar el comando DISM en el entorno de recuperación de Windows (WinRE) </p> <ul> <li> Dism.exe / Imagen: X: \\ / Cleanup-Image / Restorehealth </li> </ul> <p> </p> <h4> Cómo reparar el error DISM 1016: se produjo un error al intentar acceder a la imagen. </h4> <p><strong> Requisitos </strong> : Para solucionar los problemas mencionados en este artículo, siguiendo los métodos a continuación, deberá iniciar su computadora desde un medio de instalación de Windows (USB o DVD). Si no posee un medio de instalación de Windows, puede crear uno utilizando <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Herramienta de creación de medios de Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo crear un medio de instalación USB de Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo crear un medio de instalación de DVD de Windows 10. </a></li> </ul> <p> </p> <h6> Método 1. Restaure Windows 10 como estaba antes de instalar las actualizaciones. </h6> <p> El error DISM 1016, comúnmente aparece después de una instalación fallida de una actualización de Windows. Entonces, en primer lugar, cancele la instalación de las actualizaciones. Para hacer eso: </p> <p> 1. Inicie su sistema desde un medio de instalación de Windows. <br> 2. En la pantalla de abajo presione el <strong> CAMBIAR </strong> + <strong> F10 </strong> teclas para iniciar el símbolo del sistema. (o haga clic en <strong> próximo </strong> E ir a <strong> Reparar mi computadora </strong> &gt; <strong> Solucionar problemas </strong> &gt; <strong> Símbolo del sistema </strong> ). </p> <p><img src=\"images/image_thumb17_thumb-172.png\" alt=\"FIX DISM Error 1016: An error occurred while attempting to access the image\" loading=\"lazy\"></p> <p> </p> <p> 3. En el símbolo del sistema, obtenga una lista de todas las unidades en su sistema con este comando: </p> <ul> <li><strong> wmic logicaldisk obtener nombre </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-327.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> 4. A continuación, averigüe qué unidad contiene la carpeta &quot;Windows&quot; escribiendo este comando: * </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * p.ej. Para ver el contenido de la unidad C :, escriba: &quot; <strong> dir C: </strong> &quot;(sin comillas). Si no puede ver la carpeta&quot; Windows &quot;en la unidad C:, continúe con la siguiente letra de unidad (por ejemplo,&quot; dir D: &quot;,&quot; dir E: &quot;, etc.), hasta que vea la Carpeta &quot;Windows&quot; en una de las unidades enumeradas (del comando anterior). </p> <p> [Como puede ver en la captura de pantalla siguiente, la carpeta de Windows (en este caso) se encuentra en la unidad D:]. </p> <p> </p> <p><img src=\"images/image_thumb13_thumb-1-454.png\" alt=\"image_thumb[13]\" loading=\"lazy\"></p> <p> </p> <p> 5. Una vez que encuentre en qué unidad se encuentra la unidad &quot;Windows&quot; (por ejemplo, en la unidad &quot;D:&quot; en este ejemplo), navegue hasta esa unidad escribiendo DriveLetter <strong> : </strong> + <strong> Ingresar </strong> . </p> <p> 6. Luego, cree una carpeta temporal en la unidad escribiendo este comando: </p> <ul> <li><strong> mkdir D: \\ Scratch </strong></li> </ul> <p><img src=\"images/image_thumb7_thumb-1-575.png\" alt=\"image_thumb[7]\" loading=\"lazy\"></p> <p> </p> <p> 7. Luego dé el siguiente comando para revertir su sistema, después de la actualización fallida: </p> <ul> <li><strong> DISM / Imagen: D: \\ / ScratchDir: D: \\ Scratch / Cleanup-Image / RevertPendingActions </strong></li> </ul> <p> * Nota: cambie la letra de la unidad <strong> D </strong> según tu caso. </p> <p> 8. Una vez que se ejecuta el comando DISM anterior, debería recibir el siguiente mensaje en la pantalla: </p> <p><em> &quot;Revirtiendo las acciones pendientes de la imagen…. <br> La operación se completó. Cualquier reversión de las acciones pendientes se intentará después del reinicio. <br> La operación se completó con éxito &quot;. </em></p> <p><img src=\"images/image_thumb11_thumb-753.png\" alt=\"image_thumb[11]\" loading=\"lazy\"></p> <p> </p> <p> 9. <strong> Cerca </strong> símbolo del sistema y <strong> Reanudar </strong> tu computadora. * </p> <p> 10. Si Windows arranca normalmente, continúe con su trabajo. Si Windows no arranca y vuelve a intentar instalar las actualizaciones, entonces: </p> <blockquote><p> 1. Apague su PC. <br> 2. Vuelva a iniciar su computadora desde el medio de instalación de Windows. <br> 3. Inicie el símbolo del sistema. <br> 4. En el símbolo del sistema, proporcione los siguientes comandos en orden (no olvide cambiar la letra de la unidad <strong> D </strong> según tu caso): </p></blockquote> <ul> <li> <ul> <li> del D: \\ Windows \\ SoftwareDistribution </li> <li> del D: \\ Windows \\ WinSxS \\ cleanup.xml </li> <li> del D: \\ Windows \\ WinSxS \\ pendiente.xml </li> </ul> </li> </ul> <blockquote><p> 5. Cuando termine, cierre el símbolo del sistema y <strong> Reanudar </strong> tu computador. * </p></blockquote> <p> * Nota: Si el arranque vuelve a fallar, el arranque de nuevo es el símbolo del sistema de WinRE y da los siguientes comandos (no olvides cambiar la letra de la unidad <strong> D </strong> según tu caso): </p> <ul> <li> chkdsk / f D: </li> <li> sfc / scannow / offbootdir = D: \\ / offwindir = D: \\ windows </li> <li> dism / imagen: D: \\ / cleanup-image / restorehealth </li> </ul> <p> </p> <h6> Método 2. Restaurar el registro de Windows desde la copia de seguridad. </h6> <p> El siguiente método para corregir el error dism 1016 (se produjo un error al intentar acceder a la imagen) es restaurar el registro de Windows desde la carpeta &#39;RegBack&#39;. * </p> <p> * Información: La carpeta &#39;RegBack&#39;, (ruta completa = Windows \\ System32 \\ Config \\ RegBack), es la ubicación donde Windows almacena automáticamente una copia de seguridad de los archivos de registro cada vez que se inicia la máquina. </p> <p> Para restaurar el registro desde la carpeta RegBack: </p> <p> 1. Inicie su sistema desde un medio de instalación de Windows y luego siga los pasos 1-5 del método 1 anterior para navegar a la unidad de Windows. (por ejemplo, la &quot;D:&quot; en este ejemplo). </p> <p> 2. En primer lugar, realice una copia de seguridad de los archivos de registro actuales dando los siguientes comandos en orden. (Prensa <strong> Ingresar </strong> después de escribir cada comando): </p> <ul> <li><strong> cd \\ windows \\ system32 \\ config </strong></li> <li><strong> copia de seguridad md </strong></li> <li><strong> copiar *. * Copia de seguridad </strong></li> </ul> <p><img src=\"images/image_thumb-26-867.png\" alt=\"infinite Automatic Repair loop windows 10 fix\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Ahora navegue hasta <strong> RegBack </strong> carpeta dando este comando: </p> <ul> <li><strong> cd RegBack </strong></li> </ul> <p> 4. Luego escribe <strong> DIR </strong> (para ver el contenido de la carpeta RegBack). </p> <p> 5. Ahora vea si alguno de los archivos enumerados tiene <strong> 0</strong> (cero) bytes en su tamaño de archivo y proceda a continuación según su caso: </p> <ul> <li><strong> Caso A. </strong> Si alguno de los archivos enumerados tiene 0 (cero) bytes en su tamaño, entonces <strong> Deténgase aquí </strong> , y <strong> continuar con el siguiente método </strong> , porque los archivos de copia de seguridad del registro son inútiles o están dañados. </li> <li><strong> Caso B. </strong> Si todos los archivos enumerados tienen un tamaño diferente de cero (como en la captura de pantalla siguiente), continúe con el siguiente paso. </li> </ul> <p><img src=\"images/image_thumb-27-314.png\" alt=\"restore registry from backup\" loading=\"lazy\"></p> <p> </p> <p> 6. Copie los archivos de registro del <strong> Windows \\ System32 \\ Config \\ RegBack </strong> carpeta a <strong> Windows \\ System32 \\ Config \\ </strong> carpeta, dando este comando: </p> <p> </p> <ul> <li><strong> Copiar *.* .. </strong></li> </ul> <p> 7. Cuando se le solicite, presione <strong> A </strong> para sobrescribir los archivos en el destino después de dar el comando de copia. </p> <p><img src=\"images/image_thumb-28-604.png\" alt=\"fix startup repair loop\" loading=\"lazy\"></p> <p> </p> <p> 8. Cuando se complete la copia, escriba <strong> Salida </strong> y presione <strong> Ingresar </strong> para cerrar el símbolo del sistema. <br> 9. <strong> Reanudar </strong> su computadora e intente arrancar en Windows. </p> <p> * Nota: Si Windows no se reinicia de nuevo, reiniciar es el símbolo del sistema de WinRE y proporcionar los siguientes comandos (no olvide cambiar la letra <strong> D </strong> según tu caso): </p> <ul> <li> chkdsk / f D: </li> <li> sfc / scannow / offbootdir = D: \\ / offwindir = D: \\ windows </li> <li> dism / imagen: D: \\ / cleanup-image / restorehealth </li> </ul> <p> </p> <h6> Método 3. Restaure Windows 10 a un estado de trabajo anterior. </h6> <p> El siguiente método para resolver el error DISM 1016 es restaurar su sistema a un estado de funcionamiento anterior. Para hacer eso: </p> <p> 1. Inicie su sistema desde el medio de instalación de Windows. <br> 2. En la siguiente pantalla, haga clic en <strong> próximo </strong> y luego haga clic en <strong> Repara tu computadora </strong> &gt; <strong> Solucionar problemas. </strong></p> <p><img src=\"images/image_thumb20_thumb-815.png\" alt=\"image_thumb[20]\" loading=\"lazy\"></p> <p> </p> <p> 3. En <strong> Opciones avanzadas </strong> hacer clic <strong> Restauración del sistema. * </strong></p> <p> * Nota: Si el <strong> Volver a una compilación anterior </strong> opción, está disponible en esta pantalla, luego elija esa opción. </p> <p><img src=\"images/image_thumb28_thumb-863.png\" alt=\"image_thumb[28]\" loading=\"lazy\"></p> <p> </p> <p> 4. En la siguiente pantalla, haga clic en su sistema operativo. </p> <p><img src=\"images/image_thumb29_thumb-664.png\" alt=\"image_thumb[29]\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 5. Luego, en el Asistente de restauración del sistema, haga clic en <strong> próximo </strong> y luego elija un estado de trabajo anterior (fecha / hora) y haga clic en <strong> próximo </strong> para iniciar el proceso de restauración. </p> <p><img src=\"images/image_thumb-50-619.png\" alt=\"system restore windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Método 4. Reparar Windows 10. </h6> <p> El último método para resolver el error 1016 en DISM es <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> reparar Windows 10 con actualización local </a> o para hacer una copia de seguridad de sus archivos y luego <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> limpiar instalar Windows 10 </a> . </p> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}