{"title":"REVISIÓN: No se pudo conectar la conexión a escritorio remoto porque ya hay una sesión de consola en curso (resuelto).","content":"<p> El mensaje de error en Conexión a Escritorio remoto &quot;Su computadora no pudo conectarse a otra sesión de consola en la computadora remota porque ya tiene una sesión de consola en progreso&quot;, aparece porque la computadora local y remota tienen la misma dirección IP. El problema suele ocurrir cuando intenta conectarse de forma remota a otra computadora a través de una conexión VPN y ha &quot;recibido&quot; la misma dirección IP de su enrutador local, como la computadora remota. Para solucionar el problema, siga las instrucciones a continuación. </p> <p> </p> <p><img src=\"images/image_thumb-7-243.png\" alt=\"Remote Desktop Connection Could Not Connect because already have a console session in progress\" loading=\"lazy\"></p> <h4> Cómo corregir el error de RDP: Escritorio remoto no se pudo conectar a otra sesión de consola porque ya tiene una sesión de consola en curso. </h4> <p> El problema en la conexión de escritorio remoto &quot;No se pudo conectar a otra sesión de consola porque ya tiene una sesión de consola en progreso&quot; comúnmente ocurre cuando la computadora local recibe aleatoriamente (desde el servidor DHCP), la misma dirección IP que la dirección IP del control remoto. computadora que desea conectar a través de RDP. </p> <p> La única forma de solucionar el problema anterior es deshabilitar la asignación automática de dirección IP desde el servidor DHCP, en la computadora local y especificar manualmente una dirección IP. Para hacer eso: </p> <p> 1. <strong> Botón derecho del ratón </strong> sobre el <strong> La red </strong> icono <img src=\"images/image_thumb-42-527.png\" alt=\"image\" loading=\"lazy\"> en la barra de tareas y haga clic en <strong> Red abierta y centro de intercambio de. </strong> * </p> <p><img src=\"images/image_thumb-104-485.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Seleccione <strong> Ethernet </strong> (o Wi-Fi) a la izquierda, y luego en la sección &#39;Configuraciones relacionadas&#39;, haga clic en <strong> Cambiar las opciones del adaptador </strong> . </p> <p><img src=\"images/image_thumb-43-117.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Haga doble clic </strong> en el adaptador de red activo (Ethernet o Wi-Fi) y haga clic en <strong> Detalles </strong> . </p> <p><img src=\"images/image_thumb-8-177.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Anote los detalles de la dirección IP en los siguientes campos y luego haga clic en <strong> Cerca </strong> : </p> <ul> <li> Dirección IPv4 </li> <li> Máscara de subred IPv4 </li> <li> Puerta de enlace predeterminada IPv4 </li> <li> Servidor DNS IPv4 </li> </ul> <p><img src=\"images/image_thumb-9-793.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Ahora, haga clic en <strong> Propiedades </strong> . </p> <p><img src=\"images/image_thumb-10-628.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Seleccione el <strong> &#39;Protocolo de Internet versión 4 (TCP / IPv4) </strong> &#39;y haga clic en <strong> Propiedades </strong></p> <p><img src=\"images/image_thumb-106-954.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 7. En las propiedades del Protocolo de Internet versión 4 (TCP / IPv4), aplique la siguiente configuración: </p> <p> A. Seleccionar <strong> Use la siguiente dirección IP: </strong></p> <blockquote><p> 1. En el campo Dirección IP, escriba un <strong> dirección IP diferente a la dirección IP que notó antes </strong> . (Cambie solo el último número por un valor más alto). <br> 2. En el campo Máscara de subred, ingrese la misma dirección IP de subred que la que notó antes. <br> 3. En Puerta de enlace predeterminada, escriba la misma Puerta de enlace predeterminada que vio antes. </p></blockquote> <p> B. Seleccionar <strong> Utilice las siguientes direcciones de servidor DNS </strong> : </p> <blockquote><p> 1. En Servidor DNS preferido, escriba la dirección DNS que notó antes. </p></blockquote> <p> C.Cuando termine, haga clic en <strong> OK </strong> dos veces y <strong> Cerca </strong> para cerrar las propiedades del Adaptador. </p> <blockquote> <p><img src=\"images/image_thumb-11-850.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 8. Ahora, intente conectarse a la computadora de escritorio remoto. El problema debe resolverse. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}