{"title":"REVISIÓN: No se puede cambiar el tema: los temas de Aero aparecen atenuados en Windows 7 (resuelto)","content":"<p> Se ha producido el siguiente problema en una computadora con Windows 7: Windows cambió al tema básico y el usuario no puede cambiar el tema porque, cuando se abre la configuración de personalización, todos los temas aerodinámicos aparecen atenuados. En lugar de eso, todas las demás configuraciones en el panel de personalización están habilitadas (Fondo de escritorio, Color de Windows, Protector de pantalla, etc.), espere seleccionar un tema diferente. </p> <p><img src=\"images/image_thumb-28-129.png\" alt=\"Cannot Change Theme – Themes Greyed Out\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contiene instrucciones para solucionar el siguiente problema en Windows 7: El tema no se puede cambiar - Temas atenuados. </p> <h4> Cómo corregirlo: no se puede cambiar el tema: los temas de Aero están atenuados. </h4> <h6> Método 1. Analice su sistema en busca de virus y malware. </h6> <p> El primer paso para resolver el problema &quot;no se puede cambiar el tema básico&quot; es asegurarse de que su sistema esté libre de virus / malware. Para esa tarea, siga las instrucciones de esta guía: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo escanear su computadora en busca de virus y otros programas maliciosos. </a></p> <h6> Método 2. Reinicie el servicio de temas. </h6> <p> 1. Abra el panel de control de Servicios de Windows: Para ello: </p> <ul> <li> Presione Windows <img src=\"images/image_thumb8_thumb_thumb-720.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. </li> <li> En el cuadro de búsqueda, escriba: <strong><em> services.msc </em></strong> &amp; haga clic <strong> OK </strong> . </li> <li> (Acepte la advertencia de UAC si aparece). </li> </ul> <p><img src=\"images/image_thumb-12-580.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. En el panel de control de Servicios, haga clic con el botón derecho <strong> Temas </strong> servicio y elige <strong> Reanudar </strong> . * </p> <p> * Nota: Si el servicio está detenido, haga clic en <strong> Comienzo </strong> . </p> <p><img src=\"images/image_thumb-29-242.png\" alt=\"Themes Greyed Out - restart theme service\" loading=\"lazy\"></p> <p> </p> <h6> Método 3. Habilite los estilos visuales en ventanas y botones. </h6> <p> 1. Haga clic en el <strong> Comienzo </strong> botón, haga clic derecho en <strong> Computadora a </strong> nd seleccionar <strong> Propiedades </strong> . </p> <p><img src=\"images/image_thumb-30-382.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Haga clic en <strong> Configuración avanzada del sistema </strong> a la izquierda. </p> <p><img src=\"images/image_thumb-31-876.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. En la pestaña &quot;Avanzado&quot;, haga clic en <strong> Ajustes </strong> en la sección &#39;Rendimiento&#39;. </p> <p><img src=\"images/image_thumb-15-696.png\" alt=\"fix High CPU and DISK Usage Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. En <strong> Efectos visuales </strong> pestaña, marque la opción &quot;Usar estilos visuales en ventanas y botones&quot; y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-32-631.png\" alt=\"fix Theme cannot be changed - themes greyed out\" loading=\"lazy\"></p> <p> </p> <h6> Método 4. Instale los controladores de pantalla más recientes. </h6> <p><strong> 1. </strong> Navegar a <strong> Panel de control </strong> &gt; <strong> Programas y características </strong> y <strong> desinstalar </strong> el controlador VGA actualmente instalado. </p> <p><strong> 2. </strong> Cuando se completa la operación de desinstalación <strong> Reanudar </strong> tu computadora. </p> <p><strong> 3. </strong> Después de reiniciar, navegue al sitio de soporte del fabricante de su computadora para descargar e instalar los controladores más recientes para su tarjeta gráfica. Si posee una computadora de escritorio o portátil * con una tarjeta AMD / ATI o NVIDIA VGA, siga los pasos a continuación para buscar, descargar e instalar la última versión del controlador para su tarjeta de visualización. </p> <p><strong> * Nota: </strong> Si no puede encontrar los controladores en los enlaces siguientes, navegue hasta el sitio de asistencia del fabricante de su computadora. </p> <p> </p> <p><strong> Para GPU basadas en NVIDIA. </strong></p> <ol> <li> <ol> <li> Ir <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Página de búsqueda avanzada de controladores de NVIDIA </a> y busque el controlador correspondiente para su adaptador de pantalla. </li> <li> En la página de resultados de búsqueda, descargue una versión anterior del controlador. </li> <li> Instale el controlador que descargó y reinicie su computadora. </li> </ol> </li> </ol> <p> </p> <p><strong> Para GPU basadas en AMD. </strong></p> <ul> <li> <ol> <li> Ir <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Descarga del controlador AMD (ATI) </a> y busque el controlador correspondiente para su adaptador de pantalla. </li> <li> En la página de resultados de búsqueda, presione el <strong> Controladores y software anteriores </strong> enlace a la derecha. </li> <li> Instale el controlador que descargó y reinicie su computadora. </li> </ol> </li> </ul> <p> </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}