{"title":"REVISIÓN: Outlook 0x80042112 - Recibiendo el error informado (resuelto)","content":"<p> Outlook 0x80042112 La recepción de un error informado, generalmente ocurre cuando Outlook intenta recibir correos electrónicos de gran tamaño (por ejemplo, correos electrónicos con archivos adjuntos de gran tamaño). En este caso, Outlook muestra el siguiente error durante el &#39;Progreso de envío / recepción&#39;: &quot;Tarea &#39;% Cuenta de correo electrónico% - Recibiendo&#39; error informado (0x80042112): &#39;No se pueden descargar los siguientes mensajes de correo electrónico en el servidor de correo. Comuníquese con su proveedor de servicios de Internet (ISP) o administrador de correo si continúa recibiendo este error &quot;. </p> <p><img src=\"images/image_thumb-7-121.png\" alt=\"FIX: Outlook 0x80042112 Receiving reported error. \" loading=\"lazy\"></p> <p> Este tutorial contiene instrucciones detalladas para resolver el error de recepción de Outlook 0x80042112. </p> <h4> Cómo reparar Outlook al recibir el error 0x80042112. </h4> <h6> Paso 1. Asegúrese de estar conectado a Internet. </h6> <p> A veces, el error de recepción de Outlook 0x80042112 se produce porque la conexión a Internet está detenida. Entonces, en primer lugar, verifique que su conexión a Internet esté funcionando. Para hacerlo, abra su navegador de Internet y visite cualquier sitio web para verificar su conexión. </p> <p> </p> <h6> Paso 2. Elimine los mensajes de correo electrónico de la bandeja de salida. </h6> <p> El segundo método para resolver el error 0x80042112 en Outlook, es eliminar o mover a borradores, todos los mensajes de correo electrónico que se han quedado atascados en la Bandeja de salida. Para hacer eso: </p> <p> 1. En Outlook, haga clic en el <strong> Enviar recibir </strong> pestaña, y luego haga clic en <strong> Trabajar sin conexión </strong> . </p> <p><img src=\"images/image_thumb-8-737.png\" alt=\"Move Outbox Emails to Drafts folder\" loading=\"lazy\"></p> <p> 2. <strong> Reanudar </strong> Panorama. <br> 3. Seleccione el <strong> Bandeja de salida </strong> carpeta (a la izquierda) y luego presione <strong> CONTROL </strong> + <strong> A </strong> para seleccionar todos los correos electrónicos (a la derecha). <br> 4. Haga clic con el botón derecho en los correos electrónicos seleccionados y muévalos a <strong> Borradores </strong> carpeta, haciendo clic en <strong> Mover -&gt; Otra carpeta </strong> y luego seleccione el <strong> Borradores </strong> carpeta de la lista. </p> <p><img src=\"images/image_thumb-10-352.png\" alt=\"FIX Outlook error 0x80042112\" loading=\"lazy\"></p> <p> </p> <p> 5. Cuando termine, haga clic en el <strong> Enviar recibir </strong> pestaña y haga clic en <strong> Trabajar en línea. <br> </strong> 6. <strong> Reanudar </strong> Outlook y realice un Enviar / Recibir. </p> <h6></h6> <h6> Paso 3. Ejecute Outlook sin complementos. </h6> <p> Otro método para corregir el error de Outlook 0x80042112 en la recepción es iniciar la aplicación Outlook en Modo seguro y deshabilitar cualquier complemento que pueda causar el error. </p> <p> 1. Para iniciar Outlook en Modo seguro, mantenga presionada la tecla <strong> CONTROL </strong> (en su teclado) y luego haga doble clic en el acceso directo de Microsoft Outlook, o: </p> <blockquote><p> una. Presione simultáneamente las ventanas <img src=\"images/image_thumb36-371.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> teclas para abrir el cuadro de comando de ejecución. <br> B. Tipo: <strong> perspectiva / seguro </strong> y haga clic en <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-14-671.png\" alt=\"outlook safe mode\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. En el modo seguro de Outlook, navegue hasta las opciones de complementos y <strong> deshabilitar todos los complementos </strong> . Para hacer eso: </p> <ul> <li> Para deshabilitar complementos en <strong> Outlook 2007 </strong> : </li> </ul> <blockquote><p> 1. <strong> En </strong> la <strong> Herramientas </strong> menú, haga clic en <strong> Centro de confianza. </strong><br> 2. Seleccione <strong> Complementos </strong> en el panel izquierdo. <br> 3. En el panel derecho, seleccione <strong> Complementos COM </strong> y haga clic en <strong> Ir… <br> </strong> 4. <strong> Desmarcar </strong> todas las casillas de verificación, para deshabilitar todos los complementos y haga clic en <strong> está bien. </strong></p></blockquote> <ul> <li> Para deshabilitar complementos en <strong> Outlook 2016, 2013 </strong> o <strong> 2010 </strong> : </li> </ul> <blockquote><p> 1. Haga clic en el <strong> Archivo </strong> menú y seleccione <strong> Opciones </strong> . <br> 2. Seleccione <strong> Complementos en </strong> el panel izquierdo. <br> 3. En el panel derecho, seleccione <strong> Complementos COM </strong> y haga clic en <strong> Ir… </strong></p></blockquote> <p><img src=\"images/image_thumb-20-411.png\" alt=\"disable outlook add-ins\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. <strong> Desmarcar </strong> <strong> todas </strong> las casillas de verificación y haga clic en <strong> OK </strong> para deshabilitar todos los complementos. </p> <p><strong><img src=\"images/image_thumb-21-683.png\" alt=\"turn off outlook add-ins\" loading=\"lazy\"><strong><br> </strong></strong></p> </blockquote> <p> 3. <strong> Reanudar </strong> Panorama. <br> 4. Intente enviar / recibir. Si el progreso de envío / recepción finaliza normalmente y sin mostrar el error 0x80042112, proceda y vuelva a habilitar uno por uno todos los complementos deshabilitados y reinicie Outlook, hasta que encuentre cuál causa el problema. </p> <p> </p> <h6> Paso 4. Verifique la configuración de su antivirus y firewall. </h6> <p> Si está utilizando un programa antivirus con funciones de análisis de correo electrónico, desactive el complemento Antivirus en Outlook (consulte las instrucciones en el paso 3 anterior) o desactive temporalmente la protección antivirus o desinstale el programa antivirus. Además, verifique la configuración de su Firewall y asegúrese de que los puertos del servidor de correo electrónico que está utilizando no estén bloqueados por el programa Firewall. Más específicamente, en la configuración de su Firewall: </p> <p> A. Habilite los siguientes archivos para acceder a Internet: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Habilite los siguientes puertos en Firewall: </p> <ul> <li><strong> Puerto 110 </strong> (Si está utilizando un servidor de correo entrante POP3 sin conexión cifrada) * </li> <li><strong> Puerto 995 </strong> (Si está utilizando un servidor de correo entrante POP3 con conexión cifrada (SSL habilitado) </li> </ul> <ul> <li><strong> Puerto 143 </strong> (si está utilizando un servidor de correo entrante IMAP sin conexión cifrada) </li> <li><strong> Puerto 993 </strong> (si está utilizando un servidor de correo entrante IMAP con conexión cifrada (SSL habilitado) </li> </ul> <ul> <li><strong> Puerto 25 </strong> Si su servidor de correo saliente SMTP no utiliza SSL. * </li> <li><strong> Puerto 465 </strong> o <strong> 587 </strong> si su servidor de correo saliente SMTP utiliza SSL </li> </ul> <p> * Nota: De forma predeterminada, el puerto 25 es para acceso saliente y el puerto 110 es para acceso entrante. Si no está seguro acerca de los puertos, comuníquese con su ISP o administrador del sistema. </p> <p> </p> <h6> Paso 5. Repare el archivo de datos PST de Outlook. </h6> <p> El siguiente paso para corregir el error 0x80042112 de Outlook Receiving es ejecutar la Herramienta de reparación de la bandeja de entrada para reparar su archivo .pst. Las instrucciones detalladas para hacerlo se pueden encontrar en este tutorial: <a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Cómo reparar el archivo de datos PST de Outlook </a> . </p> <p> </p> <h6> Paso 6. Verifique el tamaño de los mensajes de correo electrónico de la WEB. </h6> <p> Si tiene acceso a su cuenta de correo electrónico a través de la web, inicie sesión en su cuenta de correo electrónico usando su navegador web y verifique si el tamaño de un correo electrónico es el problema. Por ejemplo, si encuentra un correo electrónico grande en su bandeja de entrada, descargue sus archivos adjuntos y luego elimine ese correo electrónico. * </p> <p> * Nota: Si no tiene acceso a su cuenta de correo electrónico a través de la web, comuníquese con su proveedor de correo electrónico para informar el problema. </p> <p> ¡Eso es todo amigos! ¿Funcionó para ti? <br> Deje un comentario en la sección de comentarios a continuación o incluso mejor: haga clic en Me gusta y comparta esta publicación de blog en las redes sociales para ayudar a difundir esta solución. </p>"}