{"title":"Comment ouvrir PowerShell en tant qu&#39;administrateur dans le dossier actuel dans l&#39;explorateur de fichiers (Windows 10)","content":"<p> Si vous souhaitez ouvrir PowerShell ou PowerShell en tant qu&#39;administrateur, à n&#39;importe quel emplacement/dossier de l&#39;explorateur de fichiers, continuez à lire ce didacticiel. Comme vous le savez, les moyens habituels d&#39;ouvrir le PowerShell dans Windows 10 consistent à le rechercher à l&#39;aide de la recherche Cortana ou (plus rapidement) à appuyer sur le bouton <strong> Gagner <img src=\"images/image_thumb8_thumb_thumb-479.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"></strong> + <strong> X </strong> pour ouvrir le &quot;menu Power User&quot; et exécuter Windows PowerShell à partir de là. </p> <p><img src=\"images/image_thumb-54-350.png\" alt=\"PoweShell Admin (Win + X menu)\" loading=\"lazy\"></p> <p> </p> <p> Bien que ces méthodes soient utiles, il est parfois nécessaire d&#39;ouvrir PowerShell dans un emplacement/dossier spécifique. Pour ce faire, suivez les instructions ci-dessous. </p> <h4> Comment ouvrir Windows PowerShell dans un emplacement spécifique dans Windows 10. </h4> <p> 1. Accédez au dossier dans lequel vous souhaitez ouvrir PowerShell. <br> 2. <strong> Maintenez enfoncé </strong> les <strong> CHANGEMENT </strong> clé et <strong> clic-droit </strong> n&#39;importe où dans le dossier. <br> 3. Dans le menu contextuel, sélectionnez <strong> Ouvrez la fenêtre PowerShell ici </strong> à <strong> </strong> ouvrez une nouvelle fenêtre PowerShell sur ce dossier. </p> <p> </p> <p><img src=\"images/image_thumb-55-793.png\" alt=\"Open PoweShell at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Si vous souhaitez ouvrir « PowerShell en tant qu&#39;administrateur » dans n&#39;importe quel dossier, cliquez sur le bouton <strong> Déposer </strong> menu et sélectionnez <strong> Ouvrez Windows PowerShell en tant qu&#39;administrateur </strong> . * </p> <p> * Remarque : Comme vous pouvez le voir dans le menu &quot;Fichier&quot;, vous pouvez également ouvrir une fenêtre PowerShell &quot;simple&quot;. </p> <p><img src=\"images/image_thumb-56-830.png\" alt=\"Open PoweShell As Administrator at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p><strong> Aide supplémentaire : </strong> Si vous êtes un fan des raccourcis clavier, une autre façon d&#39;ouvrir PowerShell (Admin) consiste à appuyer sur le bouton <strong> Alt </strong> + <strong> F </strong> + <strong> S </strong> + <strong> UNE </strong> clés dans l&#39;ordre. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}