{"title":"CORRECTIF : Erreur de code 32 sur le processeur Intel – Un pilote (service) pour cet appareil a été désactivé. (Résolu)","content":"<p> Ce didacticiel contient des instructions pour corriger le code d&#39;erreur 32 du gestionnaire de périphériques sur le périphérique CPU Intel : &quot;Un pilote (service) pour ce périphérique a été désactivé. Un autre pilote peut fournir cette fonctionnalité. (Code 32)&quot; </p> <p><img src=\"images/image_thumb-21-979.png\" alt=\"FIX Code 32 on Intel CPU - A driver (service) for this device has been disabled\" loading=\"lazy\"></p> <p> </p> <p> L&#39;erreur &quot;Code 32&quot; dans le gestionnaire de périphériques, indique généralement un problème matériel sur le périphérique ou un problème dans le pilote du périphérique. Pour résoudre l&#39;erreur « Un pilote (service) pour ce périphérique a été désactivé » dans le périphérique Intel CPU, suivez les instructions ci-dessous. </p> <h4> Comment CORRIGER : DEVICE MANAGER ERROR CODE 32 sur Intel CPU Device. * </h4> <p> * Remarques: <br> 1. Avant de continuer avec les méthodes ci-dessous, installez les dernières mises à jour Windows et installez les derniers pilotes Intel Chipset à partir du site d&#39;assistance du fabricant de votre ordinateur. <br> 2. Si vous recevez l&#39;erreur &quot;Code 32&quot; sur un ordinateur portable, essayez de l&#39;alimenter avec un autre adaptateur secteur et vérifiez si l&#39;erreur persiste. </p> <h6> Méthode 1. Désinstallez et réinstallez les processeurs Intel. </h6> <p> 1 Appuyez sur &quot; <strong> les fenêtres </strong> &quot; + &quot; <strong> R </strong> &quot; pour ouvrir la fenêtre RUN. <br> 2. Dans la case &quot;Ouvrir&quot; de la fenêtre &quot;EXÉCUTER&quot;, saisissez : <strong> devmgmt.msc </strong> &amp; Presse <strong> Entrer. </strong></p> <p><img src=\"images/image_thumb-18-504.png\" alt=\"devmgmt.msc\" loading=\"lazy\"></p> <p> </p> <p> 3. Dans le Gestionnaire de périphériques, développez <strong> Processeurs. </strong><br> 4. Faites un clic droit sur chaque périphérique CPU Intel et cliquez sur <strong> Désinstaller l&#39;appareil </strong> . * </p> <p> * Remarque : lorsque vous êtes invité à « Redémarrer l&#39;ordinateur », demandez « Non » et continuez à désinstaller tous les processeurs Intel répertoriés. </p> <p><img src=\"images/image_thumb-19-511.png\" alt=\"FIX Code 32 on Intel CPU\" loading=\"lazy\"></p> <p> 5. Une fois terminé, <strong> redémarrer </strong> l&#39;ordinateur et vérifiez si le code d&#39;erreur 32 dans le gestionnaire de périphériques a disparu. </p> <p> </p> <h6> Méthode 2. Activez le service Intel Power Management dans le Registre. </h6> <p> La méthode suivante pour résoudre le code d&#39;erreur 32 sur les processeurs Intel consiste à activer le service &quot;Intel Power Management&quot; à l&#39;aide de l&#39;éditeur de registre. Pour faire ça: </p> <p> 1. Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-871.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Dans la case &quot;Ouvrir&quot;, saisissez : <strong> regedit </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb7-820.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Accédez à cette clé dans le volet de gauche : </p> <ul> <li><strong> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\intelppm </strong></li> </ul> <p> 4. A droite, ouvrez le <strong> Démarrer </strong> valeur. <br> 5. Modifiez les données de valeur de 4 à <strong> 1 </strong> et cliquez <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-20-525.png\" alt=\"Enable Intel Power Management service in Registry\" loading=\"lazy\"></p> <p> </p> <p> 6. Fermez l&#39;éditeur de registre et <strong> redémarrer </strong> votre ordinateur. </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}