{"title":"CORRECTIF : ce mode de Windows n&#39;exécute que les applications vérifiées du Store sous Windows 10.","content":"<p> L&#39;erreur &quot;Pour des raisons de sécurité et de performances, ce mode de Windows n&#39;exécute que les applications vérifiées du Store&quot; apparaît lorsque Windows 10 s&#39;exécute en mode S, ou en raison d&#39;un paramètre sur votre ordinateur, qui restreint l&#39;installation d&#39;applications et de logiciels tiers . </p> <p><img src=\"images/image_thumb-19-156.png\" alt=\"FIX: For security and performance, this mode of Windows only runs verified apps from the Store in Windows 10.\" loading=\"lazy\"></p> <p> Ce didacticiel contient des instructions pour résoudre l&#39;erreur &quot;Pour des raisons de sécurité et de performances, ce mode de Windows n&#39;exécute que les applications vérifiées du Store&quot;, lorsque vous essayez d&#39;installer une application tierce dans Windows 10. </p> <h2> Comment autoriser l&#39;installation d&#39;applications tierces dans Windows 10. </h2> <h5> Étape 1. Découvrez la version Windows 10 installée. </h5> <p> 1. Appuyez sur le bouton Windows <img src=\"images/image_thumb8_thumb-1-482.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez la commande suivante et appuyez sur <strong> Entrer: </strong></p> <ul> <li><strong> gagnant </strong></li> </ul> <p><img src=\"images/image_thumb-13-360.png\" alt=\"See Windows 10 Installed Version\" loading=\"lazy\"></p> <p> 3. Maintenant, si vous voyez dans Windows Edition que vous exécutez Windows 10 Home ou Pro, suivez les instructions de <a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Méthode-1 </a> , sinon, si vous avez <strong> Windows 10 Famille S </strong> , suivez les instructions de <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Méthode-2 </a> . </p> <p><img src=\"images/image_thumb-14-709.png\" alt=\"See Installed Windows 10 Edition\" loading=\"lazy\"></p> <p><strong> </strong></p> <p><strong> </strong></p> <h3> Méthode 1. Autoriser Windows 10 à installer des applications depuis n&#39;importe où. </h3> <p> 1. Depuis le menu Démarrer <img src=\"images/image_thumb2_thumb_thumb-909.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> cliquez sur Paramètres <img src=\"images/image_thumb-66-797.png\" alt=\"image\" loading=\"lazy\"> puis ouvrir <strong> applications </strong> . </p> <p><img src=\"images/image_thumb-15-604.png\" alt=\"Windows Settings - Apps\" loading=\"lazy\"></p> <p> </p> <p> 2. Dans les paramètres d&#39;applications et de fonctionnalités, sélectionnez pour installer des applications à partir de <strong> Partout </strong> . </p> <p><img src=\"images/image_thumb-16-670.png\" alt=\"Install Apps from Anywhere - Windows 10\" loading=\"lazy\"></p> <h3> Méthode 2. Sortez du mode Windows 10 S. </h3> <p> Windows 10 en mode S est conçu pour la sécurité et les performances et, pour cette raison, ne permet pas d&#39;exécuter des applications en dehors du Microsoft Store. Pour contourner cette limitation, vous devez quitter le mode S, ce qui est un moyen très simple, mais gardez à l&#39;esprit qu&#39;une fois que vous quittez le mode S, vous ne pourrez plus revenir à Windows 10 en mode S. </p> <p> Pour vous déconnecter du mode Windows 10 S vers Windows 10 Famille : </p> <p> 1. Depuis le menu Démarrer <img src=\"images/image_thumb2_thumb_thumb-829.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> cliquez sur Paramètres <img src=\"images/image_thumb-66-853.png\" alt=\"image\" loading=\"lazy\"> puis ouvrir <strong> Mise à jour et sécurité. </strong></p> <p> 2. Sélectionnez <strong> Activation </strong> à gauche, puis cliquez sur <a href=\"//switchwindows\" target=\"_blank\" rel=\"nofollow noopener\"> Aller au magasin </a><strong> . </strong></p> <p><img src=\"images/image_thumb-17-920.png\" alt=\"Switch Out S Mode Windows 10\" loading=\"lazy\"></p> <p> 3. Dans la page Quitter le mode S, cliquez sur <strong> Obtenir </strong> puis cliquez <strong> Installer. </strong> * <br> 4. Enfin cliquez sur <strong> Oui allons-y </strong> pour sortir du mode S. </p> <p> * Remarque : Si après avoir cliqué sur le bouton « Installer », vous recevez l&#39;erreur « Quelque chose s&#39;est produit et nous n&#39;avons pas pu démarrer la mise à niveau », continuez et <strong> installer toutes les mises à jour disponibles de Windows 10 </strong> , <strong> redémarrez votre PC </strong> et essayez à nouveau. </p> <p><img src=\"images/image_thumb-18-502.png\" alt=\"Switch Out S Mode\" loading=\"lazy\"></p> <p> </p> <p> 4. Une fois l&#39;installation terminée, vous serez informé que vous pourrez installer des applications en dehors du Microsoft Store. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}