{"title":"Comment trouver Windows Media Player dans Windows 10.","content":"<p> Depuis de nombreuses années, Windows Media Player était l&#39;application par défaut pour lire de la musique et des vidéos. Dans Windows 10, le lecteur Windows n&#39;est plus le lecteur par défaut pour les fichiers multimédias et a été remplacé par l&#39;application &quot;Films et TV&quot;. </p> <p> Cet article est écrit pour tous les utilisateurs qui souhaitent trouver et utiliser le Windows Media Player classique, comme lecteur par défaut pour lire leur musique et leurs vidéos. </p> <h4> Comment trouver Windows Media Player dans Windows 10. </h4> <p> Le moyen le plus rapide de savoir si Windows Media Player est installé sur votre ordinateur est de le rechercher. Pour faire ça: </p> <p> 1. Dans le champ de recherche de Cortana, tapez <strong> Lecteur Windows Media </strong> . <br> 2. Si le lecteur Windows Media est répertorié dans les résultats, cliquez dessus pour lancer le programme. (Si non répertorié, continuez ci-dessous…) </p> <p><img src=\"images/image_thumb-66-377.png\" alt=\"How to Find Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> ASTUCE: </strong> Pour définir Windows Media Player comme lecteur par défaut pour vos vidéos et votre musique : </p> <blockquote><p> 1. Accédez à <strong> Démarrer </strong> -&gt; <strong> Paramètres </strong> -&gt; <strong> applications </strong> et sélectionnez <strong> Applications par défaut </strong> A gauche. <br> 2. À <strong> Lecteur de musique </strong> options, cliquez sur le <strong> Musique Groove </strong> puis sélectionnez le <strong> Lecteur Windows Media </strong> . <br> 3. <strong> Dans les options du lecteur vidéo </strong> , Cliquez sur <strong> Films et télévision </strong> puis sélectionnez le <strong> Lecteur Windows Media </strong> . </p> <p><img src=\"images/image_thumb-72-358.png\" alt=\"set windows media player default widnows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h4> Comment installer le lecteur Windows Media dans Windows 10 Home, Pro. </h4> <p> Si Windows Media Player n&#39;est pas répertorié, vous pouvez l&#39;installer en allant sur : </p> <p> 1. <strong> Panneau de commande </strong> -&gt; <strong> Programmes et fonctionnalités </strong> . <br> 2. Cliquez sur <strong> Activer ou désactiver des fonctionnalités Windows </strong> à partir de la gauche. </p> <p><img src=\"images/image_thumb-68-342.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. À <strong> Fonctionnalités multimédias </strong> , sélectionnez le <strong> Lecteur Windows Media </strong> et appuyez sur <strong> d&#39;accord </strong> . * </p> <p> * Remarque : si vous possédez la version Windows 10 N ou KN, ou si vous ne pouvez pas installer Windows Media Player à partir des « fonctionnalités Windows », continuez à lire ci-dessous… </p> <p><img src=\"images/image_thumb-69-565.png\" alt=\"How to Install Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Comment télécharger et installer le lecteur Windows Media dans les versions Windows 10 Home, Pro, N &amp; KN. </h4> <p> Si vous ne pouvez pas installer Windows Player en suivant les instructions ci-dessus, ou si vous possédez Windows 10 N ou KN, vous pouvez télécharger Windows Media Player pour Windows 10 en suivant les instructions ci-dessous : </p> <p> 1. Téléchargez le <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48231\" target=\"_blank\" rel=\"nofollow noopener\"> Media Feature Pack pour les versions N et KN de Windows 10 </a> . </p> <p> * Remarque : Téléchargez le <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package.msu </strong> pour <strong> OS 32 bits, </strong> et le <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package_x64.msu </strong> pour <strong> Système d&#39;exploitation 64 bits. </strong></p> <p> 2. Exécutez le fichier téléchargé et cliquez sur <strong> Oui </strong> au premier écran. </p> <p><img src=\"images/image_thumb-70-480.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> J&#39;accepte </strong> le contrat de licence, puis attendez la fin de l&#39;installation. </p> <p><img src=\"images/image_thumb-71-400.png\" alt=\"download windows media player windows 10\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}