{"title":"CORRECTIF : l&#39;ordinateur portable Lenovo est bloqué sur l&#39;écran LOGO. (Résolu)","content":"<p> Si votre ordinateur portable Lenovo est bloqué sur l&#39;écran du logo, continuez à lire. Ce didacticiel contient des instructions étape par étape pour résoudre le problème suivant sur les ordinateurs portables Lenovo : Après la mise sous tension, l&#39;ordinateur portable ne démarre pas et se bloque sur l&#39;écran de démarrage du logo Lenovo. (Le problème persiste même lorsque vous essayez de démarrer à partir d&#39;un périphérique de démarrage USB). </p> <p><img src=\"images/image_thumb-17-276.png\" alt=\"FIX: Lenovo laptop is stuck at LOGO screen.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Comment réparer : ordinateur portable bloqué à l&#39;écran LENOVO LOGO. * </h4> <p> * Important : avant de dépanner un ordinateur, déconnectez tous les périphériques pour vous assurer que le problème n&#39;est pas dû à un périphérique connecté. </p> <p> </p> <h6> Étape 1. Réinitialisez le BIOS aux paramètres par défaut. </h6> <p> La première étape pour résoudre le blocage de l&#39;ordinateur portable au logo Lenovo consiste à réinitialiser le BIOS aux paramètres par défaut. Pour faire ça: </p> <p> 1. <strong> Éteindre </strong> l&#39;ordinateur portable en appuyant constamment sur le bouton d&#39;alimentation pendant 5 à 7 secondes. <br> 2. Suivez maintenant les instructions ci-dessous en fonction de votre modèle pour entrer dans le BIOS : </p> <ul> <li> Si votre système est <strong> Think Pad </strong> , appuyez sur le bouton d&#39;alimentation, puis appuyez immédiatement sur la touche (Fn+) F2 ou (Fn+) F1 rapidement et à plusieurs reprises. </li> <li> Si votre système est <strong> bloc d&#39;idées </strong> ordinateur portable, localiser et <strong> presse </strong> les <a href=\"https://support.lenovo.com/us/en/solutions/HT104038\" target=\"_blank\" rel=\"nofollow noopener\"> NOVO </a> bouton, qui est généralement situé à côté du bouton d&#39;alimentation, puis sélectionnez <strong> Entrez dans le menu du BIOS </strong> . </li> </ul> <p> 3. À <strong> Sortir </strong> onglet sélectionner <strong> Charger les paramètres par défaut </strong> ou &quot;Charger les paramètres optimisés&quot;. <br> 4. <strong> Enregistrer et quitter le BIOS </strong> paramètres et voyez si vous pouvez démarrer sous Windows. <br> 5. Si l&#39;ordinateur portable se fige toujours sur l&#39;écran du logo Lenovo, passez à l&#39;étape suivante. </p> <p> </p> <h6> Étape 2. Désactivez le moteur de service Lenovo. </h6> <p> Sur certains ordinateurs portables (et ordinateurs de bureau Lenovo), le système se bloque sur « Lenovo Logo » pendant le démarrage, lorsque le « Lenovo Service Engine » est activé. Pour désactiver le service : </p> <p> 1. Entrez dans le menu BIOS. <br> 2. À <strong> Sécurité </strong> onglet, mettez en surbrillance et désactivez le &quot;Lenovo Service Engine&quot;. </p> <p><img src=\"images/image_thumb-19-834.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Sauvegarder et quitter </strong> depuis le menu du BIOS. <br> 4. Si l&#39;ordinateur portable reste bloqué sur l&#39;écran de démarrage du logo Lenovo, passez à l&#39;étape suivante. </p> <p> </p> <h6> Étape 3 : effectuez une réinitialisation de l&#39;alimentation. </h6> <p> La méthode suivante pour résoudre le problème du « Logo Lenovo bloqué » consiste à effectuer une réinitialisation de l&#39;alimentation. Pour faire ça: </p> <p> 1. <strong> Déconnecter </strong> tous les périphériques connectés. <br> 2. <strong> Supprimer </strong> les <strong> Adaptateur pour courant alternatif </strong> . <br> 3. <strong> Supprimer </strong> les <strong> La batterie </strong> . * </p> <p> * Remarque : si vous ne pouvez pas retirer la batterie, laissez l&#39;ordinateur portable ouvert jusqu&#39;à ce que la batterie soit déchargée. </p> <p> 4. <strong> presse </strong> et <strong> maintenez enfoncé </strong> les <strong> Pouvoir </strong> pendant au moins 50 à 60 secondes, puis relâchez le bouton d&#39;alimentation. <br> 5. Connectez uniquement l&#39;adaptateur secteur et allumez l&#39;ordinateur portable. <br> 6. Si Windows démarre normalement, éteignez votre ordinateur portable et reconnectez la batterie et les périphériques. </p> <h6> Étape 4. Retirez la batterie CMOS. </h6> <p> 1. <strong> Supprimer </strong> les <strong> La batterie </strong> et le <strong> adaptateur pour courant alternatif </strong> . <br> 2. Retournez l&#39;ordinateur portable et <strong> supprimer </strong> les <strong> quatrième de couverture </strong> . * </p> <p> * Remarque : la manière de retirer la façade arrière diffère selon le modèle d&#39;ordinateur portable. Alors, effectuez une recherche Google sur la façon de démonter votre propre modèle d&#39;ordinateur portable Lenovo. </p> <p> 3. Localisez et <strong> supprimer </strong> les <strong> batterie CMOS </strong> . * </p> <p> * Remarque : la batterie CMOS a la forme d&#39;un cercle et vous pouvez la retirer en la soulevant doucement avec un petit tournevis à tête plate. </p> <p> 4. <strong> presse </strong> et <strong> maintenez enfoncé </strong> les <strong> Pouvoir </strong> pendant au moins 50 à 60 secondes, puis relâchez-le. </p> <p> 5. Connectez d&#39;abord l&#39;adaptateur secteur, puis réinsérez la pile CMOS. <br> 5. Allumez l&#39;ordinateur portable. * </p> <p> * Remarque : Si le problème persiste, retirez et laissez la batterie CMOS débranchée pendant au moins 30 minutes. Ensuite, remettez la batterie CMOS, connectez l&#39;adaptateur secteur et allumez l&#39;ordinateur portable. </p> <p> </p> <h6> Étape 5. Retirez l&#39;unité DVD. * </h6> <p><strong> * Important: </strong> Éteignez votre ordinateur et retirez l&#39;adaptateur secteur avant d&#39;ajouter ou de retirer des pièces. </p> <p> Si vous possédez un ordinateur portable avec un lecteur de DVD, retirez-le et rallumez votre ordinateur portable. (Cela semble étrange, mais fonctionne dans certains cas.) </p> <p> </p> <h6> Étape 6. Retirez et réinstallez la RAM et le disque dur. </h6> <p> Lorsqu&#39;un ordinateur (de bureau ou portable) se bloque à l&#39;écran LOGO (POST), cela signifie généralement un problème avec le disque dur (HDD) ou la mémoire (RAM). Alors, procédez comme suit : </p> <p><strong> * Important: </strong> Éteignez votre ordinateur et retirez l&#39;adaptateur secteur avant d&#39;ajouter ou de retirer ses composants. </p> <p> 1. Retirez et réinstallez le(s) module(s) RAM. <br> 2. Allumez l&#39;ordinateur portable et voyez si le problème persiste. Si oui, alors… <br> 3. Éteignez l&#39;ordinateur portable et retirez (déconnectez) le disque dur (HDD). <br> 4. Après avoir retiré le disque dur, rallumez l&#39;ordinateur portable. <br> 5. Si le disque dur est la cause du problème, l&#39;écran de démarrage Lenovo LOGO disparaîtra et vous recevrez un message indiquant &quot;Aucun périphérique amorçable trouvé&quot; ou quelque chose comme ça. Si cela se produit :* </p> <blockquote><p> une. Éteignez l&#39;ordinateur portable. <br> b. Nettoyez les contacts sur le disque dur et la prise HDD avec un spray nettoyant pour contacts. <br> c. Reconnectez le disque dur et continuez à lire ci-dessous (6). </p></blockquote> <p> * Remarque : Si cela ne se produit pas, cela indique un problème de BIOS, ou un problème de carte mère, qui ne peut être réparé que par un technicien informatique spécialisé. </p> <p> 6. Allumez l&#39;ordinateur portable et voyez si le problème est résolu. Sinon, procédez à la sauvegarde de vos fichiers, puis effectuez une nouvelle installation de Windows en suivant les étapes ci-dessous : </p> <blockquote><p> une. Retirez et connectez le disque dur à un autre ordinateur en état de marche (par exemple en utilisant un adaptateur de disque dur USB vers SATA). <br> b. Si vous pouvez lire le contenu du lecteur, continuez et <strong> sauvegardez vos fichiers </strong> . * </p> <p> * Remarque : Si le disque dur n&#39;est pas reconnu par l&#39;ordinateur secondaire, alors le disque dur est défectueux et vous devez le remplacer. </p> <p> c. Après avoir sauvegardé vos fichiers, continuez et <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> diagnostiquer les problèmes du disque dur </a> , et selon les résultats, remplacez le disque dur (s&#39;il est défectueux), ou (s&#39;il est OK) continuez et <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> supprimer toutes les partitions sur le disque dur </a> . </p></blockquote> <p> 7. Après avoir nettoyé les partitions, remettez le disque dur sur l&#39;ordinateur portable et passez à <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> installer proprement Windows </a> . </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}