{"title":"Comment activer la protection de restauration du système dans le système d&#39;exploitation Windows 10/8/7.","content":"<p> Ce didacticiel contient des instructions sur la façon d&#39;activer la protection du système sur les systèmes d&#39;exploitation Windows 10, 8 et 7. La protection de restauration du système (communément appelée « Protection du système ») est une fonctionnalité Windows qui vous permet de <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> restaurer </a> votre système à un moment antérieur, si Windows ne fonctionne pas correctement après une modification importante des fichiers système (par exemple, après une mise à jour de Windows ou après une attaque de virus.) </p> <p> L&#39;outil de restauration du système utilise le service Volume Shadow Copy pour prendre des instantanés des fichiers système et du registre Windows et les enregistre en tant que points de restauration. Ces « points de restauration » peuvent être utilisés pour restaurer le système à un état de fonctionnement antérieur, si Windows ne démarre pas ou devient instable, sans avoir à réinstaller le système d&#39;exploitation. </p> <h4> Comment activer la protection de restauration du système dans Windows 10. </h4> <p> 1. Ouvrez l&#39;explorateur Windows, faites un clic droit sur l&#39;icône &quot;Ce PC&quot; et choisissez <strong> Propriétés </strong> . </p> <p><img src=\"images/image_thumb-70-672.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Choisissez <strong> Protection du système </strong> A gauche. </p> <p><img src=\"images/image_thumb-71-762.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Mettez en surbrillance le <strong> Disque local C : (Système) </strong> et cliquez <strong> Configurer. </strong></p> <p><img src=\"images/image_thumb-72-782.png\" alt=\"turn on system restore protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Dans les options de protection du système, sélectionnez <strong> Activer la protection du système </strong> et cliquez <strong> D&#39;ACCORD. * </strong></p> <p> * Remarque : si la &quot;Protection du système : est déjà activée, alors tout va bien. </p> <p><img src=\"images/image_thumb-73-192.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 5. Enfin, dans les options de protection du système, cliquez sur <strong> Créer </strong> pour créer un instantané (Point de restauration) de l&#39;état actuel du système. </p> <p><img src=\"images/image_thumb-75-308.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}