{"title":"CORRECTIF : le complément Outlook est installé pour tous les utilisateurs et ne peut pas être supprimé. (Résolu)","content":"<p> Si vous ne pouvez pas désactiver ou activer un complément Outlook en raison d&#39;une erreur &quot; <em> Le module complémentaire est installé pour tous les utilisateurs de cet ordinateur et ne peut être connecté ou déconnecté que par un administrateur </em> &quot;, continuez à lire ci-dessous pour résoudre le problème. </p> <p><img src=\"images/image_thumb-76-527.png\" alt=\"The add-is installed for all users on this computer, and can only be connected or disconnected by an administrator\" loading=\"lazy\"></p> <p> L&#39;erreur « Le complément ne peut être désactivé que par un administrateur » apparaît car lorsque vous avez installé le complément, vous choisissez de l&#39;installer pour tous les utilisateurs de l&#39;ordinateur. Dans ce cas, la seule solution pour résoudre l&#39;erreur consiste à désinstaller le complément à l&#39;aide de privilèges administratifs. </p> <h2> Résoudre le problème : impossible d&#39;activer ou de désactiver le complément car il est installé pour tous les utilisateurs dans Outlook, Word ou Excel. </h2> <p> Si vous ne pouvez pas supprimer ou activer un complément d&#39;une application Microsoft Office, en raison de l&#39;erreur &quot; <em> Le module complémentaire est installé pour tous les utilisateurs de cet ordinateur et ne peut être connecté ou déconnecté que par un administrateur&quot;, </em> lancez l&#39;application correspondante en tant qu&#39;administrateur et procédez à la suppression du complément sans problème. Pour faire ça: </p> <p><strong> 1. </strong> Cliquez avec le bouton droit sur l&#39;application Office, où vous rencontrez l&#39;erreur mentionnée ci-dessus (par exemple Outlook), et sélectionnez <strong> Exécuter en tant qu&#39;administrateur. * </strong></p> <p> * Remarques: <strong><br> </strong> 1. Si vous ne voyez pas l&#39;option &quot;Exécuter l&#39;administrateur&quot;, maintenez la touche <strong> CHANGEMENT </strong> clé et <strong> clic-droit </strong> dans l&#39;application Office, vous rencontrez l&#39;erreur. <br> 2. Si vous faites un clic droit sur l&#39;application Office à partir de Windows 10 <strong> Démarrer </strong> menu <img src=\"images/image_thumb2_thumb_thumb-340.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Programmes </strong> , aller à <strong> Suite </strong> &gt; <strong> Exécuter en tant qu&#39;administrateur. </strong></p> <p><img src=\"images/image_thumb-77-661.png\" alt=\"FIX: Unable to Enable or Disable Add-in \" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Lorsqu&#39;on vous demande d&#39;autoriser cette application à apporter des modifications à votre appareil, choisissez <strong> Oui. </strong></p> <p><img src=\"images/image_thumb-78-120.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Après avoir ouvert l&#39;application Office, désactivez ou activez le complément souhaité. Cette fois, le complément sera supprimé sans problème. </p> <p> C&#39;est ça! Faites-moi savoir si ce guide vous a aidé en laissant votre commentaire sur votre expérience. Aimez et partagez ce guide pour aider les autres. </p>"}