{"title":"CORRECTIF : lecteurs affichés deux fois dans le volet de navigation de Windows 10 (résolu)","content":"<p> Dans ce didacticiel, vous trouverez des instructions pour résoudre le problème étrange suivant dans Windows 10 : Les lecteurs s&#39;affichent deux fois dans le volet de navigation. L&#39;apparence en double des lecteurs dans le volet de navigation est une nouvelle fonctionnalité de Windows 10, qui aide l&#39;utilisateur à explorer facilement le contenu de le lecteur connecté, sans avoir à développer le menu &quot;Ce PC&quot;. Mais cette fonctionnalité devient ennuyeuse, car si vous utilisez pour garder le menu &quot;Ce PC&quot; ouvert, le même lecteur s&#39;affiche deux fois dans le volet de navigation. </p> <p><img src=\"images/image_thumb-22-749.png\" alt=\"Drives Displayed Twice in Navigation Pane of Windows 10\" loading=\"lazy\"></p> <p> Si vous voyez des entrées en double de vos lecteurs USB connectés ou des lecteurs fixes dans Windows 10, suivez les instructions ci-dessous pour résoudre le problème. </p> <h4> Comment supprimer les lettres de lecteur en double dans l&#39;explorateur Windows 10 (menu de navigation). </h4> <p> Pour empêcher Windows 10 d&#39;afficher deux fois un lecteur attaché ou fixe, appliquez le réglage de registre suivant : </p> <p> 1. Ouvrez l&#39;Éditeur du Registre. pour faire ça: </p> <blockquote><p> 1. Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-493.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Dans la zone de recherche, saisissez <strong> regedit </strong> et appuyez sur <strong> Entrer </strong> pour lancer l&#39;éditeur de registre. </p></blockquote> <p><img src=\"images/image_thumb7-138.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Accédez ensuite à cette clé de registre : </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Desktop\\NameSpace\\DelegateFolders </li> </ul> <p> 3. Puis faites un clic droit et supprimez le <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> clé. </p> <p><img src=\"images/image_thumb-23-428.png\" alt=\"remove duplicate drive entries windows 10 navigation pane\" loading=\"lazy\"></p> <p> </p> <p> 4. Naviguez ensuite jusqu&#39;à cette clé : * </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Desktop\\NameSpace\\DelegateFolders </li> </ul> <p> 5. Supprimez le <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> clé. </p> <p> 6. Fermez l&#39;Éditeur du Registre. </p> <p> * Remarque : Si vous ne voyez pas la clé &quot;WOW6432Node&quot;, ignorez les étapes 4 et 5 ci-dessus, car elles ne s&#39;appliquent qu&#39;aux versions 64 bits de Windows 10. </p> <p><strong> ASTUCE: </strong> Si vous modifiez votre décision à l&#39;avenir, faites un clic droit sur « DelegateFolders » aux emplacements de registre ci-dessus, sélectionnez <strong> Nouveau </strong> -&gt; <strong> Clé </strong> , et recréez le fichier supprimé <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> clés). </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}