{"title":"CORRECTIF : cet appareil ne peut pas utiliser un module de plate-forme de confiance dans BitLocker. (Résolu)","content":"<p> Sur un ordinateur Windows 10 Pro ou Enterprise, l&#39;erreur suivante peut apparaître lorsque vous essayez de <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> activer le chiffrement de lecteur BitLocker sur le lecteur du système d&#39;exploitation </a> : &quot;Cet appareil ne peut pas utiliser un module de plate-forme sécurisée. Votre administrateur doit définir l&#39;option &quot;Autoriser BitLocker sans TPM compatible&quot; dans la stratégie &quot;Exiger une authentification supplémentaire au démarrage&quot; pour les volumes du système d&#39;exploitation&quot;. </p> <p><img src=\"images/image_thumb-30-150.png\" alt=\"This device can't use a Trusted Platform Module in BitLocker\" loading=\"lazy\"></p> <p> Ce didacticiel contient des instructions pour résoudre l&#39;erreur BitLocker suivante : « Cet appareil ne peut pas utiliser un module de plate-forme sécurisée… » sur Windows 10 Pro et Enterprise Editions. </p> <h4> Comment résoudre le problème : &quot;Cet appareil ne peut pas utiliser un module de plate-forme de confiance&quot; dans Bit Locker. </h4> <p> BitLocker offre la meilleure protection lorsqu&#39;il est utilisé avec un module de plateforme sécurisée (TPM) version 1.2 ou ultérieure. Si vous possédez un ordinateur qui n&#39;a pas de module TPM, vous devez désactiver l&#39;exigence TPM pour BitLocker dans la stratégie de groupe. Pour faire ça: </p> <p> 1. Appuyez simultanément sur Windows <img src=\"images/image_thumb36-579.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez <strong> gpedit.msc </strong> &amp; Presse <strong> Entrer. </strong></p> <p><img src=\"images/image_thumb-78-692.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Dans le volet de gauche, accédez à : </p> <ul> <li><strong> Configuration de l&#39;ordinateur\\Modèles d&#39;administration\\Composants Windows\\Chiffrement de lecteur BitLocker\\Lecteurs du système d&#39;exploitation </strong></li> </ul> <p> 4. Cliquez ensuite sur <strong> Exiger une authentification supplémentaire au démarrage </strong> sur le volet de droite. </p> <p><img src=\"images/image_thumb-31-186.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Cliquez sur <strong> Activée </strong> puis vérifiez le <strong> Autoriser BitLocker sans TPM compatible </strong> case à cocher. <strong><br> </strong> 6. Cliquez sur <strong> d&#39;accord </strong> et <strong> Fermer </strong> l&#39;éditeur de stratégie de groupe. </p> <p><img src=\"images/image_thumb-32-380.png\" alt=\"Allow BitLocker without compatible Trusted Platform Module\" loading=\"lazy\"></p> <p> </p> <p> 7. Vous avez terminé ! Procédez à l&#39;activation de la protection BitLocker sur le lecteur du système d&#39;exploitation, sans aucun problème. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}