{"title":"CORRECTIF : Outlook 0x80042112 – Réception d&#39;une erreur signalée (résolu)","content":"<p> Outlook 0x80042112 La réception d&#39;une erreur signalée se produit généralement lorsqu&#39;Outlook essaie de recevoir des e-mails de très grande taille (par exemple, des e-mails avec des pièces jointes volumineuses). Dans ce cas, Outlook affiche l&#39;erreur suivante lors de la « Progression de l&#39;envoi/de la réception » : « Task &#39;%Email-Account% – Réception&#39; a signalé l&#39;erreur (0x80042112) : &#39;Les messages électroniques suivants sur le serveur de messagerie ne peuvent pas être téléchargés. Contactez votre fournisseur d&#39;accès Internet (FAI) ou votre administrateur de messagerie si vous continuez à recevoir cette erreur.&quot; </p> <p><img src=\"images/image_thumb-7-121.png\" alt=\"FIX: Outlook 0x80042112 Receiving reported error. \" loading=\"lazy\"></p> <p> Ce didacticiel contient des instructions détaillées pour résoudre l&#39;erreur de réception Outlook 0x80042112. </p> <h4> Comment réparer l&#39;erreur 0x80042112. </h4> <h6> Étape 1. Assurez-vous que vous êtes connecté à Internet. </h6> <p> Parfois, l&#39;erreur de réception Outlook 0x80042112, se produit car la connexion Internet est arrêtée. Donc, tout d&#39;abord, vérifiez que votre connexion Internet fonctionne. Pour ce faire, ouvrez votre navigateur Internet et visitez n&#39;importe quel site Web pour vérifier votre connexion. </p> <p> </p> <h6> Étape 2. Supprimez les messages électroniques de la boîte d&#39;envoi. </h6> <p> La deuxième méthode pour résoudre l&#39;erreur 0x80042112 dans Outlook consiste à supprimer ou à déplacer vers les brouillons, tous les e-mails qui ont été bloqués dans la boîte d&#39;envoi. Pour faire ça: </p> <p> 1. Dans Outlook, cliquez sur le <strong> Envoyer recevoir </strong> onglet, puis cliquez sur <strong> Déconnecté de travail </strong> . </p> <p><img src=\"images/image_thumb-8-737.png\" alt=\"Move Outbox Emails to Drafts folder\" loading=\"lazy\"></p> <p> 2. <strong> Redémarrer </strong> Perspectives. <br> 3. Sélectionnez le <strong> Boîte d&#39;envoi </strong> dossier (à gauche), puis appuyez sur <strong> CTRL </strong> + <strong> UNE </strong> pour sélectionner tous les e-mails (à droite). <br> 4. Faites un clic droit sur les e-mails sélectionnés et déplacez-les vers <strong> Brouillons </strong> dossier, en cliquant <strong> Déplacer -&gt; Autre dossier </strong> , puis sélectionnez le <strong> Brouillons </strong> dossier de la liste. </p> <p><img src=\"images/image_thumb-10-352.png\" alt=\"FIX Outlook error 0x80042112\" loading=\"lazy\"></p> <p> </p> <p> 5. Une fois terminé, cliquez sur le bouton <strong> Envoyer recevoir </strong> onglet et cliquez sur <strong> Travaillez en ligne. <br> </strong> 6. <strong> Redémarrer </strong> Outlook et effectuez un envoi/réception. </p> <h6></h6> <h6> Étape 3. Exécutez Outlook sans compléments. </h6> <p> Une autre méthode pour corriger l&#39;erreur Outlook 0x80042112 lors de la réception consiste à démarrer l&#39;application Outlook en mode sans échec et à désactiver tous les compléments susceptibles de provoquer l&#39;erreur. </p> <p> 1. Pour démarrer Outlook en mode sans échec, maintenez le bouton <strong> CTRL </strong> (sur votre clavier), puis double-cliquez sur le raccourci Microsoft Outlook, ou : </p> <blockquote><p> une. Appuyez simultanément sur Windows <img src=\"images/image_thumb36-371.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> b. Taper: <strong> perspectives / coffre-fort </strong> et cliquez <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-14-671.png\" alt=\"outlook safe mode\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. En mode sans échec Outlook, accédez aux options des compléments et <strong> désactiver tous les compléments </strong> . Pour faire ça: </p> <ul> <li> Pour désactiver les compléments dans <strong> Perspectives 2007 </strong> : </li> </ul> <blockquote><p> 1. <strong> Au </strong> les <strong> Outils </strong> menu, cliquez sur <strong> Centre de confiance. </strong><br> 2. Sélectionnez <strong> Compléments </strong> sur le volet de gauche. <br> 3. Dans le volet de droite, sélectionnez <strong> Compléments COM </strong> et cliquez <strong> Va… <br> </strong> 4. <strong> Décocher </strong> toutes les cases à cocher, pour désactiver tous les compléments et cliquez sur <strong> D&#39;ACCORD. </strong></p></blockquote> <ul> <li> Pour désactiver les compléments dans <strong> Perspectives 2016, 2013 </strong> ou alors <strong> 2010 </strong> : </li> </ul> <blockquote><p> 1. Cliquez sur le <strong> Déposer </strong> menu et sélectionnez <strong> Options </strong> . <br> 2. Sélectionnez <strong> Compléments sur </strong> le volet de gauche. <br> 3. Dans le volet de droite, sélectionnez <strong> Compléments COM </strong> et cliquez <strong> Va… </strong></p></blockquote> <p><img src=\"images/image_thumb-20-411.png\" alt=\"disable outlook add-ins\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. <strong> Décocher </strong> <strong> tout </strong> les cases à cocher et cliquez sur <strong> d&#39;accord </strong> pour désactiver tous les compléments. </p> <p><strong><img src=\"images/image_thumb-21-683.png\" alt=\"turn off outlook add-ins\" loading=\"lazy\"><strong><br> </strong></strong></p> </blockquote> <p> 3. <strong> Redémarrer </strong> Perspectives. <br> 4. Essayez d&#39;envoyer/recevoir. Si la progression de l&#39;envoi/de la réception se termine normalement et sans afficher l&#39;erreur 0x80042112, continuez et réactivez un par un tous les plugins désactivés et redémarrez Outlook, jusqu&#39;à ce que vous trouviez celui qui cause le problème. </p> <p> </p> <h6> Étape 4. Vérifiez vos paramètres antivirus et pare-feu. </h6> <p> Si vous utilisez un programme antivirus avec des fonctionnalités d&#39;analyse des e-mails, désactivez le complément antivirus dans Outlook (voir les instructions à l&#39;étape 3 ci-dessus), ou désactivez temporairement la protection antivirus ou désinstallez le programme antivirus. De plus, vérifiez vos paramètres de pare-feu et assurez-vous que les ports du serveur de messagerie que vous utilisez ne sont pas bloqués par le programme de pare-feu. Plus précisément, dans les paramètres de votre pare-feu : </p> <p> A. Activez les fichiers suivants pour accéder à Internet : </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Activez les ports suivants dans le pare-feu : </p> <ul> <li><strong> Port 110 </strong> (Si vous utilisez un serveur de messagerie entrant POP3 sans connexion cryptée) * </li> <li><strong> Port 995 </strong> (Si vous utilisez un serveur de messagerie entrant POP3 avec une connexion cryptée (SSL activé) </li> </ul> <ul> <li><strong> Port 143 </strong> (si vous utilisez un serveur de messagerie entrant IMAP sans connexion cryptée) </li> <li><strong> Port 993 </strong> (si vous utilisez un serveur de messagerie entrant IMAP avec une connexion cryptée (SSL activé) </li> </ul> <ul> <li><strong> Port 25 </strong> Si votre serveur de courrier sortant SMTP n&#39;utilise pas SSL. * </li> <li><strong> Port 465 </strong> ou alors <strong> 587 </strong> si votre serveur de courrier sortant SMTP utilise SSL </li> </ul> <p> * Remarque : par défaut, le port 25 est pour l&#39;accès sortant et le port 110 est pour l&#39;accès entrant. Si vous n&#39;êtes pas sûr des ports, contactez votre FAI ou votre administrateur système. </p> <p> </p> <h6> Étape 5. Réparez le fichier de données Outlook PST. </h6> <p> L&#39;étape suivante pour corriger l&#39;erreur 0x80042112 signalée par Outlook Recipient consiste à exécuter l&#39;outil de réparation de la boîte de réception pour réparer votre fichier .pst. Les instructions détaillées pour le faire peuvent être trouvées dans ce tutoriel: <a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment réparer le fichier de données Outlook PST </a> . </p> <p> </p> <h6> Étape 6. Vérifiez la taille du ou des messages électroniques à partir du WEB. </h6> <p> Si vous avez accès à votre compte de messagerie sur le Web, connectez-vous à votre compte de messagerie à l&#39;aide de votre navigateur Web et vérifiez si la taille d&#39;un e-mail est le problème. Par exemple, si vous trouvez un e-mail volumineux dans votre boîte de réception, téléchargez ses pièces jointes, puis supprimez cet e-mail. * </p> <p> * Remarque : Si vous n&#39;avez pas accès à votre compte de messagerie via le Web, contactez votre fournisseur de messagerie pour signaler le problème. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}