{"title":"CORRECTIF : aucun son des haut-parleurs internes sur l&#39;ordinateur portable HP OMEN (résolu)","content":"<p> Ce didacticiel contient des instructions étape par étape pour résoudre le problème &quot;pas de son des haut-parleurs internes&quot;, sur un <a href=\"https://support.hp.com/ph-en/document/c05576170\" target=\"_blank\" rel=\"nofollow noopener\"> Ordinateur portable Omen par HP – 17-an009nv </a> . Le problème &quot;pas de son des haut-parleurs de l&#39;ordinateur portable&quot; peut survenir sur n&#39;importe quel modèle d&#39;ordinateur portable HP et se produit généralement après l&#39;installation d&#39;une mise à jour du pilote Windows pour le périphérique Realtek High Definition Audio. </p> <p> Problème en détails : sur un ordinateur portable HP exécutant Windows 10, aucun son ne sort des haut-parleurs internes lors de la lecture de musique ou de vidéo, mais les haut-parleurs fonctionnent normalement lors de l&#39;exécution des tests de diagnostic HP en dehors du système d&#39;exploitation. De plus, le problème &quot;pas de son&quot; ne se produit qu&#39;avec les haut-parleurs de l&#39;ordinateur portable, et non avec les haut-parleurs externes ou les écouteurs. </p> <h4> Comment réparer : les haut-parleurs de l&#39;ordinateur portable n&#39;ont pas de son sous Windows 10. </h4> <h6> Étape 1. Augmentez le volume sonore </h6> <p> 1. <strong> Clic-droit </strong> au <strong> icône du son </strong><img src=\"images/image_thumb-11-503.png\" alt=\"image\" loading=\"lazy\"> dans la barre des tâches et sélectionnez <strong> Ouvrez le mélangeur de volume. </strong></p> <p><img src=\"images/image_thumb-12-807.png\" alt=\"Open Volume Mixer\" loading=\"lazy\"></p> <p> 2. Faites glisser le curseur Haut-parleurs vers le <strong> Haut </strong> et vérifiez si vous entendez le son. </p> <p><img src=\"images/image_thumb-13-813.png\" alt=\"Adjust Sound Volume\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Étape 2. Définissez les haut-parleurs comme périphérique de lecture par défaut. </h6> <p> 1. Accédez à Windows <strong> Panneau de commande </strong> et ouvrir <strong> Sonner. </strong></p> <p><img src=\"images/image_thumb-14-315.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Assurez-vous que <strong> Haut-parleurs </strong> est le <strong> Défaut </strong> périphérique de lecture, sinon sélectionnez les haut-parleurs et cliquez sur le <strong> Définir par defaut </strong> bouton. Une fois terminé, testez vos haut-parleurs et si le problème persiste, passez à l&#39;étape suivante. </p> <p><img src=\"images/image_thumb-15-993.png\" alt=\"Set Speakers as Default Playback Device\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Étape 3. Testez les haut-parleurs internes en dehors de Windows. </h6> <p> L&#39;étape suivante pour résoudre le problème &quot;pas de son sur les haut-parleurs internes&quot; sur votre ordinateur portable consiste à tester si les haut-parleurs fonctionnent, lors de l&#39;exécution des tests de diagnostic matériel HP. Pour faire ça: </p> <p> 1. <strong> Éteindre </strong> ton ordinateur portable. <br> 2. Allumez votre ordinateur portable et appuyez immédiatement sur le <strong> ESC </strong> clé à plusieurs reprises. <br> 3. Lorsque le menu apparaît, appuyez sur la <strong> F2 </strong> clé. <br> 4. Dans le menu principal, cliquez sur <strong> Tests de composants </strong> puis cliquez sur <strong> L&#39;AUDIO. <br> </strong> 5. Si vous entendez du son dans les haut-parleurs pendant les tests audio, passez à l&#39;étape 3 ci-dessous. * </p> <p><strong> * Noter: </strong> Si vous n&#39;entendez pas le son des haut-parleurs, arrêtez-vous ici car il y a un problème matériel qui ne peut être résolu que par un technicien spécialisé en ordinateurs portables (service). </p> <p><img src=\"images/image_thumb-22-211.png\" alt=\"HP Diagnostics - Component Test\" loading=\"lazy\"></p> <p> </p> <h6><br clear=\"all\"> Étape 4. Restaurez le pilote de la carte son. </h6> <p> 1. Ouvrir <strong> Gestionnaire de périphériques </strong> . Pour faire ça: </p> <blockquote><p> 1. Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-958.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Dans la case &quot;Ouvrir&quot;, saisissez : <strong> devmgmt.msc </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-5-510.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Développer </strong> les <strong> Contrôleurs son, vidéo et jeu. </strong></p> <p> 3. <strong> Clic-droit </strong> sur le <strong> Realtek High Definition Audio </strong> appareil et sélectionnez <strong> Propriétés. </strong></p> <p><img src=\"images/image_thumb-17-678.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. Dans l&#39;onglet Pilote, cliquez sur <strong> Faire reculer le pilote </strong> bouton. <strong> * </strong></p> <p><strong> * Noter: </strong> Si le bouton Restaurer le pilote est inactif, passez à l&#39;étape suivante. </p> <p><img src=\"images/image_thumb-18-178.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> </p> <p> 5. Sélectionnez une raison pour la restauration du package de pilotes et cliquez sur <strong> Oui. </strong></p> <p><img src=\"images/image_thumb-19-167.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Lorsque la restauration du pilote est terminée, <strong> redémarrer </strong> ton ordinateur. <br> 5. Après le redémarrage, continuez et testez le son des haut-parleurs de l&#39;ordinateur portable. Si vous ne pouvez toujours pas entendre le son des haut-parleurs de votre ordinateur portable, passez à l&#39;étape suivante. </p> <p> </p> <h6><br clear=\"all\"> Étape 5. Changez le pilote de la carte son. </h6> <p> 1. Ouvrir <strong> Gestionnaire de périphériques. </strong><br> 2. <strong> Développer </strong> les <strong> Contrôleurs son, vidéo et jeu. <br> </strong> 3. <strong> Clic-droit </strong> à <strong> Realtek High Definition Audio </strong> appareil, {ou au <strong> &#39;Audio haute définition Realtek (SST) </strong> appareil}, puis sélectionnez <strong> Mettre à jour le pilote. <br> </strong></p> <p><img src=\"images/image_thumb-6-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Sélectionnez <strong> Parcourir mon ordinateur pour les pilotes. </strong></p> <p><img src=\"images/image_thumb-7-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Sélectionnez <strong> Laissez-moi choisir parmi une liste de pilotes disponibles sur mon ordinateur </strong> . </p> <p><img src=\"images/image_thumb-8-771.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> </p> <p> 6. A l&#39;écran suivant, appliquez l&#39;une des actions suivantes, selon votre cas : </p> <p><strong> Cas A. </strong> Si dans la case « Afficher le matériel compatible », vous voyez les périphériques « Périphérique audio haute définition » et « Audio haute définition Realtek », puis sélectionnez le <strong> Périphérique audio haute définition </strong> et cliquez <strong> Suivant. </strong></p> <p><img src=\"images/image_thumb-20-130.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p><strong> Cas B. </strong> Si dans la case « Afficher le matériel compatible », vous ne voyez que le <strong> &#39;Audio haute définition Realtek (SST) </strong> l&#39;appareil, puis : </p> <blockquote><p> une. <strong> Décocher </strong> les <strong> Afficher la case à cocher du matériel compatible. </strong></p></blockquote> <p><img src=\"images/image_thumb-9-565.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Sélectionnez le <strong> Realtek High Definition Audio </strong> pilote et cliquez sur <strong> Suivant. </strong></p></blockquote> <p><img src=\"images/image_thumb-10-248.png\" alt=\"FIX No Sound from Internal Speakers on Laptop\" loading=\"lazy\"></p> <p> </p> <p> 8. Une fois l&#39;installation du pilote terminée, <strong> redémarrer </strong> ton ordinateur. <br> 9. Après le redémarrage, continuez et testez le son des haut-parleurs de l&#39;ordinateur portable. </p> <p> </p> <h6><br clear=\"all\"> Étape 6. Désinstallez et réinstallez le pilote de la carte son. </h6> <p> 1. Ouvrir <strong> Gestionnaire de périphériques. </strong><br> 2. <strong> Développer </strong> les <strong> Contrôleurs son, vidéo et jeu. <br> </strong> 3. <strong> Clic-droit </strong> à <strong> Realtek High Definition Audio </strong> appareil et sélectionnez <strong> Désinstaller l&#39;appareil. </strong></p> <p><img src=\"images/image_thumb-21-889.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. Après la désinstallation, <strong> redémarrer </strong> votre ordinateur et laissez Windows installer les pilotes audio automatiquement. Si cela ne se produit pas, accédez à <strong> Paramètres </strong> &gt; <strong> Mise à jour et sécurité </strong> et forcer Windows à <strong> Vérifiez les mises à jour, </strong> ou passez à l&#39;étape 7 ci-dessous. </p> <p> </p> <h6><br clear=\"all\"> Étape 7. Mettez à jour les pilotes de la carte son. </h6> <p> Accédez au site d&#39;assistance du fabricant de votre ordinateur portable et téléchargez et installez le dernier pilote pour votre carte son. Si vous ne trouvez pas de pilote pour la carte son sur le site d&#39;assistance du fabricant, ou si vous rencontrez toujours le problème &quot;pas de son des haut-parleurs internes&quot; après l&#39;installation du nouveau pilote, essayez ce qui suit si vous possédez un périphérique Realtek HD Audio. </p> <p> 1. Lisez les instructions à ce sujet <a href=\"https://www.repairwin.com/how-to-download-realtek-audio-manager-realtek-audio-drivers-windows-10-8-1-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> article </strong></a> à <strong> Télécharger </strong> les <strong> Pilote audio Realtek HD v2.82. <br> </strong> 2. Après le téléchargement, continuez et <strong> installer </strong> les <strong> Pilote audio Realtek HD. <br> </strong> 3. Après l&#39;installation <strong> redémarrer </strong> votre PC et testez le son des haut-parleurs. * </p> <p><strong> Remarque finale : </strong> Si le problème de son des haut-parleurs persiste, regardez dans le Gestionnaire de périphériques et si le périphérique audio est répertorié comme &quot; Realtek High Definition Audio (SST)&quot;, suivez les instructions de l&#39;étape 5 ci-dessus et modifiez le &quot; Realtek High Definition Audio (SST) &quot; vers &quot; Realtek High Definition Audio &quot;. </p> <p> C&#39;est tout les gens ! Quelle méthode a fonctionné pour vous ? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}