{"title":"Comment bloquer des sites Web sur Chrome ou Firefox.","content":"<p> Si vous cherchez un moyen simple de bloquer un site Web sur Chrome ou Firefox, continuez à lire ci-dessous. </p> <p> Bien qu&#39;Internet pour la plupart d&#39;entre nous soit devenu nécessaire dans notre vie quotidienne pour notre travail ou nos loisirs, en revanche il est parfois utile de pouvoir bloquer certains sites pour éviter les distractions. Par exemple, personne ne veut que son enfant soit distrait en regardant des vidéos sur YouTube lorsqu&#39;il lit ses cours. </p> <p> Dans ce guide, vous apprendrez comment bloquer des sites Web dans Chrome et <a href=\"#firefox\" target=\"_blank\" rel=\"nofollow noopener\"> Firefox </a> navigateurs. </p> <p> * Remarque : Si vous souhaitez bloquer un site Web dans tous les navigateurs, lisez cet article : <a href=\"https://www.repairwin.com/block-youtube-on-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment bloquer YouTube sur Windows 10. </a></p> <h2> Comment bloquer des sites Web sur Google Chrome. </h2> <p> Le moyen le plus simple de bloquer un site Web dans Chrome est d&#39;utiliser la célèbre extension BlockSite. L&#39;installation du module complémentaire BlockSite est similaire à celle de toute autre extension. </p> <p> 1. Accédez à <a href=\"https://chrome.google.com/webstore/detail/blocksite-stay-focused-co/eiimnmioipafcokbfikbljfdeojpcgbh\" target=\"_blank\" rel=\"nofollow noopener\"> Extension BlockSite </a> dans la boutique en ligne Chrome et cliquez sur le bouton <strong> Ajouter à Chrome </strong> bouton. </p> <p><img src=\"images/image_thumb-4-439.png\" alt=\"how to block websites chrome\" loading=\"lazy\"></p> <p> 2. Lorsque vous y êtes invité, cliquez sur <strong> Ajouter une extension </strong> . </p> <p><img src=\"images/image_thumb-5-782.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Une fois l&#39;installation terminée, accédez au menu Chrome &gt; Plus d&#39;outils &gt; Extensions. </p> <p><img src=\"images/image_thumb-6-830.png\" alt=\"chrome tools extensions\" loading=\"lazy\"></p> <p> 4. Trouvez le <strong> Bloquer le site </strong> extension et cliquez sur <strong> Des détails. </strong></p> <p><img src=\"images/image_thumb-7-415.png\" alt=\"Blocksite details\" loading=\"lazy\"></p> <p> 5. <strong> Ouvert </strong> les <strong> Possibilités d&#39;extension </strong> . </p> <p><img src=\"images/image_thumb-8-135.png\" alt=\"How to Block sites chrome\" loading=\"lazy\"></p> <p> 6. Tapez le nom du site que vous souhaitez bloquer (par ex. <a href=\"http://www.youtube.com\" target=\"_blank\" rel=\"nofollow noopener\"> www.youtube.com </a> ) et appuyez sur le signe plus (+) pour ajouter le site Web à la liste des sites bloqués. </p> <p><img src=\"images/image_thumb-9-298.png\" alt=\"blocked sites chrome\" loading=\"lazy\"></p> <p> 7. C&#39;est tout ! Désormais, lorsque vous essayez de visiter le site bloqué, vous serez informé que le site est bloqué avec l&#39;extension BlockSite. Pour modifier la liste des sites bloqués, cliquez sur <strong> Modifier votre liste </strong> pour apporter les modifications souhaitées ou pour supprimer le site bloqué de la liste. </p> <p><img src=\"images/image_thumb-10-951.png\" alt=\"image\" loading=\"lazy\"></p> <h3> Comment protéger par mot de passe les sites bloqués dans l&#39;extension BlockSite. </h3> <p> Si vous souhaitez empêcher les utilisateurs de débloquer un site bloqué : </p> <p> 1. Ouvrez le <strong> Bloquer le site </strong> possibilité d&#39;extension. <br> 2. Accédez à <strong> Mot de passe de protection </strong> Les paramètres. <br> 3. <strong> Activer </strong> l&#39;option Protéger <strong> vos options BlockSite préférées et la page d&#39;extension Chrome avec un mot de passe </strong> puis tapez votre email et un mot de passe et cliquez sur <strong> Sauvegarder. </strong></p> <p><img src=\"images/image_thumb-11-711.png\" alt=\"password protect blocked sites\" loading=\"lazy\"></p> <p> 4. BlockSite vous enverra un e-mail avec un lien pour vérifier votre adresse e-mail. Après vérification par e-mail, la protection par mot de passe sera active. </p> <h2> Comment bloquer des sites Web dans Mozilla Firefox. </h2> <p> 1. Accédez à <a href=\"https://addons.mozilla.org/en-US/firefox/addon/blocksite/\" target=\"_blank\" rel=\"nofollow noopener\"> Extension BlockSite </a> dans les modules complémentaires de Firefox. <br> 2. Cliquez sur le <strong> Ajouter à Firefox </strong> bouton. </p> <p><img src=\"images/image_thumb-12-999.png\" alt=\"block websites firefox\" loading=\"lazy\"></p> <p> 2. Lorsque vous êtes invité à autoriser l&#39;installation de l&#39;extension, cliquez sur <strong> Ajouter. </strong></p> <p><img src=\"images/image_thumb-13-588.png\" alt=\"Blocksite firefox\" loading=\"lazy\"></p> <p> 3. Une fois l&#39;installation terminée, choisissez si vous souhaitez bloquer les sites Web dans les fenêtres privées (incognito) et cliquez sur <strong> D&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-14-173.png\" alt=\"how to block site\" loading=\"lazy\"></p> <p> 4. Si vous souhaitez empêcher l&#39;extension BlockSite de lire les données sur les sites que vous visitez, cliquez sur Peut-être la lettre. </p> <p><img src=\"images/image_thumb-15-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Cliquez maintenant sur l&#39;icône BlockSite et <strong> Modifier la liste de blocage </strong> pour spécifier les sites Web que vous souhaitez bloquer. </p> <p><img src=\"images/image_thumb-16-657.png\" alt=\"block sites firefox\" loading=\"lazy\"></p> <p> 6. Dans l&#39;onglet Bloquer les sites, saisissez le nom du site que vous souhaitez bloquer (par exemple, &quot;facebook.com&quot;), puis ajoutez-le à la liste des sites Web bloqués. </p> <p><img src=\"images/image_thumb-17-817.png\" alt=\"How to block site Firefox\" loading=\"lazy\"></p> <p> 7. Une fois que vous avez ajouté les sites que vous souhaitez bloquer, fermez les paramètres BlockSite et vous avez terminé. </p> <p> En plus de sa fonction principale, l&#39;extension BlockSite possède également d&#39;autres fonctions utiles telles que : </p> <ul> <li> <p><strong> Mode de mise au point </strong> : Bloquer des sites pendant une durée spécifique (par exemple 25 minutes) </p> </li> <li> <p><strong> Mot de passe de protection: </strong> Protégez vos paramètres BlockSite contre toute modification. </p> </li> <li> <p><strong> Bloquer par mots : </strong> Bloquer les URL contenant des mots spécifiques. </p> </li> </ul> <p> C&#39;est tout les gens ! Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}