{"title":"CORRECTIF : Adobe Acrobat Reader DC version plus récente déjà installé – Erreur 1722 (résolu)","content":"<p> Le problème suivant a été rencontré sur un ordinateur Windows : Adobe Acrobat Reader DC ne s&#39;installe pas car « Une version plus récente est déjà installée ». L&#39;étrange avec ce problème, c&#39;est qu&#39;Adobe Reader DC n&#39;a pas été installé sur la machine, car il n&#39;existe aucune trace du programme ou des fichiers Adobe Reader ni sur Ajout/Suppression de programmes ni sur le disque dur. </p> <p><img src=\"images/image_thumb-19-522.png\" alt=\"Adobe Acrobat Reader DC Newer Version already installed – Error 1722 - fix\" loading=\"lazy\"></p> <p> </p> <p> De plus, lors du dépannage du problème d&#39;installation &quot;une nouvelle version déjà installée&quot; du programme Adobe Reader DC, le message d&#39;erreur suivant s&#39;est produit lors de la tentative d&#39;installation du programme à l&#39;aide du <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Pack de distribution Adobe Acrobat Reader DC </a> : &quot;Erreur 1722. Il y a un problème avec ce package Windows Installer. Un programme exécuté dans le cadre de l&#39;installation ne s&#39;est pas terminé comme prévu. Contactez votre support technique ou le fournisseur du package….&quot; </p> <p><img src=\"images/image_thumb-20-398.png\" alt=\"Acrobat reader Error 1722 There is a problem with this Windows Installer package\" loading=\"lazy\"></p> <p> </p> <p> Ce didacticiel contient des étapes et des instructions détaillées pour résoudre les erreurs suivantes lors de l&#39;installation d&#39;Adobe Reader DC : &quot;Une nouvelle version déjà installée&quot; et &quot;Erreur 1722. Il y a un problème avec ce package Windows Installer&quot; dans le système d&#39;exploitation Windows 10/8/7. </p> <h4> Comment RÉSOUDRE les problèmes d&#39;installation d&#39;Adobe Acrobat Reader DC : Version plus récente déjà installée - Erreur 1722 Problème avec le package d&#39;installation. </h4> <h6> Méthode 1. Supprimez les produits Adobe Acrobat avec Acrobat Cleaner Tool. </h6> <p> La première étape pour résoudre les problèmes d&#39;installation d&#39;Adobe Reader DC consiste à supprimer toutes les installations précédentes d&#39;Adobe Acrobat et d&#39;Adobe Reader, en utilisant le <a href=\"https://labs.adobe.com/downloads/acrobatcleaner.html\" target=\"_blank\" rel=\"nofollow noopener\"> Utilitaire de nettoyage Acrobat Reader DC et Adobe Acrobat DC </a> * puis à installer <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> Adobe Reader DC </a> . </p> <p> * L&#39;outil Adobe Reader et Acrobat Cleaner est conçu pour nettoyer les installations corrompues d&#39;Adobe Acrobat et d&#39;Adobe Reader, notamment en supprimant ou en corrigeant les fichiers corrompus, en supprimant ou en modifiant les entrées de registre des autorisations, etc. </p> <p><img src=\"images/image_thumb-21-370.png\" alt=\"Acrobat Reader DC & Adobe Acrobat DC Cleanup tool\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Méthode 2. Exécutez l&#39;utilitaire de résolution des problèmes d&#39;installation et de désinstallation du programme de Microsoft. </h6> <p> 1. Téléchargez le <a href=\"https://support.microsoft.com/en-us/help/17588/fix-problems-that-block-programs-from-being-installed-or-removed\" target=\"_blank\" rel=\"nofollow noopener\"> Dépannage d&#39;installation et de désinstallation de programmes </a> de Microsoft. <br> 2. Exécutez le programme téléchargé et cliquez sur Suivant dans le premier écran. <br> 3. Lorsque vous y êtes invité, cliquez sur <strong> Désinstallation </strong></p> <p><img src=\"images/image_thumb-22-965.png\" alt=\"Program Install & Uninstall Troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 4. Sélectionnez le <strong> Adobe Acrobat Reader DC </strong> programme et sélectionnez <strong> Suivant </strong> .* Suivez ensuite les instructions à l&#39;écran pour résoudre le problème. </p> <p> * Remarque : si vous ne voyez pas le logiciel « Adobe Acrobat Reader DC » dans la liste, cliquez sur <strong> Annuler </strong> et exécutez à nouveau l&#39;utilitaire de résolution des problèmes. Mais, cette fois, choisissez &quot;Installation&quot; lorsque vous y êtes invité. </p> <p><img src=\"images/image_thumb-23-917.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Méthode 3. Installez Adobe Reader à l&#39;aide du package d&#39;installation complet d&#39;Acrobat Reader DC. </h6> <p> Essayez d&#39;installer Adobe Reader DC en utilisant le <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Pack de distribution Adobe Acrobat Reader DC </a> . </p> <p> </p> <h6> Méthode 4. Démarrez le service Windows Installer. </h6> <p> 1. Ouvrez le panneau de configuration des services Windows : Pour ce faire : </p> <ul> <li> Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-698.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. </li> <li> Dans la zone de recherche, saisissez : <strong> services.msc </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </li> <li> (Acceptez l&#39;avertissement UAC s&#39;il apparaît). </li> </ul> <p><img src=\"images/image_thumb-12-635.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. Dans le panneau de configuration des services, faites un clic droit sur <strong> Windows Installer </strong> service et cliquez sur <strong> Démarrer </strong> . * </p> <p> * Remarque : Si le service est démarré, cliquez sur <strong> Redémarrer </strong> . </p> <p><img src=\"images/image_thumb-24-258.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Méthode 5. Réenregistrez le service Windows Installer. </h6> <p> 1. Ouvrir <strong> Invite de commandes en tant qu&#39;administrateur. <br> </strong> 2. Tapez les commandes suivantes dans l&#39;ordre (appuyez sur Entrée après avoir tapé chaque commande) </p> <ul> <li><strong> msiexec /désinscrire </strong></li> <li><strong> msiexec /regserver </strong></li> </ul> <p><img src=\"images/image_thumb-25-162.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Fermez la fenêtre d&#39;invite de commande et <strong> redémarrer </strong> ton ordinateur. <br> 4. Essayez d&#39;installer Acrobat Reader DC. </p> <p> </p> <h6> Méthode 6. Installez les mises à jour Windows et Visual C++. </h6> <p> 1. Installez toutes les mises à jour Windows disponibles. <br> 2. Installez les versions x86 et x64 du <a href=\"https://www.microsoft.com/en-in/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Packages redistribuables Visual C++ pour Visual Studio 2013 </a><br> 3. Installez les versions x86 et x64 du <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48145\" target=\"_blank\" rel=\"nofollow noopener\"> Packages redistribuables Visual C++ pour Visual Studio 2015 </a><br> 4. Essayez d&#39;installer Acrobat Reader DC. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}