{"title":"Comment changer la connexion de l&#39;imprimante HP d&#39;USB à sans fil.","content":"<p> Si vous possédez une imprimante HP compatible sans fil, connectée via un câble USB et que vous souhaitez modifier sa connexion en sans fil, lisez ce didacticiel pour accomplir cette tâche. Les instructions sont utiles si vous n&#39;avez pas de routeur compatible WPS ou si vous souhaitez reconfigurer les paramètres sans fil de l&#39;imprimante, au cas où vous auriez changé de routeur sans fil. </p> <h4> Comment connecter une imprimante connectée par USB au réseau sans fil. </h4> <p> 1. Depuis le panneau de l&#39;imprimante, appuyez sur le bouton Sans fil <img src=\"images/image_thumb-55-307.png\" alt=\"image\" loading=\"lazy\"> pour activer le sans fil. * </p> <p> * Remarque : si vous avez déjà connecté votre imprimante à un autre réseau sans fil, maintenez le bouton <strong> Sans fil </strong> bouton <img src=\"images/image_thumb-57-212.png\" alt=\"image\" loading=\"lazy\"> et le <strong> Annuler </strong> bouton <strong> X </strong> depuis le panneau de commande de l&#39;imprimante, pour restaurer les paramètres du réseau sans fil par défaut. (Cette procédure fonctionne sur la plupart des modèles d&#39;imprimantes HP. Veuillez vous assurer dans le manuel de votre imprimante que le processus de réinitialisation est correct.) </p> <p> 2. Connectez votre imprimante à votre ordinateur à l&#39;aide d&#39;un câble USB. </p> <p> 3. Téléchargez et installez les derniers logiciels et pilotes complets pour votre imprimante à partir de <a href=\"https://support.hp.com/us-en/drivers/printers\" target=\"_blank\" rel=\"nofollow noopener\"> Site d&#39;assistance pour les imprimantes HP </a> . </p> <p> 4. Après avoir installé le logiciel de l&#39;imprimante, ouvrez l&#39;icône avec le nom de votre imprimante pour lancer le <strong> Assistant d&#39;impression HP </strong> . </p> <p> 5. Cliquez sur <strong> Configuration de l&#39;appareil et logiciel </strong> . </p> <p><img src=\"images/image_thumb-48-818.png\" alt=\" Change HP Printer Connection from USB to Wireless\" loading=\"lazy\"></p> <p> </p> <p> 6. Cliquez sur <strong> Convertir un appareil connecté par USB en sans fil </strong> . </p> <p><img src=\"images/image_thumb-49-582.png\" alt=\"Connect HP Pinter to Wireless Network using the USB Connection\" loading=\"lazy\"></p> <p> </p> <p> 7. Dans Paramètres sans fil, vérifiez que le nom du réseau sans fil (SSID) est correct. Puis… </p> <blockquote><p> 1. Cliquez pour <strong> Afficher le mot de passe sans fil </strong> . </p> <p> 2. Assurez-vous que le mot de passe sans fil est correct (sinon, saisissez votre mot de passe sans fil). </p> <p> 3. Sélectionnez <strong> Oui, je veux utiliser ce réseau </strong> . </p> <p> 4. Cliquez sur <strong> Suivant </strong> . </p></blockquote> <p><img src=\"images/image_thumb-50-641.png\" alt=\"Connect HP Pinter to Wireless using USB\" loading=\"lazy\"></p> <p> </p> <p> 8. Attendez que la configuration sans fil soit terminée. </p> <p><img src=\"images/image_thumb-51-477.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Lorsque vous y êtes invité, cliquez sur <strong> Oui </strong> au partage de périphérique. </p> <p><img src=\"images/image_thumb-52-556.png\" alt=\"Connect HP Pinter to Wireless network using USB\" loading=\"lazy\"></p> <p> </p> <p> 10. Une fois la configuration sans fil terminée, retirez le câble USB et cliquez sur <strong> Suivant </strong> . </p> <p><img src=\"images/image_thumb-58-143.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 11. Cliquez sur <strong> d&#39;accord </strong> pour vérifier le retrait du câble USB. </p> <p><img src=\"images/image_thumb-59-549.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 12. Vous êtes maintenant prêt à utiliser votre imprimante HP sans fil. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}