{"title":"CORRECTIF : Erreur d&#39;activation 0x80072EE7 dans Windows 10. (Résolu)","content":"<p> Si vous recevez l&#39;erreur d&#39;activation 0x80072EE7 lorsque vous essayez d&#39;activer Windows 10, continuez à lire ce didacticiel pour résoudre le problème. L&#39;erreur d&#39;activation &quot; <em> Nous ne pouvons pas activer Windows sur cet appareil car nos serveurs d&#39;activation ne sont pas disponibles pour le moment. Assurez-vous que vous êtes connecté à Internet et nous essaierons automatiquement d&#39;activer Windows lorsque le service sera disponible&quot; avec le code d&#39;erreur : 0x80072EE7, </em> apparaît généralement en raison de problèmes de réseau. </p> <p><img src=\"images/image_thumb-5-942.png\" alt=\"FIX: We can’t activate Windows on this device - Error 0x80072EE7\" loading=\"lazy\"></p> <p> Ce tutoriel contient des instructions pour corriger l&#39;erreur d&#39;activation de Windows 10 0x80072EE7 : &quot;Nous ne pouvons pas activer Windows sur cet appareil car nos serveurs d&#39;activation ne sont pas disponibles pour le moment&quot;. </p> <h4> Comment résoudre l&#39;erreur d&#39;activation de Windows 10 0x80072EE7 </h4> <h6> Étape 1. Assurez-vous que vous êtes connecté à Internet. </h6> <p> Si vous ne pouvez pas activer Windows 10 à cause de l&#39;erreur 0x80072EE7, vérifiez tout d&#39;abord votre connectivité Internet. Pour ce faire, ouvrez votre navigateur Internet et visitez n&#39;importe quel site Web pour vous assurer que votre connexion Internet fonctionne. </p> <p> </p> <h6> Étape 2. Utilisez une clé de produit valide pour Windows 10. </h6> <p> L&#39;erreur d&#39;activation de Windows 10 0x80072EE7 peut apparaître si la clé de produit installée n&#39;est pas valide. Assurez-vous donc d&#39;utiliser une clé de licence valide et légale pour activer Windows 10. La clé de licence doit se rapporter à la version installée de Windows 10 (par exemple Home ou Pro) et doit être saisie correctement. </p> <p> Pour modifier la clé de produit Windows 10, accédez à <strong> Paramètres </strong> &gt; <strong> Mise à jour et sécurité </strong> &gt; <strong> Activation </strong> et cliquez <strong> Changer la clé du produit </strong> . </p> <p><img src=\"images/image_thumb-6-424.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Étape 3. Modifier les paramètres DNS </h6> <p> 1. <strong> Clic-droit </strong> sur le <strong> Réseau </strong> icône <img src=\"images/image_thumb-42-792.png\" alt=\"image\" loading=\"lazy\"> dans la barre des tâches et cliquez sur <strong> Ouvrez le Centre Réseau et partage. </strong> * </p> <p><img src=\"images/image_thumb-104-479.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Sélectionnez <strong> Ethernet </strong> (ou Wi-Fi) sur la gauche, puis dans la section &quot;Paramètres associés&quot;, cliquez sur <strong> Modifier les options de l&#39;adaptateur </strong> . </p> <p><img src=\"images/image_thumb-43-166.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> 3. Faites un clic droit sur l&#39;adaptateur réseau actif (Ethernet ou Wi-Fi) et sélectionnez <strong> Propriétés </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-44-500.png\" alt=\"network properties\" loading=\"lazy\"></p> <p> 4. Sélectionnez le <strong> &#39;Internet Protocol Version 4 (TCP/IPv4) </strong> &#39; et cliquez <strong> Propriétés </strong></p> <p><img src=\"images/image_thumb-106-472.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> 5. Dans les propriétés du protocole Internet version 4 (TCP/IPv4) : </p> <blockquote><p> une. <strong> Vérifier </strong> les <strong> Utilisez les adresses de serveur DNS suivantes : </strong> bouton radio. <br> b. Ensuite, saisissez les adresses de serveur DNS suivantes (les serveurs DNS publics de Google) et cliquez sur <strong> D&#39;ACCORD. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> </blockquote> <p><img src=\"images/image_thumb-109-991.png\" alt=\"google dns settings\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Redémarrer </strong> ton ordinateur. </p> <p> </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}