{"title":"CORRECTIF : nous ne pouvons pas installer Office en raison d&#39;Office 16 Cliquez pour exécuter l&#39;enregistrement des composants d&#39;extensibilité. (Résolu)","content":"<p> Si vous ne pouvez pas installer Office en raison de l&#39;installation d&#39;« Office 16 Click to Run Extensibility Component Registration », continuez à lire ce didacticiel, qui contient des instructions détaillées pour résoudre les problèmes d&#39;installation d&#39;Office suivants : </p> <p><strong> Problème n°1 : </strong> Lorsque vous essayez d&#39;installer une version 32 bits de Microsoft Office, vous recevez l&#39;erreur : <br> <em> &quot;Nous ne pouvons pas installer la version 32 bits d&#39;Office car nous avons trouvé les programmes 64 bits suivants sur votre PC : <br> Enregistrement 64 bits du composant d&#39;extensibilité en un clic d&#39;Office 16 <br> Veuillez désinstaller tous les programmes Office 64 bits, puis réessayez d&#39;installer Office 32 bits. Si vous souhaitez installer Office 64 bits à la place, veuillez exécuter la configuration 64 bits.&quot; </em></p> <p><img src=\"images/image_thumb-6-215.png\" alt=\"FIX: We can't Install Office because of Office 16 Click to Run Extensibility Component Registration\" loading=\"lazy\"></p> <p> </p> <p><strong> Problème n°2 </strong>  : lorsque vous essayez d&#39;installer une version 64 bits de Microsoft Office, vous recevez le message d&#39;erreur : <br> <em> &quot;Nous ne pouvons pas installer la version 64 bits d&#39;Office car nous avons trouvé les programmes 32 bits suivants sur votre PC : <br> <em> Enregistrement 32 bits du composant d&#39;extensibilité en un clic d&#39;Office 16 <br> <em> Veuillez désinstaller tous les programmes Office 32 bits, puis réessayez d&#39;installer Office 64 bits. Si vous souhaitez installer Office 32 bits à la place, veuillez exécuter la configuration 32 bits.&quot; </em></em></em></p> <p> </p> <h2> Comment CORRIGER : nous ne pouvons pas installer cette version d&#39;Office car nous avons trouvé les programmes suivants sur votre PC : Office 16 Click-to-Run Extensibility Component 32-bit Registration. </h2> <p> 1. Appuyez sur <strong> les fenêtres </strong> <img src=\"images/image_thumb41-277.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez <strong> installateur </strong> et appuyez sur <strong> Entrer </strong> pour naviguer jusqu&#39;au dossier &quot;C:\\Windows\\Installer&quot;. </p> <p><img src=\"images/image_thumb-7-594.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. De la <strong> Vue </strong> menu, cliquez sur <strong> Ajouter des colonnes </strong> puis cliquez <strong> Choisissez des colonnes </strong></p> <p><img src=\"images/image_thumb-8-367.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Vérifier </strong> les <strong> Matière </strong> et cliquez <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-9-532.png\" alt=\"image\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-43.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 5. Triez les résultats par sujet, puis faites défiler vers le bas jusqu&#39;à ce que vous trouviez le &quot; <em> Composant d&#39;extensibilité &quot;Démarrer en un clic&quot; d&#39;Office 16&quot; </em> qui est mentionné dans le message d&#39;erreur d&#39;installation d&#39;Office. </p> <p><img src=\"images/image_thumb-10-106.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Lorsque vous le trouvez, faites un clic droit dessus et choisissez <strong> Désinstaller </strong> . </p> <p><img src=\"images/image_thumb-11-389.png\" alt=\"Remove office Click to Run installer\" loading=\"lazy\"></p> <p> 7. Une fois la désinstallation terminée, procédez à nouveau à l&#39;installation de Microsoft Office. * </p> <p> * Remarque : Si vous recevez toujours la même erreur, alors… </p> <p> 1. Continuez et désinstallez tous les &quot;Composants Office 16 Click-to-Run&quot;, et si l&#39;installation échoue à nouveau… <br> 2. Désinstallez complètement Microsoft Office de votre PC en suivant les instructions de ce <a href=\"https://www.repairwin.com/fix-couldnt-uninstall-office-365-2016-2013-2010-or-2007/\" target=\"_blank\" rel=\"nofollow noopener\"> Didacticiel </a> puis procédez à la réinstallation d&#39;Office. </p> <ul> <li> <p> Article associé: : <a href=\"https://www.repairwin.com/fix-couldnt-uninstall-office-365-2016-2013-2010-or-2007/\" target=\"_blank\" rel=\"noopener noreferrer\"> CORRECTIF : Impossible de désinstaller Office 365, 2016, 2013, 2010 ou 2007. </a></p> </li> </ul> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog dans les réseaux sociaux pour aider à faire passer le mot à ce sujet. </p>"}