{"title":"CORRECTIF : impossible d&#39;installer la visionneuse XPS dans Windows 10 (résolu)","content":"<p> Dans un tutoriel précédent, j&#39;ai mentionné les étapes nécessaires pour <a href=\"https://www.repairwin.com/how-to-install-xps-viewer-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> installer XPS Viewer sur Windows 10 </a> . Cependant, certains utilisateurs se plaignent de ne pas pouvoir installer XPS Viewer, car la visionneuse XPS n&#39;est pas répertoriée après avoir appuyé sur le bouton « Ajouter une fonctionnalité » (Applications &gt; Gérer les fonctionnalités facultatives &gt; Ajouter une fonctionnalité) ou ne peut pas être installé. </p> <p> Ce didacticiel contient des instructions sur la façon de résoudre les problèmes d&#39;installation de la visionneuse XPS dans les versions Windows 10 1803 et 1809. </p> <h4> Comment résoudre les problèmes d&#39;installation de XPS Viewer sous Windows 10. </h4> <h6> Méthode 1. Désinstallez et réinstallez Microsoft XPS Document Writer. </h6> <p> 1. Ouvrir <strong> Programmes et fonctionnalités </strong> puis cliquez <strong> Activer ou désactiver des fonctionnalités Windows </strong> . </p> <p><img src=\"images/image_thumb-61-948.png\" alt=\"FIX: Cannot Install XPS Viewer - Windows 10\" loading=\"lazy\"></p> <p> 2. <strong> Décocher </strong> les <strong> Boîte Microsoft XPS Document Writer </strong> et frappe <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-62-338.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Maintenant, cliquez sur le <strong> Activer ou désactiver des fonctionnalités Windows </strong> encore et <strong> Chèque </strong> les <strong> Rédacteur de documents Microsoft XPS </strong> case et cliquez <strong> D&#39;ACCORD. <br> </strong> 4. <strong> Redémarrer </strong> votre ordinateur. <br> 5. Essayez d&#39;installer la visionneuse XPS. </p> <p> </p> <h6> Méthode 2. Installez XPS Viewer à l&#39;aide de la commande DISM. </h6> <p> 1. Ouvrir <strong> Invite de commandes en tant qu&#39;administrateur </strong> . <br> 2. Dans l&#39;invite de commande, donnez la commande suivante et appuyez sur <strong> Entrer </strong> . </p> <ul> <li><strong> dism /Online /Add-Capability /CapabilityName:XPS.Viewer~~~~0.0.1.0 </strong></li> </ul> <p><img src=\"images/image_thumb-65-661.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Méthode 3. Téléchargez XPS Viewer à partir de Windows Update au lieu de WSUS. (Windows 10 Professionnel et Entreprise). </h6> <p> Si vous utilisez Windows 10 Pro ou Entreprise, appliquez les étapes suivantes dans l&#39;éditeur de stratégie de groupe. * </p> <p> * Remarque : si l&#39;ordinateur appartient à un domaine, vous devez modifier les paramètres de stratégie de groupe de domaine (GPO) puis exécuter la commande &quot;gpupdate /force&quot;, avant d&#39;installer XPS Viewer. </p> <p> 1. Ouvrez l&#39;éditeur de stratégie de groupe. Pour faire ça: </p> <blockquote><p> 1. Appuyez simultanément sur Windows <img src=\"images/image_thumb36-656.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez <strong> gpedit.msc </strong> &amp; Presse <strong> Entrer. </strong></p></blockquote> <p><img src=\"images/image_thumb-78-514.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Dans le volet de gauche, accédez à : </p> <ul> <li><strong> La configuration d&#39;un ordinateur </strong> -&gt; <strong> Modèles d&#39;administration </strong> -&gt; <strong> Système </strong></li> </ul> <p> 3. Dans le volet droit, double-cliquez sur <strong> Spécifier les paramètres pour l&#39;installation et la réparation des composants en option </strong></p> <p><img src=\"images/image_thumb-63-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Définissez la stratégie sur <strong> Activée </strong> puis vérifiez le <strong> Téléchargez le contenu de réparation et les fonctionnalités facultatives directement à partir de Windows Update au lieu de Windows Server Update Services (WSUS) </strong> boîte. </p> <p> 5. Une fois terminé, cliquez sur <strong> Appliquer </strong> et <strong> d&#39;accord </strong> et <strong> redémarrer </strong> votre ordinateur. </p> <p><img src=\"images/image_thumb-64-264.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Après le redémarrage, essayez de <a href=\"#install-xps-viewer-dism\" target=\"_blank\" rel=\"nofollow noopener\"> installer la visionneuse XPS en utilisant la méthode DISM </a> dessus. <br> 7. Après l&#39;installation de la visionneuse XPS, ouvrez l&#39;éditeur de stratégie de groupe et annulez les modifications. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}