{"title":"CORRECTIF : l&#39;exécution de scripts est désactivée sur ce système dans Windows 10 (résolu)","content":"<p> Si vous essayez d&#39;exécuter un script dans Windows 10 PowerShell et que vous recevez le message d&#39;erreur « Impossible de charger car l&#39;exécution de scripts est désactivée sur ce système », continuez à lire ci-dessous pour résoudre le problème. </p> <p><img src=\"images/image_thumb-8-134.png\" alt=\"FIX: script cannot be loaded because is disabled on Windows 10\" loading=\"lazy\"></p> <p> </p> <h2> Comment CORRIGER : Impossible d&#39;exécuter le script PowerShell car la stratégie de sécurité empêche l&#39;exécution des scripts dans Windows 10. </h2> <p> L&#39;erreur PowerShell &quot;%ScriptName%.ps1 ne peut pas être chargée car est désactivé sur ce système&quot;, apparaît en raison d&#39;une stratégie de sécurité qui empêche l&#39;exécution des scripts. Pour supprimer la restriction et activer l&#39;exécution de scripts dans Windows 10, procédez comme suit : </p> <p> 1. Ouvrir <strong> PowerShell en tant qu&#39;administrateur </strong> . Pour faire ça: </p> <blockquote><p> 1. Appuyez sur le <strong> les fenêtres <img src=\"images/image_thumb-97-958.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> touches pour ouvrir la boîte de commande « Exécuter » <strong><br> </strong> 2. Tapez <strong> powershell </strong> puis appuyez sur <strong> CTRL </strong> + <strong> CHANGEMENT </strong> + <strong> ENTRER. </strong></p></blockquote> <p><img src=\"images/image_thumb-41-395.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Sur PowerShell, copiez/collez la commande ci-dessous et appuyez sur <strong> Entrer </strong> : </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Unrestricted </li> </ul> <p> 3. Appuyez sur <strong> Oui </strong> et frappe <strong> Entrer </strong> au message d&#39;avertissement de politique d&#39;exécution pour accepter le changement. </p> <p><img src=\"images/image_thumb-9-581.png\" alt=\"Enable Running Scripts on Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Une fois le changement de politique terminé, <strong> Fermer </strong> la fenêtre PowerShell. </p> <p> 5. Maintenant, exécutez le script qui vous a donné l&#39;erreur &quot;Les scripts sont désactivés&quot; avec <strong> administrateur </strong> privilèges. L&#39;erreur devrait avoir disparu maintenant. * </p> <blockquote><p> * Remarque : Si vous recevez toujours l&#39;erreur « Les scripts sont désactivés sur ce système », donnez l&#39;une des commandes suivantes et réessayez d&#39;exécuter votre script : </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy RemoteSigned </li> <li> set-executionpolicy remotesigned </li> </ul> </blockquote> <p> 6. Enfin, revenez au paramètre de stratégie d&#39;exécution PowerShell précédent (restriction), en exécutant cette commande dans PowerShell (Admin) : * </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Restricted </li> </ul> <p> * Remarque : après avoir exécuté la commande ci-dessus, vous recevrez un message d&#39;avertissement qui explique les risques de sécurité d&#39;un changement de politique d&#39;exécution. presse <strong> Oui </strong> , puis appuyez sur <strong> Entrer </strong> pour accepter la modification et revenir à votre paramètre de stratégie précédent. </p> <p><img src=\"images/image_thumb-10-246.png\" alt=\"Disable running scripts windows 10\" loading=\"lazy\"></p> <p> 7. Fermez la fenêtre PowerShell et vous avez terminé ! </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}