{"title":"CORRECTIF : Erreur 0x80248007 dans la mise à jour Windows 10 (résolu)","content":"<p> Sur un ordinateur Windows 10, vous pouvez recevoir le message d&#39;erreur suivant lorsque vous essayez d&#39;installer les mises à jour : « Il y a eu des problèmes lors de l&#39;installation des mises à jour, mais nous réessayerons plus tard. Si vous continuez à voir cela et que vous souhaitez rechercher sur le Web ou contacter le support pour obtenir des informations, cela peut vous aider : (0x80248007)&quot;. L&#39;erreur de mise à jour Windows 10 0x80248007 apparaît généralement si les fichiers Windows Update sont corrompus ou si Windows ne peut pas recevoir de mises à jour en raison du réseau questions. </p> <p><img src=\"images/image_thumb-14-418.png\" alt=\"FIX Error 0x80248007 in Windows 10 Update \" loading=\"lazy\"></p> <p> </p> <p> Ce didacticiel contient des instructions pour résoudre l&#39;erreur 0x80248007 lors de l&#39;installation des mises à jour dans Windows 10. </p> <h4> Comment résoudre l&#39;erreur 0x80248007 dans la mise à jour Windows 10. </h4> <h6> Étape 1. Analysez votre ordinateur contre les virus. </h6> <p><strong> Important: </strong> De nombreux virus ou programmes malveillants peuvent causer des problèmes avec la mise à jour de Windows. Donc, avant de passer aux étapes de dépannage ci-dessous, utilisez ce <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Guide d&#39;analyse et de suppression des logiciels malveillants </a> pour vérifier et supprimer les virus ou/et les programmes malveillants qui peuvent s&#39;exécuter sur votre ordinateur. </p> <p> </p> <h6> Étape 2. Exécutez l&#39;utilitaire de résolution des problèmes de Windows Update. </h6> <p> 1. Accédez à Windows <strong> Panneau de commande </strong> , définissez l&#39;option « Afficher par » sur <strong> Petites icônes </strong> et ouvrir <strong> Dépannage. </strong></p> <p><img src=\"images/image_thumb-5-564.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Dans les options de dépannage, cliquez sur <strong> Résoudre les problèmes avec Windows Update. </strong></p> <p><img src=\"images/image_thumb-9-777.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Cliquez sur <strong> Suivant </strong> pour résoudre les problèmes de mise à jour de Windows. </p> <p><img src=\"images/image_thumb-8-840.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Une fois le processus de dépannage terminé, <strong> Fermer </strong> le dépanneur et <strong> redémarrer </strong> votre ordinateur. <br> 6. Vérifiez les mises à jour. </p> <h6> Étape 3. &quot;Reconstruisez&quot; le dossier SoftwareDistribution. </h6> <p> Le &quot; <strong> Distribution de logiciels </strong> &quot; (C:WindowsSoftwareDistribution), est l&#39;emplacement où Windows stocke les mises à jour Windows. Parfois, ce dossier est corrompu et vous devez le recréer afin de télécharger et d&#39;installer les mises à jour à partir de zéro. Pour reconstruire (recréer) le dossier &quot;SoftwareDistribution&quot; suivez les étapes ci-dessous : </p> <p> 1. Ouvrez le panneau de configuration des services Windows : Pour ce faire : </p> <ul> <li> Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-939.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> pour ouvrir la boîte de commande Exécuter. </li> <li> Dans la zone de recherche, saisissez : <strong> services.msc </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </li> <li> (Acceptez l&#39;avertissement UAC s&#39;il apparaît). </li> </ul> <p><img src=\"images/image_thumb14_thumb_thumb-709.png\" alt=\"image_thumb[14]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 2. Dans le panneau de configuration des services, localisez le <strong> Windows Update </strong> un service. <br> 3. Faites un clic droit sur <strong> Windows Update </strong> service et sélectionnez <strong> Arrêter </strong> . </p> <p><img src=\"images/image_thumb7_thumb_thumb-509.png\" alt=\"image_thumb[7]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> </strong> Ouvrez l&#39;explorateur Windows et accédez à : <strong> C : Fenêtres </strong> dossier. <br> 5. Trouvez et <strong> Effacer </strong> les <strong> Distribution de logiciels </strong> dossier. </p> <p> </p> <p><img src=\"images/image_thumb9_thumb_thumb-248.png\" alt=\"image_thumb[9]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Redémarrer </strong> votre ordinateur et vérifiez les mises à jour. </p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}