{"title":"CORRECTIF : des onglets de feuille Excel sont manquants au bas d&#39;un classeur. (Résolu)","content":"<p> Il y a quelques jours, un de mes clients m&#39;a mentionné que des onglets de feuille manquaient dans l&#39;un des classeurs Excel. Après avoir résolu le problème des &quot;onglets Excel manquants&quot; sur son ordinateur, j&#39;ai décidé d&#39;écrire un tutoriel avec les étapes détaillées que j&#39;ai suivies pour restaurer les onglets de feuille manquants à partir du fichier Excel. </p> <p><img src=\"images/image_thumb-52-600.png\" alt=\"FIX: Excel Sheets are Missing at the bottom of a Workbook\" loading=\"lazy\"></p> <p> Cet article fournit des instructions détaillées pour résoudre le problème « feuilles manquantes » sur un classeur Excel. </p> <h4> Résoudre le problème : les onglets de la feuille de calcul Excel ne sont pas visibles. </h4> <p> Si vous ne pouvez pas voir les onglets dans un classeur Excel, essayez ce qui suit : </p> <h6> Méthode 1. Organisez toutes les fenêtres du classeur actif. </h6> <p> 1. Allez au <strong> Vue </strong> onglet et cliquez sur <strong> Organiser tout. </strong></p> <p><img src=\"images/image_thumb-47-872.png\" alt=\"Fix missing excel tabs\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Sélectionnez <strong> Carrelage </strong> et <strong> Fenêtres du classeur actif </strong> et cliquez <strong> D&#39;ACCORD. </strong></p> <p><img src=\"images/image_thumb-48-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Si vous voyez les onglets manquants, cliquez sur <strong> Sauvegarder </strong> pour enregistrer la vue actuelle, sinon continuez ci-dessous. </p> <p> </p> <h6> Méthode 2. Révéler les feuilles de calcul Excel cachées. </h6> <p> 1. Pour révéler les feuilles de calcul Excel cachées, placez votre souris sur le <strong> 3 points </strong><img src=\"images/image_thumb-41-979.png\" alt=\"image\" loading=\"lazy\"> dans la barre inférieure jusqu&#39;à ce que vous voyiez le <strong> flèche à deux pointes </strong><img src=\"images/image_thumb-42-990.png\" alt=\"image\" loading=\"lazy\"> . </p> <p><img src=\"images/image_thumb-49-473.png\" alt=\"reveal hidden sheets excel\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Cliquez sur </strong> sur la flèche à deux pointes <img src=\"images/image_thumb-44-186.png\" alt=\"image\" loading=\"lazy\"> et <strong> faites glisser votre souris vers la droite </strong> jusqu&#39;à ce que vous voyiez tous les onglets de votre classeur Excel. </p> <p><img src=\"images/image_thumb-50-847.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Si les onglets masqués sont à nouveau visibles, cliquez sur <strong> Sauvegarder </strong> pour enregistrer cette vue, d&#39;autres sinon continuer ci-dessous. </p> <p> </p> <h6> Méthode 3. Activez l&#39;option &#39;Afficher les onglets de la feuille&#39;. </h6> <p> Si les feuilles Excel ne sont pas visibles après avoir appliqué ce qui précède, cochez le paramètre &quot;Afficher les onglets de feuille&quot; dans les options Excel. Pour faire ça: </p> <p> 1. Allez à <strong> Déposer </strong> menu et sélectionnez <strong> Options </strong> . </p> <p> 2. Sélectionnez le <strong> Avancée </strong> onglet à gauche et à droite, sous le <b> Afficher les options pour ce classeur, cochez </b> les <b> Afficher les onglets de la feuille </b> case et cliquez <strong> D&#39;ACCORD. </strong></p> <p><img src=\"images/image_thumb-51-664.png\" alt=\"show sheet tabs excel\" loading=\"lazy\"></p> <p> 3. Cliquez sur <strong> Sauvegarder </strong> pour enregistrer cette vue. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog dans les réseaux sociaux pour aider à faire passer le mot à ce sujet. </p>"}