{"title":"CORRECTIF : Erreur Outlook Express 0x800c0133 en raison de la limite de taille de 2 Go dans le fichier DBX (résolu)","content":"<p> Ce didacticiel contient des instructions pour corriger l&#39;erreur Outlook Express 0x800c0133 en raison de la limite de taille de 2 Go. L&#39;erreur 0x800c0133 dans OE se produit car l&#39;un des dossiers Outlook dépasse la limite de 2 Go en taille. </p> <p> Description du problème de limite de taille .DBX 2 Go dans Outlook Express. <br> Lorsque l&#39;un des principaux dossiers Outlook Express (par exemple la &quot;Boîte de réception&quot; ou &quot;Envoyé&quot;) dépasse les 2 Go, OE renvoie l&#39;erreur 0x800c0133 lors de l&#39;opération d&#39;envoi/réception et parfois le dossier OE correspondant devient vide (corrompu). Par exemple, si le dossier &quot;Boîte de réception&quot; (Inbox.dbx) dépasse la taille de 2 Go, OE ne peut pas recevoir les nouveaux e-mails et affiche l&#39;erreur 0x800c0133. </p> <p> * Remarque : Si l&#39;un des dossiers OE est vide, le fichier DBX associé est corrompu. Dans ce cas, essayez de récupérer vos e-mails à partir du dossier OE corrompu en suivant les instructions de cet article : <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment récupérer le fichier Outlook Express DBX GRATUITEMENT </a> . </p> <h4> Comment réparer le problème de limite de 2 Go d&#39;Outlook Express (Erreur d&#39;envoi/réception 0x800c0133). </h4> <h6> Étape 1. Activez la vue des fichiers cachés. </h6> <p> 1. Ouvrez l&#39;Explorateur Windows. <br> 2. De la <strong> Outils </strong> menu choisir <strong> Options de dossier </strong> . <br> 3. Dans l&#39;onglet Affichage, cliquez sur <strong> Afficher les fichiers et dossiers cachés </strong> et cliquez <strong> D&#39;ACCORD. </strong></p> <p><img src=\"images/image_thumb1_thumb-210.png\" alt=\"image_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Étape 2. Localisez le fichier DBX Outlook Express 2 Go sur votre disque. </h6> <p> 1. Ouvrez le dossier du magasin Outlook Express. Généralement, ce dossier se trouve au chemin suivant sur votre disque : </p> <ul> <li> C:\\Documents and Settings\\\\Local Settings\\Application Data\\Identities\\{}\\Microsoft\\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> par exemple. &quot;C:\\Documents and Settings\\Admin\\Local Settings\\Application Data\\Identities\\{D8F3C56D-965E-41AE-8A23-A58460ABAE00}\\Microsoft\\ <strong> Outlook Express </strong> &quot; </p></blockquote> <p> 3. De l&#39;explorateur <strong> Vue </strong> menu choisir <strong> Des détails </strong> . <br> 4. Localisez quel fichier DBX dépasse la limite de stockage de 2 Go. * </p> <p> * Dans cet exemple, le fichier &quot;Inbox.dbx&quot; dépasse la taille de 2 Go. </p> <p><img src=\"images/image_thumb2_thumb-339.png\" alt=\"FIX Outlook Express Error 0x800c0133\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Étape 3. Déplacez les e-mails du dossier Courrier surdimensionné vers un dossier Nouveau courrier. </h6> <p> 1. Ouvrez Outlook Express. <br> 2. Sélectionnez le dossier de courrier surdimensionné (avec une taille supérieure à 2 Go, par exemple le dossier « Boîte de réception » dans cet exemple). <br> 3. Si vous pouvez voir vos e-mails dans ce dossier (le dossier n&#39;est pas vide), procédez comme suit : * </p> <p> * Remarque : Si le dossier semble vide (vous ne voyez aucun e-mail dessus), le dossier OE (et le fichier DBX associé) est corrompu. Dans ce cas, vous devez récupérer vos e-mails à partir du dossier DBX corrompu en suivant les instructions de cet article. </p> <p> 4. Dans le volet gauche du programme OE, faites un clic droit sur le dossier surdimensionné et choisissez <strong> Nouveau dossier </strong> (afin de créer un nouveau dossier de courrier) </p> <p><img src=\"images/image_thumb-6-403.png\" alt=\"outlook express 2gb limit\" loading=\"lazy\"></p> <p> </p> <p> 5. Tapez un nom reconnaissable pour le nouveau dossier suivi d&#39;une année (par exemple &quot;Inbox-2016&quot;) </p> <p><img src=\"images/image_thumb-7-434.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Ensuite, à partir du dossier surdimensionné (par exemple dans &quot;Boîte de réception&quot;), sélectionnez un groupe d&#39;e-mails (par exemple tous les e-mails de l&#39;année 2016) et faites-les glisser (déplacer) vers le nouveau dossier Mail que vous avez créé auparavant (par exemple vers &quot; Boîte de réception-2016&quot;). </p> <p><img src=\"images/image_thumb-8-450.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Répétez les mêmes étapes (créez des dossiers différents par année par exemple, et déplacez les mails du dossier surdimensionné vers les nouveaux dossiers). * </p> <p> * Remarque : Si vous rencontrez des problèmes lors de l&#39;opération de déplacement (par exemple, si vous ne pouvez pas déplacer certains messages vers le nouveau dossier), alors : </p> <blockquote><p> 1. Fermez Outlook Express. <br> 2. Copiez (sauvegardez) le dossier &quot;Outlook Express&quot; de l&#39;emplacement OE Store vers une autre destination sur votre disque. <br> 3. Suivez ensuite les instructions de l&#39;étape 4 pour supprimer le fichier .dbx surdimensionné. <br> 4. Ouvrez Outlook Express. <br> 5. Importez les e-mails du dossier de sauvegarde OE (depuis <strong> Déposer </strong> menu aller à -&gt; <strong> Importer </strong> <strong> messages </strong> -&gt; <strong> Microsoft Outlook Express 6 </strong> -&gt; <strong> Importer le courrier depuis le répertoire du magasin OE… </strong> ). ** </p> <p> ** Si vous rencontrez toujours des problèmes lors de l&#39;importation, suivez les instructions de cet article pour réparer le fichier DBX corrompu. </p></blockquote> <p> </p> <p> 8. Lorsque vous avez terminé le transfert d&#39;e-mails et que le dossier de 2 Go est vide d&#39;e-mails (par exemple, la &quot;Boîte de réception&quot; dans cet exemple), passez à l&#39;étape suivante. </p> <p><img src=\"images/image_thumb-10-811.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Étape 4. Supprimez le fichier DBX Outlook Express surdimensionné de votre disque. </h6> <p> 1. Ouvrez le dossier du magasin Outlook Express sur votre disque. <br> 2. Supprimez le fichier DBX surdimensionné (par exemple, le &quot;Inbox.dbx&quot; dans cet exemple). </p> <p><img src=\"images/image_thumb-9-996.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Lancez Outlook Express. <br> 4. OE créera (automatiquement) un nouveau dossier de courrier propre et sain pour stocker les e-mails. * </p> <p> * Remarque : Si vous recevez toujours la même erreur, essayez de réparer le dossier OE corrompu en suivant les instructions de cet article : <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment récupérer le fichier Outlook Express DBX GRATUITEMENT </a> . </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? </p> <p> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}