{"title":"Comment supprimer la protection BitLocker du lecteur système C : sans la clé ou le mot de passe de récupération BitLocker.","content":"<p> Cet article contient des instructions étape par étape sur la façon de supprimer la protection BitLocker sur le lecteur système C : afin de pouvoir installer correctement Windows 10 sur un ordinateur protégé par BitLocker, si vous n&#39;avez pas la clé de récupération BitLocker ou le mot de passe BitLocker ou si vous ne pouvez pas déverrouiller le lecteur BitLocker pour une raison quelconque. </p> <p><img src=\"images/image_thumb-51-648.png\" alt=\"Fix Refresh your PC error: Drive where windows is installed is locked\" loading=\"lazy\"></p> <p> </p> <p> Lorsqu&#39;un appareil Windows 10 (ordinateur portable ou PC) est protégé avec BitLocker, alors le seul moyen d&#39;accéder à son contenu ou de réinitialiser l&#39;appareil (en utilisant les fonctionnalités &quot;Réinitialiser ce PC&quot;, &quot;Actualiser votre PC&quot;), ou de réinstaller Windows, consiste à déverrouiller le lecteur du système d&#39;exploitation C: en utilisant la clé de récupération BitLocker ou le mot de passe BitLocker. </p> <p> Si vous n&#39;avez pas la clé de récupération BitLocker ou le mot de passe BitLocker pour déverrouiller le lecteur système C:, ou si la clé BitLocker n&#39;est pas acceptée, la seule option que vous avez laissée (malheureusement) est d&#39;effacer complètement le lecteur et d&#39;effectuer un nettoyer l&#39;installation de Windows. </p> <p> Dans ce didacticiel, vous trouverez des instructions sur la façon de résoudre le problème suivant lorsque vous essayez d&#39;installer Windows 10 ou de réinitialiser un périphérique Windows 10 à son état d&#39;usine par défaut : &quot;Le lecteur sur lequel Windows est installé est verrouillé. Déverrouillez le lecteur et réessayez &quot;. </p> <h4> Comment nettoyer l&#39;installation de Windows 10 sur un ordinateur protégé par BitLocker (FIX : Impossible d&#39;installer/actualiser Windows 10 - Le lecteur est verrouillé avec BitLocker.) </h4> <p><strong> Exigence: </strong> <strong> Un support d&#39;installation Windows 10 (USB ou DVD). </strong><br> Si vous ne possédez pas de support d&#39;installation Windows, vous pouvez en créer un en utilisant <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> L&#39;outil de création de médias de Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment créer un support d&#39;installation USB Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment créer un support d&#39;installation DVD Windows 10. </a></li> </ul> <p> Pour effectuer une nouvelle installation de Windows 10, sur un ordinateur/lecteur protégé par BitLocker, suivez les instructions ci-dessous : * </p> <p><strong> * ATTENTION : LA PROCÉDURE CI-DESSOUS SUPPRIMERA TOUTES LES DONNÉES STOCKÉES SUR LE LECTEUR VERROUILLÉ. PROCÉDEZ SEULEMENT SI VOUS <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> IMPOSSIBLE DE DÉVERROUILLER LE LECTEUR/ORDINATEUR PROTÉGÉ BITLOCKER. </a></strong></p> <p> 1. Démarrez votre système à partir du support d&#39;installation de Windows 10. * </p> <p> * Noter: <strong> </strong> Pour pouvoir démarrer à partir de Windows Media (USB ou DVD), suivez les étapes ci-dessous : </p> <ul> <li><strong> Méthode 1 : </strong> Après la mise sous tension, appuyez sur la touche de fonction correspondante (généralement la touche « F12 » ou « F8 ») pour afficher les options « Ordre de démarrage » ou « Menu de démarrage ». Sélectionnez ensuite le périphérique USB (ou le DVD) qui contient le support d&#39;installation de Windows (fichiers) et appuyez sur Entrée. </li> <li><strong> Méthode 2 : </strong> Entrez dans la configuration du BIOS (Paramètres) et définissez le support d&#39;installation Windows comme « Premier périphérique de démarrage » dans le menu « Ordre de démarrage ». Puis <strong> Sauvegarder et quitter </strong> à partir des paramètres du BIOS. </li> </ul> <p> 2. Sur l&#39;écran ci-dessous, appuyez sur le bouton <strong> CHANGEMENT </strong> + <strong> F10 </strong> touches pour lancer l&#39;invite de commande. (ou appuyez sur <strong> Suivant </strong> &gt; <strong> Réparer mon ordinateur </strong> &gt; <strong> Dépannage </strong> &gt; <strong> Invite de commandes </strong> ). * </p> <p> * Remarque : Si vous avez demandé la clé de récupération, cliquez sur <strong> PASSER ce lecteur </strong> . </p> <p><img src=\"images/image_thumb15_thumb-290.png\" alt=\"How to Remove Updates from the Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. Dans l&#39;invite de commande, donnez les commandes suivantes dans l&#39;ordre : </p> <ul> <li><strong> partie disque </strong></li> <li><strong> disque de liste </strong></li> <li><strong> sélectionnez le disque 0 </strong></li> <li><strong> liste de volume </strong></li> </ul> <p> 4. Localisez maintenant lequel des volumes répertoriés a la plus grande taille en Go. Généralement, le plus grand volume est l&#39;endroit où Windows est installé (le lecteur verrouillé). * </p> <p> * par exemple. Sur la capture d&#39;écran ci-dessous, le &quot;Volume 2&quot; a la plus grande taille. </p> <p> </p> <p><img src=\"images/image_thumb-10-992.png\" alt=\"fix drive is locked Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Sélectionnez ensuite le volume le plus important en tapant cette commande : * </p> <ul> <li><strong> sélectionner le numéro de volume </strong></li> </ul> <p> * Remarque : modifiez le numéro de volume dans la commande ci-dessus en fonction de votre cas (par exemple, &quot;sélectionnez le volume 2&quot;) </p> <p> 5. Supprimez enfin le volume sélectionné en donnant cette commande : </p> <p> </p> <ul> <li><strong> supprimer le remplacement de volume </strong></li> </ul> <p><img src=\"images/image_thumb-14-714.png\" alt=\"delete volume override\" loading=\"lazy\"></p> <p> </p> <p> 6. Tapez <strong> sortir </strong> pour fermer l&#39;outil DISKPART, puis fermez l&#39;invite de commande. <br> 7. Éteignez puis rallumez votre appareil. <br> 8. Démarrez à partir du support d&#39;installation Windows. <br> 9. Cliquez sur <strong> Suivant </strong> et alors <strong> Installer maintenant </strong> . <br> 10. Choisissez &quot;Je n&#39;ai pas de clé de produit&quot;, puis acceptez le contrat de licence. <br> 11. Sélectionnez « Installation personnalisée », puis supprimez toutes les partitions/volumes restants sur le disque. </p> <p><img src=\"images/image_thumb-12-362.png\" alt=\"cannot reset windows 10 drive locked with bitlocker\" loading=\"lazy\"></p> <p> </p> <p> 12. Une fois terminé, choisissez &quot;Espace non alloué&quot; et cliquez sur <strong> Suivant. <br> </strong> 13. Suivez les invites à l&#39;écran pour <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> installer proprement Windows 10 </a> . </p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître ce problème. </p>"}