{"title":"CORRECTIF : Il n&#39;y a pas assez de stockage disponible pour traiter cette commande - Impossible d&#39;accéder aux dossiers partagés ou d&#39;utiliser le bureau à distance (résolu)","content":"<p> L&#39;erreur &quot;Pas assez de stockage disponible pour traiter cette commande&quot;, peut apparaître lorsque vous essayez d&#39;accéder à des dossiers partagés sur un autre poste de travail Windows ou un serveur 2003, 2008, 2012 ou 2016, ou lorsque vous utilisez la connexion Bureau à distance (RDP ), pour se connecter à un autre ordinateur Windows (Poste de travail ou Serveur). </p> <p><img src=\"images/image_thumb-127.png\" alt=\"Not enough storage is available to process this command\" loading=\"lazy\"></p> <p> </p> <p> Ce tutoriel contient des instructions pour résoudre les problèmes suivants, qui peuvent apparaître sur toutes les versions de Windows (Windows 10, 8/8.1, 7, Vista, XP &amp; Windows Server 2003, 2008, 2012 ou 2016) : </p> <p> 1. Lorsque vous essayez d&#39;accéder aux dossiers partagés sur la machine serveur, vous recevez le message d&#39;erreur : &quot; <em> Dossier partagé </em> n&#39;est pas accessible. Vous n&#39;êtes peut-être pas autorisé à utiliser cette ressource réseau. Contactez l&#39;administrateur de ce serveur pour savoir si vous disposez des autorisations d&#39;accès. L&#39;espace de stockage disponible sur le serveur n&#39;est pas suffisant pour traiter cette commande.&quot; </p> <p> 2. Lorsque vous essayez de vous connecter à distance (à l&#39;aide de RDP) à une autre machine Windows, vous obtenez le message d&#39;erreur : « Le système ne peut pas vous connecter pour la raison suivante. L&#39;espace de stockage disponible est insuffisant pour traiter cette commande ». </p> <h4> COMMENT CORRIGER : Message d&#39;erreur « L&#39;espace de stockage disponible est insuffisant pour traiter cette commande » dans le Bureau à distance (RDP) ou lorsque vous essayez d&#39;accéder aux dossiers partagés. </h4> <p> Sur la machine &quot;serveur&quot; Windows, que vous souhaitez accéder à ses fichiers ou vous connecter à distance : </p> <p><strong> 1. </strong> Presse &quot; <strong> les fenêtres </strong> &quot; + &quot; <strong> R </strong> ” touches pour ouvrir le <em> COURS </em> la fenêtre. <br> <strong> 2. </strong> Taper <strong> regedit </strong> et appuyez sur <strong> Entrer </strong> pour ouvrir l&#39;éditeur de registre. </p> <p><img src=\"images/image_thumb7-649.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Accédez ensuite à cette clé : </p> <ul> <li><strong> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\LanmanServer\\Parameters </strong></li> </ul> <p><img src=\"images/image_thumb-1-198.png\" alt=\"fix Not enough storage - cannot access shared items\" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Dans le volet de droite, double-cliquez pour ouvrir le <strong> IRPStackSize </strong> valeur <strong> . * </strong></p> <p><strong> * Noter: </strong> Si vous ne voyez pas le <strong> IRPStackSize </strong> valeur, alors : </p> <p> </p> <blockquote><p> 1. Cliquez avec le bouton droit sur un espace vide (dans le volet de droite), puis sélectionnez <strong> Nouveau </strong> -&gt; <strong> Valeur DWORD (32 bits) </strong></p> <p><img src=\"images/image_thumb-2-236.png\" alt=\"fix Not enough storage using RDP (Remote Desktop)\" loading=\"lazy\"></p> </blockquote> <blockquote><p> 2. Nommez la nouvelle valeur <strong> IRPStackSize </strong> et frappe <strong> Entrer. </strong></p></blockquote> <p><strong> 5. </strong> Sélectionner <strong> Décimal </strong> , remplacez les données de valeur par <strong> 50 </strong> et cliquez <strong> d&#39;accord </strong> . * </p> <p> * Remarque : La plage (en décimal) du paramètre est comprise entre 1 et 50. </p> <p><img src=\"images/image_thumb-3-255.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 6. </strong> <strong> Fermer </strong> éditeur de registre et <strong> redémarrer </strong> le serveur. * </p> <p> * Remarque importante : si après le redémarrage, vous recevez le même message d&#39;erreur, lorsque vous utilisez la connexion Bureau à distance ou lorsque vous essayez d&#39;accéder aux fichiers partagés sur un autre ordinateur, appliquez également la modification de registre ci-dessus à votre ordinateur. </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? </p> <p> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}