{"title":"CORRECTIF : le délai d&#39;expiration du sémaphore a expiré lors de la copie de fichiers (résolu)","content":"<p> L&#39;erreur &quot;Le délai d&#39;expiration du sémaphore a expiré&quot; peut s&#39;afficher lorsque vous essayez de copier des fichiers volumineux sur le réseau ou lors du transfert de fichiers d&#39;un lecteur USB externe vers votre ordinateur. Dans d&#39;autres cas, l&#39;&quot;Erreur 0x80070079 : Le délai d&#39;expiration du sémaphore a expiré&quot; apparaît lorsque vous essayez de copier des fichiers à partir d&#39;un périphérique connecté via USB (par exemple, depuis votre appareil photo, votre téléphone portable, etc.). </p> <p><img src=\"images/image_thumb-4-812.png\" alt=\"Semaphore Timeout Period has Expired\" loading=\"lazy\"></p> <p> </p> <p> Dans ce guide, vous trouverez plusieurs façons de résoudre le &quot;délai d&#39;expiration du sémaphore. Erreur 0x80070079&quot; lors de la copie de fichiers depuis/vers le réseau ou USB, sous Windows 10, 8, 8.1, 7 ou Vista. </p> <h4> Comment CORRIGER : Erreur lors de la copie d&#39;un fichier ou d&#39;un dossier. La période du sémaphore a expiré. </h4> <p><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> PARTIE 1. CORRIGER &#39;La période du sémaphore a expiré&#39; lors de la copie de fichiers à partir d&#39;une clé USB. </a></p> <p><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> PARTIE 2. CORRIGER &#39;La période du sémaphore a expiré&#39; lors de la copie de fichiers à partir du réseau. </a></p> <p> </p> <h6> PARTIE 1. CORRIGER &#39;La période du sémaphore a expiré&#39; lors de la copie de fichiers à partir d&#39;une clé USB. </h6> <p> Si vous recevez l&#39;erreur « La période du sémaphore a expiré » lorsque vous copiez des fichiers à partir d&#39;un périphérique USB (par exemple, à partir d&#39;un disque USB externe ou de votre appareil photo numérique), essayez ce qui suit pour résoudre le problème : </p> <p><strong> 1. </strong> Fermez tous les programmes ouverts et <strong> redémarrer </strong> ton ordinateur. <br> <strong> 2. </strong> Connectez le périphérique USB à <strong> un autre port USB </strong> . Si votre ordinateur possède un port USB 2.0, connectez le périphérique USB à ce port. <br> <strong> 3. </strong> Utiliser un <strong> câble USB différent </strong> pour connecter le périphérique USB à votre ordinateur. <br> <strong> 4. </strong> Si vous souhaitez copier des fichiers à partir d&#39;un périphérique USB (par exemple votre téléphone portable ou votre appareil photo numérique), qui possède une carte SD, alors <strong> supprimer </strong> et <strong> réinsérer </strong> les <strong> carte SD </strong> . De plus, retirez la carte SD du périphérique USB et connectez-la à un <strong> lecteur de cartes </strong> (si vous en possédez un). <br> <strong> 5. </strong> <strong> Vérifier </strong> et <strong> réparer les erreurs </strong> sur la clé USB en utilisant le &#39; <strong> chkdsk </strong> &#39; commande. Pour faire ça: </p> <blockquote><p> 1. Lancer <strong> Invite de commandes en tant qu&#39;administrateur </strong> . </p></blockquote> <p><img src=\"images/image_thumb-30-765.png\" alt=\"command prompt administrator\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 2. Dans la fenêtre d&#39;invite de commande, tapez la commande suivante et appuyez sur <strong> Entrer </strong> : * </p></blockquote> <ul> <li> <ul> <li> <ul> <li><strong> chkdsk X : /F /R </strong></li> </ul> </li> </ul> </li> </ul> <p><strong> * Noter: </strong> Remplacez la lettre de lecteur X en fonction de la lettre de la clé USB. </p> <p> </p> <p> </p> <h6> PARTIE 2. CORRIGER &#39;La période du sémaphore a expiré&#39; lors de la copie de fichiers sur le réseau. </h6> <p> Si vous recevez l&#39;erreur « La période du sémaphore a expiré » lorsque vous essayez de copier des fichiers sur le réseau, essayez ce qui suit : </p> <h2> Méthode 1. Utilisez une adresse IP statique. </h2> <p> Si vous utilisez DHCP, désactivez-le et spécifiez une adresse IP statique sur les deux ordinateurs du réseau. </p> <p> </p> <h2> Méthode 2. Mettez à jour les pilotes réseau sur les deux ordinateurs. </h2> <ul> <li> Si vous possédez un ordinateur portable, essayez ce qui suit : <ul> <li> Si vous êtes connecté via Wi-Fi, essayez de copier les fichiers à l&#39;aide de la connexion Ethernet (LAN), ou… </li> <li> Accédez au site d&#39;assistance du fabricant de votre ordinateur portable pour télécharger et installer les derniers pilotes réseau. </li> </ul> </li> <li> Si vous possédez un ordinateur de bureau, téléchargez les derniers pilotes pour votre carte réseau sur le site d&#39;assistance du fabricant de la carte mère. </li> </ul> <p><strong> ASTUCE: </strong> Si vous ne trouvez pas le modèle de votre ordinateur portable ou de votre carte mère, procédez comme suit : </p> <blockquote><p> 1. Appuyez sur la <strong> les fenêtres </strong> <img src=\"images/image_thumb8_thumb_thumb-904.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez : <strong> devmgmt.msc </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> pour ouvrir le « Gestionnaire de périphériques » <strong> . </strong></p></blockquote> <p><img src=\"images/image_thumb-1-166.png\" alt=\"device manager\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> </p> <p> 3. Dans le Gestionnaire de périphériques, développez le <strong> Adaptateurs réseau. <br> </strong> 4. Faites un clic droit sur votre adaptateur réseau et cliquez sur <strong> Mettre à jour le pilote </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-946.png\" alt=\"update driver\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Laissez Windows rechercher automatiquement un pilote de mise à jour pour la carte réseau. * </p></blockquote> <p><strong> *Noter: </strong> Si Windows ne trouve pas de pilote mis à jour, utilisez le nom de l&#39;adaptateur (par exemple, &quot;Broadcom 802.11g Network Adapter&quot;) et recherchez manuellement un pilote mis à jour. </p> <p><img src=\"images/image_thumb-6-471.png\" alt=\"search for drivers\" loading=\"lazy\"></p> <p> </p> <p> </p> <h2> Méthode 3. Désactivez temporairement l&#39;antivirus ou le pare-feu. </h2> <p> La méthode suivante pour résoudre le problème « La période du sémaphore a expiré » consiste à désactiver temporairement le pare-feu Windows et votre programme antivirus. Pour désactiver le pare-feu Windows : </p> <p> 1. Appuyez sur la <strong> les fenêtres </strong> <img src=\"images/image_thumb8_thumb_thumb-462.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez : <strong> contrôler </strong> &amp; Cliquez sur <strong> d&#39;accord </strong><strong> . </strong></p> <p><img src=\"images/image_thumb7-807.png\" alt=\"control panel command\" loading=\"lazy\"></p> <p> </p> <p> 3. Définissez l&#39;option &quot;Afficher par :&quot; sur <strong> Petites icônes </strong> pour afficher tous les éléments du panneau de commande. </p> <p> </p> <p><img src=\"images/image_thumb8-567.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Ouvrir <strong> fenêtre pare-feu </strong> (ou &quot;Pare-feu Windows Defender&quot; dans Windows 10). </p> <p><img src=\"images/image_thumb-7-921.png\" alt=\"disable firewall wiindows\" loading=\"lazy\"></p> <p> </p> <p> 5. Cliquez sur <strong> Activer ou désactiver le pare-feu Windows </strong> . </p> <p><img src=\"images/image_thumb-8-655.png\" alt=\"turn off windows defender firewall\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Vérifier </strong> les &quot; <strong> Désactiver le pare-feu Windows (non recommandé) </strong> &quot; et cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-9-907.png\" alt=\"turn off windows firewall\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Redémarrer </strong> votre ordinateur, puis copiez les fichiers. * </p> <p> * Remarque : Après avoir copié les fichiers, suivez les étapes ci-dessus pour réactiver le pare-feu Windows. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}