{"title":"CORRECTIF : Écran noir de la caméra Skype et autres problèmes de webcam sous Windows 10.","content":"<p> Le problème d&#39;écran noir/blanc de la caméra Skype est l&#39;un des problèmes les plus courants sur Windows 10 et peut être causé par un certain nombre de raisons. Voici donc un guide étape par étape pour le résoudre. </p> <p> Dans Windows 10, une nouvelle mise à jour peut causer de nombreux problèmes avec votre webcam intégrée, et la caméra peut ne pas fonctionner ou la caméra peut ne pas être reconnue dans certaines applications alors qu&#39;elle fonctionne correctement dans d&#39;autres. Par exemple, j&#39;ai vu un cas où, alors que la caméra fonctionnait sans problème dans les applications Webex et Zoom, elle affichait un écran noir dans Skype. </p> <p> Ce guide contient des instructions étape par étape pour résoudre plusieurs problèmes avec la caméra intégrée sur les ordinateurs portables avec Windows 10 : * </p> <ul> <li><em> La webcam/la caméra ne fonctionne pas sous Windows 10 </em></li> <li><em><em> Webcam/Caméra </em> A cessé de fonctionner après la mise à jour dans Windows 10. </em></li> <li><em> La webcam ne fonctionne pas sur certaines applications (Skype, Windows Hello WebEx, etc.). </em></li> <li><em> La webcam affiche un écran noir (ou vide) lorsqu&#39;elle est utilisée sur Skype. </em></li> <li><em> La webcam fonctionne sur Skype mais affiche un écran noir dans la fenêtre d&#39;aperçu de la caméra </em> . </li> <li> Les applications ne peuvent pas reconnaître ou trouver la caméra/webcam </li> </ul> <p><strong> * Avis aux propriétaires de Lenovo ThinkPad : </strong> Si vous possédez l&#39;un des modèles ThinkPad répertoriés dans le tableau ci-dessous, procédez au téléchargement et à l&#39;installation de ce <a href=\"/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/DC8297800EA7/Integrated%20Camera%20Driver%20Registry%20Patch%20for%20Windows%2010%20(Version%201709%20or%20later)%20-%20ThinkPad\" target=\"_blank\" rel=\"nofollow noopener\"> correctif de registre de Lenovo. </a> Le correctif résout un problème où le pilote de caméra intégré peut ne pas fonctionner correctement après la mise à niveau vers Windows 10 version 1709 ou ultérieure. </p> <p><img src=\"images/image_thumb-30-725.png\" alt=\"THinkpad Registry Fix for Integrated Camera\" loading=\"lazy\"></p> <h2> Comment CORRIGER : Problèmes de webcam sous Windows 10. </h2> <p> </p> <h3> Étape 1. Autorisez l&#39;accès de la caméra aux applications. </h3> <p> Sous Windows 10, l&#39;appareil photo et le microphone peuvent ne pas être disponibles pour les applications en raison des paramètres de confidentialité qui ont pu s&#39;appliquer. Alors, continuez et autorisez l&#39;application avec le problème de caméra, à accéder à votre caméra. Par exemple, si vous rencontrez un problème de caméra sur Skype, procédez comme suit : </p> <p> 1. Naviguez pour aller à <strong> Démarrer </strong> menu <img src=\"images/image_thumb-12-696.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Paramètres </strong> -&gt; <strong> Intimité </strong> . <br> 2. Sélectionnez <strong> Caméra </strong> sur le volet gauche et sur la droite : </p> <blockquote><p> une. Veiller à ce que <strong> Accès à la caméra pour cet appareil </strong> est <strong> au. </strong> Sinon, cliquez sur <strong> Changer </strong> et mis à <strong> AU. </strong><br> b. Réglez ensuite sur <strong> Au </strong> les <strong> Autoriser les applications à accéder à votre commutateur de caméra </strong> . </p> <p><img src=\"images/image_thumb-20-105.png\" alt=\"Allow Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Maintenant, faites défiler vers le bas et… </p> <p> c. Si vous rencontrez le problème de l&#39;écran noir de la caméra sur <strong> Skype </strong> store app, faites défiler vers le bas et à <strong> Choisissez les applications du Microsoft Store qui peuvent accéder à votre appareil photo </strong> section, ensemble <strong> Skype </strong> à <strong> Au. </strong></p> <p><img src=\"images/image_thumb-21-826.png\" alt=\"Allow Store Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> ré. Si vous voyez une fenêtre d&#39;écran noir de votre appareil photo lors de l&#39;utilisation du <strong> Skype pour Windows </strong> (application de bureau), puis assurez-vous que le <strong> Autoriser les applications de bureau à accéder à votre caméra </strong> l&#39;interrupteur est <strong> Au </strong> . </p> <p><img src=\"images/image_thumb-22-558.png\" alt=\"Allow Applications to Access Camera Windows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h3> Étape 2. Vérifiez si votre appareil photo fonctionne correctement. </h3> <p> L&#39;une des premières étapes du dépannage de votre webcam consiste à confirmer qu&#39;elle fonctionne dans l&#39;application Appareil photo Windows 10. </p> <p> 1. Dans la zone de recherche, saisissez <strong> caméra </strong> pour ouvrir l&#39;application Appareil photo. <br> 2. Cliquez sur la loupe et recherchez &quot; <strong> caméra </strong> &quot;. <br> 3. Ouvrez le <strong> Caméra </strong> application </p> <p><img src=\"images/image_thumb-23-730.png\" alt=\"Open Camera app Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Maintenant, selon le résultat, procédez comme suit : </p> <blockquote><p> A. Si votre appareil photo fonctionne, vous devriez voir votre image à l&#39;écran. Dans ce cas, continuez et vérifiez votre caméra sur Skype ou dans toute autre application que vous utilisez. Si la webcam ne fonctionne pas ou affiche un écran noir, appliquez les étapes ci-dessous dans l&#39;ordre : </p> <ol> <li> Essayez de <strong> désinstaller </strong> et <strong> réinstaller </strong> l&#39;application avec le problème de caméra (par exemple Skype). </li> <li> Passez à Activer ou à Désactiver le mode Frame Server dans le Registre en suivant les instructions sur <a href=\"#step-3\" target=\"_blank\" rel=\"nofollow noopener\"> étape 3 </a> . </li> </ol> <p> B. Si votre appareil photo ne fonctionne pas non plus dans l&#39;application Appareil photo, l&#39;un des événements suivants peut se produire : </p> <ol> <li> Le pilote de l&#39;appareil photo est incorrect ou endommagé. Dans ce cas, procédez au dépannage des pilotes de caméra en suivant les instructions sur <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> étape 4 </a> . </li> <li> La caméra est endommagée et ne fonctionne pas du tout. Dans ce cas, rendez-vous dans un atelier de réparation informatique pour réparer votre webcam ou utilisez une caméra USB externe. </li> </ol> </blockquote> <h3></h3> <h3> Étape 3. Résoudre le problème d&#39;écran noir de la webcam dans le registre Windows 10. </h3> <p> Si la caméra est reconnue et fonctionne sans problème dans certaines applications, mais qu&#39;elle ne fonctionne pas dans d&#39;autres, ou affiche un écran noir sur Skype, essayez de désactiver ou d&#39;activer le &quot;Frame Server Mode&quot; dans le registre. </p> <p> 1. Ouvrez l&#39;Éditeur du Registre : pour cela : </p> <blockquote><p> 1. Appuyez sur Windows <img src=\"images/image_thumb41-284.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez <strong> regedit </strong> et appuyez sur <strong> Entrer </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-845.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> 3. Dans l&#39;Éditeur du Registre, accédez à la clé suivante dans le volet gauche : </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows Media Foundation\\Platform </li> </ul> <p> 4. <strong> Clic-droit </strong> dans un espace vide dans le volet de droite et sélectionnez <strong> Nouveau -&gt; Valeur DWORD (32 bits). </strong></p> <p><img src=\"images/image_thumb-24-839.png\" alt=\"Fix Webcam black Screen Windows 10\" loading=\"lazy\"></p> <p> 5. Donnez le nom <strong> ActiverFrameServerMode </strong> à la nouvelle valeur. <br> 6. Double-cliquez sur la valeur nouvellement créée et assurez-vous que les données de valeur sont <strong>0</strong> . (Zéro). Cliquez sur <strong> D&#39;ACCORD. </strong></p> <p><img src=\"images/image_thumb-25-764.png\" alt=\"Fix Webcam issues Windows 10\" loading=\"lazy\"></p> <p> 7. Maintenant, suivez les mêmes étapes ci-dessus (4,5 et 6), et apportez les mêmes modifications à cette touche : </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows Media Foundation\\Platform </li> </ul> <p> 8. Une fois terminé, <strong> Fermer </strong> Éditeur de registre et <strong> redémarrer </strong> votre ordinateur. <br> 9. Après le redémarrage, lancez Skype et vérifiez si le problème avec WebCam a été résolu. Sinon, suivez les mêmes étapes, mais cette fois <strong> activer </strong> les <strong> ActiverFrameServerMode </strong> en changeant sa valeur de <strong>0 </strong> à <strong> 1 </strong> et <strong> redémarrer </strong> votre PC à nouveau. </p> <p> </p> <h3> Étape 4. Dépannez le pilote de webcam. </h3> <p> L&#39;étape suivante, pour résoudre les problèmes de l&#39;appareil photo dans Windows 10, consiste à revenir en arrière ou à désinstaller/réinstaller les pilotes de l&#39;appareil photo. 1. Ouvrir <strong> Gestionnaire de périphériques </strong> . Pour faire ça: </p> <blockquote><p> 1. Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-696.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Dans la case &quot;Ouvrir&quot;, saisissez : <strong> devmgmt.msc </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-5-837.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Développer <strong> Imaginez des appareils </strong> (ou alors <strong> Appareils photo </strong> ) <br> 3. <strong> Clic-droit </strong> sur votre <strong> Caméra </strong> et choisissez <strong> Propriétés. </strong></p> <p><img src=\"images/image_thumb-26-673.png\" alt=\"Camera Properties\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 4. Sélectionnez le <strong> Conducteur </strong> tab et procédez comme suit selon votre cas : </p> <blockquote><p> A. Si votre webcam fonctionnait auparavant, <strong> Faire reculer le pilote </strong> et <strong> redémarrer </strong> t votre PC. Vérifiez ensuite si votre caméra fonctionne. </p> <p><img src=\"images/image_thumb-27-454.png\" alt=\"Roll Back Driver - Camera\" loading=\"lazy\"></p> <p> </p> <p> B. Si votre appareil photo n&#39;a jamais fonctionné auparavant, ou si c&#39;est la première fois que vous essayez votre appareil photo (par exemple après une nouvelle installation de Windows), essayez ce qui suit dans cet ordre : </p> <ol> <li> Clique le <strong> Mettre à jour le pilote </strong> option, pour rechercher un pilote mis à jour de votre appareil photo. Si Windows trouve un nouveau pilote, installez-le, puis vérifiez votre webcam. Sinon… </li> <li> Cliquez sur <strong> Désinstaller l&#39;appareil </strong> pour désinstaller la webcam puis <strong> redémarrer </strong> votre ordinateur. Après le redémarrage, vérifiez si votre caméra fonctionne. Si non… </li> <li> Accédez au site d&#39;assistance du fabricant de votre ordinateur portable et vérifiez si un nouveau pilote est disponible pour votre webcam et installez-le. </li> </ol> </blockquote> <h3> Aide supplémentaire pour résoudre les problèmes de caméra sous Windows 10. </h3> <p> Si vous rencontrez toujours des problèmes avec votre webcam après les étapes ci-dessus, essayez ce qui suit : </p> <ol> <li> <p> Installez toutes les mises à jour Windows 10 disponibles ( <strong> Démarrer </strong> -&gt; <strong> Paramètres </strong> -&gt; <strong> Mise à jour et sécurité </strong> et cliquez <strong> Vérifier les mises à jour). </strong></p> </li> <li> <p> Mettez à jour Windows 10 vers la dernière version en utilisant le <strong> Assistant de mise à jour. </strong> (Pour ce faire, accédez à ceci <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"noopener\"><strong> relier </strong></a> et cliquez sur le <strong> Mettez à jour maintenant </strong> bouton). </p> </li> <li> <p><a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"noopener\"><strong> Actualiser Windows 10 </strong> . </a></p> </li> </ol> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}