{"title":"CORRECTIF : le serveur n&#39;est pas accessible. Vous n&#39;êtes peut-être pas autorisé à utiliser cette ressource réseau. Le descripteur n&#39;est pas valide. (Résolu)","content":"<p> Ce didacticiel contient des instructions pour corriger l&#39;erreur suivante lorsque vous essayez d&#39;accéder à un dossier partagé sur le réseau : &quot;Le serveur n&#39;est pas accessible. Vous n&#39;avez peut-être pas l&#39;autorisation d&#39;utiliser cette ressource réseau. Contactez l&#39;administrateur de ce serveur pour savoir si vous avez accès autorisations. Le descripteur n&#39;est pas valide.&quot; </p> <p><img src=\"images/image_thumb-5-437.png\" alt=\"You might not have permission to use this network resource\" loading=\"lazy\"></p> <p> </p> <h2> Comment CORRIGER : Impossible d&#39;accéder au dossier partagé. Vous n&#39;êtes peut-être pas autorisé à utiliser cette ressource réseau. Le descripteur n&#39;est pas valide. </h2> <p> Normalement, le problème de connexion de partage de fichiers « Vous n&#39;avez peut-être pas l&#39;autorisation d&#39;utiliser cette ressource réseau » apparaît lorsqu&#39;un utilisateur essaie d&#39;accéder à un dossier partagé sur le réseau, sans disposer des autorisations requises. Dans ce cas et afin de résoudre le problème, vous devez vous assurer que l&#39;utilisateur dispose des autorisations d&#39;accès appropriées sur le dossier partagé. </p> <p> Cependant, si vous savez que les autorisations de l&#39;utilisateur sur le dossier partagé sont correctes et que le problème de connexion &quot;Vous n&#39;avez peut-être pas l&#39;autorisation d&#39;utiliser cette ressource réseau&quot; est apparu soudainement et sans raison évidente, alors le problème est probablement dû à l&#39;installation d&#39;un Windows Mettre à jour. Dans ce cas, continuez à lire ci-dessous pour résoudre le problème. </p> <p> * Remarque : si vous rencontrez l&#39;erreur de partage à la mi-janvier 2019, le coupable est la mise à jour de sécurité Windows suivante : <a href=\"https://support.microsoft.com/el-gr/help/4480970/windows-7-update-kb4480970\" target=\"_blank\" rel=\"nofollow noopener\"> 8 janvier 2019 : KB4480970 (regroupement mensuel) </a> . </p> <h6> Méthode 1. Désinstallez la dernière mise à jour de Windows. </h6> <p> Sur la machine avec le dossier partagé : </p> <p> 1. Cliquez avec le bouton droit sur l&#39;icône « Mon ordinateur » et sélectionnez <strong> Propriétés </strong> . <br> 2. Cliquez sur <strong> Windows Update </strong> . </p> <p><img src=\"images/image_thumb-6-686.png\" alt=\"fix Network Shared Folder is Not Accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. Cliquez sur <strong> Mises à jour installées </strong> . </p> <p><img src=\"images/image_thumb-7-999.png\" alt=\"fix cannot access shared folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Triez les mises à jour par date d&#39;installation, en cliquant sur <strong> Installé sur. </strong></p> <p><img src=\"images/image_thumb-8-158.png\" alt=\"uninstall windows update\" loading=\"lazy\"></p> <p> </p> <p> 5. Mettez en surbrillance la dernière mise à jour installée pour Windows et cliquez sur <strong> Désinstaller. </strong> * </p> <p> * par exemple. Si vous rencontrez l&#39;erreur de partage à la mi-janvier 2019, continuez et désinstallez la &quot;Mise à jour de sécurité pour Microsoft Windows KB4480970&quot;. </p> <p><img src=\"images/image_thumb-9-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Une fois l&#39;installation terminée, <strong> redémarrer </strong> l&#39;ordinateur. <br> 7. Après le redémarrage, essayez à nouveau d&#39;accéder au dossier partagé à partir de la machine cliente. Appliquez ensuite les actions suggérées selon votre cas : </p> <ul> <li><strong> Cas A : </strong> Si le problème persiste, procédez à la désinstallation de toutes les dernières mises à jour installées ou continuez à <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> méthode 2 </a> au dessous de. </li> <li><strong> Cas B : </strong> Si le problème est résolu, empêchez l&#39;installation de la mise à jour supprimée à l&#39;avenir. Pour faire ça: </li> </ul> <blockquote><p> 1. Accédez à Windows Update et <strong> Vérifier les mises à jour </strong> . <br> 2. Cliquez sur <strong> Mises à jour importantes </strong> . </p></blockquote> <p><img src=\"images/image_thumb-22-393.png\" alt=\"view important updates\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 3. Faites un clic droit sur la mise à jour problématique et cliquez sur <strong> Masquer la mise à jour </strong> . <br> 4. Enfin cliquez sur <strong> d&#39;accord </strong> puis fermez la mise à jour Windows. </p></blockquote> <p><img src=\"images/image_thumb-23-795.png\" alt=\"hide update windows 7\" loading=\"lazy\"></p> <h6> Méthode 2. Restaurez votre PC à un état de fonctionnement précédent. </h6> <p> Sur la machine avec le dossier partagé : </p> <p> 1. Appuyez sur Windows <img src=\"images/image_thumb8_thumb-632.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez <strong> rstrui </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> pour lancer la restauration du système. </p> <p><img src=\"images/rstui-1-300x148-611.png\" alt=\"rstui\" loading=\"lazy\"></p> <p> </p> <p> 3. Cliquez sur <strong> Suivant </strong> au premier écran. <br> 4. Choisissez un état de fonctionnement antérieur (Date/Heure) et cliquez sur <strong> Suivant </strong> pour démarrer le processus de restauration. </p> <p><img src=\"images/image_thumb-50-355.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Après la restauration du système, essayez à nouveau d&#39;accéder au dossier partagé à partir de la machine cliente. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître ce problème. </p>"}