{"title":"COMMENT : Supprimer l&#39;historique Internet, les mots de passe et les cookies de votre navigateur Web (Chrome, Firefox, IE)","content":"<p> Lorsque vous visitez un site Web avec votre navigateur Web, le site Web envoie des informations au navigateur et le navigateur stocke ces informations dans de petits fichiers texte appelés <strong> biscuit </strong> s. Les cookies stockent les préférences de l&#39;utilisateur pour ce site Web, par ex. les informations de connexion, afin que l&#39;utilisateur n&#39;ait pas à ressaisir les informations de connexion (nom d&#39;utilisateur et/ou mot de passe) lorsqu&#39;il revient sur le même site Web. Les cookies peuvent également conserver un historique des pages du site Web visitées par l&#39;utilisateur, afin que l&#39;utilisateur n&#39;ait pas à s&#39;en souvenir ou à naviguer à travers toutes les pages du site Web, jusqu&#39;à ce qu&#39;il trouve ce qu&#39;il veut. </p> <p> Dans le même temps, lorsque vous visitez un site Web, le navigateur stocke une copie locale de toutes les pages Web que vous avez visitées, afin d&#39;économiser la bande passante de connexion et de réduire le temps de chargement des pages Web lors de votre prochaine visite. Cette &quot;copie locale de pages Web&quot; est connue sous le nom de &quot; <strong> Fichiers Internet temporaires </strong> &quot; de <strong> Cacher </strong> . </p> <p> Les cookies et le cache, après un certain temps, peuvent contenir une quantité importante d&#39;espace disque et il est nécessaire de les effacer. Dans d&#39;autres cas, vous devrez peut-être supprimer le cache du navigateur et les cookies afin de recharger totalement le contenu du site Web ou pour des raisons de sécurité et de confidentialité : par ex. si vous ne le souhaitez pas, une tierce personne pour savoir quelles pages Web vous avez visitées (alias : &quot; <strong> Historique de navigation </strong> &quot;) ou quelles sont vos informations de connexion à un site Web (par exemple GMAIL). </p> <p> Dans ce didacticiel, vous trouverez deux (2) façons simples de supprimer l&#39;historique de navigation, les fichiers Internet temporaires (Cache) et les cookies d&#39;Internet Explorer, Chrome et Firefox. </p> <h4> Comment effacer l&#39;historique de navigation Web, les mots de passe enregistrés et les cookies dans Chrome, Firefox et Internet Explorer. </h4> <h5><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Méthode 1. Effacez les données de navigation d&#39;un navigateur spécifique. </a></h5> <h5><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Méthode 2. Supprimez les données de navigation de tous les navigateurs Web en un seul clic ! </a></h5> <p> </p> <h5> Méthode 1. Supprimez l&#39;historique, le cache et les cookies d&#39;un navigateur spécifique. </h5> <p> En général, chaque navigateur Web dispose d&#39;options pour supprimer les données de navigation stockées via le menu Paramètres / Options, mais si vous souhaitez accéder facilement à ces options (sans avoir à naviguer avec votre souris dans le menu du navigateur), appuyez sur <strong> Ctrl </strong> + <strong> Changement </strong> + <strong> Effacer </strong> clés ensemble sur votre fenêtre de navigateur ouverte. Donc… </p> <p><strong> Pour supprimer l&#39;historique de navigation, le cache et les cookies d&#39;Internet Explorer : </strong></p> <p> 1. Ouvrez Internet Explorer et appuyez sur <strong> Ctrl </strong> + <strong> Changement </strong> + <strong> Effacer. <br> </strong> 2. Sélectionnez le type d&#39;informations que vous souhaitez supprimer et cliquez sur le bouton <strong> Effacer </strong> bouton. </p> <p><img src=\"images/image_thumb-18-750.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> Pour supprimer l&#39;historique de navigation, le cache et les cookies de Chrome : </strong></p> <p> 1. Lancez Chrome et appuyez sur <strong> Ctrl </strong> + <strong> Changement </strong> + <strong> Effacer. <br> </strong> 2. Choisissez le type d&#39;informations que vous souhaitez effacer, puis appuyez sur <strong> EFFACER LES DONNÉES </strong> . </p> <p><img src=\"images/image_thumb-19-667.png\" alt=\"clear chrome history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p><strong> Pour supprimer l&#39;historique de navigation, le cache et les cookies de Firefox : </strong></p> <p> 1. Ouvrez Firefox et appuyez simultanément sur <strong> Ctrl </strong> + <strong> Changement </strong> + <strong> Effacer. <br> </strong> 2. Sélectionnez les données que vous souhaitez supprimer de Firefox et cliquez sur <strong> Clair maintenant. </strong></p> <p> </p> <p><img src=\"images/image_thumb-20-864.png\" alt=\"clear firefox history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> Méthode 2.Supprimez l&#39;historique du navigateur, le cache et les cookies de tous les navigateurs Web à la fois. </h5> <p> Si vous voulez vous simplifier la vie, vous pouvez utiliser le <a href=\"https://www.ccleaner.com/\" target=\"_blank\" rel=\"nofollow noopener\"> CCleaner </a> utilitaire pour supprimer facilement les fichiers Internet temporaires, l&#39;historique et les cookies de tous les navigateurs Web que vous utilisez, en un seul clic. </p> <p> 1. <a href=\"https://www.ccleaner.com/ccleaner/download\" target=\"_blank\" rel=\"nofollow noopener\"> Télécharger </a> et installez la version gratuite de l&#39;utilitaire CCleaner. </p> <p> 2. Lancer <strong> CCleaner </strong> et naviguez jusqu&#39;au <strong> les fenêtres </strong> et le <strong> Applications </strong> options de l&#39;onglet, pour sélectionner les informations que vous souhaitez supprimer des navigateurs Web. </p> <p> 3. Une fois terminé, cliquez sur <strong> Exécuter le nettoyeur </strong> . </p> <p><img src=\"images/image_thumb-21-173.png\" alt=\"clear internet history cache cookies - ccleaner\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? </p> <p> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}