{"title":"CORRECTIF : vous n&#39;avez actuellement pas l&#39;autorisation d&#39;accéder à ce dossier sur un lecteur USB externe (résolu)","content":"<p> Ce didacticiel contient des instructions détaillées pour résoudre le problème suivant, lorsque vous essayez d&#39;accéder à un disque USB externe sur un ordinateur portable HP avec Windows 10 : « Vous n&#39;avez actuellement pas l&#39;autorisation d&#39;accéder à ce dossier. Cliquez sur Continuer pour accéder définitivement à ce dossier » . L&#39;erreur persiste, même après avoir appuyé sur le bouton « Continuer » pour accéder au lecteur. </p> <p><img src=\"images/image_thumb-18-636.png\" alt=\"You don't have permission to access this folder\" loading=\"lazy\"></p> <p> L&#39;étrange erreur &quot;Vous n&#39;avez pas la permission d&#39;accéder à ce dossier&quot; est apparue sur un tout nouveau <a href=\"http://www8.hp.com/us/en/products/laptops/product-detail.html?oid=17047142\" target=\"_blank\" rel=\"nofollow noopener\"> HP ProBook 450 G5 </a> ordinateur portable, lorsque l&#39;utilisateur essaie de visualiser le contenu d&#39;un disque USB connecté (Pen drive, USB Drive, etc.). </p> <p> Après avoir enquêté sur le problème, j&#39;ai découvert que ce problème est causé par les autorisations de sécurité qui se sont appliquées sur le <a href=\"http://www8.hp.com/us/en/solutions/computer-security.html\" target=\"_blank\" rel=\"nofollow noopener\"> Gestionnaire de sécurité des clients HP </a> programme. HP Client Security Manager est un programme développé par Hewlett-Packard et vous permet de protéger vos données, votre appareil et votre identité en augmentant la sécurité de votre ordinateur. </p> <h2> Résoudre le problème : aucune autorisation d&#39;accéder à la clé USB sur un ordinateur portable HP (Windows 10/8/7). </h2> <p> 1. Ouvrir <strong> Gestionnaire de sécurité des clients HP </strong> . </p> <p><img src=\"images/image_thumb-13-716.png\" alt=\"HP Client Security manager\" loading=\"lazy\"></p> <p> </p> <p> 2. Cliquez ensuite sur <strong> Sécurité de l&#39;appareil. </strong></p> <p><img src=\"images/image_thumb-14-712.png\" alt=\"fix You Don't have permission to access this folder windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. À <strong> Administrateurs </strong> onglet, définissez la sécurité &#39;Stockage de suppression&#39; sur <strong> Autoriser - Accès complet </strong> et cliquez <strong> Soumettre. </strong></p> <p><img src=\"images/image_thumb-15-364.png\" alt=\"fix You Don't have permission o access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. De plus (si vous le souhaitez), donnez <strong> Accès total </strong> sur le support de stockage amovible pour <strong> Utilisateurs standards </strong> . </p> <p><img src=\"images/image_thumb-19-269.png\" alt=\"no permission to access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Enfin, si vous ne souhaitez pas que HP Device Access Manager contrôle l&#39;accès sur le lecteur, accédez à <strong> Paramètres du lecteur </strong> et positionnez l&#39;interrupteur correspondant sur OFF. </p> <p><img src=\"images/image_thumb-20-822.png\" alt=\"You don't have permission to access USB drive\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître ce problème. </p>"}