{"title":"CORRECTIF : Échec de la relation de confiance entre cette station de travail et le domaine principal (résolu)","content":"<p> Si vous recevez l&#39;erreur « Échec de la relation de confiance entre cette station de travail et le domaine principal » lorsque vous essayez de vous connecter à votre domaine ou lorsque vous essayez d&#39;accéder à un dossier partagé sur une autre machine du domaine, continuez à lire ci-dessous pour résoudre le problème. </p> <p> L&#39;erreur « Relation de confiance entre la station de travail et le domaine principal a échoué » peut apparaître pour les raisons suivantes : </p> <ul> <li> L&#39;ordinateur porte le même nom qu&#39;un autre ordinateur du domaine. </li> <li> Les informations d&#39;identification du domaine (nom d&#39;utilisateur ou mot de passe) ne sont pas valides. </li> <li> Le compte de l&#39;ordinateur a expiré. * </li> </ul> <p> * Remarque : Certaines organisations préconstruisent des ordinateurs (ou des clones d&#39;ordinateurs) pour une utilisation ultérieure. Si le compte de l&#39;ordinateur a expiré, il ne pourra plus s&#39;authentifier auprès du domaine. Dans de tels cas, les ordinateurs qui ne peuvent pas s&#39;authentifier auprès du domaine doivent être supprimés du domaine et y être joints. (étape 4) </p> <p><img src=\"images/image_thumb-32-740.png\" alt=\"FIX: Trust Relationship Between this Workstation and the Primary Domain Failed \" loading=\"lazy\"></p> <h4> Comment CORRIGER : Échec de la relation de confiance entre la station de travail et le domaine. </h4> <h6> Méthode 1. Vérifiez que les informations d&#39;identification du domaine sont correctes. </h6> <p> Tout d&#39;abord assurez-vous que les identifiants sont corrects et surtout le mot de passe. si vous avez cloné la machine à partir d&#39;une image informatique prise dans le passé et que le code a changé depuis. </p> <h6> Méthode 2. Vérifiez les noms d&#39;ordinateur en double. </h6> <p> Assurez-vous que le nom de l&#39;ordinateur est unique et qu&#39;il n&#39;y a pas d&#39;autre ordinateur sur le réseau avec le même nom. </p> <h6> Méthode 3. Vérifiez les adresses IP en double. </h6> <p> Assurez-vous que l&#39;adresse IP de l&#39;ordinateur est unique et n&#39;entre pas en conflit avec une autre adresse IP sur le réseau. </p> <h6> Méthode 4. Supprimez et rejoignez l&#39;ordinateur dans le domaine. </h6> <p> La méthode habituelle pour corriger une relation d&#39;approbation entre un ordinateur et un domaine consiste à supprimer et à rajouter l&#39;ordinateur affecté au domaine. </p> <h5> Étape 1. Supprimez le compte d&#39;ordinateur du domaine. </h5> <p> 1. Connectez-vous au serveur Active Directory. <br> 2. Ouvrir <strong> Utilisateurs et ordinateurs Active Directory. <br> </strong> 3. Développez le <strong> Des ordinateurs </strong> récipient. <br> 4. Cliquez avec le bouton droit sur l&#39;ordinateur concerné et sélectionnez <strong> Effacer. </strong></p> <p><img src=\"images/image_thumb-39-366.png\" alt=\"Delete Computer Account from Domain\" loading=\"lazy\"></p> <h5> Étape 1. Supprimez et rejoignez l&#39;ordinateur dans le domaine. </h5> <p> 1. Connectez-vous à l&#39;ordinateur concerné avec le compte Administrateur LOCAL (Nom de l&#39;ordinateur\\Administrateur). </p> <p> 2. Appuyez sur Windows <img src=\"images/image_thumb8_thumb-480.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. </p> <p> 2a. Taper <strong> sysdm.cpl </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb7_thumb-169.png\" alt=\"system properties\" loading=\"lazy\"></p> <p> 3. Dans l&#39;onglet &quot;Nom de l&#39;ordinateur&quot;, cliquez sur <strong> Changer </strong> . </p> <p><img src=\"images/image_thumb-37-924.png\" alt=\"Remove Computer from Domain\" loading=\"lazy\"></p> <p> 4. Dans Membre de, sélectionnez <strong> Groupe de travail </strong> , saisissez un nom de groupe de travail (par exemple, &quot; WORKGROUP &quot;) et cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-34-169.png\" alt=\"Change Computer Name - Membership\" loading=\"lazy\"></p> <p> 5. Saisissez les informations d&#39;identification de l&#39;administrateur et cliquez sur <strong> d&#39;accord </strong> . <br> 6. <strong> Redémarrer </strong> l&#39;ordinateur. </p> <p> 7. Effectuez à nouveau les étapes 1 à 4, mais cette fois, à l&#39;étape 4, sélectionnez <strong> Domaine, </strong> saisissez le nom de domaine et cliquez sur <strong> D&#39;ACCORD. </strong></p> <p><img src=\"images/image_thumb-38-928.png\" alt=\"Add computer to domain\" loading=\"lazy\"></p> <p> 8. Saisissez les informations d&#39;identification de l&#39;administrateur de domaine et cliquez sur <strong> d&#39;accord </strong> . <br> 9. <strong> Redémarrer </strong> votre PC et connectez-vous au domaine en utilisant le compte d&#39;utilisateur du domaine. </p> <h6> Méthode 5. Réinitialiser le compte d&#39;ordinateur dans le domaine. </h6> <p> 1. Connectez-vous au serveur Active Directory. <br> 2. Ouvrir <strong> Utilisateurs et ordinateurs Active Directory. <br> </strong> 3. Développez le <strong> Des ordinateurs </strong> récipient. <br> 4. Cliquez avec le bouton droit sur l&#39;ordinateur concerné et sélectionnez <strong> Réinitialiser le compte. </strong></p> <p><img src=\"images/image_thumb-36-935.png\" alt=\"Reset Computer Account in Domain\" loading=\"lazy\"></p> <p> 5. Enfin, <strong> redémarrer </strong> les <strong> machine affectée </strong> et connectez-vous au domaine. </p> <p> C&#39;est tout les gens ! Quelle méthode a fonctionné pour vous ? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}