{"title":"Comment créer des clichés instantanés de fichiers avec le planificateur de tâches dans Windows 10.","content":"<p> Dans un tutoriel précédent, j&#39;ai mentionné la façon de sauvegarder vos fichiers personnels avec <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Historique du fichier </a> dans Windows 10. Dans ce didacticiel, je vais montrer comment créer automatiquement des clichés instantanés de vos fichiers personnels à l&#39;aide du planificateur de tâches. Les clichés instantanés de vos fichiers vous permettront de restaurer un fichier ou un dossier spécifique à une version antérieure (à un moment donné). </p> <p> La fonctionnalité de cliché instantané introduite pour la première fois dans Windows Server 2003, puis ajoutée aux versions Windows Vista et 7, dans le cadre de la fonctionnalité de restauration du système. Le processus de « copie fantôme » peut prendre des copies de sauvegarde et des instantanés de l&#39;état actuel du système et des fichiers personnels, même s&#39;ils sont utilisés. Le processus de récupération de fichiers à partir des clichés instantanés est plus communément appelé &quot;Restaurer les versions précédentes&quot;. </p> <h4> Comment créer quotidiennement un cliché instantané de vos fichiers sous Windows 10. * </h4> <p><strong> * Remarques: </strong><br> 1. En suivant les instructions ci-dessous, vous pourrez créer quotidiennement des clichés instantanés (instantanés) de l&#39;intégralité du volume &quot;C:\\&quot;. (Fichiers système Windows et données personnelles) <br> 2. Les clichés instantanés peuvent être utilisés pour restaurer vos fichiers à un moment antérieur, en utilisant la fonction &quot;Restaurer la version précédente&quot; ou en utilisant un utilitaire tiers qui peut accéder aux clichés instantanés, comme le <a href=\"https://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowExplorer </a> ou la <a href=\"https://www.nirsoft.net/utils/shadow_copy_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> OmbreCopierVue </a> . <br> 3. Les clichés instantanés <strong> ne peut pas être utilisé pour restaurer votre système </strong> à un moment antérieur, en utilisant le <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> Restauration du système </a> outil. Si vous souhaitez pouvoir restaurer votre système à l&#39;aide de la restauration du système, continuez et <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Activez la protection de restauration du système. </a> <br> 4. Enfin, gardez à l&#39;esprit que les clichés instantanés créés ne constituent pas une sauvegarde fiable, car les « clichés instantanés » sont stockés sur votre lecteur principal C:\\, et si le lecteur tombe en panne, vous perdrez toutes vos données. Pour créer une sauvegarde fiable de vos données, lisez les instructions de cet article : <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment sauvegarder des fichiers personnels avec l&#39;historique des fichiers dans Windows 10. </a></p> <p> </p> <p><strong> Pour créer des versions précédentes de vos fichiers personnels à l&#39;aide de clichés instantanés : </strong></p> <p> 1. Ouvrir <strong> Planificateur de tâches </strong> . Si vous ne savez pas comment faire, alors… </p> <blockquote><p> 1. Dans le champ de recherche, tapez <strong> Tâche </strong> ou alors <strong> Planificateur de tâches </strong> . <br> 2. Ouvrez le « Planificateur de tâches » à partir des résultats de la recherche. </p></blockquote> <p><img src=\"images/image_thumb-31-630.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Dans le planificateur de tâches, cliquez sur <strong> Créer une tâche </strong> . </p> <p><img src=\"images/image_thumb-23-462.png\" alt=\"How to Start ThrottleStop at Windows Startup\" loading=\"lazy\"></p> <p> </p> <p> 3. À <strong> Général </strong> languette: </p> <blockquote><p> 1. Tapez « Créer un cliché instantané de mes fichiers » comme nom de la tâche. <br> 2. <strong> Vérifier </strong> les <strong> Exécuter avec les privilèges les plus élevés </strong> boîte. </p></blockquote> <p> Remarque : Si vous souhaitez démarrer la tâche en arrière-plan, placez un point sur <strong> Exécuter que l&#39;utilisateur soit connecté ou non </strong> puis saisissez votre mot de passe de connexion. </p> <p><img src=\"images/image_thumb-62-499.png\" alt=\"create shadow copies task windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Sélectionnez ensuite le <strong> Déclencheurs </strong> onglet et cliquez sur <strong> Nouveau </strong> . <br> 4a. Dans la fenêtre « Nouveau déclencheur », spécifiez la fréquence à laquelle créer un instantané de vos fichiers et cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-63-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Sélectionnez ensuite le <strong> Actions </strong> onglet et cliquez sur <strong> Nouveau </strong> . <br> 5a. Dans la fenêtre « Nouvelle action » : </p> <blockquote><p> 1. Sélectionnez <strong> Démarrer un programme </strong> . <br> 2. Dans « Programme/script », saisissez : <strong> wmic </strong><br> 3. Dans le champ &quot;Ajouter des arguments (facultatif)&quot;, saisissez : </p> <ul> <li><strong> appel de cliché instantané create Volume=C:\\ </strong></li> </ul> <p> 4. Une fois terminé, cliquez sur <strong> D&#39;ACCORD. </strong></p></blockquote> <p><img src=\"images/image_thumb-66-640.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Cliquez sur <strong> d&#39;accord </strong> à nouveau pour fermer les propriétés de la tâche planifiée. </p> <p><img src=\"images/image_thumb-67-138.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Pour créer votre première sauvegarde, faites un clic droit sur la tâche et sélectionnez <strong> Cours </strong> . </p> <p><img src=\"images/image_thumb-68-388.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Vous avez terminé ! Désormais, chaque fois que vous souhaitez restaurer un fichier/dossier à sa version précédente, faites un clic droit dessus et sélectionnez <strong> Restaurer les versions précédentes </strong> . </p> <p><img src=\"images/image_thumb-69-568.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Informations utiles: <br> </strong> 1. L&#39;espace maximal alloué pouvant être utilisé pour stocker les clichés instantanés est la quantité d&#39;espace que la restauration du système peut utiliser pour stocker sur les points de restauration. <br> 2. Pour connaître l&#39;espace de stockage utilisé et maximal alloué aux clichés instantanés, donnez cette commande dans l&#39;invite de commande (Admin) : </p> <ul> <li><strong> stockage d&#39;ombres de la liste vssadmin </strong></li> </ul> <p><img src=\"images/image_thumb-76-672.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Pour modifier l&#39;espace maximum alloué pour les clichés instantanés et les points de restauration du système, accédez au <strong> Protection du système </strong> paramètres pour le <strong> Disque local (C :) </strong><br> 4. Si vous souhaitez supprimer tous les clichés instantanés enregistrés, vous devez également effacer les points de restauration enregistrés. Si vous voulez le faire, cliquez sur le <strong> Supprimer tous les points de restauration </strong> bouton dans les paramètres de protection du système. </p> <p><img src=\"images/image_thumb-77-662.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}