{"title":"CORRECTIF : erreurs 0x800707e7, 0x000007E7 dans la mise à jour Windows 10.","content":"<p> Le code d&#39;erreur de la mise à jour de Windows 10 &quot;0x800707E7 – 0x3000D: L&#39;installation a échoué dans la phase FIRST_BOOT avec une erreur lors de l&#39;opération MIGRATE_DATA&quot;, se produit généralement lorsque Windows ne peut pas migrer un profil utilisateur. </p> <p> L&#39;erreur 0x800707E7 dans Windows 10 Update, couramment rencontrée sur les ordinateurs équipés de cartes graphiques NVIDIA, qui utilisent le service de mise à jour NVIDIA pour mettre à jour les pilotes ou d&#39;autres logiciels NVIDIA. Plus précisément, sur les systèmes de cartes NVIDIA, lorsque vous installez le logiciel NVIDIA, un nouvel utilisateur est automatiquement créé dans Windows, nommé &quot;UpdatusUser&quot; qui est utilisé par le service NVIDIA Update. </p> <p> Dans ce guide, vous trouverez des instructions étape par étape pour résoudre les erreurs suivantes dans la mise à jour Windows 10 : </p> <ul> <li> <ul> <li> 0x800707E7 – 0x3000D : L&#39;installation a échoué dans la phase FIRST_BOOT avec une erreur lors de l&#39;opération MIGRATE_DATA </li> <li> 0x000007E7 : ERROR_PROFILE_DOES_NOT_MATCH_DEVICE, le profil spécifié est destiné à un périphérique d&#39;un type différent de celui spécifié. </li> </ul> </li> </ul> <h2> Comment résoudre les erreurs de mise à jour de Windows 10 0x800707e7, 0x000007E7. </h2> <h3> Étape 1. Désinstallez le logiciel NVIDIA de votre machine. </h3> <p> Si vous possédez une carte graphique NVIDIA, accédez à <strong> Panneau de commande </strong> -&gt; <strong> Programmes et fonctionnalités </strong> et <strong> Désinstaller </strong> tout <strong> Logiciel NVIDIA </strong> .* </p> <p> * Remarque : Cette étape s&#39;applique uniquement aux systèmes dotés de cartes NVIDIA. Si vous ne possédez pas de carte graphique NVIDIA, passez à l&#39;étape 2. </p> <p><strong> Pour désinstaller le logiciel NVIDIA. </strong></p> <p> 1. Naviguez dans <strong> Programmes et fonctionnalités </strong> dans le Panneau de configuration. Pour faire ça: </p> <blockquote><p> 1. Appuyez simultanément sur Windows <img src=\"images/image_thumb36-131.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez : <strong> appwiz.cpl </strong> et cliquez <strong> d&#39;accord </strong> . </p></blockquote> <p><img src=\"images/image_thumb-24-479.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 2. Sélectionnez un par un tous les logiciels NVIDIA et cliquez sur <strong> Désinstaller. </strong></p> <p><img src=\"images/image_thumb-67-843.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Suivez les instructions à l&#39;écran pour supprimer le logiciel NVIDIA de votre ordinateur. <br> 4. Lorsque la désinstallation est terminée <strong> redémarrer </strong> votre PC et passez à l&#39;étape suivante. </p> <h3> Étape 2. Supprimez &quot;UpdatusUser&quot; et tout profil d&#39;utilisateur inconnu. </h3> <p> 1. Cliquez avec le bouton droit sur l&#39;icône de votre ordinateur (Ce PC) dans l&#39;explorateur et choisissez <strong> Propriétés </strong> . <br> 2. Cliquez sur <strong> Réglages avancés du système </strong> . <br> 3. À <strong> Des profils d&#39;utilisateurs </strong> , Cliquez sur <strong> Paramètres </strong> . </p> <p><img src=\"images/image_thumb-68-812.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Sélectionnez et <strong> effacer </strong> les <strong> Mettre à jour l&#39;utilisateur </strong> profil, ou tout autre profil qui vous est inconnu ( <strong> sauf </strong> votre profil et le <strong> Profil par défaut </strong> ). </p> <p><img src=\"images/image_thumb-69-946.png\" alt=\"Delete User Profile\" loading=\"lazy\"></p> <p> 4. Une fois terminé, cliquez sur <strong> d&#39;accord </strong> et passez à l&#39;étape suivante. </p> <h3></h3> <h3> Étape 3. Supprimez les profils d&#39;utilisateurs inconnus dans le registre. </h3> <p> 1. Ouvrez l&#39;Éditeur du Registre : pour cela : </p> <blockquote><p> 1. Appuyez sur Windows <img src=\"images/image_thumb41-520.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez <strong> regedit </strong> et appuyez sur <strong> Entrer </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-235.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Dans l&#39;Éditeur du Registre, accédez à la clé suivante dans le volet gauche : </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\ProfileList </li> </ul> <p> 4a. Maintenant, développez le <strong> Liste de profils </strong> et cliquez sur chaque profil &quot;S-1-5-21-xxxx&quot; et voyez si l&#39;un d&#39;entre eux a la valeur &quot; <strong> C:\\Users\\UpdatusUser&quot; </strong> à <strong> ProfileImagePath. </strong></p> <p><img src=\"images/image_thumb-70-754.png\" alt=\"FIX: 0x800707e7 or 0x000007E7 errors in Windows 10 Update.\" loading=\"lazy\"></p> <p> 4b. Si vous trouvez le &quot; <strong> C:\\Users\\UpdatusUser&quot; </strong> valeur <strong> </strong> sur un profil, puis sélectionnez le profil dans le volet de gauche et <strong> Effacer </strong> il. </p> <p><img src=\"images/image_thumb-71-506.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5.  Enfin, voyez le nom complet de chaque clé de profil &quot;S-1-5-21-xxxx&quot; (sous la &quot;clé ProfileList&quot;), et <strong> effacer </strong> toute clé de profil qui a un <strong> .bak </strong> extension à la fin de son nom. </p> <p><img src=\"images/image_thumb-72-738.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Une fois terminé, fermez l&#39;Éditeur du Registre et <strong> redémarrer </strong> votre ordinateur. <br> 7. Après redémarrage : </p> <blockquote> <p> une. Aller vers <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Site de téléchargement de Windows 10 </a> et cliquez sur le <strong> Mettez à jour maintenant </strong> bouton. </p> <p><img src=\"images/image_thumb-65-120.png\" alt=\"Download Windows 10 21H1 \" loading=\"lazy\"></p> <p> b. Enregistrez le fichier &quot;Windows10Upgrade9252.exe&quot; sur votre bureau. <br> c. Double-cliquez sur le fichier téléchargé pour ouvrir le <strong> Assistant de mise à niveau Windows </strong> . <br> ré. Cliquez sur <strong> Mettez à jour maintenant </strong> pour lancer la mise à jour. </p></blockquote> <p> 8. La mise à jour de Windows devrait maintenant être terminée sans problème et sans erreur 0x800707e7 (ou 0x000007E7). <br> 9. Enfin, après la mise à jour de Windows 10, et si vous possédez une carte graphique NVIDIA, continuez et réinstallez le logiciel NVIDIA. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître ce problème. </p>"}