{"title":"CORRECTIF : microphone non détecté ou ne fonctionnant pas sous Windows 10 (résolu)","content":"<p> Ce guide contient des instructions pour résoudre les problèmes de &quot;microphone non détecté&quot; ou de &quot;microphone ne fonctionnant pas&quot;, sous Windows 10. Si vous rencontrez des problèmes avec votre microphone sous Windows 10, cela peut être dû à plusieurs raisons. Le problème &quot;le microphone ne fonctionne pas&quot; est un problème pour de nombreux utilisateurs de Windows 10 et apparaît généralement après une mise à jour de Windows. </p> <p> Ce didacticiel contient plusieurs solutions pour résoudre les problèmes de microphone sous Windows 10. </p> <h4> Comment CORRIGER : le microphone Windows 10 ne fonctionne pas ou n&#39;est pas détecté. * </h4> <p> * Remarque : Si vous rencontrez des problèmes avec votre micro, dans une application particulière, essayez ce qui suit : </p> <blockquote><p> 1. Assurez-vous que l&#39;application en question est autorisée à utiliser le micro, en suivant les instructions de la méthode 1 ci-dessous. <br> 2. Assurez-vous que le micro est sélectionné comme périphérique d&#39;entrée par défaut dans les paramètres de l&#39;application. (par exemple, dans Skype, accédez à <strong> Paramètres </strong> et assurez-vous que votre microphone ou votre casque est sélectionné). <br> 3. Fermez toute autre application susceptible d&#39;utiliser votre microphone. <br> 4. Redémarrez votre PC et testez à nouveau votre MIC. </p></blockquote> <h6> Solution 1. Autorisez les applications à accéder à votre microphone. </h6> <p> La première méthode, pour résoudre les problèmes avec votre microphone sous Windows 10, consiste à vous assurer que toutes les applications ont accès à votre microphone. Pour faire ça: </p> <p> 1. . Depuis le menu Démarrer <img src=\"images/image_thumb2_thumb_thumb-856.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> Cliquez sur <strong> Paramètres </strong><img src=\"images/image_thumb-66-804.png\" alt=\"image\" loading=\"lazy\"> puis ouvrir <strong> Intimité </strong> . <br> 2. Sélectionnez <strong> Microphone </strong> dans le volet de gauche puis <strong> Allumer </strong> les <strong> Autorisez les applications à accéder à votre microphone. </strong></p> <p><img src=\"images/image_thumb-34-268.png\" alt=\"How to FIX: Windows 10 Microphone Not Detected or Not Working\" loading=\"lazy\"></p> <p> 3. Ensuite, faites défiler vers le bas et assurez-vous que l&#39;application que vous souhaitez utiliser votre microphone peut y accéder. * </p> <p> * Suggestion : Pour votre confidentialité, désactivez l&#39;accès au microphone à toute application que vous ne souhaitez pas que votre microphone utilise. </p> <p><img src=\"images/image_thumb-35-517.png\" alt=\" FIX Windows 10 Microphone Not Working\" loading=\"lazy\"></p> <p> 4. Une fois terminé, testez votre microphone. </p> <h6> Solution 2. Vérifiez si votre microphone est le périphérique d&#39;entrée par défaut (périphérique d&#39;enregistrement). </h6> <p> 1. . Depuis le menu Démarrer <img src=\"images/image_thumb2_thumb_thumb-930.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> Cliquez sur <strong> Paramètres </strong><img src=\"images/image_thumb-66-142.png\" alt=\"image\" loading=\"lazy\"> puis ouvrir <strong> Système </strong> . <br> 2. Cliquez sur <strong> Sonner </strong> dans le volet gauche, puis parlez pour tester votre microphone. Si votre microphone fonctionne, vous devriez voir la barre de défilement se déplacer en dessous. Sinon, cliquez sur <strong> Gérer les périphériques audio. </strong></p> <p><img src=\"images/image_thumb-36-254.png\" alt=\"Test Microphone Windows 10\" loading=\"lazy\"></p> <p> 3. Dans « Gérer les options des périphériques audio, assurez-vous que votre microphone est répertorié sous « Périphériques d&#39;entrée » comme périphérique d&#39;entrée par défaut, et son <strong> Activée </strong> . Sinon, cliquez sur votre microphone et cliquez sur <strong> Activer. </strong></p> <p><img src=\"images/image_thumb-37-753.png\" alt=\"Enable Microphone Windows 10\" loading=\"lazy\"></p> <h6> Solution 3. Vérifiez les paramètres du microphone dans le Panneau de configuration. </h6> <p> 1. Accédez à Windows <strong> Panneau de commande </strong> et ouvrir <strong> Sonner. </strong></p> <p><img src=\"images/image_thumb-14-511.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Au <strong> Enregistrement </strong> onglet, sélectionnez votre microphone et cliquez sur <strong> Propriétés. </strong></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"Microphone Properties\" loading=\"lazy\"></p> <p> 3. Au <strong> Niveau </strong> languette, <strong> traîne </strong> le curseur vers le <strong> droite </strong> , pour augmenter le volume du microphone et vous assurer que votre micro n&#39;est pas mis en sourdine (si votre micro est en sourdine, son icône de volume <img src=\"images/image_thumb-39-434.png\" alt=\"image\" loading=\"lazy\"> , sera affiché avec un symbole rouge <img src=\"images/image_thumb-40-819.png\" alt=\"image\" loading=\"lazy\"> ). Lorsque vous avez terminé, cliquez <strong> d&#39;accord </strong> et <strong> d&#39;accord </strong> pour fermer les propriétés du son. </p> <p><img src=\"images/image_thumb-41-896.png\" alt=\"Microphone Levels\" loading=\"lazy\"></p> <h6> Solution 4. Modifiez le pilote de la carte son. </h6> <p> La dernière méthode pour résoudre les problèmes de microphone dans Windows 10 consiste à changer le pilote audio, en particulier si vous possédez un périphérique Realtek Audio. Pour faire ça: </p> <p> 1. Ouvrir <strong> Gestionnaire de périphériques </strong> . Pour faire ça: </p> <blockquote><p> 1. Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-918.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Dans la case &quot;Ouvrir&quot;, saisissez : <strong> devmgmt.msc </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-5-732.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Développer </strong> les <strong> Contrôleurs son, vidéo et jeu. </strong></p> <p> 3. <strong> Clic-droit </strong> sur le <strong> Realtek High Definition Audio </strong> appareil et sélectionnez <strong> Mettre à jour le pilote. <br> </strong></p> <p><img src=\"images/image_thumb-6-629.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Sélectionnez <strong> Parcourir mon ordinateur pour les pilotes. </strong></p> <p><img src=\"images/image_thumb-7-637.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Sélectionnez <strong> Laissez-moi choisir parmi une liste de pilotes disponibles sur mon ordinateur </strong> . </p> <p><img src=\"images/image_thumb-8-118.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. Sur l&#39;écran suivant, sélectionnez le <strong> Périphérique audio haute définition </strong> et cliquez <strong> Suivant. </strong></p> <p><img src=\"images/image_thumb-20-989.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p> 8. Dans la fenêtre « Update Driver Warning », cliquez sur « Oui » pour installer le nouveau pilote. <br> 9. Une fois l&#39;installation du pilote terminée, <strong> redémarrer </strong> ton ordinateur. <br> 10. Après le redémarrage, continuez et testez votre microphone. </p> <h6></h6> <h6> Solution 5. Désinstallez et réinstallez les pilotes de la carte son. </h6> <p> La solution finale pour résoudre le problème de non fonctionnement du microphone, dans Windows 10, consiste à désinstaller et réinstaller complètement les pilotes de la carte son. </p> <p> 1. Accédez à <strong> Panneau de commande </strong> &gt; <strong> Programme et fonctionnalités </strong> et <strong> désinstaller </strong> tout logiciel lié à votre carte son. <br> 2. Ouvrir <strong> Gestionnaire de périphériques </strong> et <strong> développer </strong> les <strong> Contrôleurs son, vidéo et jeu. <br> </strong> 3. <strong> Clic-droit </strong> sur l&#39;installé <strong> Appareil audio </strong> et cliquez <strong> Désinstaller l&#39;appareil. </strong></p> <p><img src=\"images/image_thumb-42-701.png\" alt=\"Uninstall Sound Card Device\" loading=\"lazy\"></p> <p> </p> <p> 4. Une fois terminé, accédez au site d&#39;assistance du fabricant de votre ordinateur ou ordinateur portable, puis téléchargez et installez le dernier pilote pour votre carte son. <br> 5. Après l&#39;installation, <strong> redémarrer </strong> votre PC et vérifiez si votre microphone fonctionne. </p> <p><strong> Aide supplémentaire : </strong> Si, après avoir appliqué les solutions ci-dessus, votre micro ne fonctionne toujours pas, il est probablement endommagé. Pour vous en assurer, si vous possédez un ordinateur portable, branchez un microphone externe ou utilisez un autre microphone si vous possédez un ordinateur de bureau. </p> <p> C&#39;est tout les gens ! Quelle méthode a fonctionné pour vous ? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}