{"title":"Comment afficher et exporter les mots de passe Firefox.","content":"<p> Dans ce didacticiel, je vais vous montrer comment afficher et gérer les mots de passe enregistrés dans le navigateur Web Mozilla Firefox. Comme vous le savez déjà, le navigateur Firefox vous offre la possibilité d&#39;enregistrer votre nom d&#39;utilisateur et votre mot de passe lors de votre première visite sur un site Web. Si vous choisissez d&#39;enregistrer vos informations d&#39;identification, Firefox les mémorisera et la prochaine fois que vous vous connecterez au site Web, vous n&#39;aurez pas besoin de les retaper. </p> <p><img src=\"images/image_thumb-98-507.png\" alt=\"How to View and Export Firefox Passwords.\" loading=\"lazy\"></p> <p> Si, au fil du temps, vous oubliez vos identifiants de connexion, lisez ce didacticiel pour savoir comment afficher et exporter les mots de passe stockés dans Firefox. </p> <h4> Comment gérer, afficher et exporter les mots de passe enregistrés dans Mozilla Firefox. </h4> <p><strong> Comment afficher les mots de passe Firefox </strong></p> <p> 1. Depuis le menu Firefox <img src=\"images/image_thumb-99-587.png\" alt=\"image\" loading=\"lazy\"> choisir <strong> Connexion et mots de passe </strong> . </p> <p><img src=\"images/image_thumb-100-999.png\" alt=\"View Saved Passwords Firefox\" loading=\"lazy\"></p> <p> </p> <p> 2. Cliquez sur le <strong> Afficher les mots de passe </strong> bouton pour afficher les mots de passe enregistrés dans les sites Web. De plus, dans cette fenêtre, utilisez le <strong> Supprimer </strong> bouton pour supprimer les mots de passe enregistrés de Firefox. </p> <p><img src=\"images/image_thumb-101-863.png\" alt=\"Manage Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p><strong> Comment enregistrer tous les mots de passe Firefox dans un fichier. </strong></p> <p> Pour afficher et exporter tous les mots de passe stockés dans Firefox : </p> <p> 1. Télécharger <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> Mot de passeFox </a> utilitaire ( <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> http://www.nirsoft.net/utils/passwordfox.html </a> ) <br> 2. Extrayez le fichier zip téléchargé. <br> 3. Dans le dossier extrait, double-cliquez pour exécuter l&#39;application &quot;PasswordFox.exe&quot;. <br> 4. Appuyez sur <strong> Ctrl </strong> + <strong> UNE </strong> pour sélectionner tous les sites répertoriés, puis à partir du <strong> Déposer </strong> menu choisir <strong> Enregistrer les éléments sélectionnés. </strong></p> <p><img src=\"images/image_thumb-102-438.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Saisissez un nom pour le fichier .txt et cliquez sur <strong> Sauvegarder </strong> . </p> <p><img src=\"images/image_thumb-103-923.png\" alt=\"How to Save Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p> 6. Ouvrez le fichier créé dans le bloc-notes pour afficher tous les mots de passe stockés dans le navigateur Mozilla Firefox. </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}