{"title":"CORRECTIF : Impossible d&#39;ouvrir les liens depuis Windows 10 Email ou Outlook dans Windows 10. (Résolu)","content":"<p> Si vous ne pouvez pas ouvrir les liens des e-mails dans les applications Windows 10 Mail et Outlook, continuez à lire ci-dessous pour résoudre le problème. De nombreux utilisateurs ont signalé qu&#39;après la mise à jour de Windows 10, ils ne pourront pas ouvrir de liens intégrés à partir d&#39;e-mails dans le navigateur Web et recevront une erreur inconnue. </p> <p> Problème dans les détails : Sur un ordinateur Windows 10, les liens hypertexte des e-mails d&#39;Outlook ou de l&#39;application Windows 10 Mail, ne s&#39;ouvrent pas dans le navigateur Web, surtout si vous utilisez comme navigateur par défaut Chrome ou Firefox et non Microsoft Edge . </p> <h4> Comment CORRIGER : Impossible d&#39;ouvrir les liens HTML à partir des e-mails après la mise à jour de Windows 10. </h4> <h6> Méthode 1. Réinitialiser les applications par défaut. </h6> <p> 1. Fermez tous les navigateurs Web ouverts. <br> 2. Fermez l&#39;application de messagerie que vous utilisez (par exemple, Windows 10 Mail, Outlook) </p> <p> 3. Depuis le menu Démarrer <img src=\"images/image_thumb2_thumb_thumb-709.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> Cliquez sur <strong> Paramètres </strong><img src=\"images/image_thumb-66-594.png\" alt=\"image\" loading=\"lazy\"> et cliquez <strong> applications </strong></p> <p><img src=\"images/image_thumb-72-875.png\" alt=\"Windows 10 Apps\" loading=\"lazy\"></p> <p> 4. Choisissez <strong> Applications par défaut </strong> dans le volet de gauche, puis cliquez sur le <strong> Réinitialiser </strong> bouton pour réinitialiser les applications recommandées par Microsoft. </p> <p><img src=\"images/image_thumb-73-622.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 5. Ouvrez maintenant votre programme de messagerie et ouvrez un lien hypertexte à partir d&#39;un e-mail. Normalement, le lien s&#39;ouvrira dans le navigateur Microsoft Edge sans problème. </p> <p> 6. Maintenant, <strong> Fermer </strong> l&#39;application de messagerie à nouveau. </p> <p> 7. Ouvrez le navigateur Web et définissez-le par défaut, ou accédez à <strong> Paramètres &gt; </strong> <strong> Applications &gt; Applications par défaut </strong> et à <strong> Navigateur Web </strong> options, cliquez sur <strong> Microsoft Edge </strong> et sélectionnez votre navigateur préféré comme navigateur Web par défaut. </p> <p><img src=\"images/image_thumb-75-384.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 8. Ouvrez à nouveau l&#39;application Mail et essayez d&#39;ouvrir un lien hypertexte. Si le problème persiste, suivez les étapes de la méthode 2. </p> <h6> Méthode 2. Modifiez les associations HTML dans le Registre. </h6> <p> 1. Appuyez simultanément sur Windows <img src=\"images/image_thumb36-617.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez <strong> regedit </strong> &amp; presse <strong> Entrer. </strong></p> <p><img src=\"images/image_thumb7-779.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2. Dans le volet de gauche, accédez à cette sous-clé : </p> <ul> <li><strong> HKEY_CURRENT_USER\\Software\\Classes\\.html </strong></li> </ul> <p> 3. Maintenant <em> double-cliquer </em> au <strong> (Défaut) </strong> Chaîne dans le volet de droite et définissez les données de valeur sur <strong> fichier html </strong></p> <p><img src=\"images/image_thumb2-467.png\" alt=\"Cannot Open Links from Windows 10 Email or Outlook in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 4. Effectuez la même opération et modifiez le <em><strong> Défaut </strong></em> valeur de chaîne à <strong> fichier html </strong> dans ces sous-clés : </p> <ul> <li><em> HKEY_CURRENT_USER\\Software\\Classes\\.htm </em></li> <li><em> HKEY_CURRENT_USER\\Software\\Classes\\.shtml </em></li> <li><em> HKEY_CURRENT_USER\\Software\\Classes\\.xhtml </em></li> <li><em> HKEY_CURRENT_USER\\Software\\Classes\\.xht <br> </em></li> </ul> <p> 5. Fermez l&#39;éditeur de registre et <strong> redémarrer </strong> ton ordinateur. <br> 6. Essayez d&#39;ouvrir les hyperliens à partir de votre programme de messagerie. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog dans les réseaux sociaux pour aider à faire passer le mot à ce sujet. </p>"}