{"title":"CORRECTIF : Impossible de changer de thème – Thèmes Aero grisés dans Windows 7 (résolu)","content":"<p> Le problème suivant s&#39;est produit sur un ordinateur Windows 7 : Windows est passé au thème de base et l&#39;utilisateur ne peut pas modifier le thème car, lorsque les paramètres de personnalisation sont ouverts, tous les thèmes aéro sont grisés. Au lieu de cela, tous les autres paramètres du panneau de personnalisation sont activés (arrière-plan du bureau, couleur Windows, économiseur d&#39;écran, etc.), attendez-vous à sélectionner un thème différent. </p> <p><img src=\"images/image_thumb-28-129.png\" alt=\"Cannot Change Theme – Themes Greyed Out\" loading=\"lazy\"></p> <p> </p> <p> Ce didacticiel contient des instructions pour résoudre le problème suivant dans Windows 7 : Le thème ne peut pas être modifié – Thèmes grisés. </p> <h4> Comment CORRIGER : Impossible de changer de thème – Les thèmes Aero sont grisés. </h4> <h6> Méthode 1. Analysez votre système à la recherche de virus et de logiciels malveillants. </h6> <p> La première étape pour résoudre le problème &quot;Impossible de changer le thème de base&quot; est de s&#39;assurer que votre système est exempt de virus/programmes malveillants. Pour cette tâche, suivez les instructions de ce guide : <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment analyser votre ordinateur contre les virus et autres programmes malveillants. </a></p> <h6> Méthode 2. Redémarrez le service de thème. </h6> <p> 1. Ouvrez le panneau de configuration des services Windows : Pour ce faire : </p> <ul> <li> Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-720.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. </li> <li> Dans la zone de recherche, saisissez : <strong><em> services.msc </em></strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </li> <li> (Acceptez l&#39;avertissement UAC s&#39;il apparaît). </li> </ul> <p><img src=\"images/image_thumb-12-580.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. Dans le panneau de configuration des services, faites un clic droit sur le <strong> Thèmes </strong> service et choisissez <strong> Redémarrer </strong> . * </p> <p> * Remarque : Si le service est arrêté, cliquez sur <strong> Démarrer </strong> . </p> <p><img src=\"images/image_thumb-29-242.png\" alt=\"Themes Greyed Out - restart theme service\" loading=\"lazy\"></p> <p> </p> <h6> Méthode 3. Activez les styles visuels sur les fenêtres et les boutons. </h6> <p> 1. Cliquez sur le <strong> Démarrer </strong> bouton, clic droit sur <strong> Ordinateur un </strong> et sélectionnez <strong> Propriétés </strong> . </p> <p><img src=\"images/image_thumb-30-382.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Cliquez sur <strong> Réglages avancés du système </strong> à gauche. </p> <p><img src=\"images/image_thumb-31-876.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Dans l&#39;onglet &quot;Avancé&quot;, cliquez sur <strong> Paramètres </strong> dans la section « Performances ». </p> <p><img src=\"images/image_thumb-15-696.png\" alt=\"fix High CPU and DISK Usage Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. À <strong> Effets visuels </strong> onglet, cochez l&#39;option &quot;Utiliser les styles visuels sur les fenêtres et les boutons&quot; et cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-32-631.png\" alt=\"fix Theme cannot be changed - themes greyed out\" loading=\"lazy\"></p> <p> </p> <h6> Méthode 4. Installez les derniers pilotes d&#39;affichage. </h6> <p><strong> 1. </strong> Aller vers <strong> Panneau de commande </strong> &gt; <strong> Programmes et fonctionnalités </strong> et <strong> désinstaller </strong> le pilote VGA actuellement installé. </p> <p><strong> 2. </strong> Lorsque l&#39;opération de désinstallation est terminée <strong> redémarrer </strong> ton ordinateur. </p> <p><strong> 3. </strong> Après le redémarrage, accédez au site d&#39;assistance du fabricant de votre ordinateur pour télécharger et installer les derniers pilotes pour votre carte graphique. Si vous possédez un ordinateur de bureau ou portable* avec une carte AMD/ATI ou NVIDIA VGA, suivez les étapes ci-dessous pour rechercher, télécharger et installer la dernière version du pilote pour votre carte graphique. </p> <p><strong> * Noter: </strong> Si vous ne trouvez pas les pilotes à partir des liens ci-dessous, accédez au site d&#39;assistance du fabricant de votre ordinateur. </p> <p> </p> <p><strong> Pour les GPU basés sur NVIDIA. </strong></p> <ol> <li> <ol> <li> Aller à <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Page de recherche avancée de pilotes NVIDIA </a> et recherchez le pilote correspondant à votre carte graphique. </li> <li> Dans la page des résultats de la recherche, téléchargez une version précédente du pilote. </li> <li> Installez le pilote que vous avez téléchargé et redémarrez votre ordinateur. </li> </ol> </li> </ol> <p> </p> <p><strong> Pour les GPU basés sur AMD. </strong></p> <ul> <li> <ol> <li> Aller à <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Téléchargement du pilote AMD (ATI) </a> et recherchez le pilote correspondant à votre carte graphique. </li> <li> Dans la page des résultats de la recherche, appuyez sur le <strong> Pilotes et logiciels précédents </strong> lien à droite. </li> <li> Installez le pilote que vous avez téléchargé et redémarrez votre ordinateur. </li> </ol> </li> </ul> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}