{"title":"CORRECTIF : Chrome ouvre toujours les options Parcourir en tant qu&#39;invité – Changer de personne au démarrage.","content":"<p> Le didacticiel contient des instructions sur la façon d&#39;empêcher Chrome d&#39;afficher la fenêtre &quot;Changer de personne - Parcourir en tant qu&#39;invité&quot; au démarrage. Problème en détails : Sur un ordinateur Windows, le navigateur Google Chrome ouvre toujours les options &quot;Parcourir en tant qu&#39;invité&quot; et &quot;Ajouter une personne&quot; au démarrage et l&#39;utilisateur doit toujours sélectionner son profil pour utiliser le navigateur Chrome. </p> <p><img src=\"images/image_thumb-26-805.png\" alt=\"FIX Remove Chrome Browse as Guest\" loading=\"lazy\"></p> <p> </p> <h4> Comment supprimer la fenêtre d&#39;options &quot;Navigateur en tant qu&#39;invité - Ajouter une personne&quot; au démarrage de Chrome. </h4> <h6> Méthode 1. Vérifiez si Chrome est défini pour toujours démarrer en mode de navigation invité. </h6> <p> L&#39;une des fonctionnalités les plus utiles du navigateur Google Chrome consiste à créer plusieurs profils d&#39;utilisateurs, en particulier si vous partagez votre ordinateur avec d&#39;autres, ou si vous souhaitez séparer vos favoris et vos paramètres entre vos plusieurs comptes. Dans ce cas, vous pouvez toujours démarrer Chrome avec la fenêtre &quot;Changer de personne&quot;, en ajoutant l&#39;un des commutateurs suivants (entrées de texte) dans le raccourci Chrome : </p> <ul> <li><strong> –profile-directory=&quot;Profil d&#39;invité&quot; </strong></li> <li><strong> –bwsi </strong></li> </ul> <p> </p> <p> Tout d&#39;abord, vérifiez si Chrome est configuré pour toujours ouvrir la fenêtre &quot;Changer de personne/Parcourir en tant qu&#39;invité&quot;. Pour faire ça: </p> <p> 1. Fermez Google Chrome. <br> 2. Faites un clic droit sur le raccourci Chrome sur votre bureau et sélectionnez <strong> Propriétés </strong> . <br> 3. À <strong> Raccourci </strong> onglet, regardez le <strong> Cible </strong> zone de texte et (le cas échéant) <strong> supprimer </strong> les entrées de texte ci-dessus à la fin, puis cliquez sur <strong> d&#39;accord </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-27-916.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Lancez Chrome et dans la fenêtre &quot;Changer de personne&quot;, cliquez sur l&#39;icône/l&#39;image de votre profil (&quot;Vous&quot;). <br> 5. <strong> Redémarrer </strong> Chrome. </p> <p> </p> <h6> Méthode 2. Créez un nouveau profil Google Chrome propre. </h6> <p> Par défaut, Chrome stocke tous les paramètres de profil (signets, mots de passe, extensions, etc.) dans le dossier « Données utilisateur » à l&#39;emplacement suivant sur votre ordinateur : </p> <ul> <li><strong> C:\\Users\\%Username%\\AppData\\Local\\Google\\Chrome\\User Data </strong></li> </ul> <p> Si, pour une raison quelconque, le dossier du profil Chrome est corrompu ou mal modifié par un logiciel malveillant, la meilleure option consiste à forcer Chrome à recréer un nouveau dossier de profil Chrome (vide*). Pour faire ça: </p> <p><strong> * Attention: </strong> N&#39;oubliez pas qu&#39;en supprimant le dossier de stockage de votre profil Chrome, vous supprimez toutes les données stockées (signets, paramètres, extensions, historique, etc.) . Donc, avant de supprimer votre profil Chrome, prenez un <a href=\"https://www.repairwin.com/backup-restore-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> sauvegarde de vos favoris Chrome </a> au cas où vous souhaiteriez réinstaller Chrome. </p> <h5> Étape 1 : Activez la vue Fichiers et dossiers cachés. </h5> <p> 1. Ouvrir <strong> Options de dossier </strong> . <br> 2. À <strong> Vue </strong> languette, <strong> Chèque </strong> les <strong> Afficher les fichiers, dossiers et lecteurs cachés </strong> case à cocher et cliquez sur <strong> D&#39;ACCORD. </strong></p> <p><img src=\"images/image_thumb-6-189.png\" alt=\"enable hidden files folders\" loading=\"lazy\"></p> <h6></h6> <h5> Étape 2. Forcez Chrome à créer un nouveau dossier de profil (nettoyé). </h5> <p> 1. <strong> Fermer </strong> Google Chrome. <br> 2. <strong> Ouvert </strong> Explorateur Windows et accédez à cet emplacement : </p> <ul> <li><strong> C:\\Users\\%USERNAME%\\AppData\\Local\\Google\\Chrome\\ </strong></li> </ul> <p> * Où %USERNAME% = Votre nom d&#39;utilisateur. (par exemple, si votre nom d&#39;utilisateur est &quot;Admin&quot;, alors vous devez naviguer vers ce chemin : &quot;C:\\Users\\Admin\\AppData\\Local\\Google\\Chrome&quot;) </p> <p> 3. <strong> Renommer </strong> le dossier &quot;User Data&quot; sur &quot;User Data.BAK&quot;. </p> <p><img src=\"images/image_thumb-28-373.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Ouvrez maintenant Google Chrome. (Au démarrage, Chrome créera automatiquement un nouveau dossier « Données utilisateur » propre pour stocker vos favoris et vos paramètres). </p> <p> </p> <h6> Méthodes supplémentaires pour résoudre les problèmes de Chrome. </h6> <p><strong> 1. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Vérifiez votre ordinateur pour les virus, les logiciels malveillants, etc. </a></p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Désinstallez et réinstallez complètement Chrome. </a></p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}