{"title":"CORRECTIF : Viber, Yahoo et d&#39;autres applications se bloquent sur les appareils Android – mars 2021 (résolu).","content":"<p> Au cours des dernières heures, plusieurs utilisateurs ont signalé que de nombreuses applications Android plantaient (22 mars 2021). En particulier, Gmail, Viber, Google Chrome et d&#39;autres applications importantes ne s&#39;ouvrent et ne se ferment pas immédiatement après l&#39;ouverture. Le problème affecte de nombreux appareils Android et en particulier les appareils Samsung. Si vous rencontrez un problème similaire, continuez à lire ci-dessous pour savoir comment le résoudre. </p> <p> Mise à jour (23 mars 2021) : Google a rapidement identifié le problème et a constaté que le <strong> Vue Web Android </strong> app était le coupable et l&#39;a corrigé en poussant des mises à jour pour elle et d&#39;autres applications Chrome. </p> <h4> Comment CORRIGER : Android Google Apps, Viber, etc. Problème de plantage (22 mars 2021). </h4> <p> 1. Ouvrez Android <strong> Paramètres. </strong></p> <p> 2. Appuyez sur <strong> Gérer les applications </strong> (ou alors <strong> Applications et notifications </strong> ou alors <strong> Applications </strong> sur certains appareils Android). </p> <p><img src=\"images/image_thumb-27-815.png\" alt=\"FIX: Android Apps are Crashing on Samsung or other Devices.\" loading=\"lazy\"></p> <p> </p> <p> 3. Cliquez sur le menu avec le <strong> trois points </strong><img src=\"images/image_thumb-28-382.png\" alt=\"image\" loading=\"lazy\"> dans le coin supérieur droit et sélectionnez <strong> Afficher toutes les applications </strong> (ou alors <strong> Afficher les applications système </strong> ). </p> <p><img src=\"images/image_thumb-29-272.png\" alt=\"FIX Android GMAIL or Viber Crash \" loading=\"lazy\"></p> <p> </p> <p> 3. Trouvez le <strong> WebView du système Android </strong> application (ou <strong> Vue Web Android </strong> ) dans la liste et ouvrez-la. </p> <p><img src=\"images/image_thumb-30-842.png\" alt=\"FIX GMAIL Chrome or Viber Crash on Android - March 2021\" loading=\"lazy\"></p> <p> </p> <p> 4. Cliquez sur <strong> Désinstallez les mises à jour. </strong></p> <p><img src=\"images/image_thumb-31-471.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Appuyez sur <strong> d&#39;accord </strong> au message d&#39;avertissement. </p> <p> 6. <strong> Redémarrer </strong> votre appareil et le problème devrait avoir disparu. </p> <p> C&#39;est tout les gens ! Quelle méthode a fonctionné pour vous ? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}