{"title":"Comment se connecter automatiquement à Windows 10/8/7 (sans saisir de mot de passe).","content":"<p> Ce tutoriel contient des instructions sur la façon de se connecter automatiquement à Windows 10. En fait, vous apprendrez à vous connecter automatiquement à votre compte utilisateur (compte Microsoft, local ou de domaine), sans avoir à saisir vos informations d&#39;identification lors de la connexion ou de l&#39;écran de verrouillage. . Les instructions s&#39;appliquent au système d&#39;exploitation Windows 10/8/7. </p> <p> Lorsque vous effectuez une nouvelle installation de Windows 10, vous serez invité à spécifier un compte d&#39;utilisateur et un mot de passe pour utiliser l&#39;ordinateur. À cette étape, vous pouvez utiliser votre compte Microsoft (avec le mot de passe de votre compte MS) ou créer un nouveau compte local et un nouveau mot de passe pour vous connecter à Windows. Dans les deux cas (sauf si vous créez un compte local avec un mot de passe vide), vous serez invité à saisir votre mot de passe à chaque démarrage de Windows. </p> <p> Protéger votre propre ordinateur avec un mot de passe est une bonne mesure de sécurité, surtout si vous partagez votre ordinateur avec d&#39;autres, ou lorsque vous voyagez avec votre ordinateur portable ou lorsque votre PC appartient à un environnement professionnel. Mais, si vous êtes le seul utilisateur sur votre ordinateur de bureau autonome, ou si vous utilisez votre ordinateur portable uniquement à la maison, il n&#39;est pas nécessaire de saisir vos informations d&#39;identification à chaque fois que vous souhaitez l&#39;utiliser. * </p> <p><strong> Avertissement: </strong> N&#39;ACTIVEZ PAS LA CONNEXION AUTOMATIQUE sous Windows si vous partagez votre ordinateur avec d&#39;autres personnes ou si vous voyagez avec votre ordinateur portable ou votre tablette, car tous ceux qui trouveront votre ordinateur auront facilement accès à vos fichiers. </p> <h4> Comment vous connecter automatiquement à votre compte d&#39;utilisateur sous Windows 10/8/7/Vista. (Activer la connexion automatique) </h4> <h6> Méthode 1. Activez la connexion automatique à l&#39;aide de l&#39;utilitaire AUTOLOGON. </h6> <p> Microsoft a conçu un outil pour automatiser le processus de connexion sous Windows. L&#39;outil s&#39;appelle &quot;Autologon&quot; et vous permet de configurer facilement Windows pour une connexion automatique sans avoir à saisir vos informations d&#39;identification à chaque démarrage. L&#39;avantage de cet outil, c&#39;est que le mot de passe est stocké crypté dans le registre. </p> <p> 1. Télécharger <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/autologon\" target=\"_blank\" rel=\"nofollow noopener\"> Connexion automatique </a> utilitaire. <br> 2. Extrayez le fichier téléchargé. <br> 3. Exécutez &quot;autologon.exe&quot; <br> 4. Saisissez votre mot de passe et cliquez sur <strong> Activer </strong> . </p> <p><img src=\"images/image_thumb-44-251.png\" alt=\"windows auto login\" loading=\"lazy\"></p> <p> * Remarque : Si vous souhaitez désactiver la connexion automatique, exécutez à nouveau l&#39;utilitaire et cliquez sur <strong> Désactiver </strong> . </p> <p> </p> <h6> Méthode 2. Activez la connexion automatique à partir du panneau de configuration des comptes d&#39;utilisateurs. </h6> <p> La deuxième méthode pour activer la connexion automatique à Windows 10/8/7 consiste à désactiver le paramètre &quot;Les utilisateurs doivent saisir un nom d&#39;utilisateur et un mot de passe pour utiliser cet ordinateur&quot; dans le panneau de configuration Comptes d&#39;utilisateurs. Pour faire ça: </p> <p> Remarque : si vous utilisez un compte local, il existe un autre moyen plus simple de forcer Windows à se connecter automatiquement : spécifiez simplement un nouveau mot de passe vide (vide) dans Paramètres &gt; Comptes &gt; Options de connexion &gt; Modifier le mot de passe. Tapez ensuite votre mot de passe une fois, puis cliquez deux fois sur Suivant et Terminer. </p> <p> 1. Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-738.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Dans la case &quot;Ouvrir&quot;, saisissez : <strong> contrôler les mots de passe utilisateur2 </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-29-873.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Dans les options des comptes d&#39;utilisateurs (onglet &#39;Utilisateurs&#39;), <strong> décocher </strong> les <strong> Les utilisateurs doivent entrer un nom d&#39;utilisateur et un mot de passe pour utiliser cette case à cocher d&#39;ordinateur </strong> puis cliquez <strong> Appliquer. * </strong></p> <p> * Remarque : Si vous souhaitez désactiver la connexion automatique à l&#39;avenir, cochez simplement cette case. </p> <p><img src=\"images/image_thumb-32-315.png\" alt=\"auto login windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Saisissez (deux fois) le mot de passe de votre compte et cliquez sur <strong> d&#39;accord </strong> deux fois pour fermer les propriétés du compte d&#39;utilisateur. </p> <p><img src=\"images/image_thumb-31-509.png\" alt=\"Auto Login to Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Méthode 3. Activez la connexion automatique dans le registre (Windows 10/8/7/Vista). </h6> <p> La dernière méthode pour désactiver la connexion par mot de passe, sous Windows 10, 8 ou 7, consiste à activer le registre de connexion automatique. Pour faire ça: </p> <p> 1. Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-512.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Dans la case &quot;Ouvrir&quot;, saisissez : <strong> regedit </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb7-114.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Accédez à cette clé dans le volet de gauche : </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon </li> </ul> <p> 4. Dans le volet de droite : </p> <blockquote><p> une. Faites un clic droit sur un espace vide et sélectionnez <strong> Nouveau </strong> &gt; <strong> Valeur de chaîne. </strong></p> <p><img src=\"images/image_thumb-38-930.png\" alt=\"image\" loading=\"lazy\"></p> <p> b. Renommez la nouvelle valeur en <strong> Nom d&#39;utilisateur par défaut </strong> et appuyez sur <strong> Entrer </strong> . <br> c. Ouvrez la valeur REG_SZ &#39;DefaultUserName&#39;. <br> ré. Tapez le nom de votre compte d&#39;utilisateur local ou de votre compte Microsoft et cliquez sur <strong> d&#39;accord </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-42-933.png\" alt=\"enable auto login registry\" loading=\"lazy\"></p> <p> </p> <p> 5a. Effectuez les mêmes étapes et créez une nouvelle valeur REG_SZ (String) et nommez-la <strong> Mot de passe par défaut </strong> . <br> 5b. Double-cliquez sur &quot;Mot de passe par défaut <strong> &#39; </strong> REG_SZ, saisissez votre mot de passe dans la zone Données de la valeur et cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-43-192.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7a. Enfin, créez une nouvelle valeur REG_SZ et nommez-la <b> AutoAdminLogon </b> . <br> 7b. Double-cliquez sur la valeur &#39;AutoAdminLogon&#39;, tapez <strong> 1 </strong> dans la zone Données de la valeur et cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-41-705.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Fermez l&#39;Éditeur du Registre et redémarrez votre PC. * </p> <p> * Remarques: <br> 1. Si votre ordinateur fait partie d&#39;un domaine, vous devez créer une autre valeur REG_SZ avec le nom <strong> Nom de domaine par défaut </strong> puis tapez dans la zone de données de valeur le nom de votre domaine. <br> 2. Pour désactiver la connexion automatique à l&#39;avenir, supprimez simplement les valeurs de chaîne nouvellement créées mentionnées ci-dessus. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}