{"title":"Comment afficher et exporter les mots de passe Chrome.","content":"<p> Dans ce didacticiel, je vais vous montrer comment afficher, gérer ou exporter dans un fichier les mots de passe enregistrés pour chaque site Web que vous visitez dans Google Chrome. Comme vous le savez déjà, le navigateur Chrome vous demande d&#39;enregistrer vos identifiants de connexion (nom d&#39;utilisateur et mot de passe) lors de votre première visite sur un site Web. </p> <p><img src=\"images/image_thumb-97-400.png\" alt=\"view-chrome-passwords\" loading=\"lazy\"></p> <p> En autorisant Chrome à enregistrer vos informations d&#39;identification, la prochaine fois que vous vous connecterez au site Web, le navigateur Chrome remplira automatiquement les champs de connexion. Mais en faisant cela, de nombreux utilisateurs (dont moi) oublient leurs identifiants de connexion au fil du temps. Dans ce didacticiel, vous découvrirez donc comment afficher, gérer ou enregistrer dans un fichier les mots de passe enregistrés par Chrome. </p> <h4> Comment gérer, afficher et exporter les mots de passe enregistrés dans Google Chrome. </h4> <p> 1. Depuis le menu Chrome <img src=\"images/image_thumb-78-707.png\" alt=\"image\" loading=\"lazy\"> sélectionner <strong> Paramètres </strong> . </p> <p><img src=\"images/image_thumb-79-605.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> 2. Dans les options de remplissage automatique, cliquez sur <strong> Mots de passe </strong> . </p> <p><img src=\"images/image_thumb-80-931.png\" alt=\"manage chrome passwords\" loading=\"lazy\"></p> <p> </p> <p><strong> Comment afficher les mots de passe Chrome. </strong></p> <p> 1. Pour afficher le mot de passe enregistré dans Chrome pour un site spécifique, cliquez sur le bouton <strong> Montrer le mot de passe </strong><img src=\"images/image_thumb-86-925.png\" alt=\"image\" loading=\"lazy\"> icône. </p> <p><img src=\"images/image_thumb-87-291.png\" alt=\"view chrome passwords\" loading=\"lazy\"></p> <p> </p> <p> 2. Tapez le mot de passe de connexion Windows lorsque vous y êtes invité et cliquez sur <strong> d&#39;accord </strong> pour révéler le mot de passe enregistré pour le site. </p> <p><img src=\"images/image_thumb-88-816.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Pour supprimer le mot de passe enregistré pour le site, cliquez sur le menu à trois points <img src=\"images/image_thumb-89-602.png\" alt=\"image\" loading=\"lazy\"> à côté du nom du site et cliquez sur <strong> Supprimer </strong> . </p> <p><img src=\"images/image_thumb-91-954.png\" alt=\"remove chrome passwords\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Comment enregistrer tous les mots de passe Chrome dans un fichier </strong></p> <p> 1. Pour enregistrer dans un fichier Excel (.csv), tous les noms d&#39;utilisateur et mots de passe de connexion enregistrés pour tous les sites Web, cliquez sur le menu à trois points <img src=\"images/image_thumb-92-183.png\" alt=\"image\" loading=\"lazy\"> à côté de « Mots de passe enregistrés » et cliquez sur <strong> Exportation </strong> . </p> <p><img src=\"images/image_thumb-93-646.png\" alt=\"export chrome passwords\" loading=\"lazy\"></p> <p> </p> <p> 2. Dans la fenêtre suivante, cliquez sur <strong> Exporter les mots de passe </strong> . </p> <p><img src=\"images/image_thumb-94-438.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Tapez votre mot de passe de connexion Windows lorsque vous y êtes invité et cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-95-376.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Enregistrez le &quot;Chrome Passwords.csv&quot; sur votre ordinateur. </p> <p><img src=\"images/image_thumb-96-130.png\" alt=\"save chrome passwords\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}