{"title":"Comment désactiver BitLocker dans Windows 10.","content":"<p> Ce didacticiel contient des instructions sur la façon de désactiver la protection Bitlocker et le cryptage Drive dans Windows 10. Comme vous le savez peut-être, la fonction de cryptage BitLocker, disponible dans les versions Windows 10 pro et entreprise, peut vous aider à protéger le contenu de votre PC contre les accès non autorisés. Mais parfois, il est nécessaire de désactiver le Bitlocker sur Windows 10, donc dans ce guide, vous pouvez trouver comment le faire. </p> <p> Si votre ordinateur est protégé par BitLocker, lorsque vous démarrez le système, vous serez invité à connecter le lecteur USB que vous avez utilisé lors de l&#39;activation de BitLocker ou à saisir votre mot de passe BitLocker pour déverrouiller le lecteur C: afin de continuer à démarrer. Si vous n&#39;en avez aucun, appuyez sur <strong> ESC </strong> pour entrer votre clé de récupération BitLocker. * </p> <blockquote><p> * Remarques: <br> 1. Si la clé ou le mot de passe de récupération Bitlocker n&#39;est pas accepté au démarrage du système, essayez de déverrouiller et de déchiffrer le disque dur sur un autre ordinateur Windows 10 ou essayez de : <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-recovery-environment-winre/\" target=\"_blank\" rel=\"nofollow noopener\"> Déverrouillez et décryptez le lecteur protégé dans l&#39;environnement de récupération Windows (WinRE). </a><br> 2. Si vous ne pouvez pas déverrouiller le lecteur (par exemple, si vous ne possédez pas la clé de récupération BitLocker ou parce que la clé BitLocker n&#39;est pas acceptée) et que vous souhaitez supprimer le cryptage BitLocker afin d&#39;utiliser à nouveau le lecteur protégé, lisez ce didacticiel : <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment supprimer la protection BitLocker d&#39;un lecteur sans la clé ou le mot de passe de récupération BitLocker </a> . </p></blockquote> <p><img src=\"images/image_thumb-53-752.png\" alt=\"How to Disable BitLocker in Windows 10 GUI - PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Après avoir démarré sous Windows, suivez les instructions ci-dessous pour désactiver la protection Bitlocker et décrypter le lecteur. </p> <h4> Comment désactiver la protection BitLocker et décrypter un lecteur crypté Bitlocker dans Windows 10. </h4> <p> Afin de désactiver la protection Bitlocker, vous devez disposer du mot de passe Bitlocker ou de la clé de récupération Bitlocker afin de déverrouiller d&#39;abord le lecteur, puis de déchiffrer le lecteur. </p> <p> La clé de récupération Bitlocker est une clé numérique à 48 chiffres et se trouve aux emplacements suivants : </p> <ul> <li> Sur une impression que vous avez enregistrée, lorsque vous avez activé Bitlocker. </li> <li> Sur une clé USB que vous avez utilisée, lors de l&#39;activation de Bitlocker pour enregistrer la clé de récupération Bitlocker. </li> <li> Au <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Clés de récupération de compte Microsoft </a> , en utilisant le compte MS que vous utilisez pour vous connecter à votre appareil, ou que vous avez ajouté à l&#39;appareil afin de télécharger des applications à partir du Microsoft Store, ou pour activer MS Office ou pour la messagerie électronique. </li> <li> Sur votre <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Compte Azure </a> pour les PC de travail qui se connectent avec un compte Azure Active Directory. </li> </ul> <p> Une fois que vous avez trouvé la clé de récupération Bitlocker ou le mot de passe bitlocker, procédez au déverrouillage du lecteur crypté Bitlocker et à la suppression du cryptage Bitlocker en utilisant l&#39;une des méthodes suivantes : </p> <ul> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Méthode 1. Désactivez la protection BitLocker à partir de l&#39;interface graphique Windows. </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Méthode 2. Désactivez BitLocker et décryptez un lecteur crypté Bitlocker à partir de PowerShell. </a></li> </ul> <p> </p> <h6> Méthode 1. Comment désactiver la protection Bitlocker dans l&#39;interface graphique Windows 10. </h6> <p> Pour désactiver la protection sur votre lecteur système C : </p> <p> 1. Accédez à Windows <strong> Panneau de commande </strong> -&gt; <strong> Système et sécurité </strong> puis cliquez <strong> Chiffrement du lecteur Bit Locker </strong> . </p> <p><img src=\"images/image_thumb-33-233.png\" alt=\"How to turn off or Turn Onn BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. À côté du lecteur du système d&#39;exploitation C:, cliquez sur <strong> Désactiver BitLocker </strong> . * </p> <p> * Remarques: <br> 1. Si l&#39;option &quot;Désactiver BitLocker&quot; n&#39;est pas disponible, ouvrez <strong> invite de commande en tant qu&#39;administrateur </strong> et donnez la commande suivante : </p> <ul> <li> gérer-bde -off C: </li> </ul> <p> 2. Pour voir l&#39;état du déchiffrement (progression) du lecteur C :, donnez cette commande : </p> <ul> <li> manage-bde -status C : </li> </ul> <p> </p> <p> </p> <p><img src=\"images/image_thumb-43-236.png\" alt=\"turn off bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Après avoir désactivé Bitlocker, cliquez sur l&#39;icône Bitlocker dans la barre des tâches pour afficher le processus de décryptage. </p> <p><img src=\"images/image_thumb-41-694.png\" alt=\"remove bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Pour désactiver la protection sur tout autre lecteur protégé par BitLocker à partir de l&#39;interface graphique Windows : </p> <p> 1. Ouvrez l&#39;Explorateur Windows, puis double-cliquez sur le lecteur verrouillé. <br> 2. Saisissez le mot de passe Bitlocker ou cliquez sur <strong> Plus d&#39;options </strong> pour entrer la clé de récupération Bitlocker, afin de déverrouiller le lecteur. </p> <p><img src=\"images/image_thumb-47-646.png\" alt=\"unlock bitlocker windows 10\" loading=\"lazy\"></p> <p> 2. Après avoir déverrouillé le lecteur, accédez à <strong> Panneau de commande </strong> -&gt; <strong> Système et sécurité </strong> -&gt; <strong> Chiffrement du lecteur Bit Locker </strong> et après avoir sélectionné le lecteur, cliquez sur <strong> Désactiver BitLocker </strong> pour décrypter le lecteur. (voir les captures d&#39;écran ci-dessus) </p> <p> </p> <h6> Méthode 2. Comment désactiver la protection BitLocker et décrypter un lecteur crypté Bitlocker à partir de PowerShell dans Windows 10. </h6> <p> 1. Ouvrez PowerShell en tant qu&#39;administrateur. Pour faire ça: </p> <ol> <li> <ol> <li> À <strong> Cortana </strong> dans le champ de recherche, tapez <strong> powershell </strong></li> <li> Faites un clic droit sur <strong> Windows PowerShell </strong> résultat et sélectionnez <strong> Exécuter en tant qu&#39;administrateur. </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb_thumb-1-316.png\" alt=\"disable bitlocker powershell windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Vérifiez ensuite l&#39;état de chiffrement de chaque lecteur de votre ordinateur en tapant cette commande : </p> <ul> <li><strong> gérer-bde -statut </strong></li> </ul> <p> </p> <p> 3. Notez dans quelle lettre de lecteur l&#39;état de verrouillage s&#39;affiche <strong> Fermé à clé </strong> , puis procédez au déverrouillage de ce lecteur en tapant cette commande : * </p> <ul> <li><strong> manage-bde -unlock drive-letter : -rp BitLocker-recovery-key​ </strong></li> </ul> <p> * par exemple : Si vous souhaitez déverrouiller le lecteur &quot;D:&quot; et que la clé de récupération de bitlocker est : &quot;123456-123456-123456-123456-123456-123456&quot; alors tapez : </p> <ul> <li> <ul> <li> manage-bde -unlock D: -rp 123456-123456-123456-123456-123456-123456 </li> </ul> </li> </ul> <p> </p> <p> * Remarque : Si vous connaissez le mot de passe Bitlocker, donnez cette commande : </p> <ul> <li><strong> manage-bde -unlock drive-letter : -pw BitLocker-Password </strong></li> </ul> <p> * par exemple : Si vous souhaitez déverrouiller le lecteur &quot;D:&quot; et que le mot de passe BitLocker est : &quot;123qwerty&quot; alors tapez : * </p> <ul> <li> <ul> <li> manage-bde -unlock D: -password 123qwerty </li> </ul> </li> </ul> <p> </p> <p> 4. Désactivez ensuite le chiffrement bitlocker et déchiffrez le lecteur chiffré à l&#39;aide de l&#39;une des commandes suivantes : </p> <ul> <li><strong> Disable-BitLocker -MountPoint « lettre de lecteur : » </strong></li> <li><strong> manage-bde -off drive-lettre : </strong></li> </ul> <p> * ex. : Si vous souhaitez désactiver le cryptage bitlocker sur le lecteur &quot;D:&quot;, alors tapez : </p> <ul> <li> <ul> <li> Désactiver-BitLocker -MountPoint &quot;D:&quot; </li> </ul> </li> </ul> <blockquote> <p> OU tapez… </p> </blockquote> <ul> <li> <ul> <li> manage-bde –off D : </li> </ul> </li> </ul> <p> 5. Une fois le processus de déchiffrement terminé, vérifiez à nouveau l&#39;état du chiffrement en exécutant cette commande : </p> <ul> <li><strong> gérer-bde -statut </strong></li> </ul> <p> 6. Si le « Statut de verrouillage » s&#39;affiche <strong> Débloqué </strong> et le « État de la conversion » s&#39;affiche <strong> Entièrement décrypté, </strong> vous avez terminé! </p> <p><img src=\"images/image_thumb-50-868.png\" alt=\"view bitlocker status\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître ce problème. </p>"}