{"title":"Comment supprimer des éléments Windows Spotlight de l&#39;écran de verrouillage (comme ce que vous voyez, des faits amusants, des astuces, etc.) dans Windows 10.","content":"<p> Dans Windows 10, Microsoft a ajouté la fonctionnalité Windows Spotlight, qui est responsable de toutes les images d&#39;arrière-plan, conseils et liens que vous voyez dans l&#39;écran de verrouillage. Dans ce didacticiel, vous trouverez des instructions détaillées sur la façon de supprimer tous les éléments Spotlight (Comme ce que vous voyez, Faits amusants, Astuces, etc.). à partir de l&#39;écran de verrouillage dans les éditions Windows 10 Home, Pro, Enterprise et Education. </p> <p><img src=\"images/image_thumb-85-983.png\" alt=\"Remove Windows Spotlight items from Windows 10 Lock Screen \" loading=\"lazy\"></p> <p> </p> <h2> Comment supprimer des faits amusants, des conseils, des astuces et plus encore… de l&#39;écran de verrouillage dans Windows 10. </h2> <ul> <li><a href=\"#turn-off-spotight-windows-10-home\" target=\"_blank\" rel=\"nofollow noopener\"> Windows 10 Famille. </a></li> <li><a href=\"#turn-off-spotight-windows-10-pro\" target=\"_blank\" rel=\"nofollow noopener\"> Windows 10 Professionnel, Entreprise et Éducation. </a></li> </ul> <p> </p> <h6> Comment désactiver les éléments Windows Spotlight dans Windows 10 Home. </h6> <p> Pour supprimer les faits amusants, conseils et astuces sur l&#39;écran de verrouillage dans Windows 10 Home. </p> <p> 1. Cliquez avec le bouton droit sur un espace vide de votre bureau et sélectionnez <strong> Personnaliser </strong> . * </p> <p> * Alternativement : Aller à <strong> Démarrer </strong> menu <img src=\"images/image_thumb-98-467.png\" alt=\"image\" loading=\"lazy\"> , Cliquez sur <strong> Paramètres </strong> <img src=\"images/image_thumb-150-399.png\" alt=\"image\" loading=\"lazy\"> puis cliquez <strong> Personnalisation. </strong></p> <p><img src=\"images/image_thumb-86-908.png\" alt=\"Turn-Off Windows Spotlight Windows 10 Home\" loading=\"lazy\"></p> <p> </p> <p> 2. Dans Paramètres de personnalisation, sélectionnez <strong> Écran verrouillé </strong> à gauche, puis dans Options d&#39;arrière-plan, définissez l&#39;un des autres choix (par exemple, Image ou Diaporama) pour désactiver Windows Spotlight. </p> <p><img src=\"images/image_thumb-87-515.png\" alt=\"remove spotlight fun facts tricks windows 10 lock screen\" loading=\"lazy\"></p> <p> </p> <p> 3. Ensuite <strong> Éteindre </strong> le &quot;Obtenez des faits amusants, des conseils et plus de Windows et Cortana sur votre écran de verrouillage&quot; </p> <p><img src=\"images/image_thumb-88-136.png\" alt=\"turn off like what you see lock screen windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Comment désactiver les éléments Spotlight dans les versions Windows 10 Pro, Enterprise et Education. </h6> <p> Pour désactiver les éléments Windows Spotlight (Comme ce que vous voyez, Faits amusants, Conseils, etc.), à l&#39;aide de l&#39;éditeur de stratégie de groupe : </p> <p> 1. Appuyez simultanément sur Windows <img src=\"images/image_thumb36-436.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez <strong> gpedit.msc </strong> &amp; Presse <strong> Entrer. </strong></p> <p><img src=\"images/image_thumb-78-637.png\" alt=\"turn off spotight group policy\" loading=\"lazy\"></p> <p> 3. Dans le volet de gauche, accédez à : </p> <ul> <li><strong> La configuration d&#39;un ordinateur </strong> &gt; <strong> Modèles d&#39;administration </strong> &gt; <strong> Panneau de commande </strong> &gt; <strong> Personnalisation </strong></li> </ul> <p><strong> 4. </strong> Dans le volet de droite, double-cliquez sur <strong> Forcer un écran de verrouillage et une image de connexion par défaut spécifiques </strong> . </p> <p><img src=\"images/image_thumb-89-681.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Maintenant, modifiez ce paramètre de stratégie comme suit, puis cliquez sur <strong> d&#39;accord </strong> : </p> <blockquote><p> une. Vérifier <strong> Activée </strong> . <br> b. Tapez le chemin complet de l&#39;image de l&#39;image que vous souhaitez utiliser comme arrière-plan sur l&#39;écran de verrouillage. * <br> c. <strong> Vérifier </strong> &quot;Désactivez les faits amusants, les conseils, les astuces et plus encore sur l&#39;écran de verrouillage&quot; </p></blockquote> <p> </p> <p> * CONSEIL : vous pouvez utiliser votre propre image pour l&#39;arrière-plan de l&#39;écran de verrouillage, ou vous pouvez vous simplifier la vie et utiliser l&#39;une des images d&#39;écran de verrouillage Windows par défaut, qui sont stockées dans le dossier suivant sur votre PC : C:\\Windows\\Web\\ Écran\\ </p> <p><img src=\"images/image_thumb-90-124.png\" alt=\"spotlight group policy\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? </p> <p> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}