{"title":"CORRECTIF : Impossible de se connecter aux applications de bureau Office – La fenêtre des informations d&#39;identification n&#39;apparaît pas (résolu)","content":"<p> Il y a quelques jours, j&#39;ai résolu le problème suivant sur un ordinateur Windows 10 exécutant Microsoft Office : l&#39;utilisateur ne peut se connecter à aucune application Office (Word, Outlook, etc.), car le système n&#39;affiche jamais la fenêtre d&#39;identification pour entrer dans Office 365 le mot de passe. Donc, si vous ne pouvez pas vous connecter aux applications de bureau Office, car la zone de mot de passe ne s&#39;affiche jamais, continuez à lire ci-dessous. </p> <p> Description du problème : après avoir ouvert une application de bureau Office (Word, Excel, etc.), le système vous invite à vous connecter à l&#39;aide des informations d&#39;identification de votre compte Microsoft. Cependant, après avoir entré votre nom d&#39;utilisateur, la fenêtre de connexion se ferme et l&#39;invite de mot de passe ne s&#39;affiche jamais. En conséquence, vous ne pouvez pas utiliser l&#39;application Office ou vous rencontrez d&#39;autres problèmes. Le problème mentionné peut apparaître dans Microsoft Office 2013 et Office 2016. </p> <p> Ce didacticiel contient des instructions pour résoudre le problème suivant dans Windows 10 : Impossible de se connecter aux applications de bureau de Microsoft Office, en utilisant les informations d&#39;identification Office 365, car la fenêtre des informations d&#39;identification n&#39;apparaît pas. </p> <h4> Comment CORRIGER : Impossible de se connecter avec votre compte MS à une application de bureau Office. (Bureau 2013/2016/2019). </h4> <h6> Méthode 1. Supprimez les informations d&#39;identification Office stockées du Panneau de configuration. </h6> <p> La première méthode pour résoudre le problème de connexion dans les applications de bureau Office consiste à supprimer les informations d&#39;identification Microsoft stockées de votre PC. Pour faire ça: </p> <p> 1. Fermez tous les programmes Office. <br> 2. Accédez à Windows <strong> Panneau de commande </strong> , et ouvrez le <strong> Gestionnaire des informations d&#39;identification </strong> . </p> <p><img src=\"images/image_thumb-23-297.png\" alt=\"Control Panel - Credential Manager\" loading=\"lazy\"></p> <p> 3. À <strong> Informations d&#39;identification Windows </strong> , supprimez toutes les informations d&#39;identification pour Microsoft Office. </p> <p><img src=\"images/image_thumb-24-389.png\" alt=\"Remove Office Credentials\" loading=\"lazy\"></p> <p> </p> <p> 4. Ouvrez n&#39;importe quelle application Office et essayez à nouveau de vous connecter avec votre compte Microsoft. Si vous ne parvenez toujours pas à vous connecter à votre compte, appliquez les étapes de la méthode 2 ci-dessous. </p> <p> </p> <h6> Méthode 2. Désactivez l&#39;authentification moderne. </h6> <p> La deuxième méthode, pour résoudre le problème de connexion dans les applications Office, consiste à désactiver l&#39;authentification moderne dans Office. Pour faire ça: </p> <p> 1. Ouvrez l&#39;Éditeur du Registre et accédez à cette clé : </p> <ul> <li> HKEY_CURRENT_USER\\Software\\Microsoft\\Office\\16.0\\Common\\Identity </li> </ul> <p> 2. Dans le volet de droite, vérifiez si vous pouvez voir une valeur avec le nom : <strong> Activer ADAL. </strong> Si non, alors… </p> <blockquote> <p> une. Cliquez avec le bouton droit sur un espace vide et sélectionnez <strong> Nouveau </strong> &gt; <strong> Valeur DWORD (32 bits). </strong></p> </blockquote> <p><img src=\"images/image_thumb-25-384.png\" alt=\"Disable Modern Authentication\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Nommez la nouvelle valeur : <strong> Activer ADAL </strong> et appuyez sur <strong> Entrer. </strong></p></blockquote> <p><img src=\"images/image_thumb-26-875.png\" alt=\"Turn Off Modern Authentication\" loading=\"lazy\"></p> <p> 3. Double-cliquez sur le <strong> Activer ADAL </strong> valeur, définissez les données de la valeur sur <strong>0 </strong> et cliquez <strong> D&#39;ACCORD. </strong></p> <p><img src=\"images/image_thumb-27-612.png\" alt=\"EnableADAL \" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Fermer </strong> l&#39;éditeur de registre et <strong> redémarrer </strong> le PC. <br> 5. Ouvrez n&#39;importe quelle application Office et réessayez de vous connecter à nouveau. </p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}