{"title":"Comment mettre à jour manuellement les composants Chrome et Google Chrome.","content":"<p> Chaque fois qu&#39;une nouvelle mise à jour de Chrome est disponible, Google Chrome invite l&#39;utilisateur à redémarrer le navigateur afin d&#39;installer la mise à jour. Mais parfois, une fois la mise à jour appliquée, Chrome peut se bloquer ou se bloquer. Cela est dû au fait que Chrome inclut plusieurs composants individuels qui n&#39;ont peut-être pas encore été mis à jour et dans ce cas, vous devez les mettre à jour manuellement. </p> <p> Ce didacticiel contient des instructions sur la mise à jour manuelle de Chrome et des composants individuels de Chrome. </p> <h4> Comment mettre à jour manuellement les composants Google Chrome et Chrome. </h4> <h6> Partie 1. Comment mettre à jour manuellement Google Chrome. </h6> <p> Pour installer la dernière version de Google Chrome : </p> <p> 1. Depuis le menu Chrome <img src=\"images/image_thumb-4-667.png\" alt=\"image\" loading=\"lazy\"> Cliquez sur <strong> Aide -&gt; À propos de Google Chrome </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-39-551.png\" alt=\"How to Update Chrome manually\" loading=\"lazy\"></p> <p> </p> <p> 2. Google Chrome recherchera les mises à jour, puis installera automatiquement la dernière mise à jour. </p> <p><img src=\"images/image_thumb-40-825.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Une fois la mise à jour terminée, cliquez sur le bouton <strong> Relancer </strong> bouton. </p> <p><img src=\"images/image_thumb-41-622.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Partie 2. Comment mettre à jour les composants individuels de Chrome. </h6> <p> 1. Dans la barre d&#39;adresse de Chrome, saisissez : </p> <ul> <li><strong> chrome://composants </strong></li> </ul> <p> 2. Cliquez sur le <strong> Vérifier la mise à jour </strong> sur chaque composant Chrome que vous souhaitez mettre à jour. </p> <p><img src=\"images/image_thumb-42-446.png\" alt=\"How to Update Chrome Components\" loading=\"lazy\"></p> <p> </p> <p> 3. Une fois la mise à jour terminée, redémarrez Chrome. </p> <p> Aide supplémentaire : si, après la mise à jour de Chrome et de ses composants, vous rencontrez des problèmes avec votre navigateur, passez à <a href=\"https://www.repairwin.com/how-to-uninstall-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> supprimer et réinstaller complètement Chrome </a> . </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}