{"title":"CORRECTIF : Impossible de se connecter au partage de fichiers car il n&#39;est pas sécurisé et nécessite le protocole SMB1 obsolète. (Résolu)","content":"<p> Si vous essayez de vous connecter à un dossier partagé en réseau à partir d&#39;un PC Windows 10 et que vous recevez l&#39;erreur « Vous ne pouvez pas vous connecter au partage de fichiers car il n&#39;est pas sécurisé. Ce partage nécessite le protocole SMB1 obsolète, qui est dangereux et pourrait exposer votre système à attaquer. Votre système nécessite SMB2 ou supérieur. Pour plus d&#39;informations sur la résolution de ce problème, consultez : https://go.microsoft.com/fwlink/?linkid=852747&quot;, puis continuez ci-dessous pour résoudre le problème. </p> <p><img src=\"images/image_thumb-30-812.png\" alt=\"You can't connect to the file share because it's not secure. This share requires the obsolete SMB1 protocol, which is unsafe...\" loading=\"lazy\"></p> <p> Dans Windows 10 v1709 et versions ultérieures, le protocole réseau Server Message Block version 1 (SMBv1) n&#39;est pas installé par défaut et doit être activé manuellement si vous souhaitez accéder à un dossier partagé sur un poste de travail ou un serveur, qui utilise le protocole SMBv1 pour partage de fichiers. </p> <p> Ce didacticiel contient des instructions pour résoudre les erreurs suivantes lorsque vous essayez de vous connecter à un dossier partagé sous Windows 10 : </p> <ul> <li> <p><em> Vous ne pouvez pas vous connecter au partage de fichiers car il n&#39;est pas sécurisé. Ce partage nécessite le protocole SMB1 obsolète, ce qui est dangereux… </em></p> </li> <li> <p><em> Le nom de réseau spécifié n&#39;est plus disponible </em></p> </li> <li> <p><em> Erreur non spécifiée 0x80004005 </em></p> </li> <li> <p><em> Le serveur spécifié ne peut pas réaliser l&#39;opération demandée. </em></p> </li> </ul> <h4> Comment CORRIGER : impossible de se connecter au partage de fichiers car le protocole SMBv1 est manquant (Windows 10) </h4> <p> 1. Accédez à <strong> Panneau de commande </strong> -&gt; <strong> Programmes et fonctionnalités </strong> . <br> 2. Cliquez sur <strong> Activer ou désactiver des fonctionnalités Windows </strong> à partir de la gauche. </p> <p> </p> <p><img src=\"images/image_thumb-68-359.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Développez l&#39;option « Prise en charge du partage de fichiers SMB 1.0/CIFS » et <strong> Chèque </strong> les <strong> Client SMB 1.0/CIFS </strong> option. Cliquez sur <strong> d&#39;accord </strong> lorsque vous avez terminé. </p> <p><img src=\"images/image_thumb-29-360.png\" alt=\"Install SMBv1 Windows 10\" loading=\"lazy\"></p> <p> 4. Lorsque le SMB 1.0/CIFS est installé, puis cliquez sur le <strong> Redémarrer maintenant </strong> bouton pour redémarrer votre PC. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}