{"title":"Comment désactiver Bitlocker dans l&#39;environnement de récupération Windows (WinRE).","content":"<p> Ce didacticiel contient des instructions sur la façon de désactiver la protection BitLocker et de déchiffrer un lecteur chiffré BitLocker dans l&#39;environnement de récupération Windows. Les instructions peuvent être utiles si votre ordinateur est protégé par BitLocker et n&#39;accepte pas la clé de récupération BitLocker ou le mot de passe BitLocker au démarrage du système et que vous ne pouvez pas déverrouiller le lecteur protégé par BitLocker. </p> <p><img src=\"images/image_thumb-52-511.png\" alt=\"Remove Bitlocker from Windows Recovery Environment \" loading=\"lazy\"></p> <h4></h4> <h4> Comment supprimer la protection BitLocker et décrypter le lecteur crypté BitLocker dans l&#39;environnement de récupération Windows (WinRE). </h4> <p><strong> Conditions: </strong><br> <strong> UNE </strong> . <strong> Un support d&#39;installation Windows 10 (USB ou DVD). </strong> Si vous ne possédez pas de support d&#39;installation Windows, vous pouvez en créer un en utilisant <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> L&#39;outil de création de médias de Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment créer un support d&#39;installation USB Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment créer un support d&#39;installation DVD Windows 10. </a></li> </ul> <p><strong> B. La clé de récupération BitLocker ou le mot de passe BitLocker : </strong> Pour désactiver la protection Bitlocker, vous devez disposer du mot de passe Bitlocker ou de la clé de récupération Bitlocker afin de déverrouiller d&#39;abord le lecteur, puis de déchiffrer le lecteur. * </p> <p> * Remarque : si vous n&#39;avez pas la clé de récupération BitLocker, il n&#39;y a aucun moyen de contourner la protection BitLocker. Si un disque est protégé par BitLocker et que vous n&#39;avez pas la clé de récupération BitLocker ou le mot de passe pour déverrouiller le lecteur, la seule option dont vous disposez (afin de réutiliser le lecteur) est d&#39;effacer complètement le lecteur en suivant les instructions dans cet article: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment supprimer la protection BitLocker d&#39;un lecteur sans la clé ou le mot de passe de récupération BitLocker. </a></p> <p> La clé de récupération Bitlocker est un numéro à 48 chiffres et se trouve aux emplacements suivants : </p> <ul> <li> Sur une impression que vous avez enregistrée, lorsque vous avez activé Bitlocker. </li> <li> Sur une clé USB que vous avez utilisée, lors de l&#39;activation de Bitlocker pour enregistrer la clé de récupération Bitlocker. </li> <li> Au <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Clés de récupération de compte Microsoft </a> , en utilisant le compte MS que vous utilisez pour vous connecter à votre appareil, ou que vous avez ajouté à l&#39;appareil afin de télécharger des applications à partir du Microsoft Store, ou pour activer MS Office ou pour la messagerie électronique. </li> <li> Sur votre <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Compte Azure </a> pour les PC de travail qui se connectent avec un compte Azure Active Directory. </li> </ul> <p> Une fois que vous avez trouvé la clé de récupération BitLocker ou le mot de passe ΒitLocker, procédez au déverrouillage du lecteur crypté Bitlocker et à la suppression du cryptage Bitlocker dans WinRE, en suivant les instructions ci-dessous. </p> <p> Pour déverrouiller et décrypter le lecteur du système d&#39;exploitation C : à partir de WinRE : </p> <p> 1. Démarrez votre système à partir du support d&#39;installation de Windows 10. <br> 2. Sur l&#39;écran ci-dessous, appuyez sur le bouton <strong> CHANGEMENT </strong> + <strong> F10 </strong> touches pour lancer l&#39;invite de commande. (ou appuyez sur <strong> Suivant </strong> &gt; <strong> Réparer mon ordinateur </strong> &gt; <strong> Dépannage </strong> &gt; <strong> Invite de commandes </strong> ). * </p> <p> * Remarque : Si vous avez demandé la clé de récupération, cliquez sur <strong> PASSER ce lecteur </strong> . </p> <p><img src=\"images/image_thumb15_thumb-548.png\" alt=\"How to disable-unlock bitlocker from Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. À l&#39;invite de commande, tapez la commande suivante pour afficher la lettre de lecteur du lecteur chiffré : </p> <ul> <li><strong> gérer-bde -statut </strong></li> </ul> <p> </p> <p> 4. Procédez ensuite au déverrouillage du lecteur crypté, en utilisant la commande suivante, selon votre cas : </p> <p><strong> Cas A. </strong> Si vous connaissez la clé de récupération BitLocker, donnez cette commande : </p> <ul> <li><strong> manage-bde -unlock drive-letter : -rp BitLocker-recovery-key​ </strong></li> </ul> <p> * par exemple : Si vous souhaitez déverrouiller le lecteur &quot;D:&quot; et que la clé de récupération de bitlocker est : &quot;123456-123456-123456-123456-123456-123456&quot; alors tapez : </p> <ul> <li> <ul> <li> gérer-bde -déverrouiller <strong> ré </strong> : -rp <strong> 123456-123456-123456-123456-123456-123456 </strong></li> </ul> </li> </ul> <p> </p> <p><strong> Cas B. </strong> Si vous connaissez le mot de passe BitLocker pour déverrouiller le lecteur, donnez cette commande : </p> <ul> <li><strong> manage-bde -unlock drive-letter : -pw BitLocker-Password </strong></li> </ul> <p> * par exemple : Si vous souhaitez déverrouiller le lecteur &quot;D:&quot; et que le mot de passe BitLocker est : &quot;123qwerty&quot; alors tapez : * </p> <ul> <li> <ul> <li> gérer-bde -déverrouiller <strong> ré </strong> : -le mot de passe <strong> 123qwerty </strong></li> </ul> </li> </ul> <p> </p> <p> 5. Déchiffrez ensuite le lecteur et désactivez la protection BitLocker avec cette commande : </p> <ul> <li><strong> manage-bde -off drive-lettre : </strong></li> </ul> <p> * ex. : Si vous souhaitez déchiffrer le lecteur &quot;D:&quot;, tapez : </p> <ul> <li> <ul> <li> gérer-bde –off <strong> ré </strong> : </li> </ul> </li> </ul> <p> 6. Le processus de décryptage avec démarrage. Pour vérifier l&#39;état du déchiffrement, tapez à nouveau la commande suivante et assurez-vous que le lecteur est <strong> Entièrement décrypté </strong> et <strong> Débloqué </strong> : </p> <ul> <li><strong> gérer-bde -statut </strong></li> </ul> <p><img src=\"images/image_thumb9_thumb-678.png\" alt=\"decrypt bitlocker encrypted drive windows removery environment\" loading=\"lazy\"></p> <p> </p> <p> 7. Lorsque vous avez terminé, supprimez le support d&#39;installation de Windows et redémarrez l&#39;ordinateur. * </p> <p> * Remarque : si Windows ne peut pas démarrer, connectez le lecteur à un autre ordinateur et sauvegardez vos données personnelles sur un autre support. Puis <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> diagnostiquer le lecteur pour les problèmes </a> et si c&#39;est OK, remettez le disque sur l&#39;ordinateur et effectuez une <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> nettoyer l&#39;installation de Windows 10 </a> . </p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître ce problème. </p>"}