{"title":"Comment partager des fichiers et des dossiers sous Windows 10, 8.1 ou 7 OS.","content":"<p> La fonction de partage de fichiers de Windows vous permet de partager facilement des dossiers et des fichiers entre les utilisateurs de votre réseau. En partageant vos fichiers avec d&#39;autres utilisateurs sur le même réseau, vous pourrez afficher et travailler avec les mêmes fichiers/dossiers. </p> <p> Ce didacticiel contient des instructions sur la façon de partager des dossiers et/ou des fichiers dans les systèmes d&#39;exploitation Windows 10, 8, 8.1 ou 7. </p> <h4> Comment activer le partage de fichiers sous Windows. </h4> <h5> Étape 1. Ajoutez les utilisateurs requis à votre PC. </h5> <p> Avant de continuer à partager vos fichiers avec d&#39;autres, ajoutez les utilisateurs qui auront accès au dossier partagé sur l&#39;ordinateur. Pour effectuer cette tâche, suivez les instructions des articles suivants, en fonction de votre version de Windows. </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-create-a-new-user-in-windows-7\" target=\"_blank\" rel=\"nofollow noopener\"> Comment ajouter un nouvel utilisateur dans Windows 7. </a></li> <li><a href=\"https://www.repairwin.com/how-to-add-a-new-user-account-in-windows-10-8/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment ajouter un nouvel utilisateur sous Windows 10/8.1 </a></li> </ul> <p> </p> <h5> Étape 2. Comment partager un dossier ou un fichier avec d&#39;autres. </h5> <p> 1. Cliquez avec le bouton droit sur le dossier (ou fichier) que vous souhaitez partager et sélectionnez <strong> Donner accès à </strong> -&gt; <strong> Des personnes spécifiques. </strong></p> <p><img src=\"images/image_thumb-56-411.png\" alt=\"How to Share Files and Folders in Windows 10, 8.1, 7\" loading=\"lazy\"></p> <p> </p> <p> 2. En utilisant le menu déroulant, sélectionnez l&#39;utilisateur avec lequel vous souhaitez partager vos fichiers, puis cliquez sur <strong> Ajouter </strong> . </p> <p><img src=\"images/image_thumb-57-274.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Cliquez maintenant sur la flèche vers le bas, à côté de l&#39;utilisateur que vous avez ajouté et spécifiez ses autorisations d&#39;accès (niveau d&#39;autorisation) </p> <p><img src=\"images/image_thumb-58-517.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Une fois terminé, appuyez sur le <strong> Partager </strong> bouton, </p> <p><img src=\"images/image_thumb-59-431.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Notez le lien donné vers le dossier partagé* et cliquez sur <strong> Fait </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-60-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. À ce stade, vous avez activé le partage de fichiers sur votre ordinateur. Pour accéder au dossier partagé depuis un autre PC : </p> <blockquote><p> une. Dans la barre d&#39;adresse d&#39;Explorer, tapez le lien vers le dossier partagé, comme indiqué à l&#39;étape précédente. (par exemple &quot;\\\\DESKTOP-HMG31RD\\2Share&quot; sans les guillemets) <br> b. presse <strong> Entrer </strong> . <br> c. Tapez le nom d&#39;utilisateur et le mot de passe de l&#39;utilisateur auquel vous avez donné accès et appuyez sur <strong> d&#39;accord </strong> . </p></blockquote> <p><img src=\"images/image_thumb-61-512.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Information additionnelle: <br> 1.Pour modifier les autorisations de l&#39;utilisateur, suivez à nouveau la procédure ci-dessus et modifiez le niveau d&#39;autorisation de l&#39;utilisateur. <br> 2. Si vous souhaitez arrêter le partage de fichiers, faites un clic droit sur le dossier/fichier partagé et accédez à <strong> Donner accès à </strong> -&gt; et sélectionnez <strong> Supprimer l&#39;accès </strong> . </p> <p><img src=\"images/image_thumb-62-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître ce problème. </p>"}