{"title":"Comment changer le dossier de démarrage dans Outlook 2016/2019","content":"<p> Si vous souhaitez modifier le dossier de démarrage lorsque vous démarrez Outlook, continuez à lire ce didacticiel. Par défaut, lorsque vous ouvrez Outlook, Outlook s&#39;ouvre au <strong> Boîte de réception </strong> dossier de messagerie du premier compte de messagerie que vous avez ajouté. Si vous souhaitez sélectionner un autre dossier de messagerie au démarrage d&#39;Outlook 2016/2019, suivez les instructions ci-dessous. </p> <h2> Comment définir un dossier de démarrage Outlook différent (Outlook 2019, 2016). </h2> <p> Pour forcer Outlook à s&#39;ouvrir dans un dossier différent au démarrage, suivez les instructions ci-dessous : </p> <p> 1. Cliquez sur le <strong> Déposer </strong> menu, puis cliquez sur <strong> Options </strong> . </p> <p><img src=\"images/image_thumb-212.png\" alt=\"How to Change the Startup Folder in Outlook 2016/2019\" loading=\"lazy\"></p> <p> 2. Sélectionnez <strong> Avancée </strong> à gauche. <br> 3. Sous les options « démarrer et quitter Outlook », cliquez sur le bouton <strong> Parcourir </strong> bouton à côté du &#39; <strong> Démarrez Outlook dans ce dossier&#39; </strong> boîte. </p> <p><img src=\"images/image_thumb-1-465.png\" alt=\"Start Outlook in Different Mail Folder\" loading=\"lazy\"></p> <p> 4. Maintenant, sélectionnez le dossier de messagerie que vous souhaitez qu&#39;Outlook démarre et cliquez sur <strong> d&#39;accord </strong> . </p> <p> <img src=\"images/image_thumb-2-791.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Cliquez sur <strong> d&#39;accord </strong> une fois de plus pour fermer les options Outlook. </p> <p><img src=\"images/image_thumb-3-452.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. <strong> Redémarrer </strong> Perspectives. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}