{"title":"Comment protéger votre PC avec BitLocker sous Windows 10.","content":"<p> Ce didacticiel contient des instructions étape par étape sur la façon de protéger votre PC par mot de passe avec le cryptage BitLocker. Le BitLocker est une fonctionnalité de chiffrement de disque complet incluse dans les éditions Windows 10 Professionnel et Entreprise et il peut vous aider à protéger vos données personnelles contre les accès non autorisés. </p> <p> Imaginez le scénario suivant : votre ordinateur portable personnel est volé ou perdu et vos données privées sont accessibles aux yeux indiscrets. Pour éviter que cela ne se produise, lisez ce guide et apprenez à protéger par mot de passe votre PC et vos données précieuses avec un cryptage fort, afin de devenir inaccessible à quiconque sans le mot de passe de décryptage. </p> <ul> <li><strong> Article associé: <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment protéger un dossier avec un mot de passe. </a></strong></li> </ul> <h4> Comment utiliser BitLocker pour chiffrer et protéger votre PC Windows 10. </h4> <p> Pour protéger le lecteur du système d&#39;exploitation, avec BitLocker sous Windows 10 Pro ou Entreprise : </p> <p> 1. Depuis Windows <strong> Panneau de commande </strong> , Cliquez sur <strong> Système et sécurité </strong> puis cliquez <strong> Chiffrement du lecteur Bit Locker </strong> . </p> <p><img src=\"images/image_thumb-33-320.png\" alt=\"How to Protect your PC with BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. À côté du lecteur du système d&#39;exploitation C:, cliquez sur <strong> Activer bitlocker </strong> . * </p> <p> * Remarque : Si après avoir appuyé sur « Activer BitLocker », vous recevez l&#39;erreur « Cet appareil ne peut pas utiliser un module de plate-forme de confiance… », alors lisez cet article pour résoudre le problème. </p> <p><img src=\"images/image_thumb-34-100.png\" alt=\"turn on bitlocker operating system drive\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Sur l&#39;écran suivant, choisissez comment vous souhaitez déverrouiller le lecteur au démarrage. </p> <blockquote><p> 1. Si vous souhaitez déverrouiller votre PC à l&#39;aide d&#39;un périphérique USB, cliquez sur <strong> Insérez une clé USB. <br> </strong> 2. Si vous souhaitez déverrouiller votre PC en tapant un mot de passe, cliquez sur <strong> Entrer un mot de passe </strong> . (comme dans cet exemple) </p></blockquote> <p><img src=\"images/image_thumb-35-212.png\" alt=\"enable bitlocker protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Tapez maintenant un mot de passe très fort et cliquez sur <strong> Suivant </strong> . </p> <p><img src=\"images/image_thumb-36-435.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Maintenant, sélectionnez où voulez-vous enregistrer* la clé de récupération et cliquez sur <strong> Suivant </strong> . * </p> <p> * Par exemple : si vous vous connectez à Windows 10 avec un compte Microsoft, cliquez sur <strong> Enregistrez sur votre compte Microsoft. </strong> Si vous vous connectez à Windows 10 avec un compte local, choisissez l&#39;une des autres options. </p> <p> Remarques: <br> 1. Si vous enregistrez la clé de récupération BitLocker sur votre compte Microsoft, vous pouvez afficher la clé après vous être connecté à <a title=\"https://onedrive.live.com/recoverykey.\" href=\"https://onedrive.live.com/recoverykey.\" target=\"_blank\" rel=\"nofollow noopener\"> https://onedrive.live.com/recoverykey. </a><br> 2. Je préfère toujours stocker la clé de récupération sur une clé USB, afin d&#39;être prêt à résoudre les problèmes BitLocker. </p> <p> </p> <p><img src=\"images/image_thumb-37-801.png\" alt=\"save bitlocker recovery key\" loading=\"lazy\"></p> <p> </p> <p> 6. Sur l&#39;écran suivant, laissez le paramètre par défaut si votre PC et/ou votre lecteur est nouveau, puis cliquez sur <strong> Suivant </strong> de nouveau. </p> <p><img src=\"images/image_thumb-38-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Dans les options du mode de cryptage, laissez le paramètre par défaut et cliquez sur <strong> Suivant </strong> . </p> <p><img src=\"images/image_thumb-39-785.png\" alt=\"bitlocker encryption mode\" loading=\"lazy\"></p> <p> </p> <p> 8. Au dernier écran, cliquez sur <strong> Continuer </strong> , afin de redémarrer et de vérifier le système avant d&#39;activer la protection BitLocker. </p> <p><img src=\"images/image_thumb-40-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Au redémarrage, vous serez invité à saisir votre mot de passe BitLocker. Tapez votre mot de passe et appuyez sur <strong> Entrer </strong> . * </p> <p> * Remarque : si BitLocker ne peut pas accepter le mot de passe, ou si vous rencontrez d&#39;autres problèmes, essayez l&#39;une des actions suivantes pour vous connecter à Windows : </p> <blockquote><p> 1. Appuyez sur la touche ÉCHAP sur l&#39;écran Mot de passe de BitLocker pour accéder aux options de récupération. <br> 2. Appuyez plusieurs fois sur la touche ESC après avoir allumé votre PC pour contourner le test BitLocker. </p></blockquote> <p> 10. Si les tests BitLocker ont réussi, alors, après le démarrage de Windows 10, BitLocker commencera à chiffrer le lecteur de votre système d&#39;exploitation. Pour afficher l&#39;état du processus de chiffrement, cliquez sur la notification BitLocker dans la barre des tâches ou accédez à Panneau de configuration &gt; Chiffrement de lecteur BitLocker. </p> <p><img src=\"images/image_thumb-41-171.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}