{"title":"CORRECTIF : le fichier n&#39;a pas de flux audio ou vidéo sur Adobe Premiere.","content":"<p> Si vous recevez l&#39;erreur Adobe Premiere « Échec de l&#39;importation du fichier » avec la description « Le fichier n&#39;a pas de flux audio ou vidéo » peut apparaître lors de l&#39;importation d&#39;un fichier vidéo MP4, continuez à lire ci-dessous. L&#39;erreur &quot;Le fichier n&#39;a pas de flux audio ou vidéo&quot; dans Adobe Premiere peut apparaître bien que la vidéo soit lue correctement dans tout autre lecteur multimédia (VLC, Windows Media Player, etc.). </p> <p><img src=\"images/image_thumb-43-349.png\" alt=\"FIX: File has no audio or video streams on Adobe Premiere\" loading=\"lazy\"></p> <p> </p> <p> Les erreurs Adobe Premiere, lors de l&#39;importation d&#39;un fichier vidéo peuvent apparaître pour plusieurs raisons, vous trouverez donc dans ce tutoriel toutes les méthodes disponibles pour résoudre le problème. </p> <h4> Résoudre le problème : &quot;Le fichier n&#39;a pas de flux audio ou vidéo&quot; dans Adobe Premiere. </h4> <h6> Méthode 1. Installez QuickTime. </h6> <p> Tout d&#39;abord, assurez-vous d&#39;avoir installé la dernière version <a href=\"https://support.apple.com/downloads/quicktime\" target=\"_blank\" rel=\"nofollow noopener\"> Quick Time </a> sur votre PC, puis essayez d&#39;importer le fichier mp4 dans Adobe Premiere. </p> <p> </p> <h6> Méthode 2. Renommez le fichier vidéo. </h6> <p> 1. Créez une copie du fichier vidéo mp4 sur un autre emplacement sur votre PC. (par exemple sur votre bureau) <br> 2. Renommez le fichier vidéo comme suit : </p> <blockquote><p> une. Donnez un nom de fichier plus court sur le fichier vidéo, et… <br> b. Supprimez tous les caractères spéciaux de son nom. (traits de soulignement, parenthèses, etc.). </p></blockquote> <p> 3. Ouvrez le fichier vidéo dans Adobe Premiere. </p> <p> </p> <h6> Méthode 3. Modifiez l&#39;extension de nom de fichier de MP4 en MOV. </h6> <p> La méthode suivante pour contourner l&#39;erreur d&#39;Adobe Premiere &quot;Le fichier n&#39;a pas de flux audio ou vidéo&quot; consiste à modifier l&#39;extension du fichier vidéo, de .mp4 à .mov (ou vice versa). Pour faire ça: </p> <p> 1. Dans l&#39;explorateur de fichiers, cliquez sur <strong> Vue </strong> -&gt; <strong> Options </strong> -&gt; <strong> Modifier le dossier et les options de recherche </strong> . </p> <p><img src=\"images/image_thumb-45-776.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. À <strong> Vue </strong> languette, <strong> dégager </strong> la case &quot;Masquer les extensions pour les types de fichiers connus&quot; et cliquez sur <strong> d&#39;accord </strong> . * </p> <p> * Remarque : Pour rendre ce paramètre permanent, cliquez sur « Appliquer aux dossiers » avant de cliquer sur OK. </p> <p><img src=\"images/image_thumb-46-490.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Maintenant, continuez et renommez/modifiez l&#39;extension du fichier vidéo, comme suit : </p> <ul> <li> Si le fichier vidéo est au format MP4 (.mp4), changez son extension en .mov </li> <li> Si le fichier vidéo est au format MOV (.mov), changez son extension en .mp4 </li> </ul> <p><img src=\"images/image_thumb-47-586.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Enfin, ouvrez le fichier vidéo dans Adobe Premiere. </p> <p> </p> <p> </p> <h6> Méthode 4. Effacez la base de données du cache multimédia et les fichiers cache. </h6> <p> Lorsque vous importez un fichier multimédia (vidéo ou audio) et que vous travaillez avec ce fichier dans Adobe Premiere, le programme crée les fichiers de cache multimédia pour des performances plus rapides. De plus, le programme crée des liens pour ces fichiers de cache dans la base de données de cache multimédia. Au fil du temps, ces fichiers de cache multimédia et la base de données de cache multimédia peuvent devenir trop volumineux ou corrompus et doivent être nettoyés pour éviter les problèmes. </p> <p> Ainsi, la méthode suivante pour résoudre le problème &quot;Le fichier n&#39;a pas de flux audio ou vidéo&quot; dans Premiere consiste à nettoyer la &quot;Base de données du cache des médias&quot; et à supprimer les fichiers de cache. Pour faire ça: * </p> <p><strong> A. Comment nettoyer la base de données du cache multimédia d&#39;Adobe Premiere. </strong></p> <p> 1. Ouvrez Adobe Premiere. <br> 2. Dans le menu, allez à <strong> Éditer </strong> -&gt; <strong> Préférences </strong> -&gt; <strong> Médias. <br> </strong> 3. Dans Media Cache Database, cliquez sur le bouton <strong> Faire le ménage </strong> bouton. </p> <p><img src=\"images/image_thumb-48-167.png\" alt=\"Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> 4. <strong> Redémarrer </strong> Adobe Premiere et essayez d&#39;ouvrir le fichier vidéo. si l&#39;erreur &quot;Le fichier n&#39;a pas de flux audio ou vidéo&quot; persiste, procédez au nettoyage des fichiers de cache d&#39;Adobe Premiere en suivant les instructions ci-dessous : </p> <p><strong> B. Comment effacer les fichiers de cache multimédia d&#39;Adobe Premiere. </strong></p> <p> 1. <strong> Ouvert </strong> Adobe première. <br> 2. Dans le menu, allez à <strong> Éditer </strong> -&gt; <strong> Préférences </strong> -&gt; <strong> Médias. <br> </strong> 3. Dans Media Cache Files, cliquez sur le bouton <strong> Parcourir </strong> ou notez l&#39;emplacement des fichiers de cache multimédia. </p> <p><img src=\"images/image_thumb-49-331.png\" alt=\"FIX: Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Fermer </strong> Adobe première. <br> 5. Dans l&#39;explorateur de fichiers, <strong> effacer </strong> tout le contenu du dossier &quot;Media Cache files&quot;. <br> 6. Importez le fichier vidéo dans Premiere. </p> <p> </p> <h6> Méthode 5. Réencoder le fichier vidéo. </h6> <p> La dernière méthode pour résoudre le problème &quot;Le fichier n&#39;a pas de flux audio ou vidéo&quot; dans le processus d&#39;importation d&#39;Adobe Premiere consiste à ré-encoder le fichier vidéo. Pour faire ça: </p> <p> 1. Téléchargez et installez <a href=\"https://handbrake.fr/downloads.php\" target=\"_blank\" rel=\"nofollow noopener\"> Frein à main </a> . <br> 2. Ouvrez le frein à main et cliquez sur <strong> Fichier - Ouvrir un seul fichier vidéo </strong> . </p> <p><img src=\"images/image_thumb-50-634.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Sélectionnez le fichier vidéo que vous ne pouvez pas importer dans Adobe Premiere et cliquez sur <strong> Ouvert </strong> . <br> 4. Définissez le format de sortie sur <strong> MP4, </strong> puis cliquez <strong> Parcourir </strong> et spécifiez l&#39;emplacement de stockage et le nom de fichier du fichier vidéo de sortie (ré-encodé). </p> <p><img src=\"images/image_thumb-51-817.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. À <strong> Dimensions </strong> onglet, définissez les mêmes dimensions que le fichier source. <br> 6. Une fois terminé, cliquez sur <strong> Démarrez l&#39;encodage. </strong></p> <p><img src=\"images/image_thumb-52-713.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Une fois le processus d&#39;encodage terminé, fermez Handbrake. <br> 7. Ouvrez le fichier vidéo réencodé dans Adobe Premiere. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}