{"title":"Comment réinstaller Windows 10 si Windows ne démarre pas.","content":"<p> Dans ce didacticiel, vous trouverez des instructions détaillées sur la façon de réinstaller Windows 10, si Windows ne démarre pas. Dans un tutoriel précédent, j&#39;ai mentionné la façon de <a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"nofollow noopener\"> réinstallez Windows 10 en utilisant la fonction &quot;RÉINITIALISER ce PC </a> . Mais, le &quot;RESET this PC&quot; n&#39;est disponible que si Windows 10 peut démarrer normalement, ou si vous pouvez lancer le menu &quot;Advanced Startup&quot; après avoir démarré sur Windows. (L&#39;option &quot;RESET this PC&quot; n&#39;est pas disponible lors du démarrage depuis USB). </p> <p> Ce tutoriel contient des instructions pour réinstaller Windows 10 si Windows ne démarre pas, sans perdre vos fichiers. </p> <h2> Comment réinstaller la paire Windows 10 si Windows ne peut pas démarrer. </h2> <p><strong> Conditions </strong> : Afin de réinstaller Windows 10 si Windows ne démarre pas normalement, vous devrez démarrer votre ordinateur à partir d&#39;un support d&#39;installation Windows (USB ou DVD) et activer le menu Options avancées (menu touche F8). Si vous ne possédez pas de support d&#39;installation Windows, vous pouvez en créer un en utilisant <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> L&#39;outil de création de médias de Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment créer un support d&#39;installation USB Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment créer un support d&#39;installation DVD Windows 10. </a></li> </ul> <p> 1. Démarrez votre ordinateur à partir du support d&#39;installation de Windows. <br> 3. Appuyez sur <strong> Suivant </strong> à l&#39;écran Options de langue. <br> 4. Choisissez <strong> Répare ton ordinateur </strong> . <br> 5. Ensuite, choisissez <strong> Dépannage -&gt; </strong><strong> Options avancées -&gt; Invite de commandes. </strong></p> <p> 6. Dans la fenêtre d&#39;invite de commande, tapez la commande suivante et appuyez sur <strong> Entrer: </strong></p> <ul> <li><strong> bcdedit /set {default} bootmenupolicy legacy </strong></li> </ul> <p><img src=\"images/image_thumb-33-821.png\" alt=\"advanced boot options\" loading=\"lazy\"></p> <p> 7. Tapez <strong> sortir </strong> pour fermer la fenêtre d&#39;invite de commande. <br> 8. Retirez le support d&#39;installation de Windows. <br> 9. Fermez toutes les fenêtres pour redémarrer ou éteindre votre PC. </p> <p> dix. <strong> presse </strong> les <strong> F8 </strong> clé <strong> à plusieurs reprises </strong> lors de la mise sous tension de l&#39;ordinateur. </p> <p> 11. Dans &quot;Menu Options avancées&quot;, mettez en surbrillance le &quot; <strong> Répare ton ordinateur </strong> &quot; puis appuyez sur <strong> ENTRER </strong> . </p> <p><img src=\"images/image_thumb-13-334.png\" alt=\"Repair your Computer in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 12. À l&#39;écran « Choisir une option », sélectionnez <strong> Dépannage </strong> puis cliquez <strong> Réinitialiser ce PC -&gt; Conserver mes fichiers. </strong> * </p> <p> Remarques: <br> 1. Le &quot; <strong> Garder mes fichiers&quot; </strong> option, supprimera toutes vos applications et tous vos paramètres, mais conservera vos fichiers personnels. <br> 2. Le <strong> &quot;Supprimer tout&quot; </strong> option, supprimera toutes les applications, paramètres et fichiers. En sélectionnant cette option, votre PC sera restauré à un état propre. <br> 3. Si vous choisissez de &quot;Supprimer tout&quot;, assurez-vous d&#39;avoir une sauvegarde récente de vos fichiers personnels sur un autre support de stockage (par exemple un disque USB), sinon tous vos fichiers seront perdus. </p> <p><img src=\"images/image_thumb-14-296.png\" alt=\"How to Reinstall Windows 10 if Windows Won't Boot.\" loading=\"lazy\"></p> <p> </p> <p> 13. À l&#39;écran suivant, choisissez un compte avec des privilèges d&#39;administrateur. ) et à l&#39;écran suivant, saisissez votre mot de passe et cliquez sur <strong> Suivant </strong> . </p> <p><img src=\"images/image_thumb-15-869.png\" alt=\"How to Reinstall Windows 10 if Windows cannot Boot.\" loading=\"lazy\"></p> <p> 14. Saisissez le mot de passe du compte sélectionné et cliquez sur <strong> Continuer. </strong></p> <p><img src=\"images/image_thumb-16-692.png\" alt=\"How to Reinstall Windows 10 if Windows fails to boot.\" loading=\"lazy\"></p> <p> </p> <p> 15. Attendez que l&#39;installation soit terminée. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez ce billet de blog sur les réseaux sociaux pour aider à faire connaître ce guide. </p>"}