{"title":"Comment bloquer YouTube sur Windows 10.","content":"<p> Parce que l&#39;apprentissage à distance est devenu une partie de la vie des enfants ces dernières années, de nombreux parents recherchent un moyen de bloquer les vidéos YouTube pendant l&#39;apprentissage en ligne ou de réduire le temps que les enfants passent devant un ordinateur à regarder des vidéos au lieu de faire d&#39;autres activités. </p> <p> Outre la dépendance à YouTube qui inquiète les parents, ces dernières années, de nombreuses vidéos YouTube avec un contenu inapproprié ou dangereux pour les enfants ont été publiées et pour cette raison, il est nécessaire de restreindre l&#39;accès à YouTube, en particulier lorsqu&#39;il n&#39;y a pas de surveillance par les parents. </p> <p> Dans ce guide, vous apprendrez comment empêcher l&#39;accès au site Web YouTube sur tous les navigateurs. * </p> <p> * Remarque : Si vous souhaitez bloquer un site Web uniquement dans Chrome ou dans Firefox, lisez cet article : <a href=\"https://www.repairwin.com/block-websites-on-chrome-firefox/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment bloquer des sites Web sur Chrome et Firefox. </a></p> <h2> Comment bloquer YouTube sur n&#39;importe quel navigateur sous Windows 10, 8 ou 7 OS. </h2> <p> Le moyen le plus fiable de bloquer n&#39;importe quel site Web sur n&#39;importe quel navigateur sur un PC Windows consiste à utiliser le fichier &quot;hosts&quot;. le <strong> hôtes </strong> est un fichier du système d&#39;exploitation qui mappe les noms d&#39;hôtes (noms de domaine) aux adresses IP. En termes simples, lorsque vous tapez l&#39;adresse d&#39;un site Web dans votre navigateur, l&#39;ordinateur regarde d&#39;abord le <strong> hôtes </strong> fichier pour résoudre son adresse IP. Si le nom du site n&#39;apparaît pas dans le fichier hôte, il essaie de trouver son adresse IP à partir du service DNS que vous utilisez sur votre appareil. </p> <p> Pour bloquer YouTube sur n&#39;importe quel navigateur Web (par exemple, Chrome, Firefox, Edge, etc.) sous Windows via le fichier hosts : </p> <p> 1. Ouvrir <strong> Bloc-notes </strong> application <strong> en tant qu&#39;administrateur </strong> . Pour faire ça: </p> <blockquote><p> une. Taper <strong> bloc-notes </strong> sur le champ de recherche </p> <p> b. <strong> Clic-droit </strong> au <strong> Bloc-notes </strong> et sélectionnez <strong> Exécuter en tant qu&#39;administrateur </strong> . </p> <p><img src=\"images/image_thumb-584.png\" alt=\"run notepad as administrator\" loading=\"lazy\"></p></blockquote> <p> </p> <p> 2. De <strong> Déposer </strong> menu, sélectionnez <strong> Ouvert. <br> </strong> 3. Accédez à cet emplacement sur votre disque : </p> <ul> <li> C:\\Windows\\System32\\drivers\\etc </li> </ul> <p> 4. Remplacez le &quot;Type de fichier&quot; par <strong> Tous les fichiers </strong> puis ouvrez le <strong> hôtes </strong> déposer </p> <p><img src=\"images/image_thumb-1-968.png\" alt=\"block sites hosts file\" loading=\"lazy\"></p> <p> </p> <p> 5. À la fin, ajoutez les lignes suivantes :* </p> <ul> <li> 127.0.0.1    youtube.com </li> <li> 127.0.0.1    www.youtube.com </li> <li> 127.0.0.1    m.youtube.com </li> </ul> <p> * Remarque : appuyez sur TAB après avoir tapé 127.0.0.1 </p> <p><img src=\"images/image_thumb-2-460.png\" alt=\"block youtube hosts\" loading=\"lazy\"></p> <p> </p> <p> 6. Une fois terminé, cliquez sur <strong> Déposer </strong> &gt; <strong> Sauvegarder </strong> et fermez le bloc-notes. </p> <p> 7. Enfin, ouvrez votre navigateur et essayez de visiter YouTube. Normalement, vous devriez recevoir le message : &quot;Connectez-vous à Internet. Vous êtes hors ligne. Vérifiez votre connexion&quot;. </p> <p><img src=\"images/image_thumb-3-490.png\" alt=\"block youtube.com hosts\" loading=\"lazy\"></p> <p> </p> <p> 8. Vous avez terminé. Si vous souhaitez débloquer YouTube à l&#39;avenir, suivez simplement les mêmes étapes. mais cette fois supprimez les trois (3) lignes ajoutées dans le fichier hosts, ou tapez le symbole <strong> # </strong> devant chaque ligne ajoutée. </p> <p> C&#39;est tout les gens ! Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}