{"title":"Comment réinitialiser les paramètres de Photoshop par défaut.","content":"<p> Si le programme Photoshop fonctionne de manière étrange, le moyen le plus rapide de résoudre le problème consiste à réinitialiser les paramètres de Photoshop par défaut. Dans ce didacticiel, vous trouverez des instructions détaillées sur la façon de réinitialiser les préférences de Photoshop à leurs valeurs par défaut. </p> <p> Dans le programme Adobe Photoshop, toutes les personnalisations (options d&#39;affichage, options de performances, options de transparence, options de curseur, etc.) sont enregistrées dans le fichier &quot;Préférences Adobe Photoshop&quot; lors de la fermeture de l&#39;application. Si le fichier de préférences est endommagé, le programme Photoshop agit de manière étrange et le seul moyen de résoudre le(s) problème(s) est de restaurer les paramètres de préférences à leurs valeurs par défaut. </p> <h4> Comment réinitialiser les préférences de Photoshop par défaut * </h4> <p> * Remarque : Les méthodes ci-dessus réinitialiseront tous les paramètres de préférences par défaut. Si vous souhaitez réinitialiser un ou tous les outils Photoshop, appliquez les actions suivantes : </p> <blockquote><p> 1. Dans le menu de Photoshop, cliquez sur <strong> les fenêtres </strong> puis sélectionnez le <strong> Options </strong> Objet. <br> 2. Sélectionnez ensuite l&#39;outil que vous souhaitez réinitialiser dans la Boîte à outils. <br> 3. Maintenant, faites un clic droit sur l&#39;outil à gauche de la barre d&#39;options et sélectionnez <strong> Outil de réinitialisation </strong> ou alors <strong> Réinitialiser tous les outils. </strong></p></blockquote> <p><img src=\"images/image_thumb-25-673.png\" alt=\"reset tools photoshop\" loading=\"lazy\"></p> <h6></h6> <h6> Méthode 1. Réinitialisez les préférences au démarrage de Photoshop. </h6> <p> La première méthode pour réinitialiser les paramètres dans Photoshop consiste à utiliser un raccourci clavier après le lancement de Photoshop. Pour faire ça: </p> <p> 1. <strong> Quitter </strong> Photoshop. <br> 2. <strong> Double-cliquez </strong> sur l&#39;icône Photoshop et immédiatement <strong> maintenez enfoncé </strong> les <strong> Ctrl+Alt+Maj </strong> touches (sous Windows) ou le <strong> Commande+Option+Maj </strong> (sous Mac OS). <br> 3. Lorsqu&#39;on lui a demandé de <strong> « Supprimer le fichier de paramètres Adobe Photoshop ? » </strong> Cliquez sur <strong> Oui. </strong></p> <p><img src=\"images/image_thumb-24-561.png\" alt=\"delete photoshop settings\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Méthode 2. Réinitialisez les préférences à partir du menu de Photoshop. </h6> <p> 1. Lancez Photoshop. <br> 2. De la <strong> Éditer </strong> menu, sélectionnez <strong> Préférences </strong> -&gt; <strong> Général <br> </strong> 3. Cliquez sur <strong> Réinitialiser les préférences en quittant. </strong></p> <p><img src=\"images/image_thumb-21-842.png\" alt=\"Reset Adobe Photoshop Preferences on Quit\" loading=\"lazy\"></p> <p> </p> <p> 4. Cliquez sur <strong> d&#39;accord </strong> lorsqu&#39;on lui a demandé de réinitialiser les préférences lors de la fermeture de Photoshop. </p> <p><img src=\"images/image_thumb-22-194.png\" alt=\"Reset Photoshop Settings on Quit\" loading=\"lazy\"></p> <p> </p> <p> 5. Cliquez sur <strong> d&#39;accord </strong> à nouveau pour fermer la boîte de dialogue Préférences. <br> 6. Fermez et relancez Photoshop. </p> <p> </p> <h6> Méthode 3. Supprimez ou renommez le fichier de paramètres Adobe Photoshop. </h6> <p> La dernière méthode pour réinitialiser les préférences de Photoshop à leurs valeurs par défaut consiste à renommer ou à supprimer le fichier de paramètres Photoshop (Adobe Photoshop %Version% Prefs.psp), à l&#39;emplacement suivant sur votre PC :* </p> <ul> <li> C:\\Users\\%Username%\\AppData\\Roaming\\Adobe\\Adobe Photoshop %Version%\\Adobe Photoshop %Version% Settings\\ <strong> Adobe Photoshop %Version% Prefs.psp </strong></li> </ul> <p> * Remarque : Sous MAC OS, accédez à : </p> <ul> <li> Users\\%Username%\\Library\\Preferences\\Adobe Photoshop %Version% Settings\\ <strong> Adobe Photoshop %Version% Prefs.psp </strong></li> </ul> <p> Pour supprimer les préférences Adobe sous Windows 10, 8, 7 OS : </p> <p> 1. <strong> Quitter </strong> Photoshop. <br> 2. Accédez au dossier &quot;C:\\Users\\%Username%\\AppData\\Roaming\\&quot;. Pour faire ça: </p> <blockquote><p> 1. Appuyez sur le bouton Windows <img src=\"images/image_thumb8_thumb_thumb-455.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Dans la zone de recherche, saisissez : <strong> %données d&#39;application% </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </p></blockquote> <p><img src=\"images/image_thumb-66-926.png\" alt=\"Delete Photoshop Preferences file\" loading=\"lazy\"></p> <p> </p> <p> 4. Accédez ensuite au dossier &quot;…\\Adobe\\Adobe Photoshop %Version%\\Adobe Photoshop %Version% Settings\\&quot;. <br> 5. <strong> Effacer </strong> ou alors <strong> Renommer </strong> le fichier &quot;Adobe Photoshop %Version% Prefs.psp&quot; vers Adobe Photoshop %Version% Prefs.OLD&quot; * </p> <p> * Remarque : si vous possédez Photoshop 64 bits, renommez ou supprimez également le fichier &quot;Adobe Photoshop X64 %version% Prefs.psp&quot;. </p> <p><img src=\"images/image_thumb-23-438.png\" alt=\"Re-create Photoshop Settings File\" loading=\"lazy\"></p> <p> </p> <p> 6. Lancez Photoshop. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}