{"title":"CORRECTIF : impossible de terminer le processus. L&#39;opération n&#39;a pas pu être terminée, l&#39;accès est refusé.","content":"<p> Si vous ne pouvez pas terminer un processus ou un service dans Windows, car vous obtenez l&#39;erreur &quot;Impossible de terminer le processus. L&#39;opération n&#39;a pas pu être terminée, l&#39;accès est refusé&quot;, continuez à lire ci-dessous pour savoir comment résoudre le problème. </p> <p><img src=\"images/image_thumb-10-874.png\" alt=\"Unable to terminate process. Access is denied\" loading=\"lazy\"></p> <p> La façon habituelle d&#39;arrêter un processus en cours dans Windows consiste à ouvrir le Gestionnaire des tâches, à cliquer avec le bouton droit sur le nom du processus et à sélectionner « Terminer la tâche ». Mais, comme vous le savez peut-être, il est parfois impossible d&#39;arrêter un processus car vous recevez le message &quot;Impossible de terminer le processus. L&#39;accès est refusé&quot;. </p> <p> De même, vous pouvez rencontrer un problème similaire si vous souhaitez arrêter un service et vous ne pouvez pas, car l&#39;option &quot;Arrêter&quot; est grisée, ou parce que vous recevez l&#39;erreur &quot;Impossible d&#39;arrêter le service. L&#39;accès est refusé&quot; lorsque vous essayez d&#39;arrêter le un service. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"Unable to Terminate Service\" loading=\"lazy\"></p> <p> Dans ce didacticiel, vous apprendrez à résilier tous les services ou processus que vous ne pouvez pas résilier en utilisant les méthodes habituelles. </p> <h4> Comment forcer l&#39;arrêt d&#39;un service ou d&#39;un programme à partir de PowerShell dans le système d&#39;exploitation Windows 10/8/7. </h4> <ul> <li><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> Comment forcer la fermeture de n&#39;importe quelle application à partir de PowerShell. </a></li> <li><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> Comment forcer la fermeture de n&#39;importe quel service à partir de PowerShell. </a></li> </ul> <h6></h6> <h6> Partie 1. Comment mettre fin à une application à partir de PowerShell. </h6> <p> 1. Ouvrez PowerShell en tant qu&#39;administrateur. </p> <p> 2. Dans PowerShell, tapez la commande suivante pour obtenir l&#39;ID de processus (PID). </p> <ul> <li><strong> liste de tâches </strong></li> </ul> <p><img src=\"images/image_thumb-12-275.png\" alt=\"Terminate process from powershell\" loading=\"lazy\"></p> <p> </p> <p> 3. Notez le nom de l&#39;application que vous souhaitez supprimer, puis tapez la commande suivante pour fermer toutes les instances de l&#39;application. * </p> <ul> <li> Arrêter le processus -Nom &quot;Application_Name&quot; </li> </ul> <p> * Remarque : à Application_Name, saisissez le nom de l&#39;application sans l&#39;extension .exe. Par exemple, si vous souhaitez forcer la fermeture de l&#39;application &quot;chrome.exe&quot;, tapez : </p> <ul> <li><em> Arrêter le processus -Nom &quot;chrome&quot; </em></li> </ul> <p><img src=\"images/image_thumb-16-974.png\" alt=\"Stop Program PowerShell\" loading=\"lazy\"></p> <p> </p> <p><strong> ASTUCE: </strong> Si vous souhaitez mettre fin à une seule instance d&#39;un programme, saisissez la commande suivante : </p> <ul> <li> Arrêt-Process -ID PID </li> </ul> <p> * Remarque : Au PID, saisissez le numéro unique de l&#39;instance du programme. </p> <p> </p> <h6> Partie 2. Comment mettre fin à un service à partir de PowerShell. </h6> <p> 1. Ouvrez le gestionnaire de tâches et à partir du <strong> Prestations de service </strong> onglet, notez le <strong> PID </strong> du service que vous souhaitez arrêter. </p> <p><em> par exemple. Dans cet exemple, nous allons forcer l&#39;arrêt du service &quot;AdobeARMservice&quot; avec PID <strong> 1640 </strong> . </em></p> <p><img src=\"images/image_thumb-14-150.png\" alt=\"Force Stop Service PowerShell\" loading=\"lazy\"></p> <p> </p> <p> 2. Ensuite, exécutez <strong> PowerShell en tant qu&#39;administrateur </strong> et tapez cette commande : </p> <ul> <li> kill -id PID </li> </ul> <p> * Remarque : En tant que PID, saisissez le PID que vous avez remarqué dans le Gestionnaire des tâches. Dans cet exemple la commande sera : </p> <ul> <li><em> tuer -id 1640 </em></li> </ul> <p><img src=\"images/image_thumb-15-147.png\" alt=\"Kill Running Service from PowerShell\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}