{"title":"CORRECTIF : la mise à jour de Windows 10 n&#39;a pas pu désinstaller Avira AntiVir (résolu)","content":"<p> Sur un ordinateur Windows 10, le message suivant apparaît lorsque vous essayez de mettre à jour Windows 10 vers la version 1803 ou 1809 : « Certaines applications doivent être désinstallées : ces programmes doivent être désinstallés car ils ne sont pas compatibles avec la mise à niveau : Avira Antivirus » et en appuyant sur le bouton &quot;Désinstaller et continuer&quot;, l&#39;erreur suivante apparaît : &quot;Nous n&#39;avons pas pu désinstaller ces applications : Avira AntiVir&quot;. La chose amusante avec ce problème, c&#39;est que l&#39;Avira Antivir (Antivirus) n&#39;est pas installé sur le PC (non répertorié dans les programmes installés). </p> <p><img src=\"images/image_thumb-10-929.png\" alt=\"Windows 10 Update Couldn't uninstall Avira AntiVir\" loading=\"lazy\"></p> <p> Le problème &quot;Impossible de désinstaller Avira AntiVir&quot; lors de la mise à niveau de Windows 10 v1803, est dû au fait que le programme de mise à jour trouve sur votre PC certains fichiers associés à Avira Antivirus et qu&#39;ils n&#39;ont pas supprimés lors de la désinstallation d&#39;Avira. * </p> <p> * Remarque : Si le programme &quot;Avira Antivirus&quot; est vraiment installé sur votre machine, désinstallez-le à l&#39;aide de l&#39;option &quot;Programmes et fonctionnalités&quot; du panneau de configuration, puis procédez à la mise à jour de votre système vers Windows 10 v1803 (ou 1809). Après la mise à niveau, téléchargez et installez la dernière version d&#39;Avira Antivirus sur votre système. </p> <h4> Comment CORRIGER l&#39;erreur de mise à jour de Windows 10 : impossible de désinstaller Avira AntiVir. </h4> <p> </p> <p> 1. Démarrez Windows dans <strong> Mode sans échec </strong> . Pour faire ça: </p> <ul> <li> <ul> <li> Appuyez sur les fenêtres <img src=\"images/image_thumb8_thumb_thumb-432.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. </li> <li> Taper <strong> msconfig </strong> et appuyez sur <strong> Entrer </strong> . </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-47-667.png\" alt=\"msconfig\" loading=\"lazy\"></p> <ul> <li> <ul> <li> À <strong> Botte </strong> onglet sélectionnez le <strong> Démarrage securisé </strong> option, puis cliquez sur <strong> d&#39;accord </strong> et redémarrez votre ordinateur. </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-48-342.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Après le redémarrage, ouvrez l&#39;explorateur de fichiers et supprimez le <strong> avipbb.sys </strong> fichier à partir des emplacements suivants : </p> <ul> <li> C:\\Windows\\System32\\drivers </li> <li> C:\\Windows\\SysWOW64\\drivers </li> </ul> <p> </p> <p> 3. Procédez à la suppression des emplacements ci-dessus tous les autres fichiers nommés <strong> avipbb </strong> malgré son extension. </p> <p> 4. Supprimez ensuite le <strong> Avira </strong> dossier à partir de l&#39;emplacement suivant : </p> <ul> <li> (Windows 64 bits) : C:\\Program Files (x86)\\ <strong> Avira\\Antivirus </strong></li> <li> (Windows 32 bits) : C:\\Program Files\\ <strong> Avira\\Antivirus </strong></li> </ul> <p> 5. Courir <strong> msconfig </strong> de nouveau. <br> 6. Dans l&#39;onglet Général, cliquez sur Démarrage normal et cliquez sur <strong> d&#39;accord </strong> , pour redémarrer votre ordinateur normalement. </p> <p><img src=\"images/image_thumb-11-949.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Vérifiez et installez les mises à jour. * </p> <p> * Remarque : Si vous rencontrez toujours l&#39;erreur « Impossible de désinstaller Avira AntiVir » lors de la mise à jour, téléchargez et exécutez le <a href=\"https://www.avira.com/en/support-download-avira-registrycleaner/1//\" target=\"_blank\" rel=\"nofollow noopener\"> Nettoyeur de registre Avira </a> . </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}