{"title":"Comment vérifier les mises à jour dans Office 2019, 2016 ou 2013 dans Windows 10.","content":"<p> Dans ce didacticiel, vous apprendrez à rechercher manuellement les mises à jour dans Office 2019, 2016 et Office 2013. Dans toutes les versions d&#39;Office, il existe deux manières d&#39;installer les mises à jour Office disponibles : automatiquement et manuellement. </p> <h4> Comment mettre à jour Office 209/2016/2013/2010 manuellement. </h4> <h6> Méthode 1. Comment rechercher manuellement les mises à jour Office dans Office 2019, 2016 et Office 2013. </h6> <p> Pour vérifier et installer manuellement les mises à jour Office disponibles, dans toutes les versions d&#39;Office : </p> <p> 1. Ouvrez n&#39;importe quel programme Office (par exemple, Word). <br> 2. De <strong> Déposer </strong> menu, choisissez <strong> Compte </strong> . * </p> <p> * Remarque : Dans Office 2010, choisissez <strong> Aider. </strong></p> <p> 3. Développez le <strong> Options de mise à jour </strong> et cliquez <strong> Mettez à jour maintenant </strong> . * </p> <p> * Remarque : Si les « Options de mise à jour » ne sont pas disponibles, suivez les instructions de la méthode 2 ci-dessous. </p> <p><img src=\"images/image_thumb-19-478.png\" alt=\"How to Check for Updates in Office 2019, 2016 or 2013 in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Méthode 2. Comment installer automatiquement les mises à jour Office pour Office 2019, 2016 et Office 2013. </h6> <p> Si vous souhaitez que Windows télécharge et installe automatiquement les mises à jour Office disponibles, accédez aux paramètres de mise à jour Windows et vérifiez le paramètre suivant : </p> <ul> <li> Recevez des mises à jour pour d&#39;autres produits Microsoft lorsque vous mettez à jour Windows (Windows 10) </li> <li> Donnez-moi des mises à jour pour d&#39;autres produits Microsoft lorsque je mets à jour Windows (Windows 7) </li> </ul> <h5> Pour installer les mises à jour Office automatiquement dans Windows 10. </h5> <p><strong> 1. </strong> Aller à <strong> Paramètres </strong> -&gt; <strong> Mise à jour et sécurité -&gt; Options avancées. </strong></p> <p><img src=\"images/image_thumb-20-149.png\" alt=\"Change Update Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Dans les options de mise à jour, faites glisser le curseur « Recevoir les mises à jour pour d&#39;autres produits Microsoft lorsque vous mettez à jour Windows » vers <strong> AU. </strong></p> <p><img src=\"images/image_thumb-21-717.png\" alt=\"automatically install office updates windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Accédez à l&#39;écran précédent et cliquez sur le bouton <strong> Vérifier les mises à jour </strong> vous souhaitez installer immédiatement les mises à jour Office disponibles. </p> <p> </p> <h5> Pour installer les mises à jour Office automatiquement dans Windows 7. </h5> <p> 1. Accédez à <strong> Panneau de commande </strong> -&gt; <strong> Windows Update </strong> et cliquez <strong> Modifier les paramètres </strong> . </p> <p><img src=\"images/image_thumb-22-108.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Sélectionnez le <strong> Donnez-moi des mises à jour pour d&#39;autres produits Microsoft lorsque je mets à jour Windows </strong> case à cocher et cliquez <strong> Appliquer </strong> . </p> <p> 3. Cliquez sur <strong> Vérifier les mises à jour </strong> pour installer toutes les mises à jour disponibles. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section des commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître ce guide. </p> <p> </p>"}