{"title":"CORRECTIF : aucun son HDMI sur le téléviseur ou HDMI ne s&#39;affiche pas dans les appareils de lecture (résolu).","content":"<p> Si vous avez connecté votre téléviseur à votre ordinateur portable à l&#39;aide d&#39;un câble HDMI et qu&#39;il n&#39;y a pas de sortie audio pendant la lecture d&#39;une vidéo, ou que le HDMI ne s&#39;affiche pas comme périphérique de lecture, continuez à lire ce didacticiel. </p> <p> Problème en détails : sur un ordinateur portable exécutant Windows 10, le périphérique de sortie numérique (HDMI) n&#39;est pas répertorié comme périphérique de lecture et il n&#39;y a pas de sortie audio lorsqu&#39;il est connecté au téléviseur avec un câble HDMI. </p> <p> Le problème &quot;Aucune sortie audio depuis HDMI&quot; dans Windows 10 peut apparaître pour plusieurs raisons. Dans ce guide, vous trouverez donc des instructions étape par étape pour résoudre le problème. </p> <h2> Comment réparer: aucune sortie audio de HDMI et HDMI ne s&#39;affiche dans les appareils de lecture sous Windows 10 * </h2> <p> * Suggestions : Avant de passer aux étapes ci-dessous : </p> <ul> <li><strong> Clic-droit </strong> au <strong> icône du son </strong><img src=\"images/image_thumb-11-109.png\" alt=\"image\" loading=\"lazy\"> dans la barre des tâches pour <strong> Ouvrir le mélangeur de volume </strong> et s&#39;assurer que le <strong> Périphérique de sortie numérique </strong> n&#39;est pas mis en sourdine. </li> <li> Assurez-vous que le câble HDMI est correctement connecté à la fois sur l&#39;ordinateur portable et sur le téléviseur. </li> <li> Après avoir connecté le câble HDMI, <strong> redémarrer </strong> ton ordinateur. </li> <li> Sur le téléviseur, définissez le bon port HDMI comme périphérique d&#39;entrée vidéo. </li> <li> Si vous possédez un ordinateur portable, fermez le couvercle ou appuyez une fois sur le bouton d&#39;alimentation pour mettre votre ordinateur portable en veille. Appuyez ensuite à nouveau sur le bouton d&#39;alimentation et vérifiez à nouveau le son du HDMI. </li> <li> Vérifiez si le problème persiste, avec un autre câble HDMI. </li> </ul> <p> </p> <h3> Étape 1. Définissez HDMI comme périphérique de lecture par défaut. </h3> <p> La première étape pour résoudre les problèmes audio HDMI sous Windows 10 consiste à définir HDMI comme périphérique audio par défaut. </p> <p> 1. Accédez à Windows <strong> Panneau de commande </strong> et ouvrir <strong> Sonner. </strong></p> <p><img src=\"images/image_thumb-14-686.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Assurez-vous que <strong> Sortie numérique </strong> (HDMI) est le <strong> Défaut </strong> périphérique de lecture, sinon sélectionnez le <strong> Sortie numérique </strong> appareil et cliquez sur le <strong> Définir par defaut </strong> bouton. Une fois terminé, lisez une vidéo pour tester le son HDMI et si le problème persiste, passez à l&#39;étape suivante. * </p> <p><img src=\"images/image_thumb-43-106.png\" alt=\"FIX: HDMI No Sound Output \" loading=\"lazy\"></p> <p> </p> <p> * Remarques : essayez ce qui suit, selon votre cas : </p> <p> 1. Si le <strong> Sortie numérique </strong> l&#39;appareil est <strong> désactivée </strong> , faites un clic droit dessus et cliquez <strong> Activer </strong> . Mettez-le ensuite en surbrillance et appuyez sur <strong> Définir par defaut </strong> . </p> <p><img src=\"images/image_thumb-44-233.png\" alt=\"FIX: HDMI Not Listed in Playback devices \" loading=\"lazy\"></p> <p> 2. Si le périphérique de sortie numérique ne s&#39;affiche pas en tant que périphérique de lecture : </p> <blockquote><p> une. Cliquez avec le bouton droit sur un espace vide et assurez-vous que les deux <strong> Afficher les appareils désactivés </strong> et le <strong> Afficher les appareils déconnectés </strong> les options sont sélectionnées (cochées). Si l&#39;une des options ci-dessus n&#39;est pas sélectionnée, cliquez dessus pour la sélectionner. </p></blockquote> <p><img src=\"images/image_thumb-45-410.png\" alt=\"Enable HDMI DIgital Output\" loading=\"lazy\"></p> <blockquote><p> b. Cliquez ensuite avec le bouton droit sur le périphérique de sortie numérique et choisissez <strong> Activer. <br> c. </strong> Une fois terminé, définissez comme <strong> défaut </strong> les <strong> Sortie numérique </strong> appareil. </p> </blockquote> <h3><br clear=\"all\"> Étape 2. Restaurez le pilote de la carte son. </h3> <p> Dans certains cas, le problème « HDMI pas de son sur le téléviseur » peut apparaître après une mise à jour automatique du pilote. Alors, continuez et restaurez le pilote audio. </p> <p> 1. Ouvrir <strong> Gestionnaire de périphériques </strong> . Pour faire ça: </p> <blockquote><p> 1. Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-781.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Dans la case &quot;Ouvrir&quot;, saisissez : <strong> devmgmt.msc </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-5-389.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Développer </strong> les <strong> Contrôleurs son, vidéo et jeu. <br> 3. Faites un clic droit </strong> sur le <strong> Appareil audio haute définition </strong> et sélectionnez <strong> Propriétés. </strong></p> <p><img src=\"images/image_thumb-17-970.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. Dans l&#39;onglet Pilote, cliquez sur <strong> Faire reculer le pilote </strong> bouton. <strong> * </strong></p> <p> * Remarque : si le bouton Roll Back Driver est inactif, passez à l&#39;étape suivante. </p> <p><img src=\"images/image_thumb-18-921.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> 5. Sélectionnez une raison pour la restauration du package de pilotes et cliquez sur <strong> Oui. </strong></p> <p><img src=\"images/image_thumb-19-748.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Lorsque la restauration du pilote est terminée, <strong> redémarrer </strong> ton ordinateur. <br> 5. Après le redémarrage, continuez et testez le son du HDMI. Si vous n&#39;entendez toujours pas le son sur votre téléviseur, passez à l&#39;étape suivante. </p> <h3> Étape 3. Changez le pilote de la carte son. </h3> <p> L&#39;absence de son est souvent due à un mauvais pilote de carte son. Pour corriger, ce problème : </p> <p> 1. Ouvrir <strong> Gestionnaire de périphériques. </strong><br> 2. <strong> Développer </strong> les <strong> Contrôleurs son, vidéo et jeu. <br> </strong> 3. <strong> Clic-droit </strong> à <strong> Realtek High Definition Audio </strong> appareil et sélectionnez <strong> Mettre à jour le pilote. <br> </strong></p> <p><img src=\"images/image_thumb-6-937.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Sélectionnez <strong> Parcourir mon ordinateur pour les pilotes. </strong></p> <p><img src=\"images/image_thumb-7-874.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Sélectionnez <strong> Laissez-moi choisir parmi une liste de pilotes disponibles sur mon ordinateur </strong> . </p> <p><img src=\"images/image_thumb-8-498.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. Sur l&#39;écran suivant, sélectionnez le <strong> Périphérique audio haute définition </strong> et cliquez <strong> Suivant. </strong></p> <p><img src=\"images/image_thumb-20-756.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/07/image-10.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 8. Une fois l&#39;installation du pilote terminée, <strong> redémarrer </strong> ton ordinateur. <br> 9. Après le redémarrage, continuez et testez le son des haut-parleurs de l&#39;ordinateur portable. </p> <h3> Étape 4. Désinstallez et réinstallez le pilote de la carte son. </h3> <p> 1. Ouvrir <strong> Gestionnaire de périphériques. </strong><br> 2. <strong> Développer </strong> les <strong> Contrôleurs son, vidéo et jeu. <br> </strong> 3. <strong> Clic-droit </strong> à <strong> Son haute définition </strong> appareil et sélectionnez <strong> Désinstaller l&#39;appareil. </strong></p> <p><img src=\"images/image_thumb-21-678.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. Après la désinstallation, <strong> redémarrer </strong> votre ordinateur et laissez Windows installer les pilotes audio automatiquement. Si cela ne se produit pas, accédez à <strong> Paramètres </strong> &gt; <strong> Mise à jour et sécurité </strong> et forcer Windows à <strong> Vérifiez les mises à jour. </strong></p> <p> </p> <h3> Étape 5. Désinstallez et réinstallez l&#39;adaptateur d&#39;affichage. </h3> <p> 1. Ouvrir <strong> Gestionnaire de périphériques. <br> </strong> 2. <strong> Développer </strong> les <strong> Prises d&#39;écran. <br> </strong> 3. <strong> Clic-droit </strong> sur la carte graphique installée et sélectionnez <strong> Désinstaller l&#39;appareil. </strong></p> <p><img src=\"images/image_thumb-46-871.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. Après la désinstallation, <strong> redémarrer </strong> votre ordinateur et laissez Windows installer les pilotes d&#39;affichage automatiquement. Si cela ne se produit pas, ou si vous rencontrez toujours le problème, accédez au site d&#39;assistance du fabricant de votre ordinateur portable et téléchargez les derniers pilotes d&#39;affichage en fonction du modèle de votre ordinateur portable. </p> <p> C&#39;est tout les gens ! Quelle méthode a fonctionné pour vous ? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}