{"title":"CORRECTIF : noms d&#39;utilisateur en double dans l&#39;écran de connexion après la mise à jour de Windows 10.","content":"<p> Ce didacticiel contient plusieurs méthodes pour résoudre le problème des noms d&#39;utilisateur en double dans l&#39;écran de connexion après la mise à jour de Windows 10. Le problème « noms d&#39;utilisateur en double dans l&#39;écran de connexion » est signalé par de nombreux utilisateurs et causé après l&#39;installation des mises à jour sur Windows 10. </p> <p><img src=\"images/image_thumb-44-494.png\" alt=\"FIX: Duplicate User Names in Sign-in Screen Windows 10\" loading=\"lazy\"></p> <p> Problème dans les détails : Après avoir renommé votre ordinateur ou après avoir installé des mises à jour dans Windows 10, le système ne se connecte pas automatiquement à votre compte d&#39;utilisateur avec l&#39;erreur &quot;le nom d&#39;utilisateur ou le mot de passe est incorrect. Réessayez&quot; et en même temps votre nom d&#39;utilisateur apparaît deux fois dans l&#39;écran de connexion. </p> <h4> Résoudre le problème : l&#39;écran de connexion de Windows 10 affiche deux fois le même utilisateur. </h4> <h6> Méthode 1. Supprimez les options de compte en double des comptes d&#39;utilisateur. </h6> <p> La première méthode pour supprimer les noms d&#39;utilisateur en double de l&#39;écran de connexion consiste à supprimer le compte en double de votre PC. </p> <p> 1. Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-923.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Dans la case &quot;Ouvrir&quot;, saisissez : <strong> contrôler les mots de passe utilisateur2 </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-29-663.png\" alt=\"control userpasswords2 \" loading=\"lazy\"></p> <p> 3. Dans les options Comptes d&#39;utilisateurs, effectuez les actions suivantes selon votre cas : </p> <ul> <li><strong> Cas A. </strong> Si vous voyez deux comptes avec le même nom d&#39;utilisateur : </li> </ul> <blockquote><p> une. Sélectionnez le compte secondaire et cliquez sur <strong> Supprimer </strong> . <br> b. Cliquez sur <strong> d&#39;accord </strong> et <strong> redémarrer </strong> votre ordinateur. <br> c. Si après le redémarrage, vous voyez toujours votre nom d&#39;utilisateur deux fois sur l&#39;écran de connexion, passez à la méthode 2. </p></blockquote> <p><img src=\"images/image_thumb-37-605.png\" alt=\"User Accounts Options\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Cas B. </strong> Si vous ne voyez qu&#39;un seul compte : </li> </ul> <blockquote><p> une. Sélectionnez le compte et cliquez sur <strong> Propriétés </strong> . <br> b. Copiez le nom complet et collez-le dans le champ Nom d&#39;utilisateur, afin de faire correspondre. * <br> c. Cliquez sur <strong> d&#39;accord </strong> et <strong> redémarrer </strong> votre ordinateur. </p></blockquote> <p> * Remarque : si le nom d&#39;utilisateur et le nom complet correspondent déjà, passez à la méthode 2. </p> <p><img src=\"images/image_thumb-38-262.png\" alt=\"Remove Duplicate User Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Méthode 2. Désactivez l&#39;exigence de mot de passe lors de la connexion. </h6> <p> 1. Suivez les étapes 1 et 2 de la méthode précédente pour ouvrir les options « Comptes d&#39;utilisateurs ». <br> 2. <strong> Décocher </strong> les <strong> L&#39;utilisateur doit entrer un nom d&#39;utilisateur et un mot de passe pour utiliser cet ordinateur </strong> et cliquez <strong> Appliquer </strong></p> <p><img src=\"images/image_thumb-42-373.png\" alt=\"User must enter a user name and password to use this computer \" loading=\"lazy\"></p> <p> </p> <p> 3. Tapez votre mot de passe (deux fois) et cliquez sur <strong> d&#39;accord </strong> deux fois pour fermer toutes les fenêtres. </p> <p><img src=\"images/image_thumb-43-970.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. <strong> Redémarrer </strong> ton ordinateur. Si votre nom d&#39;utilisateur apparaît à nouveau deux fois, passez à la méthode suivante. </p> <h6></h6> <h6> Méthode 3. Modifiez les options de connexion. </h6> <p> </p> <p> 1. Depuis le début <img src=\"images/image_thumb-39-183.png\" alt=\"image\" loading=\"lazy\"> menu, ouvrir <strong> Paramètres </strong> <img src=\"images/image_thumb-50-520.png\" alt=\"image\" loading=\"lazy\"> puis cliquez sur <strong> Comptes </strong> . </p> <p><img src=\"images/image_thumb-43-892.png\" alt=\"How to Add a New User in Windows 10, 8.1.\" loading=\"lazy\"></p> <p> </p> <p> 2. Sélectionnez <strong> Options de connexion </strong> sur le volet de gauche, et <strong> éteindre </strong> les <strong> Utiliser mes informations de connexion pour terminer automatiquement la configuration de mon appareil et rouvrir mes applications après la mise à jour ou le redémarrage </strong> . </p> <p><img src=\"images/image_thumb-40-207.png\" alt=\"Modify Sign in Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Redémarrer </strong> votre ordinateur. </p> <p> </p> <h6> Méthode 4. Passez au compte local. </h6> <p> La dernière méthode pour résoudre le problème des &quot;noms d&#39;utilisateur en double&quot; consiste à utiliser un compte local pour se connecter à Windows 10. Pour ce faire : </p> <p> 1. Depuis le début <img src=\"images/image_thumb-41-454.png\" alt=\"image\" loading=\"lazy\"> menu, ouvrir <strong> Paramètres </strong> <img src=\"images/image_thumb-50-790.png\" alt=\"image\" loading=\"lazy\"> puis cliquez sur <strong> Comptes </strong> . <br> 2. Cliquez sur <strong> Courriel et comptes </strong> sur le volet de gauche. <br> 3. Cliquez sur Suivant <strong> Connectez-vous plutôt avec un compte local. </strong></p> <p> </p> <p><img src=\"images/image_thumb-37-653.png\" alt=\"sign-in with a local account instead windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Saisissez le mot de passe de votre compte Microsoft et cliquez sur <strong> Suivant </strong> . <br> 5. Tapez ensuite le nom d&#39;utilisateur, le mot de passe (facultatif) du nouveau compte local et cliquez sur <strong> Suivant </strong> . <br> 6. Après le redémarrage, saisissez votre mot de passe pour vous connecter avec le nouveau compte local. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}