{"title":"Comment supprimer l&#39;option CLIQUEZ ICI POUR EN SAVOIR PLUS SUR MICROSOFT EXCHANGE dans Outlook.","content":"<p> Si vous ne voulez pas à chaque fois cliquer sur le lien hypertexte &quot;Cliquez ici pour en savoir plus sur Exchange&quot; dans Outlook, afin d&#39;afficher tous les e-mails stockés sur Exchange, continuez à lire ci-dessous. Le lien hypertexte « Cliquez ici pour en savoir plus sur Exchange » dans Outlook apparaît car les dossiers de messagerie affichent uniquement les éléments les plus récents (e-mails). Il s&#39;agit d&#39;un comportement par défaut, car lorsque vous utilisez Microsoft Outlook 2019, Outlook 2016, Outlook 2013 ou Outlook pour Office 365 pour vous connecter à votre boîte aux lettres Exchange Server, Outlook affiche l&#39;un des e-mails de l&#39;année précédente. </p> <p><img src=\"images/image_thumb-19-421.png\" alt=\"How to Remove the \" click here to view more on exchange option in outlook. loading=\"lazy\"></p> <p> </p> <p> Pour supprimer le lien hypertexte « Cliquez ici pour en savoir plus sur Exchange » afin d&#39;afficher tous vos éléments de courrier électronique, lorsque vous êtes connecté à une boîte aux lettres Exchange, suivez les étapes ci-dessous. </p> <h4> Comment forcer Outlook à afficher tous vos e-mails à partir de votre boîte aux lettres Exchange. </h4> <p> Pour afficher tous vos e-mails Exchange dans Outlook : </p> <p> 1. Cliquez sur le <strong> Déposer </strong> menu et allez à <strong> Compte </strong> &gt; <strong> Paramètres du compte </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-1-139.png\" alt=\"How to Backup Outlook\" loading=\"lazy\"></p> <p> 2. Mettez en surbrillance le compte Exchange et cliquez sur <strong> Changer </strong> . </p> <p><img src=\"images/image_thumb-20-777.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Dans le paramètre « Télécharger les e-mails du passé », faites glisser le curseur jusqu&#39;à la fin. </p> <p><img src=\"images/image_thumb-17-833.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Une fois terminé, cliquez sur <strong> Suivant </strong> et <strong> Finir </strong> puis fermez les paramètres du compte. </p> <p><img src=\"images/image_thumb-18-585.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Redémarrer </strong> Perspectives. </p> <p> C&#39;est tout les gens ! Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}