{"title":"CORRECTIF : le menu Démarrer de Windows 10, les paramètres, Cortana ou la barre des tâches ne fonctionnent pas. (Résolu)","content":"<p> Ce didacticiel contient des instructions pour résoudre les problèmes suivants dans Windows 10 : le menu Démarrer ne s&#39;ouvre pas, la recherche Cortana ne fonctionne pas, l&#39;application Paramètres ne se lance pas, les icônes de la barre des tâches ne s&#39;ouvrent pas. </p> <p> De nombreux utilisateurs de Windows 10 ont signalé des problèmes avec le menu Démarrer, la barre des tâches, Cortana et les paramètres. Dans ce guide, je répertorie donc les méthodes les plus courantes pour résoudre les problèmes ci-dessus. </p> <h2> Comment CORRIGER : barre des tâches Windows 10, menu Démarrer, paramètres ou problèmes Cortana. </h2> <h3> Méthode 1. Désinstallez la dernière mise à jour de Windows 10. </h3> <p> De nombreux utilisateurs ont signalé que les problèmes mentionnés dans cet article sont résolus après la désinstallation <strong><a href=\"https://support.microsoft.com/en-us/topic/august-11-2020-kb4566782-os-build-19041-450-ec5cf4b6-86ed-b0d3-539c-5fbe1b17f56a\" target=\"_blank\" rel=\"nofollow noopener\"> KB4566782 </a></strong> Mettre à jour. </p> <p> Si vous ne trouvez pas la mise à jour KB4566782 dans la liste des mises à jour installées, vérifiez et installez toutes les mises à jour disponibles et si le problème persiste, essayez de <strong><a href=\"https://www.repairwin.com/how-to-uninstall-updates-in-windows-10/#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> désinstallez la ou les dernières mises à jour installées. </a></strong></p> <h3> Méthode 2. Redémarrez Windows 10 en mode sans échec. </h3> <p> 1. Appuyez sur le bouton Windows <img src=\"images/image_thumb8_thumb_thumb-268.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez <strong> msconfig </strong> et appuyez sur <strong> Entrer </strong> . </p> <p><img src=\"images/image_thumb-47-537.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. À <strong> Botte </strong> onglet sélectionnez le <strong> Démarrage securisé </strong> option, puis cliquez sur <strong> d&#39;accord </strong> et redémarrez votre ordinateur. </p> <p><img src=\"images/image_thumb-48-665.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 4. Après le redémarrage et en mode sans échec, vérifiez si vos problèmes persistent. <br> 5. Ensuite, exécutez à nouveau l&#39;outil &#39;msconfig&#39; et au <strong> Général </strong> onglet, vérifiez le <strong> Démarrage normal </strong> et cliquez <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-859.png\" alt=\"normal startup windows\" loading=\"lazy\"></p> <p> 6. <strong> Redémarrer </strong> ton ordinateur. <br> 7. Après le redémarrage, vérifiez si le problème persiste, sinon passez à la méthode suivante. </p> <p> </p> <h2> Méthode 3. Effectuez un démarrage en mode minimal. </h2> <p> 1. Exécutez l&#39;outil &#39;msconfig&#39;. <br> 2. Dans l&#39;onglet Services, <strong> Chèque </strong> les <strong> cacher tous les services Microsoft </strong> case à cocher, puis appuyez sur <strong> Désactiver tous les </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-333.png\" alt=\"clean boot windows\" loading=\"lazy\"></p> <p> </p> <p> 3. Sélectionnez ensuite le <strong> Commencez </strong> onglet et cliquez sur <strong> Ouvrez le Gestionnaire des tâches. <br> </strong> 4. <strong> </strong> Sélectionnez un par un tous les programmes répertoriés et cliquez sur <strong> Désactiver. </strong></p> <p><img src=\"images/image_thumb-1-399.png\" alt=\"clean boot windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Une fois terminé, fermez cette fenêtre, puis cliquez sur <strong> d&#39;accord </strong> dans l&#39;utilitaire « Configuration du système » pour <strong> Redémarrer </strong> ton ordinateur. <br> 6. Après le redémarrage, si votre ordinateur fonctionne correctement et sans problème*, ouvrez à nouveau l&#39;utilitaire &quot;Configuration système&quot; (msconfig) et activez un par un tous les programmes désactivés et redémarrez votre PC, jusqu&#39;à ce que vous sachiez quel programme problème. </p> <p> * Remarque : si le problème persiste, même en mode Clean Boot, passez à la méthode suivante. </p> <h3> Méthode 4. Réinstallez et réenregistrez toutes les applications intégrées de Windows 10. </h3> <p> La méthode suivante pour résoudre les problèmes avec la barre des tâches, le menu Démarrer, Cortana, etc. dans Windows 10, consiste à réinstaller et réenregistrer toutes les applications intégrées. </p> <p> 1. Ouvrez PowerShell en tant qu&#39;administrateur. Pour faire ça: </p> <blockquote><p> 1. À <strong> Cortana </strong> dans la zone de recherche de , tapez <strong> powershell <br> </strong> 2. Faites un clic droit sur <strong> Windows PowerShell </strong> résultat et sélectionnez <strong> Exécuter en tant qu&#39;administrateur. </strong></p></blockquote> <p><img src=\"images/image_thumb-51-691.png\" alt=\"FIX: Windows 10 Start Menu, Settings, Cortana or Taskbar icons Not Working.\" loading=\"lazy\"></p> <p> </p> <p> 3. Dans PowerShell, tapez (copiez et collez) la commande suivante et appuyez sur <strong> Entrer </strong> : </p> <ul> <li> Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register &quot;$($_.InstallLocation)\\AppXManifest.xml&quot;} </li> </ul> <p><img src=\"images/image_thumb-2-985.png\" alt=\"register re-install windows 10 apps\" loading=\"lazy\"></p> <p> 4. Attendez que la commande s&#39;exécute et ignorez les erreurs (en lettres rouges). <br> 5. <strong> Redémarrer </strong> votre ordinateur, puis vérifiez si votre problème est résolu. </p> <p> </p> <h3> Méthode 5. Créez un nouveau compte. </h3> <p> Une autre méthode pour résoudre plusieurs problèmes dans Windows 10 consiste à créer un nouveau compte et à transférer vos fichiers et données personnels vers le nouveau compte. Pour faire ça: </p> <p> 1. Ouvrir <strong> Invite de commandes en tant qu&#39;administrateur </strong> . <br> 2. À l&#39;invite de commande, tapez la commande suivante et appuyez sur <strong> Entrer </strong> : </p> <ul> <li><strong> mot de passe du compte utilisateur net / ajouter </strong></li> </ul> <p> * Remarque : À la commande ci-dessus, remplacez les champs « compte » et « mot de passe », par votre choix. </p> <p> par exemple. si vous souhaitez créer un nouveau compte avec le nom d&#39;utilisateur « Admin1 » et le mot de passe « Admin123 », tapez : <em> net user Admin1 Admin123 /add </em></p> <p><img src=\"images/image_thumb-3-388.png\" alt=\"add user windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Continuez ensuite et ajoutez le nouveau compte, au groupe Administrateurs, avec cette commande : </p> <ul> <li><strong> compte d&#39;administrateurs net localgroup /add </strong></li> </ul> <p> par exemple. Dans notre exemple, la commande est : <em> net localgroup administrateurs Admin1 /add </em></p> <p><img src=\"images/image_thumb-4-429.png\" alt=\"fix windows 10 start menu, cortana, settings\" loading=\"lazy\"></p> <p> </p> <p> 4. Fermez la fenêtre d&#39;invite de commande et <strong> redémarrer </strong> ton ordinateur. <br> 5. Après le redémarrage, connectez-vous avec un nouveau compte. <br> 6. Vérifiez si le problème persiste. Si le problème est résolu, transférez vos données et fichiers vers le nouveau compte et le tour est joué. </p> <p> </p> <h3> Méthode 6. Réparez Windows 10. </h3> <p> La dernière méthode pour résoudre les problèmes de Windows 10 consiste à <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> réparer Windows 10 avec la mise à niveau sur place </a> . </p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}