{"title":"Comment toujours ouvrir Chrome en mode navigation privée.","content":"<p> Si vous cherchez un moyen de faire en sorte que Chrome s&#39;ouvre toujours en mode navigation privée, continuez à lire ci-dessous. Lorsque vous lancez Chrome en mode navigation privée, l&#39;activité de votre navigateur reste privée des autres utilisateurs qui utilisent le même appareil. En mode navigation privée, Chrome n&#39;enregistrera pas votre historique de navigation, les cookies et les informations saisies dans les formulaires. </p> <p> La méthode manuelle, pour démarrer une nouvelle session Chrome en mode navigation privée, est d&#39;aller dans le menu de Chrome <img src=\"images/image_thumb10_thumb-963.png\" alt=\"image_thumb[10]\" loading=\"lazy\"> et pour sélectionner &quot;Nouvelle fenêtre de navigation privée&quot;, ou pour appuyer sur CTRL + MAJ + N. </p> <p><img src=\"images/image_thumb-42-832.png\" alt=\"Chrome New incognito window\" loading=\"lazy\"></p> <p> </p> <p> Dans cet article, vous trouverez des instructions sur la façon de toujours lancer Google Chrome en mode navigation privée. </p> <h4> Comment toujours démarrer Google Chrome en mode navigation privée. </h4> <p> Si vous souhaitez toujours démarrer Chrome en mode navigation privée, créez un nouveau raccourci Chrome et modifiez ses propriétés, comme suit : </p> <p> 1, <strong> Clic-droit </strong> au <strong> Google Chrome </strong> raccourci et sélectionnez <strong> Propriétés </strong> . <br> 2. À <strong> Général </strong> onglet, ajoutez le commutateur &quot;–incognito&quot; (sans les guillemets), à la fin de la ligne cible et cliquez sur <strong> d&#39;accord </strong> : </p> <p> par exemple. &quot;C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe&quot; – incognito </p> <p><img src=\"images/image_thumb-43-798.png\" alt=\"How to Always Open Chrome in Incognito mode.\" loading=\"lazy\"></p> <p> 3. Désormais, lorsque vous démarrez Chrome à partir du raccourci modifié, Chrome s&#39;ouvre en mode navigation privée. * </p> <p><strong> * ASTUCE: </strong> Si vous souhaitez ouvrir Chrome en mode navigation privée, lors de l&#39;ouverture d&#39;un lien hypertexte (URL) à partir de votre e-mail ou d&#39;un autre programme, vous devez modifier le registre. Pour faire ça: </p> <blockquote> <p> 1. Ouvrez le <strong> Éditeur de registre </strong> . <br> 2. Dans le registre, accédez à la clé suivante : </p> <ul> <li> <p> HKEY_CLASSES_ROOT\\ChromeHTML\\shell\\open\\commande </p> </li> </ul> <p> 3. Dans le volet droit, double-cliquez sur le <strong> Défaut </strong> Valeur de chaîne REG_SZ. </p> </blockquote> <p><img src=\"images/image_thumb-44-612.png\" alt=\"open url in chrome incognito\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. Ajoutez le commutateur ajouter le mot &quot;incognito&quot; (sans les guillemets), avant le &quot;%1&quot; et cliquez sur <strong> d&#39;accord </strong> . </p></blockquote> <blockquote><p> par exemple. Modifiez les données de valeur de : </p> <p> &quot;C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe&quot; — &quot;%1&quot; </p> <p> à: </p> <p> &quot;C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe&quot; –incognito &quot;%1&quot; </p></blockquote> <p><img src=\"images/image_thumb-45-148.png\" alt=\"open url chrome incognito - registry\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Désormais, en cliquant sur une URL (HTML), Chrome l&#39;ouvrira en mode navigation privée. </p></blockquote> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}