{"title":"CORRECTIF : Windows ne peut pas installer les fichiers requis – Code d&#39;erreur 0x80070570 (résolu)","content":"<p> Ce didacticiel contient des instructions pour corriger l&#39;erreur d&#39;installation de Windows 0x80070570 : « Windows ne peut pas installer les fichiers requis. Le fichier est peut-être corrompu ou manquant. Assurez-vous que tous les fichiers requis pour l&#39;installation sont disponibles et redémarrez l&#39;installation ». L&#39;erreur d&#39;installation Windows 0x80070570 apparaît généralement lors de l&#39;installation du système d&#39;exploitation Windows 10, 8 ou 7 à partir d&#39;un support d&#39;installation USB 3.0. </p> <p><img src=\"images/image_thumb-17-309.png\" alt=\"FIX: Windows Cannot Install Required Files 0x80070570\" loading=\"lazy\"></p> <p> </p> <h4> Comment réparer Windows ne peut pas installer les fichiers requis - Code d&#39;erreur 0x80070570 (Windows 10/8/7) </h4> <h6> Étape 1. Déconnectez tout appareil connecté. </h6> <p> La première étape pour résoudre l&#39;erreur 0x80070570 &quot;Windows ne peut pas installer les fichiers requis&quot; consiste à déconnecter tout autre périphérique (par exemple, les disques durs, le disque dur USB, la carte sans fil USB) dont il n&#39;est pas nécessaire pour installer Windows. </p> <p> </p> <h6> Étape 2. Désactivez le <strong> Dispositif de sécurité intégré </strong> . </h6> <p> L&#39;erreur d&#39;installation de Windows 10 « Windows ne peut pas installer les fichiers requis » apparaît généralement sur les ordinateurs HP où le « Périphérique de sécurité intégré » est activé par défaut. Pour contourner l&#39;erreur, procédez et désactivez le périphérique de sécurité dans les paramètres du BIOS. Pour faire ça: </p> <p> 1. <strong> Allumer </strong> le PC et <strong> presse </strong> les <strong> F10 </strong> pour entrer dans les paramètres du BIOS. <br> 2. À l&#39;aide de vos touches fléchées, naviguez jusqu&#39;à <strong> Sécurité </strong> -&gt; <strong> Sécurité de l&#39;appareil </strong> et appuyez sur <strong> Entrer. <br> </strong> 3. Réglez le <strong> Dispositif de sécurité intégré </strong> de « Appareil disponible » à <strong> Appareil masqué. </strong></p> <p><img src=\"images/image_thumb-23-480.png\" alt=\"FIX: HP SLOW RESTART\" loading=\"lazy\"></p> <p> </p> <p> 4. Appuyez sur le <strong> F10 </strong> touche pour appliquer le changement. <br> 5. <b> Enregistrer les modifications et quitter f </b> paramètres du bios de la rom. <br> 6. Installez Windows 10. </p> <h6> Étape 3. Utilisez un autre port USB ou un autre support d&#39;installation. </h6> <p> L&#39;erreur « Windows ne peut pas installer les fichiers requis » se produit généralement si vous configurez Windows 10 à partir d&#39;un support USB connecté à un port USB 3.0. Alors, essayez ce qui suit : </p> <ol> <li> Vérifiez si vous pouvez désactiver la prise en charge USB 3.0 à partir des paramètres du BIOS. </li> <li> Connectez la clé USB à un port USB 2.0 (ou à un autre port USB). </li> <li> Si votre PC n&#39;a pas de port USB 2.0, installez Windows 10 à partir d&#39;un lecteur flash USB 2.0 ou d&#39;un DVD. </li> <li> Si vous souhaitez installer Windows 10 sur un système basé sur UEFI, utilisez l&#39;utilitaire RUFUS et créez un support d&#39;installation USB pour « UEFI ». Si votre système ne prend pas en charge UEFI, créez un support d&#39;installation USB pour un système basé sur &quot;Legacy&quot;. (Les instructions détaillées pour le faire sont disponibles ici : <a href=\"https://www.repairwin.com/create-windows-usb-with-rufus-iso-to-usb/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment créer une clé de démarrage USB Windows avec l&#39;utilitaire Rufus. </a></li> <li> Ré- <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> télécharger le fichier ISO Windows </a> et créez un nouveau support d&#39;installation USB Windows à l&#39;aide de RUFUS. </li> </ol> <p> </p> <h6> Étape 4. Installez Windows 10 à partir d&#39;un périphérique USB hérité. </h6> <p> Si vous recevez l&#39;erreur « Windows ne peut pas installer les fichiers requis », lorsque vous configurez Windows 10 à partir d&#39;un support USB créé pour le système UEFI, créez un nouveau support USB pour un système hérité et démarrez à partir du périphérique USB hérité pour installer Windows 10. </p> <p> </p> <h6> Étape 5. Diagnostiquer les problèmes de mémoire. </h6> <p> La troisième étape pour résoudre l&#39;erreur de configuration Windows 0x80070570 consiste à diagnostiquer les problèmes de votre RAM. Pour accomplir cette tâche, suivez les instructions de l&#39;article suivant : </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment diagnostiquer les problèmes de mémoire de l&#39;ordinateur avec Memtest86+ </a></li> </ul> <p> </p> <h6> Étape 6. Vérifiez si le disque dur présente des problèmes. </h6> <p> L&#39;erreur d&#39;installation Windows 0x80070570 peut se produire si le disque dur est endommagé. Alors continuez et diagnostiquez les erreurs du disque dur et remplacez le disque dur si nécessaire, en suivant les instructions de ce guide : </p> <ul> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Meilleurs outils de test et de diagnostic de disque dur pour vérifier la santé du disque dur </a></li> </ul> <h5></h5> <h6> Étape 7. Vérifiez les connexions des câbles et le matériel. </h6> <p> Si après avoir effectué les étapes ci-dessus, l&#39;erreur d&#39;installation Windows 0x80070570 apparaît toujours, alors : </p> <p> 1. Vérifiez toutes les connexions des câbles et assurez-vous que le disque dur est correctement connecté. De plus, si vous possédez un ordinateur de bureau, remplacez le câble de données du disque dur. <br> 2. Essayez d&#39;installer Windows en utilisant une autre carte vidéo (VGA) si vous le pouvez. <br> 3. Mettez à jour votre BIOS. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître ce problème. </p>"}