{"title":"CORRECTIF : Erreur DISM 1009 La base de données du Registre de configuration est corrompue (Résolu).","content":"<p> Ce didacticiel contient des instructions pour résoudre le problème suivant lors de l&#39;exécution de la commande DISM sous Windows 10 : « Erreur 1009 : La base de données du registre de configuration est corrompue ». L&#39;erreur DISM 1009 peut apparaître lorsque vous essayez de réparer une image Windows avec un registre endommagé (corrompu), en utilisant l&#39;une des commandes DISM suivantes dans l&#39;invite de commande : </p> <ul> <li> Dism /En ligne /Cleanup-Image /Restorehealth </li> <li> Dism /Online /Cleanup-image /Restorehealth /source:wim:X:\\sources\\install.wim:1 /LimitAccess </li> </ul> <p> …ou lors de l&#39;utilisation de la commande DISM dans l&#39;environnement de récupération Windows (WinRE) </p> <ul> <li> Dism.exe /Image:X:\\ /Cleanup-Image /Restorehealth </li> </ul> <p> </p> <h4> Comment corriger l&#39;erreur DISM 1009 : la base de données du registre est corrompue. </h4> <p><strong> Conditions </strong> : Afin de résoudre l&#39;erreur dism 1009, vous devrez démarrer votre ordinateur à partir d&#39;un support d&#39;installation Windows (USB ou DVD). Si vous ne possédez pas de support d&#39;installation Windows, vous pouvez en créer un en utilisant <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> L&#39;outil de création de médias de Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment créer un support d&#39;installation USB Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment créer un support d&#39;installation DVD Windows 10. </a></li> </ul> <p> </p> <h6> Méthode 1. Restaurez Windows 10 tel qu&#39;il était avant d&#39;installer les mises à jour. </h6> <p> L&#39;erreur DISM 1009 apparaît généralement après une installation infructueuse d&#39;une mise à jour Windows. Donc, tout d&#39;abord, annulez l&#39;installation des mises à jour. Pour faire ça: </p> <p> 1. Démarrez votre système à partir d&#39;un support d&#39;installation Windows. <br> 2. Sur l&#39;écran ci-dessous, appuyez sur le bouton <strong> CHANGEMENT </strong> + <strong> F10 </strong> touches pour lancer l&#39;invite de commande. (ou cliquez sur <strong> Suivant </strong> et allez à <strong> Réparer mon ordinateur </strong> &gt; <strong> Dépannage </strong> &gt; <strong> Invite de commandes </strong> ). </p> <p><img src=\"images/image_thumb-72-743.png\" alt=\"FIX DISM Error 1009 -The configuration registry database is corrupt\" loading=\"lazy\"></p> <p> </p> <p> 3. À l&#39;invite de commande, obtenez une liste de tous les lecteurs de votre système avec cette commande : </p> <ul> <li><strong> wmic logicaldisk obtenir le nom </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-491.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> 4. Découvrez ensuite quel lecteur contient le dossier &quot;Windows&quot;, en tapant cette commande : * </p> <ul> <li><strong> dir DriveLettre : </strong></li> </ul> <p> * par exemple. Pour voir le contenu du lecteur C:, tapez : &quot; <strong> dir C : </strong> &quot; (sans les guillemets). Si vous ne pouvez pas voir le dossier &quot;Windows&quot; sur le lecteur C:, passez à la lettre de lecteur suivante (par exemple &quot;dir D:&quot;, &quot;dir E:&quot;, etc.), jusqu&#39;à ce que vous voyiez le Dossier &quot;Windows&quot; sur l&#39;un des lecteurs répertoriés (à partir de la commande ci-dessus). </p> <p> [Comme vous pouvez le voir sur la capture d&#39;écran ci-dessous, le dossier Windows (dans ce cas) est situé sur le lecteur D:.] </p> <p> </p> <p><img src=\"images/image_thumb-69-704.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Une fois que vous avez trouvé sur quel lecteur se trouve le lecteur « Windows » (par exemple, sur le lecteur « D : » dans cet exemple), accédez à ce lecteur en tapant DriveLetter <strong> : </strong> + <strong> Entrer </strong> . </p> <p> 6. Créez ensuite un dossier de travail sur le lecteur en tapant cette commande : </p> <ul> <li><strong> mkdir D:\\Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-186.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Ensuite, donnez la commande ci-dessous pour restaurer votre système, après l&#39;échec de la mise à jour : </p> <ul> <li><strong> DISM /Image:D:\\ /ScratchDir:D:\\Scratch /Cleanup-Image /RevertPendingActions </strong></li> </ul> <p> * Remarque : modifiez la lettre du lecteur <strong> ré </strong> selon votre cas. </p> <p> 8. Une fois la commande DISM ci-dessus exécutée, vous devriez recevoir le message suivant à l&#39;écran : </p> <p><em> &quot;Annuler les actions en attente à partir de l&#39;image…. <br> L&#39;opération terminée. Toute annulation des actions en attente sera tentée après le redémarrage <br> L&#39;opération s&#39;est bien déroulée.&quot; </em></p> <p><img src=\"images/image_thumb-71-222.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. <strong> Fermer </strong> invite de commande et <strong> redémarrer </strong> ton ordinateur. * </p> <p> 10. Si Windows démarre normalement, continuez votre travail. Si Windows ne démarre pas et essaie à nouveau d&#39;installer les mises à jour, alors : </p> <blockquote><p> 1. Éteignez votre PC. <br> 2. Redémarrez votre ordinateur à partir du support d&#39;installation de Windows. <br> 3. Lancez l&#39;invite de commande. <br> 4. À l&#39;invite de commande, donnez les commandes suivantes dans l&#39;ordre (n&#39;oubliez pas de changer la lettre de lecteur <strong> ré </strong> selon votre cas) : </p></blockquote> <ul> <li> <ul> <li> del D:\\Windows\\SoftwareDistribution </li> <li> del D:\\Windows\\WinSxS\\cleanup.xml </li> <li> del D:\\Windows\\WinSxS\\pending.xml </li> </ul> </li> </ul> <blockquote><p> 5. Une fois terminé, fermez l&#39;invite de commande et <strong> redémarrer </strong> votre ordinateur. * </p></blockquote> <p> * Remarque : Si le démarrage échoue à nouveau, redémarrez à l&#39;invite de commande WinRE et donnez les commandes suivantes (n&#39;oubliez pas de changer la lettre de lecteur <strong> ré </strong> selon votre cas) : </p> <ul> <li> chkdsk /f D : </li> <li> sfc /scannow /offbootdir=D:\\ /offwindir=D:\\windows </li> <li> dism /image:D:\\ /cleanup-image /restorehealth <ul></ul> </li> </ul> <p> </p> <h6> Méthode 2. Restaurez le registre Windows à partir de la sauvegarde. </h6> <p> La méthode suivante pour corriger l&#39;erreur dism 1009 consiste à restaurer le registre Windows à partir du dossier &quot;RegBack&quot;. * </p> <p> * Info : Le dossier &#39;RegBack&#39;, (chemin complet=Windows\\System32\\Config\\RegBack), est l&#39;emplacement où Windows stocke automatiquement une sauvegarde des fichiers de registre à chaque démarrage de la machine. </p> <p> Pour restaurer le registre à partir du dossier RegBack : </p> <p> 1. Démarrez votre système à partir d&#39;un support d&#39;installation Windows, puis suivez les étapes 1 à 5 de la méthode 1 ci-dessus pour accéder au lecteur Windows. (par exemple, le « D : » dans cet exemple). </p> <p> 2. Tout d&#39;abord, effectuez une sauvegarde des fichiers de registre actuels en exécutant les commandes suivantes dans l&#39;ordre. (Presse <strong> Entrer </strong> après avoir tapé chaque commande): </p> <ul> <li><strong> cd \\windows\\system32\\config </strong></li> <li><strong> Sauvegarde md </strong></li> <li><strong> copier *.* Sauvegarder </strong></li> </ul> <p><img src=\"images/image_thumb-26-678.png\" alt=\"infinite Automatic Repair loop windows 10 fix\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Naviguez maintenant vers <strong> RegBack </strong> dossier en donnant cette commande : </p> <ul> <li><strong> cd RegBack </strong></li> </ul> <p> 4. Tapez ensuite <strong> DIR </strong> (pour afficher le contenu du dossier RegBack). </p> <p> 5. Maintenant, voyez si l&#39;un des fichiers répertoriés a <strong> 0</strong> (zéro) octets dans leur taille de fichier et procédez ci-dessous selon votre cas : </p> <ul> <li><strong> Cas A. </strong> Si l&#39;un des fichiers répertoriés a 0 (zéro) octet dans sa taille, alors <strong> Arrêtez ici </strong> , et <strong> passer à la méthode suivante </strong> , car les fichiers de sauvegarde du registre sont inutiles ou corrompus. </li> <li><strong> Cas B. </strong> Si tous les fichiers répertoriés ont une taille différente de zéro (comme dans la capture d&#39;écran ci-dessous), passez à l&#39;étape suivante. </li> </ul> <p><img src=\"images/image_thumb-27-525.png\" alt=\"restore registry from backup\" loading=\"lazy\"></p> <p> </p> <p> 6. Copiez les fichiers de registre du <strong> Windows\\System32\\Config\\RegBack </strong> dossier vers <strong> Windows\\System32\\Config\\ </strong> dossier, en donnant cette commande : </p> <p> </p> <ul> <li><strong> copie *.* .. </strong></li> </ul> <p> 7. Lorsque vous y êtes invité, appuyez sur <strong> UNE </strong> pour écraser les fichiers dans la destination après avoir donné la commande de copie. </p> <p><img src=\"images/image_thumb-28-138.png\" alt=\"fix startup repair loop\" loading=\"lazy\"></p> <p> </p> <p> 8. Lorsque la copie est terminée, tapez <strong> sortir </strong> et appuyez sur <strong> Entrer </strong> pour fermer l&#39;invite de commande. <br> 9. <strong> Redémarrer </strong> votre ordinateur et essayez de démarrer sous Windows. </p> <p> * Remarque : Si Windows ne parvient pas à redémarrer, redémarrez l&#39;invite de commande WinRE et donnez les commandes suivantes (n&#39;oubliez pas de changer la lettre de lecteur <strong> ré </strong> selon votre cas) : </p> <ul> <li> chkdsk /f D : </li> <li> sfc /scannow /offbootdir=D:\\ /offwindir=D:\\windows </li> <li> dism /image:D:\\ /cleanup-image /restorehealth </li> </ul> <p> </p> <h6> Méthode 3. Restaurez Windows 10 à un état de fonctionnement précédent. </h6> <p> La méthode suivante pour résoudre l&#39;erreur dism &quot;1009 - La base de données du registre de configuration est corrompue&quot; consiste à restaurer votre système à un état de fonctionnement précédent. Pour faire ça: </p> <p> 1. Démarrez votre système à partir du support d&#39;installation de Windows. <br> 2. Sur l&#39;écran ci-dessous, cliquez sur <strong> Suivant </strong> puis cliquez <strong> Répare ton ordinateur </strong> &gt; <strong> Dépanner. </strong></p> <p><img src=\"images/image_thumb-73-301.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. À <strong> Options avancées </strong> Cliquez sur <strong> Restauration du système. * </strong></p> <p> * Remarque : si le <strong> Revenir à une version précédente </strong> option, est disponible sur cet écran, puis choisissez cette option. </p> <p><img src=\"images/image_thumb-76-326.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Sur l&#39;écran suivant, cliquez sur votre système d&#39;exploitation. </p> <p><img src=\"images/image_thumb-77-265.png\" alt=\"image\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 5. Ensuite, dans l&#39;assistant de restauration du système, cliquez sur <strong> Suivant </strong> puis choisissez un état de fonctionnement antérieur (Date/Heure) et cliquez sur <strong> Suivant </strong> pour démarrer le processus de restauration. </p> <p><img src=\"images/image_thumb-50-788.png\" alt=\"system restore windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Méthode 4. Réparez Windows 10. </h6> <p> La dernière méthode pour résoudre les erreurs de dism consiste à <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> réparer Windows 10 avec la mise à niveau sur place </a> ou de sauvegarder vos fichiers puis de <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> installer proprement Windows 10 </a> . </p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}