{"title":"Comment désinstaller la version Edge Chromium dans Windows 10.","content":"<p> De nombreux utilisateurs ont signalé qu&#39;après l&#39;installation de la nouvelle version basée sur Chromium du navigateur Microsoft Edge dans Windows 10, le système est devenu trop lent ou se bloque à des moments aléatoires. Si vous rencontrez le même problème, continuez à lire ci-dessous pour désinstaller la version Edge Chromium de votre PC. * </p> <p> * Remarque : si la version Chromium de Microsoft Edge n&#39;est pas encore installée sur votre système, lisez les instructions à ce sujet <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> article </a> pour empêcher l&#39;installation automatique de Microsoft Edge. </p> <p><img src=\"images/image_thumb-38-388.png\" alt=\"Remove Edge Chromium in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> La nouvelle version basée sur Chromium du navigateur Microsoft Edge, est installée automatiquement avec le <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> mettre à jour. Lorsque cela se produit, vous ne pouvez pas supprimer le Microsoft Edge du <strong> Démarrer </strong> menu <img src=\"images/image_thumb2_thumb_thumb-565.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Paramètres </strong><img src=\"images/image_thumb-66-219.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> applications </strong> -&gt; <strong> Applications et fonctionnalités </strong> options, car le <strong> Désinstaller </strong> l&#39;option est grisée. Pour contourner cette restriction, appliquez les étapes ci-dessous. </p> <p><img src=\"images/image_thumb-39-654.png\" alt=\"How to Uninstall Edge Chromium version in Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Comment supprimer Edge Chromium de Windows 10. </h4> <p> Pour désinstaller le nouveau Edge basé sur Chromium dans Windows 10 : </p> <p> 1. Accédez au dossier suivant sur votre PC : * </p> <ul> <li> C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\85.0.564.41\\Installer </li> </ul> <p> * Remarque : Le nom du dossier &quot;85.0.564.41&quot; indique la version installée de la nouvelle version de Chromium et peut différer sur votre PC. </p> <p> 2. Sélectionnez le chemin du dossier dans la barre d&#39;adresse et cliquez avec le bouton droit de la souris &gt; <strong> Copie. </strong></p> <p><img src=\"images/image_thumb35_thumb-738.png\" alt=\"image_thumb[35]\" loading=\"lazy\"></p> <p> </p> <p> 3. Ouvrir <strong> Invite de commandes en tant qu&#39;administrateur, </strong> taper <strong> CD </strong> puis appuyez sur <strong> CTRL+V </strong> à coller dans le chemin du dossier copié. Une fois terminé, appuyez sur <strong> Entrer </strong> . * </p> <p> * ex. : Dans l&#39;exemple actuel, la commande sera : </p> <p><em> cd C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\85.0.564.41\\Installer </em></p> <p><img src=\"images/image_thumb39_thumb-252.png\" alt=\"Uninstall Edge Chromium\" loading=\"lazy\"></p> <p> </p> <p> 4. Maintenant, donnez la commande ci-dessous (Copier/Coller) dans l&#39;invite de commande pour supprimer la version Chromium du navigateur Microsoft Edge de votre PC. </p> <ul> <li> setup.exe –uninstall –niveau système –verbose-logging –force-uninstall </li> </ul> <p><img src=\"images/image_thumb47_thumb-506.png\" alt=\"Uninstall Edge Chromium command\" loading=\"lazy\"></p> <p> 5. Une fois la commande ci-dessus exécutée, l&#39;ancienne version d&#39;EDGE sera à nouveau activée. Redémarrez votre PC pour appliquer les modifications. <br> 6. Après le redémarrage, procédez à l&#39;installation manuelle du <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> nouveau navigateur Edge basé sur Chromium </a> sur votre PC, afin d&#39;éviter la livraison automatique, ou empêcher l&#39;installation future d&#39;Edge Chromium, en suivant les instructions de cet article : <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment empêcher Edge Chromium d&#39;être installé automatiquement dans Windows 10. </a></p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}