{"title":"CORRECTIF : le dossier Outlook DRAFTS est manquant dans le volet de navigation dans Outlook 2013, 2010 ou 2007. (Résolu)","content":"<p> Le problème suivant s&#39;est produit chez l&#39;un de mes clients : Soudainement et sans raison évidente, le dossier Brouillons est manquant dans le volet de navigation d&#39;Outlook 2013. La première action pour restaurer le dossier Brouillons manquant consiste à rechercher dans tous les autres dossiers Outlook assurez-vous que le dossier n&#39;a pas été déplacé ou supprimé par erreur. Si vous ne trouvez toujours pas le dossier manquant, continuez ci-dessous pour résoudre le problème. </p> <p><img src=\"images/image_thumb-37-460.png\" alt=\"Drafts folder Missing Outlook\" loading=\"lazy\"></p> <p> </p> <p> Ce didacticiel contient des instructions sur la façon de restaurer un dossier manquant dans Outlook 2007, 2010, 2013, 2016 ou 365. </p> <h4> Comment restaurer un dossier manquant à partir du volet de navigation Outlook. </h4> <h6> Méthode 1. Analysez votre système à la recherche de virus et de logiciels malveillants. </h6> <p> La première étape pour résoudre le problème des &quot;dossiers manquants&quot; dans Outlook consiste à vous assurer que votre système est exempt de virus/programmes malveillants. Pour cette tâche, suivez les instructions de ce guide : <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment analyser votre ordinateur contre les virus et autres programmes malveillants. </a></p> <p> </p> <h6> Méthode 2. RÉINITIALISER les dossiers Outlook. </h6> <p> Après l&#39;analyse antivirus, continuez et réinitialisez les dossiers Outlook par défaut en utilisant le processus ci-dessous : </p> <p> 1. Fermez l&#39;application Outlook. <br> 2. Appuyez sur le <strong> les fenêtres </strong> <img src=\"images/image_thumb8_thumb_thumb-622.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 3. Dans la zone de recherche, saisissez : <strong> perspectives/réinitialiser les dossiers </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-36-732.png\" alt=\"outlook reset folders\" loading=\"lazy\"></p> <p> </p> <p> 4. Outlook s&#39;ouvrira et tous les dossiers manquants seront récupérés. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? </p> <p> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog dans les réseaux sociaux pour aider à faire passer le mot à ce sujet. </p>"}