{"title":"CORRECTIF : Réinitialiser la période de grâce de 120 jours sur le serveur RDS 2016/2012.","content":"<p> Si vous avez installé un serveur RDS 2016 à des fins de test et que la période de grâce de licence RDS a expiré, continuez à lire ci-dessous pour savoir comment réinitialiser la période de grâce de 120 jours. Comme vous le savez peut-être, lorsque vous installez le serveur RDS 2016, vous disposez de 120 jours pour installer les licences d&#39;accès client RD (CAL RD), sinon les utilisateurs ne pourront plus établir de sessions RDP sur le serveur hôte de session RD, avec l&#39;erreur « Le session de bureau a été déconnectée car aucun serveur de licence Bureau à distance n&#39;est disponible pour fournir une licence&quot;. </p> <p><img src=\"images/image_thumb-32-368.png\" alt=\"Reset 120 Days Grace Period on RDS Server 2012/2016\" loading=\"lazy\"></p> <p> </p> <h4> Comment réinitialiser la période de grâce de licence RDS sur le serveur 2012 ou 2016. * </h4> <p><strong> * Important: </strong> Appliquez les instructions ci-dessous uniquement si vous utilisez le serveur RDS 2016 dans un environnement de test. Si vous souhaitez utiliser le serveur RDS dans un environnement de production, continuez et achetez des CAL RD. </p> <p> Pour prolonger la période de grâce de 120 jours sur le serveur de licences RDS : </p> <p> 1. Ouvrez l&#39;Éditeur du Registre et naviguez sur la clé suivante : </p> <ul> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\\RCM\\GracePeriod </li> </ul> <p> 2. Faites un clic droit sur la touche &#39;GracePeriod&#39; et sélectionnez <strong> Autorisations. </strong></p> <p><img src=\"images/image_thumb-33-473.png\" alt=\"Reset Grace Period RDS 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Cliquez ensuite sur <strong> Avancée </strong> . </p> <p><img src=\"images/image_thumb-34-585.png\" alt=\"Reset RDS Grace Period\" loading=\"lazy\"></p> <p> </p> <p> 4. Sélectionnez le <strong> Administrateurs </strong> objet et cliquez <strong> Éditer </strong> . </p> <p><img src=\"images/image_thumb-18-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Modifiez les autorisations en <strong> Controle total </strong> et cliquez <strong> D&#39;ACCORD. </strong></p> <p><img src=\"images/image_thumb-19-737.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Faites un clic droit sur la valeur &quot;L$RTMTIMEBOMB…&quot; et sélectionnez <strong> Effacer </strong> . </p> <p><img src=\"images/image_thumb-35-208.png\" alt=\"Reset RDS Licensing Grace Pariod\" loading=\"lazy\"></p> <p> </p> <p> 7. Fermez l&#39;Éditeur du Registre et redémarrez le serveur RDS. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}