{"title":"CORRECTIF : l&#39;option Désactiver le pavé tactile est manquante dans les paramètres du pavé tactile sous Windows 10.","content":"<p> Si vous utilisez un ordinateur portable avec Windows 10 et que l&#39;option Désactiver le pavé tactile est manquante dans les paramètres du pavé tactile, continuez ci-dessous pour résoudre le problème. </p> <p> Comme vous le savez peut-être, lorsque vous travaillez avec une souris externe USB sur votre ordinateur portable Windows 10, il n&#39;est pas nécessaire de laisser votre pavé tactile activé pour faciliter la saisie. Pour cette raison, dans la plupart des ordinateurs portables, vous pouvez facilement éteindre (désactiver) le pavé tactile lorsqu&#39;il n&#39;est pas nécessaire, en utilisant l&#39;une des méthodes suivantes : </p> <ol> <li> En appuyant sur une touche de fonction (par exemple F3, F4, etc.), avec ou sans appuyer sur la <strong> Fn </strong> clé en même temps. </li> <li> En appuyant deux fois dans le coin supérieur gauche de la surface du pavé tactile. (Si votre pavé tactile prend en charge cette option). </li> <li> En appuyant sur la touche marche/arrêt du pavé tactile. (si votre ordinateur portable a une telle clé). </li> <li> En désactivant le pavé tactile ou en désactivant le pavé tactile lorsque la souris est connectée, dans les paramètres du pavé tactile de Windows 10 : </li> </ol> <ul> <li><strong> Démarrer </strong><img src=\"images/image_thumb2_thumb_thumb-929.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menu -&gt; <strong> Paramètres </strong> <img src=\"images/image_thumb-66-954.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Dispositifs </strong> -&gt; <strong> Pavé tactile. </strong></li> </ul> <p><img src=\"images/image_thumb-52-210.png\" alt=\"Turn Off Touchpad Windows 10\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> Cependant, sur certains ordinateurs portables Windows 10, il n&#39;y a pas d&#39;option pour désactiver ou désactiver le pavé tactile, et de nombreux utilisateurs recherchent une solution à ce problème. </p> <p><img src=\"images/image_thumb-42-622.png\" alt=\"Disable Touchpad option missing Windows 10\" loading=\"lazy\"></p> <p> Dans ce didacticiel, vous trouverez des instructions étape par étape sur la façon de désactiver le pavé tactile dans Windows 10, si le commutateur du pavé tactile &quot;Activer/désactiver&quot; et les options &quot;Laisser le pavé tactile allumé lorsqu&#39;une souris est connectée&quot; sont manquantes. </p> <h2> Comment CORRIGER : aucune option pour désactiver le pavé tactile sous Windows 10. </h2> <h3> Méthode 1. Désactivez le pavé tactile à partir des paramètres de la souris dans le Panneau de configuration sous Windows 10. </h3> <p> 1. Dans les paramètres du pavé tactile, faites défiler un peu vers le bas et cliquez sur <strong> Paramètres additionnels </strong> dans la section « Paramètres associés ». </p> <p> * Sinon, accédez à <strong> Panneau de commande </strong> et ouvrez le <strong> Souris </strong> Propriétés. </p> <p><img src=\"images/image_thumb-53-308.png\" alt=\"Touchpad additional settings\" loading=\"lazy\"></p> <p> </p> <p> 2. Dans l&#39;onglet Paramètres Touchpad/ClickPad : </p> <p> une. Cliquez sur <strong> Désactiver ClickPad </strong> pour désactiver complètement le pavé tactile,* ou… </p> <p> * Remarque : n&#39;appliquez ce paramètre que si vous utilisez toujours une souris USB externe. </p> <p> b. <strong> Vérifier </strong> la case à cocher <strong> Désactiver le périphérique de pointage interne lorsqu&#39;un périphérique de pointage USB externe est connecté, </strong> pour désactiver le pavé tactile lorsque vous connectez votre souris. </p> <p><img src=\"images/image_thumb-37-193.png\" alt=\"Disable Touchpad from Mouse settings Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h3> Méthode 2. Activez toutes les fonctionnalités du pavé tactile dans Windows 10 en installant les pilotes Precision Touchpad de Microsoft. </h3> <p> Si vous souhaitez profiter de toutes les fonctionnalités disponibles du pavé tactile Windows 10, vous pouvez installer les pilotes Precision Touchpad de Microsoft. * </p> <p><strong> * Remarques (Importantes) : </strong> <strong> Avant de passer aux étapes ci-dessous, il est conseillé de : </strong><br> 1. <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Créer un point de restauration </a> , afin de restaurer Windows 10 en cas de problème. <br> 2. Avoir une souris USB externe au cas où le pavé tactile ne fonctionnerait pas après l&#39;installation des pilotes du pavé tactile de précision. </p> <p><strong> Comment installer les pilotes Precision Touchpad de Microsoft dans Windows 10. </strong></p> <p><strong> Étape 1. Téléchargez les pilotes Precision Touchpad. </strong></p> <p> 1. Téléchargez les pilotes Precision Touchpad sur votre PC, à partir de l&#39;un des emplacements suivants : </p> <ul> <li> Depuis le site d&#39;assistance du fabricant de l&#39;ordinateur portable. </li> <li> Si vous possédez un appareil Synaptics TouchPad, téléchargez le <a href=\"https://www.anrdoezrs.net/links/3607085/type/am/sid/325347/https://download.lenovo.com/pccbbs/mobiles/n1mgx14w.zip\" target=\"_blank\" rel=\"nofollow noopener\"> Pilote Synaptics de Lenovo </a> . </li> <li> Si vous possédez un appareil ELAN TouchPad, téléchargez le <a href=\"https://drivers.softpedia.com/get/Other-DRIVERS-TOOLS/Others/ELAN-Input-Device-for-WDF-Driver-161132-for-Windows-10-64-bit.shtml\" target=\"_blank\" rel=\"nofollow noopener\"> Pilote ELAN de Softpedia </a> . </li> </ul> <p> 2. Une fois le téléchargement terminé, extrayez le fichier .zip téléchargé. </p> <p> </p> <p> Étape 2 Installez les pilotes Precision Touchpad dans Windows 10. </p> <p> 1. Ouvrir <strong> Gestionnaire de périphériques </strong> . Pour faire ça: </p> <blockquote><p> 1. Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-117.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Dans la case &quot;Ouvrir&quot;, saisissez : <strong> devmgmt.msc </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-5-851.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Développez Souris et autres périphériques de pointage. <br> 3. <strong> Clic-droit </strong> sur le <strong> Pavé tactile </strong> appareil et choisissez <strong> Mettre à jour le pilote. </strong></p> <p><img src=\"images/image_thumb-43-313.png\" alt=\"Update Touchpad driver\" loading=\"lazy\"></p> <p> </p> <p> 4. Cliquez sur <strong> Parcourir mon ordinateur pour les pilotes. </strong></p> <p><img src=\"images/image_thumb-44-267.png\" alt=\"How to install Precision Touchpad Drivers in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 5. À l&#39;écran suivant, cliquez sur <strong> Permettez-moi de choisir parmi une liste de pilotes disponibles sur mon ordinateur. </strong></p> <p><img src=\"images/image_thumb-45-900.png\" alt=\"How to install Microsoft's Precision Touchpad Drivers in Windows 10.\" loading=\"lazy\"></p> <p> 6. Cliquez sur <strong> Avoir un disque. </strong></p> <p><img src=\"images/image_thumb-46-401.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 7. Accédez au dossier dans lequel vous avez extrait le fichier zip téléchargé à l&#39;étape 1. <br> 8. Sélectionnez le <strong> Autoru </strong> n fichier et cliquez sur <strong> Ouvert </strong> puis cliquez <strong> D&#39;ACCORD. </strong></p> <p><img src=\"images/image_thumb-47-271.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. Sélectionnez le <strong> Dispositif de pointage Synaptics </strong> (ou le &#39;ELAN Pointing Device&#39;), dans la liste des modèles, et cliquez sur <strong> Suivant. </strong></p> <p><img src=\"images/image_thumb-48-797.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. Au message d&#39;avertissement Mettre à jour le pilote, cliquez sur <strong> Oui. </strong></p> <p><img src=\"images/image_thumb-49-287.png\" alt=\"image\" loading=\"lazy\"></p> <p> 11. Laissez Windows installer les nouveaux pilotes, puis cliquez sur <strong> Fermer </strong> . </p> <p><img src=\"images/image_thumb-50-445.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. <strong> Redémarrer </strong> votre ordinateur. </p> <p> 13. Après avoir démarré sous Windows 10, accédez à <strong> Démarrer </strong><img src=\"images/image_thumb2_thumb_thumb-914.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menu -&gt; <strong> Paramètres </strong> <img src=\"images/image_thumb-66-325.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Dispositifs </strong> -&gt; <strong> Pavé tactile. </strong></p> <p> 14. Si tout s&#39;est bien passé, vous devriez voir tous les paramètres disponibles du pavé tactile dans Windows 10. </p> <p><img src=\"images/image_thumb-51-998.png\" alt=\"Turn Touchpad ON-OFf in Windows 10\" loading=\"lazy\"></p> <p> C&#39;est tout les gens ! Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}