{"title":"CORRECTIF : l&#39;option Installer VMware Tools est grisée. (Résolu)","content":"<p> Si vous ne pouvez pas installer VMware Tools sur l&#39;invité en cours d&#39;exécution parce que l&#39;option &quot;Installer VMware Tools&quot; est grisée, continuez à lire ci-dessous. VMware Tools est un ensemble gratuit de services et de modules qui activent plusieurs fonctionnalités dans la machine virtuelle invitée, telles que des performances graphiques plus rapides, des performances de souris améliorées et le plus important : la possibilité de copier-coller entre l&#39;hôte et la machine invitée. Ainsi, bien que le système d&#39;exploitation invité puisse s&#39;exécuter sans les outils VMware, les outils VMware doivent être installés si vous souhaitez activer les fonctionnalités VMware supplémentaires. </p> <p> La manière habituelle d&#39;installer VMware Tools consiste à démarrer la machine invitée, puis à partir du menu &quot;Player&quot;, choisissez <strong> Faire en sorte </strong> &gt; <strong> Installer les outils VMware </strong> . Mais, si vous avez connecté le lecteur de CD/DVD virtuel de la machine virtuelle à un fichier image ISO lorsque vous avez installé le système d&#39;exploitation, l&#39;option &quot;Installer VMware Tools&quot; est grisée. </p> <p><img src=\"images/image_thumb-45-164.png\" alt=\"FIX VMware Tools option is Grayed Out\" loading=\"lazy\"></p> <p> </p> <p> Ce didacticiel contient des instructions pour résoudre le problème suivant dans VMware Workstation Player. L&#39;option &quot;Installer VMware Tools&quot; est grisée sur la machine invitée. </p> <h4> Comment installer VMware Tools si l&#39;option « Installer VMware Tools » est grisée. </h4> <p> </p> <p> 1. Arrêtez la machine virtuelle. <br> 2. Faites un clic droit sur la machine virtuelle et sélectionnez <strong> Paramètres </strong> . </p> <p><img src=\"images/image_thumb-39-377.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Sélectionnez le <strong> CD/DVD </strong> conduire, puis cliquez sur <strong> Supprimer </strong> . </p> <p><img src=\"images/image_thumb-43-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Sélectionnez ensuite le <strong> Souple </strong> conduire, cliquez sur <strong> Supprimer </strong> puis cliquez <strong> d&#39;accord </strong> pour fermer les options de configuration. </p> <p><img src=\"images/image_thumb-44-469.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Démarrer </strong> la Machine Virtuelle. <br> 6. Dans le menu « Lecteur », sélectionnez <strong> Faire en sorte </strong> et cliquez <strong> Installez les outils VMware. </strong></p> <p><img src=\"images/image_thumb-42-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}