{"title":"CORRECTIF : décharge de la batterie dans Windows 10 (résolu)","content":"<p> Avec Windows 10, de nombreux utilisateurs se plaignent que la batterie de leur ordinateur portable se décharge rapidement, même en cas d&#39;utilisation faible ou même en cas d&#39;arrêt complet. Ce problème de &quot;vidange de la batterie&quot; dans Windows 10 se produit, pour deux raisons fondamentales. La première raison est que Windows 10 charge trop d&#39;applications en arrière-plan qui consomment de la batterie même si elles ne sont pas utilisées. </p> <p> La raison suivante qui provoque l&#39;épuisement de la batterie, même en cas d&#39;arrêt complet, est la fonction &quot;Démarrage rapide&quot;. Windows 10 (et Windows 8/8.1) a activé par défaut la fonction &quot;Démarrage rapide&quot;, qui permet au système de démarrer et de démarrer plus rapidement. En fait, lorsque le &quot;Démarrage rapide&quot; est activé, Windows 10 n&#39;effectue pas un arrêt complet du système et sort d&#39;un état d&#39;hibernation. </p> <p> Dans ce tutoriel, vous trouverez des instructions pour empêcher Windows 10 de vider la batterie. </p> <h4> Comment RÉSOUDRE le problème d&#39;épuisement de la batterie dans Windows 10. </h4> <p> </p> <h6> Étape 1. Empêchez les applications de s&#39;exécuter en arrière-plan. </h6> <p> La première étape, pour résoudre le problème d&#39;épuisement de la batterie dans Windows 10, consiste à éviter que les applications ne s&#39;exécutent en arrière-plan. Pour désactiver les applications en arrière-plan : </p> <p> 1. Accédez à <strong> Démarrer </strong> -&gt; <strong> Paramètres </strong> -&gt; <strong> Intimité </strong> . <br> 2. Sélectionnez <strong> Applications d&#39;arrière-plan </strong> à gauche, puis à droite, mettez le &quot; <strong> Laisser les applications s&#39;exécuter en arrière-plan&quot; </strong> basculer vers <strong> Désactivé, </strong> ou choisissez individuellement les applications que vous ne souhaitez pas exécuter en arrière-plan et désactivez-les. </p> <p><img src=\"images/image_thumb-8-676.png\" alt=\"Prevent Apps from Running in the Background - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Étape 2. Activez l&#39;économiseur de batterie. </h6> <p> L&#39;étape suivante consiste à activer l&#39;économiseur de batterie afin de prolonger la durée de vie de la batterie en limitant l&#39;activité en arrière-plan. </p> <p> 1. Accédez à <strong> Démarrer </strong> -&gt; <strong> Paramètres </strong> -&gt; <strong> Système </strong> . <br> 2. À <strong> La batterie </strong> option : </p> <blockquote> <p> une. Cliquez sur &quot;Voir quelles applications affectent la durée de vie de votre batterie&quot; pour connaître l&#39;utilisation de la batterie à partir des applications ouvertes. <br> b. <strong> Vérifier </strong> les &quot; <strong> Activer automatiquement l&#39;économiseur de batterie si ma batterie tombe en panne ci-dessous&quot; </strong> case à cocher et déplacez le curseur vers une position appropriée. <br> c. De plus, sélectionnez &quot;Réduire la luminosité de l&#39;écran pendant l&#39;économiseur de batterie. </p> </blockquote> <p><img src=\"images/image_thumb-9-289.png\" alt=\"turn on battery saver Windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Étape 3. Désactivez le démarrage rapide. </h6> <p> L&#39;étape suivante consiste à forcer Windows 10 à s&#39;arrêter complètement en désactivant la fonction de démarrage rapide. </p> <p> 1. Accédez à <strong> Démarrer </strong> -&gt; <strong> Paramètres </strong> -&gt; <strong> Système </strong> . <br> 2. À <strong> Pouvoir </strong> options cliquez <strong> Paramètres de puissance supplémentaires. </strong></p> <p><img src=\"images/image_thumb-10-405.png\" alt=\"FIX Battery Drain in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Sélectionnez <strong> Choisissez ce que font les boutons d&#39;alimentation </strong> A gauche. </p> <p><img src=\"images/image_thumb-11-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Cliquez ensuite sur <strong> Modifier les paramètres actuellement indisponibles </strong> . </p> <p><img src=\"images/image_thumb-12-235.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> Décocher </strong> les <strong> Activer le démarrage rapide (recommandé) </strong> option et cliquez sur <strong> Sauvegarder les modifications. * </strong></p> <p> * Remarque : si l&#39;option de démarrage rapide était déjà décochée, cochez-la et redémarrez votre ordinateur. Après le redémarrage, décochez-la et redémarrez votre ordinateur à nouveau. </p> <p><img src=\"images/image_thumb-13-410.png\" alt=\"Turn Off Fast Startup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Redémarrer </strong> ton ordinateur. </p> <h6></h6> <h6> Étape 4. Désactivez la mise en veille prolongée. </h6> <p> La mise en veille prolongée est une fonction d&#39;alimentation, qui utilise moins d&#39;énergie que le mode veille et lorsque vous redémarrez le PC, vous revenez à l&#39;endroit où vous vous étiez arrêté. Dans certains cas, la fonction de mise en veille prolongée empêche votre PC Windows 10 de s&#39;arrêter complètement. Pour désactiver la mise en veille prolongée : </p> <p> </p> <p> 1. Dans la zone de recherche, saisissez : <strong> invite de commande </strong> ou alors <strong> cmd <br> </strong> 2. Cliquez avec le bouton droit sur <strong> Invite de commandes et sélectionnez Exécuter en tant qu&#39;administrateur </strong></p> <p><img src=\"images/image_thumb-14-379.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. À l&#39;invite de commande, donnez la commande suivante et appuyez sur <strong> Entrer. </strong></p> <ul> <li><strong> powercfg -h désactivé </strong></li> </ul> <p><img src=\"images/image_thumb-15-234.png\" alt=\"Disable Hibernate Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. <strong> Redémarrer </strong> ton ordinateur. * </p> <p> * Remarque : Si vous souhaitez réactiver la fonctionnalité « Veille prolongée », tapez simplement cette commande dans l&#39;invite de commande administrative : </p> <ul> <li> <ul> <li> powercfg -h désactivé </li> </ul> </li> </ul> <p> </p> <h6> Étape 5. Modifiez les paramètres d&#39;alimentation sur l&#39;adaptateur réseau. </h6> <p> La méthode suivante pour résoudre le problème d&#39;épuisement de la batterie dans Windows 10 consiste à modifier les paramètres d&#39;alimentation sur les adaptateurs réseau. </p> <p> 1. Ouvrir <strong> Gestionnaire de périphériques </strong> . <br> 2. Développer <strong> Adaptateurs réseau </strong> . <br> 3. Cliquez avec le bouton droit sur la carte réseau installée et sélectionnez <strong> Propriétés </strong> . <br> 3. Sélectionnez le <strong> Gestion de l&#39;alimentation </strong> languette. <br> 4. <strong> Décocher </strong> les <strong> &#39;Autoriser cet appareil à réveiller l&#39;ordinateur </strong> &#39; case à cocher et cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-7-574.png\" alt=\"modify power settings\" loading=\"lazy\"></p> <h6></h6> <h6> Étape 6. Restaurez le pilote d&#39;interface du moteur de gestion Intel. </h6> <p> Si le problème d&#39;épuisement de la batterie apparaît après l&#39;installation d&#39;une mise à jour de Windows 10, continuez et restaurez le pilote pour l&#39;interface Intel Management Engine. Pour faire ça: </p> <p> 1. Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-592.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez : <strong> devmgmt.msc </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . <br> 3. Développer <strong> Périphériques système </strong> . <br> 4. Faites un clic droit sur <strong> Interface du moteur de gestion Intel </strong> et sélectionnez <strong> Propriétés </strong> . </p> <p><img src=\"images/image_thumb-5-532.png\" alt=\"device properties\" loading=\"lazy\"></p> <p> </p> <p> 5. Sélectionnez l&#39;onglet Pilote et cliquez sur <strong> Faire reculer le pilote </strong> . * </p> <p> </p> <p> * Si la <strong> Faire reculer le pilote </strong> est grisé, puis accédez au site d&#39;assistance du fabricant de votre ordinateur portable ou de votre carte mère pour télécharger et installer une ancienne version du pilote pour l&#39;interface Intel Management Engine. </p> <p><img src=\"images/image_thumb-6-551.png\" alt=\"roll back driver\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Redémarrer </strong> ton ordinateur. </p> <h6> Étape 7. Autres suggestions pour résoudre le problème de décharge de la batterie. </h6> <p> 1. Remplacez le chargeur de l&#39;ordinateur portable et utilisez toujours un chargeur de marque pour prolonger la durée de vie de votre batterie. <br> 2. Si la batterie de votre ordinateur portable est vieille, sa capacité a probablement diminué et doit être remplacée. Pour diagnostiquer l&#39;état de votre batterie, utilisez le <a href=\"http://www.nirsoft.net/utils/battery_information_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> BatteryInfoView </a> utilitaire. </p> <p><img src=\"images/image_thumb-16-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître ce problème. </p>"}