{"title":"CORRECTIF : erreur de l&#39;application Appareil photo 0xA00F424F (0x8004005) dans Windows 10. (Résolu)","content":"<p> L&#39;erreur de l&#39;application Appareil photo 0xA00F424F dans Windows 10, lors de la tentative de prise de photos ou de vidéos, signifie que l&#39;application Appareil photo ne peut pas enregistrer les photos ou les fichiers vidéo dans l&#39;emplacement de stockage spécifié sur votre ordinateur. L&#39;erreur 0xA00F424F (0x8004005) peut apparaître pour de nombreuses raisons, alors suivez les méthodes ci-dessous pour la corriger. </p> <p><img src=\"images/image_thumb-9-592.png\" alt=\"FIX: Camera App Error 0xA00F424F in Windows 10\" loading=\"lazy\"></p> <p> Ce tutoriel contient des instructions étape par étape pour résoudre l&#39;erreur &quot;Une erreur s&#39;est produite. Désolé, nous n&#39;avons pas pu enregistrer les photos&quot; avec l&#39;erreur : &quot;0xA00F424F (0x80004005)&quot; ou &quot;PhotoCaptureFileCreationFailed (0x80131500)&quot; </p> <h4> Comment CORRIGER : Application Appareil photo – Enregistrer l&#39;erreur 0xA00F424F (0x8004005) dans Windows 10. </h4> <h6> Méthode 1. Autorisez l&#39;application Appareil photo à accéder à l&#39;appareil photo. </h6> <p> La première méthode pour corriger l&#39;erreur de l&#39;appareil photo 0xA00F424F consiste à s&#39;assurer que l&#39;application Appareil photo a accès à votre appareil photo. Pour faire ça: </p> <p> 1. Accédez à <strong> Paramètres </strong> &gt; <strong> Intimité. <br> </strong> 2. Sélectionnez le <strong> Caméra </strong> app dans le volet gauche et dans le volet droit, effectuez les réglages suivants : </p> <p> une. Basculez le <strong> Autoriser les applications à accéder à votre appareil photo </strong> basculer vers <strong> AU </strong> . <br> b. Faites défiler vers le bas et sous le <strong> « Choisissez les applications du Microsoft Store qui peuvent accéder à votre appareil photo » </strong> section, activez le <strong> Caméra </strong> le passage de l&#39;application à <strong> AU </strong> . * </p> <p><img src=\"images/image_thumb-4-435.png\" alt=\"Allow apps to access your camera in Windows 10\" loading=\"lazy\"></p> <h6> Méthode 2. Réinitialisez les paramètres de l&#39;application Appareil photo. </h6> <p> 1. Accédez à <strong> Paramètres </strong> &gt; <strong> applications </strong> . <br> 2. Dans la liste &quot;Applications et fonctionnalités&quot;, sélectionnez l&#39;application Appareil photo, puis cliquez sur <strong> Options avancées </strong> . </p> <p><img src=\"images/image_thumb-5-262.png\" alt=\"Reset Camera App Settings - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Faites défiler vers le bas et cliquez sur <strong> Réinitialiser. </strong></p> <p><img src=\"images/image_thumb-6-318.png\" alt=\"Reset app settings Windows 10\" loading=\"lazy\"></p> <h6></h6> <h6> Méthode 3. Supprimez et recréez le dossier « Camera Roll ». </h6> <p> La méthode suivante pour corriger le code d&#39;erreur 0xA00F424F (0x80004005) dans l&#39;application Appareil photo consiste à s&#39;assurer que le dossier &#39;Camera Roll&#39; (C:\\Users\\%Username%\\Pictures\\Camera Roll), qui est l&#39;emplacement de sauvegarde par défaut pour le photos et vidéos, existe et dispose des autorisations appropriées pour enregistrer des photos et des vidéos. Pour faire ça: </p> <p> 1. Ouvrez l&#39;Explorateur Windows et dans la barre d&#39;adresse, saisissez l&#39;adresse suivante et appuyez sur <strong> Entrer </strong> : </p> <ul> <li> %APPDATA%\\Microsoft\\Windows\\Libraries\\Pictures </li> </ul> <p><img src=\"images/image_thumb-10-952.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Ouvrez le dossier &quot;Camera Roll&quot;* et assurez-vous qu&#39;il est vide de fichiers. (Sinon, déplacez tous ses fichiers vers un autre emplacement sur votre disque.). </p> <p> * Remarque : si le dossier Pellicule n&#39;existe pas, passez à l&#39;étape 4. </p> <p> 3. Maintenant, <strong> effacer </strong> les <strong> Pellicule </strong> dossier. </p> <p><img src=\"images/image_thumb-11-440.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Enfin, créez un nouveau dossier et nommez-le &quot; <strong> Pellicule </strong> &quot; <br> 5. Une fois terminé, ouvrez l&#39;application Appareil photo et essayez de prendre une photo ou d&#39;enregistrer une vidéo pour voir si le problème est résolu. </p> <p> </p> <h6> Méthode 4. Ajoutez le dossier Pellicule à la bibliothèque d&#39;images. </h6> <p> La dernière méthode pour corriger l&#39;erreur d&#39;application de l&#39;appareil photo 0xA00F424F consiste à spécifier un autre emplacement pour stocker les photos/vidéos. Pour faire ça: </p> <p> 1. Ouvrez l&#39;Explorateur Windows et dans la barre d&#39;adresse, saisissez l&#39;adresse suivante et appuyez sur <strong> Entrer </strong> : </p> <ul> <li> %APPDATA%\\Microsoft\\Windows\\Bibliothèques </li> </ul> <p> 2. Faites un clic droit sur le <strong> Pellicule </strong> dossier et sélectionnez <strong> Propriétés </strong> . </p> <p><img src=\"images/image_thumb-8-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Maintenant, effectuez l&#39;une des opérations suivantes : </p> <p> une. Si la « Pellicule » n&#39;est pas répertoriée sous « Emplacement des bibliothèques », cliquez sur le bouton <strong> Ajouter </strong> bouton, ouvrez le <strong> Des photos </strong> dossier, puis sélectionnez le <strong> Pellicule </strong> dossier comme emplacement de sauvegarde par défaut pour les photos et vidéos. </p> <p> b. Si le dossier « Camera Roll » est répertorié sous « Emplacement des bibliothèques », cliquez sur <strong> Ajouter </strong> et spécifiez un nouveau dossier de stockage pour l&#39;application Appareil photo. Une fois terminé, cliquez sur <strong> Définir l&#39;emplacement de sauvegarde </strong> et cliquez <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-12-180.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Enfin, ouvrez l&#39;application Appareil photo et essayez de prendre une photo ou une vidéo. </p> <p> </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}