{"title":"CORRECTIF : problème d&#39;utilisation élevée de la mémoire Chrome (résolu)","content":"<p> Comme vous l&#39;avez peut-être déjà remarqué, Google Chrome ouvre de nombreux processus en arrière-plan, même lorsque vous n&#39;avez ouvert que quelques fenêtres / onglets Chrome. Cela se produit, car Google Chrome est conçu de manière à créer un processus individuel pour chaque plugin ou extension installé lorsque vous ouvrez une nouvelle fenêtre ou un nouvel onglet. </p> <p> Bien que l&#39;ouverture de plusieurs processus à partir de Google Chrome soit un comportement normal, il s&#39;agit en fait d&#39;un problème, car ce comportement utilise beaucoup de mémoire et rend l&#39;ordinateur insensible. </p> <p><img src=\"images/image_thumb-17-610.png\" alt=\"FIX: Multiple Processes in Chrome with High Memory Usage\" loading=\"lazy\"></p> <p> </p> <p> Ce didacticiel contient des instructions étape par étape sur la façon d&#39;empêcher Chrome d&#39;ouvrir plusieurs processus pour chaque fenêtre ou onglet, afin de résoudre le problème d&#39;utilisation élevée de la mémoire de Chrome. </p> <h4> Comment désactiver plusieurs processus Chrome dans Windows 10. </h4> <h6> Étape 1. Analysez votre ordinateur contre les logiciels malveillants et les virus. </h6> <p> La première étape avant de résoudre l&#39;erreur &quot;ERR_CONNECTION_CLOSED&quot; dans Chrome consiste à vous assurer que votre système est exempt de virus/programmes malveillants. Pour cette tâche, suivez les instructions de ce guide : <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment analyser votre ordinateur contre les virus et autres programmes malveillants. </a></p> <h6></h6> <h6> Étape 2. Désactivez les extensions Chrome indésirables. </h6> <p> Tout d&#39;abord, vérifiez si vous avez besoin de toutes les extensions Chrome installées et désactivez celles dont vous n&#39;avez pas besoin. Pour faire ça: </p> <p> 1. Depuis le menu de Chrome <img src=\"images/image_thumb-47-380.png\" alt=\"image\" loading=\"lazy\"> , aller à <strong> Plus d&#39;outils </strong> -&gt; <strong> Rallonges </strong></p> <p><img src=\"images/image_thumb-51-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Supprimez (ou désactivez) toute extension dont vous n&#39;avez pas besoin ou que vous ne reconnaissez pas. </p> <p><img src=\"images/image_thumb-49-442.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Étape 3. Empêchez Chrome de s&#39;exécuter en arrière-plan lorsque Chrome est fermé. </h6> <p> 1. Depuis le menu Chrome <img src=\"images/image_thumb-78-665.png\" alt=\"image\" loading=\"lazy\"> sélectionner <strong> Paramètres </strong> . </p> <p><img src=\"images/image_thumb-79-868.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> 2. À <strong> Paramètres </strong> page, faites défiler vers le bas et cliquez <strong> Avancée </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <p> 3. Réglez le commutateur &quot;Continuer à exécuter les applications en arrière-plan lorsque Google Chrome est fermé&quot; sur <strong> DÉSACTIVÉ </strong> . </p> <p><img src=\"images/image_thumb-18-557.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <p> </p> <h6> Étape 4. Empêchez Chrome d&#39;ouvrir plusieurs processus pour le même site. </h6> <p> 1, <strong> Clic-droit </strong> au <strong> Google Chrome </strong> raccourci et sélectionnez <strong> Propriétés </strong> . <br> 2. À <strong> Général </strong> onglet, ajoutez le commutateur &quot; –process-per-site&quot; (sans les guillemets), à la fin de la ligne cible et cliquez sur <strong> d&#39;accord </strong> et <strong> Continuer </strong> appliquer le changement <strong> . * </strong></p> <p> par exemple. &quot;C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe&quot; –process-per-site </p> <p> Remarque : Il y a un espace avant -process-per-site </p> <p><img src=\"images/image_thumb-19-818.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Étape 5. Désactivez l&#39;isolement du site Google Chrome. </h6> <p> En mode d&#39;isolation de site, Chrome chargera chaque site Web dans son propre processus. Il s&#39;agit en fait d&#39;une fonction de sécurité supplémentaire pour empêcher un site Web de voler vos données à partir d&#39;un autre site Web ouvert sur une autre fenêtre / onglet. Mais, le mode « Isolation du site » augmentera l&#39;utilisation de la mémoire de Chrome d&#39;environ 10 %. </p> <p> 1. Dans la barre d&#39;adresse Chrome, saisissez <a href=\"//flags/#site-isolation-trial-opt-out\" target=\"_blank\" rel=\"nofollow noopener\"> chrome://flags/#site-isolation-trial-opt-out </a> et cliquez sur entrer. </p> <p> 2. Réglez le <strong> Désactiver l&#39;isolement du site </strong> mode à <strong> Désactivée </strong> puis cliquez <strong> Relancer maintenant </strong> . * </p> <p> * Noter: </p> <p><img src=\"images/image_thumb-20-397.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? </p> <p> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}