{"title":"Comment décrypter les fichiers cryptés EFS et supprimer le cryptage EFS dans Windows 10.","content":"<p> Dans un tutoriel précédent, j&#39;avais décrit la façon de <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> cryptez vos fichiers en utilisant le cryptage EFS </a> . Dans ce didacticiel, vous découvrirez comment supprimer le cryptage EFS et comment décrypter les fichiers cryptés EFS après les avoir transférés vers un autre ordinateur. </p> <h4> Comment décrypter les fichiers cryptés EFS et désactiver le cryptage EFS. </h4> <ul> <li> <p><a href=\"#part-1\"> Partie 1. Comment désactiver et supprimer le cryptage EFS sur le même PC. </a></p> </li> <li> <p><a href=\"#part-2\"> Partie 2. Comment décrypter les fichiers EFS sur un autre PC. </a></p> </li> </ul> <h6> Partie 1. Comment désactiver et supprimer le cryptage EFS. </h6> <p> Lorsque vous chiffrez vos fichiers avec EFS, la clé de déchiffrement (certificat) est stockée localement sur votre ordinateur et les fichiers sont déjà déchiffrés. Si vous souhaitez désactiver le chiffrement EFS afin d&#39;arrêter le chiffrement de vos fichiers/dossiers : </p> <p> 1. Cliquez avec le bouton droit sur le dossier/fichier crypté et modifiez le <strong> Propriété du fichier </strong> à <strong> Personnel </strong> . </p> <p><img src=\"images/image_thumb-26-500.png\" alt=\"how to disable efs encryption\" loading=\"lazy\"></p> <p> 2. Une fois terminé, vous devriez voir que le dossier/fichier est déverrouillé. Effectuez simplement les mêmes étapes pour supprimer le cryptage sur tous les autres dossiers et fichiers cryptés. </p> <p> 3. Maintenant, si vous n&#39;utilisez pas le cryptage EFS pour un autre fichier/dossier et que vous souhaitez supprimer complètement la clé de récupération EFS (alias &quot;clé de décryptage - certificat&quot;) de votre PC : </p> <blockquote> <p> 1. Ouvrez Internet Explorer et à partir du <strong> Outils </strong> sélection de menu <strong> options Internet </strong> . (ou, ouvrez <strong> options Internet </strong> de <strong> Panneau de commande </strong> .) </p> <p> 2. À <strong> Contenu </strong> clic sur l&#39;onglet <strong> Certificats </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-27-186.png\" alt=\"how to remove efs certificate-recovery key\" loading=\"lazy\"></p> <blockquote> <p> 3. Dans l&#39;onglet Personnel, sélectionnez le certificat de déchiffrement et cliquez sur <strong> Supprimer </strong> . * </p> <p><strong> * Attention: </strong> Assurez-vous d&#39;avoir supprimé (arrêté) le chiffrement de tous les fichiers chiffrés avant de supprimer le certificat (clé de déchiffrement) </p> </blockquote> <p><img src=\"images/image_thumb-25-639.png\" alt=\"how to remove efs recovery key\" loading=\"lazy\"></p> <blockquote> <p> 4. <strong> Redémarrer </strong> ton ordinateur. </p> </blockquote> <h6></h6> <h6> Partie 2 : Comment décrypter les fichiers cryptés EFS sur un autre ordinateur. </h6> <p> Si vous avez transféré les fichiers cryptés EFS vers un autre ordinateur, le seul moyen d&#39;afficher (ouvrir) les fichiers EFS est de posséder la clé de décryptage. La clé de déchiffrement est le fichier .pfx du certificat, que vous avez exporté lorsque vous avez chiffré les fichiers. Si vous n&#39;avez pas la clé de déchiffrement EFS, il n&#39;y a aucun moyen de déchiffrer les fichiers EFS. </p> <p><strong> Pour décrypter les fichiers cryptés EFS, à l&#39;aide de la clé de décryptage - Certificat : </strong></p> <p> 1. Double-cliquez sur la clé de déchiffrement (fichier de certificat .pfx) pour l&#39;installer. <br> 2. Sur l&#39;écran de bienvenue de l&#39;assistant d&#39;importation de certificat, cliquez sur <strong> Suivant </strong> . <br> 3. Cliquez ensuite sur <strong> Suivant </strong> de nouveau. </p> <p><img src=\"images/image_thumb38_thumb-158.png\" alt=\"How to Decrypt EFS Encrypted files\" loading=\"lazy\"></p> <p> 4. Saisissez le mot de passe que vous avez utilisé lors de l&#39;exportation de la clé de certificat et cliquez sur <strong> Suivant </strong> . </p> <p><img src=\"images/image_thumb39_thumb-680.png\" alt=\"install efs .pfx certificate\" loading=\"lazy\"></p> <p> 5. Laissez les paramètres par défaut dans les options du magasin de certificats et cliquez sur <strong> Suivant </strong> . </p> <p><img src=\"images/image_thumb40_thumb-629.png\" alt=\"image_thumb[40]\" loading=\"lazy\"></p> <p> 6. Enfin cliquez <strong> Finir </strong> . </p> <p><img src=\"images/image_thumb41_thumb-225.png\" alt=\"image_thumb[41]\" loading=\"lazy\"></p> <p> </p> <p> 7. Vous pouvez maintenant ouvrir les fichiers cryptés. * </p> <p> * Remarque : Après avoir déchiffré les fichiers, suivez les instructions sur <a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> partie 1 </a> ci-dessus, pour supprimer complètement le cryptage si vous le souhaitez. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez ce billet de blog sur les réseaux sociaux pour aider à faire connaître cette solution </p>"}