{"title":"CORRECTIF : la barre de colonnes Outlook (barre d&#39;en-tête) disparaît dans Outlook 2016/2019. (Résolu)","content":"<p> Il y a quelques jours, un de mes clients m&#39;a contacté pour signaler que la barre avec les titres des colonnes (Envoyer, De, Objet, Reçu, Taille, etc.) est manquante dans Outlook 2019. Plus précisément, la ligne avec le les en-têtes des colonnes ont disparu après que l&#39;utilisateur a personnalisé les &quot;Paramètres d&#39;affichage&quot; et augmenté la taille de la police ROW. </p> <p><img src=\"images/image_thumb-567.png\" alt=\"FIX: Outlook Columns Bar (Header Bar) Disappear in Outlook 2016/2019\" loading=\"lazy\"></p> <p> Ce didacticiel contient des instructions sur la façon de résoudre le problème &quot;Outlook Header Bar (Columns Row) missing&quot; dans Outlook 2016/2019. </p> <h4> Comment CORRIGER : la ligne d&#39;en-tête de colonne est manquante dans Outlook 2016/2019. </h4> <p> 1. Dans le volet gauche, avec les dossiers Outlook, sélectionnez le dossier où vous ne pouvez pas voir la ligne avec les colonnes (en-têtes). </p> <p> 2. Dans la barre de menus, choisissez <strong> Vue </strong> puis cliquez <strong> Paramètres d&#39;affichage </strong> . </p> <p><img src=\"images/image_thumb-1-535.png\" alt=\"FIX Column Heading Row is Missing Outlook 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Dans les options &#39;Paramètres d&#39;affichage avancés&#39;, cliquez sur <strong> Autres réglages </strong> . </p> <p><img src=\"images/image_thumb-2-711.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Dans les options &#39;Autres paramètres&#39;, <strong> décocher </strong> les <strong> Utilisez une mise en page compacte avec moins de 125 caractères </strong> case à cocher et cliquez <strong> d&#39;accord </strong> deux fois pour appliquer le réglage et fermer toutes les fenêtres. </p> <p><img src=\"images/image_thumb-3-736.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Redémarrez Outlook (ou accédez à un autre dossier et revenez au dossier dans lequel vous avez appliqué la modification), afin de voir la barre avec les en-têtes de colonne en place. </p> <p><img src=\"images/image_thumb-4-249.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-5.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p>"}