{"title":"CORRECTIF 0xC1900101 - 0x40017 : L&#39;installation a échoué dans la phase SECOND_BOOT dans la mise à jour Windows 10. (Résolu)","content":"<p> Ce didacticiel contient des instructions pour corriger l&#39;erreur de mise à niveau de Windows 10 0xC1900101 – 0x40017 : &quot;L&#39;installation a échoué dans la phase SECOND_BOOT avec une erreur lors de l&#39;opération BOOT&quot;. </p> <p> </p> <p><img src=\"images/image_thumb-63-307.png\" alt=\"FIX 0xC1900101 – 0x40017 Installation failed in SECOND_BOOT phase \" loading=\"lazy\"></p> <p> </p> <p> Problème de mise à niveau de Windows 10 0xC1900101 - 0x40017 en détails : lorsque vous essayez de mettre à niveau Windows 10 vers la dernière version (build) ou lorsque vous essayez de mettre à niveau votre système de Windows 7 ou 8.1 vers Windows 10, l&#39;installation s&#39;arrête avec l&#39;erreur t installez Windows 10 - 0xC1900101 - 0x40017 - L&#39;installation a échoué dans la deuxième phase de démarrage avec une erreur lors de l&#39;opération de démarrage&quot;, puis revient à la version précédente de Windows. </p> <h2> Comment corriger l&#39;erreur de mise à jour de Windows 10 0xC1900101 - 0x40017 &quot;L&#39;installation a échoué dans la phase SECOND_BOOT avec une erreur lors de l&#39;opération BOOT&quot; </h2> <p> Le code d&#39;erreur 0xC1900101 - 0x40017 lors de la mise à niveau de Windows 10, indique un problème avec un périphérique, un pilote ou un programme incompatible sur le système. Donc, avant de continuer à appliquer les méthodes ci-dessous, appliquez ce qui suit : </p> <p> </p> <p> 1. Tout d&#39;abord, assurez-vous que les paramètres de date et d&#39;heure sont corrects. <br> 2. Ensuite, assurez-vous que vous disposez de suffisamment d&#39;espace libre. Windows 10 nécessite au moins 32 Go d&#39;espace libre pour la mise à niveau. Pour libérer de l&#39;espace disque, utilisez <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Nettoyage de disque </a> . <br> 3. Installez les derniers pilotes pour tous les périphériques de votre système, en particulier pour l&#39;adaptateur Ethernet et sans fil (le cas échéant). * <br> 4. Déconnectez tous les lecteurs USB externes et cartes SD et tout autre périphérique USB qui n&#39;est pas nécessaire. <br> 5. Si vous utilisez un programme antivirus tiers, désactivez-le temporairement ou, mieux encore, désinstallez-le. <br> 6. Désactivez le cryptage du disque dur (si activé). <br> 7. Enfin, avant de redémarrer votre ordinateur pour installer la mise à jour, déconnectez-vous du réseau. (par exemple, débranchez le câble Ethernet ou désactivez l&#39;adaptateur Wi-Fi). </p> <p><strong> * Noter: </strong> Si, après avoir appliqué les instructions de cet article, l&#39;installation de la mise à niveau de Windows 10 échoue toujours, continuez et mettez également à jour le BIOS (Firmware) sur votre système. </p> <h6> Méthode 1. Exécutez l&#39;utilitaire de résolution des problèmes de Windows Update. </h6> <p> La première méthode pour corriger l&#39;erreur de mise à jour Windows 10 0xC1900101 - 0x4001E consiste à exécuter l&#39;utilitaire de résolution des problèmes Windows Update. </p> <p> 1. Accédez à Windows <strong> Panneau de commande </strong> , définissez l&#39;option « Afficher par » sur <strong> Petites icônes </strong> et ouvrir <strong> Dépannage. </strong></p> <p><img src=\"images/image_thumb-5-978.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Dans les options de dépannage, cliquez sur <strong> Résoudre les problèmes avec Windows Update. </strong></p> <p><img src=\"images/image_thumb-9-833.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Cliquez sur <strong> Suivant </strong> pour résoudre les problèmes de mise à jour de Windows. </p> <p><img src=\"images/image_thumb-8-522.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Une fois le processus de dépannage terminé, <strong> Fermer </strong> le dépanneur et <strong> redémarrer </strong> votre ordinateur. <br> 6. Vérifiez les mises à jour. </p> <p> </p> <h6></h6> <h6></h6> <h6> Méthode 2. <strong> Supprimez le dossier &#39;SoftwareDistribution&#39;. </strong></h6> <p> Le &quot;C:\\Windows\\ <strong> Distribution de logiciels </strong> &quot;, est l&#39;emplacement où Windows stocke les mises à jour Windows. Plusieurs fois, ce dossier est corrompu et vous devez le recréer afin de télécharger les mises à jour à partir de zéro. Pour reconstruire (recréer) le dossier « SoftwareDistribution », suivez les étapes ci-dessous : </p> <p><strong> Étape 1 : arrêtez le service de mise à jour Windows. </strong></p> <p> 1. Ouvrez le panneau de configuration des services Windows : Pour ce faire : </p> <ul> <li> Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-650.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. </li> <li> Dans la zone de recherche, saisissez : <strong><em> services.msc </em></strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </li> <li> (Acceptez l&#39;avertissement UAC s&#39;il apparaît). </li> </ul> <p><img src=\"images/image_thumb-12-595.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Dans le panneau de configuration des services, recherchez le &quot; <strong> Windows Update&quot; </strong> un service. <br> 3. Faites un clic droit sur <strong> Windows Update </strong> service et sélectionnez &quot; <strong> Arrêter </strong> ”. </p> <p><img src=\"images/image_thumb-9-376.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Étape 2 : supprimez le dossier SoftwareDistribution. </strong></p> <p> 1. Ouvrez l&#39;Explorateur Windows et accédez à : <strong> C:\\Windows </strong> dossier. <br> 2. Trouvez et <strong> Effacer </strong> les &quot; <strong><em> Distribution de logiciels </em></strong> &quot; (ou renommez-le, par exemple en &quot;SoftwareDistributionOLD&quot;) . </p> <p> </p> <p><img src=\"images/image_thumb-10-350.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p><strong> Étape 3 : Démarrez le service de mise à jour Windows. </strong></p> <p> 1. Ouvrez le panneau de configuration des services Windows. <br> 2. Faites un clic droit sur <strong> Windows Update </strong> service et sélectionnez &quot; <strong> Démarrer </strong> ”. </p> <p><img src=\"images/image_thumb-11-613.png\" alt=\"start windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Étape 4 : Vérifiez et installez la mise à jour Windows 10. </strong></p> <p> 1. Accédez à <strong> Paramètres </strong> -&gt; <strong> Mise à jour et sécurité </strong> et cliquez <strong> Vérifier les mises à jour </strong> . </p> <p> </p> <h6> Méthode 3. Mettez à jour Windows 10 à l&#39;aide de l&#39;assistant de mise à jour </h6> <p> 1. Accédez à <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Site de téléchargement de Windows 10 </a> et cliquez sur le <strong> Mettez à jour maintenant </strong> bouton. </p> <p><img src=\"images/image_thumb-60-575.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Enregistrez le fichier &quot;Windows10Upgrade9252.exe&quot; sur votre bureau. <br> 3. Double-cliquez sur le fichier téléchargé pour ouvrir le <strong> Assistant de mise à niveau Windows </strong> . <br> 4. Cliquez sur <strong> Mettez à jour maintenant </strong> pour lancer la mise à jour. </p> <p><img src=\"images/image_thumb-61-861.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Laissez Windows terminer le téléchargement et la vérification. <br> 6. Lorsque la vérification atteint 100 %, <strong> déconnectez votre ordinateur d&#39;Internet </strong> , ou réglez-le sur &quot; <strong> Mode avion </strong> &quot;. <br> 7. Attendez que Windows mette à jour votre système. <br> 8. Lorsque vous y êtes invité, redémarrez votre système pour installer la mise à jour. </p> <h6></h6> <h6> Méthode 4. Mettez à jour Windows 10 depuis ISO/USB. </h6> <p> La méthode suivante pour corriger l&#39;erreur de mise à jour de Windows 10 « L&#39;installation a échoué dans la phase SECOND_BOOT » consiste à mettre à jour Windows 10 à partir du fichier ISO de Windows. Pour faire ça: </p> <p><strong> Étape 1. Téléchargez Windows 10 dans un fichier ISO. </strong></p> <p> 1. Accédez à <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Page de téléchargement de Windows 10 </a> et téléchargez le <strong> Outil de création de médias </strong> . </p> <p><img src=\"images/image_thumb-62-759.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Exécutez « l&#39;outil de création de médias » et <strong> J&#39;accepte </strong> les termes de la licence au premier écran. <br> 3. Sélectionnez <strong> Créer un support d&#39;installation pour un autre PC </strong> . </p> <p><img src=\"images/image_thumb1_thumb-893.png\" alt=\"create Windows 10 DVD\" loading=\"lazy\"></p> <p> </p> <p> 4. Sur l&#39;écran &quot;Langue, architecture et édition&quot;, cliquez sur <strong> Suivant. <br> </strong> 5. Sélectionnez <strong> fichier ISO </strong> et cliquez <strong> Suivant </strong> . </p> <p><img src=\"images/image_thumb-30-122.png\" alt=\"download windows 10 iso\" loading=\"lazy\"></p> <p> 6. <strong> Sauvegarder </strong> le fichier &#39;Windows.iso&#39; sur votre bureau. <br> 7. L&#39;outil de création de support va maintenant commencer à télécharger Windows 10 au format ISO. <br> 8. Une fois le téléchargement terminé, <strong> Fermer </strong> l&#39;outil de création de médias. </p> <p> </p> <p><strong> Étape 2. Mettez à jour Windows 10 à partir du fichier ISO. </strong></p> <p> 1. <strong> Déconnectez votre ordinateur d&#39;Internet </strong> , (ou réglez-le sur &quot;Mode avion&quot; si vous possédez un ordinateur portable). <br> 2. <strong> Désactiver </strong> ou alors <strong> désinstaller temporairement </strong> quelconque <strong> antivirus tiers </strong> . <br> 3. Ensuite, faites un clic droit sur le fichier &quot;Windows.iso&quot; (sur votre bureau) et cliquez sur <strong> Monter </strong> . <br> 4. Double-cliquez sur <strong> Installer </strong> application. </p> <p><img src=\"images/image_thumb-36-800.png\" alt=\"windows 10 setup\" loading=\"lazy\"></p> <p> </p> <p> 5. Sur l&#39;écran ci-dessous, choisissez <strong> &#39;Pas tout de suite&#39; </strong> et cliquez <strong> Suivant </strong> . </p> <p><img src=\"images/image_thumb-11-579.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Suivez les autres instructions à l&#39;écran pour mettre à jour votre système. </p> <h4></h4> <h6> Méthode 5. Nettoyer l&#39;installation de Windows 10. </h6> <p> La dernière méthode, pour résoudre les problèmes de mise à niveau de Windows 10, consiste à effectuer une nouvelle installation de Windows 10 sur votre système. </p> <p><strong> Important: </strong> L&#39;installation propre de Windows 10 signifie que tous vos fichiers et paramètres seront perdus pendant le processus d&#39;installation. Alors, continuez et <strong> sauvegardez tous vos fichiers et paramètres importants sur un autre support de stockage avant de continuer </strong> . (par exemple sur une clé USB externe). </p> <p> Pour effectuer une nouvelle installation de Windows 10, lisez les instructions de cet article : <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment nettoyer l&#39;installation de Windows 10 </a></p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}