{"title":"CORRECTIF : Ordinateur portable Dell Inspiron à vitesse lente du processeur (résolu)","content":"<p> Ce didacticiel contient des instructions pour résoudre le problème de vitesse du processeur très lent sur un ordinateur portable Dell Inspiron 5558. Récemment, un de mes amis a amené son ordinateur portable Dell dans mon laboratoire parce qu&#39;il est soudainement devenu trop lent. En fait, l&#39;ordinateur portable fonctionnait rapidement dans le passé, mais il faut maintenant beaucoup de temps pour charger le système d&#39;exploitation (Windows 10) et les applications. </p> <p> Après avoir vérifié l&#39;ordinateur portable, et comme vous pouvez le voir sur la capture d&#39;écran ci-dessous, j&#39;ai constaté que le processeur fonctionnait toujours à 0,48 GHz au lieu de 2,20 GHz. J&#39;ai donc commencé le dépannage et j&#39;ai finalement trouvé les deux méthodes suivantes pour résoudre le problème de lenteur du processeur… </p> <p> (La vitesse du processeur a été réduite d&#39;environ 85 à 87 % sur un ordinateur portable Dell) </p> <p><img src=\"images/image_thumb-16-354.png\" alt=\"FIX Dell Laptop Slow CPU Speed\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Comment RÉSOUDRE le problème de ralentissement de la vitesse du processeur sur un ordinateur portable Dell. </h4> <h6> Méthode 1. Remplacez l&#39;adaptateur secteur. </h6> <p> Le problème de vitesse lente du processeur est un problème connu sur les ordinateurs portables Dell, lorsque l&#39;adaptateur secteur n&#39;est pas reconnu correctement par l&#39;ordinateur. Dans ce cas, et même si l&#39;adaptateur secteur semble fonctionner correctement, le message d&#39;avertissement suivant s&#39;affiche lorsque vous allumez l&#39;ordinateur portable &quot;Le type d&#39;adaptateur secteur ne peut pas être déterminé. Cela empêchera les performances optimales du système&quot;. </p> <p> Ainsi, la première méthode pour résoudre votre problème de lenteur de performances sur votre ordinateur portable Dell consiste à remplacer l&#39;adaptateur secteur par un nouvel adaptateur secteur Dell compatible. </p> <p> </p> <h6> Méthode 2. ARRÊTEZ la limitation du processeur avec ThrottleStop. </h6> <p> Si votre adaptateur secteur fonctionne bien et que votre ordinateur portable ne surchauffe pas,* alors, une autre méthode pour résoudre le problème de lenteur des performances du système sur votre ordinateur portable Dell consiste à désactiver la limitation de l&#39;adaptateur secteur inconnu, avec le <strong><a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"> Accélérateur </a></strong> utilitaire. Pour faire ça: </p> <p> 1. Téléchargez le <a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Accélérateur </strong></a> utilitaire et extrayez l&#39;archive que vous avez téléchargée. <br> 2. À partir du dossier extrait, double-cliquez pour exécuter l&#39;application &quot;ThorttleStop.exe&quot;. * <br> 3. <strong> Décocher </strong> les <strong> BD PROCHOT </strong> *** case à cocher puis cliquez sur <strong> Sauvegarder </strong> . </p> <p> * Remarques: <br> 1. Pour surveiller la température du processeur, vous pouvez utiliser le <a href=\"https://www.alcpu.com/CoreTemp/\" target=\"_blank\" rel=\"nofollow noopener\"> CoreTemp </a> programme. <br> 2. Si vous recevez l&#39;erreur &quot;MFC120U.dll introuvable&quot; ou &quot;MSVCR120.dll est manquant&quot;, après avoir exécuté ThrottleStop, continuez et installez le <a title=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" href=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Packages redistribuables Visual C++ pour Visual Studio 2013 </a> . ( <strong> Important: </strong> Si vous possédez Windows 64 bits, vous devez installer les versions 64 bits et 32 ​​bits du package Visual C++). <br> 3. BD PROCHOT signifie prochot bidirectionnel. PROCHOT signifie processeur chaud qui est le signal qui est activé dans le processeur lorsqu&#39;il atteint environ 100C à 105C selon le numéro de modèle. Ce signal est ce qui déclenche la limitation thermique afin que le processeur puisse ralentir et éviter une surchauffe. La désactivation de PROCHOT permettra à votre CPU de continuer à fonctionner à pleine vitesse. (La source: <a href=\"http://forum.notebookreview.com/threads/the-throttlestop-guide.531329/\" target=\"_blank\" rel=\"nofollow noopener\"> Le guide ThrottleStop </a> ). </p> <p><img src=\"images/image_thumb-20-666.png\" alt=\"FIX Slow CPU Speed with ThrottleStop\" loading=\"lazy\"></p> <p> 4. Fermez ThrottleStop et vous avez terminé. Maintenant, le processeur fonctionnera à pleine vitesse jusqu&#39;à ce que vous redémarriez ou éteignez l&#39;ordinateur portable. * </p> <p> * Remarque : vous devez exécuter le <strong> Accélérateur </strong> programme chaque fois que vous démarrez votre ordinateur, si vous voulez fonctionner à pleine vitesse du processeur. Pour vous simplifier la vie, suivez les étapes de ce <a href=\"https://www.repairwin.com/how-to-start-throttlestop-at-windows-startup/\" target=\"_blank\" rel=\"nofollow noopener\"> guider </a> pour démarrer automatiquement ThrottleStop au démarrage de Windows. </p> <p><img src=\"images/image_thumb-21-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}