{"title":"CORRECTIF : le pavé tactile ne fonctionne pas ou se bloque dans Windows 10 (résolu)","content":"<p> Au cours des dernières années, j&#39;ai résolu de nombreux problèmes de pavé tactile dans Windows 10 sur plusieurs ordinateurs portables (par exemple, le pavé tactile ne fonctionne pas, le pavé tactile se bloque, etc.), j&#39;ai donc décidé d&#39;écrire un didacticiel pour résoudre ces problèmes. </p> <p> Si vous possédez un ordinateur portable, vous pouvez parfois rencontrer des problèmes avec le pavé tactile. Surtout si vous avez Windows 10, le pavé tactile peut souvent cesser de fonctionner ou ne pas fonctionner correctement après l&#39;installation d&#39;une mise à jour. Bien sûr, les problèmes du pavé tactile peuvent indiquer un problème matériel, mais dans de nombreux cas, les dysfonctionnements du pavé tactile sont dus à des problèmes logiciels. </p> <p> Sous Windows 10, le pavé tactile de l&#39;ordinateur portable peut ne pas fonctionner pour diverses raisons, ce tutoriel couvrira donc toutes les méthodes pour résoudre le problème. </p> <h2> Comment RÉSOUDRE les problèmes de pavé tactile dans Windows 10. </h2> <p> Suivez ces étapes avant de procéder avec les méthodes suivantes pour résoudre les problèmes d&#39;écran tactile. </p> <ol> <li> Assurez-vous que Windows 10 n&#39;est pas gelé en appuyant sur ALT + CTRL + SUPPR et voyez si le Gestionnaire des tâches s&#39;ouvre. </li> <li> Si votre ordinateur portable dispose d&#39;une combinaison de touches de fonction pour désactiver et activer le pavé tactile. (par exemple, Fn + F3), puis appuyez sur la combinaison de touches Fn pour allumer le pavé tactile. (Sur certains ordinateurs portables, le pavé tactile peut être activé/désactivé en appuyant deux fois sur la surface du pavé tactile) </li> <li> Redémarrez votre ordinateur. </li> <li> Effectuez un arrêt complet de Windows 10, puis rallumez votre ordinateur portable. (Pour effectuer un arrêt complet : appuyez et maintenez enfoncé le <strong> CHANGEMENT </strong> touche puis cliquez <strong> Démarrer </strong> &gt; <strong> Pouvoir </strong> &gt; <strong> Fermer </strong> ). </li> </ol> <p><strong> </strong></p> <h3> Méthode 1. Activez le pavé tactile dans Windows 10. </h3> <p> Windows 10 a la possibilité de désactiver ou d&#39;éteindre le pavé tactile lorsqu&#39;une souris externe est connectée. Alors, continuez et assurez-vous que le pavé tactile est activé dans les paramètres du pavé tactile. </p> <p> 1. Accédez à <strong> Démarrer </strong><img src=\"images/image_thumb2_thumb_thumb-670.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menu -&gt; <strong> Paramètres </strong> <img src=\"images/image_thumb-66-512.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Dispositifs. <br> </strong> 2. Sélectionnez <strong> Pavé tactile </strong> sur le panneau de gauche et à droite, assurez-vous que le commutateur du pavé tactile est réglé sur <strong> AU </strong> et aussi <strong> Chèque </strong> les <strong> Laisser le pavé tactile allumé lorsqu&#39;une souris est connectée </strong> option. * </p> <p><img src=\"images/image_thumb-38-467.png\" alt=\"Disable Touchpad Windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Remarque : Si vous ne trouvez pas ici la bascule/le commutateur du pavé tactile… </p> <p> 1. Ouvrir <strong> Paramètres additionnels </strong> sous le <strong> Paramètres associés </strong> section. </p> <ul> <li> Article associé: <a href=\"https://www.repairwin.com/disable-touchpad-option-missing-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Désactiver l&#39;option du pavé tactile manquante sur Windows 10. </strong></a></li> </ul> <p><img src=\"images/image_thumb-39-742.png\" alt=\"touchpad additional settings\" loading=\"lazy\"></p> <p> 2. Activez le pavé tactile dans les options Propriétés de la souris. (Si le pavé tactile est déjà activé, essayez de le désactiver et de le réactiver.) </p> <p><img src=\"images/image_thumb-31-122.png\" alt=\"enable touchpad windows 10\" loading=\"lazy\"></p> <h3> Méthode 2. Réinitialiser les paramètres du pavé tactile dans Windows 10. </h3> <p> Une méthode courante pour résoudre les problèmes de pavé tactile dans Windows 10 consiste à réinitialiser les paramètres du pavé tactile à leurs valeurs par défaut. </p> <p> 1. Accédez à <strong> Démarrer </strong><img src=\"images/image_thumb2_thumb_thumb-596.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menu -&gt; <strong> Paramètres </strong> <img src=\"images/image_thumb-66-851.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Dispositifs. <br> </strong> 2. À <strong> Pavé tactile </strong> options <strong> , </strong> faites défiler vers le bas et cliquez <strong> Réinitialiser </strong> en dessous de <strong> Réinitialisez votre pavé tactile. * </strong></p> <p><img src=\"images/image_thumb-40-277.png\" alt=\"reset touchpad windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Remarque : si vous ne pouvez pas voir le <strong> Réinitialiser </strong> bouton… </p> <p> 1. Ouvrez le <strong> Paramètres additionnels </strong> . <br> 2. Cliquez sur <strong> Réinitialiser les appareils </strong> dans les options des propriétés de la souris. </p> <p><img src=\"images/image_thumb-33-928.png\" alt=\"reset touchpad settings windows 10\" loading=\"lazy\"></p> <h3> Méthode 3. Désinstallez et réinstallez le pilote de périphérique Touchpad. </h3> <p> Une autre solution pour résoudre les problèmes de pavé tactile dans Windows 10 consiste à désinstaller et réinstaller complètement les pilotes du pavé tactile. </p> <p> 1. Ouvrir <strong> Gestionnaire de périphériques </strong> . Pour faire ça: </p> <blockquote><p> 1. Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-140.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Dans la case &quot;Ouvrir&quot;, saisissez : <strong> devmgmt.msc </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-5-568.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Développez Souris et autres périphériques de pointage. <br> 3. <strong> Clic-droit </strong> sur le <strong> Pavé tactile </strong> appareil et cliquez sur <strong> Désinstaller. </strong></p> <blockquote> <p><img src=\"images/image_thumb-34-656.png\" alt=\"uninstall touchpad windows 10\" loading=\"lazy\"></p> </blockquote> <p> 4. Après le redémarrage, attendez 4 à 5 minutes que Windows réinstalle le pilote du pavé tactile et vérifiez si votre pavé tactile fonctionne. Si votre pavé tactile ne fonctionne plus, essayez d&#39;installer son pilote à partir du site d&#39;assistance du fabricant de votre ordinateur portable. </p> <h3> Méthode 4. Désactivez et activez le pavé tactile dans le BIOS. * </h3> <p> * Remarque : cette méthode ne s&#39;applique pas à tous les modèles d&#39;ordinateurs portables, mais je sais qu&#39;elle fonctionne sur de nombreux ordinateurs portables ASUS. </p> <p> 1. Arrêtez complètement votre ordinateur portable en appuyant sur la touche SHIFT et en la maintenant enfoncée tout en cliquant <strong> Démarrer </strong> &gt; <strong> Pouvoir </strong> &gt; <strong> Fermer </strong><br> 2. Allumez l&#39;ordinateur portable et appuyez sur la touche de fonction correspondante pour entrer dans les paramètres du BIOS. (par exemple F2, F10, etc.), <br> 3. Dans les paramètres du BIOS, vérifiez s&#39;il existe un paramètre pour le pavé tactile ou le périphérique de pointage interne ou le périphérique Trackpad (généralement, ce paramètre se trouve dans &#39; <strong> Avancée </strong> &#39; section). Le cas échéant, <strong> Désactiver </strong> les <strong> appareil à pavé tactile </strong> et <strong> Sauvegarder et quitter </strong> à partir des paramètres du BIOS. <br> 4. Laissez Windows 10 se charger. <br> 5. Éteignez et rallumez votre ordinateur portable. <br> 6. Entrez à nouveau dans les paramètres du BIOS et <strong> activer le pavé tactile </strong> &amp; <strong> Enregistrer et quitter </strong> . <br> 7. Après avoir démarré sous Windows 10, le pavé tactile devrait fonctionner. </p> <p><strong> Conclusion: </strong> Si, après les étapes ci-dessus, votre pavé tactile ne fonctionne toujours pas, cela indique un problème matériel. Dans ce cas, utilisez une souris externe ou rendez-vous dans un atelier de réparation d&#39;ordinateurs portables pour réparer le pavé tactile. </p> <p> C&#39;est tout les gens ! Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}