{"title":"CORRECTIF : le programme ne peut pas démarrer car VCRUNTIME140.DLL est manquant (résolu)","content":"<p> Ce tutoriel contient des instructions pour corriger l&#39;erreur suivante au démarrage de Windows 10 ou lorsque vous essayez d&#39;exécuter ou d&#39;installer un programme : « Le programme ne peut pas démarrer car VCRUNTIME140.dll est absent de votre ordinateur. Essayez de réinstaller le programme pour résoudre ce problème ». </p> <p><img src=\"images/image_thumb-31-814.png\" alt=\"FIX Program can’t start because VCRUNTIME140.DLL is missing\" loading=\"lazy\"></p> <p> </p> <p> Le fichier &quot;VCRUNTIME140.dll&quot; fait partie de Microsoft Visual C++ 2015 et est requis par les applications développées à l&#39;aide de Visual Studio 2015. Si le fichier &quot;VCRUNTIME140.dll&quot; est manquant ou corrompu, le système affiche le &quot;VCRUNTIME140.DLL est manquant&quot; chaque fois que le fichier &quot;VCRUNTIME140.DLL&quot; est requis pour exécuter une application. </p> <h4> Comment CORRIGER : VCRUNTIME140.DLL est manquant. </h4> <p> 1. Téléchargez le <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=52685\" target=\"_blank\" rel=\"nofollow noopener\"> Package redistribuable Microsoft Visual C++ 2015 </a> . </p> <p><img src=\"images/image_thumb-32-401.png\" alt=\"fix VCRUNTIME140.DLL is missing\" loading=\"lazy\"></p> <p> </p> <p> 2. A l&#39;écran suivant, sélectionnez selon votre architecture Windows (32 ou 64 bits), le fichier &quot;vc_redist.exe&quot; correspondant à télécharger (ou téléchargez les deux fichiers si vous n&#39;êtes pas sûr). </p> <p><img src=\"images/image_thumb-33-787.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Une fois le téléchargement terminé, double-cliquez sur &quot;vc_redist.exe&quot; que vous avez téléchargé. <br> 4. <strong> J&#39;accepte </strong> les termes de la licence et cliquez sur <strong> Installer </strong> . </p> <p><img src=\"images/image_thumb-34-802.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître ce problème. </p>"}