{"title":"CORRECTIF : ERREUR FATAL VIDEO DXGKRNL dans Windows 10 (résolu)","content":"<p> Si vous rencontrez l&#39;erreur d&#39;écran bleu &quot;VIDEO DXGKRNL FATAL ERROR&quot; dans Windows 10, suivez les instructions ci-dessous pour résoudre le problème. </p> <p> L&#39;erreur BSOD de Windows 10 &quot; <em> Votre PC a rencontré un problème et doit redémarrer. Nous collectons simplement des informations sur les erreurs, puis nous redémarrerons pour vous. Si vous souhaitez en savoir plus, vous pouvez rechercher en ligne plus tard cette erreur : VIDEO DXGKRNL FATAL ERROR&quot;, </em> indique généralement un problème avec les pilotes vidéo. </p> <p><img src=\"images/image_thumb-7-129.png\" alt=\"FIX: VIDEO DXGKRNL FATAL ERROR in Windows 10\" loading=\"lazy\"></p> <p> Ce didacticiel contient des instructions pas à pas pour résoudre l&#39;erreur d&#39;écran bleu « VIDEO DXGKRNL FATAL ERROR » dans Windows 10. </p> <h2> Comment CORRIGER : ERREUR FATAL DXGKRNL VIDÉO Windows 10. </h2> <h3> Étape 1. Corrigez l&#39;ERREUR FATAL VIDEO DXGKRNL en désinstallant/réinstallant les pilotes vidéo. </h3> <p> 1. Ouvrir <strong> Gestionnaire de périphériques </strong> . Pour faire ça: </p> <ol> <li> <ol> <li> Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-153.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. </li> <li> Dans la case &quot;Ouvrir&quot;, tapez : <strong> devmgmt.msc </strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </li> </ol> </li> </ol> <blockquote> <p><img src=\"images/image_thumb-5-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p></blockquote> <p> 2. <strong> Développer </strong> les <strong> Prises d&#39;écran. <br> </strong> 3. <strong> Clic-droit </strong> sur le ou les adaptateurs d&#39;affichage installés et sélectionnez <strong> Désinstaller l&#39;appareil. </strong></p> <p><img src=\"images/image_thumb-46-240.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. A la fenêtre suivante, si vous avez l&#39;option : &quot; <strong> Supprimer le logiciel pilote pour cet appareil </strong> &quot;, sélectionnez-le puis cliquez sur <strong> d&#39;accord </strong> pour supprimer les pilotes installés de l&#39;ordinateur. </p> <p> 5. Après la désinstallation, <strong> redémarrer </strong> votre ordinateur et accédez à <strong> Gestionnaire de périphériques </strong> de nouveau. <br> 6. Faites un clic droit sur le nom de l&#39;ordinateur (en haut) et sélectionnez <strong> Recherchez les modifications matérielles. </strong></p> <p><img src=\"images/image_thumb-8-911.png\" alt=\"Scan for hardware changes\" loading=\"lazy\"></p> <p> </p> <p> 7. Laissez Windows détecter et installer les pilotes d&#39;affichage, puis <strong> redémarrer </strong> à nouveau votre ordinateur et vérifiez si le message &quot;VIDEO DXGKRNL FATAL ERROR&quot; persiste. * </p> <p> * Remarque : Si Windows ne peut pas installer automatiquement les pilotes d&#39;affichage automatiquement ou si vous rencontrez toujours l&#39;erreur d&#39;écran bleu, passez à l&#39;étape suivante. </p> <p> </p> <h3><br clear=\"all\"> Étape 2. Réinstallez les pilotes vidéo à partir du site du fabricant. </h3> <p> 1. Accédez à <strong> Gestionnaire de périphériques </strong> et <strong> désinstaller </strong> l&#39;adaptateur d&#39;affichage installé. * </p> <p> * Remarque : Si vous possédez un ordinateur portable avec deux (2) adaptateurs d&#39;affichage, désinstallez-les tous les deux. </p> <p> 2. Accédez au site d&#39;assistance du fabricant de votre ordinateur (ou de votre carte graphique) et téléchargez les derniers pilotes pour votre ou vos cartes graphiques. </p> <ul> <li> <ul> <li> Pour <strong> NVIDIA </strong> GPU basés, accédez à <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Page de recherche avancée de pilotes NVIDIA </a> . </li> <li> Pour <strong> DMLA </strong> GPU basés, accédez à <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Centre de téléchargement de pilotes AMD (ATI). </a></li> <li> Pour <strong> Intelligence </strong> GPU basés, accédez à <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Centre de téléchargement des graphiques Intel. </a></li> </ul> </li> </ul> <p> 3. Continuez et installez le pilote téléchargé. * </p> <p><strong> * Note importante: </strong> Si vous possédez un ordinateur portable avec deux (2) adaptateurs d&#39;affichage, commencez par installer les pilotes pour l&#39;AMD ou l&#39;adaptateur NVIDIA et redémarrez votre ordinateur portable. Après le redémarrage, continuez et installez les pilotes de la carte graphique INTEL, puis redémarrez votre ordinateur portable. </p> <p> 4. Après l&#39;installation, <strong> redémarrer </strong> votre PC et vérifiez si l&#39;ERREUR FATAL VIDEO DXGKRNL est résolue. Sinon, passez à l&#39;étape suivante. </p> <p> </p> <h3><br clear=\"all\"> Étape 3. Réparez DirectX pour corriger VIDEO DXGKRNL FATAL ERROR. </h3> <p> L&#39;ERREUR FATAL VIDEO DXGKRNL, indique un problème sur les pilotes DirectX de Microsoft. Alors, procédez à la réparation DirectX. </p> <p> 1. Téléchargez le <a href=\"https://www.microsoft.com/en-us/download/details.aspx?displaylang=en&id=35\" target=\"_blank\" rel=\"nofollow noopener\"> Programme d&#39;installation Web d&#39;exécution de l&#39;utilisateur final DirectX </a> . <br> 2. Exécutez le fichier téléchargé (dxwebsetup.exe) et suivez les invites à l&#39;écran pour installer les composants facultatifs de DirectX Runtime. </p> <p><img src=\"images/image_thumb-9-847.png\" alt=\"Install DirectX Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Lorsque l&#39;installation est terminée <strong> redémarrer </strong> votre ordinateur. </p> <p> 4. Après le redémarrage, accédez à <strong> Démarrer <img src=\"images/image_thumb-55-571.png\" alt=\"image\" loading=\"lazy\"> -&gt; Paramètres </strong> -&gt; <strong> Mise à jour et sécurité -&gt; </strong> et cliquez <strong> Vérifiez les mises à jour. </strong></p> <p><img src=\"images/image_thumb-76-281.png\" alt=\"Windows 10 - Check For Updates \" loading=\"lazy\"></p> <p> 5. Après l&#39;installation des mises à jour, redémarrez votre PC et vérifiez si l&#39;erreur BSOD est résolue. Sinon, passez à l&#39;étape suivante. </p> <p> </p> <h3><br clear=\"all\"> Étape 4. Réparez les fichiers système de Windows 10. </h3> <p> 1. Ouvrir <strong> Invite de commandes en tant qu&#39;administrateur </strong> . <br> 2. Dans l&#39;invite de commande, donnez la commande suivante et appuyez sur <strong> Entrer: </strong></p> <ul> <li><strong> DISM.exe /En ligne /Cleanup-image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-176.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Lorsque l&#39;opération DISM est terminée, tapez la commande suivante et appuyez sur <strong> Entrer </strong> : </p> <ul> <li><strong> sfc/scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-464.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Attendez maintenant que le vérificateur de fichiers système répare les fichiers système Windows. <br> 5. Lorsque cela est fait, <strong> redémarrer </strong> votre ordinateur et vérifiez si l&#39;erreur persiste. </p> <p> </p> <h3><br clear=\"all\"> Étape 5. Analysez le fichier journal Minidump (BSOD). </h3> <p> Lorsque Windows se bloque avec un écran bleu, stocke les détails de l&#39;écran BSoD dans de petits fichiers, appelés &quot; <strong> MiniDump </strong> &quot;. L&#39;analyse de la <strong> Minidump </strong> fichier(s) peut vous aider à dépanner et à résoudre le problème ERREUR FATAL VIDEO DXGKRNL écran bleu. Pour accomplir cette tâche, suivez les instructions de cet article : <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment analyser les fichiers MiniDump avec BlueScreenView </a> . </p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}