{"title":"CORRECTIF: VeraCrypt ne répond pas (gel) lors du démontage dans Windows 10 (résolu)","content":"<p> Ce guide contient des instructions pour résoudre le problème suivant avec VeraCrypt sur un ordinateur Windows 10 : VeraCrypt ne répond pas et se bloque (se bloque) lors du démontage du volume chiffré. </p> <p> VeraCrypt Not Responding (Freezing) issue in details: Lorsque vous essayez de démonter un volume (avec tous les fichiers fermés du volume monté), VeraCrypt se bloque et affiche &quot;Not Responding&quot;. Lorsque ce problème apparaît, le seul moyen de restaurer Windows à un état normal consiste à mettre fin au processus VeraCrypt à partir du Gestionnaire des tâches. </p> <p> Selon <a href=\"https://www.veracrypt.fr/en/Issues%20and%20Limitations.html\" target=\"_blank\" rel=\"nofollow noopener\"> VeraCrypt </a> le problème de gel est causé par un conflit entre la boîte de dialogue d&#39;attente VeraCrypt affichée pendant les opérations de montage/démontage et d&#39;autres logiciels installés sur la machine (par exemple, un antivirus ou un pare-feu). </p> <h4> Résoudre le problème : VeraCrypt ne répond pas au démontage/montage du volume. </h4> <p> Ce problème est causé par un conflit entre la boîte de dialogue d&#39;attente VeraCrypt affichée pendant les opérations de montage/démontage et d&#39;autres logiciels installés sur la machine (par exemple, Outpost Firewall Pro). </p> <p> 1. De VeraCrypt <strong> Paramètres </strong> menu, sélectionnez <strong> Préférences </strong> . </p> <p><img src=\"images/image_thumb-63-122.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Vérifier </strong> les <strong> Ne pas afficher la boîte de dialogue de message d&#39;attente lors de l&#39;exécution d&#39;opérations </strong> option clic <strong> D&#39;ACCORD. </strong></p> <p><img src=\"images/image_thumb-64-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Procédez maintenant au montage/démontage des volumes sans geler ! </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}