{"title":"CORRECTIF : Échec de l&#39;installation de la mise à jour Windows 10 Erreur 0x800711C7 – 0x2000A (Résolu)","content":"<p> Ce didacticiel contient des instructions pour corriger l&#39;erreur de mise à niveau de Windows 10 0x800711C7 – 0x2000A : &quot;L&#39;installation a échoué dans la phase SAFE_OS avec une erreur lors de PREPARE_FIRST_BOOT&quot;. </p> <p> </p> <p><img src=\"images/image_thumb-51-797.png\" alt=\"FIX Error 0x800711C7 - 0x2000A installation failed in the SAFE_OS phase during PREPARE_FIRST_BOOT\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Problème de mise à niveau de Windows 10 0x800711C7 - 0x2000A en détails : lorsque vous essayez de mettre à niveau Windows 10 vers la dernière version (build), l&#39;installation s&#39;arrête avec l&#39;erreur &quot;Nous n&#39;avons pas pu installer Windows 10 - 0x800711C7 - 0x2000A - L&#39;installation a échoué dans la phase SAFE_OS une erreur lors de PREPARE_FIRST_BOOT&quot;, puis revient à la version précédente de Windows. </p> <h4> Comment réparer l&#39;erreur d&#39;installation de la mise à jour Windows 10 v1809 0x800711C7 - 0x2000A </h4> <p> </p> <h6> Méthode 1. Désactivez Device Guard à partir de PowerShell. </h6> <p> L&#39;erreur 0x800711C7 - 0x2000A dans la mise à niveau de Windows 10, apparaît dans les systèmes avec le &quot; <a href=\"https://techcommunity.microsoft.com/t5/iis-support-blog/windows-10-device-guard-and-credential-guard-demystified/ba-p/376419\" target=\"_blank\" rel=\"nofollow noopener\"> Protection de l&#39;appareil </a> &quot; activé, la première méthode pour résoudre l&#39;erreur 0x800711C7 - 0x2000A dans la mise à jour de Windows 10 consiste donc à désactiver Device Guard sur votre système. </p> <p> 1. Continuez et téléchargez le <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=53337\" target=\"_blank\" rel=\"nofollow noopener\"> Outil de préparation matérielle Device Guard et Credential Guard </a> de Microsoft. <br> 2. Une fois le téléchargement terminé, extrayez le fichier &quot;dgreadiness&quot;_v3.6.zip. <br> 3. Ouvrez le dossier extrait et dans le menu Fichier, choisissez Ouvrir Windows PowerShell en tant qu&#39;administrateur. </p> <p><img src=\"images/image_thumb-52-765.png\" alt=\"FIX Error 0x800711C7 - 0x2000A Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Sur PowerShell, tapez la commande suivante pour <strong> autoriser (définir) la politique d&#39;exécution à exécuter des scripts </strong> (Presse <strong> UNE </strong> lorsqu&#39;on lui a demandé de modifier la politique d&#39;exécution). </p> <ul> <li> Set-ExecutionPolicy Unrestricted </li> </ul> <p> 5. Ensuite, donnez cette commande à <strong> désactiver </strong> les <strong> Protection de l&#39;appareil </strong> et le <strong> Garde d&#39;accréditation </strong> : </p> <ul> <li> .\\DG_Readiness_Tool_v3.6 -Désactiver </li> </ul> <p><img src=\"images/image_thumb-53-648.png\" alt=\"Disable Device Guard and Credential Guard Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Après l&#39;exécution de la commande, <strong> redémarrer </strong> l&#39;ordinateur. <br> 7. Essayez de mettre à jour Windows 10. * </p> <p> * Remarque : Après la mise à jour de Windows 10, suivez la même procédure pour activer Device Guard et Credential Guard, avec ces commandes : </p> <ul> <li> Set-ExecutionPolicy Unrestricted </li> <li> .\\DG_Readiness_Tool_v3.6 -Activer </li> </ul> <p> </p> <h6> Méthode 2. Désactivez Hyper-V à partir de l&#39;invite de commande. </h6> <p> La méthode suivante pour résoudre l&#39;erreur 0x800711C7 - 0x2000A dans la mise à niveau de Windows 10 consiste à désactiver l&#39;hyperviseur au démarrage de Windows. </p> <p> 1. Ouvrir <strong> invite de commande en tant qu&#39;administrateur </strong> . <br> 2. Tapez la commande suivante pour désactiver Hyper-V au démarrage de Windows. </p> <ul> <li> bcdedit /set hypervisorlaunchtype off </li> </ul> <p><img src=\"images/image_thumb-50-768.png\" alt=\"Disable Hyper-V Command Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Redémarrer </strong> votre ordinateur. <br> 4. Essayez d&#39;installer la mise à jour.* </p> <p> * Remarque : après la mise à jour de Windows 10, donnez la commande suivante pour démarrer automatiquement Hypervisor au démarrage de l&#39;ordinateur : </p> <ul> <li> bcdedit /set hypervisorlaunchtype auto </li> </ul> <p> </p> <h6> Méthode 3. Désactivez le démarrage sécurisé à partir des paramètres du BIOS. </h6> <p> Une autre cause de l&#39;erreur de mise à jour Windows 10 0x800711C7 - 0x2000A est le démarrage sécurisé. Alors, continuez et désactivez le démarrage sécurisé à partir des paramètres du BIOS. Pour faire ça: </p> <p> 1. Allumez votre système et appuyez immédiatement sur la touche correspondante* pour entrer dans <strong> CONFIGURATION DU BIOS. </strong></p> <p> </p> <p> * Remarque : généralement pour entrer dans le BIOS, vous devez appuyer sur le bouton <strong> DEL </strong> ou alors <strong> F1 </strong> ou alors <strong> F2 </strong> ou la <strong> F10 </strong> clé. (dépend du fabricant) </p> <p> 2. Regardez <strong> Sécurité </strong> ou à <strong> Options de démarrage, </strong> ou à <strong> Authentification </strong> paramètres,* pour trouver le <strong> Démarrage sécurisé </strong> option et <strong> Désactiver </strong> il <strong> . </strong></p> <p> * Remarques: <br> 1. L&#39;emplacement du paramètre « Démarrage sécurisé » dans le BIOS dépend du fabricant de l&#39;appareil. <br> 2. Si vous ne trouvez pas le paramètre &#39;Secure Boot&#39;, alors <strong> Désactiver </strong> les <strong> Assistance CSM </strong> et alors <strong> Sauvegarder et quitter </strong> forme la configuration du BIOS. Ensuite, entrez à nouveau dans la configuration du BIOS pour trouver le démarrage sécurisé. </p> <p><img src=\"images/image_thumb-23-385.png\" alt=\"Disable Secure Boot\" loading=\"lazy\"></p> <p> 3. <strong> Sauvegarder </strong> paramètres et <strong> SORTIR </strong> Configuration du BIOS. <br> 4. Laissez Windows démarrer normalement et essayez d&#39;installer la mise à jour. Si la mise à jour échoue à nouveau, réactivez le « démarrage sécurisé » et passez à la méthode suivante. </p> <p> </p> <h6> Méthode 4. Mettez à jour Windows 10 à l&#39;aide de l&#39;assistant de mise à jour </h6> <p> 1. Accédez à <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Site de téléchargement de Windows 10 </a> et cliquez sur le <strong> Mettez à jour maintenant </strong> bouton. </p> <p><img src=\"images/image_thumb_thumb-680.png\" alt=\"Update Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Enregistrez le fichier &quot;Windows10Upgrade9252.exe&quot; sur votre bureau. <br> 3. Double-cliquez sur le fichier téléchargé pour ouvrir le <strong> Assistant de mise à niveau Windows </strong> . <br> 4. Cliquez sur <strong> Mettez à jour maintenant </strong> pour lancer la mise à jour. </p> <p><img src=\"images/image_thumb4_thumb-918.png\" alt=\"Windows 10 Update Assistant\" loading=\"lazy\"></p> <p> 5. Laissez Windows terminer le téléchargement et la vérification. <br> 6. Lorsque la vérification atteint 100 %, <strong> déconnectez votre ordinateur d&#39;Internet </strong> , ou réglez-le sur &quot; <strong> Mode avion </strong> &quot;. <br> 7. Attendez que Windows mette à jour votre système. <br> 8. Lorsque vous y êtes invité, redémarrez votre système pour installer la mise à jour. </p> <p> </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}