{"title":"CORRECTIF : votre ordinateur n&#39;a pas pu se connecter à une autre session de console car vous avez déjà une session de console en cours. (Résolu)","content":"<p> Sur un ordinateur Windows, l&#39;erreur suivante apparaît dans Connexion Bureau à distance : « Votre ordinateur n&#39;a pas pu se connecter à la session de console sur l&#39;ordinateur distant car vous avez déjà une session de console en cours ». </p> <p> </p> <p><img src=\"images/image_thumb-3-627.png\" alt=\"Your computer could no connect to console session on the remote computer because you already have a console session in progress.\" loading=\"lazy\"></p> <p> </p> <p> Ce didacticiel contient des instructions pour résoudre l&#39;erreur de connexion Bureau à distance suivante : « Votre ordinateur n&#39;a pas pu se connecter à la session de console sur l&#39;ordinateur distant car vous avez déjà une session de console en cours ». </p> <h4> Comment CORRIGER : la connexion Bureau à distance n&#39;a pas pu se connecter car vous avez déjà une session de console en cours. </h4> <p> L&#39;erreur &quot;Votre ordinateur n&#39;a pas pu se connecter à la session de console sur l&#39;ordinateur distant car vous avez déjà une session de console en cours&quot;, est due au fait que l&#39;une des cartes réseau de votre ordinateur (RDP de), a la même adresse IP que l&#39;ordinateur auquel vous essayez de vous connecter, via le bureau à distance. </p> <p> Par exemple : si l&#39;ordinateur distant a l&#39;adresse IP : « 192.168.1.157 », suivez les étapes ci-dessous : </p> <p> 1. Ouvrir <strong> Invite de commandes en tant qu&#39;administrateur </strong> sur votre ordinateur (RDP de). <br> 2. Donnez la commande suivante pour afficher les adresses IPv4 attribuées sur votre PC. </p> <ul> <li><strong> ipconfig </strong></li> </ul> <p> </p> <p> 3. Localisez maintenant quelle carte réseau sur votre ordinateur local (RDP à partir de) a la même adresse IP que l&#39;ordinateur distant (RDP vers). <br> 4. Lorsque vous trouvez quelle carte LAN sur votre ordinateur local a la même adresse IP que l&#39;ordinateur distant, continuez et remplacez l&#39;adresse IP de cette carte par une autre. * </p> <p> par exemple. Dans cet exemple, l&#39;adresse IP de l&#39;ordinateur distant est : &quot;192.168.1.157&quot;, nous devons donc changer l&#39;adresse IP de l&#39;adaptateur Ethernet (sur l&#39;ordinateur local) pour une autre : par ex. à : &quot;192.168.1.160&quot;. </p> <p><img src=\"images/image_thumb-5-946.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> * Remarque : Si l&#39;adresse IP de votre réseau local est attribuée par un serveur DHCP, vous disposez des options suivantes pour contourner le problème : </p> <blockquote><p> une. Pour spécifier manuellement une adresse IP statique différente. <br> b. Redémarrer votre routeur (serveur DHCP), afin de &quot;prendre&quot; une adresse IP différente du serveur DHCP. <br> c. Pour configurer le serveur DHCP (par exemple sur le routeur), pour donner des adresses IP à une plage qui n&#39;inclut pas l&#39;adresse IP de l&#39;ordinateur distant. (par exemple &quot;192.168.1.200-192.168.1.250&quot; </p></blockquote> <p> </p> <p> 5. Après avoir modifié l&#39;adresse IP sur votre ordinateur local (RDP à partir de), ouvrez la connexion Bureau à distance et essayez de vous connecter à l&#39;ordinateur distant. L&#39;erreur &quot;Votre ordinateur n&#39;a pas pu se connecter à une autre session de console car vous avez déjà une session de console en cours&quot; devrait être résolue. </p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? </p> <p> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}