{"title":"CORRECTIF : problème de fond d&#39;écran dans Windows 7 (résolu)","content":"<p> Ce didacticiel contient des instructions pour résoudre le problème du papier peint noir lorsque l&#39;image d&#39;arrière-plan est définie sur « Stretch » dans le système d&#39;exploitation Windows 7. Le problème du papier peint noir peut apparaître sur les ordinateurs Windows 7 après l&#39;installation de la mise à jour du 14 janvier 2020—KB4534310. </p> <p><img src=\"images/image_thumb-16-423.png\" alt=\"FIX: Back Wallpaper issue in Windows 7\" loading=\"lazy\"></p> <p> Le problème de fond noir de Windows 7 est un bogue connu après l&#39;installation du <a href=\"http://www.catalog.update.microsoft.com/Search.aspx?q=KB4534310\" target=\"_blank\" rel=\"nofollow noopener\"> mettre à jour KB4534310 </a> et comme Microsoft <a href=\"https://support.microsoft.com/en-us/help/4534310/windows-7-update-kb4534310\" target=\"_blank\" rel=\"nofollow noopener\"> dit </a> : « Nous travaillons sur une résolution et fournirons une mise à jour dans une prochaine version, qui sera diffusée à tous les clients exécutant Windows 7 et Windows Server 2008 R2 SP1. </p> <p> Si vous souhaitez résoudre le problème du &quot;fond d&#39;écran noir&quot;, jusqu&#39;à ce que Microsoft publie une mise à jour pour le résoudre, suivez les instructions ci-dessous. </p> <h4> Comment RÉSOUDRE le problème de fond d&#39;écran noir dans Windows 7. </h4> <h6> Méthode 1. Désinstallez la mise à jour KB4534310. </h6> <p> La première méthode pour résoudre les problèmes de papier peint noir dans Windows 7 consiste à supprimer la mise à jour KB4534310.* </p> <p> * Remarque : Étant donné que la mise à jour KB4534310 inclut des améliorations de sécurité et des correctifs pour Windows 7, il n&#39;est pas conseillé de la désinstaller. Nous vous suggérons donc de résoudre le problème en suivant les instructions sur <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Méthode-2 </a> au dessous de. </p> <p> Pour désinstaller la mise à jour KB4534310 : </p> <p> 1. Cliquez avec le bouton droit sur le <strong> Démarrer </strong> menu <img src=\"images/image_thumb-38-451.png\" alt=\"image\" loading=\"lazy\"> et choisissez <strong> Panneau de commande </strong> . <br> 2. Réglez le <strong> Afficher par : à Petites icônes </strong> et cliquez <strong> Programme et fonctionnalités. </strong></p> <p><img src=\"images/image_thumb-51-750.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 3. Cliquez sur <strong> Afficher les mises à jour installées </strong> sur le volet de gauche. </p> <p> </p> <p><img src=\"images/image_thumb-52-942.png\" alt=\"uninstall updates windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Dans la zone de recherche, tapez &quot; <strong> KB4534310 </strong> &quot; et appuyez sur Entrée. <br> 5. Mettez en surbrillance la &quot;Mise à jour de sécurité pour Microsoft Windows (KB4534310)&quot; et cliquez sur <strong> Désinstaller </strong> . </p> <p><img src=\"images/image_thumb-12-776.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Méthode 2. Changez la position de l&#39;image autre que &quot;Stretch&quot;. </h6> <p> Le problème du papier peint noir dans Windows 7 n&#39;apparaît que lorsque l&#39;image d&#39;arrière-plan sélectionnée est étirée. Ainsi, la méthode suivante pour résoudre le problème consiste à définir une autre position d&#39;image pour l&#39;image d&#39;arrière-plan. Pour faire ça: </p> <p> 1. Faites un clic droit sur votre bureau et cliquez sur <strong> Personnaliser </strong> . </p> <p><img src=\"images/image_thumb-17-501.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Cliquez sur <strong> Fond d&#39;écran </strong></p> <p><img src=\"images/image_thumb-14-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Maintenant, appliquez les actions suivantes : </p> <p> une. À l&#39;emplacement de l&#39;image, sélectionnez <strong> Bibliothèque d&#39;images. </strong><br> b. Sélectionnez l&#39;image que vous voulez pour l&#39;arrière-plan, ou toute autre image/photo personnalisée qui correspond à la résolution de votre écran. * </p> <blockquote> <p> * Astuce : Pour connaître la résolution d&#39;écran actuelle, faites un clic droit sur Bureau et cliquez sur <strong> Résolution d&#39;écran </strong> . </p> </blockquote> <p> c. À <strong> Position de l&#39;image </strong> , sélectionnez n&#39;importe quelle autre option sauf &quot; <strong> S&#39;étirer </strong> &quot;, comme « Remplir », « Ajuster », « Mosaïque » ou « Centrer ». <br> ré. Une fois terminé, cliquez sur Enregistrer <strong> changements </strong> . </p> <p><img src=\"images/image_thumb-15-519.png\" alt=\"image\" loading=\"lazy\"></p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}