{"title":"CORRUPTION: CORRUPTION DE MÉMOIRE DÉTECTÉE DE PISCINE SPÉCIALE causée par ntoskrnl.exe BSOD 0x000000c1 (Résolu)","content":"<p> Sur un ordinateur Windows 10, l&#39;erreur BSOD suivante apparaît : &quot;SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION, causée par le fichier ntoskrnl.exe avec le code d&#39;erreur 0x000000c1. L&#39;erreur de vérification de bogue &quot;0x000000c1 - SPECIAL POOL DETECTED MEMORY CORRUPTION&quot; est généralement causée par un logiciel ou un périphérique installé. pilote et n&#39;est pas dû à un problème matériel. </p> <p><strong> CORRUPTION DE MÉMOIRE SPÉCIALE DÉTECTÉE DE PISCINE, code de vérification de bogue 0x000000c1 Erreur BSOD dans les détails : </strong><br> &quot; <em> Un problème a été détecté et Windows a été arrêté pour éviter tout dommage <br> à ton ordinateur. <br> </em><em> Le problème semble être causé par le fichier suivant : ntoskrnl.exe <br> SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION <br> ….. <br> *** ARRÊT : 0x000000c1 (0xfffff30dd554cfc0, 0xfffff30dd554c22c, 0x0000000000034038, <br> 0x0000000000000032) </em></p> <p><em> *** ntoskrnl.exe – Adresse 0xfffff803c544aca0 base à 0xfffff803c52a2000 DateStamp <br> 0x5b63c7b5&quot; </em></p> <p><img src=\"images/image_thumb-1-562.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Ce didacticiel contient des instructions détaillées pour résoudre l&#39;erreur d&#39;écran bleu 0x000000c1 - CORRUPTION DE MÉMOIRE SPÉCIALE DÉTECTEE DE PISCINE causée par le fichier &quot;ntoskrnl.exe&quot;. </p> <p> </p> <h2> Comment réparer STOP 0x000000C1 : CORRUPTION DE LA MÉMOIRE SPÉCIALE DÉTECTÉE DU POOL CAUSÉ PAR NTOSKENL.EXE. </h2> <p> Le problème d&#39;écran bleu &quot;Stop 0x000000C1: SPECIAL POOL DETECTED MEMORY CORRUPTION&quot; peut être causé pour plusieurs raisons, par ex. pilotes de périphériques défectueux, fichiers système corrompus, attaques de virus ou à partir d&#39;un programme qui s&#39;exécute en arrière-plan. Pour résoudre le problème, suivez les méthodes ci-dessous : </p> <h6> Méthode 1. Analysez votre système à la recherche de virus et de logiciels malveillants. </h6> <p> La première étape pour résoudre les problèmes d&#39;écran bleu &quot;SPECIAL POOL DETECTED MEMORY CORRUPTION&quot; est de s&#39;assurer que votre système est exempt de virus/programmes malveillants. Pour cette tâche, suivez les instructions de ce guide : <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment analyser votre ordinateur contre les virus et autres programmes malveillants. </a></p> <p> </p> <h6> Méthode 2. Désinstallez votre logiciel antivirus/de sécurité. </h6> <p> &quot;Le problème d&#39;écran bleu &quot;SPECIAL POOL DETECTED MEMORY CORRUPTION&quot; peut survenir après la mise à jour automatique de votre programme antivirus/sécurité (surtout si vous utilisez AVAST ou AVG). Alors, continuez et désinstallez complètement votre programme antivirus de votre système et redémarrez votre ordinateur. <br> – Si le problème BSOD ne se produit pas après la suppression de l&#39;antivirus, procédez au téléchargement et à la réinstallation de la dernière version de votre logiciel de sécurité sur votre système. </p> <p> </p> <h6> Méthode 3. Démarrez Windows en mode Clean Boot. </h6> <p> La méthode suivante, pour résoudre le problème BSOD &quot;SPECIAL POOL DETECTED MEMORY CORRUPTION&quot;, consiste à démarrer Windows dans un <a href=\"https://www.repairwin.com/how-to-start-windows-in-clean-boot-state/\" target=\"_blank\" rel=\"nofollow noopener\"> &quot; démarrage propre </a> &quot;, afin d&#39;identifier quel programme fait planter votre système. </p> <p> Pour démarrer Windows en mode Clean Boot : </p> <p> 1. Appuyez sur le bouton Windows <img src=\"images/image_thumb8_thumb_thumb-465.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 2. Tapez <strong> msconfig </strong> et appuyez sur <strong> Entrer </strong> . </p> <p><img src=\"images/image_thumb-47-632.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. Dans l&#39;onglet Services, <strong> cacher tous les services Microsoft </strong> case à cocher, puis appuyez sur la <strong> Désactiver tous les </strong> bouton, pour empêcher tous les services non Microsoft de démarrer au démarrage de Windows. </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-480.png\" alt=\"clean boot state\" loading=\"lazy\"></p> <p> 4. Sélectionnez ensuite le <strong> Commencez </strong> onglet et <strong> Désactiver </strong> tous les autres programmes qui démarrent au démarrage de Windows et s&#39;exécutent en arrière-plan. * </p> <p> * Remarque : Activé <strong> Windows 10 </strong> ou alors <strong> 8 </strong> , sélectionnez <strong> Ouvrir le gestionnaire de tâches </strong> afin de désactiver les programmes de démarrage. </p> <p><img src=\"images/image_thumb-29-570.png\" alt=\"Windows clean boot\" loading=\"lazy\"></p> <p> </p> <p> 5. Une fois terminé, cliquez sur <strong> d&#39;accord </strong> et <strong> Redémarrer </strong> ton ordinateur. <br> 6. Si, après le redémarrage, votre ordinateur fonctionne correctement et sans problèmes de BSOD, lancez à nouveau l&#39;utilitaire de configuration du système et activez un par un tous les éléments désactivés et redémarrez votre système, jusqu&#39;à ce que vous trouviez celui qui cause le problème de BSoD. * </p> <p> * Note à <strong> sortir </strong> de <strong> Nettoyer le démarrage </strong> l&#39;état, lancez l&#39;utilitaire de configuration du système et à la <strong> Général </strong> Onglet choisir <strong> Démarrage normal. </strong></p> <p> </p> <h6> Méthode 4. Vérifiez la mémoire (RAM) et le disque dur (HDD) pour les problèmes. </h6> <p> Les problèmes d&#39;écran bleu peuvent être dus à un module de RAM endommagé ou à un mauvais disque dur. Pour tester et diagnostiquer les problèmes des composants de votre RAM et de votre disque dur, suivez les instructions de ces guides : </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment diagnostiquer les problèmes de mémoire de l&#39;ordinateur avec Memtest86+ </a></li> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Meilleurs outils de test et de diagnostic de disque dur pour vérifier la santé du disque dur </a></li> </ul> <p> </p> <p> </p> <h6> Méthode 5. Mettez à jour les pilotes de périphérique. </h6> <p> Dans certains cas, le problème BSOD &quot;SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION causé par le module ntoskrnl.exe&quot; se produit en raison d&#39;un pilote de périphérique invalide ou corrompu. Alors, continuez et mettez à jour les pilotes des périphériques suivants sur votre ordinateur avec cette commande : </p> <p> 1. Adaptateur vidéo (VGA). <br> 2. Jeu de puces. <br> 3. Adaptateur Ethernet. <br> 4. Adaptateur Wi-Fi (le cas échéant). </p> <p> </p> <h6> Méthode 6. <strong> Analysez Minidump. </strong></h6> <p> Lorsque Windows se bloque avec un écran bleu, stocke les détails de l&#39;écran BSoD dans de petits fichiers, appelés &quot; <strong> MiniDump </strong> &quot;. L&#39;analyse de la <strong> Minidump </strong> fichier(s) peut vous aider à dépanner et à résoudre le problème d&#39;écran bleu. Pour accomplir cette tâche, suivez les instructions de cet article : <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment analyser les fichiers MiniDump avec BlueScreenView </a> . </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}