{"title":"Comment contrôler la souris avec le clavier sous Windows 10/8/7.","content":"<p> Ce didacticiel contient des instructions sur la façon de contrôler la souris à l&#39;aide du clavier, en utilisant la fonction &quot;Touches de la souris&quot; dans Windows. L&#39;article peut être utile aux personnes qui ne peuvent pas utiliser la souris ou dans les cas où la souris cesse de fonctionner (ou n&#39;existe pas) et vous souhaitez utiliser votre clavier comme souris.  pour  travailler avec votre ordinateur afin de terminer un travail urgent. </p> <p> le <strong> Touches de la souris </strong> La fonctionnalité est intégrée aux systèmes d&#39;exploitation Windows 10, 7 ou 7 et vous permet d&#39;utiliser le pavé numérique pour déplacer le pointeur de la souris sur l&#39;écran et effectuer toutes les actions habituelles d&#39;une souris (clic, double-clic, clic droit). </p> <h4> Comment utiliser votre clavier comme souris. </h4> <h6> Méthode 1. Activez les touches de la souris à l&#39;aide du raccourci clavier. * </h6> <p> La première méthode pour déplacer le curseur de la souris [sans souris <img src=\"images/wlemoticon-openmouthedsmile-273.png\" alt=\"Open-mouthed smile\" loading=\"lazy\"> ], consiste à activer les touches de la souris, de la manière suivante : </p> <p> 1. Appuyez sur <strong> ALT gauche </strong> + <strong> décalage à gauche </strong> + <strong> Verrouillage numérique </strong></p> <p><img src=\"images/image_thumb-10-220.png\" alt=\"How to Control Mouse with Keyboard \" loading=\"lazy\"></p> <p> </p> <p> 2. Lorsque la fenêtre Touches de la souris apparaît à l&#39;écran, appuyez sur <strong> ENTRER </strong> pour activer les touches souris. </p> <p><img src=\"images/image_thumb-2-595.png\" alt=\"turn on mouse keys\" loading=\"lazy\"></p> <p> 3. Après avoir activé les touches de la souris, vous pouvez utiliser votre clavier (pavé numérique) pour effectuer toutes les actions de la souris (déplacer, cliquer, cliquer avec le bouton droit, double-cliquer) comme indiqué dans la figure ci-dessous. * </p> <p> * Remarque : si vous souhaitez augmenter ou diminuer la vitesse du pointeur, lisez les instructions de la méthode suivante. </p> <p><strong> Fonctions de la souris à partir du pavé numérique </strong></p> <p><img src=\"images/image_thumb-8-332.png\" alt=\"mouse functions numeric keypas\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Méthode 2. Activez les touches de la souris à partir du Centre d&#39;ergonomie. </h6> <p> La deuxième méthode pour pouvoir contrôler le pointeur de la souris avec votre clavier consiste à activer et à configurer la fonction « Touches de la souris » à partir du centre Ease Access. Pour faire ça: </p> <p> 1. Accédez au Panneau de configuration de Windows, définissez l&#39;option « Afficher par » sur <strong> Petites icônes </strong> puis ouvrez le <strong> Centre de facilité d&#39;accès. </strong></p> <p><img src=\"images/image_thumb-3-309.png\" alt=\"use keyboard as mouse\" loading=\"lazy\"></p> <p> </p> <p> 2. Cliquez sur <strong> Rendez la souris plus facile à utiliser. </strong></p> <p><img src=\"images/image_thumb-4-518.png\" alt=\"enable mouse keys - ease of access\" loading=\"lazy\"></p> <p> </p> <p> 3. Cliquez ensuite sur <strong> Configurer les touches de la souris </strong> . </p> <p><img src=\"images/image_thumb-9-206.png\" alt=\"Configure Pointer Speed \" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Maintenant, vérifiez le <strong> Activer les touches de la souris </strong> case et cliquez <strong> Appliquer. </strong><br> <strong> 5. </strong> Essayez maintenant de déplacer le curseur de la souris à l&#39;aide du pavé numérique et configurez le <strong> Vitesse du pointeur </strong> comme tu veux. (Cliquez sur « Appliquer » à chaque modification et sur « OK » pour fermer les options « Touches de la souris ».) </p> <p><img src=\"images/image_thumb-7-340.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}