{"title":"Comment protéger un dossier par mot de passe dans Windows 10 (Verrouiller le dossier avec un mot de passe).","content":"<p> Ce didacticiel contient deux méthodes gratuites et sécurisées différentes pour protéger un dossier par mot de passe sous Windows 10/8/7 OS. Si vous verrouillez un dossier avec un mot de passe, il ne sera accessible à personne d&#39;autre que vous. Protéger un dossier avec un mot de passe est utile dans les cas où vous partagez votre ordinateur avec d&#39;autres et vous ne voulez pas que quelqu&#39;un d&#39;autre accède et lise vos fichiers privés. </p> <ul> <li><strong> Article associé: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment protéger par mot de passe votre PC Windows 10 avec BitLocker </a> . </strong></li> </ul> <h4> Comment verrouiller un dossier avec un mot de passe dans Windows 10. </h4> <h6> Méthode 1. Comment verrouiller et crypter des fichiers avec 7-zip (Windows toutes les versions). </h6> <p> La méthode la plus simple et la plus sûre, pour protéger un dossier avec un mot de passe sous Windows, consiste à utiliser l&#39;utilitaire d&#39;archivage 7-Zip, qui prend également en charge le cryptage. Pour crypter et protéger par mot de passe un dossier/fichier avec 7-zip : </p> <p> 1. Téléchargez et installez le <a href=\"https://www.7-zip.org/\" target=\"_blank\" rel=\"nofollow noopener\"> 7-Zip </a> programme d&#39;archivage. <br> 2. Faites un clic droit sur le dossier (ou fichier) que vous souhaitez protéger avec un mot de passe et choisissez : <strong> 7-Zip </strong> &gt; <strong> Ajouter aux archives </strong> . </p> <p><img src=\"images/image_thumb-28-978.png\" alt=\"How to Password Protect a Folder\" loading=\"lazy\"></p> <p> </p> <p> 3. Dans les options « Ajouter à l&#39;archive », spécifiez un mot de passe fort, puis cliquez sur <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-29-728.png\" alt=\"set password to archive with 7-zip\" loading=\"lazy\"></p> <p> </p> <p> 4. Supprimez ensuite le dossier (ou fichier) non compressé et le tour est joué ! </p> <h6> Méthode 2. Comment chiffrer un dossier avec la protection EFS (Windows Pro et Entreprise). </h6> <p> La protection EFS est un outil de chiffrement intégré, dans les éditions Windows 10 Professionnel et Entreprise. Si vous protégez un dossier ou un fichier avec le cryptage EFS, il est très difficile pour les autres d&#39;accéder aux fichiers cryptés, sans avoir la clé de décryptage (certificat de clé PFX). </p> <p> Le seul inconvénient du cryptage EFS est que le cryptage sera supprimé si vous copiez les fichiers cryptés sur un autre ordinateur du réseau ou si vous envoyez les fichiers cryptés par courrier électronique. </p> <p> De plus, lorsque vous chiffrez vos fichiers EFS, la clé de déchiffrement (certificat) est stockée localement sur votre ordinateur. Cela signifie que toute personne disposant de votre mot de passe aura également accès à vos fichiers cryptés. Pour cette raison, si vous cryptez vos fichiers avec le cryptage EFS, spécifiez un mot de passe de connexion fort et ne le partagez pas avec d&#39;autres. </p> <ul> <li><strong> Article associé: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> Comment décrypter les fichiers cryptés EFS et supprimer le cryptage EFS. </a></strong></li> </ul> <p><strong> Pour chiffrer un dossier ou un fichier avec EFS : </strong><br> 1. Faites un clic droit sur le dossier (ou fichier) que vous souhaitez protéger et sélectionnez <strong> Propriétés </strong> . <br> 2. Dans l&#39;onglet Général, cliquez sur <strong> Avancée </strong> . </p> <p><img src=\"images/image_thumb-13-582.png\" alt=\"enable efs protection\" loading=\"lazy\"></p> <p> </p> <p> 3. Sélectionnez <strong> Crypter les fichiers pour sécuriser les données </strong> puis cliquez <strong> D&#39;ACCORD. </strong></p> <p><img src=\"images/image_thumb-14-983.png\" alt=\"How to Lock Folder with Password - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Cliquez ensuite sur <strong> Appliquer </strong> et <strong> d&#39;accord </strong> à nouveau pour enregistrer les modifications et quitter. <br> 5. À ce stade, Windows vous demandera de sauvegarder la clé de récupération. Cliquez sur <strong> Sauvegardez votre clé de cryptage de fichier. </strong></p> <p><img src=\"images/image_thumb-2-823.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Cliquez ensuite sur <strong> Sauvegardez maintenant (recommandé) </strong> et enregistrez la clé du certificat de déchiffrement sur une clé USB. </p> <p><img src=\"images/image_thumb-15-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Dans l&#39;assistant d&#39;exportation de certificat, cliquez sur <strong> Suivant </strong> à l&#39;écran de bienvenue. <br> 8. Cliquez ensuite sur <strong> Suivant </strong> à nouveau sur l&#39;écran Exporter le format de fichier. </p> <p><img src=\"images/image_thumb-4-842.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. Dans les options de sécurité : </p> <blockquote> <p> 1. <strong> Vérifier </strong> les <strong> Mot de passe </strong> boîte. <br> 2. Saisissez un mot de passe pour la clé de certificat exportée. <br> 3. Sélectionnez <strong> AES256-SHA256 </strong> chiffrement <br> 4. Cliquez sur <strong> Suivant </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-16-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. Cliquez sur <strong> Parcourir </strong> et <strong> Sauvegarder </strong> le fichier de certificat (.pfx) sur votre ordinateur. <br> 11. Une fois terminé, cliquez sur <strong> Suivant </strong> continuer. </p> <p><img src=\"images/image_thumb-17-804.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. Enfin cliquez sur <strong> Finir </strong> . </p> <p><img src=\"images/image_thumb-18-449.png\" alt=\"image\" loading=\"lazy\"></p> <p> 13. Une fois l&#39;exportation terminée, enregistrez la clé de certificat exportée (fichier .pfx) dans un autre emplacement sûr (par exemple sur un disque USB). </p> <p><strong> ASTUCE: </strong> Lorsque vous chiffrez un dossier (ou des fichiers) avec EFS, la clé de déchiffrement (certificat) est stockée dans votre dossier de profil utilisateur. Ainsi, si un autre utilisateur a votre mot de passe de connexion Windows, il peut ouvrir et lire les fichiers cryptés. Pour éviter que cela ne se produise, ne partagez pas votre mot de passe de connexion ou supprimez (désinstallez) le certificat de décryptage de votre profil lorsque vous quittez votre PC et réinstallez-le à votre retour. * </p> <p> * Remarque : Pour supprimer et réimporter la clé de récupération (certificat), accédez à : </p> <blockquote> <p> une. <strong> Panneau de commande </strong> &gt; <strong> Options Internet. <br> </strong> b. Dans « Options Internet », cliquez sur le <strong> Contenu </strong> onglet puis cliquez sur <strong> Certificat </strong> s. <br> c. Dans l&#39;onglet « Personnel », cliquez sur le <strong> Supprimer </strong> pour supprimer la clé de déchiffrement (certificat), ou cliquez sur le bouton <strong> Importer </strong> bouton pour réinstaller le certificat de déchiffrement de la clé USB. </p> </blockquote> <ul> <li> <p><strong> Article associé: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"noopener noreferrer\"> Comment décrypter les fichiers cryptés EFS et supprimer le cryptage EFS. </a></strong></p> </li> </ul> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez ce billet de blog sur les réseaux sociaux pour aider à faire connaître cette solution </p>"}