{"title":"Comment redémarrer un serveur HP à partir de l&#39;interface iLO.","content":"<p> Dans ce didacticiel, nous trouverons des instructions étape par étape sur la façon de redémarrer un serveur HP à distance, en utilisant l&#39;interface iLO de HP. HP Integrated Lights-Out (iLO) est un composant matériel des serveurs HP, qui est généralement intégré à la carte système. Le composant iLO possède sa propre connexion réseau, adresse IP et interface Web et peut aider l&#39;utilisateur à accéder et à gérer à distance le serveur. </p> <h4> Comment redémarrer un serveur HP à l&#39;aide de l&#39;interface Web iLO 5. </h4> <p> Pour redémarrer un serveur s&#39;il se bloque, depuis l&#39;interface iLO : </p> <p> 1. Depuis un autre ordinateur, ouvrez un navigateur Web et dans la barre d&#39;adresse, saisissez l&#39;adresse IP de l&#39;interface iLO sur le serveur que vous souhaitez redémarrer. <br> 2. Saisissez le nom d&#39;utilisateur iLO et le mot de passe et cliquez sur <strong> Connexion </strong> . </p> <p><img src=\"images/image_thumb-8-790.png\" alt=\"restart hp proliant server from ilo\" loading=\"lazy\"></p> <p> </p> <p> 3. Choisissez <strong> Puissance &amp; Thermique </strong> à gauche. <br> 4. Dans la section Bouton d&#39;alimentation virtuel, cliquez sur le bouton <strong> Réinitialiser </strong> bouton pour redémarrer votre serveur HP. * </p> <p> * Info: </p> <ul> <li> Le virtuel <strong> Réinitialiser </strong> le bouton a la même fonction que le <strong> Redémarrer </strong> commande dans le système d&#39;exploitation (démarrage à chaud). </li> <li> Le virtuel <strong> Botte à froid </strong> le bouton a la même action que le <strong> Fermer </strong> commande dans le système d&#39;exploitation. Si vous appuyez sur le bouton &#39;Cold Boot&#39;, le serveur s&#39;arrêtera et redémarrera après environ 8 secondes. </li> </ul> <p> <img src=\"images/image_thumb-9-784.png\" alt=\"How to Reboot an HP Server using iLO 5 web interface.\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}