{"title":"Comment empêcher Windows 10 d&#39;installer automatiquement des imprimantes réseau","content":"<p> Comme vous l&#39;avez peut-être déjà remarqué, Windows 10 installe automatiquement les pilotes pour toute imprimante ou autre périphérique connecté au réseau. Mais, bien qu&#39;il s&#39;agisse d&#39;une fonctionnalité très utile, elle est également très ennuyeuse, en particulier dans les environnements professionnels, où vous ne souhaitez peut-être pas que toutes les imprimantes soient utilisées par tous les utilisateurs du réseau. </p> <p> Bien sûr, si vous ne voulez pas d&#39;un périphérique réseau et des applications de son fabricant, vous pouvez le supprimer de votre système. Mais, Windows 10 l&#39;installera automatiquement à nouveau. Pour éviter cela, vous devez empêcher Windows d&#39;installer automatiquement les périphériques connectés au réseau (imprimantes, scanners, appareils photo, etc.), ainsi que leurs applications et icônes personnalisées du fabricant. </p> <h3> Comment ARRÊTER Windows 10 pour installer automatiquement des périphériques et des applications réseau. </h3> <p> 1. Accédez à <strong> Panneau de commande </strong> . Pour faire ça: </p> <blockquote><p> une. Tapez &quot;panneau de configuration&quot; dans le champ de recherche Windows <br> b. Cliquez sur <strong> Panneau de commande </strong> à partir des résultats. </p></blockquote> <p><img src=\"images/image_thumb-53-862.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Réglez le <strong> Vu par </strong> à <strong> Petites icônes </strong> pour afficher tous les éléments du panneau de commande, puis cliquez sur <strong> Centre de réseau et partage. </strong></p> <p><img src=\"images/image_thumb-37-625.png\" alt=\"control panel network and sharing center\" loading=\"lazy\"></p> <p> </p> <p> 3. Choisissez <strong> Paramètres de partage avancés </strong> à gauche <strong> . </strong></p> <p><img src=\"images/image_thumb-38-656.png\" alt=\"Prevent Windows 10 to Install Network Printers Automatically\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Effacez le &quot; <strong> Activer la configuration automatique des appareils connectés au réseau&quot; </strong> et cliquez <strong> Sauvegarder les modifications. </strong></p> <p><img src=\"images/image_thumb-39-992.png\" alt=\"Turn Off automatic setup of network connected devices \" loading=\"lazy\"></p> <p> </p> <p><strong> Optionnel: </strong> Si vous souhaitez empêcher Windows 10 de télécharger et d&#39;installer automatiquement les applications et les icônes personnalisées du fabricant, pour tout appareil connecté sur votre PC, alors : </p> <blockquote><p> 1. Accédez à <strong> Panneau de commande </strong> -&gt; <strong> Système </strong> . <br> 2. Cliquez sur <strong> Protection du système </strong> à gauche. <br> 3. Dans l&#39;onglet Matériel, cliquez sur <strong> Paramètres d&#39;installation de l&#39;appareil </strong> . </p></blockquote> <p><img src=\"images/image_thumb-40-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. Dans &quot;Paramètres d&#39;installation de l&#39;appareil&quot;, sélectionnez  &quot; <strong> Non (votre appareil peut ne pas fonctionner comme prévu)&quot; </strong> et cliquez <strong> Sauvegarder les modifications </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-728.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez ce billet de blog sur les réseaux sociaux pour aider à faire connaître ce guide. </p>"}