{"title":"Comment sauvegarder des fichiers personnels avec l&#39;historique des fichiers dans Windows 10.","content":"<p> Dans ce tutoriel, je vais vous montrer comment configurer Windows 10 pour créer automatiquement des copies et des instantanés de vos fichiers en utilisant l&#39;outil de sauvegarde de l&#39;historique des fichiers, afin de pouvoir les restaurer (si nécessaire), en utilisant le &quot;Restaurer les versions précédentes&quot; fonctionnalité. </p> <p> Comme vous l&#39;avez peut-être déjà remarqué, par défaut, Windows 10 ne conserve pas les versions précédentes de vos fichiers ou dossiers, comme dans Windows 7. Cela se produit, car Windows 10 n&#39;utilise plus le service &quot;Volume Shadow Copy&quot; pour prendre des instantanés de vos fichiers, mais à la place, il utilise uniquement l&#39;outil de sauvegarde « Historique des fichiers ». </p> <p> L&#39;&quot;Historique des fichiers&quot; est un excellent outil de sauvegarde intégré dans Windows 10, qui peut être configuré pour prendre des copies et des instantanés de vos fichiers vers un autre emplacement de stockage que le lecteur principal (par exemple sur une clé USB, un réseau, etc.) . * </p> <p> * Remarque : La seule limitation de l&#39;outil « Historique des fichiers » est qu&#39;il ne vous permet pas de choisir le lecteur C: comme destination de sauvegarde alternative. si vous ne possédez pas de lecteur secondaire disponible pour la sauvegarde, continuez à lire ce tutoriel pour savoir comment contourner cette limitation… </p> <ul> <li><strong> Article associé: </strong> <a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment créer des clichés instantanés de vos fichiers avec le planificateur de tâches dans Windows 10. </a></li> </ul> <h4> Comment sauvegarder vos fichiers personnels avec l&#39;outil de sauvegarde de l&#39;historique des fichiers dans Windows 10. </h4> <p> 1. Comme je l&#39;ai mentionné ci-dessus, afin de sauvegarder vos fichiers avec l&#39;outil de sauvegarde de l&#39;historique des fichiers, vous devez disposer d&#39;un lecteur de stockage disponible connecté à votre PC (par exemple une clé USB), ou un emplacement réseau (par exemple un autre ordinateur sur votre réseau , ou un périphérique de stockage NAS). * </p> <p> * Remarque : Si vous ne possédez pas de périphérique de stockage alternatif, vous disposez des options suivantes : </p> <blockquote><p> A. À <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> réduire la taille de votre lecteur principal C:\\ </a> et avec l&#39;espace libre disponible pour créer un nouveau lecteur pour stocker la sauvegarde, ou… </p> <p> B. Pour stocker la sauvegarde sur le lecteur principal C:\\. Dans ce cas, créez un nouveau dossier sur le lecteur C: et nommez-le &quot;FileHistory&quot; (ou ce que vous voulez) et continuez ci-dessous… </p></blockquote> <p> 2. Accédez à Windows <strong> Panneau de commande </strong> et sous <strong> Système et sécurité, </strong> Cliquez sur <strong> Enregistrer la sauvegarde </strong><strong> copies de vos fichiers avec l&#39;historique des fichiers. </strong></p> <p><img src=\"images/image_thumb-42-924.png\" alt=\"How to Backup & Keep Previous Versions of Files in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 3. Maintenant, selon votre cas, procédez comme suit : </p> <ul> <li><strong> Cas A. </strong> Si vous possédez un lecteur disponible pour la sauvegarde, alors : </li> </ul> <blockquote><p> une. Clique le <strong> Allumer </strong> bouton à l&#39;écran pour activer « l&#39;historique des fichiers ». <br> b. Continuer à <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> étape 4 </a> ci-dessous pour configurer les paramètres de sauvegarde « Historique des fichiers ». </p></blockquote> <p><img src=\"images/image_thumb-44-788.png\" alt=\"Turn On File History Windows 10\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Cas B : </strong> Si vous ne possédez pas de lecteur disponible pour la sauvegarde de l&#39;historique des fichiers ou si vous souhaitez stocker la sauvegarde sur le réseau, alors : </li> </ul> <blockquote><p> une. Cliquez sur <strong> Sélectionnez un emplacement réseau. </strong></p></blockquote> <p><img src=\"images/image_thumb-56-796.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. À l&#39;écran suivant : </p> <p> 1. Si vous souhaitez enregistrer la sauvegarde sur le réseau, saisissez le chemin réseau complet de l&#39;emplacement de stockage de la sauvegarde et cliquez sur <strong> Sélectionner le dossier </strong> . </p> <p> 2. Si vous souhaitez enregistrer la sauvegarde sur votre lecteur principal C:\\, saisissez le chemin réseau complet vers le dossier de sauvegarde local sur le lecteur C:\\, sous cette forme : * </p> <ul> <li> <strong> \\\\Nom-de-l&#39;ordinateur\\C$\\FileHistory </strong></li> </ul> <p> * Remarques: <br> 1. Remplacez la valeur &quot;Computer-Name&quot; par le nom de votre PC. (Pour trouver le nom de votre ordinateur, faites un clic droit sur l&#39;icône &quot;Ce PC&quot; dans l&#39;Explorateur Windows). <br> 2. N&#39;oubliez pas que l&#39;enregistrement de la sauvegarde de vos fichiers personnels sur le même lecteur où ils ont déjà été stockés <strong> n&#39;est pas une solution fiable </strong> . Pour plus de sécurité, stockez toujours la sauvegarde sur un autre périphérique de stockage. </p></blockquote> <p> ex. : si le nom de l&#39;ordinateur est &quot;Pegasus&quot; alors tapez : &quot;\\\\Pegasus\\C$\\FileHistory&quot; </p> <p><img src=\"images/image_thumb-53-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> c. À l&#39;écran suivant, cliquez sur <strong> d&#39;accord </strong> . </p></blockquote> <p><img src=\"images/image_thumb-54-349.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> ré. Cliquez maintenant sur le <strong> Allumer </strong> pour activer l&#39;outil de sauvegarde de l&#39;historique des fichiers, puis continuez ci-dessous pour configurer les paramètres de sauvegarde. </p></blockquote> <p><img src=\"images/image_thumb-48-620.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Pour configurer les options de sauvegarde &#39;Historique des fichiers&#39;, cliquez sur <strong> Réglages avancés </strong> à gauche. </p> <p><img src=\"images/image_thumb-49-919.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4a. Puis à <strong> Réglages avancés </strong> options, définissez la fréquence de sauvegarde de vos fichiers et la durée de conservation des versions enregistrées. Une fois terminé, cliquez sur <strong> Sauvegarder les modifications </strong> . </p> <p><img src=\"images/image_thumb-61-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Cliquez enfin sur <strong> Cours maintenant </strong> pour effectuer votre première sauvegarde. * </p> <p><img src=\"images/image_thumb-55-463.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Aide supplémentaire - Remarques : <br> 1. Par défaut, « Historique des fichiers » effectue une sauvegarde des dossiers « Bibliothèques » (Bureau, Documents, Favoris, Musique, OneDrive, Images et vidéos). Si vous souhaitez exclure l&#39;un de ces dossiers de la sauvegarde, inclure d&#39;autres dossiers ou consulter toutes les options de sauvegarde de l&#39;historique des fichiers, accédez à : </p> <ul> <li> <p><strong> Paramètres <img src=\"images/image_thumb-58-467.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Mise à jour et sécurité </strong> &gt; <strong> Sauvegarde </strong> &gt; <strong> Plus d&#39;options. </strong></p> </li> </ul> <p><img src=\"images/image_thumb-57-938.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Pour restaurer vos fichiers à partir de la sauvegarde « Historique des fichiers », accédez à l&#39;un des emplacements suivants : </p> <ul> <li><strong> Panneau de commande </strong> &gt; <strong> Historique du fichier </strong> &gt; <strong> Restaurer les fichiers personnels. </strong></li> <li><strong> Paramètres <img src=\"images/image_thumb-59-275.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Mise à jour et sécurité </strong> &gt; <strong> Sauvegarde </strong> &gt; <strong> Plus d&#39;options </strong> &gt; <strong> Restaurer les fichiers à partir d&#39;une sauvegarde actuelle. </strong></li> </ul> <p> 3. Pour restaurer sélectivement un fichier ou un dossier à sa version précédente, faites un clic droit sur le fichier (ou dossier) et sélectionnez <strong> Restaurer les versions précédentes </strong> . </p> <p><img src=\"images/image_thumb-60-867.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}