{"title":"Comment transférer le courrier électronique et les paramètres de Thunderbird vers un nouvel ordinateur.","content":"<p> Ce didacticiel contient des instructions détaillées sur la façon de transférer les messages électroniques Thunderbird, les paramètres de compte et les carnets d&#39;adresses vers un autre ordinateur. L&#39;application de messagerie Thunderbird stocke toutes les données dans un dossier de profil qui a l&#39;extension &quot;.default&quot; à la fin de son nom. (par exemple &quot;wyhsxcvs.default&quot;). Par défaut, ce dossier de profil est stocké à l&#39;emplacement suivant sur votre ordinateur : </p> <ul> <li> C:\\Users\\\\AppData\\Roaming\\Thunderbird\\Profiles\\ <strong> .défaut </strong></li> </ul> <p><img src=\"images/image_thumb-14-425.png\" alt=\"How to Transfer Thunderbird Emails & Data to a New Computer.\" loading=\"lazy\"></p> <p> Ainsi, si vous souhaitez déplacer vos données Thunderbird vers un nouvel ordinateur, vous devez transférer le dossier parent &#39;Thunderbird&#39; vers le nouvel ordinateur, puis pointer Thunderbird vers ce dossier. </p> <h4> Comment déplacer le profil Thunderbird vers un autre PC. </h4> <h6> Étape 1. Copiez le dossier Thunderbird Profile de l&#39;ancien ordinateur. </h6> <p> </p> <p> Sur l&#39;ancien ordinateur, accédez à l&#39;emplacement de stockage des données Thunderbird. Pour faire ça: </p> <p> 1. Ouvrez Thunderbird. <br> 2. Depuis le menu <img src=\"images/image_thumb21_thumb-959.png\" alt=\"image_thumb[21]\" loading=\"lazy\"> , choisir <strong> Aider </strong> -&gt; <strong> Des informations de dépannage. <br> </strong> 3. À <strong> Dossier de profil </strong> ligne, cliquez sur <strong> Dossier ouvert </strong> . </p> <p><img src=\"images/image_thumb-8-878.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Fermez l&#39;application Thunderbird. <br> 5. Dans la fenêtre de l&#39;explorateur, cliquez sur <strong> Roaming </strong> . </p> <p><img src=\"images/image_thumb-9-272.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Copie </strong> et <strong> Pâte </strong> les <strong> Oiseau-tonnerre </strong> dossier sur un support de stockage avec suffisamment d&#39;espace libre. (par exemple une clé USB externe). </p> <p><img src=\"images/image_thumb-10-958.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Étape 2. Transférez le profil Thunderbird sur le nouvel ordinateur. </h6> <p> 1. <a href=\"https://www.thunderbird.net/en-US/download/\" target=\"_blank\" rel=\"nofollow noopener\"> Télécharger </a> et installez Thunderbird sur le nouveau PC. * </p> <p><strong> * Important: </strong> A la fin du processus d&#39;installation, <strong> décocher </strong> l&#39;option « Lancer Mozilla Thunderbird maintenant » et cliquez sur <strong> Finir </strong> . </p> <p><img src=\"images/image_thumb-11-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Connectez la clé USB (avec le dossier &quot;Thunderbird&quot;) au nouvel ordinateur. <br> 3. Faites un clic droit sur le dossier &#39;Thunderbird&#39; et cliquez sur <strong> Copie </strong> . <br> 4. Appuyez sur le bouton Windows <img src=\"images/image_thumb8_thumb-1-464.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> 5. Tapez la commande suivante <strong> </strong> et appuyez sur <strong> Entrer: </strong></p> <ul> <li><strong> %données d&#39;application% </strong></li> </ul> <p><img src=\"images/image_thumb-12-421.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Sur les fenêtres de l&#39;explorateur, faites un clic droit sur un espace vide et cliquez sur <strong> Pâte </strong> . </p> <p><img src=\"images/image_thumb-13-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Lancez Thunderbird et vous devriez voir tous vos e-mails, carnets d&#39;adresses et paramètres de compte, comme sur votre ancien ordinateur. </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}