{"title":"CORRECTIF : il semble que vous ayez commencé une mise à niveau et démarré à partir du support d&#39;installation (résolu)","content":"<p> Le problème suivant peut apparaître si vous essayez d&#39;effectuer une nouvelle installation ou une mise à niveau de réparation de Windows 10 à partir d&#39;un support d&#39;installation : « Il semble que vous ayez démarré une mise à niveau et démarré à partir du support d&#39;installation. Si vous souhaitez poursuivre la mise à niveau, supprimez le de votre PC et cliquez sur Oui. Si vous souhaitez effectuer une nouvelle installation à la place, cliquez sur Non&quot;. </p> <p><img src=\"images/image_thumb-36-818.png\" alt=\"FIX: It looks like you started an upgrade and booted from installation media \" loading=\"lazy\"></p> <p> </p> <p> Le message d&#39;erreur ci-dessus signifie que vous avez interrompu la mise à niveau de Windows 10 une fois qu&#39;elle a démarré. Comme le message l&#39;indique, si vous souhaitez effectuer une nouvelle installation de Windows 10, vous devez sélectionner &quot;Non&quot; pour continuer, sinon, supprimez le support d&#39;installation et cliquez sur &quot;Oui&quot; pour continuer la mise à niveau de Windows 10. </p> <p> En général, le message ci-dessus n&#39;est pas un problème, mais devient un gros problème si l&#39;installation de la mise à jour de Windows échoue ou si Windows 10 est bloqué en boucle après avoir essayé d&#39;installer les mises à jour et que vous souhaitez réparer Windows 10 en démarrant à partir d&#39;une installation médias. </p> <p> Dans ce didacticiel, vous trouverez des instructions détaillées sur la façon de contourner le message &quot;Il semble que vous ayez démarré une mise à niveau et démarré à partir du support d&#39;installation&quot;, en annulant le processus de mise à jour en cours de Windows 10, afin d&#39;effectuer une réparation de Windows 10 mise à niveau à partir du support d&#39;installation. </p> <h4> Comment annuler la mise à jour de Windows 10 en cours si Windows ne peut pas démarrer * </h4> <p><strong> * Important: </strong> Si vous pouvez démarrer sous Windows 10, mais que vous ne pouvez pas installer la mise à jour à partir de l&#39;environnement Windows, appliquez d&#39;abord les actions suivantes : </p> <blockquote><p> 1. Accédez à <strong> Démarrer </strong> &gt; <strong> Paramètres </strong> &gt; <strong> Mise à jour et sécurité </strong> et cliquez sur &quot;Redémarrer maintenant&quot; pour démarrer le processus de mise à jour. <br> 2. Après le premier redémarrage, laissez la progression &quot;Travailler sur les mises à jour&quot; pour passer à 1-2%. <br> 3. Lorsque cela est fait, appuyez sur le <strong> Pouvoir </strong> pendant 10 à 15 secondes pour éteindre complètement votre PC. <br> 4. Branchez le support d&#39;installation de Windows et allumez votre PC. <br> 5. Suivez les autres étapes ci-dessous pour annuler la mise à jour en cours. </p></blockquote> <p> </p> <h6> Étape 1. Annulez les actions en attente de mise à jour Windows. </h6> <p> 1. Démarrez votre système à partir d&#39;un support d&#39;installation Windows. <br> 2. Lorsque le message &quot;Il semble que vous ayez démarré une mise à niveau et démarré à partir du support d&#39;installation…&quot; s&#39;affiche, appuyez sur le bouton <strong> CHANGEMENT </strong> + <strong> F10 </strong> touches pour lancer l&#39;invite de commande. </p> <p><img src=\"images/image_thumb-37-729.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. À l&#39;invite de commande, obtenez une liste de tous les lecteurs de votre système avec cette commande : </p> <ul> <li><strong> wmic logicaldisk obtenir le nom </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-991.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> </p> <p> 4. Découvrez ensuite quel lecteur contient le dossier &quot;Windows&quot;, en tapant cette commande : * </p> <p> </p> <ul> <li><strong> dir DriveLettre : </strong></li> </ul> <p> * par exemple. Pour voir le contenu du lecteur C:, tapez : &quot; <strong> dir C : </strong> &quot; (sans les guillemets). Si vous ne pouvez pas voir le dossier &quot;Windows&quot; sur le lecteur C:, passez à la lettre de lecteur suivante (par exemple &quot;dir D:&quot;, &quot;dir E:&quot;, etc.), jusqu&#39;à ce que vous voyiez le Dossier &quot;Windows&quot; sur l&#39;un des lecteurs répertoriés (à partir de la commande ci-dessus). </p> <p> ex. : Comme vous pouvez le voir sur la capture d&#39;écran ci-dessous, le dossier Windows (dans cet exemple) est situé à la <strong> ré </strong> : conduire.] </p> <p><img src=\"images/image_thumb-69-578.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Une fois que vous avez trouvé sur quel lecteur se trouve le lecteur « Windows » (par exemple, sur le lecteur « D : » dans cet exemple), accédez à ce lecteur en tapant DriveLetter <strong> : </strong> + <strong> Entrer </strong> . </p> <p> 6. Créez ensuite un dossier scratch sur le lecteur Windows en tapant cette commande : </p> <p> </p> <ul> <li><strong> mkdir D:\\Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-229.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Donnez ensuite la commande ci-dessous pour annuler les actions en attente de la mise à jour en cours : </p> <ul> <li><strong> DISM /Image:D:\\ /ScratchDir:D:\\Scratch /Cleanup-Image /RevertPendingActions </strong></li> </ul> <p> * Remarque : modifiez la lettre du lecteur <strong> ré </strong> selon votre cas. </p> <p> 8. Une fois la commande DISM ci-dessus exécutée, vous devriez recevoir le message suivant à l&#39;écran : </p> <p> &quot; <em> Rétablir les actions en attente à partir de l&#39;image…. <br> L&#39;opération terminée. L&#39;annulation des actions en attente sera tentée après le redémarrage. <br> L&#39;opération s&#39;est bien déroulée.&quot; </em></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"DISM - RevertPendingActions\" loading=\"lazy\"></p> <p> </p> <p> 9. Fermez la fenêtre d&#39;invite de commande, retirez le support d&#39;installation et laissez Windows démarrer normalement. </p> <p> 10. Après le redémarrage, vous devriez voir le message suivant sur votre écran : « Annulation des modifications apportées à votre ordinateur. Lorsque ce processus est terminé, Windows devrait démarrer normalement. </p> <p><img src=\"images/image_thumb-39-836.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Étape 2. Supprimez les fichiers de mise à niveau avec le nettoyage de disque. </h6> <p> Après avoir démarré sous Windows 10, vous devez préparer Windows 10 pour la réparation/mise à niveau USB, en supprimant les mises à jour déjà téléchargées avec l&#39;outil de nettoyage de disque. Pour faire ça: </p> <p> 1. Ouvrez l&#39;explorateur de fichiers, faites un clic droit sur le lecteur C: et sélectionnez <strong> Propriétés </strong> . <br> 2. Cliquez sur le <strong> Nettoyage de disque </strong> bouton. </p> <p><img src=\"images/image_thumb_thumb-190.png\" alt=\"Disk cleanup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Cliquez ensuite sur <strong> Nettoyer les fichiers système </strong> . </p> <p><img src=\"images/image_thumb-40-950.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Vérifiez maintenant pour supprimer les fichiers suivants et cliquez sur <strong> d&#39;accord </strong> : </p> <ul> <li> <ul> <li> <ul> <li> Nettoyage de mise à jour Windows. </li> <li> Antivirus Windows Defender. </li> <li> Fichiers de programme téléchargés. </li> <li> Fichiers Internet temporaires. </li> <li> Installations précédentes de Windows. </li> <li> Corbeille. </li> <li> Fichiers temporaires. </li> <li> Fichiers d&#39;installation temporaire de Windows </li> </ul> </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-41-458.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Lorsqu&#39;on lui a demandé, <strong> Supprimer les fichiers </strong> . </p> <p><img src=\"images/image_thumb-42-931.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Une fois le nettoyage terminé, fermez les propriétés du disque et passez à l&#39;étape suivante. </p> <p> </p> <h6> Étape 3. Supprimez le dossier &#39;SoftwareDistribution&#39;. </h6> <p> Le &quot;C:\\Windows\\ <strong> Distribution de logiciels </strong> &quot;, est l&#39;emplacement où Windows stocke les mises à jour Windows. Plusieurs fois, ce dossier est corrompu et vous devez le recréer afin de retélécharger les mises à jour à partir de zéro. Procédez donc comme suit : </p> <p><strong> 1. Arrêtez le service de mise à jour Windows : </strong> Pour faire ça: </p> <blockquote><p> une. Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. <br> b. Dans la zone de recherche, saisissez : <strong><em> services.msc </em></strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </p></blockquote> <p><img src=\"images/image_thumb-12-264.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> c. Dans le panneau de configuration des services, localisez le &quot; <strong> Windows Update&quot; </strong> un service. <br> ré. Faites un clic droit sur <strong> Windows Update </strong> service et sélectionnez &quot; <strong> Arrêter </strong> &quot;. </p></blockquote> <p><img src=\"images/image_thumb-9-434.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. Supprimez le dossier SoftwareDistribution. </strong></p> <blockquote><p> une. Ouvrez l&#39;explorateur Windows et accédez à : <strong> C:\\Windows </strong> dossier. <br> b. Trouve et <strong> Effacer </strong> les &quot; <strong><em> Distribution de logiciels </em></strong> &quot; (ou renommez-le, par exemple en &quot;SoftwareDistributionOLD&quot;) . </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-10-140.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Redémarrez votre ordinateur </strong> pour appliquer les modifications. </p> <p> </p> <h6> Étape 4. Mettez à niveau Windows 10 à partir du support d&#39;installation. </h6> <p> Vous êtes maintenant prêt à réparer-mettre à niveau Windows 10 à partir d&#39;un support d&#39;installation. Pour faire ça: </p> <p> 1. <strong> Redémarrer </strong> votre ordinateur et <strong> botte </strong> à partir de la clé USB Windows (ou DVD) <strong> support d&#39;installation </strong> . <br> 2. Dans l&#39;assistant d&#39;installation de Windows, appuyez sur <strong> Suivant </strong> puis cliquez <strong> Installer maintenant </strong> . <br> 3. <strong> J&#39;accepte </strong> le « Contrat de licence ». <br> 4. Lorsque vous y êtes invité, sélectionnez Mettre à niveau <strong> : Installez Windows et conservez les fichiers, les paramètres et les applications </strong> . </p> <blockquote><p><img src=\"images/image_thumb8_thumb-241.png\" alt=\"image_thumb8\" loading=\"lazy\"></p></blockquote> <p> 5. Suivez ensuite les instructions à l&#39;écran pour mettre à niveau Windows 10. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}