{"title":"CORRECTIF : la connexion Bureau à distance n&#39;a pas pu se connecter car une session de console est déjà en cours (résolu).","content":"<p> Le message d&#39;erreur sur la connexion Bureau à distance &quot;Votre ordinateur n&#39;a pas pu se connecter à une autre session de console sur l&#39;ordinateur distant car vous avez déjà une session de console en cours&quot;, apparaît car l&#39;ordinateur local et l&#39;ordinateur distant ont la même adresse IP. Le problème se produit généralement lorsque vous essayez de vous connecter à distance à un autre ordinateur via une connexion VPN et que vous avez &quot;reçu&quot; la même adresse IP de votre routeur local que l&#39;ordinateur distant. Pour résoudre le problème, suivez les instructions ci-dessous. </p> <p> </p> <p><img src=\"images/image_thumb-7-243.png\" alt=\"Remote Desktop Connection Could Not Connect because already have a console session in progress\" loading=\"lazy\"></p> <h4> Comment CORRIGER l&#39;erreur RDP : Remote Desktop n&#39;a pas pu se connecter à une autre session de console car une session de console est déjà en cours. </h4> <p> Le problème dans Connexion Bureau à distance &quot;Impossible de se connecter à une autre session de console car vous avez déjà une session de console en cours&quot; se produit généralement lorsque l&#39;ordinateur local reçoit de manière aléatoire (du serveur DHCP) la même adresse IP que l&#39;adresse IP de la télécommande ordinateur que vous souhaitez connecter via RDP. </p> <p> Le seul moyen de résoudre le problème ci-dessus consiste à désactiver l&#39;attribution automatique d&#39;adresse IP à partir du serveur DHCP sur l&#39;ordinateur local et à spécifier manuellement une adresse IP. Pour faire ça: </p> <p> 1. <strong> Clic-droit </strong> sur le <strong> Réseau </strong> icône <img src=\"images/image_thumb-42-527.png\" alt=\"image\" loading=\"lazy\"> dans la barre des tâches et cliquez sur <strong> Ouvrez le Centre Réseau et partage. </strong> * </p> <p><img src=\"images/image_thumb-104-485.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Sélectionnez <strong> Ethernet </strong> (ou Wi-Fi) sur la gauche, puis dans la section &quot;Paramètres associés&quot;, cliquez sur <strong> Modifier les options de l&#39;adaptateur </strong> . </p> <p><img src=\"images/image_thumb-43-117.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Double-cliquez </strong> sur l&#39;adaptateur réseau actif (Ethernet ou Wi-Fi) et cliquez sur <strong> Des détails </strong> . </p> <p><img src=\"images/image_thumb-8-177.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Notez les détails de l&#39;adresse IP dans les champs suivants, puis cliquez sur <strong> Fermer </strong> : </p> <ul> <li> Adresse IPv4 </li> <li> Masque de sous-réseau IPv4 </li> <li> Passerelle IPv4 par défaut </li> <li> Serveur DNS IPv4 </li> </ul> <p><img src=\"images/image_thumb-9-793.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Maintenant, cliquez sur <strong> Propriétés </strong> . </p> <p><img src=\"images/image_thumb-10-628.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Sélectionnez le <strong> &#39;Internet Protocol Version 4 (TCP/IPv4) </strong> &#39; et cliquez <strong> Propriétés </strong></p> <p><img src=\"images/image_thumb-106-954.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 7. Dans les propriétés du protocole Internet version 4 (TCP/IPv4), appliquez les paramètres suivants : </p> <p> A. Sélectionnez <strong> Utilisez l&#39;adresse IP suivante : </strong></p> <blockquote><p> 1. Dans le champ Adresse IP, saisissez un <strong> Adresse IP différente de l&#39;adresse IP que vous avez remarquée auparavant </strong> . (Ne changez que le dernier nombre pour une valeur plus élevée). <br> 2. Dans le champ Masque de sous-réseau, saisissez la même adresse IP de sous-réseau que celle que vous avez remarquée auparavant. <br> 3. Dans Passerelle par défaut, saisissez la même passerelle par défaut que celle que vous avez remarquée auparavant. </p></blockquote> <p> B. Sélectionnez <strong> Utilisez les adresses de serveur DNS suivantes </strong> : </p> <blockquote><p> 1. Dans Serveur DNS préféré, saisissez l&#39;adresse DNS que vous avez remarquée auparavant. </p></blockquote> <p> C. Une fois terminé, cliquez sur <strong> d&#39;accord </strong> deux fois et <strong> Fermer </strong> pour fermer les propriétés de l&#39;adaptateur. </p> <blockquote> <p><img src=\"images/image_thumb-11-850.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 8. Maintenant, essayez de vous connecter à l&#39;ordinateur Bureau à distance. Le problème devrait être résolu. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}