{"title":"CORRECTIF : les paramètres matériels ont changé. Veuillez redémarrer au démarrage de Windows 10. (Résolu)","content":"<p> Ce guide contient des instructions pour résoudre le problème suivant à chaque démarrage de Windows 10 : &quot;Vos paramètres matériels ont changé. Veuillez redémarrer votre ordinateur pour que ces modifications prennent effet.&quot;. </p> <p> L&#39;erreur de démarrage de Windows 10 &quot;les paramètres matériels ont changé… veuillez redémarrer&quot;, peut apparaître même après une nouvelle installation de Windows 10, en particulier sur les ordinateurs (ordinateurs de bureau ou portables) qui possèdent une carte graphique AMD. </p> <p><img src=\"images/image_thumb-71-941.png\" alt=\"FIX Hardware Settings Have Changed. Please Reboot - Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Comment CORRIGER l&#39;erreur de démarrage de Windows 10 : vos paramètres matériels ont changé. S&#39;il vous plait redémarrez votre ordinateur… </h4> <p> 1. Ouvrez le panneau de configuration des services Windows : Pour ce faire : </p> <ul> <li> Appuyez sur Windows <img src=\"images/image_thumb8_thumb_thumb-332.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> touches pour ouvrir la boîte de commande d&#39;exécution. </li> <li> Dans la zone de recherche, saisissez : <strong><em> services.msc </em></strong> &amp; Cliquez sur <strong> d&#39;accord </strong> . </li> </ul> <p><img src=\"images/image_thumb-12-644.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Dans le panneau de configuration des services, faites un clic droit sur <strong> Utilitaire d&#39;événements externes AMD </strong> service et choisissez <strong> Propriétés </strong> . </p> <p><img src=\"images/image_thumb-72-951.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Réglez le <strong> Type de démarrage </strong> à <strong> Désactivée </strong> puis cliquez <strong> d&#39;accord </strong> . </p> <p><img src=\"images/image_thumb-73-548.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Redémarrer </strong> ton ordinateur. Si après le redémarrage, vous recevez toujours l&#39;erreur : « les paramètres matériels ont changé… veuillez redémarrer », alors procédez comme suit : </p> <p> 1. Accédez au Panneau de configuration -&gt; <strong> Programmes et fonctionnalités </strong> et <strong> désinstaller </strong> tous les <strong> DMLA </strong> Logiciel. <br> 2. Accédez à <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Page de téléchargement des pilotes AMD </a> pour télécharger et installer un pilote plus ancien pour votre carte graphique. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}