{"title":"Comment récupérer le fichier Outlook Express DBX GRATUITEMENT.","content":"<p> Outlook Express est un programme client de messagerie apparu pour la première fois dans Windows XP. Mais même aujourd&#39;hui (année 2018), certains clients l&#39;utilisent toujours, en tant que principal programme de messagerie. L&#39;un des principaux problèmes d&#39;Outlook Express est le problème de la limite de 2 Go. </p> <p> Description du problème de limite de taille de 2 Go dans Outlook Express. <br> Lorsque l&#39;un des principaux dossiers Outlook Express (par exemple, la &quot;Boîte de réception&quot; ou &quot;Envoyé&quot;) dépasse la taille de 2 Go, le fichier de magasin OE DBX correspondant peut être corrompu et le dossier OE peut sembler vide. En raison du problème, Outlook Express ne peut pas envoyer ou recevoir d&#39;e-mails et affiche l&#39;erreur <a href=\"https://www.repairwin.com/fix-outlook-express-error-0x800c0133-due-to-2gb-size-limit/\" target=\"_blank\" rel=\"nofollow noopener\"> 0x800c0133 </a> pendant l&#39;opération d&#39;envoi/réception. </p> <p> Dans ce tutoriel, je vais vous montrer comment réparer un fichier DBX corrompu à partir d&#39;Outlook Express et récupérer vos e-mails ! </p> <h4> Comment réparer un fichier DBX Outlook Express corrompu </h4> <p> Si l&#39;un des dossiers Outlook Express (boîte de réception, envoi, etc.) est corrompu, suivez les instructions ci-dessous pour réparer le dossier du magasin DBX et récupérer vos e-mails. </p> <h6> Étape 1. Activez la vue des fichiers cachés. </h6> <p> 1. Ouvrez l&#39;Explorateur Windows. <br> 2. De la <strong> Outils </strong> menu choisir <strong> Options de dossier </strong> . <br> 3. Dans l&#39;onglet Affichage, cliquez sur <strong> Afficher les fichiers et dossiers cachés </strong> et cliquez <strong> D&#39;ACCORD. </strong></p> <p><img src=\"images/image_thumb-2-290.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Étape 2. Localisez le fichier DBX Outlook Express corrompu sur votre disque. </h6> <p> 1. Ouvrez le dossier du magasin Outlook Express. Généralement, ce dossier se trouve au chemin suivant sur votre disque : </p> <ul> <li> C:\\Documents and Settings\\\\Local Settings\\Application Data\\Identities\\{}\\Microsoft\\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> par exemple. &quot;C:\\Documents and Settings\\User\\Local Settings\\Application Data\\Identities\\{D8F3C56D-965E-41AE-8A23-A58460ABAE00}\\Microsoft\\ <strong> Outlook Express </strong> &quot; </p></blockquote> <p> 3. De l&#39;explorateur <strong> Vue </strong> menu choisir <strong> Des détails </strong> . <br> 4. Localisez quel fichier DBX dépasse la limite de stockage de 2 Go ou localisez le fichier DBX corrompu. (le fichier DBX corrompu, est le dossier MAIL qui semble vide dans le programme Outlook Express). </p> <p><img src=\"images/image_thumb-3-887.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Copiez ce fichier DBX dans un autre emplacement de votre disque (par exemple, dans un nouveau dossier sur votre bureau nommé &quot;CorruptedDBX&quot;). </p> <p> </p> <h6> Étape 3. Téléchargez UnDBX – Utilitaire de récupération DBX Outlook Express gratuit. </h6> <p> UnDBX est un outil de réparation Outlook Express DBX excellent et gratuit qui peut extraire tous les e-mails Outlook Express contenus au format .eml. De plus, il a la possibilité de réparer et de réparer un fichier Outlook Express .DBX endommagé. </p> <p> Vous pouvez télécharger UnDBX à partir de <a href=\"https://sourceforge.net/projects/undbx/\" target=\"_blank\" rel=\"nofollow noopener\"> ici </a> . </p> <p> </p> <h6> Étape 4. Récupérez les e-mails du fichier DBX Outlook Express corrompu. </h6> <p> 1. Pour récupérer les e-mails du fichier DBX corrompu, double-cliquez pour exécuter l&#39;utilitaire UnDBX. <br> 2. Dans l&#39;utilitaire UnDBX : </p> <blockquote><p> 1. Sélectionnez le dossier qui contient les fichiers Outlook Express .dbx puis <strong> Chèque </strong> les &quot; <strong> activer le mode de récupération </strong> &quot; option ci-dessous. <br> 2. <strong> Choisissez un dossier de destination </strong> sur votre ordinateur, pour stocker (extraire) les fichiers .eml. (par exemple dans un dossier sur votre bureau nommé &quot;RecoveredInbox&quot;) <br> 3. Cliquez enfin sur <strong> Se remettre </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-645.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Une fois la récupération UnDBX terminée, ouvrez Outlook Express. <br> 4. Accédez au dossier dans lequel UnDBX a enregistré les fichiers .eml extraits. <br> 5. Faites glisser et déposez les e-mails extraits dans le dossier correspondant (dans Outlook Express). * </p> <p><strong> * Suggestions : </strong> Pour éviter que les dossiers Outlook Express ne soient à nouveau corrompus (ou pour contourner la limite de 2 Go), je suggère de faire glisser et déposer les e-mails en groupes (par exemple par année) et de les placer dans différents dossiers dans OE. Par exemple, sélectionnez uniquement les e-mails de l&#39;année en cours et faites-les glisser dans un nouveau dossier OE nommé avec l&#39;année en cours (par exemple, &quot;Boîte de réception 2018&quot;). Répétez ensuite la ou les mêmes étapes pour tous les autres e-mails des années précédentes. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}