{"title":"CORRECTIF : impression PDF lente sous Windows 10 (résolu)","content":"<p> Ce didacticiel contient des instructions pour résoudre le problème d&#39;impression PDF lente à partir d&#39;Acrobat Reader sous Windows 10. Donc, si vous essayez d&#39;imprimer un fichier PDF à l&#39;aide d&#39;Adobe Acrobat et que l&#39;impression est lente, continuez à lire ci-dessous. </p> <p> Problème dans les détails : lorsque vous essayez d&#39;imprimer un fichier PDF sur une imprimante locale ou réseau, l&#39;impression prend beaucoup de temps car une fois le travail d&#39;impression envoyé, l&#39;imprimante commence à imprimer la première page très lentement, puis vous devez attendre plus de 2 minutes pour les pages restantes à imprimer. Dans le même temps, le problème d&#39;impression lente ne se produit pas lors de l&#39;impression à partir d&#39;autres programmes. (par exemple à partir de Word, Excel, etc.) </p> <p> L&#39;impression lente des documents Adobe PDF sous Windows 10, peut apparaître pour plusieurs raisons, ce tutoriel contient donc plusieurs méthodes pour résoudre le problème. </p> <h4> Comment CORRIGER : L&#39;impression de fichiers PDF est très lente sous Windows 10. </h4> <h6> Méthode 1. Imprimez le document PDF en tant qu&#39;image. </h6> <p> 1. Ouvrez Acrobat Reader et cliquez sur le bouton <strong> Imprimer </strong> bouton. <br> 2. Dans la boîte de dialogue Imprimer, cliquez sur <strong> Avancée. </strong></p> <p><img src=\"images/image_thumb-345.png\" alt=\"FIX: Slow PDF Printing in Windows 10\" loading=\"lazy\"></p> <p> 3. Sélectionnez le <strong> Imprimer en tant qu&#39;image </strong> case à cocher et cliquez sur <strong> D&#39;ACCORD. </strong></p> <p><img src=\"images/image_thumb-1-653.png\" alt=\"FIX PDF Slow Printing in Windows 10\" loading=\"lazy\"></p> <p> 4. Essayez d&#39;imprimer votre fichier PDF. </p> <h6><br clear=\"all\"> Méthode 2. Laissez l&#39;imprimante déterminer les couleurs. </h6> <p> 1. Ouvrez Acrobat Reader et cliquez sur le bouton <strong> Imprimer </strong> bouton. <br> 2. Dans la boîte de dialogue Imprimer, cliquez sur <strong> Avancée. </strong></p> <p> 3. <strong> Décocher </strong> les <strong> Imprimer en tant qu&#39;image </strong> case à cocher (si cochée), et <strong> Chèque </strong> les <strong> Laisser l&#39;imprimante déterminer les couleurs </strong> case à cocher. <br> 4. Cliquez sur <strong> d&#39;accord </strong> pour enregistrer les paramètres et essayer d&#39;imprimer le fichier PDF. * </p> <p> * Remarque : Si le niveau d&#39;impression est à nouveau faible, alors <strong> décocher </strong> les <strong> « Laisser l&#39;imprimante déterminer les couleurs » </strong> option et passez à la méthode suivante. </p> <p><img src=\"images/image_thumb-2-580.png\" alt=\"FIX Adobe Acrobat Slow PDF Print\" loading=\"lazy\"></p> <h6> Méthode 3. Réinstallez ou modifiez le pilote d&#39;imprimante. </h6> <p> En dernier recours, pour résoudre la lenteur de l&#39;impression des documents PDF, effectuez les actions suivantes. </p> <p><strong> Étape 1. Réinstallez les pilotes d&#39;imprimante. </strong></p> <p> 1. Accédez au Panneau de configuration &gt; <strong> Appareils et imprimantes </strong> . <br> 2. Cliquez avec le bouton droit sur l&#39;imprimante et cliquez sur <strong> Enlevez l&#39;appareil </strong> . </p> <p><img src=\"images/image_thumb-3-877.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Ensuite, accédez au Panneau de configuration &gt; <strong> Programmes et fonctionnalités </strong> et <strong> désinstaller </strong> le logiciel de l&#39;imprimante. <br> 4. <strong> Redémarrer </strong> votre ordinateur. <br> 5. Depuis le site d&#39;assistance du fabricant de l&#39;imprimante, téléchargez les derniers pilotes pour votre imprimante. <br> 6. Installez les pilotes d&#39;imprimante et essayez d&#39;imprimer. Si l&#39;impression est à nouveau lente, passez à l&#39;étape 2. </p> <p><strong> Étape 2. Changez le pilote d&#39;imprimante. </strong></p> <p> Accédez à nouveau au site d&#39;assistance du fabricant de votre imprimante et vérifiez s&#39;il propose un autre type de pilote pour votre imprimante. (par exemple, impression universelle, PostScript, PCL6, etc.). Si tel est le cas, téléchargez et installez l&#39;un des autres types de pilotes et essayez d&#39;imprimer. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}