{"title":"CORRECTIF : Erreur de restauration du système 0x81000010B (résolu)","content":"<p> Ce tutoriel contient des instructions pour résoudre l&#39;erreur de restauration du système 0x81000010B dans Windows 10. L&#39;erreur 0x81000010B peut apparaître lorsque vous essayez d&#39;augmenter l&#39;utilisation maximale de l&#39;espace pour la protection du système ou lorsque vous essayez de supprimer tous les points de restauration précédents. </p> <p><img src=\"images/image_thumb-19-393.png\" alt=\"FIX System Restore Error 0x8100010B\" loading=\"lazy\"></p> <p> Plus précisément, cet article contient des instructions pour résoudre le problème suivant dans la restauration du système : </p> <p><strong> 1. Impossible d&#39;augmenter l&#39;espace disque maximal pour la protection du système </strong> avec l&#39;erreur : &quot;Il y a eu un <strong> erreur inattendue dans la page de propriétés </strong> : le nom de fichier, le nom de répertoire ou la syntaxe du nom de volume est incorrect. (0x8007007B)). </p> <p><strong> 2. Impossible de supprimer les points de restauration </strong> sur Windows 10 avec l&#39;erreur : &quot;Les points de restauration n&#39;ont pas pu être supprimés pour la raison suivante : Windows n&#39;a pas pu supprimer tous les instantanés. Veuillez réessayer ou consulter le journal des événements pour plus d&#39;informations. (0x81000010B).&quot; </p> <h2> Comment CORRIGER : Erreur 0x810010B dans la protection de restauration du système. </h2> <p> 1. <strong> Redémarrer </strong> votre ordinateur. </p> <p> 2. Accédez à <strong> Protection du système </strong> Les paramètres: </p> <ul> <li><b> Panneau de configuration &gt; Système &gt; Paramètres système avancés &gt; Propriétés système &gt; Protection du système </b></li> </ul> <p> 3. Mettez en surbrillance le <strong> Disque local C : (Système) </strong> et cliquez <strong> Configurer. </strong></p> <p><img src=\"images/image_thumb-22-902.png\" alt=\"0x8100010B System Protection\" loading=\"lazy\"></p> <p> </p> <p> 4. Sélectionnez <strong> Désactiver la protection du système </strong> et cliquez <strong> Appliquer &gt; OK. </strong> * </p> <p> * Remarque : Cette action supprimera définitivement tous les points de restauration précédents. Si vous souhaitez augmenter l&#39;utilisation maximale de l&#39;espace pour la protection du système, sans perdre les points de restauration, donnez la commande ci-dessous dans une invite de commande élevée, puis voyez si le problème est résolu. </p> <ul> <li> vssadmin redimensionner shadowstorage /For=C: /On=C: /MaxSize=15% </li> </ul> <p><img src=\"images/image_thumb-23-863.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Fermer </strong> et <strong> rouvrir </strong> les paramètres de protection du système. </p> <p> 6. Maintenant, sélectionnez <strong> Activer la protection du système </strong> , configurez l&#39;utilisation maximale et cliquez sur <strong> d&#39;accord </strong> . </p> <p> 7. Dans les options de protection du système, sélectionnez <strong> Activer la protection du système </strong> et cliquez <strong> D&#39;ACCORD. </strong></p> <p><img src=\"images/image_thumb-73-430.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}