{"title":"CORRECTIF : aucune version précédente n&#39;est disponible dans Windows 10 (résolu)","content":"<p> Sur un ordinateur Windows 10 avec le <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Protection du système </a> activé, le problème suivant apparaît lors de la tentative de restauration d&#39;un fichier/dossier à l&#39;aide de la fonction « Restaurer les versions précédentes » : « Il n&#39;y a pas de versions précédentes disponibles ». </p> <p> <img src=\"images/image_thumb-39-628.png\" alt=\"There No Previous Versions Available in Windows 10 \" loading=\"lazy\"></p> <p> </p> <p> L&#39;erreur &quot;Il n&#39;y a pas de versions précédentes disponibles&quot; se produit car dans Windows 10, la fonctionnalité &quot;Restaurer les versions précédentes&quot; ne fonctionne que si vous avez configuré le &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Historique du fichier </a> &#39; pour sauvegarder vos fichiers. Cela signifie que la fonctionnalité &quot;Restaurer les versions précédentes&quot; dans Windows 10, regarde l&#39;emplacement de sauvegarde de &quot;l&#39;outil de sauvegarde de l&#39;historique des fichiers&quot; pour trouver une version précédente d&#39;un fichier/dossier, et non aux points de restauration du système, comme cela se produit dans Windows 7. Pour activer l&#39;historique des fichiers dans Windows 10, suivez les instructions des articles suivants : </p> <ul> <li><strong> Articles Liés: </strong></li> <li> <ul> <li><a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment sauvegarder des fichiers personnels avec l&#39;historique des fichiers dans Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment créer des clichés instantanés de vos fichiers avec le planificateur de tâches dans Windows 10 </a></li> </ul> </li> </ul> <h4> Comment CORRIGER : Il n&#39;y a pas de versions précédentes de fichiers disponibles dans Windows 10. </h4> <p> Si &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Historique du fichier </a> &#39; est déjà activé* sur votre PC Windows 10, mais vous recevez le message &quot;Aucune version précédente n&#39;est disponible&quot;, lorsque vous essayez de restaurer la version précédente d&#39;un fichier ou d&#39;un dossier, suivez les instructions ci-dessous : </p> <p> * Remarque : les instructions ci-dessous <strong> ne fonctionne pas si le <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> L&#39;historique des fichiers n&#39;est pas DÉJÀ activé </a></strong> sur votre ordinateur Windows 10. </p> <p> 1. Téléchargez et installez le <a href=\"http://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowExplorer </a> utilitaire sur votre PC. <br> 2. Ouvrez &#39;ShadowExplorer&#39; et sélectionnez la date à partir de laquelle vous souhaitez restaurer le fichier. * </p> <p> * Remarque : Si vous ne voyez pas de date précédente, cela signifie que l&#39;historique des fichiers est désactivé. Gardez à l&#39;esprit que même si vous activez l&#39;historique des fichiers maintenant, le résultat sera le même, car l&#39;historique des fichiers crée des instantanés de vos fichiers à partir du moment où il est activé et ensuite. </p> <p><img src=\"images/image_thumb-40-348.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Accédez à l&#39;emplacement de stockage du fichier/dossier que vous souhaitez restaurer à sa version précédente. <br> 4. Lorsque vous localisez le fichier que vous souhaitez restaurer, faites un clic droit dessus et sélectionnez <strong> Exportation </strong> . </p> <p><img src=\"images/image_thumb-41-653.png\" alt=\"restore previous versions shadow explorer\" loading=\"lazy\"></p> <p> </p> <p> 5. Sélectionnez un autre disque (emplacement) pour enregistrer le fichier restauré et cliquez sur <strong> d&#39;accord </strong> . * </p> <p><strong> Important: </strong> Enregistrez le(s) fichier(s) restauré(s) sur un autre disque (par exemple un lecteur flash), et seulement après vous être assuré que vous avez les bons fichiers, copiez-les à l&#39;emplacement d&#39;origine afin d&#39;éviter d&#39;écraser les fichiers d&#39;origine. </p> <p><img src=\"images/image_thumb-38-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître ce problème. </p>"}