{"title":"CORRECTIF : l&#39;accès rapide ne fonctionne pas et ne peut pas taper dans la zone de recherche dans Windows 10 (résolu)","content":"<p> Si <strong> Accès rapide </strong> Le menu s ne fonctionne pas sous Windows 10, puis lisez ce didacticiel pour résoudre le problème. L&#39;option d&#39;accès rapide dans l&#39;explorateur de fichiers permet à l&#39;utilisateur de naviguer facilement vers les fichiers et dossiers récemment ouverts. Mais parfois, surtout lorsque vous avez déjà ouvert un fichier / dossier à partir d&#39;un lecteur externe (par exemple votre disque USB), qui est maintenant hors ligne, l&#39;accès rapide n&#39;affiche pas les fichiers récents ou vous ne pouvez pas taper dans la barre « Rechercher ». </p> <p><img src=\"images/image_thumb-2-490.png\" alt=\"FIX: Quick Access Not Working in Windows 10 (Solved)\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Comment CORRIGER : la fonction d&#39;accès rapide et la fonction de recherche ne fonctionnent pas dans Windows 10. </h4> <p> </p> <h6> Méthode 1. Redémarrez l&#39;Explorateur Windows. </h6> <p> La première méthode pour résoudre le problème d&#39;accès rapide consiste à redémarrer le processus de l&#39;Explorateur Windows à partir du Gestionnaire des tâches. Pour faire ça: </p> <p> 1. Appuyez sur <strong> Ctrl </strong> + <strong> Alt </strong> + <strong> Suppr </strong> ouvrir <strong> Gestionnaire des tâches </strong> . <br> 2. À <strong> Processus </strong> * onglet, mettez en surbrillance le <strong> Windows Explorer </strong> traiter et cliquer <strong> Redémarrer </strong> . </p> <p> * Remarque : Si vous ne voyez pas l&#39;onglet « Traiter », cliquez sur <strong> Plus de détails. </strong></p> <p><img src=\"images/image_thumb-951.png\" alt=\"restart windows explorer\" loading=\"lazy\"></p> <p><strong> </strong></p> <h6> Méthode 2. Activez l&#39;accès rapide aux éléments récents et effacez l&#39;historique de l&#39;explorateur de fichiers. </h6> <p> 1. Ouvrir <strong> Options de dossier. </strong> Pour ce faire, ouvrez l&#39;Explorateur Windows et dans le menu, accédez à <strong> Vue </strong> &gt; <strong> Options </strong> . </p> <p><img src=\"images/image_thumb-3-949.png\" alt=\"enable quick access windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Dans <strong> Général </strong> onglet, assurez-vous que les cases à cocher suivantes sont sélectionnées. </p> <ul> <li><strong> Afficher les fichiers récemment utilisés dans Accès rapide </strong></li> <li><strong> Afficher les dossiers fréquemment utilisés dans Accès rapide. </strong></li> </ul> <p> 3. Cliquez ensuite sur le <strong> Dégager </strong> pour effacer l&#39;historique de l&#39;explorateur de fichiers. </p> <p><img src=\"images/image_thumb-4-329.png\" alt=\"clear quick access history\" loading=\"lazy\"></p> <p> </p> <p> 3. Cliquez sur <strong> d&#39;accord </strong> et vérifiez si l&#39;accès rapide et la fonction de recherche fonctionnent. Si ce n&#39;est pas le cas, redémarrez « l&#39;explorateur de fichiers » en utilisant le gestionnaire de tâches (voir la méthode 1 ci-dessus) et vérifiez à nouveau. Si le problème persiste, passez à la méthode suivante. </p> <h6> Méthode 3. Effacer manuellement l&#39;historique des éléments récents. </h6> <p> La méthode suivante pour résoudre les problèmes avec les éléments récents d&#39;accès rapide ou avec la fonction &quot;Rechercher&quot; dans Windows 10, consiste à supprimer manuellement l&#39;historique des éléments récents. Pour faire ça: </p> <p> 1. Ouvrez l&#39;Explorateur Windows. <br> 2. Copiez et collez l&#39;adresse suivante dans la barre d&#39;adresse et appuyez sur <strong> Entrer </strong> : </p> <p> %AppData%\\Microsoft\\Windows\\Recent\\AutomaticDestinations </p> <p><img src=\"images/image_thumb-1-410.png\" alt=\"clear recent items windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3.  Appuyez sur <strong> Ctrl </strong> + <strong> UNE </strong> (pour sélectionner tous les éléments) et appuyez sur <strong> Effacer </strong> (ou clic droit &gt; <strong> Effacer </strong> ). </p> <p><img src=\"images/image_thumb-5-834.png\" alt=\"Delete Quick Access History\" loading=\"lazy\"></p> <p> </p> <p> 4. Copiez/collez ensuite l&#39;adresse suivante dans la barre d&#39;adresse et appuyez sur <strong> Entrer </strong> . </p> <p> %AppData%\\Microsoft\\Windows\\Recent\\CustomDestinations </p> <p><img src=\"images/image_thumb-6-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Appuyez sur <strong> Ctrl </strong> + <strong> UNE </strong> à nouveau (pour sélectionner tous les éléments) et appuyez sur <strong> Effacer. <br> </strong> 6. Appuyez maintenant sur <strong> Ctrl + Alt + Suppr </strong> ouvrir <strong> Gestionnaire des tâches </strong> . <br> 7. À <strong> Processus </strong> onglet, mettez en surbrillance le <strong> Windows Explorer </strong> traiter et cliquer <strong> Redémarrer </strong> . <br> 8. Normalement, les problèmes avec la fonction « Accès rapide » ou avec la fonction « Recherche » doivent avoir été résolus. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}