{"title":"Comment masquer ou afficher les barres de défilement dans le menu Démarrer, les paramètres ou les applications de Windows 10.","content":"<p> Comme vous l&#39;avez peut-être remarqué, dans Windows 10, lorsque vous démarrez le menu Démarrer, l&#39;application Paramètres ou lorsque vous travaillez dans une application Store, la barre de défilement est invisible par défaut et n&#39;apparaît que lorsque vous déplacez le curseur vers le côté droit de l&#39;ouverture. la fenêtre. Ce comportement était un peu ennuyeux et heureusement, Microsoft dans la dernière mise à jour des fonctionnalités de Windows 10 1803 (avril 2018) a ajouté l&#39;option de toujours afficher la barre de défilement dans toutes les fenêtres ouvertes (par exemple, dans le menu Démarrer de l&#39;application Paramètres, etc.) . </p> <p><img src=\"images/image_thumb-446.png\" alt=\"Show Scroll Bar in Windows 10 \" loading=\"lazy\"></p> <p> Ce didacticiel contient des instructions sur la façon de masquer ou d&#39;afficher toujours les barres de défilement dans toutes les fenêtres et applications ouvertes, dans Windows 10 v1803 (ou version ultérieure). </p> <h4> Comment afficher ou masquer la barre de défilement dans le menu Démarrer, les paramètres ou les applications de Windows 10. </h4> <p> 1. De la <strong> Démarrer </strong> <img src=\"images/image_thumb-38-810.png\" alt=\"image\" loading=\"lazy\"> menu choisir <strong> Paramètres </strong> <img src=\"images/image_thumb-44-476.png\" alt=\"image\" loading=\"lazy\"> . </p> <p> 2. Ouvrir <strong> Facile d&#39;accès </strong> Les paramètres. </p> <p><img src=\"images/image_thumb-1-268.png\" alt=\"display scroll bar windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Cliquez sur Affichage à gauche puis &quot;faites glisser&quot; le <strong> Masquer automatiquement les barres de défilement dans Windows </strong> basculer vers <strong> Désactivé. </strong></p> <p><img src=\"images/image_thumb-3-742.png\" alt=\"always show scroll bars windows 10\" loading=\"lazy\"></p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}