{"title":"CORRECTIF : Adobe Reader DC – Enregistrer sous est vide (résolu)","content":"<p> Après une mise à jour automatique d&#39;Adobe Reader DC, le problème suivant s&#39;est produit : La fonction &quot;Enregistrer sous&quot; affiche une fenêtre vide (vide) (vide) qui ne permet pas à l&#39;utilisateur d&#39;enregistrer le document PDF. </p> <p><img src=\"images/image_thumb-38-290.png\" alt=\"Adobe Reader DC - Save As is blank - fix\" loading=\"lazy\"></p> <p> Ce tutoriel contient des instructions pour résoudre le problème suivant : La fonction &quot;Enregistrer sous&quot;, ne fonctionne pas dans Adobe Reader DC sous Windows ou MAC OS. </p> <h4> Comment CORRIGER : Enregistrer sous est vide dans Adobe Reader DC. </h4> <h6> Méthode 1. Analysez votre système à la recherche de virus et de logiciels malveillants. </h6> <p> La première étape pour résoudre le problème des &quot;dossiers manquants&quot; dans Outlook consiste à vous assurer que votre système est exempt de virus/programmes malveillants. Pour cette tâche, suivez les instructions de ce guide : <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Comment analyser votre ordinateur contre les virus et autres programmes malveillants. </a></p> <p> </p> <h6> Méthode 2. Désactivez le stockage en ligne lors de l&#39;enregistrement de fichiers. </h6> <p> 1. Depuis Adobe Reader DC <strong> Éditer </strong> clic sur le menu <strong> Préférences </strong> . </p> <p><img src=\"images/image_thumb-39-749.png\" alt=\"save as not working fix in Adobe Reader DC\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Décocher </strong> les <strong> Afficher le stockage en ligne lors de l&#39;enregistrement de fichiers </strong> et cliquez <strong> D&#39;ACCORD. * </strong></p> <p> * Remarque : En option, décochez également la fonction &quot;Afficher le stockage en ligne lors de l&#39;ouverture de fichiers&quot;. </p> <p><img src=\"images/image_thumb-40-312.png\" alt=\"save as blank - abobe reader DC - fix\" loading=\"lazy\"></p> <p> </p> <p> 3. Essayez maintenant d&#39;utiliser la fonction Enregistrer sous dans Adobe DC. Le problème doit être résolu. </p> <p> </p> <h6> Méthode 3. Désinstallez et réinstallez Adobe Reader DC. </h6> <p> La dernière méthode pour résoudre les fenêtres vides dans la fonction &quot;Enregistrer sous&quot; d&#39;Adobe DC consiste à désinstaller complètement Adobe Reader DC, puis à télécharger et réinstaller la dernière version du programme à partir de <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> ici </a> . </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> S&#39;il vous plaît laissez un commentaire dans la section commentaires ci-dessous ou encore mieux : aimez et partagez cet article de blog dans les réseaux sociaux pour aider à faire passer le mot à ce sujet. </p>"}