{"title":"CORRECTIF : Outlook Recevoir a signalé l&#39;erreur 0x80042108 (Résolu)","content":"<p> Ce didacticiel contient des instructions étape par étape pour corriger l&#39;erreur 0x80042108 signalée dans la réception d&#39;Outlook. L&#39;erreur Outlook 0x80042108 se produit généralement lorsque vous avez mal saisi le nom du serveur de messagerie POP3 ou parce que vous n&#39;avez pas accès à Internet. </p> <p> Le problème, ce sont les détails. Outlook 2003, 2007, 2010 ou Outlook 2013, affiche l&#39;erreur suivante lors de la procédure d&#39;envoi-réception : « Erreur de réception signalée (0x80042108) : Outlook ne parvient pas à se connecter à votre serveur de messagerie entrant (POP3). Si vous continuez à recevoir ce message , contactez votre administrateur de serveur ou votre fournisseur d&#39;accès Internet (FAI)&quot;. </p> <p><img src=\"images/outlookerror_0x80042108-505.png\" alt=\"Outlook Error 0x80042108\" loading=\"lazy\"></p> <p> L&#39;erreur Outlook &quot;0x80042108&quot; peut se produire dans n&#39;importe quelle version d&#39;Outlook (2016, 2013, 2010 ou 2007) et apparaît lorsque le programme client de messagerie Outlook ne peut pas se connecter au serveur de messagerie. </p> <h4> Comment corriger l&#39;erreur 0x80042108 dans Outlook 2007, 2010, 2013 ou 2016. </h4> <h6> Étape 1. Vérifiez votre connexion Internet. </h6> <p> La première étape pour résoudre l&#39;erreur de réception Outlook 80042108 consiste à vérifier votre connectivité Internet. Alors, ouvrez votre navigateur Internet et visitez n&#39;importe quel site Web pour vous assurer que votre connexion Internet fonctionne. </p> <h6> Étape 2. Vérifiez les paramètres du serveur de messagerie POP3. </h6> <p> La deuxième étape pour corriger l&#39;erreur de réception Outlook 0x80042108 consiste à vérifier si vous avez spécifié les bons paramètres de serveur de messagerie. Alors, contactez votre fournisseur de messagerie et vérifiez avec lui que vous avez correctement tapé le nom du serveur de messagerie entrant et le numéro de port. Pour afficher et modifier les paramètres du serveur de messagerie : </p> <p> 1. Ouvrez Outlook. <br> 2. Accédez à <strong> Déposer </strong> -&gt; <strong> Paramètres du compte </strong> . </p> <p><img src=\"images/image_thumb-7-811.png\" alt=\"switch Account Mail Merge \" loading=\"lazy\"></p> <p> </p> <p> 3. Dans <strong> E-mail </strong> onglet, double-cliquez sur votre compte de messagerie, pour modifier/afficher ses paramètres. <br> 4. Vérifiez que vous avez défini le nom de serveur de courrier entrant correct dans la zone correspondante. <br> 5. Une fois terminé, cliquez sur <strong> Plus de réglages </strong> . </p> <p><img src=\"images/image_thumb-31-256.png\" alt=\"FIX: Outlook Receiving reported error 0x80042108\" loading=\"lazy\"></p> <blockquote><p> </p></blockquote> <p> 6. Cliquez sur le <strong> Avancée </strong> et vérifiez que vous avez spécifié le port et le paramètre SSL corrects pour le serveur entrant (POP3). </p> <p> </p> <p><img src=\"images/image_thumb-33-400.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Une fois terminé, cliquez sur <strong> d&#39;accord </strong> puis fermez toutes les fenêtres ouvertes. <br> 7. Testez à nouveau Outlook. </p> <h6></h6> <h6> Étape 3. Vérifiez vos paramètres antivirus et pare-feu. </h6> <p> Si vous utilisez un programme antivirus avec des fonctionnalités d&#39;analyse des e-mails, alors <a href=\"https://www.repairwin.com/how-to-disable-add-ins-in-word-outlook-or-excel-2016-2013-2010-2007-or-2003/\" target=\"_blank\" rel=\"nofollow noopener\"> désactiver le complément antivirus dans Outlook </a> ou désactiver temporairement la protection antivirus ou désinstaller le programme antivirus. De plus, vérifiez vos paramètres de pare-feu et assurez-vous que les ports du serveur de messagerie que vous utilisez ne sont pas bloqués par le programme de pare-feu. Plus précisément, dans les paramètres de votre pare-feu : </p> <p> A. Activez les fichiers suivants pour accéder à Internet : </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Activez les ports suivants pour accéder à Internet : </p> <ul> <li><strong> Port 110 </strong> (Si vous utilisez un serveur de messagerie entrant POP3 sans connexion cryptée) * </li> <li><strong> Port 995 </strong> (Si vous utilisez un serveur de messagerie entrant POP3 avec une connexion cryptée (SSL activé) </li> </ul> <ul> <li><strong> Port 143 </strong> (si vous utilisez un serveur de messagerie entrant IMAP sans connexion cryptée) </li> <li><strong> Port 993 </strong> (si vous utilisez un serveur de messagerie entrant IMAP avec une connexion cryptée (SSL activé) </li> </ul> <ul> <li><strong> Port 25 </strong> Si votre serveur de courrier sortant SMTP n&#39;utilise pas SSL. * </li> <li><strong> Port 465 </strong> ou alors <strong> 587 </strong> si votre serveur de courrier sortant SMTP utilise SSL </li> </ul> <p> * Remarque : par défaut, le port 25 est pour l&#39;accès sortant et le port 110 est pour l&#39;accès entrant. Si vous n&#39;êtes pas sûr des ports, contactez votre FAI ou votre administrateur système. </p> <p> </p> <p><strong> Aide supplémentaire : </strong> Si les méthodes ci-dessus ne vous aident pas, essayez ce qui suit : </p> <p><strong> UNE. </strong> Supprimez et ajoutez à nouveau votre compte de messagerie. <br> <strong> B. </strong><a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Réparer le fichier de données Outlook PST </a> . <br> <strong> C. </strong> Déconnectez-vous de la connexion VPN (si vous êtes connecté) <br> <strong> RÉ. </strong> Réparer l&#39;installation du bureau. Pour faire ça: </p> <blockquote><p> 1. Accédez à Windows <strong> Panneau de commande </strong> &gt; <strong> Programmes et fonctionnalités </strong> . <br> 2. Localisez et sélectionnez l&#39;application MS Office, puis cliquez sur <strong> Changer </strong> . <br> 3. Sélectionnez ensuite le <strong> réparation </strong> option. </p></blockquote> <p> </p> <p> </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? </p> <p> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}