{"title":"CORRECTIF : Windows 10 s&#39;exécute extrêmement lentement après l&#39;installation de v2004 ou Edge Chromιum (résolu)","content":"<p> De nombreux utilisateurs ont signalé que leur PC fonctionnait extrêmement lentement après l&#39;installation de la mise à jour Windows 10 2004 ou après l&#39;installation de la nouvelle version basée sur Chromium du navigateur Microsoft Edge. Si vous rencontrez l&#39;un des problèmes mentionnés ci-dessus, suivez les instructions de cet article pour les résoudre. </p> <p> Problème en détails : après avoir mis à niveau Windows 10 vers la version 2004, ou après avoir installé le <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> mise à jour, qui installe automatiquement le nouveau navigateur Edge (version Chrome), Windows prend beaucoup de temps au démarrage ou s&#39;exécute très lentement. </p> <h4> Comment CORRIGER : Problèmes de démarrage lent et de performances lentes dans Windows 10 2004. </h4> <h6> Méthode 1. Installez les mises à jour Windows disponibles et mettez à jour les pilotes de périphérique. </h6> <p> La première méthode, pour résoudre les problèmes de performances lentes dans Windows 10, consiste à effectuer les étapes suivantes : </p> <ul> <li><strong> Étape 1. </strong> Téléchargez et installez toutes les mises à jour Windows disponibles. </li> <li><strong> Étape 2. </strong> Téléchargez et installez les derniers pilotes Windows 10 pour la carte graphique. </li> <li><strong> Étape 3. </strong> Si vous utilisez un programme antivirus tiers, désinstallez-le et vérifiez si le problème de lenteur des performances persiste. Sinon, installez la dernière version du programme AV. </li> </ul> <p> </p> <h6> Méthode 2. Désinstallez la version Microsoft Edge Chromium. </h6> <p> La deuxième méthode pour résoudre les problèmes de performances lentes dans Windows 10 consiste à désinstaller la version Microsoft Edge Chromium (si elle est installée). </p> <h5> Étape 1. Vérifiez si la nouvelle version basée sur Chromium de Microsoft Edge est installée. </h5> <p> 1. Depuis le menu Démarrer <img src=\"images/image_thumb2_thumb_thumb-381.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> Cliquez sur <strong> Paramètres </strong><img src=\"images/image_thumb-66-515.png\" alt=\"image\" loading=\"lazy\"> et cliquez <strong> Applications. <br> </strong> 2. Si le <strong> Applications et fonctionnalités </strong> localisez l&#39;application Microsoft Edge et en fonction de son icône, procédez comme suit : </p> <ul> <li> Si vous voyez cette image d&#39;icône <img src=\"images/image_thumb-32-976.png\" alt=\"image\" loading=\"lazy\"> , cela signifie que la nouvelle version de Microsoft Edge basée sur Chromium est déjà installée sur votre ordinateur. Dans ce cas, rendez-vous sur <strong> <a href=\"#step-2\" target=\"_blank\" rel=\"nofollow noopener\"> étape 2 </a></strong> pour désinstaller Edge Chromium de votre PC. </li> <li> Si vous voyez cette image d&#39;icône <img src=\"images/image_thumb-33-372.png\" alt=\"image\" loading=\"lazy\"> , cela signifie que la nouvelle version basée sur Chromium n&#39;est pas encore installée sur votre ordinateur. Dans ce cas, passez à <a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"><strong> méthode-3 </strong></a> . </li> </ul> <p><img src=\"images/image_thumb-71-268.png\" alt=\"FIX: Windows 10 Running Extremely Slow after 2004 Update\" loading=\"lazy\"></p> <p> </p> <h5> Étape 2. Supprimez Edge Chromium du PC. </h5> <p> Pour désinstaller le nouveau Edge basé sur Chromium dans Windows 10 : </p> <p> 1. Accédez au dossier suivant sur votre PC : * </p> <ul> <li> C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\85.0.564.41\\Installer </li> </ul> <p> * Remarque : Le nom du dossier &quot;85.0.564.41&quot; indique la version installée de la nouvelle version de Chromium et peut différer sur votre PC. </p> <p> 2. Sélectionnez le chemin du dossier dans la barre d&#39;adresse et cliquez avec le bouton droit de la souris &gt; <strong> Copie. </strong></p> <p><img src=\"images/image_thumb-35-379.png\" alt=\"Uninstall Edge Chromiun\" loading=\"lazy\"></p> <p> </p> <p> 3. Ouvrir <strong> Invite de commandes en tant qu&#39;administrateur, </strong> taper <strong> CD </strong> puis appuyez sur <strong> CTRL+V </strong> à coller dans le chemin du dossier copié. Une fois terminé, appuyez sur <strong> Entrer </strong> . * </p> <p> * ex. : Dans l&#39;exemple actuel, la commande sera : </p> <p><em> cd C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\85.0.564.41\\Installer </em></p> <p><img src=\"images/image_thumb-36-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Maintenant, donnez la commande ci-dessous (Copier/Coller) dans l&#39;invite de commande pour supprimer la version Chromium du navigateur Microsoft Edge de votre PC. </p> <ul> <li> setup.exe –uninstall –niveau système –verbose-logging –force-uninstall </li> </ul> <p><img src=\"images/image_thumb-37-229.png\" alt=\"Remove Edge Chromiun\" loading=\"lazy\"></p> <p> 5. Une fois la commande ci-dessus exécutée, l&#39;ancienne version d&#39;EDGE sera à nouveau activée. Redémarrez votre PC pour appliquer les modifications. <br> 6. Après le redémarrage, procédez à l&#39;installation manuelle du <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> nouveau navigateur Edge basé sur Chromium </a> sur votre PC, afin d&#39;éviter d&#39;installer à nouveau la mise à jour problématique KB4559309. </p> <p> </p> <h6> Méthode 3. Restaurez Windows 10 dans sa version précédente. </h6> <p> 1. De la <strong> Démarrer </strong> menu <img src=\"images/image_thumb2_thumb_thumb-872.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> ouvert <strong> Paramètres </strong> <img src=\"images/image_thumb-66-969.png\" alt=\"image\" loading=\"lazy\"> puis cliquez sur <strong> Mise à jour et sécurité. </strong></p> <p> 2. Choisissez <strong> Récupération </strong> sur la gauche, puis, sous la section « Revenir à la version précédente de Windows 10 », cliquez sur le bouton <strong> Commencer </strong> bouton. </p> <p><img src=\"images/image_thumb-4-708.png\" alt=\"Restore Windows to earlier version\" loading=\"lazy\"></p> <p> 3. Suivez les invites à l&#39;écran pour restaurer Windows 10 à sa version précédente. <br> 4. Après être revenu à la version précédente de Windows 10, votre ordinateur devrait à nouveau fonctionner normalement et sans délai. </p> <p> </p> <h6> Méthode 4. Réparez Windows 10. </h6> <p> La méthode suivante pour résoudre les problèmes de performances lentes dans Windows 10 consiste à réparer Windows à l&#39;aide des commandes SFC et DISM : </p> <p> 1. Ouvrir <strong> Invite de commandes en tant qu&#39;administrateur </strong> . <br> 2. Dans l&#39;invite de commande, donnez la commande dism suivante et appuyez sur <strong> Entrer: </strong></p> <ul> <li><strong> DISM.exe /En ligne /Cleanup-image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-175.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> </p> <p> 3. Lorsque l&#39;opération DISM est terminée, tapez la commande suivante et appuyez sur <strong> Entrer </strong> : </p> <ul> <li><strong> sfc/scannow </strong></li> </ul> <p><img src=\"images/image_thumb31-316.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Attendez maintenant que le vérificateur de fichiers système répare les fichiers système Windows. <br> 5. Lorsque cela est fait, <strong> redémarrer </strong> votre ordinateur et voyez si le problème est résolu. </p> <p> C&#39;est tout les gens! Cela a-t-il fonctionné pour vous? <br> Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}