{"title":"CORRECTIF : Problèmes d&#39;installation de Windows 10 21H1.","content":"<p> Microsoft a publié le 18 mai 2021 la dernière mise à jour majeure pour Windows 10 (alias : « Featured Update to Windows 10, version 21H1 »), principalement avec des améliorations de sécurité dans le travail à distance et dans l&#39;ouverture de documents, tandis que Windows Defender Application Guard vous protège des menaces de sécurité. </p> <p> Au moment où cet article est écrit, Microsoft n&#39;a annoncé que les problèmes suivants avec la mise à jour Windows 21H1 : </p> <ul> <li><b><a href=\"https://docs.microsoft.com/en-us/windows/release-health/status-windows-10-21h1#1605msgdesc\" target=\"_blank\" rel=\"nofollow noopener\"> Un bruit aigu peut être entendu lors de l&#39;utilisation de l&#39;audio 5.1 avec certains paramètres </a></b><br> Certaines combinaisons d&#39;applications, de périphériques audio et de paramètres Windows peuvent produire un bruit aigu lors de l&#39;utilisation de l&#39;audio 5.1 <br> Version du système d&#39;exploitation 19043.906. </li> <li><b><a href=\"https://docs.microsoft.com/en-us/windows/release-health/status-windows-10-21h1#1528msgdesc\" target=\"_blank\" rel=\"nofollow noopener\"> La saisie automatique de Furigana peut ne pas fonctionner comme prévu </a></b><br> Dans certaines circonstances, la fonction d&#39;entrée/conversion automatique de Furigana peut ne pas fonctionner comme prévu dans les applications. </li> </ul> <p> * Remarque : ce bogue est découvert pour la première fois après l&#39;installation après l&#39;installation du <a href=\"https://support.microsoft.com/help/5000842\" target=\"_blank\" rel=\"nofollow noopener\"> KB5000842 </a> mettre à jour. Pour atténuer ce problème, vous pouvez essayer une ou plusieurs des solutions suivantes : </p> <ol> <li> Diffuser la vidéo ou l&#39;audio dans un navigateur Web ou une autre application, au lieu de l&#39;application affectée par ce problème. </li> <li> Activer <b> Son spatial </b> paramètres par un clic droit ou un appui long sur le <b> icône de volume </b> dans le <b> zone de notification </b> , en sélectionnant <b> Son spatial (Désactivé) </b> et en sélectionnant l&#39;une des options disponibles. </li> </ol> <h5> Comment obtenir la mise à jour Windows 10 mai 2021 (21H1). </h5> <p> Afin de mettre à jour votre système vers Windows 10, version 21H1, vous devez exécuter Windows 10, version 2004 ou 20H2. Pour connaître la version de Windows 10 installée, rendez-vous sur <strong> Démarrer </strong> -&gt; <strong> Paramètres </strong> -&gt; <strong> Système </strong> -&gt; <strong> À propos. </strong></p> <p><img src=\"images/image_thumb-64-863.png\" alt=\"Find Out Windows 10 version\" loading=\"lazy\"></p> <p> </p> <p> Pour installer la mise à jour des fonctionnalités vers Windows 10, version 21H1, accédez à <strong> Démarrer </strong> -&gt; <strong> Paramètres </strong> -&gt; <strong> Mise à jour et sécurité </strong> et cliquez <strong> Vérifiez les mises à jour. </strong> Si la mise à jour est disponible pour votre appareil, elle apparaîtra après la vérification de la mise à jour. </p> <p> Si vous souhaitez installer la mise à jour Windows 10 21H1 sans problème, <strong> n&#39;appuie pas </strong> les <strong> Télécharger et installer </strong> lien maintenant et suivez les instructions ci-dessous pour éviter ou résoudre les problèmes d&#39;installation. </p> <p><img src=\"images/image_thumb-61-537.png\" alt=\"How to Install Windows 10 21H1 Update\" loading=\"lazy\"></p> <h2> Comment éviter les problèmes d&#39;installation de la mise à jour de Windows 10 21H1. </h2> <p> Avant d&#39;installer la mise à jour Windows 10 21H1, effectuez les actions suivantes : </p> <ul> <li><strong> Étape 1. </strong> Assurez-vous d&#39;avoir <strong> assez d&#39;espace libre </strong> sur votre disque. Windows 10 nécessite au moins 32 Go d&#39;espace libre pour la mise à niveau. </li> <li><strong> Étape 2. </strong> Cours <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Nettoyage de disque </a> et supprimez tous les fichiers inutiles. </li> <li><strong> Étape 3. </strong> Téléchargez et <strong> installer </strong> dernier <a href=\"https://portal.msrc.microsoft.com/en-us/security-guidance/advisory/ADV990001\" target=\"_blank\" rel=\"nofollow noopener\"> Pile d&#39;entretien </a> mise à jour en fonction de votre version de Windows 10. </li> <li><strong> Étape 4. </strong> <strong> Déconnectez tous les lecteurs USB externes et cartes SD </strong> et tout autre périphérique USB qui n&#39;a pas besoin d&#39;installer Windows. </li> <li><strong> Étape 5. </strong> <strong> Désinstaller temporairement </strong> quelconque <strong> Antivirus/Sécurité non-Microsoft </strong> Logiciel. </li> <li><strong> Étape 6. </strong> <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Désactiver BitLocker </a> chiffrement du lecteur (s&#39;il est activé). </li> <li><strong> Étape 7 </strong> . <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Créer un point de restauration système </a> de l&#39;état actuel de Windows, pour y restaurer votre système si la mise à jour échoue. </li> <li><strong> Étape 8. </strong> <strong> Désactiver les programmes de démarrage </strong> . Pour ce faire, appuyez sur le <strong> CTRL </strong> + <strong> CHANGEMENT </strong> + <strong> ESC </strong> touches pour ouvrir le gestionnaire de tâches. Dans le Gestionnaire des tâches, sélectionnez le <strong> Commencez </strong> onglet et <strong> désactiver </strong> tous les programmes qui s&#39;exécutent au démarrage de Windows. </li> </ul> <p><img src=\"images/image_thumb-62-351.png\" alt=\"image\" loading=\"lazy\"></p> <p> Après avoir effectué les actions ci-dessus, accédez à <strong> Démarrer </strong> -&gt; <strong> Paramètres </strong> -&gt; <strong> Mise à jour et sécurité </strong> et cliquez sur le <strong> Télécharger et installer </strong> pour installer le <strong> Mise à jour des fonctionnalités vers Windows 10, version 21H1. </strong> Attendez maintenant (environ 20-30 minutes), jusqu&#39;à ce que Windows vous invite à <strong> Redémarrer maintenant </strong> votre système pour terminer l&#39;installation de la mise à jour. </p> <p><img src=\"images/image_thumb-63-447.png\" alt=\"FIX Windows 10 21H1 Installation Problems.\" loading=\"lazy\"></p> <p> </p> <p> Après quelques redémarrages et si tout se passe bien, la mise à jour 21H1 sera installée sur votre système sans problème. Si cela ne se produit pas et que la mise à jour de Windows 10 21H1 échoue avec une erreur (par exemple, « La mise à jour des fonctionnalités vers Windows 10, version 21H1 a échoué à installer - Code d&#39;erreur : 0x800f0984 »), continuez à lire ci-dessous pour résoudre le problème. </p> <h2> Comment RÉSOUDRE les problèmes d&#39;installation de la mise à jour Windows 10 21H1. </h2> <p> Si la mise à jour de Windows 10 21H1 n&#39;a pas réussi à s&#39;installer, suivez les méthodes ci-dessous pour résoudre le problème. </p> <h3> Méthode 1. Mettez à jour vers Windows 10 21H1 à l&#39;aide de l&#39;assistant de mise à jour. </h3> <p> 1. Accédez à <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Site de téléchargement de Windows 10 </a> et cliquez sur le <strong> Mettez à jour maintenant </strong> bouton. </p> <p><img src=\"images/image_thumb-65-764.png\" alt=\"Download Windows 10 21H1 \" loading=\"lazy\"></p> <p> 2. Enregistrez le fichier &quot;Windows10Upgrade9252.exe&quot; sur votre bureau. <br> 3. Double-cliquez sur le fichier téléchargé pour ouvrir le <strong> Assistant de mise à niveau Windows </strong> . <br> 4. Cliquez sur <strong> Mettez à jour maintenant </strong> pour lancer la mise à jour. </p> <p><img src=\"images/image_thumb-61-394.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Laissez Windows terminer le téléchargement et la phase de vérification. <br> 6. Lorsque la vérification atteint 100 %, <strong> déconnectez votre ordinateur d&#39;Internet </strong> , (ou réglez-le sur &quot; <strong> Mode avion </strong> &quot; si vous possédez un ordinateur portable). <br> 7. Ensuite, attendez que la mise à jour Windows 10 21H1 soit installée sur votre système. <br> 8. Enfin, lorsque vous y êtes invité, <strong> redémarrer </strong> votre système pour installer la mise à jour. </p> <p> </p> <h3> Méthode 2. Mettez à jour vers Windows 10 21H1 à partir d&#39;ISO ou d&#39;USB. </h3> <p> La méthode suivante pour contourner les problèmes lors de l&#39;installation de la mise à jour 21H1 dans Windows 10 consiste à mettre à jour Windows à partir d&#39;un fichier ISO. Pour faire ça: </p> <p><strong> Étape 1. Téléchargez Windows 10 dans un fichier ISO. </strong></p> <p> 1. Accédez à <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Page de téléchargement de Windows 10 </a> et cliquez <strong> Télécharger l&#39;outil maintenant </strong> pour télécharger le <strong> Outil de création de médias </strong> . </p> <p><img src=\"images/image_thumb-66-613.png\" alt=\"Update to Windows 10 21H1 \" loading=\"lazy\"></p> <p> 2. Exécutez l&#39;outil de création de média et <strong> J&#39;accepte </strong> les termes de la licence au premier écran. <br> 3. Sélectionnez <strong> Créer un support d&#39;installation pour un autre PC </strong> . </p> <p><img src=\"images/image_thumb1_thumb-386.png\" alt=\"create Windows 10 DVD\" loading=\"lazy\"></p> <p> 4. Sur l&#39;écran &quot;Langue, architecture et édition&quot;, cliquez sur <strong> Suivant. <br> </strong> 5. Sélectionnez <strong> fichier ISO </strong> et cliquez <strong> Suivant </strong> . </p> <p><img src=\"images/image_thumb-30-314.png\" alt=\"download windows 10 iso\" loading=\"lazy\"></p> <p> 6. <strong> Sauvegarder </strong> le fichier &#39;Windows.iso&#39; sur votre bureau. <br> 7. L&#39;outil de création de support va maintenant commencer à télécharger Windows 10 au format ISO. <br> 8. Une fois le téléchargement terminé, <strong> Fermer </strong> l&#39;outil de création de médias. </p> <p><strong> Étape 2. Mettez à jour Windows 10 à partir du fichier ISO. </strong></p> <p> 1. <strong> Double-cliquez </strong> au <strong> Windows.ISO </strong> fichier sur votre bureau. <br> 2. Ouvrez l&#39;explorateur de fichiers et explorez le contenu de la nouvelle lettre de lecteur créée après l&#39;ouverture du fichier ISO. <br> 3. <strong> Double-cliquez </strong> à <strong> setup.exe </strong> puis cliquez <strong> Suivant </strong> pour installer Windows 10. </p> <p><img src=\"images/image_thumb-58-627.png\" alt=\"FIX Error 0x8007025D-0x2000C Windows 10 Update\" loading=\"lazy\"></p> <p> 4. <strong> J&#39;accepte </strong> les termes de la licence, puis cliquez sur <strong> Installer. </strong></p> <p><img src=\"images/image_thumb-59-853.png\" alt=\"Install Windows from ISO file\" loading=\"lazy\"></p> <p> 5. Attendez maintenant la fin du processus de mise à jour. * </p> <p> * Remarque : Si la mise à jour échoue à nouveau, <a href=\"https://www.repairwin.com/create-windows-usb-with-rufus-iso-to-usb/\" target=\"_blank\" rel=\"nofollow noopener\"> graver le fichier ISO Windows sur une clé USB </a> puis essayez de <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> réparer et mettre à niveau Windows 10 à partir de l&#39;USB. </a></p> <p> </p> <h3> Méthode 3. Réparez le magasin de composants Windows et les fichiers système. </h3> <p> 1. Ouvrir <strong> Invite de commandes en tant qu&#39;administrateur </strong> . <br> 2. Dans l&#39;invite de commande, donnez la commande suivante et appuyez sur <strong> Entrer: </strong></p> <ul> <li><strong> DISM /En ligne /Cleanup-Image /StartComponentCleanup </strong></li> </ul> <p><img src=\"images/image_thumb6_thumb-396.png\" alt=\"image_thumb[6]\" loading=\"lazy\"></p> <p> 3. Une fois le processus terminé, donnez la commande suivante : </p> <ul> <li><strong> DISM.exe /En ligne /Cleanup-image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-789.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Lorsque l&#39;opération DISM est terminée, tapez la commande suivante et appuyez sur <strong> Entrer </strong> : </p> <ul> <li><strong> sfc/scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-729.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Attendez maintenant que le vérificateur de fichiers système répare les fichiers système Windows. <br> 6. Lorsque cela est fait, <strong> redémarrer </strong> ton ordinateur. <br> 7. Après le redémarrage, ouvrez <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Nettoyage de disque </a> et ouvrir <strong> Nettoyer les fichiers système. </strong> Sélectionnez pour supprimer les fichiers suivants et cliquez sur <strong> D&#39;ACCORD: </strong></p> <ul> <li> Fichiers d&#39;installation temporaires de Windows </li> <li> Nettoyage de mise à jour Windows </li> <li> Fichiers journaux de mise à niveau de Windows. </li> </ul> <p><img src=\"images/image_thumb-60-389.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. Une fois terminé, utilisez les instructions de la méthode 1 ci-dessus pour mettre à jour Windows à l&#39;aide de l&#39;assistant de mise à jour Windows 10 21H1. </p> <p> </p> <h3> Méthode 4. Nettoyer l&#39;installation de Windows 10. </h3> <p> La dernière méthode, pour résoudre les problèmes de mise à jour de Windows 10 21H1, consiste à effectuer une nouvelle installation de Windows 10 sur votre système. * Pour ce faire, lisez les instructions sur cet article : <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Comment nettoyer l&#39;installation de Windows 10 </strong></a> . </p> <p><strong> * Important: </strong> L&#39;installation propre de Windows 10 signifie que tous vos fichiers et paramètres seront perdus pendant le processus d&#39;installation. Alors, continuez et <strong> sauvegardez tous vos fichiers et paramètres importants sur un autre support de stockage </strong> (par exemple sur un lecteur USB externe) avant de continuer à nettoyer l&#39;installation de Windows 10. </p> <p> C&#39;est tout les gens ! Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}