{"title":"Formulaire de contact 7 ne fonctionne pas : une erreur s&#39;est produite lors de l&#39;envoi de votre message. Veuillez réessayer plus tard. (Résolu)","content":"<p> Si le formulaire de contact 7 sur votre site WordPress ne fonctionne pas, continuez à lire ci-dessous pour résoudre le problème. Contact Form 7 est l&#39;un des plugins WordPress gratuits les plus connus, qui vous aide à créer, gérer et personnaliser le formulaire de contact sur votre site WordPress. Récemment, j&#39;ai découvert que le plugin &quot;Contact Form 7&quot; sur mon site (et dans beaucoup d&#39;autres), a cessé de fonctionner avec l&#39;erreur &quot;Il y a eu une erreur pour envoyer votre message. Veuillez réessayer plus tard&quot;, qui est entouré d&#39;un rectangle orange , après avoir envoyé le formulaire. </p> <p><img src=\"images/image_thumb-14-729.png\" alt=\"Contact Form 7: There was an error to send your message. Please try again later\" loading=\"lazy\"></p> <p> Ce tutoriel contient des instructions pour corriger l&#39;erreur &quot;Il y a eu une erreur lors de l&#39;envoi de votre message. Veuillez réessayer plus tard&quot; dans une boîte orange, après avoir soumis le formulaire de contact. </p> <h4> Comment CORRIGER : le formulaire de contact ne fonctionne pas avec l&#39;erreur &quot;Une erreur s&#39;est produite lors de l&#39;envoi de votre message&quot;. </h4> <p> Si votre formulaire de contact 7 sur votre site WordPress, ne fonctionne plus, suivez les étapes ci-dessous : </p> <h6> Étape 1. Valider le formulaire de contact 7. </h6> <p> 1. Accédez à votre tableau de bord d&#39;administration WordPress et cliquez sur <strong> Contacter </strong> &gt; <strong> Formulaires de contact. </strong><br> 2. En haut de la page, vérifiez s&#39;il y a un message d&#39;erreur indiquant &quot;Une mauvaise configuration entraîne un échec de la livraison du courrier ou d&#39;autres problèmes. Validez vos formulaires de contact maintenant&quot;. <br> 3. Si vous voyez ce message,* alors <strong> Cliquez sur </strong> les <strong> Valider la configuration du formulaire de contact 7 </strong> relier. </p> <p> * Remarque : Si vous ne voyez pas ce message, passez à l&#39;étape 2. </p> <p><img src=\"images/image_thumb-813.png\" alt=\"Validate Contact Form 7 Configuration \" loading=\"lazy\"></p> <p> 4. Sur l&#39;écran suivant, cliquez sur le bouton <strong> Validez 2 formulaires de contact maintenant </strong> bouton. </p> <p><img src=\"images/image_thumb-1-270.png\" alt=\"Validate Contact Form\" loading=\"lazy\"></p> <p> 5. Lorsque la validation de la configuration est terminée, vous devriez recevoir le message &quot;Aucun formulaire de contact invalide n&#39;a été trouvé&quot;. </p> <p><img src=\"images/image_thumb-17-318.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Testez votre formulaire de contact et si l&#39;erreur persiste, passez à l&#39;étape 2 ci-dessous. </p> <h6> Étape 2. Configurez le formulaire de contact 7 avec les clés reCAPTCHA V3. </h6> <p> Au cours de mes recherches, j&#39;ai découvert que les dernières versions du formulaire de contact 7 (v5.1 et versions ultérieures) utilisent l&#39;API reCAPTCHA v3 pour vous protéger contre le spam et d&#39;autres types d&#39;abus automatisés. Ainsi, sur cette base, vous disposez des deux options suivantes pour résoudre l&#39;erreur du formulaire de contact « Une erreur s&#39;est produite lors de l&#39;envoi de votre message. Veuillez réessayer plus tard. » : * </p> <ul> <li> <p><strong> Option 1. </strong> Pour configurer le formulaire de contact 7 avec les clés reCAPTCHA V3. </p> </li> <li> <p><strong> Option 2. </strong> Pour utiliser le <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"noopener noreferrer\"> Formulaire de contact 7 – reCaptcha v2 </a> plugin pour vos formulaires de contact. </p> </li> </ul> <p> * Remarque : Dans cet article, je vais vous montrer comment configurer le formulaire de contact 7 avec les clés reCAPTCHA V3. Si vous ne souhaitez pas utiliser la protection reCAPTCHA V3, désinstallez le plugin &#39;Contact Form 7&#39; et installez le <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"nofollow noopener\"> Formulaire de contact 7 – reCaptcha v2 </a> brancher. </p> <p><strong> Pour configurer le formulaire de contact 7 avec les clés reCAPTCHA V3 : </strong></p> <p> 1. Connectez-vous à votre compte Google, vous avez utilisé pour configurer reCAPTCHA sur votre site et accédez au <a href=\"https://www.google.com/recaptcha/admin\" target=\"_blank\" rel=\"nofollow noopener\"> La console d&#39;administration reCAPTCHA de Google. </a></p> <p> 2. Cliquez sur Paramètres <img src=\"images/image_thumb-2-494.png\" alt=\"image\" loading=\"lazy\"> icône. </p> <p><img src=\"images/image_thumb-3-786.png\" alt=\"Setup Contact Form 7 with recaptcha v3\" loading=\"lazy\"></p> <p> 3. Cliquez sur le <strong> Corbeille </strong> icône <img src=\"images/image_thumb-4-167.png\" alt=\"image\" loading=\"lazy\"> et <strong> effacer </strong> les <strong> clés reCAPTCHA V2. </strong></p> <p><img src=\"images/image_thumb-5-757.png\" alt=\"Recaptcha v3\" loading=\"lazy\"></p> <p> 4. Cliquez sur l&#39;icône Plus <img src=\"images/image_thumb-6-851.png\" alt=\"image\" loading=\"lazy\"> pour enregistrer à nouveau votre site. </p> <p><img src=\"images/image_thumb-7-337.png\" alt=\"Register Site with Recaptcha\" loading=\"lazy\"></p> <p> 5. À l&#39;écran « Enregistrer un nouveau site » : </p> <blockquote> <p> une. <strong> Tapez un nom </strong> pour identifier votre site dans le futur, <br> b. <strong> Choisir </strong> les <strong> reCAPTCHA v3 </strong> taper. <br> c. <strong> Taper </strong> les <strong> nom de domaine </strong> de votre site. <br> ré. <strong> J&#39;accepte </strong> les <strong> Conditions d&#39;utilisation de reCAPTCHA. </strong><br> e. Cliquez sur <strong> NOUS FAIRE PARVENIR. </strong></p> </blockquote> <p><img src=\"images/image_thumb-8-227.png\" alt=\"Register Site with Recaptcha V3\" loading=\"lazy\"></p> <p> 6. Après l&#39;enregistrement, vous voyez un écran avec le <strong> CLÉ DU SITE </strong> et le <strong> CLEF SECRÈTE </strong> . <br> 7. Cliquez sur <strong> COPIER LA CLÉ DU SITE </strong> et <strong> NE PAS FERMER </strong> cette fenêtre. </p> <p><img src=\"images/image_thumb-9-995.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. Dans une autre fenêtre de navigateur, accédez à votre tableau de bord d&#39;administration WordPress et cliquez sur <strong> Contacter </strong> &gt; <strong> L&#39;intégration. </strong></p> <p> 9. Cliquez sur le <strong> Intégration de la configuration </strong> bouton. </p> <p><img src=\"images/image_thumb-10-834.png\" alt=\"Integrate Recaptcha in Contact Form 7\" loading=\"lazy\"></p> <p> 10. Cliquez sur le <strong> Supprimer les clés </strong> pour supprimer les clés reCAPTCHA V2. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"image\" loading=\"lazy\"></p> <p> 11. <strong> Pâte </strong> le nouveau <strong> Clé du site </strong> puis Copier &amp; Coller le nouveau <strong> Clef secrète </strong> à partir de la console d&#39;administration reCAPTCHA, puis cliquez sur <strong> Sauvegarder les modifications. </strong></p> <p><img src=\"images/image_thumb-12-147.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. <strong> Effacer </strong> les <strong> Cacher </strong> sur votre site. <br> 13. Ouvrez une nouvelle fenêtre de navigateur et testez votre formulaire de contact. </p> <p> C&#39;est tout les gens ! Cela a-t-il fonctionné pour vous? Veuillez laisser un commentaire dans la section commentaire ci-dessous ou encore mieux : aimez et partagez cet article de blog sur les réseaux sociaux pour aider à faire connaître cette solution. </p>"}