{"title":"Bagaimana Anda masih dapat meng-upgrade Windows 7 ke Windows 10 secara gratis. (November 2020)","content":"<p> Meskipun Microsoft telah mengakhiri tawaran untuk memperbarui PC Windows 7 Anda ke Windows 10 secara gratis beberapa tahun sekarang, Anda masih dapat meningkatkan PC Windows 7, 8, atau 8.1 Anda ke Windows 10 secara gratis, bahkan di bulan November 2020! Jadi, jika Anda memiliki komputer berbasis Windows 7, atau Windows 8/8.1, Anda dapat meningkatkannya ke Windows 10, dengan mengikuti petunjuk di bawah ini.* </p> <p> * Catatan: Setelah instalasi Windows 10 akan diaktifkan secara otomatis dengan lisensi digital. </p> <p><img src=\"images/image_thumb-47-781.png\" alt=\"How to Still Upgrade Windows 7 to Windows 10 for Free\" loading=\"lazy\"></p> <h4></h4> <h4> Cara UPDATE ke WINDOWS 10 Gratis. </h4> <p> Untuk memperbarui PC Windows 7, 8, atau 8.1 secara gratis ke Windows 10, Anda memiliki opsi berikut: </p> <ul></ul> <h6><strong> Pilihan 1 </strong> . Bersihkan Instal Windows 10 dari USB. </h6> <p><strong> Persyaratan: </strong> Kunci produk Windows 7 Asli, atau Windows 8/8.1 diinstal &amp; diaktifkan. jika Anda tidak memiliki kunci Windows 7 <strong> lewati ke </strong><a href=\"#option-2\" target=\"_blank\" rel=\"nofollow noopener\"><strong> pilihan 2 </strong></a><strong> . </strong></p> <p> Jika Anda memiliki kunci produk Windows 7 asli, atau Anda memiliki versi Windows 8/8.1 yang diaktifkan di PC, Anda dapat melakukan <strong> bersihkan instalasi Windows 10 dari USB </strong> media, dengan menggunakan petunjuk pada tutorial ini: <a title=\"https://www.repairwin.com/clean-install-windows-10\" href=\"https://www.repairwin.com/clean-install-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Membersihkan Instal Windows 10. </a> * </p> <p><strong> Catatan: </strong><br> 1. &quot;Pemasangan Bersih&quot; berarti pemasangan baru sistem operasi setelah <strong> menghapus semua yang ada di disk </strong> . Jadi, buat cadangan file Anda ke perangkat penyimpanan eksternal sebelum melanjutkan. </p> <p> 2. Untuk menemukan kunci produk Windows 7, cari stiker (seperti di bawah) pada casing komputer Anda, atau jika Anda telah membeli salinan fisik Windows (misalnya pada DVD), kunci produk harus ada pada label atau kartu di dalam kotak tempat Windows masuk. </p> <p> Product key biasanya berupa stiker dengan 25 digit nomor yang diketik di atasnya dan terlihat seperti ini: XXXXX- XXXXX- XXXXX- XXXXX- XXXXX. </p> <p><img src=\"images/image_thumb-34-760.png\" alt=\"Windows 7 Product key\" loading=\"lazy\"></p> <p> </p> <p> 3. Untuk memastikan bahwa salinan Windows Anda sudah diaktifkan: </p> <blockquote><p> 1. <strong> Klik kanan </strong> di <strong> Komputer </strong> ikon di Explorer dan klik <strong> Properti </strong> . <br> 2. Pada status Aktivasi, pastikan bahwa <strong> Windows diaktifkan </strong> . </p></blockquote> <blockquote> <p><img src=\"images/image_thumb-35-328.png\" alt=\"Windows Activation Status\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> </p> <p> </p> <h6> Opsi 2. Perbarui ke Windows 10 menggunakan &quot;File WINDOWS.ISO atau &quot;Windows 10 Upgrade Assistant&quot;. </h6> <p><strong> Persyaratan: </strong> Versi Windows 7, 8, atau 8.1 yang diaktifkan.* </p> <p> Jika Anda tidak dapat menemukan kunci Produk Windows 7, tetapi Anda memiliki versi Windows 7, 8 atau 8.1 yang asli dan diaktifkan, maka Anda masih dapat memperbarui PC Anda ke Windows 10 dengan mengikuti langkah-langkah di bawah ini: </p> <h2> Langkah 1. Pastikan Windows Diaktifkan. </h2> <p> Ikuti petunjuk di <a href=\"#note-3\" target=\"_blank\" rel=\"nofollow noopener\"> catatan 3 </a> di atas untuk memastikan bahwa salinan Windows Anda sudah diaktifkan. </p> <h5> Langkah 2. Pastikan Windows Diperbarui. </h5> <p> Untuk memastikan, bahwa sistem Anda diperbarui: </p> <p> 1. Navigasikan ke <strong> pembaruan Windows </strong> pusat. <br> 2. Klik <strong> Periksa pembaruan. <br> </strong> 3. <strong> Install </strong> semua <strong> pembaruan penting </strong> dan <strong> mengulang kembali </strong> komputer. </p> <p><img src=\"images/image_thumb-29-864.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h5> Langkah 3. Cadangkan File Pribadi. </h5> <p> Lanjutkan dan <strong> cadangan </strong> semua milik mu <strong> file pribadi ke perangkat penyimpanan eksternal </strong> (misalnya disk USB). </p> <h5> Langkah 4. Hapus instalan perangkat lunak Antivirus atau Keamanan pihak ketiga. </h5> <h5> Langkah 5. Putuskan Sambungan Perangkat Eksternal. </h5> <p> Putuskan sambungan perangkat eksternal yang tidak diperlukan selama penginstalan (misalnya perangkat penyimpanan USB, printer, dll.). </p> <h5> Langkah 6. Unduh Alat Pembuatan Media Windows 10. </h5> <p> 1. Navigasikan ke <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Situs unduhan Windows 10 10 </a> dan klik <strong> Unduh alat sekarang </strong> tombol. <br> 2. Simpan file &quot;MediaCreationTool.exe&quot; di desktop Anda. </p> <p><img src=\"images/image_thumb-36-862.png\" alt=\"Media Creation Tool - Download\" loading=\"lazy\"></p> <h4> Langkah 7. Perbarui ke Windows 10. </h4> <p> Setelah melakukan semua langkah di atas, Anda siap untuk memperbarui PC Anda ke Windows 10 dengan mengikuti petunjuk pada salah satu metode di bawah ini: </p> <ol> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Tingkatkan sistem Anda ke Windows 10 dan simpan file dan aplikasi pribadi Anda (Metode 1). </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Perbarui sistem Anda ke Windows 10 dan simpan hanya file pribadi Anda (Metode 2). </a></li> <li><a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"> Perbarui sistem Anda ke Windows 10 dan hapus semua file dan aplikasi. (Metode 3). </a></li> </ol> <p> </p> <h6> Metode 1. Tingkatkan ke Windows 10 &amp; Simpan file &amp; Aplikasi Pribadi. </h6> <p> Dengan menggunakan metode ini, Anda akan dapat memperbarui PC Windows 10 Anda dengan semua file dan aplikasi Anda utuh setelah pembaruan, tetapi perlu diingat bahwa beberapa aplikasi mungkin perlu diperbarui. * </p> <p> * Catatan: Untuk alasan pencegahan, pastikan Anda memiliki cadangan semua file pribadi Anda ke media penyimpanan lain. </p> <p> 1. Klik dua kali pada &quot;MediaCreationTool.exe&quot; yang Anda unduh pada langkah ke-6 di atas. <br> 2. <strong> Menerima </strong> persyaratan lisensi. <br> 3. Di layar berikutnya, pilih <strong> Tingkatkan PC ini sekarang </strong> . </p> <p><img src=\"images/image_thumb-37-894.png\" alt=\"Upgrade Windows 7 to Windows 10\" loading=\"lazy\"></p> <h6></h6> <p> 4. Pada layar berikutnya, pastikan opsi untuk <strong> Simpan file dan aplikasi pribadi </strong> aku s <strong> diperiksa </strong> dan klik <strong> Install </strong> . </p> <p><img src=\"images/image_thumb-38-471.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Tunggu penginstalan Windows 10 hingga selesai. Proses pembaruan akan memakan waktu satu jam atau kurang, sesuai dengan spesifikasi sistem Anda. <br> 6. Setelah penginstalan selesai, buka <strong> Pengaturan </strong> &gt; <strong> Pembaruan &amp; Keamanan </strong> &gt; <strong> Pengaktifan </strong> untuk mengetahui bahwa Windows 10 sudah Diaktifkan dengan lisensi digital. </p> <p><img src=\"images/image_thumb-48-486.png\" alt=\"image\" loading=\"lazy\"></p> <h6> Metode 2. Perbarui Windows 10 dari file ISO &amp; Simpan file Pribadi saja. </h6> <p> Dengan menggunakan metode ini, Anda akan dapat memperbarui PC Windows 10 Anda dengan semua file Anda utuh setelah instalasi, tetapi semua aplikasi harus diinstal ulang setelah memperbarui ke Windows 10. </p> <p> * Catatan: Untuk alasan pencegahan, pastikan Anda memiliki cadangan semua file pribadi Anda ke media penyimpanan lain. </p> <p> 1. Klik dua kali pada &quot;MediaCreationTool.exe&quot; yang Anda unduh pada langkah ke-6 di atas. <br> 2. <strong> Menerima </strong> persyaratan lisensi. <br> 3. Di layar berikutnya, pilih <strong> Buat media instalasi (USB, DVD atau file ISO) untuk PC lain </strong> dan klik <strong> Lanjut. </strong></p> <p><img src=\"images/image_thumb-39-438.png\" alt=\"Create Windows 10 USB Installation Media\" loading=\"lazy\"></p> <p> </p> <p> 4. Pada layar &#39;Pilih bahasa, arsitektur, dan edisi&#39;, tinjau pengaturan default, atau <strong> hapus centang </strong> kotak centang &quot;Gunakan opsi yang disarankan untuk PC ini&quot;, untuk membuat pilihan Anda sendiri, dan klik <strong> Lanjut. </strong></p> <p><img src=\"images/image_thumb-40-711.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Pada opsi &#39;Pilih jenis media&#39;, pilih <strong> berkas ISO </strong> dan klik <strong> Lanjut. </strong></p> <p><img src=\"images/image_thumb-41-252.png\" alt=\"Download Windows 10 ISO\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Menyimpan </strong> itu <strong> Windows.iso </strong> file di Anda <strong> Desktop. </strong></p> <p><img src=\"images/image_thumb-42-193.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Setelah pengunduhan selesai, <strong> klik kanan </strong> pada file &#39;Windows.iso&#39; untuk memasang (membuka) di Explorer. * </p> <p> * Catatan: Untuk me-mount file ISO, Anda memerlukan program yang dapat membaca/membuka file ISO. Jika Anda tidak memiliki program seperti itu, lanjutkan untuk mengunduh dan menginstal <a href=\"https://www.elby.ch/products/vcd.html\" target=\"_blank\" rel=\"nofollow noopener\"> Drive Klon Virtual </a> . </p> <p><img src=\"images/image_thumb-43-527.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Jelajahi konten file ISO di Explorer dan <strong> klik dua kali </strong> di <strong> setup.exe </strong> aplikasi. </p> <p><img src=\"images/image_thumb-44-132.png\" alt=\"Upgrade to Windows 10 from ISO file\" loading=\"lazy\"></p> <p> </p> <p> 9. Klik <strong> Lanjut </strong> di layar pertama dan kemudian <strong> Menerima </strong> persyaratan lisensi. <br> 10. Di layar berikutnya, <strong> Pilih </strong> untuk <strong> Simpan file pribadi saja </strong> dan klik <strong> Lanjut. </strong></p> <p><img src=\"images/image_thumb-45-982.png\" alt=\"Udate Windows 7 to Windows 10 from ISO file\" loading=\"lazy\"></p> <p> </p> <p> 7. Tunggu penginstalan Windows 10 hingga selesai. Proses pembaruan akan memakan waktu satu jam atau kurang, sesuai dengan spesifikasi sistem Anda. <br> 8. Setelah penginstalan selesai, buka <strong> Pengaturan </strong> &gt; <strong> Pembaruan &amp; Keamanan </strong> &gt; <strong> Pengaktifan </strong> untuk mengetahui bahwa Windows 10 sudah Diaktifkan dengan lisensi digital. </p> <p> </p> <h6> Metode 3. Bersihkan Instal Windows 10 dari file ISO. * </h6> <p> Dengan menggunakan metode ini, Anda akan dapat membersihkan instalasi Windows 10 di PC Anda, tetapi <strong> semua file dan pengaturan akan dihapus selama instalasi </strong> . Jadi, pastikan Anda memiliki cadangan terbaru dari file pribadi Anda ke perangkat penyimpanan eksternal. (misalnya disk USB). </p> <p> 1. Ikuti langkah 1-9 dari <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> metode-2 </a> atas. <br> 2. Pada opsi &#39;Pilih yang akan disimpan&#39;, pilih <strong> Tidak ada </strong> dan klik <strong> Lanjut. * </strong></p> <p><strong> * Peringatan: </strong> Dengan melakukan instalasi Windows 10 yang bersih, Anda akan menghapus semua file dan pengaturan Anda. Jadi lanjutkan dan ambil cadangan file pribadi Anda ke perangkat penyimpanan eksternal sebelum melanjutkan. </p> <p><img src=\"images/image_thumb-46-312.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Tunggu penginstalan Windows 10 hingga selesai. Proses pembaruan akan memakan waktu satu jam atau kurang, sesuai dengan spesifikasi sistem Anda. <br> 4. Setelah penginstalan selesai, buka <strong> Pengaturan </strong> &gt; <strong> Pembaruan &amp; Keamanan </strong> &gt; <strong> Pengaktifan </strong> untuk mengetahui bahwa Windows 10 sudah Diaktifkan dengan lisensi digital. <br> 5. Terakhir, pulihkan file Anda dari cadangan, instal aplikasi yang Anda butuhkan dan nikmati peningkatan gratis ke Windows 10. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/11/image-28.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p>"}