{"title":"Cara Instal Ulang Windows 10 jika Windows Tidak Bisa Boot.","content":"<p> Dalam tutorial ini Anda akan menemukan instruksi terperinci tentang cara menginstal ulang Windows 10, jika Windows gagal melakukan booting. Dalam tutorial sebelumnya saya menyebutkan cara untuk <a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"nofollow noopener\"> instal ulang Windows 10 dengan menggunakan &quot;RESET fitur PC ini </a> . Namun, &quot;RESET PC ini&quot; hanya tersedia jika Windows 10 dapat melakukan booting secara normal, atau jika Anda dapat meluncurkan menu &#39;Advanced Startup&#39; setelah boot ke Windows. (Opsi &quot;RESET PC ini&quot; tidak tersedia saat boot dari USB). </p> <p> Tutorial ini berisi instruksi untuk menginstal ulang Windows 10 jika Windows tidak bisa boot, tanpa kehilangan file Anda. </p> <h2> Cara Instal ulang pasangan Windows 10 jika Windows Tidak Dapat Mulai. </h2> <p><strong> Persyaratan </strong> : Untuk menginstal ulang Windows 10 jika Windows gagal memulai secara normal, Anda harus mem-boot komputer Anda dari media instalasi Windows (USB atau DVD) dan untuk mengaktifkan Menu Opsi Lanjutan (menu tombol F8). Jika Anda tidak memiliki Media Instalasi Windows, Anda dapat membuatnya dengan menggunakan <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Alat Pembuatan Media Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara membuat media instalasi USB Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara membuat media instalasi DVD Windows 10. </a></li> </ul> <p> 1. Boot komputer Anda dari media instalasi Windows. <br> 3. Tekan <strong> Lanjut </strong> di layar Opsi bahasa. <br> 4. Pilih <strong> Perbaiki komputer Anda </strong> . <br> 5. Kemudian pilih <strong> Memecahkan masalah -&gt; </strong><strong> Opsi Lanjutan -&gt; Prompt Perintah. </strong></p> <p> 6. Pada jendela command prompt, ketik perintah berikut dan tekan <strong> Memasukkan: </strong></p> <ul> <li><strong> bcdedit /set {default} warisan kebijakan bootmenu </strong></li> </ul> <p><img src=\"images/image_thumb-33-821.png\" alt=\"advanced boot options\" loading=\"lazy\"></p> <p> 7. Jenis <strong> keluar </strong> untuk menutup jendela prompt perintah. <br> 8. Hapus media instalasi Windows. <br> 9. Tutup semua jendela untuk me-restart atau mematikan PC Anda. </p> <p> 10. <strong> tekan </strong> itu <strong> F8 </strong> kunci <strong> berkali-kali </strong> selama komputer dihidupkan. </p> <p> 11. Pada &quot;Menu Opsi Lanjutan&#39;, sorot &quot; <strong> Perbaiki komputer Anda </strong> &quot; dan kemudian tekan <strong> MEMASUKKAN </strong> . </p> <p><img src=\"images/image_thumb-13-334.png\" alt=\"Repair your Computer in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 12. Pada layar &#39;Pilih opsi&#39;, pilih <strong> Memecahkan masalah </strong> lalu klik <strong> Setel Ulang PC Ini -&gt; Simpan file saya. </strong> * </p> <p> Catatan: <br> 1. &quot; <strong> Simpan File saya&quot; </strong> opsi, akan menghapus semua aplikasi dan pengaturan Anda tetapi akan menyimpan file pribadi Anda. <br> 2. The <strong> &quot;Hapus semuanya&quot; </strong> opsi, akan menghapus semua aplikasi, pengaturan, dan file. Dengan memilih opsi ini, PC Anda akan dikembalikan ke keadaan bersih. <br> 3. Jika Anda memilih untuk &quot;Hapus Semuanya&quot;, pastikan Anda memiliki cadangan terbaru dari file pribadi Anda ke media penyimpanan lain (misalnya disk USB), jika tidak, semua file Anda akan hilang. </p> <p><img src=\"images/image_thumb-14-296.png\" alt=\"How to Reinstall Windows 10 if Windows Won't Boot.\" loading=\"lazy\"></p> <p> </p> <p> 13. Di layar berikutnya, pilih akun dengan hak istimewa admin. ) dan di layar berikutnya ketik kata sandi Anda dan klik <strong> Lanjut </strong> . </p> <p><img src=\"images/image_thumb-15-869.png\" alt=\"How to Reinstall Windows 10 if Windows cannot Boot.\" loading=\"lazy\"></p> <p> 14. Ketik kata sandi untuk akun yang dipilih dan klik <strong> Terus. </strong></p> <p><img src=\"images/image_thumb-16-692.png\" alt=\"How to Reinstall Windows 10 if Windows fails to boot.\" loading=\"lazy\"></p> <p> </p> <p> 15. Tunggu hingga instalasi selesai. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang panduan ini. </p>"}