{"title":"Cara Memeriksa Pembaruan di Office 2019, 2016 atau 2013 di Windows 10.","content":"<p> Dalam tutorial ini Anda akan mempelajari cara memeriksa pembaruan secara manual di Office 2019, 2016 dan Office 2013. Di semua versi Office, ada dua cara untuk menginstal pembaruan Office yang tersedia: Secara Otomatis dan Manual. </p> <h4> Cara Memperbarui Office 209/2016/2013/2010 Secara Manual. </h4> <h6> Metode 1. Cara Memeriksa Pembaruan Office secara Manual di Office 2019, 2016 dan Office 2013. </h6> <p> Untuk memeriksa dan menginstal pembaruan Office yang tersedia secara manual, di semua versi Office: </p> <p> 1. Buka program Office apa pun (mis. Word). <br> 2. Dari <strong> Mengajukan </strong> menu, pilih <strong> Akun </strong> . * </p> <p> * Catatan: Di Office 2010 pilih <strong> Tolong. </strong></p> <p> 3. Perluas <strong> Perbarui opsi </strong> dan klik <strong> Memperbarui sekarang </strong> . * </p> <p> * Catatan: Jika &#39;Opsi Pembaruan&quot; tidak tersedia, ikuti petunjuk di Metode-2 di bawah ini. </p> <p><img src=\"images/image_thumb-19-478.png\" alt=\"How to Check for Updates in Office 2019, 2016 or 2013 in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Metode 2. Cara Menginstal Pembaruan Office Secara Otomatis untuk Office 2019, 2016 dan Office 2013. </h6> <p> Jika Anda ingin Windows mengunduh dan menginstal pembaruan Office yang tersedia secara otomatis, navigasikan ke pengaturan pembaruan Windows dan periksa pengaturan berikut: </p> <ul> <li> Terima pembaruan untuk produk Microsoft lainnya saat Anda memperbarui Windows (Windows 10) </li> <li> Beri saya pembaruan untuk produk Microsoft lainnya saat saya memperbarui Windows (Windows 7) </li> </ul> <h5> Untuk menginstal pembaruan Office secara otomatis di Windows 10. </h5> <p><strong> 1. </strong> Pergi ke <strong> Pengaturan </strong> -&gt; <strong> Perbarui dan Keamanan -&gt; Opsi lanjutan. </strong></p> <p><img src=\"images/image_thumb-20-149.png\" alt=\"Change Update Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Pada opsi Perbarui, seret penggeser &#39;Terima pembaruan untuk produk Microsoft lainnya saat Anda memperbarui Windows&#39; ke <strong> DI. </strong></p> <p><img src=\"images/image_thumb-21-717.png\" alt=\"automatically install office updates windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Arahkan ke layar sebelumnya, dan klik and <strong> Periksa Pembaruan </strong> di Anda ingin segera menginstal pembaruan Office yang tersedia. </p> <p> </p> <h5> Untuk menginstal pembaruan Office secara otomatis di Windows 7. </h5> <p> 1. Navigasikan ke <strong> Panel kendali </strong> -&gt; <strong> pembaruan Windows </strong> dan klik <strong> Ubah pengaturan </strong> . </p> <p><img src=\"images/image_thumb-22-108.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Pilih <strong> Beri saya pembaruan untuk produk Microsoft lainnya ketika saya memperbarui Windows </strong> kotak centang dan klik <strong> Menerapkan </strong> . </p> <p> 3. Klik <strong> Periksa pembaruan </strong> untuk menginstal semua Pembaruan yang tersedia. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang panduan ini. </p> <p> </p>"}