{"title":"Cara Mengontrol Mouse dengan Keyboard di Windows 10/8/7.","content":"<p> Tutorial ini berisi instruksi tentang cara mengontrol mouse dengan menggunakan keyboard, dengan menggunakan fitur &#39;Tombol Mouse&quot; di Windows. Artikel ini, mungkin berguna untuk orang yang tidak dapat mengoperasikan mouse atau dalam kasus di mana mouse berhenti bekerja (atau tidak ada) dan Anda ingin menggunakan keyboard sebagai mouse.  untuk  bekerja dengan komputer Anda guna menyelesaikan pekerjaan yang mendesak. </p> <p> Itu <strong> mouse Keys </strong> Fitur ini dibangun ke dalam sistem operasi Windows 10, 7, atau 7 dan memungkinkan Anda menggunakan keypad numerik untuk menggerakkan penunjuk tetikus di layar dan melakukan semua tindakan biasa tetikus (klik, klik dua kali, klik kanan). </p> <h4> Cara Menggunakan Keyboard Anda sebagai Mouse. </h4> <h6> Metode 1. Aktifkan Tombol Mouse dengan menggunakan Pintasan Keyboard. * </h6> <p> Metode pertama untuk memindahkan kursor mouse [tanpa mouse <img src=\"images/wlemoticon-openmouthedsmile-273.png\" alt=\"Open-mouthed smile\" loading=\"lazy\"> ], adalah untuk mengaktifkan Mouse Keys, dengan menggunakan cara sebagai berikut: </p> <p> 1. Tekan <strong> kiri ALT </strong> + <strong> SHIFT kiri </strong> + <strong> Kunci Angka </strong></p> <p><img src=\"images/image_thumb-10-220.png\" alt=\"How to Control Mouse with Keyboard \" loading=\"lazy\"></p> <p> </p> <p> 2. Saat jendela Mouse Keys muncul di layar, tekan <strong> MEMASUKKAN </strong> untuk mengaktifkan MouseKeys. </p> <p><img src=\"images/image_thumb-2-595.png\" alt=\"turn on mouse keys\" loading=\"lazy\"></p> <p> 3. Setelah mengaktifkan Tombol Mouse, Anda dapat menggunakan keyboard (keypad numerik) untuk melakukan semua tindakan mouse (gerakkan, klik, klik kanan, klik dua kali) seperti yang ditunjukkan pada gambar di bawah. * </p> <p> * Catatan: Jika Anda ingin menambah atau mengurangi kecepatan penunjuk, baca instruksi pada metode selanjutnya. </p> <p><strong> Fungsi mouse dari Keypad Numerik </strong></p> <p><img src=\"images/image_thumb-8-332.png\" alt=\"mouse functions numeric keypas\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Metode 2. Aktifkan Tombol Mouse dari Ease of Access Center. </h6> <p> Untuk metode kedua agar dapat mengontrol penunjuk mouse dengan keyboard Anda, adalah dengan mengaktifkan dan mengkonfigurasi fitur &#39;Tombol Mouse&#39; dari pusat Ease Access. Untuk melakukannya: </p> <p> 1. Arahkan ke Control Panel Windows, atur &#39;View By&#39; ke&#39; <strong> Ikon kecil </strong> lalu buka <strong> Pusat Kemudahan Akses. </strong></p> <p><img src=\"images/image_thumb-3-309.png\" alt=\"use keyboard as mouse\" loading=\"lazy\"></p> <p> </p> <p> 2. Klik <strong> Membuat mouse lebih mudah digunakan. </strong></p> <p><img src=\"images/image_thumb-4-518.png\" alt=\"enable mouse keys - ease of access\" loading=\"lazy\"></p> <p> </p> <p> 3. Kemudian klik <strong> Siapkan tombol Mouse </strong> . </p> <p><img src=\"images/image_thumb-9-206.png\" alt=\"Configure Pointer Speed \" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Sekarang, periksa <strong> Nyalakan Tombol Mouse </strong> kotak dan klik <strong> Menerapkan. </strong><br> <strong> 5. </strong> Sekarang coba gerakkan kursor mouse dengan menggunakan keypad numerik dan konfigurasikan <strong> Kecepatan pointer </strong> mau mu. (Klik &#39;Terapkan&#39; di setiap perubahan dan &#39;OK&#39; untuk menutup opsi &#39;Tombol Mouse&#39;.) </p> <p><img src=\"images/image_thumb-7-340.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}