{"title":"Cara Memulihkan file DBX Outlook Express secara GRATIS.","content":"<p> Outlook Express adalah program klien email yang pertama kali terlihat di Windows XP. Tetapi bahkan hari ini (tahun 2018) beberapa klien masih menggunakannya, sebagai program Email utama mereka. Salah satu masalah utama yang dimiliki Outlook Express, adalah masalah batas 2GB. </p> <p> Deskripsi masalah batas ukuran 2 GB di Outlook Express. <br> Ketika salah satu folder Outlook Express utama (misalnya &quot;Kotak Masuk&quot; atau &quot;Terkirim&quot;) melebihi ukuran 2GB, file penyimpanan OE DBX yang sesuai mungkin rusak dan folder OE mungkin tampak kosong. Sebagai akibat dari masalah, Outlook Express tidak dapat Mengirim atau Menerima email dan menampilkan kesalahan the <a href=\"https://www.repairwin.com/fix-outlook-express-error-0x800c0133-due-to-2gb-size-limit/\" target=\"_blank\" rel=\"nofollow noopener\"> 0x800c0133 </a> selama operasi Kirim/Terima. </p> <p> Dalam tutorial ini saya akan menunjukkan kepada Anda, cara memperbaiki file DBX yang rusak dari Outlook Express dan mendapatkan email Anda kembali! </p> <h4> Cara MEMPERBAIKI File DBX Outlook Express yang Rusak. </h4> <p> Jika salah satu folder Outlook Express (kotak masuk, Kirim, dll.) rusak, ikuti petunjuk di bawah ini untuk memperbaiki folder penyimpanan DBX dan mendapatkan email Anda kembali. </p> <h6> Langkah 1. Aktifkan Tampilan File Tersembunyi. </h6> <p> 1. Buka Penjelajah Windows. <br> 2. Dari <strong> Alat </strong> pilih menu <strong> Pilihan folder </strong> . <br> 3. Pada tab Lihat, klik <strong> Tampilkan file dan folder tersembunyi </strong> dan klik <strong> BAIK. </strong></p> <p><img src=\"images/image_thumb-2-290.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Langkah 2. Temukan file DBX Outlook Express yang Rusak di disk Anda. </h6> <p> 1. Buka folder penyimpanan Outlook Express. Biasanya folder ini terletak di jalur berikut di disk Anda: </p> <ul> <li> C:\\Documents and Settings\\\\Local Settings\\Application Data\\Identities\\{}\\Microsoft\\ <strong> Outlook Ekspres </strong></li> </ul> <blockquote><p> misalnya “C:\\Documents and Settings\\User\\Local Settings\\Application Data\\Identities\\{D8F3C56D-965E-41AE-8A23-A58460ABAE00}\\Microsoft\\ <strong> Outlook Ekspres </strong> ” </p></blockquote> <p> 3. Dari Penjelajah <strong> Melihat </strong> pilih menu <strong> rincian </strong> . <br> 4. Temukan file DBX mana yang melebihi batas penyimpanan 2GB atau temukan file DBX yang rusak. (file DBX yang corrupt, adalah folder MAIL yang tampak kosong di program Outlook Express). </p> <p><img src=\"images/image_thumb-3-887.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Salin file DBX itu, ke lokasi lain di disk Anda (mis. ke folder baru di desktop Anda yang bernama &quot;CorruptedDBX&quot;). </p> <p> </p> <h6> Langkah 3. Unduh UnDBX – Utilitas Pemulihan DBX Outlook Express Gratis. </h6> <p> UnDBX adalah Alat Perbaikan DBX Outlook Express yang luar biasa dan gratis yang dapat mengekstrak semua email Outlook Express yang ada dalam format .eml. Selain itu, ia memiliki opsi untuk memperbaiki dan memperbaiki file .DBX Outlook Express yang rusak. </p> <p> Anda dapat mengunduh UnDBX dari <a href=\"https://sourceforge.net/projects/undbx/\" target=\"_blank\" rel=\"nofollow noopener\"> sini </a> . </p> <p> </p> <h6> Langkah 4. Pulihkan Email dari file DBX Outlook Express yang rusak. </h6> <p> 1. Untuk memulihkan email dari file DBX yang rusak, klik dua kali untuk menjalankan utilitas UnDBX. <br> 2. Dalam utilitas UnDBX: </p> <blockquote><p> 1. Pilih folder yang berisi file .dbx Outlook Express dan kemudian <strong> memeriksa </strong> &quot; <strong> aktifkan mode Pemulihan </strong> &quot;pilihan di bawah. <br> 2. <strong> Pilih folder tujuan </strong> di komputer Anda, untuk menyimpan (mengekstrak) file .eml. (mis. ke folder di desktop Anda yang bernama &quot;RecoveredInbox&quot;) <br> 3. Terakhir klik <strong> Memulihkan </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-645.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Setelah pemulihan UnDBX selesai, buka Outlook Express. <br> 4. Arahkan ke folder tempat UnDBX menyimpan file .eml yang diekstrak. <br> 5. Seret dan jatuhkan email yang diekstraksi, ke folder yang sesuai (di Outlook Express). * </p> <p><strong> * Saran: </strong> Untuk menghindari folder Outlook Express rusak lagi (atau untuk melewati batas 2GB), saya sarankan untuk menyeret dan menjatuhkan email dalam grup (misalnya berdasarkan tahun) dan menempatkannya ke folder yang berbeda di OE. Misalnya, pilih hanya email dari tahun berjalan dan seret dan jatuhkan ke folder OE baru yang dinamai dengan tahun berjalan (mis. &quot;Kotak Masuk 2018&quot;). Kemudian ulangi langkah yang sama dari semua email lain dari tahun-tahun sebelumnya. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}