{"title":"Cara Menonaktifkan Bitlocker di Lingkungan Pemulihan Windows (WinRE).","content":"<p> Tutorial ini berisi instruksi tentang cara menonaktifkan perlindungan BitLocker dan mendekripsi drive terenkripsi BitLocker di Lingkungan Pemulihan Windows. Instruksi dapat berguna, jika komputer Anda dilindungi BitLocker dan tidak menerima kunci pemulihan Bitlocker atau kata sandi BitLocker saat memulai sistem dan Anda tidak dapat membuka kunci drive yang dilindungi BitLocker. </p> <p><img src=\"images/image_thumb-52-511.png\" alt=\"Remove Bitlocker from Windows Recovery Environment \" loading=\"lazy\"></p> <h4></h4> <h4> Cara Menghapus Proteksi BitLocker &amp; Mendekripsi Drive Terenkripsi BitLocker di Lingkungan Pemulihan Windows (WinRE). </h4> <p><strong> Persyaratan: </strong><br> <strong> SEBUAH </strong> . <strong> Media Instalasi Windows 10 (USB atau DVD). </strong> Jika Anda tidak memiliki Media Instalasi Windows maka Anda dapat membuatnya dengan menggunakan <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Alat Pembuatan Media Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara membuat media instalasi USB Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara membuat media instalasi DVD Windows 10. </a></li> </ul> <p><strong> B. Kunci Pemulihan BitLocker atau Kata Sandi BitLocker: </strong> Untuk mematikan perlindungan Bitlocker, Anda harus memiliki kata sandi Bitlocker atau Kunci Pemulihan Bitlocker untuk membuka kunci drive terlebih dahulu dan kemudian mendekripsi drive. * </p> <p> * Catatan: Jika Anda tidak memiliki kunci pemulihan BitLocker, tidak ada cara untuk mengabaikan perlindungan BitLocker. Jika disk dilindungi BitLocker dan Anda tidak memiliki Kunci Pemulihan BitLocker atau kata sandi untuk membuka kunci drive, maka satu-satunya pilihan yang Anda miliki (untuk menggunakan drive lagi), adalah menghapus drive sepenuhnya dengan menggunakan instruksi dalam artikel ini: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Menghapus Perlindungan BitLocker dari Drive Tanpa Kunci Pemulihan BitLocker atau Kata Sandi. </a></p> <p> Kunci pemulihan Bitlocker adalah nomor 48 digit dan dapat ditemukan di lokasi berikut: </p> <ul> <li> Pada cetakan yang Anda simpan, saat Anda mengaktifkan Bitlocker. </li> <li> Pada drive USB yang Anda gunakan, selama aktivasi Bitlocker untuk menyimpan kunci pemulihan Bitlocker. </li> <li> Pada <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Kunci Pemulihan Akun Microsoft </a> , dengan menggunakan akun MS yang Anda gunakan untuk masuk ke perangkat Anda, atau Anda telah menambahkan ke perangkat untuk mengunduh aplikasi dari Microsoft Store, atau untuk mengaktifkan MS Office atau untuk email. </li> <li> Pada Anda <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Akun Azure </a> untuk PC kerja yang login dengan akun Azure Active Directory. </li> </ul> <p> Setelah Anda menemukan kunci pemulihan BitLocker atau kata sandi itLocker, lanjutkan untuk membuka kunci drive terenkripsi Bitlocker dan menghapus enkripsi Bitlocker di WinRE, dengan mengikuti petunjuk di bawah ini. </p> <p> Untuk membuka dan mendekripsi drive sistem operasi C: dari WinRE: </p> <p> 1. Boot sistem Anda dari media instalasi Windows 10. <br> 2. Pada layar di bawah ini tekan tombol <strong> BERGESER </strong> + <strong> F10 </strong> kunci untuk meluncurkan command prompt. (atau tekan <strong> Lanjut </strong> &gt; <strong> Perbaiki Komputer Saya </strong> &gt; <strong> Memecahkan masalah </strong> &gt; <strong> Prompt Perintah </strong> ). * </p> <p> * Catatan: Jika Anda meminta kunci pemulihan, klik <strong> SKIP drive ini </strong> . </p> <p><img src=\"images/image_thumb15_thumb-548.png\" alt=\"How to disable-unlock bitlocker from Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. Pada prompt perintah, ketik perintah berikut untuk melihat huruf drive dari drive terenkripsi: </p> <ul> <li><strong> kelola-bde -status </strong></li> </ul> <p> </p> <p> 4. Kemudian lanjutkan untuk membuka kunci drive yang dienkripsi, dengan menggunakan perintah berikut, sesuai dengan kasus Anda: </p> <p><strong> Kasus A </strong> Jika Anda mengetahui kunci pemulihan BitLocker, berikan perintah ini: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -rp BitLocker-recovery-key​ </strong></li> </ul> <p> * misalnya: Jika Anda ingin membuka kunci drive &quot;D:&quot; dan kunci pemulihan bitlocker adalah: &quot;123456-123456-123456-123456-123456-123456&quot; lalu ketik: </p> <ul> <li> <ul> <li> kelola-bde -buka kunci <strong> D </strong> : -rp <strong> 123456-123456-123456-123456-123456-123456 </strong></li> </ul> </li> </ul> <p> </p> <p><strong> Kasus B </strong> Jika Anda mengetahui kata sandi BitLocker untuk membuka kunci drive, berikan perintah ini: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -pw BitLocker-Password </strong></li> </ul> <p> * mis.: Jika Anda ingin membuka kunci drive &quot;D:&quot; dan kata sandi BitLocker adalah: &quot;123qwerty&quot; lalu ketik: * </p> <ul> <li> <ul> <li> kelola-bde -buka kunci <strong> D </strong> : -sandi <strong> 123qwerty </strong></li> </ul> </li> </ul> <p> </p> <p> 5. Kemudian lanjutkan untuk mendekripsi drive dan matikan perlindungan BitLocker dengan perintah ini: </p> <ul> <li><strong> manage-bde -off drive-letter: </strong></li> </ul> <p> * mis .: Jika Anda ingin mendekripsi drive &quot;D:&quot;, ketik: </p> <ul> <li> <ul> <li> kelola-bde –off <strong> D </strong> : </li> </ul> </li> </ul> <p> 6. Proses dekripsi dengan start. Untuk memeriksa status dekripsi, ketik lagi perintah berikut dan pastikan drive-nya <strong> Didekripsi Sepenuhnya </strong> dan <strong> Tidak terkunci </strong> : </p> <ul> <li><strong> kelola-bde -status </strong></li> </ul> <p><img src=\"images/image_thumb9_thumb-678.png\" alt=\"decrypt bitlocker encrypted drive windows removery environment\" loading=\"lazy\"></p> <p> </p> <p> 7. Setelah selesai, lepaskan media penginstalan Windows dan nyalakan ulang komputer. * </p> <p> * Catatan: Jika Windows tidak dapat memulai, maka pasang drive ke komputer lain dan buat cadangan data pribadi Anda ke media lain. Kemudian <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> mendiagnosis drive untuk masalah </a> dan jika OK, masukkan kembali disk ke komputer dan lakukan a <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> bersihkan instalasi Windows 10 </a> . </p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang masalah ini. </p>"}