{"title":"Cara Menyembunyikan atau Menampilkan Bilah Gulir di Menu Mulai, Pengaturan, atau Aplikasi Windows 10.","content":"<p> Seperti yang mungkin Anda perhatikan, di Windows 10, saat Anda memulai menu Start, aplikasi Pengaturan atau saat bekerja di Aplikasi Store, bilah gulir tidak terlihat secara default dan hanya muncul saat Anda memindahkan kursor ke sisi kanan bukaan. jendela. Perilaku ini sedikit mengganggu dan untungnya Microsoft dalam pembaruan fitur Windows 10 1803 terbaru (April 2018) menambahkan opsi untuk selalu menampilkan bilah gulir di semua jendela yang terbuka (misalnya, di menu Mulai di aplikasi Pengaturan, dll.) . </p> <p><img src=\"images/image_thumb-446.png\" alt=\"Show Scroll Bar in Windows 10 \" loading=\"lazy\"></p> <p> Tutorial ini berisi instruksi tentang cara menyembunyikan atau menampilkan selalu scrollbar di semua jendela dan aplikasi yang terbuka, di Windows 10 v1803 (atau lebih baru). </p> <h4> Cara Menampilkan atau Menyembunyikan Bilah Gulir di Menu Mulai, Pengaturan, atau Aplikasi Windows 10. </h4> <p> 1. Dari <strong> Mulailah </strong> <img src=\"images/image_thumb-38-810.png\" alt=\"image\" loading=\"lazy\"> pilih menu <strong> Pengaturan </strong> <img src=\"images/image_thumb-44-476.png\" alt=\"image\" loading=\"lazy\"> . </p> <p> 2. Buka <strong> Kemudahan Akses </strong> pengaturan. </p> <p><img src=\"images/image_thumb-1-268.png\" alt=\"display scroll bar windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Klik Tampilan di sebelah kiri lalu &quot;seret&quot;&quot; <strong> Sembunyikan bilah gulir secara otomatis di Windows </strong> beralih ke <strong> Mati. </strong></p> <p><img src=\"images/image_thumb-3-742.png\" alt=\"always show scroll bars windows 10\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}