{"title":"CARA: Hapus Riwayat Internet, Kata Sandi, dan Cookie dari Browser Web Anda (Chrome, Firefox, IE)","content":"<p> Saat Anda mengunjungi situs web dengan browser web Anda, situs web mengirimkan beberapa informasi ke browser dan browser menyimpan informasi tersebut ke file teks kecil yang disebut <strong> Kue kering </strong> s. Cookie menyimpan preferensi pengguna ke situs web itu, mis. informasi login, sehingga pengguna tidak perlu memasukkan ulang detail login (nama pengguna dan/atau kata sandi) saat kembali ke situs web yang sama. Cookie juga dapat menyimpan riwayat halaman situs web apa yang dikunjungi pengguna, sehingga pengguna tidak perlu mengingatnya, atau menelusuri semua halaman situs web, sampai dia menemukan apa yang diinginkannya. </p> <p> Pada saat yang sama, ketika Anda mengunjungi situs web, browser menyimpan salinan lokal dari semua halaman web yang Anda kunjungi, untuk menghemat bandwidth koneksi dan untuk mengurangi waktu buka halaman web, saat Anda mengunjunginya lagi. &#39;Salinan laman web lokal&quot; ini dikenal sebagai &quot; <strong> File internet sementara </strong> &quot; dari <strong> Tembolok </strong> . </p> <p> Cookie dan Cache, setelah beberapa waktu dapat menyimpan sejumlah besar ruang disk dan ada kebutuhan untuk menghapusnya. Dalam kasus lain, Anda mungkin perlu menghapus cache dan cookie browser untuk memuat ulang konten situs web secara total atau untuk alasan keamanan dan privasi: mis. jika Anda tidak mau, orang ketiga untuk mengetahui halaman web mana yang Anda kunjungi (alias: &quot; <strong> Riwayat Penjelajahan </strong> &quot;) atau yang merupakan detail login Anda ke situs web (mis. GMAIL). </p> <p> Dalam tutorial ini Anda akan menemukan dua (2) cara mudah untuk menghapus Riwayat Penjelajahan, Berkas Internet Sementara (Cache) dan Kuki dari Internet Explorer, Chrome &amp; Firefox. </p> <h4> Cara Menghapus Riwayat Penjelajahan Web, Kata Sandi Tersimpan, dan Cookie di Chrome, Firefox &amp; Internet Explorer. </h4> <h5><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Metode 1. Hapus Data Penjelajahan dari Peramban Tertentu. </a></h5> <h5><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metode 2. Data Delete Browsing dari seluruh Web Browser dengan Satu Klik! </a></h5> <p> </p> <h5> Metode 1. Hapus Riwayat, Cache, dan Cookie dari Browser Tertentu. </h5> <p> Secara umum, setiap browser web memiliki opsi untuk menghapus data penelusuran yang tersimpan melalui menu Pengaturan / Opsi, tetapi Jika Anda ingin mengakses opsi itu dengan mudah (tanpa harus menavigasi dengan mouse melalui menu browser), tekan <strong> Ctrl </strong> + <strong> Bergeser </strong> + <strong> Menghapus </strong> tombol bersama-sama di jendela browser yang terbuka. Begitu… </p> <p><strong> Untuk menghapus riwayat penelusuran, cache, dan cookie dari Internet Explorer: </strong></p> <p> 1. Buka Internet Explorer dan tekan <strong> Ctrl </strong> + <strong> Bergeser </strong> + <strong> Menghapus. <br> </strong> 2. Pilih jenis informasi yang ingin Anda hapus dan klik <strong> Menghapus </strong> tombol. </p> <p><img src=\"images/image_thumb-18-750.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> Untuk menghapus riwayat penjelajahan, cache, dan cookie dari Chrome: </strong></p> <p> 1. Luncurkan Chrome dan tekan <strong> Ctrl </strong> + <strong> Bergeser </strong> + <strong> Menghapus. <br> </strong> 2. Pilih jenis informasi yang ingin Anda hapus, lalu tekan <strong> HAPUS DATA </strong> . </p> <p><img src=\"images/image_thumb-19-667.png\" alt=\"clear chrome history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p><strong> Untuk menghapus riwayat penelusuran, cache, dan cookie dari Firefox: </strong></p> <p> 1. Buka Firefox dan tekan secara bersamaan <strong> Ctrl </strong> + <strong> Bergeser </strong> + <strong> Menghapus. <br> </strong> 2. Pilih data yang ingin Anda hapus dari Firefox dan klik <strong> Jelas sekarang. </strong></p> <p> </p> <p><img src=\"images/image_thumb-20-864.png\" alt=\"clear firefox history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> Metode 2.Hapus Riwayat Peramban, Cache, dan Cookie dari semua Peramban Web sekaligus. </h5> <p> Jika Anda ingin membuat hidup Anda lebih mudah, maka Anda dapat menggunakan <a href=\"https://www.ccleaner.com/\" target=\"_blank\" rel=\"nofollow noopener\"> pembersih CC </a> utilitas untuk menghapus File Internet Sementara, Riwayat, dan Cookie dengan mudah dari semua Peramban Web yang Anda gunakan, dengan satu klik. </p> <p> 1. <a href=\"https://www.ccleaner.com/ccleaner/download\" target=\"_blank\" rel=\"nofollow noopener\"> Unduh </a> dan instal utilitas CCleaner versi gratis. </p> <p> 2. Luncurkan <strong> pembersih CC </strong> dan navigasikan ke <strong> jendela </strong> dan <strong> Aplikasi </strong> opsi tab, untuk memilih informasi mana yang ingin Anda hapus dari browser web. </p> <p> 3. Setelah selesai klik <strong> Jalankan Pembersih </strong> . </p> <p><img src=\"images/image_thumb-21-173.png\" alt=\"clear internet history cache cookies - ccleaner\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? </p> <p> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}