{"title":"Cara Menghapus Perlindungan BitLocker dari Drive Sistem C: Tanpa kunci atau Kata Sandi Pemulihan BitLocker.","content":"<p> Artikel ini berisi petunjuk langkah demi langkah tentang cara menghapus Perlindungan BitLocker pada drive sistem C: agar dapat membersihkan menginstal Windows 10 pada komputer yang dilindungi BitLocker, jika Anda tidak memiliki kunci Pemulihan BitLocker atau kata sandi BitLocker atau jika Anda tidak dapat membuka kunci drive BitLocker karena alasan apa pun. </p> <p><img src=\"images/image_thumb-51-648.png\" alt=\"Fix Refresh your PC error: Drive where windows is installed is locked\" loading=\"lazy\"></p> <p> </p> <p> Ketika perangkat Windows 10 (laptop atau PC) dilindungi dengan BitLocker, maka satu-satunya cara untuk mengakses kontennya atau mengatur ulang perangkat (dengan menggunakan fitur &quot;Reset This PC&quot;, &quot;Refresh your PC&quot;), atau menginstal ulang Windows, adalah untuk membuka kunci drive sistem operasi C: dengan menggunakan Kunci Pemulihan BitLocker atau kata sandi BitLocker. </p> <p> Jika Anda tidak memiliki kunci Pemulihan BitLocker atau kata sandi BitLocker untuk membuka kunci drive sistem C:, atau kunci BitLocker tidak diterima, maka satu-satunya pilihan yang tersisa (sayangnya), adalah menghapus drive sepenuhnya dan melakukan membersihkan instalasi Windows. </p> <p> Dalam tutorial ini Anda akan menemukan petunjuk tentang cara mengatasi masalah berikut saat mencoba menginstal Windows 10 atau mengatur ulang perangkat Windows 10 pada status default pabrik: &quot;Drive tempat Windows diinstal terkunci. Buka kunci drive dan coba lagi &quot;. </p> <h4> Cara Membersihkan Instal Windows 10 pada Komputer yang Dilindungi BitLocker (PERBAIKI: Tidak Dapat Menginstal/Menyegarkan Windows 10 – Drive Dikunci dengan BitLocker.) </h4> <p><strong> Kebutuhan: </strong> <strong> Media Instalasi Windows 10 (USB atau DVD). </strong><br> Jika Anda tidak memiliki Media Instalasi Windows maka Anda dapat membuatnya dengan menggunakan <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Alat Pembuatan Media Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara membuat media instalasi USB Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara membuat media instalasi DVD Windows 10. </a></li> </ul> <p> Untuk melakukan instalasi Windows 10 yang bersih, pada Komputer/Drive yang Dilindungi BitLocker, ikuti petunjuk di bawah ini: * </p> <p><strong> * PERHATIAN: PROSEDUR DI BAWAH INI AKAN MENGHAPUS SEMUA DATA YANG TERSIMPAN PADA DRIVE TERKUNCI. LANJUTKAN HANYA JIKA ANDA <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> TIDAK DAPAT MEMBUKA DRIVE/KOMPUTER YANG DILINDUNGI BITLOCKER. </a></strong></p> <p> 1. Boot sistem Anda dari media instalasi Windows 10. * </p> <p> * Catatan: <strong> </strong> Untuk dapat mem-boot dari Windows Media (USB atau DVD) ikuti langkah-langkah di bawah ini: </p> <ul> <li><strong> Metode 1: </strong> Setelah Power On, tekan tombol Fungsi yang sesuai (biasanya adalah tombol &quot;F12&quot; atau &quot;F8&quot;) untuk melihat opsi &quot;Urutan Booting&quot; atau &quot;Menu Boot&quot;. Kemudian pilih perangkat USB (atau DVD) yang berisi Media (file) instalasi Windows dan tekan Enter. </li> <li><strong> Metode 2: </strong> Masuk ke BIOS Setup (Pengaturan) dan atur Media Instalasi Windows sebagai &quot;Perangkat Booting Pertama&quot; di menu &quot;Urutan Booting&quot;. Kemudian <strong> Simpan dan keluar </strong> dari pengaturan BIOS. </li> </ul> <p> 2. Pada layar di bawah ini tekan tombol <strong> BERGESER </strong> + <strong> F10 </strong> kunci untuk meluncurkan command prompt. (atau tekan <strong> Lanjut </strong> &gt; <strong> Perbaiki Komputer Saya </strong> &gt; <strong> Memecahkan masalah </strong> &gt; <strong> Prompt Perintah </strong> ). * </p> <p> * Catatan: Jika Anda meminta kunci pemulihan, klik <strong> SKIP drive ini </strong> . </p> <p><img src=\"images/image_thumb15_thumb-290.png\" alt=\"How to Remove Updates from the Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. Pada command prompt berikan perintah berikut secara berurutan: </p> <ul> <li><strong> bagian disk </strong></li> <li><strong> daftar disk </strong></li> <li><strong> pilih disk 0 </strong></li> <li><strong> daftar volume </strong></li> </ul> <p> 4. Sekarang temukan volume mana yang terdaftar yang memiliki ukuran lebih besar dalam GB. Biasanya volume yang lebih besar adalah tempat Windows diinstal (drive yang terkunci). * </p> <p> * misalnya Pada screenshot di bawah ini &quot;Volume 2&quot; memiliki ukuran yang lebih besar. </p> <p> </p> <p><img src=\"images/image_thumb-10-992.png\" alt=\"fix drive is locked Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Kemudian pilih volume yang lebih besar dengan mengetikkan perintah ini: * </p> <ul> <li><strong> pilih nomor volume </strong></li> </ul> <p> * Catatan: Ubah nomor volume pada perintah di atas sesuai dengan kasus Anda (misalnya &quot;pilih volume 2&quot;) </p> <p> 5. Terakhir hapus volume yang dipilih dengan memberikan perintah ini: </p> <p> </p> <ul> <li><strong> hapus penimpaan volume </strong></li> </ul> <p><img src=\"images/image_thumb-14-714.png\" alt=\"delete volume override\" loading=\"lazy\"></p> <p> </p> <p> 6. Jenis <strong> keluar </strong> untuk menutup alat DISKPART dan kemudian tutup Command Prompt. <br> 7. Matikan lalu AKTIFKAN kembali perangkat Anda. <br> 8. Boot dari Media Instalasi Windows. <br> 9. Klik <strong> Lanjut </strong> lalu <strong> Instal sekarang </strong> . <br> 10. Pilih &quot;Saya tidak punya kunci produk&quot; dan kemudian terima perjanjian Lisensi. <br> 11. Pilih &quot;Custom install&quot; dan kemudian hapus semua partisi/volume lainnya pada disk. </p> <p><img src=\"images/image_thumb-12-362.png\" alt=\"cannot reset windows 10 drive locked with bitlocker\" loading=\"lazy\"></p> <p> </p> <p> 12. Setelah selesai, pilih &quot;Ruang yang tidak terisi&quot; dan klik <strong> Lanjut. <br> </strong> 13. Ikuti petunjuk di layar untuk <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> bersih instal Windows 10 </a> . </p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang masalah ini. </p>"}