{"title":"Cara Memblokir Situs Web di Chrome atau Firefox.","content":"<p> Jika Anda mencari cara mudah untuk memblokir situs web di Chrome atau Firefox, lanjutkan membaca di bawah ini. </p> <p> Meskipun Internet bagi sebagian besar dari kita telah menjadi kebutuhan dalam kehidupan sehari-hari untuk pekerjaan atau hiburan kita, di sisi lain terkadang berguna untuk dapat memblokir beberapa situs untuk menghindari gangguan. Misalnya, tidak ada yang ingin anak mereka terganggu dengan menonton video di YouTube saat mereka membaca pelajaran. </p> <p> Dalam panduan ini, Anda akan mempelajari cara memblokir situs web di Chrome dan <a href=\"#firefox\" target=\"_blank\" rel=\"nofollow noopener\"> Firefox </a> browser. </p> <p> * Catatan: Jika Anda ingin memblokir situs web di semua browser, baca artikel ini: <a href=\"https://www.repairwin.com/block-youtube-on-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Memblokir YouTube di Windows 10. </a></p> <h2> Cara Memblokir Situs Web di Google Chrome. </h2> <p> Cara termudah untuk memblokir situs web di Chrome, adalah dengan menggunakan ekstensi BlockSite yang terkenal. Pemasangan add-on BlockSite serupa dengan ekstensi lainnya. </p> <p> 1. Navigasikan ke <a href=\"https://chrome.google.com/webstore/detail/blocksite-stay-focused-co/eiimnmioipafcokbfikbljfdeojpcgbh\" target=\"_blank\" rel=\"nofollow noopener\"> Ekstensi BlockSite </a> di toko web Chrome dan klik <strong> Tambahkan ke Chrome </strong> tombol. </p> <p><img src=\"images/image_thumb-4-439.png\" alt=\"how to block websites chrome\" loading=\"lazy\"></p> <p> 2. Saat diminta, klik <strong> Tambahkan ekstensi </strong> . </p> <p><img src=\"images/image_thumb-5-782.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Setelah penginstalan selesai, buka menu Chrome &gt; Alat Lainnya &gt; Ekstensi </p> <p><img src=\"images/image_thumb-6-830.png\" alt=\"chrome tools extensions\" loading=\"lazy\"></p> <p> 4. Temukan <strong> Blok Situs </strong> ekstensi dan klik <strong> Detail. </strong></p> <p><img src=\"images/image_thumb-7-415.png\" alt=\"Blocksite details\" loading=\"lazy\"></p> <p> 5. <strong> Buka </strong> itu <strong> Opsi ekstensi </strong> . </p> <p><img src=\"images/image_thumb-8-135.png\" alt=\"How to Block sites chrome\" loading=\"lazy\"></p> <p> 6. Ketik nama situs yang ingin Anda blokir (mis. <a href=\"http://www.youtube.com\" target=\"_blank\" rel=\"nofollow noopener\"> www.youtube.com </a> ) dan tekan simbol plus (+) untuk menambahkan situs web pada daftar situs yang diblokir. </p> <p><img src=\"images/image_thumb-9-298.png\" alt=\"blocked sites chrome\" loading=\"lazy\"></p> <p> 7. Itu dia! Mulai sekarang, ketika Anda mencoba mengunjungi situs yang diblokir, Anda akan diberitahu bahwa situs tersebut diblokir dengan ekstensi BlockSite. Untuk mengubah daftar situs yang diblokir, klik <strong> Edit daftar Anda </strong> untuk membuat perubahan apa pun yang Anda inginkan, atau untuk menghapus situs yang diblokir dari daftar. </p> <p><img src=\"images/image_thumb-10-951.png\" alt=\"image\" loading=\"lazy\"></p> <h3> Cara Melindungi Situs yang Diblokir dengan Kata Sandi dalam ekstensi BlockSite. </h3> <p> Jika Anda ingin mencegah pengguna membuka blokir situs yang diblokir: </p> <p> 1. Buka <strong> Blok Situs </strong> opsi ekstensi. <br> 2. Navigasikan ke <strong> Perlindungan Kata Sandi </strong> pengaturan. <br> 3. <strong> Memungkinkan </strong> opsi Lindungi <strong> opsi BlockSite pilihan Anda dan halaman ekstensi Chrome dengan kata sandi </strong> lalu ketik email dan kata sandi Anda dan klik <strong> Menyimpan. </strong></p> <p><img src=\"images/image_thumb-11-711.png\" alt=\"password protect blocked sites\" loading=\"lazy\"></p> <p> 4. BlockSite akan mengirimi Anda email dengan tautan untuk memverifikasi alamat email Anda. Setelah verifikasi email, perlindungan kata sandi akan aktif. </p> <h2> Cara Memblokir Situs Web di Mozilla Firefox. </h2> <p> 1. Navigasikan ke <a href=\"https://addons.mozilla.org/en-US/firefox/addon/blocksite/\" target=\"_blank\" rel=\"nofollow noopener\"> Ekstensi BlockSite </a> di add-on Firefox. <br> 2. Klik <strong> Tambahkan ke Firefox </strong> tombol. </p> <p><img src=\"images/image_thumb-12-999.png\" alt=\"block websites firefox\" loading=\"lazy\"></p> <p> 2. Saat diminta untuk mengizinkan pemasangan ekstensi, klik <strong> Menambahkan. </strong></p> <p><img src=\"images/image_thumb-13-588.png\" alt=\"Blocksite firefox\" loading=\"lazy\"></p> <p> 3. Saat penginstalan selesai, pilih apakah Anda ingin memblokir situs web di jendela Pribadi (penyamaran) dan klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb-14-173.png\" alt=\"how to block site\" loading=\"lazy\"></p> <p> 4. Jika Anda ingin mencegah ekstensi BlockSite membaca data situs yang Anda kunjungi, klik Maybe letter. </p> <p><img src=\"images/image_thumb-15-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Sekarang klik ikon BlockSite dan <strong> Edit daftar blokir </strong> untuk menentukan situs web mana yang ingin Anda blokir. </p> <p><img src=\"images/image_thumb-16-657.png\" alt=\"block sites firefox\" loading=\"lazy\"></p> <p> 6. Pada tab Block Sites, ketik nama situs yang ingin Anda blokir (misalnya &quot;facebook.com&quot;) lalu tambahkan ke daftar situs yang diblokir. </p> <p><img src=\"images/image_thumb-17-817.png\" alt=\"How to block site Firefox\" loading=\"lazy\"></p> <p> 7. Setelah Anda menambahkan situs yang ingin Anda blokir, tutup pengaturan BlockSite dan selesai. </p> <p> Selain fungsi utamanya, ekstensi BlockSite juga memiliki beberapa fungsi berguna lainnya seperti: </p> <ul> <li> <p><strong> Mode fokus </strong> : Blokir situs untuk waktu tertentu (mis. 25 menit) </p> </li> <li> <p><strong> Perlindungan Kata Sandi: </strong> Lindungi pengaturan BlockSite Anda dari modifikasi. </p> </li> <li> <p><strong> Blok oleh Kata-kata: </strong> Blokir URL yang berisi kata-kata tertentu. </p> </li> </ul> <p> Itu saja! Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}