{"title":"Cara Memulai Ulang Server HP dari antarmuka iLO.","content":"<p> Dalam tutorial ini, kita akan menemukan petunjuk langkah demi langkah tentang cara me-restart server HP dari jarak jauh, dengan menggunakan antarmuka iLO HP. HP Integrated Lights-Out (iLO) adalah komponen perangkat keras pada server HP, yang biasanya terintegrasi pada board sistem. Komponen iLO memiliki koneksi jaringan, alamat IP, dan antarmuka webnya sendiri dan dapat membantu pengguna untuk mengakses dan mengelola server dari jarak jauh. </p> <h4> Cara Mem-boot Ulang Server HP menggunakan antarmuka web iLO 5. </h4> <p> Untuk memulai ulang server jika hang, dari antarmuka iLO: </p> <p> 1. Dari komputer lain, buka browser web dan di bilah alamat, ketik alamat IP antarmuka iLO di server yang ingin Anda boot ulang. <br> 2. Ketik nama pengguna dan kata sandi iLO dan klik <strong> Gabung </strong> . </p> <p><img src=\"images/image_thumb-8-790.png\" alt=\"restart hp proliant server from ilo\" loading=\"lazy\"></p> <p> </p> <p> 3. Pilih <strong> Daya &amp; Termal </strong> di kiri. <br> 4. Pada bagian Tombol Daya Virtual, klik tombol <strong> Setel ulang </strong> untuk me-restart server HP Anda. * </p> <p> * Informasi: </p> <ul> <li> maya <strong> Setel ulang </strong> tombol memiliki fungsi yang sama dengan <strong> Mengulang kembali </strong> perintah di sistem operasi (boot hangat). </li> <li> maya <strong> Sepatu Bot Dingin </strong> tombol memiliki tindakan yang sama dengan <strong> Menutup </strong> perintah dalam sistem operasi. Jika Anda menekan tombol &#39;Cold Boot&#39;, server akan mati dan akan restart setelah kira-kira 8 detik. </li> </ul> <p> <img src=\"images/image_thumb-9-784.png\" alt=\"How to Reboot an HP Server using iLO 5 web interface.\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}