{"title":"Cara Mengaktifkan Perlindungan Pemulihan Sistem di OS Windows 10/8/7.","content":"<p> Tutorial ini berisi petunjuk tentang cara mengaktifkan System Protection pada OS Windows 10, 8 &amp; 7. Perlindungan Pemulihan Sistem (umumnya dikenal sebagai &#39;Perlindungan Sistem&#39;) adalah fitur Windows yang memungkinkan Anda untuk <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> mengembalikan </a> sistem Anda ke titik waktu sebelumnya, jika Windows tidak bekerja dengan benar setelah perubahan signifikan pada file sistem (misalnya setelah Pembaruan Windows, atau setelah serangan virus.) </p> <p> Alat Pemulihan Sistem, menggunakan layanan Volume Shadow Copy untuk mengambil snapshot dari file dan registri sistem Windows dan menyimpannya sebagai Titik Pemulihan. &quot;Restore Points&quot; ini dapat digunakan untuk mengembalikan sistem ke kondisi kerja sebelumnya, jika Windows gagal untuk boot atau jika menjadi tidak stabil, tanpa harus menginstal ulang sistem operasi. </p> <h4> Cara Mengaktifkan Perlindungan Pemulihan Sistem di Windows 10. </h4> <p> 1. Buka Windows explorer, klik kanan pada ikon &#39;This PC&#39; dan pilih <strong> Properti </strong> . </p> <p><img src=\"images/image_thumb-70-672.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Pilih <strong> Sistem keamanan </strong> di kiri. </p> <p><img src=\"images/image_thumb-71-762.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Soroti <strong> Disk Lokal C: (Sistem) </strong> dan klik <strong> Konfigurasi. </strong></p> <p><img src=\"images/image_thumb-72-782.png\" alt=\"turn on system restore protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Pada opsi Perlindungan Sistem, pilih <strong> Aktifkan perlindungan sistem </strong> dan klik <strong> BAIK. * </strong></p> <p> * Catatan: Jika &quot;Perlindungan Sistem: sudah diaktifkan, maka Anda baik-baik saja. </p> <p><img src=\"images/image_thumb-73-192.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 5. Terakhir, pada opsi System Protection, klik <strong> Membuat </strong> untuk membuat snapshot (Restore Point), dari status sistem saat ini. </p> <p><img src=\"images/image_thumb-75-308.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}