{"title":"Cara Selalu Membuka Chrome dalam mode Penyamaran.","content":"<p> Jika Anda mencari cara untuk membuat Chrome selalu terbuka dalam mode penyamaran, lanjutkan membaca di bawah ini. Saat Anda meluncurkan Chrome dalam mode penyamaran, aktivitas browser Anda tetap pribadi dari pengguna lain yang menggunakan perangkat yang sama. Dalam mode penyamaran, Chrome tidak akan menyimpan riwayat penjelajahan, cookie, dan informasi yang dimasukkan dalam formulir. </p> <p> Cara manual, untuk memulai sesi Chrome baru dalam mode penyamaran, adalah dengan membuka menu Chrome <img src=\"images/image_thumb10_thumb-963.png\" alt=\"image_thumb[10]\" loading=\"lazy\"> dan untuk memilih &quot;Jendela penyamaran baru&quot;, atau untuk menekan CTRL + SHIFT + N. </p> <p><img src=\"images/image_thumb-42-832.png\" alt=\"Chrome New incognito window\" loading=\"lazy\"></p> <p> </p> <p> Dalam artikel ini Anda akan menemukan petunjuk, tentang cara selalu meluncurkan Google Chrome dalam mode penyamaran. </p> <h4> Cara Selalu Memulai Google Chrome dalam mode penyamaran. </h4> <p> Jika Anda ingin selalu memulai Chrome dalam mode penyamaran, buat pintasan Chrome baru dan ubah propertinya, sebagai berikut: </p> <p> 1, <strong> Klik kanan </strong> di <strong> Google Chrome </strong> pintasan dan pilih <strong> Properti </strong> . <br> 2. Di <strong> Umum </strong> tab, tambahkan sakelar &quot;–penyamaran&quot; (tanpa tanda kutip), di akhir garis target dan klik <strong> baik </strong> : </p> <p> misalnya &quot;C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe&quot; –penyamaran </p> <p><img src=\"images/image_thumb-43-798.png\" alt=\"How to Always Open Chrome in Incognito mode.\" loading=\"lazy\"></p> <p> 3. Mulai sekarang, saat Anda memulai Chrome dari pintasan yang dimodifikasi, Chrome akan terbuka dalam mode penyamaran. * </p> <p><strong> * TIPS: </strong> Jika Anda ingin membuka Chrome dalam mode penyamaran, saat membuka hyperlink (URL) dari email atau program lain, Anda harus memodifikasi registri. Untuk melakukannya: </p> <blockquote> <p> 1. Buka <strong> Editor Registri </strong> . <br> 2. Di registri, navigasikan ke kunci berikut: </p> <ul> <li> <p> HKEY_CLASSES_ROOT\\ChromeHTML\\shell\\open\\command </p> </li> </ul> <p> 3. Di panel kanan klik dua kali di <strong> Bawaan </strong> Nilai string REG_SZ. </p> </blockquote> <p><img src=\"images/image_thumb-44-612.png\" alt=\"open url in chrome incognito\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4.  Tambahkan tombol tambahkan kata &quot;penyamaran&quot; (tanpa tanda kutip), sebelum &quot;%1&quot; dan klik <strong> baik </strong> . </p></blockquote> <blockquote><p> misalnya Ubah data nilai dari: </p> <p> &quot;C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe&quot; — &quot;%1&quot; </p> <p> untuk: </p> <p> &quot;C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe&quot; –incognito &quot;%1&quot; </p></blockquote> <p><img src=\"images/image_thumb-45-148.png\" alt=\"open url chrome incognito - registry\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Mulai sekarang, saat mengklik URL (HTML), Chrome akan membukanya dalam mode penyamaran. </p></blockquote> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}