{"title":"Cara Mendekripsi File Terenkripsi EFS dan Menghapus Enkripsi EFS di Windows 10.","content":"<p> Dalam tutorial sebelumnya saya telah menjelaskan cara untuk <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> mengenkripsi file Anda dengan menggunakan enkripsi EFS </a> . Dalam tutorial ini Anda akan mengetahui, cara menghapus enkripsi EFS dan cara mendekripsi file terenkripsi EFS setelah mentransfernya ke komputer lain. </p> <h4> Cara Mendekripsi file terenkripsi EFS dan Menonaktifkan Enkripsi EFS. </h4> <ul> <li> <p><a href=\"#part-1\"> Bagian 1. Cara Menonaktifkan dan Menghapus enkripsi EFS pada PC yang Sama. </a></p> </li> <li> <p><a href=\"#part-2\"> Bagian 2. Cara Mendekripsi file EFS di PC lain. </a></p> </li> </ul> <h6> Bagian 1. Cara Menonaktifkan dan Menghapus Enkripsi EFS. </h6> <p> Saat Anda mengenkripsi file Anda dengan EFS, maka kunci dekripsi (sertifikat) disimpan secara lokal di komputer Anda dan file sudah didekripsi. Jika Anda ingin menonaktifkan enkripsi EFS untuk berhenti mengenkripsi file/folder Anda: </p> <p> 1. Klik kanan pada folder/file terenkripsi dan ubah <strong> Kepemilikan file </strong> untuk <strong> Pribadi </strong> . </p> <p><img src=\"images/image_thumb-26-500.png\" alt=\"how to disable efs encryption\" loading=\"lazy\"></p> <p> 2. Setelah selesai, Anda akan melihat bahwa folder/file tidak terkunci. Lakukan saja langkah yang sama untuk menghapus enkripsi pada setiap folder dan file terenkripsi lainnya. </p> <p> 3. Sekarang, jika Anda tidak menggunakan enkripsi EFS ke file/folder lain dan Anda ingin menghapus kunci pemulihan EFS (alias &quot;kunci dekripsi – sertifikat&quot;) sepenuhnya dari PC Anda: </p> <blockquote> <p> 1. Buka Internet Explorer dan dari <strong> Alat </strong> pilih menu <strong> pilihan internet </strong> . (atau, buka <strong> pilihan internet </strong> dari <strong> Panel kendali </strong> .) </p> <p> 2. Di <strong> Kandungan </strong> klik tab <strong> Sertifikat </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-27-186.png\" alt=\"how to remove efs certificate-recovery key\" loading=\"lazy\"></p> <blockquote> <p> 3. Pada tab Personal, pilih sertifikat dekripsi dan klik <strong> Menghapus </strong> . * </p> <p><strong> * Perhatian: </strong> Pastikan Anda telah menghapus (menghentikan) enkripsi untuk semua file terenkripsi sebelum menghapus sertifikat (kunci dekripsi) </p> </blockquote> <p><img src=\"images/image_thumb-25-639.png\" alt=\"how to remove efs recovery key\" loading=\"lazy\"></p> <blockquote> <p> 4. <strong> Mengulang kembali </strong> komputer Anda. </p> </blockquote> <h6></h6> <h6> Bagian 2: Cara Mendekripsi file terenkripsi EFS di komputer lain. </h6> <p> Jika Anda telah mentransfer file terenkripsi EFS ke komputer lain, maka satu-satunya cara untuk melihat (membuka) file EFS adalah dengan memiliki kunci dekripsi. Kunci dekripsi adalah file .pfx sertifikat, yang Anda ekspor saat Anda mengenkripsi file. Jika Anda tidak memiliki kunci dekripsi EFS, tidak ada cara untuk mendekripsi file EFS. </p> <p><strong> Untuk Mendekripsi file terenkripsi EFS, dengan menggunakan Kunci Dekripsi – Sertifikat: </strong></p> <p> 1. Klik dua kali pada kunci dekripsi (sertifikat file .pfx) untuk menginstalnya. <br> 2. Pada layar Selamat Datang di Wisaya Sertifikat Impor, klik <strong> Lanjut </strong> . <br> 3. Kemudian klik <strong> Lanjut </strong> lagi. </p> <p><img src=\"images/image_thumb38_thumb-158.png\" alt=\"How to Decrypt EFS Encrypted files\" loading=\"lazy\"></p> <p> 4. Ketikkan kata sandi yang Anda gunakan saat mengekspor kunci sertifikat dan klik <strong> Lanjut </strong> . </p> <p><img src=\"images/image_thumb39_thumb-680.png\" alt=\"install efs .pfx certificate\" loading=\"lazy\"></p> <p> 5. Biarkan pengaturan default pada opsi Certificate Store dan klik <strong> Lanjut </strong> . </p> <p><img src=\"images/image_thumb40_thumb-629.png\" alt=\"image_thumb[40]\" loading=\"lazy\"></p> <p> 6. Terakhir klik <strong> Selesai </strong> . </p> <p><img src=\"images/image_thumb41_thumb-225.png\" alt=\"image_thumb[41]\" loading=\"lazy\"></p> <p> </p> <p> 7. Sekarang Anda dapat membuka file terenkripsi. * </p> <p> * Catatan: Setelah mendekripsi file, ikuti instruksi di <a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> Bagian 1 </a> di atas, untuk menghapus enkripsi sepenuhnya jika Anda mau. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini </p>"}