{"title":"Cara Melihat dan Mengekspor Kata Sandi Firefox.","content":"<p> Dalam tutorial ini saya akan menunjukkan cara melihat dan mengelola kata sandi yang disimpan di browser web Mozilla Firefox. Seperti yang sudah Anda ketahui, browser Firefox menawarkan opsi untuk menyimpan nama pengguna dan kata sandi login Anda saat pertama kali mengunjungi situs web. Jika Anda memilih untuk menyimpan kredensial Anda, Firefox akan mengingatnya, dan saat berikutnya Anda masuk ke situs web, Anda tidak perlu mengetik ulang. </p> <p><img src=\"images/image_thumb-98-507.png\" alt=\"How to View and Export Firefox Passwords.\" loading=\"lazy\"></p> <p> Jika, seiring waktu, Anda lupa kredensial login Anda, baca tutorial ini untuk mempelajari cara melihat dan mengekspor kata sandi yang tersimpan di Firefox. </p> <h4> Cara Mengelola, Menampilkan &amp; Mengekspor Kata Sandi yang Disimpan di Mozilla Firefox. </h4> <p><strong> Cara Melihat Kata Sandi Firefox </strong></p> <p> 1. Dari menu Firefox <img src=\"images/image_thumb-99-587.png\" alt=\"image\" loading=\"lazy\"> memilih <strong> Masuk dan Kata Sandi </strong> . </p> <p><img src=\"images/image_thumb-100-999.png\" alt=\"View Saved Passwords Firefox\" loading=\"lazy\"></p> <p> </p> <p> 2. Klik <strong> Tampilkan Kata Sandi </strong> tombol untuk melihat kata sandi yang disimpan di situs web. Selain itu di jendela ini, gunakan <strong> Menghapus </strong> untuk menghapus kata sandi yang disimpan dari Firefox. </p> <p><img src=\"images/image_thumb-101-863.png\" alt=\"Manage Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p><strong> Cara Menyimpan Semua Kata Sandi Firefox ke File. </strong></p> <p> Untuk melihat dan mengekspor semua kata sandi yang tersimpan di Firefox: </p> <p> 1. Unduh <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> PasswordFox </a> utilitas ( <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> http://www.nirsoft.net/utils/passwordfox.html </a> ) <br> 2. Ekstrak file zip yang diunduh. <br> 3. Dari folder hasil ekstrak klik dua kali untuk menjalankan aplikasi &quot;PasswordFox.exe&quot;. <br> 4. Tekan <strong> Ctrl </strong> + <strong> SEBUAH </strong> untuk memilih semua situs yang terdaftar, dan kemudian dari <strong> Mengajukan </strong> pilih menu <strong> Simpan Item yang Dipilih. </strong></p> <p><img src=\"images/image_thumb-102-438.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Ketik nama untuk file .txt dan klik <strong> Menyimpan </strong> . </p> <p><img src=\"images/image_thumb-103-923.png\" alt=\"How to Save Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p> 6. Buka file yang telah dibuat di notepad, untuk melihat semua password yang tersimpan di browser Mozilla Firefox. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}