{"title":"Cara Melindungi PC Anda dengan BitLocker di Windows 10.","content":"<p> Tutorial ini berisi petunjuk langkah demi langkah tentang cara melindungi kata sandi PC Anda dengan enkripsi BitLocker. BitLocker adalah fitur enkripsi disk lengkap yang disertakan dalam edisi Windows 10 Professional dan Enterprise dan dapat membantu Anda, untuk melindungi data pribadi Anda dari akses yang tidak sah. </p> <p> Bayangkan skenario berikut: Laptop pribadi Anda dicuri atau hilang dan data pribadi Anda tersedia untuk mata yang tidak bijaksana. Untuk menghindari hal ini terjadi, baca panduan ini, dan pelajari cara melindungi kata sandi PC Anda dan data berharga Anda dengan enkripsi yang kuat, agar tidak dapat diakses oleh siapa pun tanpa kata sandi dekripsi. </p> <ul> <li><strong> Artikel Terkait: <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Melindungi Folder dengan Kata Sandi. </a></strong></li> </ul> <h4> Cara menggunakan BitLocker untuk Mengenkripsi &amp; Melindungi PC Windows 10 Anda. </h4> <p> Untuk melindungi drive Sistem Operasi, dengan BitLocker di Windows 10 Pro atau Enterprise: </p> <p> 1. Dari Windows <strong> Panel kendali </strong> , klik <strong> Sistem dan keamanan </strong> lalu klik <strong> Enkripsi Drive Bit Locker </strong> . </p> <p><img src=\"images/image_thumb-33-320.png\" alt=\"How to Protect your PC with BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Di sebelah drive sistem operasi C:, klik <strong> Nyalakan BitLocker </strong> . * </p> <p> * Catatan: Jika setelah menekan &#39;Turn On BitLocker&#39;, Anda menerima pesan kesalahan &quot;Perangkat ini tidak dapat menggunakan Modul Platform Tepercaya...&quot;, baca artikel ini untuk memperbaiki masalah. </p> <p><img src=\"images/image_thumb-34-100.png\" alt=\"turn on bitlocker operating system drive\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Pada layar berikutnya, pilih bagaimana Anda ingin membuka kunci drive saat startup. </p> <blockquote><p> 1. Jika Anda ingin membuka kunci PC Anda dengan menggunakan perangkat USB, klik <strong> Masukkan USB flash drive. <br> </strong> 2. Jika Anda ingin membuka kunci PC Anda dengan mengetikkan kata sandi, klik <strong> Masukan kata sandi </strong> . (seperti dalam contoh ini) </p></blockquote> <p><img src=\"images/image_thumb-35-212.png\" alt=\"enable bitlocker protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Sekarang ketikkan kata sandi yang sangat kuat dan klik <strong> Lanjut </strong> . </p> <p><img src=\"images/image_thumb-36-435.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Sekarang pilih di mana Anda ingin menyimpan * kunci pemulihan dan klik <strong> Lanjut </strong> . * </p> <p> * Misalnya: jika Anda masuk ke Windows 10 dengan akun Microsoft, lalu klik <strong> Simpan ke Akun Microsoft Anda. </strong> Jika Anda masuk ke Windows 10 dengan akun lokal, pilih salah satu opsi lainnya. </p> <p> Catatan: <br> 1. Jika Anda menyimpan kunci pemulihan BitLocker ke Akun Microsoft Anda, maka Anda dapat melihat kunci tersebut setelah masuk ke <a title=\"https://onedrive.live.com/recoverykey.\" href=\"https://onedrive.live.com/recoverykey.\" target=\"_blank\" rel=\"nofollow noopener\"> https://onedrive.live.com/recoverykey. </a><br> 2. Saya selalu lebih suka menyimpan kunci pemulihan pada drive USB, agar siap untuk memecahkan masalah BitLocker. </p> <p> </p> <p><img src=\"images/image_thumb-37-801.png\" alt=\"save bitlocker recovery key\" loading=\"lazy\"></p> <p> </p> <p> 6. Pada layar berikutnya biarkan pengaturan default jika PC dan/atau drive Anda baru dan kemudian klik <strong> Lanjut </strong> lagi. </p> <p><img src=\"images/image_thumb-38-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Pada opsi mode enkripsi, biarkan pengaturan default dan klik <strong> Lanjut </strong> . </p> <p><img src=\"images/image_thumb-39-785.png\" alt=\"bitlocker encryption mode\" loading=\"lazy\"></p> <p> </p> <p> 8. Pada layar terakhir klik <strong> Terus </strong> , untuk memulai ulang dan memeriksa sistem sebelum mengaktifkan perlindungan BitLocker. </p> <p><img src=\"images/image_thumb-40-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Saat restart, Anda akan diminta untuk memasukkan kata sandi BitLocker Anda. Ketik kata sandi Anda dan tekan <strong> Memasukkan </strong> . * </p> <p> * Catatan: Jika BitLocker tidak dapat menerima kata sandi, atau jika Anda menghadapi masalah lain, coba salah satu tindakan berikut untuk masuk ke Windows: </p> <blockquote><p> 1. Tekan tombol ESC di layar Kata Sandi BitLocker untuk mengakses opsi pemulihan. <br> 2. Tekan berulang kali tombol ESC setelah menyalakan PC Anda, untuk melewati tes BitLocker. </p></blockquote> <p> 10. Jika tes BitLocker lulus, maka, setelah boot ke Windows 10, BitLocker akan mulai mengenkripsi drive sistem operasi Anda. Untuk melihat status proses enkripsi, klik notifikasi BitLocker di taskbar, atau buka Control Panel &gt; BitLocker Drive Encryption. </p> <p><img src=\"images/image_thumb-41-171.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}