{"title":"Cara Membuat Salinan File Bayangan dengan Penjadwal Tugas di Windows 10.","content":"<p> Dalam tutorial sebelumnya saya menyebutkan cara untuk membuat cadangan file pribadi Anda dengan <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Riwayat File </a> di Windows 10. Dalam tutorial ini saya akan menunjukkan cara membuat Salinan Bayangan file pribadi Anda secara otomatis dengan menggunakan Penjadwal Tugas. Salinan Bayangan file Anda, akan memungkinkan Anda untuk mengembalikan file atau folder tertentu ke versi sebelumnya (titik waktu). </p> <p> Fitur Shadow Copy pertama kali diperkenalkan di Windows Server 2003 dan kemudian ditambahkan ke Windows Vista dan versi 7, sebagai bagian dari fitur System Restore. Proses &#39;Shadow copy&#39;, dapat mengambil salinan cadangan dan snapshot dari status sistem saat ini dan file pribadi, bahkan jika sedang digunakan. Proses memulihkan file dari Shadow Copies lebih dikenal sebagai &quot;Pulihkan versi sebelumnya&quot;. </p> <h4> Cara Membuat Salinan Bayangan Setiap Hari dari File Anda di Windows 10. * </h4> <p><strong> * Catatan: </strong><br> 1. Dengan menggunakan petunjuk di bawah ini, Anda akan dapat membuat Salinan Bayangan (snapshot) harian dari seluruh volume &quot;C:\\&quot;. (File Sistem Windows dan data pribadi) <br> 2. Shadow Copies dapat digunakan untuk memulihkan file Anda ke titik waktu sebelumnya, dengan menggunakan fitur &#39;Pulihkan versi sebelumnya&#39;, atau dengan menggunakan utilitas pihak ketiga yang dapat mengakses Shadow Copies, seperti <a href=\"https://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> Penjelajah Bayangan </a> atau <a href=\"https://www.nirsoft.net/utils/shadow_copy_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowCopyView </a> . <br> 3. Salinan Bayangan <strong> tidak dapat digunakan untuk memulihkan sistem Anda </strong> ke titik waktu sebelumnya, dengan menggunakan <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> Pemulihan Sistem </a> alat. Jika Anda ingin dapat memulihkan sistem Anda dengan menggunakan Pemulihan Sistem, lanjutkan dan <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Aktifkan perlindungan Pemulihan Sistem. </a> <br> 4. Terakhir, perlu diingat, bahwa Shadow Copies yang dibuat bukanlah backup yang dapat diandalkan, karena &#39;Shadow Copies&#39; disimpan di drive utama C:\\, dan jika drive gagal, Anda akan kehilangan semua data Anda. Untuk membuat cadangan data yang andal, baca petunjuk di artikel ini: <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Mencadangkan File Pribadi dengan Riwayat File di Windows 10. </a></p> <p> </p> <p><strong> Untuk Membuat Versi Sebelumnya dari File Pribadi Anda dengan Menggunakan Salinan Bayangan: </strong></p> <p> 1. Buka <strong> Penjadwal Tugas </strong> . Jika Anda tidak tahu bagaimana melakukannya, maka… </p> <blockquote><p> 1. Pada kotak pencarian ketik <strong> Tugas </strong> atau <strong> Penjadwal Tugas </strong> . <br> 2. Buka &#39;Penjadwal Tugas&#39; dari hasil pencarian. </p></blockquote> <p><img src=\"images/image_thumb-31-630.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Pada Penjadwal Tugas klik <strong> Buat Tugas </strong> . </p> <p><img src=\"images/image_thumb-23-462.png\" alt=\"How to Start ThrottleStop at Windows Startup\" loading=\"lazy\"></p> <p> </p> <p> 3. Pada <strong> Umum </strong> tab: </p> <blockquote><p> 1. Ketik &quot;Buat Salinan Bayangan File Saya&quot; sebagai nama tugas. <br> 2. <strong> Memeriksa </strong> itu <strong> Jalankan dengan hak istimewa tertinggi </strong> kotak. </p></blockquote> <p> Catatan: Jika Anda ingin memulai tugas di latar belakang, letakkan titik di <strong> Jalankan apakah pengguna masuk atau tidak </strong> pilihan dan kemudian ketik kata sandi login Anda. </p> <p><img src=\"images/image_thumb-62-499.png\" alt=\"create shadow copies task windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Kemudian pilih <strong> Pemicu </strong> tab dan klik <strong> Baru </strong> . <br> 4a. Di jendela &#39;Pemicu Baru&#39;, tentukan seberapa sering membuat snapshot file Anda dan klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb-63-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Kemudian pilih <strong> tindakan </strong> tab dan klik <strong> Baru </strong> . <br> 5a. Di jendela &#39;Tindakan Baru&#39;: </p> <blockquote><p> 1. Pilih <strong> Mulai program </strong> . <br> 2. Pada &#39;Program/script&#39;, ketik: <strong> wmic </strong><br> 3. Di &#39;Tambahkan argumen (opsional)&#39; ketikkan: </p> <ul> <li><strong> panggilan shadowcopy buat Volume=C:\\ </strong></li> </ul> <p> 4. Setelah selesai, klik <strong> BAIK. </strong></p></blockquote> <p><img src=\"images/image_thumb-66-640.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Klik <strong> baik </strong> lagi untuk menutup properti tugas Terjadwal. </p> <p><img src=\"images/image_thumb-67-138.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Untuk membuat cadangan pertama Anda, klik kanan pada tugas dan pilih <strong> Lari </strong> . </p> <p><img src=\"images/image_thumb-68-388.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Anda sudah selesai! Mulai sekarang, setiap kali Anda ingin mengembalikan file/folder ke versi sebelumnya, klik kanan padanya dan pilih <strong> Kembalikan versi sebelumnya </strong> . </p> <p><img src=\"images/image_thumb-69-568.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Informasi yang berguna: <br> </strong> 1. Ruang yang dialokasikan maksimum yang dapat digunakan untuk menyimpan salinan bayangan adalah jumlah ruang yang mungkin digunakan oleh Pemulihan Sistem untuk menyimpan Poin Pemulihan. <br> 2. Untuk mengetahui ruang penyimpanan yang digunakan dan alokasi maksimum untuk salinan Shadow, berikan perintah ini di Command Prompt (Admin): </p> <ul> <li><strong> penyimpanan bayangan daftar vssadmin </strong></li> </ul> <p><img src=\"images/image_thumb-76-672.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Untuk mengubah ruang maksimum yang dialokasikan untuk Salinan Bayangan dan Poin Pemulihan Sistem, navigasikan ke <strong> Sistem keamanan </strong> pengaturan untuk <strong> Disk Lokal (C :) </strong><br> 4. Jika Anda ingin menghapus semua salinan bayangan yang disimpan, Anda juga harus menghapus titik pemulihan yang disimpan. Jika Anda ingin melakukannya, klik <strong> Hapus semua titik pemulihan </strong> tombol di pengaturan Perlindungan sistem. </p> <p><img src=\"images/image_thumb-77-662.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}