{"title":"Cara Mencadangkan File Pribadi dengan Riwayat File di Windows 10.","content":"<p> Dalam tutorial ini saya akan menunjukkan cara mengkonfigurasi Windows 10 untuk secara otomatis membuat salinan dan snapshot file Anda dengan menggunakan alat cadangan Riwayat File, agar dapat memulihkannya (jika diperlukan), dengan menggunakan &quot;Pulihkan Versi sebelumnya&quot; fitur. </p> <p> Seperti yang mungkin telah Anda perhatikan, secara default, Windows 10 tidak menyimpan versi sebelumnya dari file atau folder Anda, seperti di Windows 7. Ini terjadi, karena Windows 10 tidak lagi menggunakan layanan &#39;Volume Shadow Copy&quot; untuk mengambil snapshot file Anda, tetapi hanya menggunakan alat cadangan &#39;Riwayat File&#39;. </p> <p> &quot;File History&quot; adalah alat pencadangan bawaan yang sangat baik di Windows 10, yang dapat dikonfigurasi untuk mengambil salinan dan snapshot file Anda ke lokasi penyimpanan alternatif selain drive utama (mis. ke Drive USB, Jaringan, dll.) . * </p> <p> * Catatan: Satu-satunya batasan alat &quot;Riwayat File&quot;, adalah tidak memungkinkan Anda memilih drive C: sebagai tujuan pencadangan alternatif. jika Anda tidak memiliki drive sekunder yang tersedia untuk cadangan, lanjutkan membaca tutorial ini untuk mengetahui cara melewati batasan ini… </p> <ul> <li><strong> Artikel terkait: </strong> <a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Membuat Salinan Bayangan dari File Anda dengan Penjadwal Tugas di Windows 10. </a></li> </ul> <h4> Cara Mencadangkan File Pribadi Anda dengan Alat Pencadangan Riwayat File di Windows 10. </h4> <p> 1. Seperti yang saya sebutkan di atas, untuk mencadangkan file Anda dengan alat pencadangan Riwayat File, Anda harus memiliki drive penyimpanan yang tersedia yang terhubung ke PC Anda (misalnya drive USB), atau lokasi jaringan (misalnya komputer lain di Jaringan Anda , atau perangkat penyimpanan NAS). * </p> <p> * Catatan: Jika Anda tidak memiliki perangkat penyimpanan alternatif, Anda memiliki opsi berikut: </p> <blockquote><p> A. Untuk <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> mengecilkan ukuran drive utama Anda C:\\ </a> dan dengan ruang kosong yang tersedia untuk membuat drive baru untuk menyimpan cadangan, atau… </p> <p> B. Untuk menyimpan backup pada drive utama C:\\. Pada kasus ini, buat folder baru di drive C:, dan beri nama &quot;FileHistory&#39; (atau apa pun yang Anda inginkan) dan lanjutkan di bawah... </p></blockquote> <p> 2. Arahkan ke Windows <strong> Panel kendali </strong> dan dibawah <strong> Sistem dan keamanan, </strong> klik <strong> Simpan cadangan </strong><strong> salinan file Anda dengan File History. </strong></p> <p><img src=\"images/image_thumb-42-924.png\" alt=\"How to Backup & Keep Previous Versions of Files in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 3. Sekarang sesuai kasus Anda, lakukan hal berikut: </p> <ul> <li><strong> Kasus A </strong> Jika Anda memiliki drive yang tersedia untuk cadangan, maka: </li> </ul> <blockquote><p> Sebuah. Klik <strong> Nyalakan </strong> tombol di layar untuk mengaktifkan &#39;Riwayat File&#39;. <br> b. Lanjutkan ke <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> langkah-4 </a> di bawah ini untuk mengonfigurasi pengaturan pencadangan &#39;Riwayat File&#39;. </p></blockquote> <p><img src=\"images/image_thumb-44-788.png\" alt=\"Turn On File History Windows 10\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Kasus B: </strong> Jika Anda tidak memiliki drive yang tersedia untuk cadangan Riwayat File atau jika Anda ingin menyimpan cadangan di jaringan, maka: </li> </ul> <blockquote><p> Sebuah. Klik <strong> Pilih lokasi jaringan. </strong></p></blockquote> <p><img src=\"images/image_thumb-56-796.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Di layar berikutnya: </p> <p> 1. Jika Anda ingin menyimpan cadangan di Jaringan, ketik jalur jaringan lengkap dari lokasi penyimpanan cadangan dan klik <strong> Pilih folder </strong> . </p> <p> 2.  Jika Anda ingin menyimpan cadangan di drive utama C:\\, ketikkan path jaringan lengkap ke folder cadangan lokal di drive C:\\, pada formulir ini: * </p> <ul> <li> <strong> \\\\Nama-Komputer\\C$\\FileHistory </strong></li> </ul> <p> * Catatan: <br> 1. Ganti nilai &quot;Computer-Name&quot; dengan nama PC Anda. (Untuk menemukan nama komputer Anda, klik kanan pada ikon &quot;PC ini&quot; di Windows Explorer). <br> 2. Perlu diingat, bahwa menyimpan cadangan file pribadi Anda di drive yang sama tempat file tersebut disimpan <strong> bukan solusi yang dapat diandalkan </strong> . Agar aman, selalu simpan cadangan ke perangkat penyimpanan lain. </p></blockquote> <p> misalnya: jika nama komputer adalah &quot;Pegasus&quot;, ketik: &quot;\\\\Pegasus\\C$\\FileHistory&quot; </p> <p><img src=\"images/image_thumb-53-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> c. Di layar berikutnya, klik <strong> baik </strong> . </p></blockquote> <p><img src=\"images/image_thumb-54-349.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> d. Sekarang klik <strong> Nyalakan </strong> untuk mengaktifkan alat pencadangan Riwayat File, lalu lanjutkan di bawah untuk mengonfigurasi pengaturan pencadangan. </p></blockquote> <p><img src=\"images/image_thumb-48-620.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Untuk mengonfigurasi opsi pencadangan &#39;Riwayat File&#39;, klik <strong> Pengaturan lanjutan </strong> di kiri. </p> <p><img src=\"images/image_thumb-49-919.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4a. Kemudian di <strong> Pengaturan lanjutan </strong> opsi, atur seberapa sering untuk membuat cadangan file Anda dan berapa lama untuk menyimpan versi yang disimpan. Setelah selesai, klik <strong> Simpan perubahan </strong> . </p> <p><img src=\"images/image_thumb-61-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Terakhir klik <strong> Lari sekarang </strong> untuk mengambil cadangan pertama Anda. * </p> <p><img src=\"images/image_thumb-55-463.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Bantuan Tambahan – Catatan: <br> 1. Secara default &#39;Riwayat File&#39; mengambil cadangan folder &#39;Perpustakaan&#39; (Desktop, Dokumen, Favorit, Musik, OneDrive, Gambar &amp; Video). Jika Anda ingin mengecualikan salah satu folder ini dari cadangan, untuk menyertakan folder lain, atau untuk meninjau semua opsi pencadangan Riwayat File, lalu navigasikan ke: </p> <ul> <li> <p><strong> Pengaturan <img src=\"images/image_thumb-58-467.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Pembaruan &amp; Keamanan </strong> &gt; <strong> Cadangan </strong> &gt; <strong> Opsi lanjutan. </strong></p> </li> </ul> <p><img src=\"images/image_thumb-57-938.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Untuk memulihkan file Anda dari cadangan &#39;Riwayat File&#39;, navigasikan ke salah satu lokasi berikut: </p> <ul> <li><strong> Panel kendali </strong> &gt; <strong> Riwayat File </strong> &gt; <strong> Kembalikan File Pribadi. </strong></li> <li><strong> Pengaturan <img src=\"images/image_thumb-59-275.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Pembaruan &amp; Keamanan </strong> &gt; <strong> Cadangan </strong> &gt; <strong> Opsi lanjutan </strong> &gt; <strong> Pulihkan file dari cadangan saat ini. </strong></li> </ul> <p> 3. Untuk selektif mengembalikan file atau folder ke versi sebelumnya, klik kanan pada file (atau folder) dan pilih <strong> Pulihkan Versi Sebelumnya </strong> . </p> <p><img src=\"images/image_thumb-60-867.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}