{"title":"Cara Berbagi File dan Folder di OS Windows 10, 8.1 atau 7.","content":"<p> Fitur Berbagi File di Windows, memberi Anda kemampuan untuk berbagi folder dan file dengan mudah di antara pengguna di jaringan Anda. Dengan berbagi file Anda dengan pengguna lain di jaringan yang sama, Anda akan dapat melihat dan bekerja dengan file/folder yang sama. </p> <p> Tutorial ini berisi instruksi tentang cara berbagi folder dan/atau file di Sistem Operasi Windows 10, 8, 8.1 atau 7. </p> <h4> Cara Mengaktifkan Berbagi File di Windows. </h4> <h5> Langkah 1. Tambahkan Pengguna yang Diperlukan ke PC Anda. </h5> <p> Sebelum Anda melanjutkan berbagi file dengan orang lain, tambahkan pengguna yang akan memiliki akses ke folder bersama di komputer. Untuk melakukan tugas tersebut, ikuti petunjuk pada artikel berikut ini, sesuai dengan versi Windows Anda. </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-create-a-new-user-in-windows-7\" target=\"_blank\" rel=\"nofollow noopener\"> Cara menambahkan Pengguna Baru di Windows 7. </a></li> <li><a href=\"https://www.repairwin.com/how-to-add-a-new-user-account-in-windows-10-8/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara menambahkan Pengguna Baru di Windows 10/8.1 </a></li> </ul> <p> </p> <h5> Langkah 2. Bagaimana Berbagi Folder atau file dengan orang lain. </h5> <p> 1. Klik kanan pada folder (atau file) yang ingin Anda bagikan dan pilih <strong> Berikan akses ke </strong> -&gt; <strong> Orang spesifik. </strong></p> <p><img src=\"images/image_thumb-56-411.png\" alt=\"How to Share Files and Folders in Windows 10, 8.1, 7\" loading=\"lazy\"></p> <p> </p> <p> 2. Dengan menggunakan menu tarik-turun, pilih pengguna yang ingin Anda bagikan file Anda, lalu klik <strong> Menambahkan </strong> . </p> <p><img src=\"images/image_thumb-57-274.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Sekarang klik panah bawah, di sebelah pengguna yang Anda tambahkan dan tentukan izin aksesnya (Tingkat Izin) </p> <p><img src=\"images/image_thumb-58-517.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Setelah selesai, tekan tombol <strong> Bagikan </strong> tombol, </p> <p><img src=\"images/image_thumb-59-431.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Catat tautan yang diberikan ke folder bersama* dan klik <strong> Selesai </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-60-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Pada titik ini, Anda telah mengaktifkan berbagi file di komputer Anda. Untuk mengakses folder bersama dari PC lain: </p> <blockquote><p> Sebuah. Di bilah alamat Explorer, ketik tautan ke folder bersama, seperti yang ditunjukkan pada langkah sebelumnya. (misalnya.&quot;\\\\DESKTOP-HMG31RD\\2Share&quot; tanpa tanda kutip) <br> b. tekan <strong> Memasukkan </strong> . <br> c. Ketik nama pengguna dan kata sandi pengguna yang telah Anda akses dan tekan <strong> baik </strong> . </p></blockquote> <p><img src=\"images/image_thumb-61-512.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Informasi tambahan: <br> 1.Untuk mengubah izin pengguna cukup ikuti kembali prosedur di atas, dan ubah Tingkat Izin pengguna. <br> 2. Jika Anda ingin menghentikan berbagi file, klik kanan pada folder/file bersama dan pergi ke <strong> Berikan akses ke </strong> -&gt; dan pilih <strong> Hapus akses </strong> . </p> <p><img src=\"images/image_thumb-62-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang masalah ini. </p>"}