{"title":"Cara Melindungi Folder dengan Kata Sandi di Windows 10 (Mengunci Folder dengan Kata Sandi).","content":"<p> Tutorial ini berisi dua metode gratis dan aman yang berbeda untuk melindungi folder dengan kata sandi di OS Windows 10/8/7. Jika Anda mengunci folder dengan kata sandi, itu tidak akan dapat diakses oleh siapa pun selain Anda. Melindungi folder dengan kata sandi, berguna jika Anda berbagi komputer dengan orang lain dan Anda tidak ingin orang lain mengakses dan membaca file pribadi Anda. </p> <ul> <li><strong> Artikel terkait: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Melindungi Kata Sandi PC Windows 10 Anda dengan BitLocker </a> . </strong></li> </ul> <h4> Cara Mengunci Folder dengan Kata Sandi di Windows 10. </h4> <h6> Metode 1. Cara Mengunci dan Mengenkripsi File dengan 7-zip (Windows Semua Versi). </h6> <p> Metode termudah dan paling aman, untuk melindungi folder dengan kata sandi di Windows, adalah dengan menggunakan utilitas pengarsipan 7-Zip, yang juga mendukung enkripsi. Untuk mengenkripsi dan melindungi kata sandi folder/file dengan 7-zip: </p> <p> 1. Unduh dan instal <a href=\"https://www.7-zip.org/\" target=\"_blank\" rel=\"nofollow noopener\"> 7-zip </a> program pengarsipan. <br> 2. Klik kanan pada folder (atau file) yang ingin Anda lindungi dengan kata sandi dan pilih: <strong> 7-zip </strong> &gt; <strong> Tambahkan ke Arsip </strong> . </p> <p><img src=\"images/image_thumb-28-978.png\" alt=\"How to Password Protect a Folder\" loading=\"lazy\"></p> <p> </p> <p> 3. Pada opsi &#39;Tambahkan ke arsip&#39;, tentukan kata sandi yang kuat lalu klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb-29-728.png\" alt=\"set password to archive with 7-zip\" loading=\"lazy\"></p> <p> </p> <p> 4. Kemudian hapus folder (atau file) yang tidak terkompresi dan selesai! </p> <h6> Metode 2. Cara Mengenkripsi Folder dengan Perlindungan EFS (Windows Pro &amp; Enterprise). </h6> <p> EFS Protection adalah alat enkripsi bawaan, dalam edisi Windows 10 Professional dan Enterprise. Jika Anda melindungi folder atau file dengan enkripsi EFS sangat sulit bagi orang lain untuk mengakses file terenkripsi, tanpa memiliki kunci dekripsi (sertifikat kunci PFX). </p> <p> Satu-satunya kelemahan enkripsi EFS, adalah bahwa enkripsi akan dihapus jika Anda menyalin file terenkripsi di komputer jaringan lain atau jika Anda mengirim file terenkripsi melalui email. </p> <p> Selain itu, saat Anda mengenkripsi file EFS, kunci dekripsi (sertifikat) disimpan secara lokal di komputer Anda. Ini berarti bahwa siapa pun yang memiliki kata sandi Anda juga akan memiliki akses ke file terenkripsi Anda. Oleh karena itu, jika Anda mengenkripsi file Anda dengan enkripsi EFS, tentukan kata sandi login yang kuat dan jangan bagikan dengan orang lain. </p> <ul> <li><strong> Artikel Terkait: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Mendekripsi File Terenkripsi EFS dan Menghapus Enkripsi EFS. </a></strong></li> </ul> <p><strong> Untuk mengenkripsi folder atau file dengan EFS: </strong><br> 1. Klik kanan pada folder (atau file) yang ingin Anda lindungi dan pilih <strong> Properti </strong> . <br> 2. Pada tab Umum, klik <strong> Maju </strong> . </p> <p><img src=\"images/image_thumb-13-582.png\" alt=\"enable efs protection\" loading=\"lazy\"></p> <p> </p> <p> 3. Pilih <strong> Enkripsi file untuk mengamankan data </strong> lalu klik <strong> BAIK. </strong></p> <p><img src=\"images/image_thumb-14-983.png\" alt=\"How to Lock Folder with Password - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Kemudian klik <strong> Menerapkan </strong> dan <strong> baik </strong> lagi untuk menyimpan perubahan dan keluar. <br> 5. Pada titik ini Windows akan meminta Anda untuk membuat cadangan kunci pemulihan. Klik <strong> Cadangkan kunci enkripsi file Anda. </strong></p> <p><img src=\"images/image_thumb-2-823.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Kemudian klik <strong> Cadangkan sekarang (disarankan) </strong> dan simpan kunci sertifikat dekripsi ke drive USB. </p> <p><img src=\"images/image_thumb-15-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Pada wizard Ekspor Sertifikat klik <strong> Lanjut </strong> di layar Selamat Datang. <br> 8. Kemudian klik <strong> Lanjut </strong> lagi di layar Ekspor Format File. </p> <p><img src=\"images/image_thumb-4-842.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. Pada opsi Keamanan: </p> <blockquote> <p> 1. <strong> Memeriksa </strong> itu <strong> Kata sandi </strong> kotak. <br> 2. Ketikkan kata sandi untuk kunci sertifikat yang diekspor. <br> 3. Pilih <strong> AES256-SHA256 </strong> enkripsi <br> 4. Klik <strong> Lanjut </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-16-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. Klik <strong> Jelajahi </strong> dan <strong> Menyimpan </strong> file sertifikat (.pfx) di komputer Anda. <br> 11. Setelah selesai, klik <strong> Lanjut </strong> untuk melanjutkan. </p> <p><img src=\"images/image_thumb-17-804.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. Terakhir klik <strong> Selesai </strong> . </p> <p><img src=\"images/image_thumb-18-449.png\" alt=\"image\" loading=\"lazy\"></p> <p> 13. Saat ekspor selesai, simpan kunci sertifikat yang diekspor (file .pfx) ke lokasi aman lainnya (mis. ke disk USB). </p> <p><strong> TIP: </strong> Saat Anda mengenkripsi folder (atau file) dengan EFS, kunci dekripsi (sertifikat) disimpan di folder profil pengguna Anda. Jadi, jika pengguna lain memiliki kata sandi masuk Windows Anda, itu dapat membuka dan membaca file terenkripsi. Untuk menghindari hal ini terjadi, jangan bagikan kata sandi login Anda, atau, hapus (copot pemasangan) sertifikat dekripsi dari profil Anda saat Anda meninggalkan PC dan menginstalnya kembali saat Anda kembali. * </p> <p> * Catatan: Untuk menghapus dan mengimpor kembali kunci pemulihan (sertifikat), buka: </p> <blockquote> <p> Sebuah. <strong> Panel kendali </strong> &gt; <strong> Pilihan internet. <br> </strong> b. Di &#39;Opsi Internet&#39; klik <strong> Kandungan </strong> tab lalu klik <strong> Sertifikat </strong> s. <br> c. Pada tab &#39;Pribadi&#39; klik <strong> Menghapus </strong> tombol, untuk menghapus kunci dekripsi (sertifikat), atau klik tombol <strong> Impor </strong> untuk menginstal ulang sertifikat dekripsi dari drive USB. </p> </blockquote> <ul> <li> <p><strong> Artikel Terkait: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"noopener noreferrer\"> Cara Mendekripsi File Terenkripsi EFS dan Menghapus Enkripsi EFS. </a></strong></p> </li> </ul> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini </p>"}