{"title":"Cara Membuka PowerShell Sebagai Administrator di Folder Saat Ini di File Explorer (Windows 10)","content":"<p> Jika Anda ingin membuka PowerShell atau PowerShell sebagai Administrator, di lokasi/folder mana pun di File Explorer, lanjutkan membaca tutorial ini. Seperti yang Anda ketahui cara biasa untuk membuka PowerShell di Windows 10, adalah dengan mencarinya menggunakan pencarian Cortana, atau (lebih cepat) dengan menekan tombol <strong> Menang <img src=\"images/image_thumb8_thumb_thumb-479.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"></strong> + <strong> X </strong> untuk membuka &quot;menu Power User&quot; dan menjalankan Windows PowerShell dari sana. </p> <p><img src=\"images/image_thumb-54-350.png\" alt=\"PoweShell Admin (Win + X menu)\" loading=\"lazy\"></p> <p> </p> <p> Meskipun metode ini berguna, terkadang ada kebutuhan untuk membuka PowerShell di lokasi/folder tertentu. Untuk melakukannya, ikuti petunjuk di bawah ini. </p> <h4> Cara Membuka Windows PowerShell di Lokasi Tertentu di Windows 10. </h4> <p> 1. Arahkan ke folder tempat Anda ingin membuka PowerShell. <br> 2. <strong> Menekan </strong> itu <strong> BERGESER </strong> kunci dan <strong> klik kanan </strong> mana saja di dalam folder. <br> 3. Dari menu klik kanan, pilih <strong> Buka jendela PowerShell di sini </strong> untuk <strong> </strong> buka jendela PowerShell baru di folder itu. </p> <p> </p> <p><img src=\"images/image_thumb-55-793.png\" alt=\"Open PoweShell at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Jika Anda ingin membuka &#39;PowerShell As Admin&#39; di folder mana pun, lalu klik tombol <strong> Mengajukan </strong> menu dan pilih <strong> Buka Windows PowerShell sebagai administrator </strong> . * </p> <p> * Catatan: Seperti yang Anda lihat dari menu &#39;File&#39;, Anda juga dapat membuka jendela PowerShell &quot;sederhana&quot;. </p> <p><img src=\"images/image_thumb-56-830.png\" alt=\"Open PoweShell As Administrator at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p><strong> Bantuan tambahan: </strong> Jika Anda penggemar pintasan keyboard, cara lain untuk membuka PowerShell (Admin) adalah dengan menekan tombol <strong> Alt </strong> + <strong> F </strong> + <strong> S </strong> + <strong> SEBUAH </strong> kunci secara berurutan. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}