{"title":"Cara Menonaktifkan BitLocker di Windows 10.","content":"<p> Tutorial ini berisi instruksi tentang cara menonaktifkan Perlindungan Bitlocker dan enkripsi Drive di Windows 10. Seperti yang Anda ketahui, fitur enkripsi BitLocker yang tersedia di Windows 10 versi pro dan perusahaan, dapat membantu Anda melindungi konten PC Anda dari akses yang tidak sah. Tetapi terkadang ada kebutuhan untuk menonaktifkan Bitlocker di Windows 10, jadi dalam panduan ini Anda dapat menemukan cara melakukannya. </p> <p> Jika komputer Anda dilindungi dengan BitLocker, maka ketika Anda memulai sistem, Anda akan diminta untuk menghubungkan drive USB yang Anda gunakan selama aktivasi BitLocker atau untuk memasukkan kata sandi BitLocker Anda untuk membuka kunci drive C: untuk melanjutkan booting. Jika Anda tidak memilikinya, tekan <strong> ESC </strong> untuk memasukkan kunci pemulihan BitLocker Anda. * </p> <blockquote><p> * Catatan: <br> 1. Jika Kunci Pemulihan atau Kata Sandi Bitlocker tidak diterima saat startup sistem, coba buka kunci dan dekripsi hard drive ke komputer Windows 10 lain atau coba: <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-recovery-environment-winre/\" target=\"_blank\" rel=\"nofollow noopener\"> Buka kunci dan Dekripsi Drive yang Dilindungi di Lingkungan Pemulihan Windows (WinRE). </a><br> 2. Jika Anda Tidak Dapat Membuka Kunci Drive (mis. Jika Anda tidak memiliki Kunci Pemulihan BitLocker atau karena kunci BitLocker tidak diterima) dan Anda ingin menghapus enkripsi BitLocker agar dapat menggunakan kembali drive yang dilindungi, baca tutorial ini: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Menghapus Perlindungan BitLocker dari Drive Tanpa Kunci Pemulihan BitLocker atau Kata Sandi </a> . </p></blockquote> <p><img src=\"images/image_thumb-53-752.png\" alt=\"How to Disable BitLocker in Windows 10 GUI - PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Setelah boot ke Windows, ikuti petunjuk di bawah ini untuk menonaktifkan perlindungan bitlocker dan mendekripsi drive. </p> <h4> Cara Mematikan Perlindungan BitLocker dan Mendekripsi Drive Terenkripsi Bitlocker di Windows 10. </h4> <p> Untuk mematikan perlindungan Bitlocker, Anda harus memiliki kata sandi Bitlocker atau kunci pemulihan bitlocker untuk membuka kunci drive terlebih dahulu dan kemudian mendekripsi drive. </p> <p> Kunci pemulihan Bitlocker adalah kunci angka 48 digit dan dapat ditemukan di lokasi berikut: </p> <ul> <li> Pada cetakan yang Anda simpan, saat Anda mengaktifkan Bitlocker. </li> <li> Pada drive USB yang Anda gunakan, selama aktivasi Bitlocker untuk menyimpan kunci pemulihan Bitlocker. </li> <li> Pada <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Kunci Pemulihan Akun Microsoft </a> , dengan menggunakan akun MS yang Anda gunakan untuk masuk ke perangkat Anda, atau Anda telah menambahkan ke perangkat untuk mengunduh aplikasi dari Microsoft Store, atau untuk mengaktifkan MS Office atau untuk email. </li> <li> Pada Anda <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Akun Azure </a> untuk PC kerja yang login dengan akun Azure Active Directory. </li> </ul> <p> Setelah Anda menemukan kunci pemulihan Bitlocker atau kata sandi bitlocker, lanjutkan untuk membuka kunci drive terenkripsi Bitlocker dan menghapus enkripsi Bitlocker dengan menggunakan salah satu cara berikut: </p> <ul> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Metode 1. Nonaktifkan Perlindungan BitLocker dari GUI Windows. </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metode 2. Nonaktifkan BitLocker &amp; Dekripsi Drive Terenkripsi Bitlocker dari PowerShell. </a></li> </ul> <p> </p> <h6> Metode 1. Cara Mematikan Proteksi Bitlocker di GUI Windows 10. </h6> <p> Untuk menonaktifkan perlindungan pada Drive Sistem C Anda: </p> <p> 1. Navigasikan ke Windows <strong> Panel kendali </strong> -&gt; <strong> Sistem dan keamanan </strong> lalu klik <strong> Enkripsi Drive Bit Locker </strong> . </p> <p><img src=\"images/image_thumb-33-233.png\" alt=\"How to turn off or Turn Onn BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Di sebelah drive sistem operasi C:, klik <strong> Matikan BitLocker </strong> . * </p> <p> * Catatan: <br> 1. Jika opsi &quot;Matikan BitLocker&quot;, tidak tersedia, buka <strong> command prompt sebagai administrator </strong> dan berikan perintah berikut: </p> <ul> <li> kelola-bde -off C: </li> </ul> <p> 2. Untuk melihat status dekripsi (progres) drive C:, berikan perintah ini: </p> <ul> <li> kelola-bde -status C: </li> </ul> <p> </p> <p> </p> <p><img src=\"images/image_thumb-43-236.png\" alt=\"turn off bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Setelah Mematikan Bitlocker, kemudian klik ikon Bitlocker di taskbar untuk melihat proses dekripsi. </p> <p><img src=\"images/image_thumb-41-694.png\" alt=\"remove bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Untuk menonaktifkan perlindungan pada drive yang dilindungi BitLocker lainnya dari GUI Windows: </p> <p> 1. Buka Windows Explorer lalu klik dua kali pada drive yang terkunci. <br> 2. Masukkan kata sandi Bitlocker atau klik <strong> Opsi lanjutan </strong> untuk memasukkan kunci Pemulihan Bitlocker, untuk membuka kunci drive. </p> <p><img src=\"images/image_thumb-47-646.png\" alt=\"unlock bitlocker windows 10\" loading=\"lazy\"></p> <p> 2. Setelah membuka kunci drive, lalu navigasikan ke <strong> Panel kendali </strong> -&gt; <strong> Sistem dan keamanan </strong> -&gt; <strong> Enkripsi Drive Bit Locker </strong> dan setelah memilih drive klik <strong> Matikan BitLocker </strong> untuk mendekripsi drive. (lihat screenshot di atas) </p> <p> </p> <h6> Metode 2. Cara Mematikan Perlindungan BitLocker &amp; Mendekripsi Drive Terenkripsi Bitlocker dari PowerShell di Windows 10. </h6> <p> 1. Buka PowerShell sebagai Administrator. Untuk melakukannya: </p> <ol> <li> <ol> <li> Di <strong> Cortana </strong> kotak pencarian, ketik <strong> powershell </strong></li> <li> Klik kanan pada <strong> Windows PowerShell </strong> hasil dan pilih <strong> Jalankan sebagai administrator. </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb_thumb-1-316.png\" alt=\"disable bitlocker powershell windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Kemudian periksa status enkripsi setiap drive di komputer Anda, dengan mengetikkan perintah ini: </p> <ul> <li><strong> kelola-bde -status </strong></li> </ul> <p> </p> <p> 3. Catat di mana huruf drive yang ditunjukkan oleh Status Kunci <strong> Terkunci </strong> , dan kemudian lanjutkan untuk membuka kunci drive itu, dengan mengetikkan perintah ini: * </p> <ul> <li><strong> manage-bde -unlock drive-letter: -rp BitLocker-recovery-key​ </strong></li> </ul> <p> * misalnya: Jika Anda ingin membuka kunci drive &quot;D:&quot; dan kunci pemulihan bitlocker adalah: &quot;123456-123456-123456-123456-123456-123456&quot; lalu ketik: </p> <ul> <li> <ul> <li> manage-bde -unlock D: -rp 123456-123456-123456-123456-123456-123456 </li> </ul> </li> </ul> <p> </p> <p> * Catatan: Jika Anda mengetahui kata sandi Bitlocker maka berikan perintah ini: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -pw BitLocker-Password </strong></li> </ul> <p> * mis.: Jika Anda ingin membuka kunci drive &quot;D:&quot; dan kata sandi BitLocker adalah: &quot;123qwerty&quot; lalu ketik: * </p> <ul> <li> <ul> <li> kelola-bde -buka kunci D: -sandi 123qwerty </li> </ul> </li> </ul> <p> </p> <p> 4. Kemudian nonaktifkan enkripsi bitlocker dan dekripsi drive terenkripsi, dengan menggunakan salah satu perintah berikut: </p> <ul> <li><strong> Nonaktifkan-BitLocker -MountPoint &quot;huruf drive:&quot; </strong></li> <li><strong> manage-bde -off drive-letter: </strong></li> </ul> <p> * mis.: Jika Anda ingin menonaktifkan enkripsi bitlocker pada drive &quot;D:&quot;, lalu ketik: </p> <ul> <li> <ul> <li> Nonaktifkan-BitLocker -MountPoint &quot;D:&quot; </li> </ul> </li> </ul> <blockquote> <p> ATAU ketik… </p> </blockquote> <ul> <li> <ul> <li> kelola-bde –off D: </li> </ul> </li> </ul> <p> 5. Setelah proses dekripsi selesai, lanjutkan untuk memeriksa kembali status enkripsi dengan memberikan perintah ini: </p> <ul> <li><strong> kelola-bde -status </strong></li> </ul> <p> 6. Jika &#39;Status Kunci&#39; muncul <strong> Tidak terkunci </strong> dan &#39;Status Konversi&#39; menunjukkan <strong> Didekripsi Sepenuhnya, </strong> kamu sudah selesai! </p> <p><img src=\"images/image_thumb-50-868.png\" alt=\"view bitlocker status\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang masalah ini. </p>"}