{"title":"Cara Auto Login ke Windows 10/8/7 (Tanpa Mengetik Password).","content":"<p> Tutorial ini berisi instruksi tentang cara masuk otomatis ke Windows 10. Sebenarnya Anda akan belajar cara masuk secara otomatis ke akun pengguna Anda (akun Microsoft, Lokal atau Domain), tanpa harus memasukkan kredensial Anda di Masuk atau di layar Kunci . Instruksi berlaku untuk OS Windows 10/8/7. </p> <p> Saat Anda melakukan penginstalan Windows 10 baru, Anda akan diminta untuk menentukan akun pengguna dan kata sandi untuk menggunakan komputer. Pada langkah ini, Anda dapat menggunakan akun Microsoft Anda (dengan kata sandi akun MS Anda), atau untuk membuat Akun Lokal baru dan kata sandi baru untuk masuk di Windows. Dalam kedua kasus (kecuali jika Anda membuat akun lokal dengan kata sandi kosong), Anda akan diminta untuk mengetikkan kata sandi setiap kali Anda memulai Windows. </p> <p> Melindungi komputer Anda sendiri dengan kata sandi adalah tindakan keamanan yang baik, terutama jika Anda berbagi komputer dengan orang lain, atau saat Anda bepergian dengan laptop, atau saat PC Anda berada di lingkungan bisnis. Namun, jika Anda adalah satu-satunya pengguna di komputer desktop mandiri Anda, atau jika Anda hanya menggunakan laptop di rumah, Anda tidak perlu mengetikkan kredensial Anda setiap kali Anda ingin menggunakannya. * </p> <p><strong> Peringatan: </strong> JANGAN AKTIFKAN LOGON OTOMATIS di Windows jika Anda berbagi komputer dengan orang lain, atau jika Anda bepergian dengan laptop atau tablet, karena semua orang yang menemukan komputer Anda akan memiliki akses mudah ke file Anda. </p> <h4> Cara Otomatis Masuk ke Akun Pengguna Anda di Windows 10/8/7/Vista. (Aktifkan Login Otomatis) </h4> <h6> Metode 1. Aktifkan Login Otomatis dengan menggunakan utilitas AUTOLOGON. </h6> <p> Microsoft telah merancang alat untuk mengotomatisasi proses login di Windows. Alat ini bernama &quot;Autologon&quot; dan memungkinkan Anda untuk dengan mudah mengonfigurasi Windows ke login otomatis tanpa harus mengetikkan kredensial Anda di setiap startup. Keuntungan dari alat ini, adalah bahwa kata sandi disimpan terenkripsi di registri. </p> <p> 1. Unduh <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/autologon\" target=\"_blank\" rel=\"nofollow noopener\"> Masuk otomatis </a> utilitas. <br> 2. Ekstrak file yang diunduh. <br> 3. Jalankan &quot;autologon.exe&quot; <br> 4. Ketik kata sandi Anda dan klik <strong> Memungkinkan </strong> . </p> <p><img src=\"images/image_thumb-44-251.png\" alt=\"windows auto login\" loading=\"lazy\"></p> <p> * Catatan: Jika Anda ingin mengaktifkan logon otomatis, jalankan utilitas lagi dan klik <strong> Nonaktifkan </strong> . </p> <p> </p> <h6> Metode 2. Aktifkan Masuk Otomatis dari panel kontrol Akun Pengguna. </h6> <p> Metode kedua untuk mengaktifkan Login Otomatis ke Windows 10/8/7, adalah dengan menonaktifkan pengaturan &quot;Pengguna harus memasukkan nama pengguna dan kata sandi untuk menggunakan komputer ini&quot; di panel kontrol Akun Pengguna. Untuk melakukannya: </p> <p> Catatan: Jika Anda menggunakan akun lokal, ada cara lain yang lebih sederhana untuk memaksa Windows Masuk secara otomatis: Cukup tentukan kata sandi kosong (kosong) baru dari Pengaturan &gt; Akun &gt; Opsi masuk &gt; Ubah Kata Sandi. Kemudian ketikkan kata sandi Anda sekali dan kemudian klik Berikutnya dua kali dan Selesai. </p> <p> 1. Tekan Windows <img src=\"images/image_thumb8_thumb_thumb-738.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> 2. Di kotak &quot;Buka&quot;, ketik: <strong> kontrol kata sandi pengguna2 </strong> &amp; klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb-29-873.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Dalam opsi Akun Pengguna (tab &#39;Pengguna&#39;), <strong> hapus centang </strong> itu <strong> Pengguna harus memasukkan nama pengguna dan kata sandi untuk menggunakan kotak centang komputer ini </strong> lalu klik <strong> Menerapkan. * </strong></p> <p> * Catatan: Jika Anda ingin menonaktifkan login otomatis di masa mendatang, cukup centang kotak ini. </p> <p><img src=\"images/image_thumb-32-315.png\" alt=\"auto login windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Ketik (dua kali) kata sandi akun Anda dan klik <strong> baik </strong> dua kali untuk menutup properti Akun Pengguna. </p> <p><img src=\"images/image_thumb-31-509.png\" alt=\"Auto Login to Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Metode 3. Aktifkan Login Otomatis di Registry (Windows 10/8/7/Vista). </h6> <p> Metode terakhir untuk menonaktifkan login kata sandi, di OS Windows 10, 8 atau 7, adalah dengan mengaktifkan registri masuk otomatis. Untuk melakukannya: </p> <p> 1. Tekan Windows <img src=\"images/image_thumb8_thumb_thumb-512.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> 2. Di kotak &quot;Buka&quot;, ketik: <strong> regedit </strong> &amp; klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb7-114.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Arahkan ke kunci ini dari panel kiri: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon </li> </ul> <p> 4. Di panel kanan: </p> <blockquote><p> Sebuah. Klik kanan di ruang kosong dan pilih <strong> Baru </strong> &gt; <strong> Nilai string. </strong></p> <p><img src=\"images/image_thumb-38-930.png\" alt=\"image\" loading=\"lazy\"></p> <p> b. Ganti nama nilai baru menjadi <strong> NamaPengguna Default </strong> dan tekan <strong> Memasukkan </strong> . <br> c. Buka nilai REG_SZ &#39;DefaultUserName&#39;. <br> d. Ketik nama Akun Pengguna Lokal Anda atau Akun Microsoft Anda dan klik <strong> baik </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-42-933.png\" alt=\"enable auto login registry\" loading=\"lazy\"></p> <p> </p> <p> 5a. Lakukan langkah yang sama dan buat nilai REG_SZ (String) baru dan beri nama <strong> Kata Sandi Bawaan </strong> . <br> 5b. Klik dua kali di &#39;DefaultPassword <strong> &#39; </strong> nilai REG_SZ, ketikkan kata sandi Anda di kotak Data nilai dan klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb-43-192.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7a. Terakhir, buat nilai REG_SZ baru dan beri nama <b> Login Admin Otomatis </b> . <br> 7b. Klik dua kali pada nilai &#39;AutoAdminLogon&#39;, ketik <strong> 1 </strong> di kotak Data nilai dan klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb-41-705.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Tutup Registry Editor dan Restart PC Anda. * </p> <p> * Catatan: <br> 1. Jika komputer Anda adalah bagian dari Domain, maka Anda harus membuat satu lagi nilai REG_SZ dengan nama <strong> NamaDomain Default </strong> dan kemudian ketik di kotak data nilai nama domain Anda. <br> 2. Untuk menonaktifkan login otomatis di masa mendatang, hapus saja nilai string yang baru dibuat yang disebutkan di atas. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}