{"title":"Cara Menemukan Windows Media Player di Windows 10.","content":"<p> Selama bertahun-tahun sekarang, Windows Media Player, adalah aplikasi default untuk memutar musik dan video. Di Windows 10, Windows Player, tidak lagi, pemutar default untuk file media dan telah digantikan oleh aplikasi &quot;Film dan TV&quot;. </p> <p> Artikel ini ditulis untuk semua pengguna yang ingin mencari dan menggunakan Windows Media Player klasik, sebagai pemutar default untuk memutar musik dan video mereka. </p> <h4> Cara Menemukan Windows Media Player di Windows 10. </h4> <p> Cara tercepat untuk mengetahui, apakah Windows Media Player terinstal di komputer Anda, adalah dengan mencarinya. Untuk melakukannya: </p> <p> 1. Di kotak pencarian Cortana ketik <strong> Windows Media Player </strong> . <br> 2. Jika Windows Media player terdaftar pada hasil, lalu klik untuk meluncurkan program. (Jika tidak terdaftar, lanjutkan di bawah…) </p> <p><img src=\"images/image_thumb-66-377.png\" alt=\"How to Find Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> TIP: </strong> Untuk menyetel Windows Media Player, sebagai pemutar default untuk video dan musik Anda: </p> <blockquote><p> 1. Navigasikan ke <strong> Mulailah </strong> -&gt; <strong> Pengaturan </strong> -&gt; <strong> Aplikasi </strong> dan pilih <strong> Aplikasi Bawaan </strong> di kiri. <br> 2. Di <strong> Pemutar musik </strong> pilihan, klik <strong> musik alur </strong> lalu pilih <strong> Windows Media Player </strong> . <br> 3. <strong> Pada opsi Pemutar Video </strong> , klik <strong> Film &amp; TV </strong> lalu pilih <strong> Windows Media Player </strong> . </p> <p><img src=\"images/image_thumb-72-358.png\" alt=\"set windows media player default widnows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h4> Cara Menginstal Windows Media Player di Windows 10 Home, Pro. </h4> <p> Jika Windows Media Player tidak terdaftar, Anda dapat menginstalnya, dengan membuka: </p> <p> 1. <strong> Panel kendali </strong> -&gt; <strong> Program dan fitur </strong> . <br> 2. Klik <strong> Mengaktifkan atau menonaktifkan fitur Windows </strong> dari kiri. </p> <p><img src=\"images/image_thumb-68-342.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Pada <strong> Fitur Media </strong> , pilih <strong> Windows Media Player </strong> dan tekan <strong> baik </strong> . * </p> <p> * Catatan: Jika Anda memiliki versi Windows 10 N atau KN, atau Anda tidak dapat menginstal Windows Media Player dari &#39;fitur Windows&#39;, lanjutkan membaca di bawah ini… </p> <p><img src=\"images/image_thumb-69-565.png\" alt=\"How to Install Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cara Mengunduh dan Menginstal Windows Media Player di Windows 10 Versi Home, Pro, N &amp; KN. </h4> <p> Jika Anda tidak dapat menginstal Windows Player dengan menggunakan petunjuk di atas, atau jika Anda memiliki Windows 10 N atau KN, maka Anda dapat mengunduh Windows Media Player untuk Windows 10, dengan mengikuti petunjuk di bawah ini: </p> <p> 1. Unduh <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48231\" target=\"_blank\" rel=\"nofollow noopener\"> Paket Fitur Media untuk versi N dan KN Windows 10 </a> . </p> <p> * Catatan: Unduh <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package.msu </strong> untuk <strong> OS 32-bit, </strong> dan <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package_x64.msu </strong> untuk <strong> OS 64-bit. </strong></p> <p> 2. Jalankan file yang diunduh dan klik <strong> Iya </strong> di layar pertama. </p> <p><img src=\"images/image_thumb-70-480.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Menerima </strong> Perjanjian Lisensi dan kemudian tunggu sampai instalasi selesai. </p> <p><img src=\"images/image_thumb-71-400.png\" alt=\"download windows media player windows 10\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}