{"title":"Cara Mencegah Windows 10 Menginstal Printer Jaringan Secara Otomatis.","content":"<p> Seperti yang mungkin telah Anda perhatikan, Windows 10 secara otomatis menginstal driver untuk printer atau perangkat lain yang terhubung ke jaringan. Namun, meskipun ini adalah fitur yang sangat berguna, ini juga sangat mengganggu, terutama di lingkungan bisnis, di mana Anda mungkin tidak ingin semua printer digunakan oleh semua pengguna jaringan. </p> <p> Tentu saja, jika Anda tidak menginginkan perangkat jaringan dan aplikasi pabrikannya, Anda dapat menghapusnya dari sistem Anda. Tapi, Windows 10 akan secara otomatis menginstalnya kembali. Untuk menghindari hal ini, Anda harus mencegah Windows menginstal secara otomatis perangkat yang terhubung ke jaringan (printer, pemindai, kamera, dll.), dan aplikasi serta ikon bea cukainya dari pabrikan. </p> <h3> Cara MENGHENTIKAN Windows 10 untuk Menginstal Perangkat dan Aplikasi Jaringan Secara Otomatis </h3> <p> 1. Navigasikan ke <strong> Panel kendali </strong> . Untuk melakukannya: </p> <blockquote><p> Sebuah. Ketik &quot;panel kontrol&quot; di kotak pencarian Windows <br> b. Klik <strong> Panel kendali </strong> dari hasil. </p></blockquote> <p><img src=\"images/image_thumb-53-862.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Setel <strong> Dilihat oleh </strong> untuk <strong> Ikon kecil </strong> untuk melihat semua item panel kontrol, lalu klik <strong> Jaringan dan pusat Berbagi. </strong></p> <p><img src=\"images/image_thumb-37-625.png\" alt=\"control panel network and sharing center\" loading=\"lazy\"></p> <p> </p> <p> 3. Pilih <strong> Pengaturan berbagi lanjutan </strong> di kiri <strong> . </strong></p> <p><img src=\"images/image_thumb-38-656.png\" alt=\"Prevent Windows 10 to Install Network Printers Automatically\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Hapus &quot; <strong> Aktifkan pengaturan otomatis perangkat yang terhubung ke jaringan&quot; </strong> dan klik <strong> Simpan perubahan. </strong></p> <p><img src=\"images/image_thumb-39-992.png\" alt=\"Turn Off automatic setup of network connected devices \" loading=\"lazy\"></p> <p> </p> <p><strong> Pilihan: </strong> Jika Anda ingin mencegah Windows 10 mengunduh dan menginstal aplikasi pabrikan dan ikon khusus secara otomatis, untuk perangkat apa pun yang terhubung di PC Anda, maka: </p> <blockquote><p> 1. Navigasikan ke <strong> Panel kendali </strong> -&gt; <strong> Sistem </strong> . <br> 2. Klik <strong> Sistem keamanan </strong> di kiri. <br> 3. Pada tab Perangkat Keras, klik <strong> Pengaturan instalasi perangkat </strong> . </p></blockquote> <p><img src=\"images/image_thumb-40-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. Di &#39;Setelan penginstalan perangkat&#39;,  pilih  &quot; <strong> Tidak (perangkat Anda mungkin tidak berfungsi seperti yang diharapkan)&quot; </strong> dan klik <strong> Simpan perubahan </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-728.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang panduan ini. </p>"}