{"title":"FIX: Laptop Lenovo macet di layar LOGO. (Terpecahkan)","content":"<p> Jika laptop Lenovo Anda macet di layar logo, lanjutkan membaca. Tutorial ini berisi petunjuk langkah demi langkah untuk memperbaiki masalah berikut pada laptop Lenovo: Setelah dihidupkan, laptop tidak bisa boot dan hang di layar splash logo Lenovo. (Masalah tetap ada bahkan ketika Anda mencoba untuk boot dari perangkat USB yang dapat di-boot). </p> <p><img src=\"images/image_thumb-17-276.png\" alt=\"FIX: Lenovo laptop is stuck at LOGO screen.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cara MEMPERBAIKI: Laptop Terjebak di layar LOGO LENOVO. * </h4> <p> * Penting: Sebelum memecahkan masalah komputer, lepaskan semua perangkat periferal untuk memastikan bahwa masalahnya bukan karena perangkat yang terhubung. </p> <p> </p> <h6> Langkah 1. Atur ulang BIOS ke pengaturan default. </h6> <p> Langkah pertama untuk mengatasi laptop freeze pada logo Lenovo, adalah dengan mereset BIOS ke pengaturan default. Untuk melakukannya: </p> <p> 1. <strong> Matikan </strong> Laptop dengan terus menekan tombol power selama 5-7 detik. <br> 2. Sekarang ikuti petunjuk di bawah ini sesuai model Anda, untuk masuk ke BIOS: </p> <ul> <li> Jika sistem Anda adalah <strong> ThinkPad </strong> , tekan tombol Daya lalu segera tekan tombol (Fn+) F2 atau (Fn+) F1 dengan cepat dan berulang kali. </li> <li> Jika sistem Anda adalah <strong> papan ide </strong> laptop, cari dan <strong> tekan </strong> itu <a href=\"https://support.lenovo.com/us/en/solutions/HT104038\" target=\"_blank\" rel=\"nofollow noopener\"> NOVO </a> tombol, yang biasanya terletak di sebelah tombol Daya, lalu pilih <strong> Masuk ke Menu BIOS </strong> . </li> </ul> <p> 3. Pada <strong> keluar </strong> pilih tab <strong> Muat Pengaturan Default </strong> atau &quot;Muat pengaturan yang Dioptimalkan&quot;. <br> 4. <strong> Simpan dan keluar dari BIOS </strong> pengaturan dan lihat apakah Anda dapat boot ke Windows. <br> 5. Jika laptop masih membeku di layar logo Lenovo, lanjutkan ke langkah berikutnya. </p> <p> </p> <h6> Langkah 2. Nonaktifkan Mesin Layanan Lenovo. </h6> <p> Di beberapa laptop Lenovo (dan desktop), sistem hang di &quot;Lenovo Logo&quot; saat boot, ketika &quot;Lenovo Service Engine&quot; diaktifkan. Untuk menonaktifkan layanan: </p> <p> 1. Masuk ke menu BIOS. <br> 2. Di <strong> Keamanan </strong> tab, sorot dan nonaktifkan &quot;Mesin Layanan Lenovo&quot;. </p> <p><img src=\"images/image_thumb-19-834.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Simpan dan keluar </strong> dari menu BIOS. <br> 4. Jika laptop masih stuck di splash screen logo Lenovo, lanjutkan ke langkah berikutnya. </p> <p> </p> <h6> Langkah 3: Lakukan Reset Daya. </h6> <p> Metode selanjutnya untuk menyelesaikan masalah &quot;Logo Lenovo macet&quot;, adalah dengan melakukan reset daya. Untuk melakukannya: </p> <p> 1. <strong> Memutuskan </strong> semua periferal yang terhubung. <br> 2. <strong> Menghapus </strong> itu <strong> Adaptor AC </strong> . <br> 3. <strong> Menghapus </strong> itu <strong> Baterai </strong> . * </p> <p> * Catatan: Jika Anda tidak dapat melepas baterai, biarkan laptop terbuka hingga baterai habis. </p> <p> 4. <strong> tekan </strong> dan <strong> menekan </strong> itu <strong> Kekuasaan </strong> tombol selama setidaknya 50-60 detik dan kemudian lepaskan tombol Daya. <br> 5. Hubungkan hanya Adaptor AC dan nyalakan laptop. <br> 6. Jika Windows berjalan normal, matikan laptop Anda dan sambungkan kembali baterai dan periferal. </p> <h6> Langkah 4. Lepaskan baterai CMOS. </h6> <p> 1. <strong> Menghapus </strong> itu <strong> Baterai </strong> dan <strong> adaptor AC </strong> . <br> 2. Balikkan laptop dan <strong> menghapus </strong> itu <strong> sampul belakang </strong> . * </p> <p> * Catatan: Cara melepas penutup belakang berbeda sesuai model laptop. Jadi, lakukan pencarian Google tentang cara membongkar model laptop Lenovo Anda sendiri. </p> <p> 3. Cari dan <strong> menghapus </strong> itu <strong> baterai CMOS </strong> . * </p> <p> * Catatan: Baterai CMOS memiliki bentuk seperti lingkaran dan Anda dapat melepasnya dengan mencongkelnya perlahan menggunakan obeng pipih kecil. </p> <p> 4. <strong> tekan </strong> dan <strong> menekan </strong> itu <strong> Kekuasaan </strong> tombol selama setidaknya 50-60 detik dan kemudian lepaskan. </p> <p> 5. Connect pertama Adapter AC dan kemudian masukkan kembali baterai CMOS. <br> 5. Nyalakan laptopnya. * </p> <p> * Catatan: Jika masalah berlanjut, lepaskan dan biarkan baterai CMOS dicabut setidaknya selama 30 menit. Kemudian pasang kembali baterai CMOS, sambungkan Adaptor AC dan hidupkan laptop. </p> <p> </p> <h6> Langkah 5. Lepaskan unit DVD. * </h6> <p><strong> * Penting: </strong> Matikan komputer Anda dan lepaskan Adaptor Daya, sebelum menambah atau melepas komponen. </p> <p> Jika Anda memiliki laptop dengan drive DVD, lepaskan dan hidupkan kembali laptop Anda. (Ini terdengar aneh, tetapi dalam beberapa kasus berhasil.) </p> <p> </p> <h6> Langkah 6. Lepaskan dan Pasang Kembali RAM &amp; Hard Drive. </h6> <p> Ketika komputer (desktop atau laptop) membeku di layar LOGO (POST), biasanya berarti ada masalah dengan hard drive (HDD), atau memori (RAM). Jadi, lanjutkan sebagai berikut: </p> <p><strong> * Penting: </strong> Matikan komputer Anda dan lepaskan Adaptor Daya, sebelum menambahkan atau melepas bagian-bagiannya. </p> <p> 1. Lepas dan pasang kembali Modul RAM. <br> 2. Nyalakan laptop dan lihat apakah masalah masih berlanjut. Jika ya, maka… <br> 3. Matikan laptop dan lepaskan (disconnect) harddisk (HDD). <br> 4. Setelah melepas HDD, hidupkan kembali laptop. <br> 5. Jika HDD adalah penyebab masalah, maka splash screen Lenovo LOGO akan hilang dan Anda akan menerima pesan yang mengatakan &quot;Tidak ada perangkat yang dapat di-boot ditemukan&quot; atau semacamnya. Jika ini terjadi :* </p> <blockquote><p> Sebuah. Matikan laptopnya. <br> b. Bersihkan kontak pada hard drive dan soket HDD dengan semprotan pembersih kontak. <br> c. Sambungkan kembali hard drive dan lanjutkan membaca di bawah (6). </p></blockquote> <p> * Catatan: Jika ini tidak terjadi, ini menunjukkan masalah BIOS, atau masalah motherboard, yang hanya dapat diperbaiki oleh teknisi komputer khusus. </p> <p> 6. Nyalakan laptop dan lihat apakah masalahnya telah teratasi. Jika tidak, lanjutkan untuk membuat cadangan file Anda dan kemudian melakukan instalasi bersih Windows, dengan mengikuti langkah-langkah di bawah ini: </p> <blockquote><p> Sebuah. Lepaskan dan sambungkan hard drive ke komputer lain yang berfungsi (misalnya dengan menggunakan USB ke Adaptor Hard Drive SATA). <br> b. Jika Anda dapat membaca konten drive, lanjutkan dan <strong> buat cadangan file Anda </strong> . * </p> <p> * Catatan: Jika hard drive tidak dikenali dari komputer sekunder, maka HDD rusak dan Anda harus menggantinya. </p> <p> c. Setelah mencadangkan file Anda, lanjutkan dan <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> mendiagnosis Hard Drive untuk masalah </a> , dan sesuai dengan hasilnya, ganti HDD (jika rusak), atau (jika OK) lanjutkan dan <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> hapus semua partisi di HDD </a> . </p></blockquote> <p> 7. Setelah membersihkan partisi, pasang kembali HDD ke laptop dan lanjutkan ke <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> bersih instal Windows </a> . </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}