{"title":"FIX: HP Smart Error – Status Printer tidak diketahui (Terpecahkan)","content":"<p> Tutorial ini berisi instruksi untuk menyelesaikan <a href=\"https://www.hpsmart.com/us/en\" target=\"_blank\" rel=\"nofollow noopener\"> HP Pintar </a> kesalahan aplikasi &quot;Status Printer tidak diketahui&quot; pada OS Windows 10. &quot;Status Printer tidak diketahui&quot; pada aplikasi HP SMART, mungkin muncul karena alasan yang tidak diketahui dan mencegah pengguna untuk menggunakan fungsi Pindai atau Cetak pada printer. </p> <p> Masalah secara detail: Pada komputer Windows 10 dengan printer HP terinstal, kesalahan &quot;Status Printer tidak diketahui&quot; muncul di aplikasi HP Smart, meskipun printer mencetak tanpa masalah dari Web atau aplikasi lain. Masalah utama dengan kesalahan ini adalah pengguna tidak dapat menggunakan opsi PINDAI dalam aplikasi HP Smart untuk memindai dokumen. </p> <p> </p> <p> </p> <p><img src=\"images/image_thumb-23-787.png\" alt=\"FIX: HP Smart \" printer status unknown loading=\"lazy\"></p> <h4> MEMPERBAIKI: &quot;Status Printer tidak diketahui&quot; pada Aplikasi HP Smart. (Windows 10). </h4> <p> 1. Dari menu Mulai <img src=\"images/image_thumb2_thumb_thumb-697.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> klik Pengaturan <img src=\"images/image_thumb-66-822.png\" alt=\"image\" loading=\"lazy\"> lalu buka <strong> Aplikasi </strong> . </p> <p><img src=\"images/image_thumb-25-257.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Klik pada <strong> Aplikasi HP Pintar </strong> lalu klik <strong> Opsi lanjutan </strong> . </p> <p><img src=\"images/image_thumb-26-912.png\" alt=\"FIX: Printer Status unknown on HP Smart app\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Klik <strong> Setel ulang </strong> tombol. </p> <p><img src=\"images/image_thumb-27-494.png\" alt=\"Fix Printer Status Unknow on HP Smart app\" loading=\"lazy\"></p> <p> 4. Ketika Reset selesai, tutup semua jendela dan buka <strong> HP Pintar </strong> aplikasi. <br> 5. Biasanya kesalahan &quot;Status Printer tidak diketahui&quot; harus diselesaikan. Cukup klik <strong> Mendirikan </strong> tombol untuk mengaktifkan semua fitur HP Smart dan selesai! * </p> <p><img src=\"images/image_thumb-28-849.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Catatan: Jika kesalahan HP Smart &quot;Status Printer tidak diketahui&quot; tetap ada, coba yang berikut ini: </p> <blockquote><p> 1. <strong> Menutup </strong> komputer. <br> 2. <strong> Memutuskan </strong> itu <strong> kabel daya dari printer </strong> selama 1 menit. <br> 3. Setelah 1 menit, <strong> nyalakan </strong> anda <strong> komputer </strong> . <br> 4. Setelah boot ke Windows 10, <strong> sambungkan kembali kabel daya printer </strong> dan periksa apakah kesalahan &quot;Status Printer tidak diketahui&quot; pada aplikasi HP Smart telah teratasi. Jika kesalahan berlanjut, lanjutkan untuk menghapus dan menginstal ulang printer dan perangkat lunak printer pada PC Anda. </p></blockquote> <p> Itu saja! Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}