{"title":"FIX: VIDEO DXGKRNL FATAL ERROR di Windows 10 (Dipecahkan)","content":"<p> Jika Anda menghadapi kesalahan layar biru &quot;VIDEO DXGKRNL FATAL ERROR&quot; di Windows 10, ikuti petunjuk di bawah ini untuk memperbaiki masalah. </p> <p> Kesalahan Windows 10 BSOD &quot; <em> PC Anda mengalami masalah dan perlu dimulai ulang. Kami hanya mengumpulkan beberapa info kesalahan, dan kemudian kami akan memulai ulang untuk Anda. Jika Anda ingin tahu lebih banyak, Anda dapat mencari kesalahan ini nanti secara online: VIDEO DXGKRNL FATAL ERROR&quot;, </em> biasanya menunjukkan masalah dengan driver Video. </p> <p><img src=\"images/image_thumb-7-129.png\" alt=\"FIX: VIDEO DXGKRNL FATAL ERROR in Windows 10\" loading=\"lazy\"></p> <p> Tutorial ini berisi petunjuk langkah demi langkah untuk mengatasi kesalahan layar biru &quot;VIDEO DXGKRNL FATAL ERROR&quot; di Windows 10. </p> <h2> Cara MEMPERBAIKI: Windows 10 VIDEO DXGKRNL FATAL ERROR. </h2> <h3> Langkah 1. Perbaiki VIDEO DXGKRNL FATAL ERROR dengan Menghapus/Menginstal Ulang Driver Video. </h3> <p> 1. Buka <strong> Pengaturan perangkat </strong> . Untuk melakukannya: </p> <ol> <li> <ol> <li> Tekan Windows <img src=\"images/image_thumb8_thumb_thumb-153.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. </li> <li> Di kotak &quot;Buka&quot;, ketik: <strong> devmgmt.msc </strong> &amp; klik <strong> baik </strong> . </li> </ol> </li> </ol> <blockquote> <p><img src=\"images/image_thumb-5-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p></blockquote> <p> 2. <strong> Memperluas </strong> itu <strong> Display adapter. <br> </strong> 3. <strong> Klik kanan </strong> pada adaptor tampilan yang terpasang dan pilih <strong> Copot pemasangan perangkat. </strong></p> <p><img src=\"images/image_thumb-46-240.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. Di jendela berikutnya, jika Anda memiliki opsi: &quot; <strong> Hapus perangkat lunak driver untuk perangkat ini </strong> &quot;, pilih dan kemudian klik <strong> baik </strong> untuk menghapus driver yang diinstal dari komputer. </p> <p> 5. Setelah uninstall, <strong> mengulang kembali </strong> komputer Anda dan navigasikan ke <strong> Pengaturan perangkat </strong> lagi. <br> 6. Klik kanan pada Computer Name (di atas) dan pilih <strong> Pindai perubahan perangkat keras. </strong></p> <p><img src=\"images/image_thumb-8-911.png\" alt=\"Scan for hardware changes\" loading=\"lazy\"></p> <p> </p> <p> 7. Biarkan Windows mendeteksi dan menginstal driver tampilan dan kemudian <strong> mengulang kembali </strong> komputer Anda lagi dan periksa apakah &quot;VIDEO DXGKRNL FATAL ERROR&quot; tetap ada. * </p> <p> * Catatan: Jika Windows tidak dapat menginstal driver tampilan secara otomatis atau jika Anda masih menghadapi kesalahan layar biru, lanjutkan ke langkah berikutnya. </p> <p> </p> <h3><br clear=\"all\"> Langkah 2. Instal Ulang Driver Video dari Situs Produsen. </h3> <p> 1. Navigasikan ke <strong> Pengaturan perangkat </strong> dan <strong> hapus instalan </strong> adaptor tampilan yang terpasang. * </p> <p> * Catatan: Jika Anda memiliki laptop dengan dua (2) adaptor layar, hapus instalan keduanya. </p> <p> 2. Kunjungi situs dukungan pabrikan komputer (atau kartu grafis) Anda dan unduh driver terbaru untuk kartu grafis Anda. </p> <ul> <li> <ul> <li> Untuk <strong> NVIDIA </strong> berbasis GPU, navigasikan ke <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Halaman Pencarian Driver Lanjutan NVIDIA </a> . </li> <li> Untuk <strong> AMD </strong> berbasis GPU, navigasikan ke <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Pusat Unduhan Driver AMD (ATI). </a></li> <li> Untuk <strong> Intel </strong> berbasis GPU, navigasikan ke <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Pusat Unduh Grafik Intel. </a></li> </ul> </li> </ul> <p> 3. Lanjutkan dan instal driver yang diunduh. * </p> <p><strong> * Catatan penting: </strong> Jika Anda memiliki laptop dengan dua (2) adaptor layar, lanjutkan terlebih dahulu untuk menginstal driver untuk adaptor AMD atau NVIDIA dan mulai ulang laptop Anda. Setelah restart, lanjutkan dan instal driver untuk adaptor tampilan INTEL dan kemudian restart laptop Anda lagi. </p> <p> 4. Setelah instalasi, <strong> mengulang kembali </strong> PC Anda dan periksa apakah VIDEO DXGKRNL FATAL ERROR sudah terpecahkan. Jika tidak, lanjutkan ke langkah berikutnya. </p> <p> </p> <h3><br clear=\"all\"> Langkah 3. Perbaiki DirectX untuk memperbaiki VIDEO DXGKRNL FATAL ERROR. </h3> <p> VIDEO DXGKRNL FATAL ERROR, menunjukkan masalah pada driver DirectX Microsoft. Jadi, lanjutkan perbaikan DirectX. </p> <p> 1. Unduh <a href=\"https://www.microsoft.com/en-us/download/details.aspx?displaylang=en&id=35\" target=\"_blank\" rel=\"nofollow noopener\"> Penginstal Web Runtime Pengguna Akhir DirectX </a> . <br> 2. Jalankan file yang diunduh (dxwebsetup.exe) dan ikuti petunjuk di layar untuk menginstal komponen opsional DirectX Runtime. </p> <p><img src=\"images/image_thumb-9-847.png\" alt=\"Install DirectX Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Ketika instalasi selesai <strong> mengulang kembali </strong> komputer Anda. </p> <p> 4. Setelah restart, pergi ke <strong> Mulailah <img src=\"images/image_thumb-55-571.png\" alt=\"image\" loading=\"lazy\"> -&gt; Pengaturan </strong> -&gt; <strong> Pembaruan dan Keamanan -&gt; </strong> dan klik <strong> Periksa Pembaruan. </strong></p> <p><img src=\"images/image_thumb-76-281.png\" alt=\"Windows 10 - Check For Updates \" loading=\"lazy\"></p> <p> 5. Setelah instalasi pembaruan, restart PC Anda lagi dan periksa apakah kesalahan BSOD telah teratasi. Jika tidak, lanjutkan ke langkah berikutnya. </p> <p> </p> <h3><br clear=\"all\"> Langkah 4. Perbaiki File Sistem Windows 10. </h3> <p> 1. Buka <strong> Command Prompt sebagai Administrator </strong> . <br> 2. Di command prompt berikan perintah berikut dan tekan <strong> Memasukkan: </strong></p> <ul> <li><strong> DISM.exe /Online /Cleanup-image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-176.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Ketika operasi DISM selesai, ketik perintah berikut dan tekan <strong> Memasukkan </strong> : </p> <ul> <li><strong> sfc /scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-464.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Sekarang tunggu hingga Pemeriksa File Sistem memperbaiki File Sistem Windows. <br> 5. Setelah ini selesai, <strong> mengulang kembali </strong> komputer Anda dan periksa apakah kesalahan terus berlanjut. </p> <p> </p> <h3><br clear=\"all\"> Langkah 5. Analisis file log Minidump (BSOD). </h3> <p> Saat Windows mogok dengan layar biru, menyimpan detail layar BSoD ke file kecil, yang disebut &quot; <strong> MiniDump </strong> &quot;. Analisis dari <strong> Minidump </strong> file(s) dapat membantu Anda untuk memecahkan masalah dan menyelesaikan masalah VIDEO DXGKRNL FATAL ERROR layar biru. Untuk menyelesaikan tugas ini, ikuti petunjuk dalam artikel ini: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Menganalisis File MiniDump dengan BlueScreenView </a> . </p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}