{"title":"FIX: Opsi Instal VMware Tools berwarna Abu-abu. (Terpecahkan)","content":"<p> Jika Anda tidak dapat menginstal Alat VMware pada operasi tamu karena opsi &quot;Instal VMware Tools&quot; berwarna abu-abu, lanjutkan membaca di bawah. VMware Tools adalah kumpulan layanan dan modul gratis yang memungkinkan beberapa fitur di mesin virtual tamu seperti kinerja grafis yang lebih cepat, kinerja mouse yang ditingkatkan, dan yang paling signifikan: kemampuan untuk menyalin dan menempel antara mesin Host dan Guest. Jadi, meskipun sistem operasi tamu dapat berjalan tanpa VMware Tools, alat VMware harus diinstal jika Anda ingin mengaktifkan fitur VMware tambahan. </p> <p> Untuk cara biasa menginstal VMware Tools, adalah memulai mesin tamu dan kemudian dari menu &quot;Player&quot; pilih <strong> Mengelola </strong> &gt; <strong> Instal Alat VMware </strong> . Namun, jika Anda menghubungkan drive CD/DVD virtual mesin virtual ke file gambar ISO saat Anda menginstal sistem operasi, opsi &quot;Instal VMware Tools&quot; akan berwarna abu-abu. </p> <p><img src=\"images/image_thumb-45-164.png\" alt=\"FIX VMware Tools option is Grayed Out\" loading=\"lazy\"></p> <p> </p> <p> Tutorial ini berisi instruksi untuk memperbaiki masalah berikut di VMware Workstation Player. Opsi &quot;Instal VMware Tools&quot; berwarna abu-abu di mesin Tamu. </p> <h4> Cara Install VMware Tools jika opsi &#39;Install VMware Tools&#39; berwarna abu-abu. </h4> <p> </p> <p> 1. Matikan Mesin Virtual. <br> 2. Klik kanan pada mesin virtual dan pilih <strong> Pengaturan </strong> . </p> <p><img src=\"images/image_thumb-39-377.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Pilih <strong> CD/DVD </strong> drive dan kemudian klik <strong> Menghapus </strong> . </p> <p><img src=\"images/image_thumb-43-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Kemudian pilih <strong> disket </strong> mengemudi, klik <strong> Menghapus </strong> lalu klik <strong> baik </strong> untuk menutup opsi pengaturan. </p> <p><img src=\"images/image_thumb-44-469.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Mulailah </strong> Mesin Virtual. <br> 6. Dari menu &#39;Pemain&#39;, pilih <strong> Mengelola </strong> dan klik <strong> Instal Alat VMware. </strong></p> <p><img src=\"images/image_thumb-42-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}