{"title":"FIX: Viber, Yahoo, dan Aplikasi lainnya Crash di Perangkat Android – Maret 2021 (Terpecahkan).","content":"<p> Beberapa pengguna dalam beberapa jam terakhir telah melaporkan bahwa banyak aplikasi Android yang mogok (22 Maret 2021). Secara khusus, Gmail, Viber, Google Chrome, dan aplikasi penting lainnya tidak langsung terbuka dan tertutup setelah dibuka. Masalahnya mempengaruhi banyak perangkat Android dan terutama perangkat Samsung. Jika Anda menghadapi masalah serupa, lanjutkan membaca di bawah ini untuk mempelajari cara memperbaikinya. </p> <p> Pembaruan (23 Maret 2021): Google dengan cepat mengidentifikasi masalah dan menemukan bahwa <strong> Tampilan Web Android </strong> app adalah pelakunya dan memperbaikinya dengan mendorong pembaruan untuk itu dan aplikasi Chrome lainnya. </p> <h4> Cara MEMPERBAIKI: Android Google Apps, Viber, dll. Masalah kerusakan (22 Maret 2021). </h4> <p> 1. Buka Android <strong> Pengaturan. </strong></p> <p> 2. Ketuk <strong> Kelola Aplikasi </strong> (atau <strong> Aplikasi &amp; Pemberitahuan </strong> atau <strong> Aplikasi </strong> pada beberapa perangkat Android). </p> <p><img src=\"images/image_thumb-27-815.png\" alt=\"FIX: Android Apps are Crashing on Samsung or other Devices.\" loading=\"lazy\"></p> <p> </p> <p> 3. Klik menu dengan <strong> tiga titik </strong><img src=\"images/image_thumb-28-382.png\" alt=\"image\" loading=\"lazy\"> di sudut kanan atas dan pilih <strong> Tampilkan semua aplikasi </strong> (atau <strong> Tampilkan aplikasi sistem </strong> ). </p> <p><img src=\"images/image_thumb-29-272.png\" alt=\"FIX Android GMAIL or Viber Crash \" loading=\"lazy\"></p> <p> </p> <p> 3. Temukan <strong> Tampilan Web Sistem Android </strong> aplikasi (atau <strong> Tampilan Web Android </strong> ) dalam daftar dan buka. </p> <p><img src=\"images/image_thumb-30-842.png\" alt=\"FIX GMAIL Chrome or Viber Crash on Android - March 2021\" loading=\"lazy\"></p> <p> </p> <p> 4. Klik <strong> Hapus Pembaruan. </strong></p> <p><img src=\"images/image_thumb-31-471.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Ketuk <strong> baik </strong> pada pesan peringatan. </p> <p> 6. <strong> Mengulang kembali </strong> perangkat Anda dan masalahnya akan hilang. </p> <p> Itu saja! Metode mana yang berhasil untuk Anda? Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}