{"title":"Formulir Kontak 7 Tidak Berfungsi: Terjadi kesalahan saat mengirim pesan Anda. Silakan coba lagi nanti. (Terpecahkan)","content":"<p> Jika formulir Kontak 7 di situs WordPress Anda tidak berfungsi, lanjutkan membaca di bawah ini untuk memperbaiki masalah. Formulir Kontak 7, adalah salah satu plugin WordPress gratis paling terkenal, yang membantu Anda membuat, mengelola, dan menyesuaikan formulir kontak di situs WordPress Anda. Baru-baru ini, saya menemukan bahwa plugin &quot;Formulir Kontak 7&quot; di situs saya (dan di banyak situs lainnya), telah berhenti bekerja dengan kesalahan &quot;Ada kesalahan untuk mengirim pesan Anda. Silakan coba lagi nanti&quot;, yang dikelilingi oleh persegi panjang oranye , setelah mengirimkan formulir. </p> <p><img src=\"images/image_thumb-14-729.png\" alt=\"Contact Form 7: There was an error to send your message. Please try again later\" loading=\"lazy\"></p> <p> Tutorial ini berisi instruksi untuk memperbaiki kesalahan &quot;Ada kesalahan untuk mengirim pesan Anda. Silakan coba lagi nanti&quot; di dalam kotak oranye, setelah mengirimkan formulir kontak. </p> <h4> Cara MEMPERBAIKI: Formulir Kontak Tidak Berfungsi dengan kesalahan &quot;Ada kesalahan untuk mengirim pesan Anda&quot;. </h4> <p> Jika Formulir Kontak 7 di WordPress Anda, situs tidak berfungsi lagi, ikuti langkah-langkah di bawah ini: </p> <h6> Langkah 1. Validasi Formulir Kontak 7. </h6> <p> 1. Arahkan ke dasbor admin WordPress Anda dan klik <strong> Kontak </strong> &gt; <strong> Formulir Kontak. </strong><br> 2. Di bagian atas halaman, periksa apakah ada pesan kesalahan yang mengatakan &quot;Kesalahan konfigurasi menyebabkan kegagalan pengiriman surat atau masalah lain. Validasi formulir kontak Anda sekarang&quot;. <br> 3. Jika Anda melihat pesan itu,* maka <strong> klik </strong> itu <strong> Validasi Formulir Kontak 7 Konfigurasi </strong> tautan. </p> <p> * Catatan: Jika Anda tidak melihat pesan itu, lewati ke langkah 2. </p> <p><img src=\"images/image_thumb-813.png\" alt=\"Validate Contact Form 7 Configuration \" loading=\"lazy\"></p> <p> 4. Pada layar berikutnya, klik <strong> Validasi 2 formulir kontak sekarang </strong> tombol. </p> <p><img src=\"images/image_thumb-1-270.png\" alt=\"Validate Contact Form\" loading=\"lazy\"></p> <p> 5. Ketika validasi konfigurasi selesai, Anda akan menerima bahwa &quot;Tidak ditemukan formulir kontak yang tidak valid&quot;. </p> <p><img src=\"images/image_thumb-17-318.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Uji formulir kontak Anda dan jika kesalahan berlanjut, lanjutkan ke langkah-2 di bawah ini. </p> <h6> Langkah 2. Siapkan Formulir Kontak 7 dengan kunci reCAPTCHA V3. </h6> <p> Selama penelitian saya, saya menemukan bahwa versi terbaru Formulir Kontak 7 (v5.1 dan yang lebih baru) menggunakan reCAPTCHA v3 API untuk melindungi Anda dari spam dan jenis penyalahgunaan otomatis lainnya. Jadi, berdasarkan ini, Anda memiliki dua opsi berikut untuk mengatasi kesalahan formulir kontak &quot;Terjadi kesalahan saat mengirim pesan Anda. Silakan coba lagi nanti.&quot;: * </p> <ul> <li> <p><strong> Pilihan 1. </strong> Untuk menyiapkan Formulir Kontak 7 dengan kunci reCAPTCHA V3. </p> </li> <li> <p><strong> Pilihan 2. </strong> Untuk menggunakan <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"noopener noreferrer\"> Formulir Kontak 7 – reCaptcha v2 </a> plugin untuk formulir kontak Anda. </p> </li> </ul> <p> * Catatan: Pada artikel ini, saya akan menunjukkan kepada Anda, cara mengatur Formulir Kontak 7 dengan kunci reCAPTCHA V3. Jika Anda tidak ingin menggunakan proteksi reCAPTCHA V3, hapus instalan plugin &#39;Contact Form 7&#39; dan instal <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"nofollow noopener\"> Formulir Kontak 7 – reCaptcha v2 </a> pengaya. </p> <p><strong> Untuk Mengatur Formulir Kontak 7 dengan kunci reCAPTCHA V3: </strong></p> <p> 1. Masuk ke Akun Google Anda, Anda biasa mengatur reCAPTCHA di situs Anda dan menavigasi ke <a href=\"https://www.google.com/recaptcha/admin\" target=\"_blank\" rel=\"nofollow noopener\"> Konsol admin reCAPTCHA Google. </a></p> <p> 2. Klik Pengaturan <img src=\"images/image_thumb-2-494.png\" alt=\"image\" loading=\"lazy\"> ikon. </p> <p><img src=\"images/image_thumb-3-786.png\" alt=\"Setup Contact Form 7 with recaptcha v3\" loading=\"lazy\"></p> <p> 3. Klik <strong> Tempat sampah </strong> ikon <img src=\"images/image_thumb-4-167.png\" alt=\"image\" loading=\"lazy\"> dan <strong> menghapus </strong> itu <strong> kunci reCAPTCHA V2. </strong></p> <p><img src=\"images/image_thumb-5-757.png\" alt=\"Recaptcha v3\" loading=\"lazy\"></p> <p> 4. Klik ikon Plus <img src=\"images/image_thumb-6-851.png\" alt=\"image\" loading=\"lazy\"> untuk mendaftarkan kembali situs Anda. </p> <p><img src=\"images/image_thumb-7-337.png\" alt=\"Register Site with Recaptcha\" loading=\"lazy\"></p> <p> 5. Pada layar &#39;Daftarkan situs baru&#39;: </p> <blockquote> <p> Sebuah. <strong> Ketik nama </strong> untuk mengidentifikasi situs Anda di masa mendatang, <br> b. <strong> Memilih </strong> itu <strong> reCAPTCHA v3 </strong> Tipe. <br> c. <strong> Tipe </strong> itu <strong> nama domain </strong> dari situs Anda. <br> d. <strong> Menerima </strong> itu <strong> Persyaratan Layanan reCAPTCHA. </strong><br> e. Klik <strong> KIRIMKAN. </strong></p> </blockquote> <p><img src=\"images/image_thumb-8-227.png\" alt=\"Register Site with Recaptcha V3\" loading=\"lazy\"></p> <p> 6. Setelah pendaftaran, Anda melihat layar dengan <strong> KUNCI SITUS </strong> dan <strong> KUNCI RAHASIA </strong> . <br> 7. Klik <strong> SALIN KUNCI SITUS </strong> dan <strong> JANGAN DITUTUP </strong> jendela ini. </p> <p><img src=\"images/image_thumb-9-995.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. Di jendela browser lain, navigasikan ke dasbor admin WordPress Anda dan klik <strong> Kontak </strong> &gt; <strong> Integrasi. </strong></p> <p> 9. Klik <strong> Integrasi Pengaturan </strong> tombol. </p> <p><img src=\"images/image_thumb-10-834.png\" alt=\"Integrate Recaptcha in Contact Form 7\" loading=\"lazy\"></p> <p> 10. Klik tombol <strong> Hapus kunci </strong> untuk menghapus kunci reCAPTCHA V2. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"image\" loading=\"lazy\"></p> <p> 11. <strong> Tempel </strong> yang baru <strong> Kunci Situs </strong> lalu Copy &amp; Paste yang baru <strong> Kunci rahasia </strong> dari konsol admin reCAPTCHA, dan klik <strong> Simpan perubahan. </strong></p> <p><img src=\"images/image_thumb-12-147.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. <strong> Menghapus </strong> itu <strong> Tembolok </strong> di situs Anda. <br> 13. Buka jendela browser baru dan uji formulir kontak Anda. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}