{"title":"MEMPERBAIKI: Menjalankan Skrip Dinonaktifkan pada Sistem ini di Windows 10 (Dipecahkan)","content":"<p> Jika Anda mencoba menjalankan skrip di Windows 10 PowerShell dan Anda menerima pesan kesalahan &quot;Tidak dapat dimuat karena menjalankan skrip dinonaktifkan pada sistem ini&quot; lanjutkan membaca di bawah untuk memperbaiki masalah. </p> <p><img src=\"images/image_thumb-8-134.png\" alt=\"FIX: script cannot be loaded because is disabled on Windows 10\" loading=\"lazy\"></p> <p> </p> <h2> Cara MEMPERBAIKI: Tidak Dapat Menjalankan Skrip PowerShell karena Kebijakan Keamanan Mencegah skrip berjalan di Windows 10. </h2> <p> Kesalahan PowerShell &quot;%ScriptName%.ps1 tidak dapat dimuat karena dinonaktifkan pada sistem ini&quot;, muncul karena kebijakan keamanan yang mencegah skrip untuk dijalankan. Untuk menghapus batasan dan mengaktifkan skrip yang berjalan di Windows 10, lakukan sebagai berikut: </p> <p> 1. Buka <strong> PowerShell sebagai Administrator </strong> . Untuk melakukannya: </p> <blockquote><p> 1. Tekan tombol <strong> jendela <img src=\"images/image_thumb-97-958.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> kunci untuk membuka kotak perintah &#39;Jalankan&#39; <strong><br> </strong> 2. Ketik <strong> powershell </strong> lalu tekan <strong> CTRL </strong> + <strong> BERGESER </strong> + <strong> MEMASUKKAN. </strong></p></blockquote> <p><img src=\"images/image_thumb-41-395.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Di PowerShell salin/tempel perintah di bawah ini dan tekan <strong> Memasukkan </strong> : </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Tidak Terbatas </li> </ul> <p> 3. Tekan <strong> kamu </strong> dan pukul <strong> Memasukkan </strong> pada pesan peringatan kebijakan eksekusi untuk menerima perubahan.. </p> <p><img src=\"images/image_thumb-9-581.png\" alt=\"Enable Running Scripts on Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Setelah perubahan kebijakan selesai, <strong> Menutup </strong> jendela PowerShell. </p> <p> 5. Sekarang, jalankan skrip yang memberi Anda kesalahan &quot;Scripts is Disabled&quot; dengan <strong> admin </strong> hak istimewa. Kesalahan harus hilang sekarang. * </p> <blockquote><p> * Catatan: Jika Anda masih menerima kesalahan &quot;Script dinonaktifkan pada sistem ini&quot;, berikan salah satu perintah berikut dan coba lagi untuk menjalankan skrip Anda: </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy RemoteSigned </li> <li> set-executionpolicy ditandatangani jauh </li> </ul> </blockquote> <p> 6. Terakhir, kembalikan ke pengaturan kebijakan eksekusi PowerShell sebelumnya (pembatasan), dengan menjalankan perintah ini di PowerShell (Admin): * </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Dibatasi </li> </ul> <p> * Catatan: Setelah menjalankan perintah di atas, Anda akan menerima pesan peringatan yang menjelaskan risiko keamanan dari perubahan kebijakan eksekusi. tekan <strong> kamu </strong> , lalu tekan <strong> Memasukkan </strong> untuk menerima perubahan dan kembali ke pengaturan kebijakan Anda sebelumnya. </p> <p><img src=\"images/image_thumb-10-246.png\" alt=\"Disable running scripts windows 10\" loading=\"lazy\"></p> <p> 7. Tutup jendela PowerShell dan selesai! </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}