{"title":"MEMPERBAIKI: Tidak dapat menghentikan proses. Operasi tidak dapat diselesaikan, Akses ditolak.","content":"<p> Jika Anda tidak dapat menghentikan proses atau layanan di Windows, karena Anda mendapatkan pesan kesalahan &quot;Tidak dapat menghentikan proses. Operasi tidak dapat diselesaikan, Akses ditolak&quot;, lanjutkan membaca di bawah, untuk mempelajari cara memperbaiki masalah. </p> <p><img src=\"images/image_thumb-10-874.png\" alt=\"Unable to terminate process. Access is denied\" loading=\"lazy\"></p> <p> Cara biasa untuk menghentikan proses yang sedang berjalan di Windows adalah membuka Task Manager, klik kanan nama proses, dan pilih &#39;End Task&#39;. Namun, seperti yang Anda ketahui, terkadang proses tidak dapat dihentikan karena Anda menerima pesan &quot;Tidak dapat menghentikan proses. Akses ditolak&quot;. </p> <p> Demikian pula, Anda mungkin mengalami masalah serupa jika Anda ingin menghentikan layanan dan Anda tidak bisa, karena opsi &quot;Stop&quot; berwarna abu-abu, atau karena Anda menerima pesan kesalahan &quot;Tidak dapat menghentikan layanan. Akses ditolak&quot; saat mencoba menghentikan layanan. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"Unable to Terminate Service\" loading=\"lazy\"></p> <p> Dalam tutorial ini Anda akan mempelajari cara menghentikan layanan atau proses apa pun yang tidak dapat Anda hentikan dengan menggunakan cara biasa. </p> <h4> Cara Memaksa Menghentikan Layanan atau Program apa pun dari PowerShell di OS Windows 10/8/7. </h4> <ul> <li><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Memaksa Menutup Aplikasi apa pun dari PowerShell. </a></li> <li><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Memaksa Menutup Layanan apa pun dari PowerShell. </a></li> </ul> <h6></h6> <h6> Bagian 1. Cara Mengakhiri Aplikasi dari PowerShell. </h6> <p> 1. Buka PowerShell sebagai Administrator. </p> <p> 2. Di PowerShell, ketik perintah berikut untuk mendapatkan ID proses (PID). </p> <ul> <li><strong> Daftar tugas </strong></li> </ul> <p><img src=\"images/image_thumb-12-275.png\" alt=\"Terminate process from powershell\" loading=\"lazy\"></p> <p> </p> <p> 3. Catat nama aplikasi yang ingin Anda hapus, lalu ketik perintah berikut untuk menutup semua instance aplikasi. * </p> <ul> <li> Stop-Process -Nama &quot;Application_Name&quot; </li> </ul> <p> * Catatan: Pada Application_Name, ketikkan nama aplikasi tanpa ekstensi .exe. Misalnya, jika Anda ingin menutup paksa aplikasi &quot;chrome.exe&quot;, ketik: </p> <ul> <li><em> Stop-Process -Nama &quot;chrome&quot; </em></li> </ul> <p><img src=\"images/image_thumb-16-974.png\" alt=\"Stop Program PowerShell\" loading=\"lazy\"></p> <p> </p> <p><strong> TIP: </strong> Jika Anda ingin menghentikan satu contoh program, ketik perintah berikut: </p> <ul> <li> Berhenti-Proses -ID PID </li> </ul> <p> * Catatan: Di PID, ketik nomor unik instance program. </p> <p> </p> <h6> Bagian 2. Cara Mengakhiri Layanan dari PowerShell. </h6> <p> 1. Buka pengelola tugas dan dari <strong> Jasa </strong> tab, perhatikan <strong> PID </strong> layanan yang ingin Anda hentikan. </p> <p><em> misalnya Dalam contoh ini kita akan memaksa menghentikan layanan &quot;AdobeARMservice&quot; dengan PID <strong> 1640 </strong> . </em></p> <p><img src=\"images/image_thumb-14-150.png\" alt=\"Force Stop Service PowerShell\" loading=\"lazy\"></p> <p> </p> <p> 2. Lalu, jalankan <strong> PowerShell sebagai administrator </strong> dan ketik perintah ini: </p> <ul> <li> bunuh -id PID </li> </ul> <p> * Catatan: Saat PID ketik PID yang Anda perhatikan di Task Manager. Dalam contoh ini perintahnya adalah: </p> <ul> <li><em> bunuh -id 1640 </em></li> </ul> <p><img src=\"images/image_thumb-15-147.png\" alt=\"Kill Running Service from PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}