{"title":"MEMPERBAIKI: Atur Ulang Masa Tenggang 120 Hari di Server RDS 2016/2012.","content":"<p> Jika Anda telah menginstal RDS Server 2016 untuk tujuan pengujian dan masa tenggang lisensi RDS telah kedaluwarsa, lanjutkan membaca di bawah ini untuk mempelajari cara mengatur ulang masa tenggang 120 hari. Seperti yang Anda ketahui ketika Anda menginstal RDS Server 2016 Anda memiliki 120 hari untuk menginstal lisensi akses klien RD (RD CAL), jika tidak, pengguna tidak akan lagi dapat membuat sesi RDP di server RD Session Host, dengan kesalahan &quot;Remote sesi desktop terputus karena tidak ada server Lisensi Desktop Jarak Jauh yang tersedia untuk memberikan lisensi&quot;. </p> <p><img src=\"images/image_thumb-32-368.png\" alt=\"Reset 120 Days Grace Period on RDS Server 2012/2016\" loading=\"lazy\"></p> <p> </p> <h4> Cara Reset Masa Tenggang Lisensi RDS di Server 2012 atau 2016. * </h4> <p><strong> * Penting: </strong> Terapkan petunjuk di bawah ini, hanya jika Anda menggunakan RDS Server 2016 di lingkungan pengujian. Jika Anda ingin menggunakan Server RDS di lingkungan produksi, lanjutkan dan beli RD CAL. </p> <p> Untuk memperpanjang Masa Tenggang 120 hari di Server Lisensi RDS: </p> <p> 1. Buka Registry Editor dan navigasikan pada kunci berikut: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\\RCM\\GracePeriod </li> </ul> <p> 2. Klik kanan pada tombol &#39;GracePeriod&#39; dan pilih <strong> Izin. </strong></p> <p><img src=\"images/image_thumb-33-473.png\" alt=\"Reset Grace Period RDS 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Kemudian klik <strong> Maju </strong> . </p> <p><img src=\"images/image_thumb-34-585.png\" alt=\"Reset RDS Grace Period\" loading=\"lazy\"></p> <p> </p> <p> 4. Pilih <strong> Administrator </strong> objek dan klik <strong> Sunting </strong> . </p> <p><img src=\"images/image_thumb-18-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Ubah izin menjadi <strong> Kontrol penuh </strong> dan klik <strong> BAIK. </strong></p> <p><img src=\"images/image_thumb-19-737.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Klik kanan pada nilai &quot;L$RTMTIMEBOMB...&quot; dan pilih <strong> Menghapus </strong> . </p> <p><img src=\"images/image_thumb-35-208.png\" alt=\"Reset RDS Licensing Grace Pariod\" loading=\"lazy\"></p> <p> </p> <p> 7. Tutup Registry Editor dan restart RDS Server. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}