{"title":"MEMPERBAIKI: KORUPSI MEMORI KOLAM KHUSUS TERDETEKSI yang disebabkan oleh ntoskrnl.exe BSOD 0x000000c1 (Terpecahkan)","content":"<p> Pada komputer berbasis Windows 10, kesalahan BSOD berikut muncul: &quot;SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION, disebabkan oleh file ntoskrnl.exe dengan kode kesalahan 0x000000c1. Kesalahan pemeriksaan bug &quot;0x000000c1 – SPECIAL POOL DETECTED MEMORY CORRUPTION&quot; biasanya disebabkan oleh perangkat lunak yang diinstal atau perangkat driver dan bukan karena masalah perangkat keras. </p> <p><strong> KORUPSI MEMORI TERDETEKSI KOLAM KHUSUS, Kode Periksa Bug 0x000000c1 Kesalahan BSOD dalam Detail: </strong><br> &quot; <em> Masalah telah terdeteksi dan Windows telah dimatikan untuk mencegah kerusakan <br> ke komputermu. <br> </em><em> Masalahnya tampaknya disebabkan oleh file berikut: ntoskrnl.exe <br> SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION <br> ….. <br> *** BERHENTI: 0x000000c1 (0xfffff30dd554cfc0, 0xfffff30dd554c22c, 0x0000000000034038, <br> 0x0000000000000032) </em></p> <p><em> *** ntoskrnl.exe – Alamat 0xfffff803c544aca0 dasar di 0xfffff803c52a2000 DateStamp <br> 0x5b63c7b5&quot; </em></p> <p><img src=\"images/image_thumb-1-562.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Tutorial ini berisi petunjuk rinci untuk menyelesaikan kesalahan layar biru 0x000000c1 – KORUPSI MEMORI TERDETEKSI POOL KHUSUS yang disebabkan oleh file &quot;ntoskrnl.exe&quot;. </p> <p> </p> <h2> Cara MEMPERBAIKI STOP 0x000000C1: KORUPSI MEMORI TERDETEKSI KOLAM KHUSUS YANG DISEBABKAN OLEH NTOSKENL.EXE. </h2> <p> Masalah layar biru &quot;Stop 0x000000C1: SPECIAL POOL DETECTED MEMORY CORRUPTION&quot; dapat disebabkan karena beberapa alasan, mis. driver perangkat yang salah, file sistem yang rusak, serangan virus atau dari program yang berjalan di latar belakang. Untuk memperbaiki masalah, ikuti metode di bawah ini: </p> <h6> Metode 1. Pindai sistem Anda dari Virus dan Malware. </h6> <p> Langkah pertama untuk mengatasi masalah layar biru &quot;KORUPSI MEMORI TERDETEKSI KOLAM KHUSUS&quot;, adalah memastikan bahwa sistem Anda bebas virus/malware. Untuk tugas itu, ikuti instruksi dalam panduan ini: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Memindai Komputer Anda dari Virus dan Program Berbahaya lainnya. </a></p> <p> </p> <h6> Metode 2. Copot Perangkat Lunak Antivirus/Keamanan Anda. </h6> <p> Masalah layar biru &quot;SPECIAL POOL DETECTED MEMORY CORRUPTION&quot;, mungkin disebabkan setelah pembaruan otomatis program Antivirus/Keamanan Anda (terutama jika Anda menggunakan AVAST atau AVG). Jadi, lanjutkan dan hapus instalan program antivirus Anda sepenuhnya dari sistem dan Hidupkan Kembali komputer Anda. <br> – Jika masalah BSOD, tidak terjadi setelah penghapusan antivirus, lanjutkan untuk mengunduh dan menginstal ulang versi terbaru perangkat lunak keamanan Anda di sistem Anda. </p> <p> </p> <h6> Metode 3. Mulai Windows dalam Status Boot Bersih. </h6> <p> Cara selanjutnya, untuk mengatasi masalah BSOD &quot;KORUPSI MEMORI TERDETEKSI KOLAM KHUSUS&quot;, adalah dengan memulai Windows di <a href=\"https://www.repairwin.com/how-to-start-windows-in-clean-boot-state/\" target=\"_blank\" rel=\"nofollow noopener\"> &quot;sepatu bersih&quot; </a> &quot;, untuk mengidentifikasi program mana yang menyebabkan sistem Anda mogok. </p> <p> Untuk memulai Windows dalam status Boot Bersih: </p> <p> 1. Tekan tombol Windows <img src=\"images/image_thumb8_thumb_thumb-465.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> 2. Ketik <strong> msconfig </strong> dan tekan <strong> Memasukkan </strong> . </p> <p><img src=\"images/image_thumb-47-632.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. Pada tab Layanan, <strong> Sembunyikan semua Layanan Microsoft </strong> kotak centang dan kemudian tekan tombol <strong> Menonaktifkan semua </strong> tombol, untuk mencegah semua layanan non-Microsoft dimulai saat startup Windows. </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-480.png\" alt=\"clean boot state\" loading=\"lazy\"></p> <p> 4. Kemudian pilih <strong> Memulai </strong> tab dan <strong> Nonaktifkan </strong> semua program lain yang dimulai saat startup Windows dan berjalan di latar belakang. * </p> <p> * Catatan: Aktif <strong> Windows 10 </strong> atau <strong> 8 </strong> , Pilih <strong> Buka Pengelola Tugas </strong> untuk menonaktifkan program startup. </p> <p><img src=\"images/image_thumb-29-570.png\" alt=\"Windows clean boot\" loading=\"lazy\"></p> <p> </p> <p> 5. Setelah selesai, klik <strong> baik </strong> dan <strong> Mengulang kembali </strong> komputer Anda. <br> 6. Jika setelah restart, komputer Anda berfungsi dengan baik dan tanpa masalah BSOD, maka luncurkan kembali utilitas Konfigurasi Sistem dan aktifkan satu per satu semua item yang dinonaktifkan dan mulai ulang sistem Anda, hingga Anda mengetahui mana yang menyebabkan masalah BSoD. * </p> <p> * Catatan: Untuk <strong> keluar </strong> dari <strong> Bersihkan Boot </strong> negara, luncurkan utilitas Konfigurasi Sistem dan di <strong> Umum </strong> Pilih tab <strong> Startup biasa. </strong></p> <p> </p> <h6> Metode 4. Periksa Memori (RAM) dan Hard Disk (HDD) untuk masalah. </h6> <p> Masalah Blue Screen, mungkin karena modul RAM yang rusak atau hard drive yang buruk. Untuk menguji dan mendiagnosis masalah pada komponen RAM dan HDD Anda, ikuti petunjuk dalam panduan ini: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Mendiagnosis masalah Memori Komputer dengan Memtest86+ </a></li> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Alat Tes &amp; Diagnostik Hard Drive Terbaik untuk Memeriksa Kesehatan Hard Disk </a></li> </ul> <p> </p> <p> </p> <h6> Metode 5. Perbarui Driver Perangkat. </h6> <p> Dalam beberapa kasus, masalah BSOD &quot;SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION disebabkan oleh modul ntoskrnl.exe&quot;, terjadi karena pengandar perangkat yang tidak valid atau rusak. Jadi, lanjutkan dan perbarui driver perangkat berikut di komputer Anda dengan urutan ini: </p> <p> 1. Adaptor Video (VGA). <br> 2. Chipset. <br> 3. Adaptor Ethernet. <br> 4. Adaptor Wi-Fi (jika ada). </p> <p> </p> <h6> Metode 6. <strong> Analisis Minidump. </strong></h6> <p> Saat Windows mogok dengan layar biru, menyimpan detail layar BSoD ke file kecil, yang disebut &quot; <strong> MiniDump </strong> &quot;. Analisis dari <strong> Minidump </strong> file(s) dapat membantu Anda untuk memecahkan masalah dan menyelesaikan masalah layar biru. Untuk menyelesaikan tugas ini, ikuti petunjuk dalam artikel ini: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Menganalisis File MiniDump dengan BlueScreenView </a> . </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}