{"title":"MEMPERBAIKI: Lexmark Lambat Mencetak Banyak Halaman di Windows 10 (Terpecahkan)","content":"<p> Pada PC Windows 10, dengan printer Lexmark terinstal, pencetakan lambat saat mencetak beberapa halaman. Masalah pencetakan lambat Lexmark di Windows 10, biasanya karena driver printer yang salah atau pengaturan printer yang salah (Preferensi). Untuk mengatasi masalah tersebut, lanjutkan membaca di bawah ini. </p> <p><img src=\"images/image_thumb-29-115.png\" alt=\"FIX: Lexmark Slow Printing in Multiple Pages on Windows 10 \" loading=\"lazy\"></p> <p> Masalah Lexmark Slow Print secara detail: Pada Windows 10, printer Lexmark Anda mencetak dengan cepat saat mencetak satu halaman, tetapi ketika Anda ingin mencetak beberapa halaman, pencetakan menjadi lambat karena proses pencetakan terlalu lama untuk memulai dan kemudian printer mencetak satu halaman pada satu waktu setiap 1-2 menit. </p> <p> Tutorial ini berisi instruksi untuk mengatasi masalah pencetakan lambat beberapa halaman Lexmark, di Windows 10. </p> <ul> <li><strong> Artikel terkait: </strong> <a href=\"https://www.repairwin.com/fix-slow-pdf-printing-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> MEMPERBAIKI: Pencetakan PDF Lambat di Windows 10 </a></li> </ul> <h4> Cara MEMPERBAIKI: Pencetakan Lambat Beberapa Halaman di Printer Lexmark pada Windows 10. </h4> <h6> Metode 1. Ubah Pengaturan Printer. </h6> <p> 1. Navigasikan ke <strong> Panel kendali </strong> -&gt; <strong> Perangkat dan Printer. </strong><br> 2. Klik kanan pada Printer Anda dan pilih <strong> Properti. </strong></p> <p><img src=\"images/image_thumb-30-253.png\" alt=\"Printer Properties\" loading=\"lazy\"></p> <p> 3. Pada tab &#39;Umum&#39;, <strong> klik Ubah Properti. </strong></p> <p><img src=\"images/image_thumb-31-900.png\" alt=\"Change Printer Properties\" loading=\"lazy\"></p> <p> 4. Di Preferensi Pencetakan Lexmark, atur <strong> Jenis kertas </strong> untuk <strong> Polos </strong> dan klik <strong> BAIK. * </strong></p> <p> * Catatan: Pengaturan lain yang dapat diterapkan pada printer Anda untuk meningkatkan kecepatan cetak: </p> <ul> <li><strong> Resolusi Cetak </strong><strong> : </strong> 600 dpi akan memperlambat printer. </li> <li><strong> Mode Diam </strong><strong> : </strong> Mati </li> </ul> <p><img src=\"images/image_thumb-32-858.png\" alt=\"FIX Slow Lexmark Printing Lexmark - Windows 10\" loading=\"lazy\"></p> <p> 5. Sekarang, klik <strong> Menerapkan </strong> dan <strong> baik </strong> di jendela &#39;Properti Printer&quot; untuk menerapkan perubahan. <br> 6. Buka dokumen dengan beberapa halaman, dan periksa apakah masalah telah diperbaiki. Jika tidak, lanjutkan ke cara-2 di bawah ini. </p> <h6> Metode 2. Ubah Pengandar Pencetak. </h6> <p> 1. Navigasikan ke <strong> Panel kendali </strong> -&gt; <strong> Perangkat dan Printer. </strong><br> 2. Klik kanan pada Printer Anda dan pilih <strong> Hapus Perangkat. </strong></p> <p><img src=\"images/image_thumb-33-755.png\" alt=\"Uninstall Printer Windows 10\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 2. Setelah penghapusan printer, navigasikan ke <strong> Program dan fitur </strong> di Panel Kontrol dan <strong> hapus instalan </strong> itu <strong> Perangkat lunak Lexmark </strong> (apapun). </p> <p> 3. Navigasikan ke <a href=\"https://www.lexmark.com/en_us/support/download-search.html\" target=\"_blank\" rel=\"nofollow noopener\"> Driver &amp; Unduhan Lexmark </a> situs, dan cari driver yang tersedia untuk Model Printer dan Sistem Operasi Anda. <br> 4. Dari daftar driver yang tersedia, unduh dan instal salah satu driver berikut: * </p> <ul> <li> <p> Driver Cetak Universal. </p> </li> <li> <p> Driver Cetak Emulasi PCL5e Universal. </p> </li> <li> <p> Driver Cetak Emulasi Universal PostScript 3 </p> </li> </ul> <p> * Catatan: Saya sarankan Anda mencoba driver cetak dalam urutan yang tercantum di atas. </p> <p> 5. Setelah penginstalan driver printer selesai, <strong> mengulang kembali </strong> komputer Anda. <br> 6. Setelah restart, coba print dokumen panjang. Masalah pencetakan lambat, harus diperbaiki. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang masalah ini. </p>"}