{"title":"MEMPERBAIKI: Mikrofon Tidak Terdeteksi atau Tidak Bekerja di Windows 10 (Terpecahkan)","content":"<p> Panduan ini berisi instruksi untuk memperbaiki masalah &quot;mikrofon tidak terdeteksi&quot; atau &quot;mikrofon tidak berfungsi&quot;, di Windows 10. Jika Anda mengalami masalah dengan mikrofon di Windows 10, maka ini dapat disebabkan oleh beberapa alasan. Masalah &quot;mikrofon tidak berfungsi&quot; adalah masalah bagi banyak pengguna Windows 10 dan biasanya muncul setelah pembaruan Windows. </p> <p> Tutorial ini berisi beberapa solusi, untuk mengatasi masalah mikrofon di Windows 10. </p> <h4> Cara MEMPERBAIKI: Mikrofon Windows 10 Tidak Berfungsi atau Tidak Terdeteksi. * </h4> <p> * Catatan: Jika Anda memiliki masalah dengan mikrofon Anda, di aplikasi tertentu, coba yang berikut ini: </p> <blockquote><p> 1. Pastikan aplikasi tertentu, diizinkan untuk menggunakan mikrofon, dengan menggunakan petunjuk dalam metode-1 di bawah ini. <br> 2. Pastikan mikrofon dipilih sebagai perangkat input default di pengaturan aplikasi. (misalnya di Skype, buka <strong> Pengaturan </strong> dan pastikan mikrofon atau headset Anda dipilih). <br> 3. Tutup aplikasi lain yang mungkin menggunakan mikrofon Anda. <br> 4. Restart PC Anda dan uji kembali MIC Anda. </p></blockquote> <h6> Solusi 1. Izinkan Aplikasi Mengakses Mikrofon Anda. </h6> <p> Metode pertama, untuk memecahkan masalah dengan mikrofon Anda di Windows 10, adalah memastikan bahwa semua aplikasi memiliki akses ke mikrofon Anda. Untuk melakukannya: </p> <p> 1. . Dari menu Mulai <img src=\"images/image_thumb2_thumb_thumb-856.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> klik <strong> Pengaturan </strong><img src=\"images/image_thumb-66-804.png\" alt=\"image\" loading=\"lazy\"> lalu buka <strong> Pribadi </strong> . <br> 2.  Pilih <strong> Mikropon </strong> di panel kiri dan kemudian <strong> Nyalakan </strong> itu <strong> Izinkan aplikasi mengakses mikrofon Anda. </strong></p> <p><img src=\"images/image_thumb-34-268.png\" alt=\"How to FIX: Windows 10 Microphone Not Detected or Not Working\" loading=\"lazy\"></p> <p> 3. Kemudian gulir ke bawah, dan pastikan bahwa Aplikasi yang ingin Anda gunakan Mikrofon Anda, dapat mengaksesnya. * </p> <p> * Saran: Untuk privasi Anda, matikan akses mikrofon ke aplikasi apa pun yang Anda tidak ingin mikrofon Anda gunakan. </p> <p><img src=\"images/image_thumb-35-517.png\" alt=\" FIX Windows 10 Microphone Not Working\" loading=\"lazy\"></p> <p> 4. Setelah selesai, uji Mikrofon Anda. </p> <h6> Solusi 2. Periksa apakah Mikrofon Anda adalah Perangkat Input Default (Perangkat Perekaman). </h6> <p> 1. . Dari menu Mulai <img src=\"images/image_thumb2_thumb_thumb-930.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> klik <strong> Pengaturan </strong><img src=\"images/image_thumb-66-142.png\" alt=\"image\" loading=\"lazy\"> lalu buka <strong> Sistem </strong> . <br> 2. Klik <strong> Suara </strong> di panel kiri, lalu bicara untuk menguji mikrofon Anda. Jika mikrofon Anda berfungsi, Anda akan melihat bilah penggeser bergerak di bawah. Jika tidak, maka klik <strong> Kelola perangkat suara. </strong></p> <p><img src=\"images/image_thumb-36-254.png\" alt=\"Test Microphone Windows 10\" loading=\"lazy\"></p> <p> 3. Pada opsi &#39;Kelola perangkat suara, pastikan bahwa Mikrofon Anda terdaftar di bawah &#39;Perangkat Input&#39; sebagai perangkat input default, dan <strong> Diaktifkan </strong> . Jika tidak, klik Mikrofon Anda dan klik <strong> Memungkinkan. </strong></p> <p><img src=\"images/image_thumb-37-753.png\" alt=\"Enable Microphone Windows 10\" loading=\"lazy\"></p> <h6> Solusi 3. Periksa Pengaturan Mikrofon di Panel Kontrol. </h6> <p> 1. Navigasikan ke Windows <strong> Panel kendali </strong> dan buka <strong> Suara. </strong></p> <p><img src=\"images/image_thumb-14-511.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Di <strong> Rekaman </strong> tab, pilih Mikrofon Anda dan klik <strong> Properti. </strong></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"Microphone Properties\" loading=\"lazy\"></p> <p> 3. Di <strong> Tingkat </strong> tab, <strong> menyeret </strong> penggeser ke <strong> Baik </strong> , untuk meningkatkan volume mikrofon, dan memastikan mikrofon Anda dibunyikan (Jika mikrofon Anda dimatikan, ikon volumenya <img src=\"images/image_thumb-39-434.png\" alt=\"image\" loading=\"lazy\"> , akan ditampilkan dengan simbol merah <img src=\"images/image_thumb-40-819.png\" alt=\"image\" loading=\"lazy\"> ). Setelah selesai klik <strong> baik </strong> dan <strong> baik </strong> untuk menutup Properti Suara. </p> <p><img src=\"images/image_thumb-41-896.png\" alt=\"Microphone Levels\" loading=\"lazy\"></p> <h6> Solusi 4. Ganti Driver Kartu Suara. </h6> <p> Metode terakhir untuk mengatasi masalah mikrofon di Windows 10 adalah dengan mengubah Driver Suara, terutama jika Anda memiliki perangkat Realtek Audio. Untuk melakukannya: </p> <p> 1. Buka <strong> Pengaturan perangkat </strong> . Untuk melakukannya: </p> <blockquote><p> 1. Tekan Windows <img src=\"images/image_thumb8_thumb_thumb-918.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> 2. Di kotak &quot;Buka&quot;, ketik: <strong> devmgmt.msc </strong> &amp; klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb-5-732.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Memperluas </strong> itu <strong> Pengontrol suara, video, dan game. </strong></p> <p> 3. <strong> Klik kanan </strong> di <strong> Audio Definisi Tinggi Realtek </strong> perangkat dan pilih <strong> Perbarui Pengandar. <br> </strong></p> <p><img src=\"images/image_thumb-6-629.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Pilih <strong> Jelajahi komputer saya untuk driver. </strong></p> <p><img src=\"images/image_thumb-7-637.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Pilih <strong> Biarkan saya memilih dari daftar driver yang tersedia di komputer saya </strong> . </p> <p><img src=\"images/image_thumb-8-118.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. Pada layar berikutnya, pilih <strong> Perangkat Audio Definisi Tinggi </strong> dan klik <strong> Lanjut. </strong></p> <p><img src=\"images/image_thumb-20-989.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p> 8. Pada jendela &#39;Update Driver Warning&#39;, klik &quot;Yes&quot; untuk menginstal driver baru. <br> 9. Setelah penginstalan driver selesai, <strong> mengulang kembali </strong> komputer Anda. <br> 10. Setelah restart, lanjutkan dan uji mikrofon Anda. </p> <h6></h6> <h6> Solusi 5. Copot &amp; Instal Ulang Driver Kartu Suara. </h6> <p> Solusi terakhir untuk memperbaiki masalah mikrofon yang tidak berfungsi, di Windows 10 adalah menghapus dan menginstal ulang driver Kartu Suara sepenuhnya. </p> <p> 1. Navigasikan ke <strong> Panel kendali </strong> &gt; <strong> Program dan Fitur </strong> dan <strong> hapus instalan </strong> perangkat lunak apa pun yang terkait dengan Kartu Suara Anda. <br> 2. Buka <strong> Pengaturan perangkat </strong> dan <strong> memperluas </strong> itu <strong> Pengontrol suara, video, dan game. <br> </strong> 3. <strong> Klik kanan </strong> pada terpasang <strong> Perangkat audio </strong> dan klik <strong> Hapus Perangkat. </strong></p> <p><img src=\"images/image_thumb-42-701.png\" alt=\"Uninstall Sound Card Device\" loading=\"lazy\"></p> <p> </p> <p> 4. Setelah selesai, navigasikan ke situs dukungan pabrikan komputer atau laptop Anda dan unduh serta instal driver terbaru untuk kartu suara Anda. <br> 5. Setelah instalasi, <strong> mengulang kembali </strong> pc Anda dan periksa apakah mikrofon Anda berfungsi. </p> <p><strong> Bantuan Tambahan: </strong> Jika setelah menerapkan solusi di atas, mic Anda masih tidak berfungsi, maka mungkin rusak. Untuk memastikan, jika Anda memiliki laptop, pasang mikrofon eksternal, atau gunakan mikrofon lain jika Anda memiliki desktop. </p> <p> Itu saja! Metode mana yang berhasil untuk Anda? Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}