{"title":"MEMPERBAIKI: Thunderbird tidak merespons atau membeku. (Terpecahkan)","content":"<p> Jika Thunderbird tidak merespons, lanjutkan di bawah untuk menyelesaikan masalah. Thunderbird adalah klien email open-source populer yang tersedia untuk semua platform. Namun terkadang Thunderbird berhenti merespons sama sekali, atau terhenti selama 4-5 menit sebelum dapat digunakan kembali. </p> <p><img src=\"images/image_thumb-18-762.png\" alt=\"Thunderbird is not responding or freezing - fix\" loading=\"lazy\"></p> <p> Thunderbird mungkin tidak berfungsi, karena alasan berikut: </p> <ul> <li> Program Antivirus dapat mencegah Thunderbird untuk terhubung ke Internet. </li> <li> Fitur Pencarian Windows dalam pesan Thunderbird dapat menyebabkan Thunderbird membeku. </li> <li> Pengaturan atau Add-on Thunderbird yang bermasalah. </li> <li> File pengindeksan Thunderbird (file MSF) mungkin rusak. </li> </ul> <p> Karena Thunderbird mungkin tidak merespons karena berbagai alasan, dalam tutorial ini kami akan menunjukkan kepada Anda semua cara yang tersedia untuk menyelesaikan masalah. </p> <h2> Cara MEMPERBAIKI: Thunderbird Tidak Merespons atau Membeku di Windows 10. </h2> <h3> Metode 1. Pindai komputer Anda dari virus. </h3> <p><strong> Penting: </strong> Banyak virus atau program jahat dapat menyebabkan masalah dengan pembaruan Windows. Jadi sebelum Anda melanjutkan ke langkah pemecahan masalah di bawah ini, gunakan ini <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Panduan Pemindaian dan Penghapusan Malware </a> untuk memeriksa dan menghapus virus atau/dan program jahat yang mungkin berjalan di komputer Anda. </p> <h3></h3> <h3> Metode 2. Nonaktifkan Pencarian Windows di pesan Thunderbird. </h3> <p> 1. Dari menu Thunderbird, pilih <strong> Alat </strong> &gt; <strong> Pilihan </strong> . </p> <p> 2. Dalam pengaturan Umum, <strong> hapus centang </strong> pilihan <strong> Izinkan Pencarian Windows untuk mencari pesan </strong> . </p> <p><img src=\"images/image_thumb-24-636.png\" alt=\"Disable Windows Search in Thunderbird Messages\" loading=\"lazy\"></p> <p> 3. <strong> Mengulang kembali </strong> burung guntur. </p> <p> </p> <h3> Metode 3. Tambahkan Thunderbird ke pengecualian Antivirus. </h3> <p> Jika Anda menggunakan antivirus pihak ketiga di komputer Anda, lanjutkan dan tambahkan program yang dapat dijalankan &quot;thunderbird.exe&quot; ke pengecualian program Antivirus Anda. </p> <p> Misalnya, jika Anda memiliki AVG Antivirus: </p> <p> 1. Pergi ke <strong> Tidak bisa </strong> &gt; <strong> Pengaturan </strong> . <br> 2. Dalam <strong> Umum </strong> tab, klik <strong> Pengecualian </strong> &gt; <strong> Tambahkan pengecualian </strong> . <br> 3. Klik <strong> Jelajahi </strong> tombol dan temukan <strong> thunderbird.exe </strong> berkas, (atau <strong> salinan </strong> &amp; <strong> tempel baris di bawah ini) </strong> lalu klik <strong> Tambahkan Pengecualian. * </strong></p> <ul> <li> C:\\Program Files (x86)\\Mozilla Thunderbird\\thunderbird.exe </li> </ul> <p><strong> * Catatan: </strong> Jika setelah menambahkan file &quot;thunderbird.exe pada pengecualian AV Anda, masalahnya masih ada, <strong> Menambahkan </strong> juga <strong> untuk pengecualian AV </strong> itu <strong> folder tempat Thunderbird telah diinstal </strong> dan <strong> Folder profil Thunderbird </strong> . </p> <p><img src=\"images/image_thumb-19-734.png\" alt=\"add thunderbird to antivirus exceptions\" loading=\"lazy\"></p> <p> </p> <p> </p> <h3> Metode 4. Nonaktifkan – Copot Program Antivirus Anda. </h3> <p> Karena masalah &quot;tidak merespons&quot; di program Thunderbird, biasanya karena program Antivirus, saya sarankan untuk <strong> nonaktifkan </strong> atau untuk <strong> hapus instalan sepenuhnya </strong> program Antivirus Anda dan untuk melihat apakah masalah masih berlanjut. </p> <h3></h3> <p> </p> <h3> Metode 5. Mulai Thunderbird dalam Safe Mode. </h3> <p> Thunderbird mungkin membeku dan tidak merespons, jika ekstensi yang dipasang menyebabkan masalah atau rusak. Untuk memecahkan masalah dengan Add-on Thunderbird, lanjutkan sebagai berikut. </p> <p> 1. Tekan dan <strong> menekan </strong> itu <strong> BERGESER </strong> tombol pada keyboard Anda dan buka <strong> burung guntur. </strong></p> <p> 2. Di jendela berikutnya klik <strong> Lanjutkan dalam Mode Aman. </strong></p> <p><img src=\"images/image_thumb-21-196.png\" alt=\"Strat Thunderbird in Safe Mode\" loading=\"lazy\"></p> <p> </p> <p> 3. Jika Thunderbird tidak membeku dalam Safe Mode, maka add-on yang diinstal dapat menyebabkan masalah. Pada kasus ini: </p> <ol> <li> Tutup Thunderbird. </li> <li> Tekan tombol SHIFT dan luncurkan Thunderbird lagi. </li> <li> Di jendela berikutnya, <strong> memeriksa </strong> <strong> Nonaktifkan semua add-on </strong> dan klik <strong> Buat Perubahan dan Mulai Ulang </strong> . </li> </ol> <p><img src=\"images/image_thumb-22-149.png\" alt=\"Disable Thunderbird add-ons\" loading=\"lazy\"></p> <p> 4. Jika Thunderbird tidak merespons lagi, lanjutkan ke metode berikutnya. </p> <h3> Metode 5. Setel ulang Bilah Alat dan kontrol Thunderbird. </h3> <p> 1. Tekan dan <strong> menekan </strong> itu <strong> BERGESER </strong> tombol pada keyboard Anda dan buka <strong> burung guntur. </strong></p> <p> 2. Di jendela berikutnya pilih <strong> Setel Ulang Bilah Alat dan kontrol </strong> dan klik <strong> Lakukan Perubahan dan Mulai Ulang. </strong></p> <p><img src=\"images/image_thumb-23-344.png\" alt=\"Reset Thunderbird Toolbars\" loading=\"lazy\"></p> <p> </p> <h3> Metode 6. Hapus file Thunderbird&#39;s Index (.msf). </h3> <p> Dalam beberapa kasus Thunderbird membeku, karena file pengindeksan (alias file MSF), menjadi rusak. Jadi, metode terakhir untuk mengatasi masalah &quot;Thunderbird tidak merespons&quot;, adalah dengan menghapus file .MSF. * </p> <p><strong> * PENTING: </strong> Meskipun file MSF (Mail Summary Files) dapat dihapus dengan aman karena hanya berisi header email dan status email (dibaca, belum dibaca, dll.), dan bukan email sebenarnya, disarankan untuk <a href=\"https://www.repairwin.com/how-to-transfer-thunderbird-email-and-settings-to-a-new-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> buat cadangan folder profil Thunderbird </a> sebelum menghapus file MSF. </p> <p><strong> Langkah 1. Tutup Thunderbird. </strong></p> <p><strong> Langkah 2. Aktifkan tampilan file Tersembunyi. </strong></p> <p> 1. Navigasikan ke Windows <strong> Panel kendali </strong> dan buka <strong> Pilihan folder </strong> . (atau <strong> Opsi Penjelajah File </strong> di Windows 10). </p> <p> 2. Pilih <strong> Melihat </strong> tab, dan di bawah <strong> &#39;File dan folder tersembunyi&#39; </strong> bagian, <strong> memeriksa </strong> itu <strong> Tampilkan file, folder, dan drive tersembunyi </strong> pilihan dan klik <strong> BAIK. </strong></p> <p><img src=\"images/image_thumb-34-553.png\" alt=\"Show Hidden files\" loading=\"lazy\"></p> <p> </p> <p><strong> Langkah 3. Hapus file .MSF </strong></p> <p> 1. Navigasikan ke folder profil Thunderbird di disk Anda dan buka <strong> Surat </strong> map: * </p> <ul> <li> C:\\Users\\username\\AppData\\Roaming\\Thunderbird\\Profiles\\ProfileName <strong> .default\\Mail </strong></li> </ul> <p> * Di mana nama pengguna adalah nama pengguna Windows Anda dan ProfileName adalah nama profil Mozilla tempat email disimpan. </p> <p> 2. Sekarang jelajahi semua folder yang ada di dalam <strong> Surat </strong> folder, untuk melihat mana yang berisi file .msf. (dalam instalasi default, dengan hanya satu akun email, file MSF terletak di folder &quot;Folder Lokal&quot;. </p> <p> 3. <strong> Menghapus </strong> semua <strong> .msf </strong> file, atau -lebih baik- <strong> pindah </strong> mereka ke folder (baru) di desktop Anda. </p> <p><img src=\"images/image_thumb-25-355.png\" alt=\"Delete Thunderbird MSF files\" loading=\"lazy\"></p> <p> 4. Setelah selesai, buka Thunderbird dan tunggu Thunderbird membuat ulang file pengindeksan (file MSF). </p> <p> Itu saja! Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}