{"title":"MEMPERBAIKI: Outlook Add-In diinstal untuk semua pengguna dan tidak dapat dihapus. (Terpecahkan)","content":"<p> Jika Anda tidak dapat menonaktifkan atau mengaktifkan Add-in Outlook karena kesalahan &quot; <em> Add-diinstal untuk semua pengguna di komputer ini, dan hanya dapat dihubungkan atau diputuskan oleh administrator </em> &quot;, lanjutkan membaca di bawah ini untuk menyelesaikan masalah. </p> <p><img src=\"images/image_thumb-76-527.png\" alt=\"The add-is installed for all users on this computer, and can only be connected or disconnected by an administrator\" loading=\"lazy\"></p> <p> Kesalahan &quot;Add-in hanya dapat Dinonaktifkan oleh Administrator&quot; muncul karena ketika Anda menginstal add-in, Anda memilih untuk menginstalnya untuk semua pengguna di komputer. Pada kasus ini, satu-satunya solusi untuk mengatasi galat adalah menghapus instalan add-in dengan menggunakan hak administratif. </p> <h2> Cara memperbaiki: Tidak Dapat Mengaktifkan atau Menonaktifkan Add-in karena diinstal untuk semua pengguna di Outlook, Word, atau Excel. </h2> <p> Jika Anda tidak dapat menghapus atau mengaktifkan Add-in aplikasi Microsoft Office, karena kesalahan &quot; <em> Add-diinstal untuk semua pengguna di komputer ini, dan hanya dapat dihubungkan atau diputuskan oleh administrator&quot;, </em> luncurkan aplikasi yang sesuai sebagai Administrator dan lanjutkan untuk menghapus Add-in tanpa masalah. Untuk melakukannya: </p> <p><strong> 1. </strong> Klik kanan pada aplikasi Office, di mana Anda menghadapi kesalahan yang disebutkan di atas (misalnya Outlook), dan pilih <strong> Jalankan sebagai administrator. * </strong></p> <p> * Catatan: <strong><br> </strong> 1. Jika Anda tidak melihat opsi &quot;Jalankan Administrator&quot;, tahan tombol <strong> BERGESER </strong> kunci dan <strong> klik kanan </strong> di aplikasi Office Anda menghadapi kesalahan. <br> 2. Jika Anda mengklik kanan aplikasi Office dari Windows 10 <strong> Mulailah </strong> Tidak bisa <img src=\"images/image_thumb2_thumb_thumb-340.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Program </strong> , pergi ke <strong> Lebih </strong> &gt; <strong> Jalankan sebagai administrator. </strong></p> <p><img src=\"images/image_thumb-77-661.png\" alt=\"FIX: Unable to Enable or Disable Add-in \" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Saat diminta untuk mengizinkan aplikasi ini membuat perubahan pada perangkat Anda, pilih <strong> Iya. </strong></p> <p><img src=\"images/image_thumb-78-120.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Setelah membuka aplikasi Office, lanjutkan untuk menonaktifkan atau mengaktifkan Add-in yang Anda inginkan. Kali ini add-in akan dihapus tanpa masalah. </p> <p> Itu dia! Beri tahu saya jika panduan ini telah membantu Anda dengan memberikan komentar tentang pengalaman Anda. Silakan suka dan bagikan panduan ini untuk membantu orang lain. </p>"}