{"title":"MEMPERBAIKI: Outlook 0x80042112 – Menerima kesalahan yang dilaporkan (dipecahkan)","content":"<p> Outlook 0x80042112 Menerima laporan kesalahan, biasanya terjadi saat Outlook mencoba menerima email berukuran sangat besar (mis. email dengan lampiran besar). Dalam kasus ini, Outlook menampilkan kesalahan berikut selama &#39;Kirim/Terima Kemajuan&#39;: &quot;Tugas &#39;%Email-Account% – Menerima&#39; kesalahan yang dilaporkan (0x80042112) : &#39;Pesan email berikut di server email tidak dapat diunduh. Hubungi penyedia layanan Internet (ISP) atau administrator email Anda jika Anda terus menerima kesalahan ini.&quot; </p> <p><img src=\"images/image_thumb-7-121.png\" alt=\"FIX: Outlook 0x80042112 Receiving reported error. \" loading=\"lazy\"></p> <p> Tutorial ini berisi petunjuk terperinci untuk mengatasi kesalahan penerimaan Outlook 0x80042112. </p> <h4> Cara Memperbaiki Outlook Menerima Dilaporkan Kesalahan 0x80042112. </h4> <h6> Langkah 1. Pastikan Anda terhubung ke Internet. </h6> <p> Terkadang galat penerimaan Outlook 0x80042112, terjadi karena sambungan Internet dihentikan. Jadi, pertama-tama, verifikasi bahwa koneksi Internet Anda berfungsi. Untuk melakukannya, buka browser Internet Anda dan kunjungi situs web apa pun, untuk memeriksa koneksi Anda. </p> <p> </p> <h6> Langkah 2. Hapus Pesan Email Kotak Keluar. </h6> <p> Metode kedua untuk mengatasi kesalahan 0x80042112 di Outlook, adalah dengan menghapus atau memindahkan ke draf, semua pesan email yang macet di Kotak Keluar. Untuk melakukannya: </p> <p> 1. Di Outlook, klik tombol <strong> Kirim Terima </strong> tab, lalu klik <strong> Bekerja Offline </strong> . </p> <p><img src=\"images/image_thumb-8-737.png\" alt=\"Move Outbox Emails to Drafts folder\" loading=\"lazy\"></p> <p> 2. <strong> Mengulang kembali </strong> Pandangan. <br> 3. Pilih <strong> Kotak keluar </strong> folder (di sebelah kiri) lalu tekan <strong> CTRL </strong> + <strong> SEBUAH </strong> untuk memilih semua email (di sebelah kanan). <br> 4. Klik kanan pada email yang dipilih dan pindahkan ke <strong> draf </strong> folder, dengan mengklik <strong> Pindah -&gt; Folder Lain </strong> , lalu pilih <strong> draf </strong> folder dari daftar. </p> <p><img src=\"images/image_thumb-10-352.png\" alt=\"FIX Outlook error 0x80042112\" loading=\"lazy\"></p> <p> </p> <p> 5. Setelah selesai, klik tombol <strong> Kirim Terima </strong> tab, dan klik <strong> Bekerja Online. <br> </strong> 6. <strong> Mengulang kembali </strong> Outlook dan lakukan Send/Receive. </p> <h6></h6> <h6> Langkah 3. Jalankan Outlook tanpa Add-Ins. </h6> <p> Metode lain untuk memperbaiki kesalahan Outlook 0x80042112 dalam menerima, adalah memulai aplikasi Outlook dalam Mode Aman dan menonaktifkan Add-in apa pun yang dapat menyebabkan kesalahan. </p> <p> 1. Untuk memulai Outlook dalam Safe Mode, tahan tombol <strong> CTRL </strong> (pada keyboard Anda) lalu klik dua kali pada pintasan Microsoft Outlook, atau: </p> <blockquote><p> Sebuah. Tekan secara bersamaan Windows <img src=\"images/image_thumb36-371.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> b. Tipe: <strong> pandangan / aman </strong> dan klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb-14-671.png\" alt=\"outlook safe mode\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. Dalam Mode Aman Outlook, navigasikan ke opsi Add-in dan <strong> nonaktifkan semua Add-in </strong> . Untuk melakukannya: </p> <ul> <li> Untuk menonaktifkan Add-in di <strong> Outlook 2007 </strong> : </li> </ul> <blockquote><p> 1. <strong> Di </strong> itu <strong> Alat </strong> menu, klik <strong> Pusat Kepercayaan. </strong><br> 2. Pilih <strong> Tambahan </strong> di panel kiri. <br> 3. Di panel kanan, pilih <strong> COM Add-in </strong> dan klik <strong> Pergilah… <br> </strong> 4. <strong> Hapus centang </strong> semua kotak centang, untuk menonaktifkan semua add-in dan klik <strong> BAIK. </strong></p></blockquote> <ul> <li> Untuk menonaktifkan Add-in di <strong> Outlook 2016, 2013 </strong> atau <strong> 2010 </strong> : </li> </ul> <blockquote><p> 1. Klik <strong> Mengajukan </strong> menu dan pilih <strong> Pilihan </strong> . <br> 2. Pilih <strong> Add-in di </strong> panel kiri. <br> 3. Di panel kanan, pilih <strong> COM Add-in </strong> dan klik <strong> Pergilah… </strong></p></blockquote> <p><img src=\"images/image_thumb-20-411.png\" alt=\"disable outlook add-ins\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. <strong> Hapus centang </strong> <strong> semua </strong> kotak centang dan klik <strong> baik </strong> untuk menonaktifkan semua Add-in. </p> <p><strong><img src=\"images/image_thumb-21-683.png\" alt=\"turn off outlook add-ins\" loading=\"lazy\"><strong><br> </strong></strong></p> </blockquote> <p> 3. <strong> Mengulang kembali </strong> Pandangan. <br> 4. Coba Kirim/Terima. Jika progres kirim/terima berakhir dengan normal dan tanpa menampilkan kesalahan 0x80042112, lanjutkan dan aktifkan kembali satu per satu semua plugin yang dinonaktifkan dan mulai ulang Outlook, hingga Anda menemukan yang mana yang menyebabkan masalah. </p> <p> </p> <h6> Langkah 4. Periksa pengaturan Antivirus &amp; Firewall Anda. </h6> <p> Jika Anda menggunakan program antivirus dengan fitur pemindaian email, nonaktifkan Add-in Antivirus di Outlook, (lihat petunjuk pada langkah-3 di atas), atau nonaktifkan perlindungan Antivirus untuk sementara atau hapus instalan program Antivirus. Selain itu, periksa pengaturan Firewall Anda dan pastikan port server email yang Anda gunakan tidak diblokir dari program Firewall. Lebih khusus lagi, di pengaturan Firewall Anda: </p> <p> A. Aktifkan file berikut untuk mengakses Internet: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Aktifkan port berikut di Firewall: </p> <ul> <li><strong> Port 110 </strong> (Jika Anda menggunakan POP3 Incoming Mail Server tanpa koneksi terenkripsi) * </li> <li><strong> Pelabuhan 995 </strong> (Jika Anda menggunakan POP3 Incoming Mail Server dengan koneksi terenkripsi (SSL Diaktifkan) </li> </ul> <ul> <li><strong> Pelabuhan 143 </strong> (jika Anda menggunakan Server Email Masuk IMAP tanpa koneksi terenkripsi) </li> <li><strong> Pelabuhan 993 </strong> (jika Anda menggunakan Server Email Masuk IMAP dengan koneksi terenkripsi (SSL Diaktifkan) </li> </ul> <ul> <li><strong> Pelabuhan 25 </strong> Jika server Surat Keluar SMTP Anda tidak menggunakan SSL. * </li> <li><strong> Pelabuhan 465 </strong> atau <strong> 587 </strong> jika server Surat Keluar SMTP Anda menggunakan SSL </li> </ul> <p> * Catatan: Secara default, port 25 adalah untuk akses keluar, dan port 110 untuk akses masuk. Jika Anda tidak yakin tentang port, hubungi ISP atau administrator sistem Anda. </p> <p> </p> <h6> Langkah 5. Perbaiki file Data Outlook PST. </h6> <p> Langkah selanjutnya untuk memperbaiki kesalahan laporan penerimaan Outlook 0x80042112, adalah menjalankan Alat Perbaikan Kotak Masuk untuk memperbaiki file .pst Anda. Petunjuk terperinci untuk melakukannya dapat ditemukan di tutorial ini: <a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Memperbaiki File Data Outlook PST </a> . </p> <p> </p> <h6> Langkah 6. Periksa Ukuran Pesan Email dari WEB. </h6> <p> Jika Anda memiliki akses ke akun email Anda melalui web, masuk ke akun email Anda menggunakan browser web Anda dan periksa apakah ukuran email yang menjadi masalah. Misalnya, jika Anda menemukan email berukuran besar di Kotak Masuk, unduh lampirannya, lalu hapus email tersebut. * </p> <p> * Catatan: Jika Anda tidak memiliki akses ke akun email Anda melalui web, hubungi penyedia email Anda untuk melaporkan masalah tersebut. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}