{"title":"MEMPERBAIKI: Penyimpanan tidak cukup tersedia untuk memproses perintah ini – Tidak Dapat Mengakses Folder Bersama atau Menggunakan Desktop Jarak Jauh (Terpecahkan)","content":"<p> Galat &quot;Penyimpanan tidak cukup tersedia untuk memproses perintah ini&quot;, mungkin muncul saat Anda mencoba mengakses folder bersama di stasiun kerja Windows lain atau Server 2003, 2008, 2012 atau 2016, atau saat Anda menggunakan Sambungan Desktop Jarak Jauh (RDP ), untuk menyambung ke komputer Windows lain (Workstation atau Server). </p> <p><img src=\"images/image_thumb-127.png\" alt=\"Not enough storage is available to process this command\" loading=\"lazy\"></p> <p> </p> <p> Tutorial ini berisi petunjuk untuk mengatasi masalah berikut, yang dapat muncul di semua versi Windows (Windows 10, 8/8.1, 7, Vista, XP &amp; Windows Server 2003, 2008, 2012 atau 2016): </p> <p> 1. Saat Anda mencoba mengakses folder bersama di mesin Server, Anda menerima pesan galat: &quot; <em> Folder bersama </em> tidak dapat di akses. Anda mungkin tidak memiliki izin untuk menggunakan sumber daya jaringan ini. Hubungi administrator server ini untuk mengetahui apakah Anda memiliki izin akses. Tidak cukup penyimpanan server yang tersedia untuk memproses perintah ini.&quot; </p> <p> 2. Saat Anda mencoba menyambungkan dari jarak jauh (menggunakan RDP) ke komputer lain yang berbasis Windows, Anda mendapatkan pesan kesalahan: &quot;Sistem tidak dapat memasukkan Anda karena alasan berikut. Penyimpanan tidak cukup tersedia untuk memproses perintah ini&quot;. </p> <h4> CARA MEMPERBAIKI: Pesan galat &quot;Penyimpanan tidak cukup tersedia untuk memproses perintah ini&quot; di Desktop Jarak Jauh (RDP) atau saat mencoba mengakses Folder Bersama. </h4> <p> Pada mesin &quot;server&quot; Windows, yang ingin Anda akses filenya atau terhubung dari jarak jauh: </p> <p><strong> 1. </strong> Tekan &quot; <strong> jendela </strong> ” + “ <strong> R </strong> ” tombol untuk membuka <em> LARI </em> jendela. <br> <strong> 2. </strong> Tipe <strong> regedit </strong> dan tekan <strong> Memasukkan </strong> untuk membuka Peninjau Suntingan Registri. </p> <p><img src=\"images/image_thumb7-649.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Kemudian navigasikan ke kunci ini: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\LanmanServer\\Parameters </strong></li> </ul> <p><img src=\"images/image_thumb-1-198.png\" alt=\"fix Not enough storage - cannot access shared items\" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Di panel kanan klik dua kali untuk membuka <strong> IRPStackSize </strong> nilai <strong> . * </strong></p> <p><strong> * Catatan: </strong> Jika Anda tidak melihat <strong> IRPStackSize </strong> nilai, maka: </p> <p> </p> <blockquote><p> 1. Klik kanan pada ruang kosong (di panel kanan) lalu pilih <strong> Baru </strong> -&gt; <strong> Nilai DWORD (32-bit) </strong></p> <p><img src=\"images/image_thumb-2-236.png\" alt=\"fix Not enough storage using RDP (Remote Desktop)\" loading=\"lazy\"></p> </blockquote> <blockquote><p> 2. Beri nama nilai baru <strong> IRPStackSize </strong> dan pukul <strong> Memasukkan. </strong></p></blockquote> <p><strong> 5. </strong> Pilih <strong> Desimal </strong> , ubah data nilai menjadi <strong> 50 </strong> dan klik <strong> baik </strong> . * </p> <p> * Catatan: Rentang (dalam desimal) untuk parameter, adalah antara 1 dan 50. </p> <p><img src=\"images/image_thumb-3-255.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 6. </strong> <strong> Menutup </strong> editor registri dan <strong> mengulang kembali </strong> Server. * </p> <p> * Catatan penting: Jika setelah restart, Anda menerima pesan kesalahan yang sama, saat Anda menggunakan Remote Desktop Connection, atau ketika Anda mencoba mengakses file bersama di komputer lain, maka terapkan juga modifikasi registri di atas ke komputer Anda. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? </p> <p> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}