{"title":"MEMPERBAIKI: Outlook Menerima kesalahan yang dilaporkan 0x80042108 (Dipecahkan)","content":"<p> Tutorial ini berisi petunjuk langkah demi langkah untuk memperbaiki kesalahan Outlook Menerima Dilaporkan 0x80042108. Kesalahan 0x80042108 Outlook biasanya terjadi saat Anda salah mengetik nama server email POP3 atau karena Anda tidak memiliki akses ke Internet. </p> <p> Masalah adalah detail. Outlook 2003, 2007, 2010 atau Outlook 2013, menampilkan galat berikut selama prosedur Kirim-Terima: &quot;Galat Menerima Dilaporkan (0x80042108): Outlook tidak dapat menyambung ke server email masuk (POP3) Anda. Jika Anda terus menerima pesan ini , hubungi administrator server atau penyedia layanan Internet (ISP) Anda&quot;. </p> <p><img src=\"images/outlookerror_0x80042108-505.png\" alt=\"Outlook Error 0x80042108\" loading=\"lazy\"></p> <p> Kesalahan Outlook &quot;0x80042108&quot; dapat terjadi di semua versi Outlook (2016, 2013, 2010 atau 2007) dan muncul saat program klien email Outlook tidak dapat tersambung ke server email. </p> <h4> Cara Memperbaiki Kesalahan 0x80042108 di Outlook 2007, 2010, 2013 atau 2016. </h4> <h6> Langkah 1. Periksa Koneksi Internet Anda. </h6> <p> Langkah pertama untuk mengatasi kesalahan penerimaan Outlook 80042108, adalah memeriksa konektivitas Internet Anda. Jadi, Buka browser Internet Anda dan kunjungi situs web apa pun untuk memastikan bahwa koneksi Internet Anda berfungsi. </p> <h6> Langkah 2. Verifikasi pengaturan POP3 Mail Server. </h6> <p> Langkah kedua untuk memperbaiki kesalahan penerimaan Outlook 0x80042108, adalah memeriksa apakah Anda telah menentukan pengaturan server email yang benar. Jadi, hubungi penyedia Email Anda dan verifikasi dengannya, bahwa Anda telah mengetik dengan benar Nama Server Email &amp; nomor Port yang masuk. Untuk melihat dan mengubah pengaturan server email: </p> <p> 1. Buka Outlook. <br> 2. Pergi ke <strong> Mengajukan </strong> -&gt; <strong> Pengaturan akun </strong> . </p> <p><img src=\"images/image_thumb-7-811.png\" alt=\"switch Account Mail Merge \" loading=\"lazy\"></p> <p> </p> <p> 3. Dalam <strong> Surel </strong> tab, klik dua kali pada akun email Anda, untuk mengubah/melihat pengaturannya. <br> 4. Verifikasi bahwa Anda telah menyetel nama Server Surat Masuk yang benar pada kotak yang sesuai. <br> 5. Setelah selesai, klik <strong> Lebih Banyak Pengaturan </strong> . </p> <p><img src=\"images/image_thumb-31-256.png\" alt=\"FIX: Outlook Receiving reported error 0x80042108\" loading=\"lazy\"></p> <blockquote><p> </p></blockquote> <p> 6. Klik <strong> Maju </strong> tab dan verifikasi bahwa Anda telah menentukan port yang benar dan pengaturan SSL untuk server masuk (POP3). </p> <p> </p> <p><img src=\"images/image_thumb-33-400.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Setelah selesai klik <strong> baik </strong> dan kemudian tutup semua jendela yang terbuka. <br> 7. Uji Outlook lagi. </p> <h6></h6> <h6> Langkah 3. Periksa pengaturan Antivirus &amp; Firewall Anda. </h6> <p> Jika Anda menggunakan program antivirus dengan fitur pemindaian email, maka <a href=\"https://www.repairwin.com/how-to-disable-add-ins-in-word-outlook-or-excel-2016-2013-2010-2007-or-2003/\" target=\"_blank\" rel=\"nofollow noopener\"> nonaktifkan Add-in Antivirus di Outlook </a> atau nonaktifkan perlindungan Antivirus untuk sementara atau hapus instalan program Antivirus. Selain itu, periksa pengaturan Firewall Anda dan pastikan port server email yang Anda gunakan tidak diblokir dari program Firewall. Lebih khusus lagi, di pengaturan Firewall Anda: </p> <p> A. Aktifkan file berikut untuk mengakses Internet: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Aktifkan port berikut untuk mengakses Internet: </p> <ul> <li><strong> Port 110 </strong> (Jika Anda menggunakan POP3 Incoming Mail Server tanpa koneksi terenkripsi) * </li> <li><strong> Pelabuhan 995 </strong> (Jika Anda menggunakan POP3 Incoming Mail Server dengan koneksi terenkripsi (SSL Diaktifkan) </li> </ul> <ul> <li><strong> Pelabuhan 143 </strong> (jika Anda menggunakan Server Email Masuk IMAP tanpa koneksi terenkripsi) </li> <li><strong> Pelabuhan 993 </strong> (jika Anda menggunakan Server Email Masuk IMAP dengan koneksi terenkripsi (SSL Diaktifkan) </li> </ul> <ul> <li><strong> Pelabuhan 25 </strong> Jika server Surat Keluar SMTP Anda tidak menggunakan SSL. * </li> <li><strong> Pelabuhan 465 </strong> atau <strong> 587 </strong> jika server Surat Keluar SMTP Anda menggunakan SSL </li> </ul> <p> * Catatan: Secara default, port 25 adalah untuk akses keluar, dan port 110 untuk akses masuk. Jika Anda tidak yakin tentang port, hubungi ISP atau administrator sistem Anda. </p> <p> </p> <p><strong> Bantuan tambahan: </strong> Jika metode di atas tidak membantu Anda, cobalah yang berikut ini: </p> <p><strong> SEBUAH. </strong> Hapus dan Tambahkan akun Email Anda lagi. <br> <strong> B </strong><a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Perbaiki file data Outlook PST </a> . <br> <strong> C. </strong> Putus dari Koneksi VPN (jika Anda terhubung) <br> <strong> D. </strong> Perbaikan Instalasi Kantor. Untuk melakukannya: </p> <blockquote><p> 1. Navigasikan ke Windows <strong> Panel kendali </strong> &gt; <strong> Program dan fitur </strong> . <br> 2. Cari dan pilih aplikasi MS Office lalu klik <strong> Perubahan </strong> . <br> 3. Kemudian pilih <strong> Perbaikan </strong> pilihan. </p></blockquote> <p> </p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? </p> <p> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}