{"title":"MEMPERBAIKI: Tidak dapat menyambung ke berbagi file karena tidak aman dan memerlukan protokol SMB1 usang. (Terpecahkan)","content":"<p> Jika Anda mencoba menyambungkan ke folder bersama jaringan dari PC Windows 10, dan Anda menerima pesan kesalahan &quot;Anda tidak dapat menyambung ke berbagi file karena tidak aman. Berbagi ini memerlukan protokol SMB1 usang, yang tidak aman dan dapat mengekspos sistem Anda untuk menyerang. Sistem Anda memerlukan SMB2 atau lebih tinggi. Untuk info lebih lanjut tentang menyelesaikan masalah ini, lihat: https://go.microsoft.com/fwlink/?linkid=852747&quot;, lalu lanjutkan di bawah untuk memperbaiki masalah. </p> <p><img src=\"images/image_thumb-30-812.png\" alt=\"You can't connect to the file share because it's not secure. This share requires the obsolete SMB1 protocol, which is unsafe...\" loading=\"lazy\"></p> <p> Di Windows 10 v1709 dan versi yang lebih baru, protokol jaringan Server Message Block versi 1 (SMBv1) tidak diinstal secara default, dan harus diaktifkan secara manual jika Anda ingin mengakses folder bersama di workstation atau server, yang menggunakan protokol SMBv1 untuk file sharing. </p> <p> Tutorial ini, berisi instruksi untuk mengatasi kesalahan berikut saat mencoba menyambungkan ke folder bersama di Windows 10: </p> <ul> <li> <p><em> Anda tidak dapat terhubung ke berbagi file karena tidak aman. Pembagian ini memerlukan protokol SMB1 usang, yang tidak aman… </em></p> </li> <li> <p><em> Nama jaringan yang ditentukan tidak lagi tersedia </em></p> </li> <li> <p><em> Kesalahan tidak ditentukan 0x80004005 </em></p> </li> <li> <p><em> Server yang ditentukan tidak dapat melakukan operasi yang diminta. </em></p> </li> </ul> <h4> Cara MEMPERBAIKI: Tidak Dapat Terhubung ke Berbagi File karena Protokol SMBv1 Hilang (Windows 10) </h4> <p> 1. Navigasikan ke <strong> Panel kendali </strong> -&gt; <strong> Program dan fitur </strong> . <br> 2. Klik <strong> Mengaktifkan atau menonaktifkan fitur Windows </strong> dari kiri. </p> <p> </p> <p><img src=\"images/image_thumb-68-359.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Perluas opsi &#39;Dukungan Berbagi File SMB 1.0/CIFS&#39; dan <strong> memeriksa </strong> itu <strong> Klien SMB 1.0/CIFS </strong> pilihan. Klik <strong> baik </strong> ketika selesai. </p> <p><img src=\"images/image_thumb-29-360.png\" alt=\"Install SMBv1 Windows 10\" loading=\"lazy\"></p> <p> 4. Ketika SMB 1.0/CIFS sudah terinstall lalu klik tombol <strong> Restart sekarang </strong> tombol untuk me-reboot PC Anda. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}