{"title":"MEMPERBAIKI: VeraCrypt Tidak Merespons (Pembekuan) saat Turun di Windows 10 (Terpecahkan)","content":"<p> Panduan ini berisi instruksi untuk memperbaiki masalah berikut dengan VeraCrypt pada komputer berbasis Windows 10: VeraCrypt tidak merespons dan macet (hang) saat menurunkan volume terenkripsi. </p> <p> Masalah VeraCrypt Not Responding (Freezing) secara detail: Ketika Anda mencoba untuk menurunkan volume (dengan semua file ditutup dari volume yang dipasang), VeraCrypt hang dan menampilkan &quot;Tidak Menanggapi&quot;. Ketika masalah ini muncul, satu-satunya cara untuk mengembalikan Windows ke keadaan normal, adalah dengan mengakhiri proses VeraCrypt dari Task Manager. </p> <p> Menurut <a href=\"https://www.veracrypt.fr/en/Issues%20and%20Limitations.html\" target=\"_blank\" rel=\"nofollow noopener\"> VeraCrypt </a> masalah pembekuan disebabkan oleh konflik antara dialog tunggu VeraCrypt yang ditampilkan selama operasi mount/dismount dan perangkat lunak lain yang diinstal pada mesin (misalnya Antivirus atau Firewall). </p> <h4> Cara memperbaiki: VeraCrypt Tidak Merespons saat Dismounting/Mounting Volume. </h4> <p> Masalah ini disebabkan oleh konflik antara dialog tunggu VeraCrypt yang ditampilkan selama operasi mount/dismount dan perangkat lunak lain yang diinstal pada mesin (misalnya Outpost Firewall Pro). </p> <p> 1. Dari VeraCrypt <strong> Pengaturan </strong> menu, pilih <strong> Preferensi </strong> . </p> <p><img src=\"images/image_thumb-63-122.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Memeriksa </strong> itu <strong> Jangan tampilkan dialog pesan tunggu saat melakukan operasi </strong> klik opsi <strong> BAIK. </strong></p> <p><img src=\"images/image_thumb-64-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Sekarang lanjutkan untuk memasang/melepas volume tanpa membeku! </p> <p> Itu saja! Apakah itu berhasil untuk Anda? Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}