{"title":"MEMPERBAIKI: PELANGGARAN DPC WATCHODOG BSOD ERROR. (Terpecahkan)","content":"<p> Pada komputer berbasis Windows 10, 8 atau 7, kesalahan BSOD berikut mungkin muncul: &quot;DPC_WATCHDOG_VIOLATION&quot;. Masalah layar biru &quot;PELANGGARAN DPC WATCHDOG&quot; umumnya terjadi sesekali, bahkan jika sistem dalam keadaan idle dan umumnya disebabkan oleh driver perangkat yang tidak valid atau rusak dan dalam beberapa kasus lain terkait dengan masalah perangkat keras terutama dengan kartu Grafis. </p> <p><img src=\"images/image_thumb-2-618.png\" alt=\"FIX DPC WATCHDOG VIOLATION BLUE SCREEN ERROR\" loading=\"lazy\"></p> <p> </p> <p> Panduan pemecahan masalah ini berisi beberapa metode untuk menyelesaikan <strong> PELANGGARAN PENGAWAS DPC </strong> Masalah BSOD pada Windows 10, 8/8.1 atau 7 OS. </p> <p> </p> <h2> Cara MEMPERBAIKI PELANGGARAN DPC WATCHDOG Masalah BoSD di Windows 10/8/7. </h2> <p> Masalah layar Biru PELANGGARAN DPC WATCHDOG dapat disebabkan karena beberapa alasan mis. driver perangkat atau perangkat lunak yang salah, RAM atau Disk drive yang rusak, dll. Jadi, untuk menyelesaikan masalah BSOD &quot;DPC WATCHDOG VIOLATION&quot;, ikuti langkah-langkah di bawah ini: </p> <h6> Metode 1. Pindai sistem Anda dari Virus dan Malware. </h6> <p> Langkah pertama untuk mengatasi masalah layar biru &quot;DPC WATCHDOG VIOLATION&quot;, adalah memastikan bahwa sistem Anda bebas virus/malware. Untuk tugas itu, ikuti instruksi dalam panduan ini: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Memindai Komputer Anda dari Virus dan Program Berbahaya lainnya. </a></p> <p> </p> <h6> Metode 2. Copot Perangkat Lunak Antivirus/Keamanan Anda. </h6> <p> Masalah layar biru &quot;DPC WATCHDOG VIOLATION&quot;, mungkin disebabkan setelah pembaruan otomatis program Antivirus/Keamanan Anda (terutama jika Anda menggunakan AVAST atau AVG). Jadi, lanjutkan dan hapus sepenuhnya program antivirus Anda dari sistem Anda dan mulai ulang komputer Anda. <br> – Jika masalah BSOD, tidak terjadi setelah penghapusan antivirus, lanjutkan untuk mengunduh dan menginstal ulang versi terbaru perangkat lunak keamanan Anda di sistem Anda. </p> <p> </p> <h6> Metode 3. Mulai Windows dalam Status Boot Bersih. </h6> <p> Cara selanjutnya, untuk mengatasi masalah BSOD &quot;DPC WATCHDOG VIOLATION&quot; adalah dengan memulai Windows di <a href=\"https://www.repairwin.com/how-to-start-windows-in-clean-boot-state/\" target=\"_blank\" rel=\"nofollow noopener\"> &quot;sepatu bersih&quot; </a> &quot;, untuk mengidentifikasi program mana yang menyebabkan sistem Anda mogok. </p> <p> Untuk memulai Windows dalam status Boot Bersih: </p> <p> 1. Tekan tombol Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> 2. Ketik <strong> msconfig </strong> dan tekan <strong> Memasukkan </strong> . </p> <p><img src=\"images/image_thumb-47-307.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. Pada tab Layanan, <strong> Sembunyikan semua Layanan Microsoft </strong> kotak centang dan kemudian tekan tombol <strong> Menonaktifkan semua </strong> tombol, untuk mencegah semua layanan non-Microsoft dimulai saat startup Windows. </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-257.png\" alt=\"clean boot state\" loading=\"lazy\"></p> <p> 4. Kemudian pilih <strong> Memulai </strong> tab dan <strong> Nonaktifkan </strong> semua program lain yang dimulai saat startup Windows dan berjalan di latar belakang. * </p> <p> * Catatan: Aktif <strong> Windows 10 </strong> atau <strong> 8 </strong> , Pilih <strong> Buka Pengelola Tugas </strong> untuk menonaktifkan program startup. </p> <p><img src=\"images/image_thumb-29-129.png\" alt=\"Windows clean boot\" loading=\"lazy\"></p> <p> </p> <p> 5. Setelah selesai, klik <strong> baik </strong> dan <strong> Mengulang kembali </strong> komputer Anda. <br> 6. Jika setelah restart, komputer Anda berfungsi dengan baik dan tanpa masalah BSOD, maka luncurkan kembali utilitas Konfigurasi Sistem dan aktifkan satu per satu semua item yang dinonaktifkan dan mulai ulang sistem Anda, hingga Anda mengetahui mana yang menyebabkan masalah BSoD. * </p> <p> * Catatan: Untuk <strong> keluar </strong> dari <strong> Bersihkan Boot </strong> negara, luncurkan utilitas Konfigurasi Sistem dan di <strong> Umum </strong> Pilih tab <strong> Startup biasa. </strong></p> <p> </p> <h6> Metode 4. Periksa Memori (RAM) dan Hard Disk (HDD) untuk masalah. </h6> <p> Masalah Blue Screen, mungkin karena modul RAM yang rusak atau hard drive yang buruk. Untuk menguji dan mendiagnosis masalah pada komponen RAM dan HDD Anda, ikuti petunjuk dalam panduan ini: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Mendiagnosis masalah Memori Komputer dengan Memtest86+ </a></li> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Alat Tes &amp; Diagnostik Hard Drive Terbaik untuk Memeriksa Kesehatan Hard Disk </a></li> </ul> <p> </p> <p> </p> <h6> Metode 5. Perbarui Driver Tampilan &amp; Jaringan. </h6> <p> Dalam beberapa kasus, masalah BSOD &quot;DPC WATCHDOG VIOLATION&quot;, terjadi karena pengandar perangkat yang tidak valid atau rusak. Jadi, lanjutkan dan perbarui driver perangkat berikut di komputer Anda: * </p> <p> 1. Adaptor Grafis (VGA). <br> 2. Adaptor Ethernet &amp; adaptor Wi-Fi (jika ada). </p> <p> * Catatan: <br> 1. jika masalah BSOD berlanjut, setelah memperbarui driver di atas, lanjutkan dan perbarui semua driver lain di sistem Anda (Chipset, driver Audio, dll.). <br> 2. Dalam beberapa kasus, kesalahan &quot;DPC_WATCHDOG_VIOLATION&quot; dapat terjadi jika Anda memiliki Solid State Drive (SSD). Jadi, jika Anda memiliki drive SSD, lanjutkan dan perbarui firmware pada drive. Untuk petunjuk tentang cara memperbarui firmware SSD, lihat situs web produsen SSD Anda. </p> <p> </p> <h6> Metode 6. Perbarui Driver iaStor.sys. </h6> <p> 1. Navigasikan ke Pengelola Perangkat. <br> 2. Perluas Pengontrol IDE ATA/ATAPI. <br> 3. Klik dua kali di <strong> Pengontrol SATA/AHCI </strong> . </p> <p><img src=\"images/image_thumb-3-252.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Pilih <strong> Sopir </strong> tab dan klik <strong> Detail pengemudi </strong> . </p> <p><img src=\"images/image_thumb-4-105.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Jika Anda menggunakan <strong> iaStor.sys driver </strong> , lalu klik <strong> baik </strong> dan lanjutkan untuk mengubah driver seperti yang disebutkan di bawah ini, jika tidak lewati langkah selanjutnya. </p> <p><img src=\"images/image_thumb-5-421.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Klik <strong> Perbarui Driver </strong> . </p> <p><img src=\"images/image_thumb-6-840.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Pilih <strong> Jelajahi komputer saya untuk perangkat lunak driver </strong> . </p> <p><img src=\"images/image_thumb-7-251.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Klik <strong> Biarkan saya memilih dari daftar driver perangkat di komputer saya </strong> . </p> <p><img src=\"images/image_thumb-8-330.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Soroti <strong> Pengontrol SATA AHCI Standar </strong> dan klik <strong> Lanjut </strong> . <br> 10. Setelah penginstalan driver selesai, <strong> Menutup </strong> semua jendela terbuka dan <strong> mengulang kembali </strong> komputer Anda. </p> <p> </p> <h6> Metode 7. <strong> Analisis Minidump. </strong></h6> <p> Saat Windows mogok dengan layar biru, menyimpan detail layar BSoD ke file kecil, yang disebut &quot; <strong> MiniDump </strong> &quot;. Analisis dari <strong> Minidump </strong> file(s) dapat membantu Anda untuk memecahkan masalah dan menyelesaikan masalah layar biru. Untuk menyelesaikan tugas ini, ikuti petunjuk dalam artikel ini: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Menganalisis File MiniDump dengan BlueScreenView </a> . </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}