{"title":"MEMPERBAIKI: Pembaruan Windows 10 Tidak dapat menghapus instalan Avira AntiVir (Terpecahkan)","content":"<p> Pada komputer Windows 10, pesan berikut muncul saat mencoba memperbarui Windows 10 ke versi 1803 atau 1809: &quot;Beberapa Aplikasi perlu dihapus: Program ini perlu dihapus karena tidak kompatibel dengan Upgrade: Avira Antivirus&quot; dan saat menekan tombol &quot;Copot pemasangan dan lanjutkan&quot;, kesalahan berikut muncul: &quot;Kami tidak dapat menghapus aplikasi ini: Avira AntiVir&quot;. Lucunya dengan masalah ini, Avira Antivir (Antivirus)-nya tidak terinstal di PC (tidak terdaftar di program yang diinstal). </p> <p><img src=\"images/image_thumb-10-929.png\" alt=\"Windows 10 Update Couldn't uninstall Avira AntiVir\" loading=\"lazy\"></p> <p> Masalah &quot;Tidak dapat menghapus Avira AntiVir&quot; selama pemutakhiran Windows 10 v1803, terjadi karena program pembaruan, menemukan beberapa file di PC Anda yang terkait dengan Antivirus Avira dan tidak dihapus selama Avira Uninstall. * </p> <p> * Catatan: Jika Anda benar-benar menginstal program &quot;Avira Antivirus&quot; di komputer Anda, hapus instalannya menggunakan opsi &quot;Program dan Fitur&quot; di panel kontrol dan kemudian lanjutkan untuk memperbarui sistem Anda ke Windows 10 v1803 (atau 1809). Setelah memutakhirkan, unduh dan instal versi terbaru Avira Antivirus di sistem Anda. </p> <h4> Cara MEMPERBAIKI Kesalahan Pembaruan Windows 10: Tidak Dapat Menghapus Instalasi Avira AntiVir. </h4> <p> </p> <p> 1. Mulai Windows di <strong> Mode aman </strong> . Untuk melakukannya: </p> <ul> <li> <ul> <li> Tekan Windows <img src=\"images/image_thumb8_thumb_thumb-432.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. </li> <li> Tipe <strong> msconfig </strong> dan tekan <strong> Memasukkan </strong> . </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-47-667.png\" alt=\"msconfig\" loading=\"lazy\"></p> <ul> <li> <ul> <li> Di <strong> Boot </strong> tab pilih <strong> Boot Aman </strong> pilihan, lalu klik <strong> baik </strong> dan restart komputer Anda. </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-48-342.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Setelah restart, buka file explorer dan hapus file <strong> avipbb.sys </strong> file dari lokasi berikut: </p> <ul> <li> C:\\Windows\\System32\\drivers </li> <li> C:\\Windows\\SysWOW64\\drivers </li> </ul> <p> </p> <p> 3. Lanjutkan untuk menghapus dari lokasi di atas setiap file lain bernama <strong> avipbb </strong> meskipun ekstensi. </p> <p> 4. Kemudian hapus <strong> Avira </strong> folder dari lokasi berikut: </p> <ul> <li> (Windows 64-bit): C:\\Program Files (x86)\\ <strong> Avira\\Antivirus </strong></li> <li> (Windows 32-bit): C:\\Program Files\\ <strong> Avira\\Antivirus </strong></li> </ul> <p> 5. Jalankan <strong> msconfig </strong> lagi. <br> 6. Pada tab General, klik Normal startup dan klik <strong> baik </strong> , untuk me-restart komputer Anda secara normal. </p> <p><img src=\"images/image_thumb-11-949.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Periksa dan instal pembaruan. * </p> <p> * Catatan: Jika Anda masih menghadapi kesalahan &quot;Tidak dapat menghapus instalan Avira AntiVir&quot; selama pembaruan, maka unduh dan jalankan <a href=\"https://www.avira.com/en/support-download-avira-registrycleaner/1//\" target=\"_blank\" rel=\"nofollow noopener\"> Pembersih Registri Avira </a> . </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}