{"title":"MEMPERBAIKI: Laptop Dell Inspiron Kecepatan CPU Lambat (Terpecahkan)","content":"<p> Tutorial ini berisi instruksi untuk memperbaiki masalah kecepatan CPU yang sangat lambat pada laptop Dell Inspiron 5558. Baru-baru ini, seorang teman saya membawa laptop Dell-nya ke lab saya karena tiba-tiba menjadi terlalu lambat. Sebenarnya, laptop bekerja cepat di masa lalu, tetapi sekarang membutuhkan waktu lama untuk memuat sistem operasi (Windows 10) dan aplikasi. </p> <p> Setelah memeriksa laptop, dan seperti yang Anda lihat pada tangkapan layar di bawah, saya menemukan bahwa CPU selalu berjalan pada 0,48GHz, bukan 2,20GHz. Jadi, saya memulai pemecahan masalah dan akhirnya saya menemukan dua metode berikut untuk menyelesaikan masalah kecepatan CPU yang lambat ... </p> <p> (Kecepatan CPU diturunkan sekitar 85-87% pada laptop Dell) </p> <p><img src=\"images/image_thumb-16-354.png\" alt=\"FIX Dell Laptop Slow CPU Speed\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cara MEMPERBAIKI masalah Kecepatan CPU Lambat pada Laptop Dell. </h4> <h6> Metode 1. Ganti Adaptor Daya AC. </h6> <p> Masalah kecepatan CPU yang lambat, adalah masalah yang diketahui pada laptop Dell, ketika adaptor daya AC tidak dikenali dengan benar dari komputer. Pada kasus ini, dan bahkan jika adaptor daya tampaknya beroperasi dengan baik, pesan peringatan berikut ditampilkan saat Anda menghidupkan laptop &quot;Jenis Adaptor Daya AC tidak dapat ditentukan. Ini akan mencegah kinerja sistem yang optimal&quot;. </p> <p> Jadi, metode pertama untuk mengatasi masalah kinerja lambat Anda pada laptop Dell Anda, adalah mengganti adaptor daya dengan adaptor daya AC Dell baru yang kompatibel. </p> <p> </p> <h6> Metode 2. HENTIKAN Throttling CPU dengan ThrottleStop. </h6> <p> Jika adaptor AC Anda berfungsi dengan baik dan laptop Anda tidak terlalu panas,* maka, metode lain untuk memperbaiki masalah kinerja sistem yang lambat pada laptop Dell Anda, adalah dengan menonaktifkan pelambatan adaptor daya yang tidak dikenal, dengan <strong><a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"> ThrottleStop </a></strong> utilitas. Untuk melakukannya: </p> <p> 1. Unduh <a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> ThrottleStop </strong></a> utilitas dan ekstrak arsip yang Anda unduh. <br> 2. Dari folder hasil ekstrak, klik dua kali untuk menjalankan aplikasi &quot;ThorttleStop.exe&quot;. * <br> 3. <strong> Hapus centang </strong> itu <strong> BD PROCHOT </strong> *** kotak centang dan kemudian klik <strong> Menyimpan </strong> . </p> <p> * Catatan: <br> 1. Untuk memantau suhu CPU, Anda dapat menggunakan <a href=\"https://www.alcpu.com/CoreTemp/\" target=\"_blank\" rel=\"nofollow noopener\"> CoreTemp </a> program. <br> 2. Jika Anda menerima pesan kesalahan &quot;MFC120U.dll was not found&quot; atau &quot;MSVCR120.dll is missing&quot;, setelah menjalankan ThrottleStop, lanjutkan dan instal <a title=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" href=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Paket Visual C++ Redistributable untuk Visual Studio 2013 </a> . ( <strong> Penting: </strong> Jika Anda memiliki Windows 64-bit, Anda perlu menginstal paket Visual C++ versi 64bit &amp; 32bit). <br> 3. BD PROCHOT adalah singkatan dari bi-directional prochot. PROCHOT adalah singkatan dari processor hot yang merupakan sinyal yang diaktifkan di dalam CPU ketika mencapai sekitar 100C hingga 105C tergantung pada nomor model. Sinyal inilah yang memulai pelambatan termal sehingga CPU dapat melambat dan menjaga agar tidak terlalu panas. Menonaktifkan PROCHOT akan memungkinkan CPU Anda terus berjalan dengan kecepatan penuh. (Sumber: <a href=\"http://forum.notebookreview.com/threads/the-throttlestop-guide.531329/\" target=\"_blank\" rel=\"nofollow noopener\"> Panduan ThrottleStop </a> ). </p> <p><img src=\"images/image_thumb-20-666.png\" alt=\"FIX Slow CPU Speed with ThrottleStop\" loading=\"lazy\"></p> <p> 4. Tutup ThrottleStop dan selesai. Sekarang CPU akan berjalan dengan kecepatan penuh, sampai Anda me-restart atau mematikan laptop. * </p> <p> * Catatan: Anda harus menjalankan <strong> ThrottleStop </strong> program setiap kali Anda memulai komputer Anda, jika Anda ingin berjalan dengan kecepatan CPU penuh. Untuk membuat hidup Anda lebih mudah, ikuti langkah-langkah ini <a href=\"https://www.repairwin.com/how-to-start-throttlestop-at-windows-startup/\" target=\"_blank\" rel=\"nofollow noopener\"> panduan </a> untuk memulai ThrottleStop secara otomatis saat startup Windows. </p> <p><img src=\"images/image_thumb-21-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}