{"title":"MEMPERBAIKI: Kesalahan Outlook Express 0x800c0133 Karena Batas Ukuran 2GB dalam file DBX (Dipecahkan)","content":"<p> Tutorial ini berisi instruksi untuk memperbaiki Outlook Express Error 0x800c0133 karena batas ukuran 2GB. Kesalahan 0x800c0133 di OE, terjadi karena salah satu folder Outlook melebihi batas ukuran 2GB. </p> <p> Deskripsi masalah batas ukuran .DBX 2GB di Outlook Express. <br> Ketika salah satu folder Outlook Express utama (misalnya &quot;Kotak Masuk&quot; atau &quot;Terkirim&quot;) berukuran lebih dari 2 GB, OE mengembalikan kesalahan 0x800c0133 selama operasi Kirim/Terima dan terkadang folder OE yang sesuai menjadi kosong (Terkorupsi).* Misalnya, jika folder &quot;Kotak Masuk&quot; (Inbox.dbx), berukuran lebih dari 2 GB, maka OE tidak dapat menerima email baru dan menampilkan kesalahan 0x800c0133. </p> <p> * Catatan: Jika salah satu folder OE kosong, berarti file DBX terkait rusak. Dalam hal ini, coba pulihkan Email Anda dari folder OE yang rusak dengan mengikuti petunjuk dalam artikel ini: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Memulihkan file DBX Outlook Express secara GRATIS </a> . </p> <h4> Bagaimana Memperbaiki masalah Batas 2GB Outlook Express (Kirim / Terima Kesalahan 0x800c0133). </h4> <h6> Langkah 1. Aktifkan Tampilan File Tersembunyi. </h6> <p> 1. Buka Penjelajah Windows. <br> 2. Dari <strong> Alat </strong> pilih menu <strong> Pilihan folder </strong> . <br> 3. Pada tab Lihat, klik <strong> Tampilkan file dan folder tersembunyi </strong> dan klik <strong> BAIK. </strong></p> <p><img src=\"images/image_thumb1_thumb-210.png\" alt=\"image_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Langkah 2. Temukan file Outlook Express 2GB DBX di disk Anda. </h6> <p> 1. Buka folder penyimpanan Outlook Express. Biasanya folder ini terletak di jalur berikut di disk Anda: </p> <ul> <li> C:\\Documents and Settings\\\\Local Settings\\Application Data\\Identities\\{}\\Microsoft\\ <strong> Outlook Ekspres </strong></li> </ul> <blockquote><p> misalnya “C:\\Documents and Settings\\Admin\\Local Settings\\Application Data\\Identities\\{D8F3C56D-965E-41AE-8A23-A58460ABAE00}\\Microsoft\\ <strong> Outlook Ekspres </strong> ” </p></blockquote> <p> 3. Dari Penjelajah <strong> Melihat </strong> pilih menu <strong> rincian </strong> . <br> 4. Temukan file DBX mana yang melebihi batas penyimpanan 2GB. * </p> <p> * Dalam contoh ini, file &quot;Inbox.dbx&quot; melebihi ukuran 2GB. </p> <p><img src=\"images/image_thumb2_thumb-339.png\" alt=\"FIX Outlook Express Error 0x800c0133\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Langkah 3. Pindahkan Email dari folder Oversized Mail ke folder New Mail. </h6> <p> 1. Buka Outlook Express. <br> 2. Pilih folder email yang terlalu besar (dengan ukuran lebih dari 2GB, misalnya folder &quot;Kotak Masuk&quot; pada contoh ini). <br> 3. Jika Anda dapat melihat email Anda di folder itu (folder tidak kosong), maka lakukan sebagai berikut: * </p> <p> * Perhatikan: Jika folder tampak kosong (Anda tidak melihat email apa pun di dalamnya), maka folder OE (dan file DBX terkait) rusak. Dalam hal ini, maka Anda harus memulihkan email Anda dari folder DBX yang rusak dengan mengikuti petunjuk di artikel ini. </p> <p> 4. Di panel kiri, program OE, klik kanan pada folder besar dan pilih <strong> Folder baru </strong> (untuk membuat folder email baru) </p> <p><img src=\"images/image_thumb-6-403.png\" alt=\"outlook express 2gb limit\" loading=\"lazy\"></p> <p> </p> <p> 5. Ketik nama yang dapat dikenali untuk folder baru diikuti dengan satu tahun (mis. &quot;Kotak Masuk-2016&quot;) </p> <p><img src=\"images/image_thumb-7-434.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Kemudian, dari folder besar (mis. dari &quot;Kotak Masuk&quot;), pilih sekelompok email (mis. semua email dari tahun 2016) dan seret dan lepas (pindahkan) ke folder Email baru yang Anda buat sebelumnya (mis. Kotak Masuk-2016&quot;). </p> <p><img src=\"images/image_thumb-8-450.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Ulangi langkah yang sama (misalnya, buat folder berbeda berdasarkan tahun, dan pindahkan email dari folder besar ke folder baru). * </p> <p> * Pemberitahuan: Jika Anda menghadapi masalah selama operasi pemindahan (misalnya jika Anda tidak dapat memindahkan beberapa pesan ke folder baru), maka: </p> <blockquote><p> 1. Tutup Outlook Express. <br> 2. Salin (backup) folder &quot;Outlook Express&quot; dari lokasi OE Store ke tujuan lain di disk Anda. <br> 3. Kemudian ikuti petunjuk pada langkah-4 untuk menghapus file .dbx yang terlalu besar. <br> 4. Buka Outlook Express. <br> 5. Impor email dari folder cadangan OE (Dari <strong> Mengajukan </strong> menu pergi ke -&gt; <strong> Impor </strong> <strong> Pesan </strong> -&gt; <strong> Microsoft Outlook Express 6 </strong> -&gt; <strong> Impor email dari direktori toko OE… </strong> ). ** </p> <p> ** Jika Anda masih menghadapi masalah selama impor, ikuti petunjuk pada artikel ini untuk memperbaiki file DBX yang rusak. </p></blockquote> <p> </p> <p> 8. Ketika Anda selesai dengan transfer email dan folder 2GB menjadi kosong dari email (misalnya &quot;Kotak Masuk&quot; dalam contoh ini), maka lanjutkan ke langkah berikutnya. </p> <p><img src=\"images/image_thumb-10-811.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Langkah 4. Hapus file Outlook Express DBX yang terlalu besar dari disk Anda. </h6> <p> 1. Buka folder penyimpanan Outlook Express di disk Anda. <br> 2. Hapus file DBX yang terlalu besar (misalnya &quot;Inbox.dbx&quot; dalam contoh ini). </p> <p><img src=\"images/image_thumb-9-996.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Luncurkan Outlook Express. <br> 4. OE akan membuat (secara otomatis) folder email baru yang bersih dan sehat untuk menyimpan email. * </p> <p> * Catatan: Jika Anda masih menerima kesalahan yang sama, coba perbaiki folder OE yang rusak dengan mengikuti petunjuk di artikel ini: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Memulihkan file DBX Outlook Express secara GRATIS </a> . </p> <p> Itu saja! Apakah itu berhasil untuk Anda? </p> <p> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}