{"title":"MEMPERBAIKI: Koneksi Desktop Jarak Jauh Tidak Dapat Terhubung karena sudah ada sesi konsol yang sedang berlangsung (Terpecahkan).","content":"<p> Pesan kesalahan pada Sambungan Desktop Jarak Jauh &quot;Komputer Anda tidak dapat terhubung ke sesi konsol lain di komputer jarak jauh karena Anda sudah memiliki sesi konsol yang sedang berlangsung&quot;, muncul karena komputer lokal dan komputer jarak jauh memiliki Alamat IP yang sama. Masalah biasanya terjadi ketika Anda mencoba menghubungkan dari jarak jauh ke komputer lain melalui koneksi VPN, dan Anda telah &quot;menerima&quot; alamat IP yang sama dari router lokal Anda, sebagai komputer jarak jauh. Untuk memperbaiki masalah, ikuti petunjuk di bawah ini. </p> <p> </p> <p><img src=\"images/image_thumb-7-243.png\" alt=\"Remote Desktop Connection Could Not Connect because already have a console session in progress\" loading=\"lazy\"></p> <h4> Cara MEMPERBAIKI kesalahan RDP: Remote Desktop tidak dapat terhubung ke sesi konsol lain karena sudah ada sesi konsol yang sedang berlangsung. </h4> <p> Masalah di Koneksi Desktop Jarak Jauh &quot;Tidak Dapat Terhubung ke sesi konsol lain karena Anda sudah memiliki sesi konsol yang sedang berlangsung&quot; biasanya terjadi ketika komputer lokal menerima secara acak (dari server DHCP), alamat IP yang sama dengan Alamat IP remote komputer yang ingin Anda hubungkan melalui RDP. </p> <p> Satu-satunya cara untuk memperbaiki, masalah di atas, adalah dengan menonaktifkan Auto Assign IP Address dari DHCP Server, di komputer lokal dan menentukan IP Address secara manual. Untuk melakukannya: </p> <p> 1. <strong> Klik kanan </strong> di <strong> Jaringan </strong> ikon <img src=\"images/image_thumb-42-527.png\" alt=\"image\" loading=\"lazy\"> di Taskbar dan klik <strong> Buka Jaringan dan Pusat Berbagi. </strong> * </p> <p><img src=\"images/image_thumb-104-485.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Pilih <strong> Ethernet </strong> (atau Wi-Fi) di sebelah kiri, lalu di bagian &#39;Pengaturan terkait&#39;, klik <strong> Ubah opsi adaptor </strong> . </p> <p><img src=\"images/image_thumb-43-117.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Klik dua kali </strong> di Adaptor Jaringan aktif (Ethernet atau Wi-Fi) dan klik <strong> rincian </strong> . </p> <p><img src=\"images/image_thumb-8-177.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Catat detail Alamat IP pada kolom berikut, lalu klik <strong> Menutup </strong> : </p> <ul> <li> Alamat IPv4 </li> <li> Subnet Mask IPv4 </li> <li> Gerbang Default IPv4 </li> <li> Server DNS IPv4 </li> </ul> <p><img src=\"images/image_thumb-9-793.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Sekarang, klik <strong> Properti </strong> . </p> <p><img src=\"images/image_thumb-10-628.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Pilih <strong> &#39;Protokol Internet Versi 4 (TCP/IPv4) </strong> &#39; dan klik <strong> Properti </strong></p> <p><img src=\"images/image_thumb-106-954.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 7. Pada properti Internet Protocol Version 4 (TCP/IPv4), terapkan pengaturan berikut: </p> <p> A. Pilih <strong> Gunakan Alamat IP berikut: </strong></p> <blockquote><p> 1. Pada kolom Alamat IP, ketik a <strong> Alamat IP yang berbeda dari Alamat IP yang Anda perhatikan sebelumnya </strong> . (Ubah hanya angka terakhir ke nilai yang lebih tinggi). <br> 2. Pada Subnet mask yang diajukan, ketik Alamat IP Subnet yang sama dengan yang Anda perhatikan sebelumnya. <br> 3. Pada Default Gateway, ketik Default Gateway yang sama dengan yang Anda perhatikan sebelumnya. </p></blockquote> <p> B. Pilih <strong> Gunakan alamat server DNS berikut </strong> : </p> <blockquote><p> 1. Pada Preferred DNS Server, ketikkan DNS Address yang Anda perhatikan sebelumnya. </p></blockquote> <p> C. Setelah selesai, klik <strong> baik </strong> dua kali dan <strong> Menutup </strong> untuk menutup properti Adaptor. </p> <blockquote> <p><img src=\"images/image_thumb-11-850.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 8. Sekarang, coba sambungkan ke komputer Remote Desktop. Masalahnya harus diselesaikan. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}