{"title":"MEMPERBAIKI: Tab Lembar Excel Hilang di bagian bawah Buku Kerja. (Terpecahkan)","content":"<p> Beberapa hari yang lalu, salah satu klien saya mengatakan kepada saya bahwa tab lembar hilang di salah satu buku kerja Excel. Setelah menyelesaikan masalah &quot;tab Excel yang hilang&quot; di komputernya, saya memutuskan untuk menulis tutorial dengan langkah-langkah terperinci yang saya ikuti untuk memulihkan tab lembar yang hilang dari file Excel. </p> <p><img src=\"images/image_thumb-52-600.png\" alt=\"FIX: Excel Sheets are Missing at the bottom of a Workbook\" loading=\"lazy\"></p> <p> Artikel ini memberikan instruksi mendetail untuk mengatasi masalah &quot;lembar yang hilang&quot; di Buku Kerja Excel. </p> <h4> Cara Memperbaiki: Tab Lembar Kerja Excel tidak Terlihat. </h4> <p> Jika Anda tidak dapat melihat tab di Buku Kerja Excel, coba yang berikut ini: </p> <h6> Metode 1. Atur semua jendela buku kerja yang aktif. </h6> <p> 1. Pergi ke <strong> Melihat </strong> tab dan klik <strong> Atur Semua. </strong></p> <p><img src=\"images/image_thumb-47-872.png\" alt=\"Fix missing excel tabs\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Pilih <strong> ubin </strong> dan <strong> Jendela buku kerja aktif </strong> dan klik <strong> BAIK. </strong></p> <p><img src=\"images/image_thumb-48-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Jika Anda melihat tab yang hilang, klik <strong> Menyimpan </strong> untuk menyimpan tampilan saat ini, jika tidak lanjutkan di bawah. </p> <p> </p> <h6> Metode 2. Mengungkapkan Lembar Kerja Excel Tersembunyi. </h6> <p> 1. Untuk membuka Lembar Kerja Excel yang tersembunyi, letakkan mouse Anda di <strong> 3 titik </strong><img src=\"images/image_thumb-41-979.png\" alt=\"image\" loading=\"lazy\"> di bilah bawah sampai Anda melihat <strong> panah berkepala dua </strong><img src=\"images/image_thumb-42-990.png\" alt=\"image\" loading=\"lazy\"> . </p> <p><img src=\"images/image_thumb-49-473.png\" alt=\"reveal hidden sheets excel\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Klik </strong> pada panah berkepala dua <img src=\"images/image_thumb-44-186.png\" alt=\"image\" loading=\"lazy\"> dan <strong> seret mouse Anda ke kanan </strong> hingga Anda melihat semua tab buku kerja Excel Anda. </p> <p><img src=\"images/image_thumb-50-847.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Jika tab tersembunyi terlihat lagi, klik <strong> Menyimpan </strong> untuk menyimpan tampilan ini, jika tidak lanjutkan di bawah. </p> <p> </p> <h6> Metode 3. Aktifkan opsi &#39;Tampilkan tab lembar&#39;. </h6> <p> Jika lembar Excel tidak terlihat setelah menerapkan hal di atas, periksa pengaturan &quot;Tampilkan tab lembar&quot; di opsi Excel. Untuk melakukannya: </p> <p> 1. Pergi ke <strong> Mengajukan </strong> menu dan pilih <strong> Pilihan </strong> . </p> <p> 2. Pilih <strong> Maju </strong> tab di kiri dan di kanan, di bawah <b> Tampilkan opsi untuk buku kerja ini, centang </b> itu <b> Tampilkan tab lembar </b> kotak dan klik <strong> BAIK. </strong></p> <p><img src=\"images/image_thumb-51-664.png\" alt=\"show sheet tabs excel\" loading=\"lazy\"></p> <p> 3. Klik <strong> Menyimpan </strong> untuk menyimpan tampilan ini. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang ini. </p>"}