{"title":"MEMPERBAIKI: File tidak memiliki aliran audio atau video di Adobe Premiere.","content":"<p> Jika Anda menerima kesalahan Adobe Premiere &#39;File Import Failure&#39; dengan deskripsi &quot;The file has no audio or video steams&quot; mungkin muncul saat mengimpor file video MP4, lanjutkan membaca di bawah. Kesalahan &quot;File tidak memiliki audio atau video steams&quot; di Adobe Premiere, mungkin muncul meskipun video diputar dengan benar di pemutar media lain (VLC, Windows Media Player, dll.). </p> <p><img src=\"images/image_thumb-43-349.png\" alt=\"FIX: File has no audio or video streams on Adobe Premiere\" loading=\"lazy\"></p> <p> </p> <p> Kesalahan Adobe Premiere, saat mengimpor file video mungkin muncul karena beberapa alasan, jadi dalam tutorial ini Anda akan menemukan semua metode yang tersedia untuk memperbaiki masalah. </p> <h4> Cara memperbaiki: &quot;File tidak memiliki audio atau video steams&quot; di Adobe Premiere. </h4> <h6> Metode 1. Instal QuickTime. </h6> <p> Pertama-tama, pastikan Anda telah menginstal yang terbaru <a href=\"https://support.apple.com/downloads/quicktime\" target=\"_blank\" rel=\"nofollow noopener\"> Waktu cepat </a> versi di PC Anda dan kemudian coba impor file mp4 di Adobe Premiere. </p> <p> </p> <h6> Metode 2. Ganti nama file Video. </h6> <p> 1. Buat salinan file video mp4 di lokasi lain di PC Anda. (mis. di Desktop Anda) <br> 2. Ganti nama file video sebagai berikut: </p> <blockquote><p> Sebuah. Berikan nama file yang lebih pendek pada file video, dan… <br> b. Hapus semua karakter khusus dari namanya. (garis bawah, kurung, dll). </p></blockquote> <p> 3. Buka file video di Adobe Premiere. </p> <p> </p> <h6> Metode 3. Ubah Ekstensi Nama File dari MP4 ke MOV. </h6> <p> Metode selanjutnya untuk melewati kesalahan Adobe Premiere &quot;File tidak memiliki aliran audio atau video&quot;, adalah mengubah ekstensi file video, dari .mp4 menjadi .mov (atau sebaliknya). Untuk melakukannya: </p> <p> 1. Di File Explorer, klik <strong> Melihat </strong> -&gt; <strong> Pilihan </strong> -&gt; <strong> Ubah folder dan opsi pencarian </strong> . </p> <p><img src=\"images/image_thumb-45-776.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Di <strong> Melihat </strong> tab, <strong> bersih </strong> kotak &quot;Sembunyikan ekstensi untuk jenis file yang dikenal&quot; dan klik <strong> baik </strong> . * </p> <p> * Catatan: Untuk membuat pengaturan ini permanen, klik &#39;Terapkan ke folder&#39;, sebelum mengklik OK. </p> <p><img src=\"images/image_thumb-46-490.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Sekarang, lanjutkan dan ganti nama / ubah ekstensi file video, sebagai berikut: </p> <ul> <li> Jika file video dalam format MP4 (.mp4), ubah ekstensinya menjadi .mov </li> <li> Jika file video dalam format MOV (.mov), ubah ekstensinya menjadi .mp4 </li> </ul> <p><img src=\"images/image_thumb-47-586.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Terakhir, buka file video di Adobe Premiere. </p> <p> </p> <p> </p> <h6> Metode 4. Hapus Database Cache Media dan File Cache. </h6> <p> Saat Anda mengimpor file media (Video atau Audio), dan saat bekerja dengan file ini di Adobe Premiere, program akan membuat file cache media untuk kinerja yang lebih cepat. Selain itu, program membuat tautan untuk file cache ini di Media Cache Database. Selama waktu tersebut, file cache media dan database Media Cache ini mungkin menjadi terlalu besar atau rusak dan perlu dibersihkan untuk menghindari masalah. </p> <p> Jadi, cara selanjutnya untuk mengatasi &quot;File has no audio or video streams&quot; di Premiere, adalah membersihkan &quot;Database Cache Media&quot; dan menghapus file cache. Untuk melakukannya: * </p> <p><strong> A. Cara Membersihkan Database Cache Media Adobe Premiere. </strong></p> <p> 1. Buka Adobe Premiere. <br> 2. Dari menu pergi ke <strong> Sunting </strong> -&gt; <strong> Preferensi </strong> -&gt; <strong> Media. <br> </strong> 3. Pada Media Cache Database klik tombol <strong> Bersih </strong> tombol. </p> <p><img src=\"images/image_thumb-48-167.png\" alt=\"Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> 4. <strong> Mengulang kembali </strong> Adobe Premiere dan coba buka file videonya. jika kesalahan &quot;File tidak memiliki aliran audio atau video&quot; tetap ada, lanjutkan untuk membersihkan file cache Adobe Premiere dengan mengikuti petunjuk di bawah ini: </p> <p><strong> B. Cara Menghapus File Cache Media Adobe Premiere. </strong></p> <p> 1. <strong> Buka </strong> Adobe Premier. <br> 2. Dari menu pergi ke <strong> Sunting </strong> -&gt; <strong> Preferensi </strong> -&gt; <strong> Media. <br> </strong> 3. Pada File Cache Media klik <strong> Jelajahi </strong> tombol, atau catat lokasi file cache media. </p> <p><img src=\"images/image_thumb-49-331.png\" alt=\"FIX: Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Menutup </strong> Adobe Premier. <br> 5. Di Penjelajah Berkas, <strong> menghapus </strong> semua isi folder &quot;File Cache Media&quot;. <br> 6. Impor file video di Premiere. </p> <p> </p> <h6> Metode 5. Enkode ulang File Video. </h6> <p> Metode terakhir untuk menyelesaikan &quot;File tidak memiliki aliran audio atau video&quot; dalam proses pengimporan Adobe Premiere, adalah dengan menyandikan ulang file video. Untuk melakukannya: </p> <p> 1. Unduh dan instal <a href=\"https://handbrake.fr/downloads.php\" target=\"_blank\" rel=\"nofollow noopener\"> rem tangan </a> . <br> 2. Buka Rem Tangan dan klik <strong> File – Buka satu file video </strong> . </p> <p><img src=\"images/image_thumb-50-634.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Pilih file video yang tidak dapat Anda impor di Adobe Premiere dan klik <strong> Buka </strong> . <br> 4. Atur format output ke <strong> MP4, </strong> lalu klik <strong> Jelajahi </strong> dan tentukan lokasi penyimpanan dan nama file dari file video keluaran (dikodekan ulang). </p> <p><img src=\"images/image_thumb-51-817.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. At <strong> Ukuran </strong> tab, atur dimensi yang sama dengan file sumber. <br> 6. Setelah selesai, klik <strong> Mulai Enkode. </strong></p> <p><img src=\"images/image_thumb-52-713.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Setelah proses encoding selesai, tutup Handbrake. <br> 7. Buka file video yang dikodekan ulang di Adobe Premiere. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}