{"title":"MEMPERBAIKI: Drive Ditampilkan Dua Kali di Panel Navigasi Windows 10 (Terpecahkan)","content":"<p> Dalam tutorial ini Anda akan mendapatkan petunjuk untuk memperbaiki masalah aneh berikut di Windows 10: Drive ditampilkan dua kali di Navigation Pane. Tampilan duplikat drive di panel navigasi, adalah fitur baru Windows 10, yang membantu pengguna menjelajahi konten dengan mudah. drive yang terpasang, tanpa harus memperluas menu &quot;This PC&quot;. Tetapi fitur ini menjadi mengganggu, karena jika Anda menggunakan menu &quot;PC ini&quot; untuk tetap terbuka, drive yang sama ditampilkan dua kali di panel navigasi. </p> <p><img src=\"images/image_thumb-22-749.png\" alt=\"Drives Displayed Twice in Navigation Pane of Windows 10\" loading=\"lazy\"></p> <p> Jika Anda melihat entri duplikat dari drive USB yang terpasang atau drive tetap di Windows 10, ikuti petunjuk di bawah ini untuk menyelesaikan masalah. </p> <h4> Cara Menghapus Duplikat Drive Letters di Windows 10 Explorer (Menu Navigasi). </h4> <p> Untuk mencegah Windows 10, untuk menampilkan dua kali drive yang terpasang atau tetap, terapkan tweak registri berikut ini: </p> <p> 1. Buka Peninjau Suntingan Registri. untuk melakukannya: </p> <blockquote><p> 1. Tekan Windows <img src=\"images/image_thumb8_thumb_thumb-493.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> 2. Di kotak Pencarian, ketik <strong> regedit </strong> dan tekan <strong> Memasukkan </strong> untuk meluncurkan Editor Registri. </p></blockquote> <p><img src=\"images/image_thumb7-138.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Kemudian arahkan ke kunci registri ini: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Desktop\\NameSpace\\DelegateFolders </li> </ul> <p> 3. Kemudian klik kanan dan hapus <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> kunci. </p> <p><img src=\"images/image_thumb-23-428.png\" alt=\"remove duplicate drive entries windows 10 navigation pane\" loading=\"lazy\"></p> <p> </p> <p> 4. Kemudian arahkan ke tombol ini: * </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Desktop\\NameSpace\\DelegateFolders </li> </ul> <p> 5. Hapus <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> kunci. </p> <p> 6. Tutup Penyunting Registri. </p> <p> * Catatan: Jika Anda tidak dapat melihat kunci &quot;WOW6432Node&quot;, maka abaikan langkah 4 &amp; 5 di atas, karena hanya berlaku untuk Windows 10 versi 64bit. </p> <p><strong> TIP: </strong> Jika Anda mengubah keputusan Anda di masa mendatang, cukup klik kanan di &#39;DelegateFolders&#39; di lokasi registri di atas, pilih <strong> Baru </strong> -&gt; <strong> Kunci </strong> , dan buat ulang yang dihapus <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> kunci. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}