{"title":"MEMPERBAIKI: HDMI Tidak Ada Suara ke TV atau HDMI Tidak ditampilkan di perangkat Pemutaran (Terpecahkan).","content":"<p> Jika Anda telah menghubungkan TV ke laptop menggunakan kabel HDMI dan tidak ada output suara saat memutar video, atau HDMI tidak ditampilkan sebagai perangkat Pemutaran, lanjutkan membaca tutorial ini. </p> <p> Masalah secara detail: Pada laptop yang menjalankan Windows 10, perangkat Output Digital (HDMI) tidak terdaftar sebagai perangkat Pemutaran dan tidak ada output suara saat terhubung ke TV dengan kabel HDMI. </p> <p> Masalah &quot;Tidak ada output suara dari HDMI&quot; di Windows 10, mungkin muncul karena beberapa alasan, jadi dalam panduan ini Anda akan menemukan petunjuk langkah demi langkah untuk memecahkan masalah. </p> <h2> Cara MEMPERBAIKI: Tidak Ada Output Suara dari HDMI &amp; HDMI Tidak Ditampilkan di Perangkat Pemutaran di Windows 10* </h2> <p> * Saran: Sebelum Anda melanjutkan ke langkah-langkah di bawah ini: </p> <ul> <li><strong> Klik kanan </strong> pada <strong> ikon suara </strong><img src=\"images/image_thumb-11-109.png\" alt=\"image\" loading=\"lazy\"> di bilah tugas untuk <strong> Buka Pengaduk Volume </strong> dan memastikan bahwa <strong> Perangkat Keluaran Digital </strong> tidak dimatikan. </li> <li> Pastikan kabel HDMI terhubung dengan benar baik di laptop maupun di TV. </li> <li> Setelah menghubungkan kabel HDMI, <strong> mengulang kembali </strong> komputer Anda. </li> <li> Di TV, atur Port HDMI yang benar sebagai perangkat input video. </li> <li> Jika Anda memiliki laptop, tutup penutupnya atau tekan tombol Daya sekali, untuk mengalihkan laptop Anda ke mode tidur. Kemudian tekan lagi tombol daya dan periksa kembali suara dari HDMI. </li> <li> Periksa apakah masalah berlanjut, dengan kabel HDMI lain. </li> </ul> <p> </p> <h3> Langkah 1. Atur HDMI sebagai Perangkat Pemutaran Default. </h3> <p> Langkah pertama untuk menyelesaikan masalah Audio HDMI di Windows 10, adalah mengatur HDMI sebagai perangkat Audio Default. </p> <p> 1. Navigasikan ke Windows <strong> Panel kendali </strong> dan buka <strong> Suara. </strong></p> <p><img src=\"images/image_thumb-14-686.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Pastikan bahwa <strong> Hasil digital </strong> (HDMI) adalah <strong> default </strong> perangkat pemutaran, jika tidak pilih <strong> Hasil digital </strong> perangkat dan klik <strong> Set standar </strong> tombol. Setelah selesai, putar video untuk menguji suara HDMI dan jika masalah berlanjut, lanjutkan ke langkah berikutnya. * </p> <p><img src=\"images/image_thumb-43-106.png\" alt=\"FIX: HDMI No Sound Output \" loading=\"lazy\"></p> <p> </p> <p> * Catatan: Coba yang berikut ini, sesuai dengan kasus Anda: </p> <p> 1. Jika <strong> Hasil digital </strong> perangkat adalah <strong> dengan disabilitas </strong> , klik kanan padanya dan klik <strong> Memungkinkan </strong> . Kemudian sorot dan tekan <strong> Set standar </strong> . </p> <p><img src=\"images/image_thumb-44-233.png\" alt=\"FIX: HDMI Not Listed in Playback devices \" loading=\"lazy\"></p> <p> 2. Jika perangkat Output Digital tidak ditampilkan sebagai perangkat Pemutaran: </p> <blockquote><p> Sebuah. Klik kanan pada ruang kosong dan pastikan keduanya <strong> Tampilkan Perangkat yang Dinonaktifkan </strong> dan <strong> Tampilkan perangkat Terputus </strong> opsi dipilih (dicentang). Jika salah satu opsi di atas tidak dipilih, maka klik untuk memilihnya. </p></blockquote> <p><img src=\"images/image_thumb-45-410.png\" alt=\"Enable HDMI DIgital Output\" loading=\"lazy\"></p> <blockquote><p> b. Kemudian klik kanan pada perangkat Output Digital dan pilih <strong> Memungkinkan. <br> c. </strong> Setelah selesai, tetapkan sebagai <strong> default </strong> itu <strong> Hasil digital </strong> alat. </p> </blockquote> <h3><br clear=\"all\"> Langkah 2. Putar kembali Driver Kartu Suara. </h3> <p> Dalam beberapa kasus, masalah &quot;HDMI no sound to TV&quot;, mungkin muncul setelah pembaruan driver otomatis. Jadi, lanjutkan dan kembalikan driver audio. </p> <p> 1. Buka <strong> Pengaturan perangkat </strong> . Untuk melakukannya: </p> <blockquote><p> 1. Tekan Windows <img src=\"images/image_thumb8_thumb_thumb-781.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> 2. Di kotak &quot;Buka&quot;, ketik: <strong> devmgmt.msc </strong> &amp; klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb-5-389.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Memperluas </strong> itu <strong> Pengontrol suara, video, dan game. <br> 3. Klik kanan </strong> di <strong> Perangkat Audio Definisi Tinggi </strong> dan pilih <strong> Properti. </strong></p> <p><img src=\"images/image_thumb-17-970.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. Pada tab Driver, klik <strong> Putar Kembali Driver </strong> tombol. <strong> * </strong></p> <p> * Catatan: Jika tombol Roll Back Driver tidak aktif, lanjutkan ke langkah berikutnya. </p> <p><img src=\"images/image_thumb-18-921.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> 5. Pilih alasan pengembalian paket driver dan klik <strong> Iya. </strong></p> <p><img src=\"images/image_thumb-19-748.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Ketika rollback driver selesai, <strong> mengulang kembali </strong> komputer Anda. <br> 5. Setelah restart, lanjutkan dan uji suara dari HDMI. Jika Anda masih tidak dapat mendengar suara di TV Anda, lanjutkan ke langkah berikutnya. </p> <h3> Langkah 3. Ubah Driver Kartu Suara. </h3> <p> Tidak adanya suara sering disebabkan oleh driver kartu suara yang salah. Untuk memperbaikinya, masalah ini: </p> <p> 1. Buka <strong> Pengaturan perangkat. </strong><br> 2. <strong> Memperluas </strong> itu <strong> Pengontrol suara, video, dan game. <br> </strong> 3. <strong> Klik kanan </strong> di <strong> Audio Definisi Tinggi Realtek </strong> perangkat dan pilih <strong> Perbarui Pengandar. <br> </strong></p> <p><img src=\"images/image_thumb-6-937.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Pilih <strong> Jelajahi komputer saya untuk driver. </strong></p> <p><img src=\"images/image_thumb-7-874.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Pilih <strong> Biarkan saya memilih dari daftar driver yang tersedia di komputer saya </strong> . </p> <p><img src=\"images/image_thumb-8-498.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. Pada layar berikutnya, pilih <strong> Perangkat Audio Definisi Tinggi </strong> dan klik <strong> Lanjut. </strong></p> <p><img src=\"images/image_thumb-20-756.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/07/image-10.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 8. Setelah penginstalan driver selesai, <strong> mengulang kembali </strong> komputer Anda. <br> 9. Setelah restart, lanjutkan dan uji suara dari speaker laptop. </p> <h3> Langkah 4. Copot dan Instal Ulang Driver Kartu Suara. </h3> <p> 1. Buka <strong> Pengaturan perangkat. </strong><br> 2. <strong> Memperluas </strong> itu <strong> Pengontrol suara, video, dan game. <br> </strong> 3. <strong> Klik kanan </strong> di <strong> Audio Definisi Tinggi </strong> perangkat dan pilih <strong> Copot pemasangan perangkat. </strong></p> <p><img src=\"images/image_thumb-21-678.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. Setelah uninstall, <strong> mengulang kembali </strong> komputer Anda, dan biarkan Windows menginstal driver suara secara otomatis. Jika ini tidak terjadi, navigasikan ke <strong> Pengaturan </strong> &gt; <strong> Pembaruan dan Keamanan </strong> dan paksa Windows untuk <strong> Periksa pembaruan. </strong></p> <p> </p> <h3> Langkah 5. Copot dan Instal Ulang Adaptor Tampilan. </h3> <p> 1. Buka <strong> Pengaturan perangkat. <br> </strong> 2. <strong> Memperluas </strong> itu <strong> Display adapter. <br> </strong> 3. <strong> Klik kanan </strong> pada adaptor tampilan yang terpasang dan pilih <strong> Copot pemasangan perangkat. </strong></p> <p><img src=\"images/image_thumb-46-871.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. Setelah uninstall, <strong> mengulang kembali </strong> komputer Anda, dan biarkan Windows menginstal driver tampilan secara otomatis. Jika ini tidak terjadi, jika Anda masih menghadapi masalah, navigasikan ke situs dukungan pabrikan laptop Anda dan unduh driver tampilan terbaru sesuai model laptop Anda. </p> <p> Itu saja! Metode mana yang berhasil untuk Anda? Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}