{"title":"MEMPERBAIKI: Layar Hitam Kamera Skype dan masalah Webcam lainnya di Windows 10.","content":"<p> Masalah layar hitam / kosong kamera Skype, adalah salah satu masalah paling umum pada Windows 10, dan dapat disebabkan oleh sejumlah alasan, jadi inilah panduan langkah demi langkah untuk cara memperbaikinya. </p> <p> Di Windows 10, pembaruan baru dapat menyebabkan banyak masalah dengan webcam terintegrasi Anda, dan kamera mungkin tidak berfungsi atau kamera mungkin tidak dikenali di beberapa aplikasi saat berfungsi dengan baik di aplikasi lain. Misalnya, saya telah melihat kasus di mana saat kamera bekerja tanpa masalah di aplikasi Webex dan Zoom, itu menampilkan layar hitam di Skype. </p> <p> Panduan ini berisi petunjuk langkah demi langkah untuk memperbaiki beberapa masalah dengan kamera terintegrasi pada laptop dengan Windows 10: * </p> <ul> <li><em> Webcam/Kamera tidak berfungsi di Windows 10 </em></li> <li><em><em> Kamera Web/Kamera </em> Berhenti bekerja setelah Pembaruan di Windows 10. </em></li> <li><em> Webcam tidak berfungsi pada beberapa aplikasi (Skype, Windows Hello WebEx, dll.). </em></li> <li><em> Webcam menampilkan layar hitam (atau kosong) saat digunakan di Skype. </em></li> <li><em> Webcam Bekerja di Skype tetapi menampilkan layar hitam di jendela pratinjau kamera </em> . </li> <li> Aplikasi tidak dapat mengenali atau menemukan Kamera/Webcam </li> </ul> <p><strong> * Pemberitahuan untuk pemilik Lenovo ThinkPad: </strong> Jika Anda memiliki salah satu model ThinkPad yang tercantum pada tabel di bawah ini, lanjutkan untuk mengunduh dan menginstal ini <a href=\"/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/DC8297800EA7/Integrated%20Camera%20Driver%20Registry%20Patch%20for%20Windows%2010%20(Version%201709%20or%20later)%20-%20ThinkPad\" target=\"_blank\" rel=\"nofollow noopener\"> patch registri dari Lenovo. </a> Patch memperbaiki masalah di mana driver kamera terintegrasi mungkin tidak berfungsi dengan baik setelah memutakhirkan ke Windows 10 versi 1709 atau lebih baru. </p> <p><img src=\"images/image_thumb-30-725.png\" alt=\"THinkpad Registry Fix for Integrated Camera\" loading=\"lazy\"></p> <h2> Cara MEMPERBAIKI: Masalah webcam pada Windows 10. </h2> <p> </p> <h3> Langkah 1. Izinkan Akses Kamera ke Aplikasi. </h3> <p> Di Windows 10, Kamera dan Mikrofon mungkin tidak tersedia untuk aplikasi karena pengaturan Privasi yang mungkin telah diterapkan. Jadi, lanjutkan dan izinkan aplikasi dengan masalah kamera, untuk mengakses kamera Anda. Misalnya, jika Anda menghadapi masalah kamera di Skype, lakukan sebagai berikut: </p> <p> 1. Navigasikan untuk pergi ke <strong> Mulailah </strong> Tidak bisa <img src=\"images/image_thumb-12-696.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Pengaturan </strong> -&gt; <strong> Pribadi </strong> . <br> 2. Pilih <strong> Kamera </strong> di panel kiri, dan di sebelah kanan: </p> <blockquote><p> Sebuah. Memastikan bahwa <strong> Akses kamera untuk perangkat ini </strong> aku s <strong> di. </strong> Jika tidak, klik <strong> Perubahan </strong> dan atur ke <strong> DI. </strong><br> b. Kemudian atur ke <strong> Di </strong> itu <strong> Izinkan aplikasi mengakses sakelar kamera Anda </strong> . </p> <p><img src=\"images/image_thumb-20-105.png\" alt=\"Allow Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Sekarang, gulir ke bawah, dan… </p> <p> c. Jika Anda mengalami masalah layar kamera hitam menyala <strong> Skype </strong> toko aplikasi, gulir ke bawah dan di <strong> Pilih aplikasi Microsoft Store mana yang dapat mengakses kamera Anda </strong> bagian, atur <strong> Skype </strong> untuk <strong> Di. </strong></p> <p><img src=\"images/image_thumb-21-826.png\" alt=\"Allow Store Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> d. Jika Anda melihat jendela layar hitam kamera Anda saat menggunakan <strong> Skype untuk Windows </strong> (aplikasi desktop), lalu pastikan bahwa <strong> Izinkan aplikasi desktop mengakses kamera Anda </strong> beralih adalah <strong> Di </strong> . </p> <p><img src=\"images/image_thumb-22-558.png\" alt=\"Allow Applications to Access Camera Windows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h3> Langkah 2. Periksa apakah Kamera Anda berfungsi dengan baik. </h3> <p> Salah satu langkah pertama dalam memecahkan masalah webcam Anda adalah mengonfirmasi bahwa itu berfungsi di aplikasi Kamera Windows 10. </p> <p> 1. Pada kotak Pencarian, ketik <strong> kamera </strong> untuk membuka aplikasi Kamera. <br> 2. Klik Kaca Pembesar dan cari &quot; <strong> kamera </strong> &quot;. <br> 3. Buka <strong> Kamera </strong> aplikasi </p> <p><img src=\"images/image_thumb-23-730.png\" alt=\"Open Camera app Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Sekarang, sesuai dengan hasilnya, lanjutkan sebagai berikut: </p> <blockquote><p> A. Jika kamera Anda berfungsi, Anda akan melihat gambar Anda di layar. Dalam hal ini, lanjutkan dan periksa kamera Anda di Skype atau di aplikasi lain yang Anda gunakan. Jika Webcam tidak berfungsi atau menampilkan layar hitam, terapkan langkah-langkah di bawah ini secara berurutan: </p> <ol> <li> Mencoba untuk <strong> hapus instalan </strong> dan <strong> instal ulang </strong> aplikasi dengan masalah kamera (mis. Skype). </li> <li> Lanjutkan untuk Mengaktifkan atau Menonaktifkan Mode Server Bingkai di Registri dengan mengikuti petunjuk di <a href=\"#step-3\" target=\"_blank\" rel=\"nofollow noopener\"> langkah-3 </a> . </li> </ol> <p> B. Jika kamera Anda tidak berfungsi baik di aplikasi Kamera, salah satu hal berikut dapat terjadi: </p> <ol> <li> Driver perangkat kamera salah atau rusak. Pada kasus ini lanjutkan untuk memecahkan masalah driver kamera dengan mengikuti petunjuk di <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> langkah-4 </a> . </li> <li> Kamera rusak dan tidak berfungsi sama sekali. Dalam hal ini, pergilah ke bengkel komputer untuk memperbaiki webcam Anda atau gunakan kamera USB eksternal. </li> </ol> </blockquote> <h3></h3> <h3> Langkah 3. Perbaiki masalah Webcam Black Screen di Windows 10 Registry. </h3> <p> Jika kamera dikenali dan berfungsi tanpa masalah di beberapa aplikasi, tetapi tidak berfungsi di aplikasi lain, atau menampilkan layar hitam di Skype, coba nonaktifkan atau aktifkan &quot;Mode Server Bingkai&quot; di registri. </p> <p> 1. Buka Peninjau Suntingan Registri: untuk melakukannya: </p> <blockquote><p> 1. Tekan Windows <img src=\"images/image_thumb41-284.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> 2. Ketik <strong> regedit </strong> dan tekan <strong> Memasukkan </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-845.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> 3. Di Peninjau Suntingan Registri, navigasikan ke kunci berikut di panel kiri: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows Media Foundation\\Platform </li> </ul> <p> 4. <strong> Klik kanan </strong> di ruang kosong di panel kanan dan pilih <strong> Baru -&gt; Nilai DWORD (32-bit). </strong></p> <p><img src=\"images/image_thumb-24-839.png\" alt=\"Fix Webcam black Screen Windows 10\" loading=\"lazy\"></p> <p> 5. Beri nama <strong> AktifkanFrameServerMode </strong> ke nilai baru. <br> 6. Klik dua kali pada nilai yang baru dibuat dan pastikan bahwa data nilai adalah <strong>0</strong> . (Nol). Klik <strong> BAIK. </strong></p> <p><img src=\"images/image_thumb-25-764.png\" alt=\"Fix Webcam issues Windows 10\" loading=\"lazy\"></p> <p> 7. Sekarang, ikuti langkah yang sama di atas (4,5 &amp; 6), dan buat perubahan yang sama pada kunci ini: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows Media Foundation\\Platform </li> </ul> <p> 8. Setelah selesai, <strong> Menutup </strong> Editor Registri dan <strong> mengulang kembali </strong> komputer Anda. <br> 9. Setelah memulai ulang, luncurkan Skype dan periksa apakah masalah dengan WebCam telah terpecahkan. Jika tidak, ikuti langkah yang sama, tetapi kali ini <strong> memungkinkan </strong> itu <strong> AktifkanFrameServerMode </strong> dengan mengubah nilainya dari <strong>0 </strong> untuk <strong> 1 </strong> dan <strong> mengulang kembali </strong> PC Anda lagi. </p> <p> </p> <h3> Langkah 4. Memecahkan Masalah Driver Webcam. </h3> <p> Langkah selanjutnya, untuk memperbaiki masalah Kamera di Windows 10, adalah memutar kembali atau menghapus/menginstal ulang driver Kamera. 1. Buka <strong> Pengaturan perangkat </strong> . Untuk melakukannya: </p> <blockquote><p> 1. Tekan Windows <img src=\"images/image_thumb8_thumb_thumb-696.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> 2. Di kotak &quot;Buka&quot;, ketik: <strong> devmgmt.msc </strong> &amp; klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb-5-837.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Perluas <strong> Bayangkan Perangkat </strong> (atau <strong> Kamera </strong> ) <br> 3. <strong> Klik kanan </strong> pada Anda <strong> Kamera </strong> dan pilih <strong> Properti. </strong></p> <p><img src=\"images/image_thumb-26-673.png\" alt=\"Camera Properties\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 4. Pilih <strong> Sopir </strong> tab dan lanjutkan sebagai berikut sesuai kasus Anda: </p> <blockquote><p> A. Jika Webcam Anda berfungsi sebelumnya, <strong> Putar Kembali Driver </strong> dan <strong> memulai kembali </strong> t PC Anda. Kemudian periksa apakah kamera Anda berfungsi. </p> <p><img src=\"images/image_thumb-27-454.png\" alt=\"Roll Back Driver - Camera\" loading=\"lazy\"></p> <p> </p> <p> B. Jika kamera Anda belum pernah berfungsi sebelumnya, atau jika ini adalah pertama kalinya Anda mencoba kamera Anda (misalnya setelah penginstalan Windows yang baru), coba yang berikut dalam urutan ini: </p> <ol> <li> Klik <strong> Perbarui Driver </strong> opsi, untuk memeriksa driver kamera Anda yang diperbarui. Jika Windows menemukan driver baru, instal, lalu periksa Webcam Anda. Jika tidak… </li> <li> Klik <strong> Copot Perangkat </strong> untuk menghapus instalan Webcam dan kemudian <strong> mengulang kembali </strong> komputer Anda. Setelah restart, periksa apakah kamera Anda berfungsi. Jika tidak… </li> <li> Arahkan ke situs dukungan produsen laptop Anda dan periksa apakah tersedia driver baru untuk Webcam Anda dan instal. </li> </ol> </blockquote> <h3> Bantuan Tambahan untuk memperbaiki Masalah Kamera di Windows 10. </h3> <p> Jika Anda masih memiliki masalah dengan webcam Anda setelah langkah-langkah di atas, coba yang berikut ini: </p> <ol> <li> <p> Instal semua pembaruan Windows 10 yang tersedia ( <strong> Mulailah </strong> -&gt; <strong> Pengaturan </strong> -&gt; <strong> Pembaruan &amp; Keamanan </strong> dan klik <strong> Periksa pembaruan). </strong></p> </li> <li> <p> Perbarui Windows 10 ke versi terbaru dengan menggunakan <strong> Perbarui Asisten. </strong> (Untuk melakukan itu, navigasikan ke ini <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"noopener\"><strong> tautan </strong></a> dan klik <strong> Memperbarui sekarang </strong> tombol). </p> </li> <li> <p><a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"noopener\"><strong> Segarkan Windows 10 </strong> . </a></p> </li> </ol> <p> Itu saja! Apakah itu berhasil untuk Anda? Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}