{"title":"MEMPERBAIKI: Server tidak dapat diakses. Anda mungkin tidak memiliki izin untuk menggunakan sumber daya jaringan ini. Pegangannya tidak valid. (Terpecahkan)","content":"<p> Tutorial ini berisi instruksi untuk memperbaiki kesalahan berikut saat mencoba mengakses folder bersama di jaringan: &quot;Server tidak dapat diakses. Anda mungkin tidak memiliki izin untuk menggunakan sumber daya jaringan ini. Hubungi administrator server ini untuk mengetahui apakah Anda memiliki akses izin. Pegangannya tidak valid.&quot; </p> <p><img src=\"images/image_thumb-5-437.png\" alt=\"You might not have permission to use this network resource\" loading=\"lazy\"></p> <p> </p> <h2> Bagaimana MEMPERBAIKI: Tidak Dapat Mengakses Folder Bersama. Anda mungkin tidak memiliki izin untuk menggunakan sumber daya jaringan ini. Pegangannya tidak valid. </h2> <p> Biasanya, masalah koneksi berbagi file &quot;Anda mungkin tidak memiliki izin untuk menggunakan sumber daya jaringan ini&quot; muncul saat pengguna mencoba mengakses folder bersama jaringan, tanpa izin yang diperlukan. Pada kasus ini dan untuk mengatasi masalah, Anda harus memastikan bahwa pengguna memiliki izin akses yang sesuai pada folder bersama. </p> <p> Namun, jika Anda tahu bahwa izin pengguna pada folder bersama sudah benar dan masalah koneksi &quot;Anda mungkin tidak memiliki izin untuk menggunakan sumber daya jaringan ini&quot; muncul tiba-tiba dan tanpa alasan yang jelas, maka masalahnya mungkin karena instalasi Windows Memperbarui. Pada kasus ini lanjutkan membaca di bawah untuk memperbaiki masalah. </p> <p> * Catatan: Jika Anda menghadapi kesalahan berbagi di pertengahan Januari 2019, maka penyebabnya adalah Pembaruan Keamanan Windows berikut: <a href=\"https://support.microsoft.com/el-gr/help/4480970/windows-7-update-kb4480970\" target=\"_blank\" rel=\"nofollow noopener\"> 8 Januari 2019—KB4480970 (Rollup Bulanan) </a> . </p> <h6> Metode 1. Copot Pembaruan Windows Terbaru. </h6> <p> Di mesin dengan folder bersama: </p> <p> 1. Klik kanan pada ikon &#39;My Computer&#39; dan pilih <strong> Properti </strong> . <br> 2. Klik <strong> pembaruan Windows </strong> . </p> <p><img src=\"images/image_thumb-6-686.png\" alt=\"fix Network Shared Folder is Not Accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. Klik <strong> Pembaruan Terpasang </strong> . </p> <p><img src=\"images/image_thumb-7-999.png\" alt=\"fix cannot access shared folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Urutkan pembaruan berdasarkan tanggal yang diinstal, dengan mengklik <strong> Dipasang Pada. </strong></p> <p><img src=\"images/image_thumb-8-158.png\" alt=\"uninstall windows update\" loading=\"lazy\"></p> <p> </p> <p> 5. Sorot pembaruan terbaru yang diinstal untuk Windows dan klik <strong> Copot pemasangan. </strong> * </p> <p> * misalnya Jika Anda menghadapi kesalahan berbagi di pertengahan Januari 2019, maka lanjutkan dan hapus instalan &quot;Pembaruan Keamanan untuk Microsoft Windows KB4480970&quot;. </p> <p><img src=\"images/image_thumb-9-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Setelah penginstalan selesai, <strong> mengulang kembali </strong> komputer. <br> 7. Setelah restart coba lagi untuk mengakses folder bersama dari mesin klien. Kemudian terapkan tindakan yang disarankan sesuai dengan kasus Anda: </p> <ul> <li><strong> Kasus A: </strong> Jika masalah berlanjut, lanjutkan untuk menghapus semua pembaruan terbaru yang diinstal atau lanjutkan ke <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> metode 2 </a> di bawah. </li> <li><strong> Kasus B: </strong> Jika masalah teratasi, maka cegah pembaruan yang dihapus agar tidak diinstal di masa mendatang. Untuk melakukannya: </li> </ul> <blockquote><p> 1. Navigasikan ke Pembaruan Windows dan <strong> Periksa pembaruan </strong> . <br> 2. Klik pada <strong> Pembaruan Penting </strong> . </p></blockquote> <p><img src=\"images/image_thumb-22-393.png\" alt=\"view important updates\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 3. Klik kanan pada pembaruan yang bermasalah dan klik <strong> Sembunyikan pembaruan </strong> . <br> 4. Terakhir klik <strong> baik </strong> dan kemudian tutup Pembaruan Windows. </p></blockquote> <p><img src=\"images/image_thumb-23-795.png\" alt=\"hide update windows 7\" loading=\"lazy\"></p> <h6> Metode 2. Pulihkan PC Anda ke Kondisi Kerja Sebelumnya. </h6> <p> Di mesin dengan folder bersama: </p> <p> 1. Tekan Windows <img src=\"images/image_thumb8_thumb-632.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> 2. Ketik <strong> rstrui </strong> &amp; klik <strong> baik </strong> untuk meluncurkan Pemulihan Sistem. </p> <p><img src=\"images/rstui-1-300x148-611.png\" alt=\"rstui\" loading=\"lazy\"></p> <p> </p> <p> 3. Klik <strong> Lanjut </strong> di layar pertama. <br> 4. Pilih status kerja sebelumnya (Tanggal/Waktu) dan klik <strong> Lanjut </strong> untuk memulai proses pemulihan. </p> <p><img src=\"images/image_thumb-50-355.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Setelah pemulihan sistem, coba lagi untuk mengakses folder bersama dari mesin klien. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang masalah ini. </p>"}