{"title":"MEMPERBAIKI: Kumpulan folder Outlook tidak dapat dibuka. (TERPECAHKAN)","content":"<p> Tutorial ini berisi instruksi untuk mengatasi kesalahan berikut di Microsoft Outlook: &quot; Tidak dapat memulai Microsoft Outlook. Tidak dapat membuka jendela Outlook. Kumpulan folder tidak dapat dibuka. Server tidak tersedia. Hubungi administrator Anda jika kondisi ini berlanjut&quot;. </p> <p><img src=\"images/image_thumb-404.png\" alt=\"FIX: Cannot start Outlook. The set of folders cannot be opened\" loading=\"lazy\"></p> <p> Kesalahan Outlook &quot;Set folder tidak dapat dibuka&quot;, mungkin muncul di semua versi Outlook dan terjadi saat file data Outlook PST rusak. Untuk memperbaiki masalah, lanjutkan dan perbaiki file data Outlook, dengan petunjuk di bawah ini. </p> <h4> Cara MEMPERBAIKI: Kumpulan folder tidak dapat dibuka di Microsoft Outlook 2013, 2019, 2019. </h4> <p> 1. Navigasikan ke Panel Kontrol Windows. Untuk melakukannya: </p> <blockquote><p> Sebuah. Ketik &quot;panel kontrol&quot; di kotak pencarian Windows <br> b. Klik <strong> Panel kendali </strong> dari hasil. </p></blockquote> <p><img src=\"images/image_thumb-53-338.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> 2. Setel <strong> Dilihat oleh </strong> untuk <strong> Ikon kecil </strong> untuk melihat semua item panel kontrol dan kemudian klik <strong> Surat </strong> . </p> <p><img src=\"images/image_thumb-54-403.png\" alt=\"control panel mail options\" loading=\"lazy\"></p> <p> 3. Klik <strong> File Data </strong> tombol. </p> <p><img src=\"images/image_thumb-1-310.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Perhatikan nama dan lokasi file data &quot;Outlook.pst&quot; dan tutup semua jendela yang terbuka. * </p> <p> * Catatan: Jika Anda memiliki Exchange (akun IMAP) maka Anda akan melihat file data .OST (mis. &quot;Outlook.ost&quot;). Pada kasus ini, paksa Outlook untuk membuat ulang file &quot;Outlook .OST&quot; yang rusak, dengan melakukan hal berikut: </p> <blockquote><p> 1. Klik <strong> Buka Lokasi File </strong> . <br> 2. <strong> Ganti nama </strong> data OST untuk akun yang menyebabkan masalah (jika Anda memiliki lebih dari satu akun IMAP). <br> 3. Buka Outlook untuk membuat ulang file OST… </p> <p><img src=\"images/image_thumb-2-778.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 5. Buka Windows explorer dan cari <strong> scanpst.exe </strong> perbaikan alat di lokasi ini: * </p> <ul> <li> C:\\Program Files\\Microsoft Office\\%OfficeVersion%\\SCANPST.EXE </li> </ul> <p> * Catatan: Di bawah ini disebutkan lokasi file &quot;SCANPST.EXE&quot; sesuai dengan versi Office yang diinstal. Jika Anda tidak dapat menemukan &quot;scanpst.exe&quot; di lokasi di atas, lihat di: </p> <ul> <li> <ul> <li> C:\\Program Files (x86)\\Microsoft Office\\root\\Office16. </li> </ul> </li> </ul> <blockquote><p><strong> Outlook 2013 </strong><br> Windows 32-bit &gt; C:\\Program Files\\Microsoft Office\\Office15 <br> Windows 64-bit &gt; C:\\Program Files (x86)\\Microsoft Office\\Office15 <br> Outlook 64-bit  &gt; C:\\Program Files\\Microsoft Office\\Office15 <br> Klik untuk Menjalankan  &gt;  C:\\Program Files\\Microsoft Office 15\\root\\office15 <br> <strong><br> Outlook 2010 </strong><br> Windows 32-bit &gt; C:\\Program Files\\Microsoft Office\\Office14 <br> Windows 64-bit &gt; C:\\Program Files (x86)\\Microsoft Office\\Office14 <br> Outlook 64-bit &gt;  C:\\Program Files\\Microsoft Office\\Office14 <br> <strong><br> Outlook 2007 </strong><br> Windows 32-bit &gt; C:\\Program Files\\Microsoft Office\\Office12 <br> Windows 64-bit &gt;  C:\\Program Files (x86)\\Microsoft Office\\Office12 </p></blockquote> <p> 6. Klik dua kali untuk <strong> Buka </strong> SCANPST.EXE <br> 7. Klik <strong> Jelajahi </strong> . </p> <p><img src=\"images/image_thumb-55-538.png\" alt=\"scanpst.exe\" loading=\"lazy\"></p> <p> </p> <p> 8. Cari dan pilih file data Outlook yang rusak (mis. Outlook.pst) dan klik <strong> BAIK. </strong></p> <p> 9. Tekan tombol <strong> Pindai </strong> tombol dan bersabarlah sampai Alat Perbaikan Kotak Masuk memperbaiki file yang rusak. * </p> <p> * Catatan: Pada tahap perbaikan akhir Anda akan ditanya apakah Anda ingin membuat cadangan. Jawab &quot; <strong> Iya </strong> &quot; untuk melanjutkan operasi perbaikan. </p> <p><img src=\"images/image_thumb-56-257.png\" alt=\"Outlook Inbox Repair Tool\" loading=\"lazy\"></p> <p> </p> <p> 10. Setelah proses perbaikan selesai, buka Outlook. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}