{"title":"MEMPERBAIKI: Touchpad Tidak Berfungsi atau macet di Windows 10 (Terpecahkan)","content":"<p> Selama beberapa tahun terakhir saya telah memecahkan banyak masalah touchpad di Windows 10 pada beberapa laptop (misalnya touchpad tidak berfungsi, touchpad macet, dll.), jadi saya memutuskan untuk menulis tutorial untuk memecahkan masalah ini. </p> <p> Jika Anda memiliki laptop, maka dari waktu ke waktu Anda mungkin mengalami masalah dengan perangkat touchpad. Terutama jika Anda memiliki Windows 10, touchpad sering kali berhenti berfungsi atau tidak berfungsi dengan baik setelah Anda menginstal pembaruan. Tentu saja masalah touchpad dapat mengindikasikan masalah perangkat keras, tetapi dalam banyak kasus kegagalan fungsi touchpad disebabkan oleh masalah perangkat lunak. </p> <p> Pada Windows 10, touchpad laptop mungkin tidak berfungsi karena berbagai alasan, jadi tutorial ini akan mencakup semua metode untuk menyelesaikan masalah. </p> <h2> Cara MEMPERBAIKI Masalah Touchpad di Windows 10. </h2> <p> Ikuti langkah-langkah ini sebelum melanjutkan dengan metode berikut untuk mengatasi masalah layar sentuh. </p> <ol> <li> Pastikan Windows 10 tidak beku, dengan menekan ALT + CTRL + DEL dan lihat apakah Task Manager terbuka. </li> <li> Jika laptop Anda memiliki kombinasi tombol Fungsi untuk menonaktifkan dan mengaktifkan touchpad. (mis. Fn + F3), lalu tekan kombinasi tombol Fn untuk mengaktifkan panel sentuh. (Pada beberapa laptop, touchpad dapat dihidupkan / dimatikan dengan mengetuk dua kali permukaan touchpad) </li> <li> Hidupkan Kembali komputer Anda. </li> <li> Lakukan shutdown Windows 10 Penuh dan kemudian hidupkan kembali laptop Anda. (Untuk melakukan shutdown penuh: tekan dan tahan tombol <strong> BERGESER </strong> tombol dan kemudian klik <strong> Mulailah </strong> &gt; <strong> Kekuasaan </strong> &gt; <strong> Menutup </strong> ). </li> </ol> <p><strong> </strong></p> <h3> Metode 1. Aktifkan Touchpad di Windows 10. </h3> <p> Windows 10 memiliki kemampuan untuk menonaktifkan atau mematikan touchpad ketika mouse eksternal terhubung. Jadi, lanjutkan dan pastikan Touchpad diaktifkan di pengaturan Touchpad. </p> <p> 1. Navigasikan ke <strong> Mulailah </strong><img src=\"images/image_thumb2_thumb_thumb-670.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menu -&gt; <strong> Pengaturan </strong> <img src=\"images/image_thumb-66-512.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Perangkat. <br> </strong> 2. Pilih <strong> Panel sentuh </strong> di panel kiri, dan di sebelah kanan pastikan sakelar Touchpad diatur ke <strong> DI </strong> dan juga <strong> memeriksa </strong> itu <strong> Biarkan touchpad aktif saat mouse terhubung </strong> pilihan. * </p> <p><img src=\"images/image_thumb-38-467.png\" alt=\"Disable Touchpad Windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Catatan: Jika Anda tidak dapat menemukan di sini sakelar/sakelar Touchpad… </p> <p> 1. Buka <strong> Pengaturan Tambahan </strong> di bawah <strong> Pengaturan terkait </strong> bagian. </p> <ul> <li> Artikel terkait: <a href=\"https://www.repairwin.com/disable-touchpad-option-missing-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Nonaktifkan Opsi Touchpad Hilang di Windows 10. </strong></a></li> </ul> <p><img src=\"images/image_thumb-39-742.png\" alt=\"touchpad additional settings\" loading=\"lazy\"></p> <p> 2. Aktifkan touchpad di opsi Mouse Properties. (Jika touchpad sudah diaktifkan, coba nonaktifkan dan aktifkan lagi.) </p> <p><img src=\"images/image_thumb-31-122.png\" alt=\"enable touchpad windows 10\" loading=\"lazy\"></p> <h3> Metode 2. Atur ulang pengaturan Touchpad di Windows 10. </h3> <p> Metode umum untuk menyelesaikan masalah touchpad di Windows 10, adalah mengatur ulang pengaturan touchpad ke default. </p> <p> 1. Navigasikan ke <strong> Mulailah </strong><img src=\"images/image_thumb2_thumb_thumb-596.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menu -&gt; <strong> Pengaturan </strong> <img src=\"images/image_thumb-66-851.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Perangkat. <br> </strong> 2. Di <strong> Panel sentuh </strong> pilihan <strong> , </strong> gulir ke bawah dan klik <strong> Setel ulang </strong> dibawah <strong> Setel ulang touchpad Anda. * </strong></p> <p><img src=\"images/image_thumb-40-277.png\" alt=\"reset touchpad windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Catatan: Jika Anda tidak dapat melihat <strong> Setel ulang </strong> tombol… </p> <p> 1. Buka <strong> Pengaturan Tambahan </strong> . <br> 2. Klik <strong> Setel Ulang Perangkat </strong> dalam opsi Mouse Properties. </p> <p><img src=\"images/image_thumb-33-928.png\" alt=\"reset touchpad settings windows 10\" loading=\"lazy\"></p> <h3> Metode 3. Copot &amp; Instal ulang driver perangkat Touchpad. </h3> <p> Solusi lain untuk memperbaiki masalah touchpad di Windows 10, adalah menghapus dan menginstal ulang driver touchpad sepenuhnya. </p> <p> 1. Buka <strong> Pengaturan perangkat </strong> . Untuk melakukannya: </p> <blockquote><p> 1. Tekan Windows <img src=\"images/image_thumb8_thumb_thumb-140.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> 2. Di kotak &quot;Buka&quot;, ketik: <strong> devmgmt.msc </strong> &amp; klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb-5-568.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Perluas Mouse dan perangkat penunjuk lainnya. <br> 3. <strong> Klik kanan </strong> di <strong> Panel Sentuh </strong> perangkat dan klik <strong> Copot pemasangan. </strong></p> <blockquote> <p><img src=\"images/image_thumb-34-656.png\" alt=\"uninstall touchpad windows 10\" loading=\"lazy\"></p> </blockquote> <p> 4. Setelah restart, tunggu 4-5 menit hingga Windows menginstal ulang driver touchpad dan periksa apakah touchpad Anda berfungsi. Jika touchpad Anda tidak berfungsi lagi, coba instal drivernya dari situs dukungan pabrikan laptop Anda. </p> <h3> Metode 4. Nonaktifkan dan Aktifkan Touchpad di BIOS. * </h3> <p> * Catatan: Metode ini tidak berlaku untuk semua model laptop, tetapi saya tahu ini berfungsi di banyak laptop ASUS. </p> <p> 1. Matikan laptop Anda sepenuhnya dengan menekan dan menahan tombol SHIFT sambil mengklik <strong> Mulailah </strong> &gt; <strong> Kekuasaan </strong> &gt; <strong> Menutup </strong><br> 2. Nyalakan laptop dan tekan tombol Fungsi yang sesuai untuk masuk ke pengaturan BIOS. (misalnya F2, F10, dll.), <br> 3. Pada pengaturan BIOS, periksa apakah ada pengaturan untuk Touchpad atau Perangkat Penunjuk Internal atau perangkat Trackpad (biasanya pengaturan ini dapat ditemukan di &#39; <strong> Maju </strong> &#39; bagian). Jika begitu, <strong> Nonaktifkan </strong> itu <strong> perangkat panel sentuh </strong> dan <strong> Simpan dan keluar </strong> dari pengaturan BIOS. <br> 4. Biarkan Windows 10 memuat. <br> 5. Matikan &amp; nyalakan kembali laptop Anda. <br> 6. Masuk kembali ke pengaturan BIOS dan ulangi <strong> aktifkan Touchpad </strong> &amp; <strong> Simpan &amp; Keluar </strong> . <br> 7. Setelah boot ke Windows 10, touchpad akan berfungsi. </p> <p><strong> Kesimpulan: </strong> Jika, setelah langkah-langkah di atas, touchpad Anda masih tidak berfungsi, ini menunjukkan masalah perangkat keras. Dalam hal ini, gunakan mouse eksternal atau pergi ke bengkel laptop untuk memperbaiki perangkat touchpad. </p> <p> Itu saja! Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}