{"title":"MEMPERBAIKI: Pengurasan Baterai di Windows 10 (Terpecahkan)","content":"<p> Dengan Windows 10, banyak pengguna mengeluh bahwa baterai laptop mereka cepat habis bahkan dengan penggunaan yang rendah atau bahkan dalam keadaan mati total. Masalah &quot;penguras baterai&quot; di Windows 10 ini terjadi, karena dua alasan dasar. Alasan pertama adalah Windows 10 memuat terlalu banyak aplikasi latar belakang yang menghabiskan daya baterai meskipun tidak digunakan. </p> <p> Alasan selanjutnya, yang menyebabkan baterai terkuras, bahkan dalam keadaan mati total, adalah fitur &quot;Fast Startup&quot;. Windows 10 (dan Windows 8/8.1) telah mengaktifkan secara default fitur &quot;Fast Startup&quot;, yang memungkinkan sistem untuk boot dan memulai lebih cepat. Faktanya, ketika &quot;Fast Startup&quot; diaktifkan, Windows 10 tidak melakukan shutdown sistem penuh dan melanjutkan dari keadaan hibernasi. </p> <p> Dalam tutorial ini Anda akan menemukan petunjuk, untuk mencegah Windows 10 menguras daya baterai. </p> <h4> Cara MEMPERBAIKI masalah Pembuangan Baterai di Windows 10. </h4> <p> </p> <h6> Langkah 1. Cegah Aplikasi Berjalan di Latar Belakang. </h6> <p> Langkah pertama, untuk mengatasi masalah pengurasan baterai di Windows 10, adalah menghindari aplikasi berjalan di latar belakang. Untuk menonaktifkan aplikasi latar belakang: </p> <p> 1. Navigasikan ke <strong> Mulailah </strong> -&gt; <strong> Pengaturan </strong> -&gt; <strong> Pribadi </strong> . <br> 2. Pilih <strong> Aplikasi Latar Belakang </strong> di sebelah kiri, lalu di sebelah kanan, letakkan &quot; <strong> Biarkan aplikasi berjalan di latar belakang&quot; </strong> beralih ke <strong> Mati, </strong> atau pilih satu per satu aplikasi yang tidak ingin Anda jalankan di latar belakang dan matikan. </p> <p><img src=\"images/image_thumb-8-676.png\" alt=\"Prevent Apps from Running in the Background - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Langkah 2. Nyalakan Penghemat Baterai. </h6> <p> Langkah selanjutnya, adalah mengaktifkan penghemat baterai untuk memperpanjang masa pakai baterai dengan membatasi aktivitas latar belakang. </p> <p> 1. Navigasikan ke <strong> Mulailah </strong> -&gt; <strong> Pengaturan </strong> -&gt; <strong> Sistem </strong> . <br> 2. Di <strong> Baterai </strong> pilihan: </p> <blockquote> <p> Sebuah. Klik &quot;Lihat aplikasi mana yang memengaruhi masa pakai baterai Anda&quot;, untuk mengetahui penggunaan baterai dari aplikasi yang terbuka. <br> b. <strong> Memeriksa </strong> &quot; <strong> Hidupkan penghemat baterai secara otomatis jika baterai saya gagal di bawah&quot; </strong> kotak centang, dan pindahkan penggeser ke posisi yang sesuai. <br> c. Selain itu, pilih &quot;Turunkan kecerahan layar saat menggunakan penghemat baterai. </p> </blockquote> <p><img src=\"images/image_thumb-9-289.png\" alt=\"turn on battery saver Windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Langkah 3. Nonaktifkan Fast Startup. </h6> <p> Langkah selanjutnya adalah memaksa Windows 10 untuk shutdown penuh, dengan menonaktifkan fitur fast start. </p> <p> 1. Navigasikan ke <strong> Mulailah </strong> -&gt; <strong> Pengaturan </strong> -&gt; <strong> Sistem </strong> . <br> 2. Di <strong> Kekuasaan </strong> pilihan klik <strong> Pengaturan daya tambahan. </strong></p> <p><img src=\"images/image_thumb-10-405.png\" alt=\"FIX Battery Drain in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Pilih <strong> Pilih fungsi tombol daya buttons </strong> di kiri. </p> <p><img src=\"images/image_thumb-11-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Kemudian klik <strong> Ubah pengaturan yang saat ini tidak tersedia </strong> . </p> <p><img src=\"images/image_thumb-12-235.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> Hapus centang </strong> itu <strong> Aktifkan startup cepat (disarankan) </strong> pilihan dan klik <strong> Simpan perubahan. * </strong></p> <p> * Catatan: Jika opsi fast start up sudah tidak dicentang, maka centang dan restart komputer Anda. Setelah restart hapus centang dan restart komputer Anda lagi. </p> <p><img src=\"images/image_thumb-13-410.png\" alt=\"Turn Off Fast Startup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Mengulang kembali </strong> komputer Anda. </p> <h6></h6> <h6> Langkah 4. Nonaktifkan Hibernasi. </h6> <p> &#39;Hibernate&#39; adalah fitur daya, yang menggunakan lebih sedikit daya daripada mode tidur dan saat Anda menyalakan PC lagi, Anda kembali ke posisi terakhir Anda tinggalkan. Dalam beberapa kasus, fitur hibernasi menyebabkan PC Windows 10 Anda tidak dapat dimatikan sepenuhnya. Untuk menonaktifkan hibernasi: </p> <p> </p> <p> 1. Pada kotak pencarian ketik: <strong> prompt perintah </strong> atau <strong> cmd <br> </strong> 2.  Klik kanan di <strong> Command Prompt dan pilih Run as Administrator </strong></p> <p><img src=\"images/image_thumb-14-379.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Pada command prompt berikan perintah berikut dan tekan <strong> Memasukkan. </strong></p> <ul> <li><strong> powercfg -h mati </strong></li> </ul> <p><img src=\"images/image_thumb-15-234.png\" alt=\"Disable Hibernate Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. <strong> Mengulang kembali </strong> komputer Anda. * </p> <p> * Catatan: Jika Anda ingin mengaktifkan kembali fitur &#39;Hibernate&#39;, ketikkan saja perintah ini di command prompt administratif: </p> <ul> <li> <ul> <li> powercfg -h mati </li> </ul> </li> </ul> <p> </p> <h6> Langkah 5. Ubah Pengaturan Daya pada Adaptor Jaringan. </h6> <p> Metode selanjutnya untuk memperbaiki masalah pengurasan baterai di Windows 10 adalah dengan mengubah pengaturan daya pada adaptor jaringan. </p> <p> 1. Buka <strong> Pengaturan perangkat </strong> . <br> 2. Perluas <strong> Adaptor Jaringan </strong> . <br> 3. Klik kanan pada adaptor jaringan yang diinstal dan pilih <strong> Properti </strong> . <br> 3. Pilih <strong> Manajemen daya </strong> tab. <br> 4. <strong> Hapus centang </strong> itu <strong> &#39;Izinkan perangkat ini untuk membangunkan komputer </strong> &#39; kotak centang dan klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb-7-574.png\" alt=\"modify power settings\" loading=\"lazy\"></p> <h6></h6> <h6> Langkah 6. Kembalikan Driver Antarmuka Mesin Manajemen Intel. </h6> <p> Jika masalah pengurasan baterai muncul setelah menginstal pembaruan Windows 10, maka lanjutkan dan kembalikan driver untuk Antarmuka Mesin Manajemen Intel. Untuk melakukannya: </p> <p> 1.  Tekan Windows <img src=\"images/image_thumb8_thumb_thumb-592.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> 2. Jenis: <strong> devmgmt.msc </strong> &amp; klik <strong> baik </strong> . <br> 3. Perluas <strong> Perangkat sistem </strong> . <br> 4. Klik kanan pada <strong> Antarmuka Mesin Manajemen Intel </strong> dan pilih <strong> Properti </strong> . </p> <p><img src=\"images/image_thumb-5-532.png\" alt=\"device properties\" loading=\"lazy\"></p> <p> </p> <p> 5. Pilih tab Driver dan klik <strong> Putar Kembali Driver </strong> . * </p> <p> </p> <p> * Jika <strong> Putar Kembali Driver </strong> tombol berwarna abu-abu, lalu navigasikan ke situs dukungan pabrikan laptop atau motherboard Anda untuk mengunduh dan menginstal versi driver yang lebih lama untuk Antarmuka Mesin Manajemen Intel. </p> <p><img src=\"images/image_thumb-6-551.png\" alt=\"roll back driver\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Mengulang kembali </strong> komputer Anda. </p> <h6> Langkah 7. Saran Lain untuk Mengatasi masalah Pembuangan Baterai. </h6> <p> 1. Ganti charger laptop dan selalu gunakan charger yang bermerk, untuk memperpanjang umur baterai. <br> 2. Jika baterai laptop Anda sudah tua, mungkin kapasitasnya sudah turun dan harus diganti. Untuk mendiagnosis kesehatan baterai Anda, gunakan <a href=\"http://www.nirsoft.net/utils/battery_information_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> BateraiInfoView </a> utilitas. </p> <p><img src=\"images/image_thumb-16-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang masalah ini. </p>"}