{"title":"MEMPERBAIKI: Komputer Anda tidak dapat menyambung ke sesi konsol lain karena Anda sudah memiliki sesi konsol yang sedang berlangsung. (Terpecahkan)","content":"<p> Pada komputer berbasis Windows, muncul kesalahan berikut di Remote Desktop Connection: &quot;Komputer Anda tidak dapat terhubung ke sesi konsol di komputer jarak jauh karena Anda sudah memiliki sesi konsol yang sedang berlangsung&quot;. </p> <p> </p> <p><img src=\"images/image_thumb-3-627.png\" alt=\"Your computer could no connect to console session on the remote computer because you already have a console session in progress.\" loading=\"lazy\"></p> <p> </p> <p> Tutorial ini berisi instruksi untuk mengatasi kesalahan Sambungan Desktop Jarak Jauh berikut: &quot;Komputer Anda tidak dapat terhubung ke sesi konsol di komputer jarak jauh karena Anda sudah memiliki sesi konsol yang sedang berlangsung&quot;. </p> <h4> Cara MEMPERBAIKI: Koneksi Desktop Jarak Jauh Tidak Dapat Terhubung karena Anda Sudah Memiliki Sesi Konsol yang Sedang Berlangsung. </h4> <p> Kesalahan &quot;Komputer Anda tidak dapat terhubung ke sesi konsol di komputer jarak jauh karena Anda sudah memiliki sesi konsol yang sedang berlangsung&quot;, disebabkan karena salah satu adaptor jaringan di komputer Anda (RDP dari), memiliki alamat IP yang sama dengan komputer yang Anda coba sambungkan, melalui desktop jarak jauh. </p> <p> Misalnya: jika komputer jarak jauh memiliki alamat IP: &quot;192.168.1.157&quot;, ikuti langkah-langkah di bawah ini: </p> <p> 1. Buka <strong> Command Prompt sebagai Administrator </strong> di komputer Anda (RDP dari). <br> 2. Berikan perintah berikut untuk melihat Alamat IPv4 yang ditetapkan pada PC Anda. </p> <ul> <li><strong> ipconfig </strong></li> </ul> <p> </p> <p> 3. Sekarang cari adaptor jaringan mana di komputer lokal Anda (dari RDP), yang memiliki alamat IP yang sama dengan komputer jarak jauh (RDP ke). <br> 4. Saat Anda menemukan adaptor LAN mana di komputer lokal Anda, yang memiliki alamat IP yang sama dengan komputer jarak jauh, lanjutkan dan ubah alamat IP pada adaptor tersebut ke alamat lain. * </p> <p> misalnya Pada contoh ini IP Komputer Jarak Jauh adalah: &quot;192.168.1.157&quot;, jadi kita harus mengubah Alamat IP adaptor Ethernet (di komputer lokal), ke yang lain: mis. ke: &quot;192.168.1.160&quot;. </p> <p><img src=\"images/image_thumb-5-946.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> * Catatan: Jika alamat IP di jaringan lokal Anda ditetapkan oleh server DHCP, maka Anda memiliki opsi berikut untuk melewati masalah: </p> <blockquote><p> Sebuah. Untuk menentukan secara manual alamat IP statis yang berbeda. <br> b. Untuk me-restart router Anda (server DHCP), untuk &quot;mengambil&quot; Alamat IP yang berbeda dari server DHCP. <br> c. Untuk mengkonfigurasi server DHCP (misalnya di router), untuk memberikan alamat IP ke rentang yang tidak menyertakan alamat IP komputer jarak jauh. (mis. &quot;192.168.1.200-192.168.1.250&quot; </p></blockquote> <p> </p> <p> 5. Setelah mengubah alamat IP di komputer lokal Anda (dari RDP), buka koneksi Desktop Jarak Jauh, dan coba sambungkan ke komputer Jarak Jauh. Kesalahan &quot;Komputer Anda tidak dapat terhubung ke sesi konsol lain karena Anda sudah memiliki sesi konsol yang sedang berlangsung&quot; harus diselesaikan. </p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? </p> <p> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}