{"title":"MEMPERBAIKI: Saat ini Anda tidak memiliki izin untuk mengakses folder ini di Drive USB Eksternal (Terpecahkan)","content":"<p> Tutorial ini berisi instruksi terperinci untuk menyelesaikan masalah berikut, ketika mencoba mengakses disk USB eksternal pada laptop HP dengan Windows 10: &quot;Saat ini Anda tidak memiliki izin untuk mengakses folder ini. Klik lanjutkan untuk mendapatkan akses permanen ke folder ini&quot; . Kesalahan tetap ada, bahkan setelah menekan tombol &#39;Lanjutkan&#39; untuk mendapatkan akses ke drive. </p> <p><img src=\"images/image_thumb-18-636.png\" alt=\"You don't have permission to access this folder\" loading=\"lazy\"></p> <p> Kesalahan aneh &quot;Anda tidak memiliki izin untuk mengakses folder ini&quot; muncul di baru <a href=\"http://www8.hp.com/us/en/products/laptops/product-detail.html?oid=17047142\" target=\"_blank\" rel=\"nofollow noopener\"> HP ProBook 450 G5 </a> laptop, ketika pengguna mencoba melihat konten disk USB yang terhubung (Pen drive, Drive USB, dll.). </p> <p> Setelah menyelidiki masalah, saya menemukan bahwa masalah disebabkan dari izin keamanan yang telah diterapkan pada on <a href=\"http://www8.hp.com/us/en/solutions/computer-security.html\" target=\"_blank\" rel=\"nofollow noopener\"> Manajer Keamanan Klien HP </a> program. HP Client Security Manager, adalah program yang dikembangkan dari Hewlett-Packard dan memungkinkan Anda melindungi data, perangkat, dan identitas Anda dengan meningkatkan keamanan komputer Anda. </p> <h2> Cara memperbaiki: Tidak Ada Izin untuk mengakses Drive USB di Laptop HP (Windows 10/8/7). </h2> <p> 1. Buka <strong> Manajer Keamanan Klien HP </strong> . </p> <p><img src=\"images/image_thumb-13-716.png\" alt=\"HP Client Security manager\" loading=\"lazy\"></p> <p> </p> <p> 2. Kemudian klik <strong> Keamanan Perangkat. </strong></p> <p><img src=\"images/image_thumb-14-712.png\" alt=\"fix You Don't have permission to access this folder windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Pada <strong> Administrator </strong> tab, atur keamanan &#39;Hapus penyimpanan&#39; ke <strong> Izinkan – Akses Penuh </strong> dan klik <strong> Kirimkan. </strong></p> <p><img src=\"images/image_thumb-15-364.png\" alt=\"fix You Don't have permission o access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Selain itu (jika Anda mau), berikan <strong> Akses penuh </strong> ke media penyimpanan yang dapat dilepas untuk <strong> Pengguna Standar </strong> . </p> <p><img src=\"images/image_thumb-19-269.png\" alt=\"no permission to access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Terakhir, jika Anda tidak ingin Pengelola Akses Perangkat HP mengontrol akses pada drive, buka <strong> Pengaturan Drive </strong> dan atur sakelar yang sesuai ke OFF. </p> <p><img src=\"images/image_thumb-20-822.png\" alt=\"You don't have permission to access USB drive\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang masalah ini. </p>"}