{"title":"MEMPERBAIKI: Sepertinya Anda memulai pemutakhiran dan mem-boot dari media instalasi (Terpecahkan)","content":"<p> Masalah berikut mungkin muncul jika Anda mencoba melakukan penginstalan bersih atau pemutakhiran perbaikan Windows 10 dari media penginstalan: &quot;Sepertinya Anda memulai pemutakhiran dan mem-boot dari media penginstalan. Jika Anda ingin melanjutkan pemutakhiran, hapus media dari PC Anda dan klik Ya. Jika Anda ingin melakukan instalasi bersih, klik Tidak&quot;. </p> <p><img src=\"images/image_thumb-36-818.png\" alt=\"FIX: It looks like you started an upgrade and booted from installation media \" loading=\"lazy\"></p> <p> </p> <p> Pesan kesalahan di atas berarti Anda telah menghentikan pemutakhiran Windows 10 setelah dimulai. Seperti yang ditunjukkan pesan, jika Anda ingin melakukan instalasi bersih Windows 10, Anda harus memilih &quot;Tidak&quot; untuk melanjutkan, jika tidak, hapus media instalasi dan klik &quot;Ya&quot; untuk melanjutkan peningkatan Windows 10. </p> <p> Secara umum, pesan di atas tidak menjadi masalah, tetapi menjadi masalah besar jika pembaruan Windows gagal untuk menginstal atau jika Windows 10 macet setelah mencoba menginstal pembaruan, dan Anda ingin memperbaiki Windows 10 dengan boot dari instalasi media. </p> <p> Dalam tutorial ini Anda akan menemukan instruksi terperinci, tentang cara melewati pesan &quot;Sepertinya Anda memulai peningkatan dan boot dari media instalasi&quot;, dengan membatalkan proses pembaruan Windows 10 yang sedang berjalan, untuk melakukan perbaikan Windows 10 upgrade dari media instalasi. </p> <h4> Cara Membatalkan Pembaruan Windows 10 yang Sedang Berlangsung jika Windows Tidak Bisa Boot * </h4> <p><strong> * Penting: </strong> Jika Anda dapat mem-boot ke Windows 10, tetapi Anda tidak dapat menginstal pembaruan dari lingkungan Windows, terapkan tindakan berikut terlebih dahulu: </p> <blockquote><p> 1. Navigasikan ke <strong> Mulailah </strong> &gt; <strong> Pengaturan </strong> &gt; <strong> Pembaruan dan keamanan </strong> dan klik &quot;Restart Now&quot;, untuk memulai proses update. <br> 2. Setelah restart pertama, biarkan kemajuan &quot;Bekerja pada pembaruan&quot; menjadi 1-2%. <br> 3. Setelah selesai, tekan tombol <strong> Kekuasaan </strong> tombol selama 10-15 detik, untuk mematikan PC Anda sepenuhnya. <br> 4. Pasang media instalasi Windows dan Power On PC Anda. <br> 5. Ikuti langkah-langkah selanjutnya di bawah ini untuk membatalkan pembaruan yang sedang berlangsung. </p></blockquote> <p> </p> <h6> Langkah 1. Batalkan Tindakan Tertunda Pembaruan Windows. </h6> <p> 1. Boot sistem Anda dari media instalasi Windows. <br> 2. Ketika pesan &quot;Sepertinya Anda memulai peningkatan dan boot dari media instalasi...&quot; muncul, tekan tombol <strong> BERGESER </strong> + <strong> F10 </strong> kunci untuk meluncurkan command prompt. </p> <p><img src=\"images/image_thumb-37-729.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Pada prompt perintah, dapatkan daftar semua drive, di sistem Anda dengan perintah ini: </p> <ul> <li><strong> wmic logicaldisk dapatkan nama </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-991.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> </p> <p> 4. Kemudian cari tahu drive mana yang berisi folder &quot;Windows&quot;, dengan mengetikkan perintah ini: * </p> <p> </p> <ul> <li><strong> dir Surat Penggerak: </strong></li> </ul> <p> * misalnya Untuk melihat isi drive C:, ketik: &quot; <strong> dir C: </strong> &quot; (tanpa tanda kutip). Jika Anda tidak dapat melihat folder &quot;Windows&quot; pada drive C:, lanjutkan ke huruf drive berikutnya (misalnya &quot;dir D:&quot;, &quot;dir E:&quot;, dll.), hingga Anda melihat Folder &quot;Windows&quot; di salah satu drive yang terdaftar (dari perintah di atas). </p> <p> misalnya: Seperti yang Anda lihat pada tangkapan layar di bawah, folder Windows (pada contoh ini) terletak di at <strong> D </strong> : mengemudi.] </p> <p><img src=\"images/image_thumb-69-578.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Setelah Anda menemukan di drive mana drive &quot;Windows&quot; berada (misalnya di drive &quot;D:&quot; dalam contoh ini), navigasikan ke drive itu dengan mengetik DriveLetter <strong> : </strong> + <strong> Memasukkan </strong> . </p> <p> 6. Kemudian buat folder awal pada drive Windows dengan mengetikkan perintah ini: </p> <p> </p> <ul> <li><strong> mkdir D:\\Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-229.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Kemudian berikan perintah di bawah ini untuk mengembalikan tindakan yang tertunda dari pembaruan yang sedang berlangsung: </p> <ul> <li><strong> DISM /Gambar:D:\\ /ScratchDir:D:\\Scratch /Cleanup-Image /RevertPendingActions </strong></li> </ul> <p> * Catatan: Ubah huruf drive <strong> D </strong> sesuai dengan kasus Anda. </p> <p> 8. Setelah perintah DISM di atas dijalankan, Anda akan menerima pesan berikut di layar: </p> <p> &quot; <em> Mengembalikan tindakan tertunda dari gambar…. <br> Operasi selesai. Pengembalian tindakan yang tertunda akan dicoba setelah reboot. <br> Operasi selesai dengan sukses.&quot; </em></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"DISM - RevertPendingActions\" loading=\"lazy\"></p> <p> </p> <p> 9. Tutup jendela command prompt, hapus media instalasi dan biarkan Windows melakukan booting secara normal. </p> <p> 10. Setelah reboot, Anda akan melihat pesan berikut di layar Anda: &quot;Undoing changes made to your computer.&quot; Ketika proses ini berakhir, Windows akan mulai secara normal. </p> <p><img src=\"images/image_thumb-39-836.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Langkah 2. Hapus File Upgrade dengan Disk Cleanup. </h6> <p> Setelah boot di Windows 10, Anda harus menyiapkan Windows 10 untuk perbaikan/peningkatan USB, dengan menghapus pembaruan yang sudah diunduh dengan alat Disk Cleanup. Untuk melakukannya: </p> <p> 1. Buka File explorer, klik kanan pada drive C: dan pilih <strong> Properti </strong> . <br> 2. Klik <strong> Pembersihan disk </strong> tombol. </p> <p><img src=\"images/image_thumb_thumb-190.png\" alt=\"Disk cleanup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Kemudian klik <strong> Bersihkan file sistem </strong> . </p> <p><img src=\"images/image_thumb-40-950.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Sekarang periksa untuk menghapus file berikut dan klik and <strong> baik </strong> : </p> <ul> <li> <ul> <li> <ul> <li> Pembersihan Pembaruan Windows. </li> <li> Antivirus Pembela Windows. </li> <li> File Program yang diunduh. </li> <li> File internet sementara. </li> <li> Instalasi Windows Sebelumnya. </li> <li> Tempat sampah. </li> <li> Berkas sementara. </li> <li> File Instalasi Windows Sementara </li> </ul> </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-41-458.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Saat ditanya, <strong> Hapus file </strong> . </p> <p><img src=\"images/image_thumb-42-931.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Setelah pembersihan selesai, tutup properti disk dan lanjutkan ke langkah berikutnya. </p> <p> </p> <h6> Langkah 3. Hapus Folder &#39;SoftwareDistribution&#39;. </h6> <p> &quot;C:\\Windows\\ <strong> Distribusi Perangkat Lunak </strong> &quot; folder, adalah lokasi di mana Windows menyimpan Pembaruan Windows. Sering kali, folder ini menjadi rusak dan Anda harus membuatnya kembali untuk mengunduh ulang pembaruan dari awal. Jadi, lakukan sebagai berikut: </p> <p><strong> 1. Hentikan Layanan Pembaruan Windows: </strong> Untuk melakukannya: </p> <blockquote><p> Sebuah. Tekan Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> b. Di kotak Pencarian, ketik: <strong><em> services.msc </em></strong> &amp; klik <strong> baik </strong> . </p></blockquote> <p><img src=\"images/image_thumb-12-264.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> c. Di panel kontrol Layanan temukan &quot; <strong> Pembaruan Windows&quot; </strong> layanan. <br> d. Klik kanan pada <strong> pembaruan Windows </strong> layanan dan pilih &quot; <strong> Berhenti </strong> &quot;. </p></blockquote> <p><img src=\"images/image_thumb-9-434.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. Hapus folder SoftwareDistribution. </strong></p> <blockquote><p> Sebuah. Buka Windows Explorer dan arahkan ke: <strong> C:\\Windows </strong> map. <br> b. Temukan dan <strong> Menghapus </strong> &quot; <strong><em> Distribusi Perangkat Lunak </em></strong> &quot; folder (atau ganti namanya. misalnya menjadi &quot;SoftwareDistributionOLD&quot;) . </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-10-140.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Hidupkan Kembali komputer Anda </strong> untuk menerapkan perubahan. </p> <p> </p> <h6> Langkah 4. Tingkatkan Windows 10 dari media instalasi. </h6> <p> Sekarang, Anda siap untuk memperbaiki-upgrade Windows 10 dari media instalasi. Untuk melakukannya: </p> <p> 1. <strong> Mulai ulang </strong> komputer Anda dan <strong> sepatu bot </strong> dari USB Windows (atau DVD) <strong> media instalasi </strong> . <br> 2. Pada wizard Pengaturan Windows, tekan <strong> Lanjut </strong> lalu klik <strong> Instal sekarang </strong> . <br> 3. <strong> Menerima </strong> &#39;Perjanjian Lisensi&#39;. <br> 4. Saat ditanya, pilih Tingkatkan <strong> : Instal Windows dan simpan file, pengaturan, dan aplikasi </strong> . </p> <blockquote><p><img src=\"images/image_thumb8_thumb-241.png\" alt=\"image_thumb8\" loading=\"lazy\"></p></blockquote> <p> 5. Kemudian ikuti petunjuk di layar untuk memutakhirkan Windows 10. </p> <p> Itu saja! Apakah itu berhasil untuk Anda? Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}