{"title":"MEMPERBAIKI: Tidak Ada Versi Sebelumnya yang Tersedia di Windows 10 (Terpecahkan)","content":"<p> Pada komputer berbasis Windows 10 dengan <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Sistem keamanan </a> diaktifkan, masalah berikut muncul saat mencoba memulihkan file/folder menggunakan fitur &#39;Pulihkan versi Sebelumnya&#39;: &quot;Tidak ada versi sebelumnya yang tersedia&quot;. </p> <p> <img src=\"images/image_thumb-39-628.png\" alt=\"There No Previous Versions Available in Windows 10 \" loading=\"lazy\"></p> <p> </p> <p> Kesalahan &quot;Tidak ada versi sebelumnya yang tersedia&quot; terjadi karena di Windows 10 fitur &quot;Pulihkan versi sebelumnya&quot; hanya berfungsi jika Anda telah mengonfigurasi &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Riwayat File </a> &#39; untuk mencadangkan file Anda. Artinya fitur &#39;Restore Previous Versions&#39; di Windows 10, melihat lokasi backup dari &quot;File History Backup tool&quot; untuk menemukan file/folder versi sebelumnya, dan bukan di System Restore Points, seperti yang terjadi di Windows 7. Untuk mengaktifkan File History di Windows 10, ikuti petunjuk pada artikel berikut: </p> <ul> <li><strong> Artikel terkait: </strong></li> <li> <ul> <li><a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Mencadangkan File Pribadi dengan Riwayat File di Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Membuat Salinan Bayangan dari File Anda dengan Penjadwal Tugas di Windows 10 </a></li> </ul> </li> </ul> <h4> Cara MEMPERBAIKI: Tidak Ada Versi File Sebelumnya yang Tersedia di Windows 10. </h4> <p> jika &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Riwayat File </a> &#39; sudah diaktifkan* di PC Windows 10 Anda, tetapi Anda menerima pesan &quot;Tidak ada versi sebelumnya yang tersedia&quot;, saat Anda mencoba memulihkan versi file atau folder sebelumnya, ikuti petunjuk di bawah ini: </p> <p> * Catatan: Petunjuk di bawah ini <strong> tidak berfungsi jika <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Riwayat File SUDAH diaktifkan </a></strong> di PC Windows 10 Anda. </p> <p> 1. Unduh dan instal <a href=\"http://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> Penjelajah Bayangan </a> utilitas pada PC Anda. <br> 2. Buka &#39;ShadowExplorer&#39; dan pilih tanggal dari mana Anda ingin mengembalikan file. * </p> <p> * Catatan: Jika Anda tidak melihat tanggal sebelumnya, berarti Riwayat File dinonaktifkan. Ingatlah bahwa meskipun Anda mengaktifkan Riwayat File sekarang, hasilnya akan tetap sama, karena Riwayat File membuat snapshot file Anda sejak diaktifkan dan kemudian. </p> <p><img src=\"images/image_thumb-40-348.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Arahkan ke lokasi penyimpanan file/folder yang ingin Anda kembalikan ke versi sebelumnya. <br> 4. Saat Anda menemukan file yang ingin Anda pulihkan, klik kanan padanya dan pilih <strong> Ekspor </strong> . </p> <p><img src=\"images/image_thumb-41-653.png\" alt=\"restore previous versions shadow explorer\" loading=\"lazy\"></p> <p> </p> <p> 5. Pilih disk (lokasi) yang berbeda untuk menyimpan file yang dipulihkan dan klik <strong> baik </strong> . * </p> <p><strong> Penting: </strong> Simpan file yang dipulihkan ke disk lain (misalnya flash drive), dan hanya setelah memastikan bahwa Anda memiliki file yang benar, salin ke lokasi asli untuk menghindari penimpaan file asli. </p> <p><img src=\"images/image_thumb-38-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang masalah ini. </p>"}