{"title":"MEMPERBAIKI: Hubungan Kepercayaan antara Workstation ini dan Domain Utama Gagal (Dipecahkan)","content":"<p> Jika Anda menerima galat &quot;Hubungan Kepercayaan antara Stasiun Kerja ini dan Domain Utama Gagal&quot; saat Anda mencoba masuk ke domain Anda atau saat Anda mencoba mengakses folder bersama di komputer lain di domain, lanjutkan membaca di bawah ini untuk menyelesaikan masalah. </p> <p> Kesalahan &quot;Hubungan Kepercayaan Antara Workstation dan Domain Utama Gagal&quot;, dapat muncul karena alasan berikut: </p> <ul> <li> Komputer memiliki nama yang sama dengan komputer lain di Domain. </li> <li> Kredensial Domain (Nama Pengguna atau Kata Sandi) tidak valid. </li> <li> Akun komputer telah kedaluwarsa. * </li> </ul> <p> * Catatan: Beberapa organisasi membuat komputer (atau klon komputer) untuk digunakan nanti. Jika akun komputer telah kedaluwarsa, ia tidak lagi dapat mengautentikasi dengan domain. Pada kasus seperti itu, komputer yang tidak dapat mengotentikasi dengan domain harus dihapus dari domain dan bergabung kembali dengannya. (langkah-4) </p> <p><img src=\"images/image_thumb-32-740.png\" alt=\"FIX: Trust Relationship Between this Workstation and the Primary Domain Failed \" loading=\"lazy\"></p> <h4> Cara MEMPERBAIKI: Hubungan Kepercayaan Antara Workstation dan Domain Gagal. </h4> <h6> Metode 1. Verifikasi bahwa Kredensial Domain sudah benar. </h6> <p> Pertama-tama pastikan kredensialnya benar dan terutama kata sandinya. jika Anda telah mengkloning mesin dari gambar komputer yang diambil di masa lalu dan sejak itu kodenya telah berubah. </p> <h6> Metode 2. Periksa Duplikat Nama Komputer. </h6> <p> Pastikan nama komputer itu unik dan tidak ada komputer lain di jaringan dengan nama yang sama. </p> <h6> Metode 3. Periksa alamat IP Duplikat. </h6> <p> Pastikan Alamat IP Komputer unik dan tidak bertentangan dengan Alamat IP lain di Jaringan. </p> <h6> Metode 4. Hapus dan Gabung Kembali Komputer di Domain. </h6> <p> Metode biasa untuk memperbaiki hubungan kepercayaan antara komputer dan domain adalah dengan menghapus dan menambahkan kembali komputer yang terpengaruh ke domain. </p> <h5> Langkah 1. Hapus Akun Komputer dari Domain. </h5> <p> 1. Masuk ke Server Direktori Aktif. <br> 2. Buka <strong> Pengguna dan Komputer Direktori Aktif. <br> </strong> 3. Perluas <strong> Komputer </strong> wadah. <br> 4. Klik kanan pada komputer yang terpengaruh dan pilih <strong> Menghapus. </strong></p> <p><img src=\"images/image_thumb-39-366.png\" alt=\"Delete Computer Account from Domain\" loading=\"lazy\"></p> <h5> Langkah 1. Hapus dan Gabung kembali Komputer di Domain. </h5> <p> 1. Masuk ke komputer yang terpengaruh dengan akun Administrator LOKAL (Nama komputer\\Administrator). </p> <p> 2. Tekan Windows <img src=\"images/image_thumb8_thumb-480.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. </p> <p> 2a. Tipe <strong> sysdm.cpl </strong> &amp; klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb7_thumb-169.png\" alt=\"system properties\" loading=\"lazy\"></p> <p> 3. Pada tab &#39;Nama Komputer&#39;, klik <strong> Perubahan </strong> . </p> <p><img src=\"images/image_thumb-37-924.png\" alt=\"Remove Computer from Domain\" loading=\"lazy\"></p> <p> 4. Pada Anggota, pilih <strong> Kelompok kerja </strong> , ketik nama workgroup (mis. &quot;WORKGROUP&quot;) dan klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb-34-169.png\" alt=\"Change Computer Name - Membership\" loading=\"lazy\"></p> <p> 5. Ketik kredensial Administrator dan klik <strong> baik </strong> . <br> 6. <strong> Mengulang kembali </strong> komputer. </p> <p> 7. Lakukan langkah 1-4 lagi tetapi kali ini, pada langkah-4, pilih <strong> Domain, </strong> ketik Nama Domain dan klik <strong> BAIK. </strong></p> <p><img src=\"images/image_thumb-38-928.png\" alt=\"Add computer to domain\" loading=\"lazy\"></p> <p> 8. Ketik kredensial Administrator Domain dan klik <strong> baik </strong> . <br> 9. <strong> Mengulang kembali </strong> PC Anda dan login ke domain menggunakan akun pengguna domain. </p> <h6> Metode 5. Reset Akun Komputer di Domain. </h6> <p> 1. Masuk ke Server Direktori Aktif. <br> 2. Buka <strong> Pengguna dan Komputer Direktori Aktif. <br> </strong> 3. Perluas <strong> Komputer </strong> wadah. <br> 4. Klik kanan pada komputer yang terpengaruh dan pilih <strong> Setel Ulang Akun. </strong></p> <p><img src=\"images/image_thumb-36-935.png\" alt=\"Reset Computer Account in Domain\" loading=\"lazy\"></p> <p> 5. Akhirnya, <strong> mengulang kembali </strong> itu <strong> mesin yang terpengaruh </strong> dan login di Domain. </p> <p> Itu saja! Metode mana yang berhasil untuk Anda? Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}