{"title":"MEMPERBAIKI: Adobe Reader DC – Simpan Sebagai kosong (Terpecahkan)","content":"<p> Setelah pembaruan otomatis Adobe Reader DC, masalah berikut terjadi: Fitur &quot;Simpan Sebagai&quot; menampilkan jendela kosong (kosong) (kosong) yang tidak mengizinkan pengguna untuk menyimpan dokumen PDF. </p> <p><img src=\"images/image_thumb-38-290.png\" alt=\"Adobe Reader DC - Save As is blank - fix\" loading=\"lazy\"></p> <p> Tutorial ini berisi petunjuk untuk mengatasi masalah berikut: Fitur &quot;Save As&quot;, tidak berfungsi di Adobe Reader DC di Windows atau MAC OS. </p> <h4> Cara MEMPERBAIKI: Simpan Sebagai kosong di Adobe Reader DC. </h4> <h6> Metode 1. Pindai sistem Anda dari Virus dan Malware. </h6> <p> Langkah pertama untuk mengatasi masalah &quot;folder yang hilang&quot; di Outlook, adalah memastikan bahwa sistem Anda bebas virus/malware. Untuk tugas itu, ikuti instruksi dalam panduan ini: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cara Memindai Komputer Anda dari Virus dan Program Berbahaya lainnya. </a></p> <p> </p> <h6> Metode 2. Nonaktifkan Penyimpanan Online saat menyimpan file. </h6> <p> 1. Dari Adobe Reader DC <strong> Sunting </strong> klik menu <strong> Preferensi </strong> . </p> <p><img src=\"images/image_thumb-39-749.png\" alt=\"save as not working fix in Adobe Reader DC\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Hapus centang </strong> itu <strong> Tampilkan penyimpanan online saat menyimpan file </strong> dan klik <strong> BAIK. * </strong></p> <p> * Catatan: Secara opsional, hapus centang juga pada fitur &quot;Tampilkan penyimpanan online saat membuka file&quot;. </p> <p><img src=\"images/image_thumb-40-312.png\" alt=\"save as blank - abobe reader DC - fix\" loading=\"lazy\"></p> <p> </p> <p> 3. Sekarang coba gunakan fitur Save As di Adobe DC. Masalahnya harus diselesaikan. </p> <p> </p> <h6> Metode 3. Hapus dan instal ulang Adobe Reader DC. </h6> <p> Metode terakhir untuk mengatasi jendela kosong di fitur &#39;Save As&quot; di Adobe DC, adalah menghapus instalan Adobe Reader DC sepenuhnya, lalu mengunduh dan menginstal ulang versi terbaru program dari <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> sini </a> . </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang ini. </p>"}