{"title":"PERBAIKI: Chrome Selalu Buka Jelajah sebagai Tamu – Ganti opsi Orang saat memulai.","content":"<p> Tutorial berisi petunjuk tentang cara mencegah Chrome menampilkan jendela &quot;Switch Person – Browse as Guest&quot; saat startup. Masalah secara detail: Pada komputer berbasis Windows, browser Google Chrome selalu membuka opsi &quot;Jelajahi sebagai Tamu&quot; dan &quot;Tambahkan orang&quot; saat memulai dan pengguna harus selalu memilih profilnya untuk menggunakan browser Chrome. </p> <p><img src=\"images/image_thumb-26-805.png\" alt=\"FIX Remove Chrome Browse as Guest\" loading=\"lazy\"></p> <p> </p> <h4> Cara Menghapus jendela opsi &quot;Browser As Guest – Add Person&quot; di Chrome Startup. </h4> <h6> Metode 1. Periksa apakah Chrome disetel ke Selalu Mulai dalam Mode Penjelajahan Tamu. </h6> <p> Salah satu fitur browser Google Chrome yang paling berguna, adalah membuat beberapa profil pengguna, terutama jika Anda berbagi komputer dengan orang lain, atau jika Anda ingin memisahkan bookmark dan setelan di antara beberapa akun Anda. Dalam hal ini, Anda selalu dapat memulai Chrome dengan jendela &quot;Switch Person&quot;, dengan menambahkan salah satu sakelar berikut (entri teks) di pintasan Chrome: </p> <ul> <li><strong> –profile-directory=&quot;Profil Tamu&quot; </strong></li> <li><strong> –bwsi </strong></li> </ul> <p> </p> <p> Jadi pertama-tama, periksa apakah Chrome disetel untuk selalu membuka jendela &quot;Switch Person/Browse as Guest&quot;. Untuk melakukannya: </p> <p> 1. Tutup Google Chrome. <br> 2. Klik Kanan pada Pintasan Chrome di desktop Anda dan pilih <strong> Properti </strong> . <br> 3. Pada <strong> Jalan pintas </strong> tab, lihat <strong> Target </strong> kotak teks dan (jika ada) <strong> menghapus </strong> entri teks di atas di akhir dan kemudian klik <strong> baik </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-27-916.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Luncurkan Chrome dan di jendela &quot;Switch Person&quot;, klik ikon/gambar profil Anda (&quot;Anda&quot;). <br> 5. <strong> Mengulang kembali </strong> Chrome. </p> <p> </p> <h6> Metode 2. Buat Profil Google Chrome Bersih Baru. </h6> <p> Secara default, Chrome menyimpan semua setelan Profil (bookmark, sandi, ekstensi, dll.) di dalam folder &quot;Data Pengguna&quot; di lokasi berikut di komputer Anda: </p> <ul> <li><strong> C:\\Users\\%Nama Pengguna%\\AppData\\Local\\Google\\Chrome\\Data Pengguna </strong></li> </ul> <p> Jika karena alasan tertentu, folder Profil Chrome menjadi rusak atau dimodifikasi secara tidak semestinya oleh malware, maka opsi terbaik yang Anda miliki adalah memaksa Chrome untuk membuat ulang folder profil Chrome baru (kosong*). Untuk melakukannya: </p> <p><strong> * Perhatian: </strong> Perlu diingat bahwa, dengan menghapus folder penyimpanan profil Chrome Anda, Anda menghapus semua data yang tersimpan (Bookmark, Setelan, Ekstensi, Riwayat, dll.) . Jadi sebelum menghapus profil Chrome Anda, perhatikan <a href=\"https://www.repairwin.com/backup-restore-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> cadangan bookmark Chrome Anda </a> jika Anda ingin menginstal ulang Chrome lagi. </p> <h5> Langkah 1: Aktifkan tampilan file &amp; folder Tersembunyi. </h5> <p> 1. Buka <strong> Pilihan folder </strong> . <br> 2. Di <strong> Melihat </strong> tab, <strong> memeriksa </strong> itu <strong> Tampilkan file, folder, dan drive tersembunyi </strong> centang kotak dan klik <strong> BAIK. </strong></p> <p><img src=\"images/image_thumb-6-189.png\" alt=\"enable hidden files folders\" loading=\"lazy\"></p> <h6></h6> <h5> Langkah 2. Paksa Chrome untuk Membuat Folder Profil Baru (Bersih). </h5> <p> 1. <strong> Menutup </strong> Google Chrome. <br> 2. <strong> Buka </strong> Windows Explorer dan arahkan ke lokasi ini: </p> <ul> <li><strong> C:\\Users\\%USERNAME%\\AppData\\Local\\Google\\Chrome\\ </strong></li> </ul> <p> * Dimana %USERNAME% = Nama Pengguna Anda. (misalnya jika nama pengguna Anda adalah &quot;Admin&quot;, maka Anda harus menavigasi ke jalur ini: &quot;C:\\Users\\Admin\\AppData\\Local\\Google\\Chrome&quot;) </p> <p> 3. <strong> Ganti nama </strong> folder &quot;Data Pengguna&quot; ke &quot;Data Pengguna.BAK&quot;. </p> <p><img src=\"images/image_thumb-28-373.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Sekarang buka Google Chrome. (Saat memulai, Chrome akan membuat folder &quot;Data Pengguna&quot; baru yang bersih secara otomatis untuk menyimpan bookmark dan setelan Anda). </p> <p> </p> <h6> Metode Tambahan untuk Mengatasi masalah Chrome. </h6> <p><strong> 1. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Periksa komputer Anda dari virus, malware, dll. </a></p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Copot pemasangan dan pasang ulang Chrome sepenuhnya. </a></p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}