{"title":"PERBAIKI: Menu Mulai Windows 10, Pengaturan, Cortana, atau Bilah Tugas tidak berfungsi. (Terpecahkan)","content":"<p> Tutorial ini berisi instruksi untuk memperbaiki masalah berikut di Windows 10: Start Menu tidak terbuka, Pencarian Cortana tidak berfungsi, aplikasi Pengaturan tidak diluncurkan, ikon Taskbar tidak akan terbuka. </p> <p> Banyak pengguna Windows 10 melaporkan masalah dengan menu Mulai, Bilah Tugas, Cortana, dan Pengaturan, jadi dalam panduan ini saya mencantumkan metode paling umum untuk menyelesaikan masalah di atas. </p> <h2> Cara MEMPERBAIKI: Windows 10 Taskbar, Start Menu, Pengaturan atau Masalah Cortana. </h2> <h3> Metode 1. Copot Pembaruan Windows 10 Terbaru. </h3> <p> Banyak pengguna telah melaporkan bahwa masalah yang disebutkan dalam artikel ini diselesaikan setelah mencopot pemasangan <strong><a href=\"https://support.microsoft.com/en-us/topic/august-11-2020-kb4566782-os-build-19041-450-ec5cf4b6-86ed-b0d3-539c-5fbe1b17f56a\" target=\"_blank\" rel=\"nofollow noopener\"> KB4566782 </a></strong> Memperbarui. </p> <p> Jika Anda tidak dapat menemukan pembaruan KB4566782 dalam daftar pembaruan yang diinstal, periksa dan instal semua pembaruan yang tersedia dan jika masalah terus berlanjut, coba <strong><a href=\"https://www.repairwin.com/how-to-uninstall-updates-in-windows-10/#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> hapus instalan pembaruan terbaru yang diinstal. </a></strong></p> <h3> Metode 2. Mulai ulang Windows 10 dalam Mode Aman. </h3> <p> 1. Tekan tombol Windows <img src=\"images/image_thumb8_thumb_thumb-268.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tombol untuk membuka kotak perintah run. <br> 2. Ketik <strong> msconfig </strong> dan tekan <strong> Memasukkan </strong> . </p> <p><img src=\"images/image_thumb-47-537.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. Pada <strong> Boot </strong> tab pilih <strong> Boot Aman </strong> pilihan, lalu klik <strong> baik </strong> dan restart komputer Anda. </p> <p><img src=\"images/image_thumb-48-665.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 4. Setelah restart dan saat dalam Safe Mode, periksa apakah masalah Anda tetap ada. <br> 5. Kemudian, jalankan alat &#39;msconfig&#39; lagi dan di <strong> Umum </strong> tab, periksa <strong> Startup normal </strong> dan klik <strong> baik </strong> . </p> <p><img src=\"images/image_thumb-859.png\" alt=\"normal startup windows\" loading=\"lazy\"></p> <p> 6. <strong> Mengulang kembali </strong> komputer Anda. <br> 7. Setelah restart, periksa apakah masalah berlanjut, jika tidak lanjutkan ke metode berikutnya. </p> <p> </p> <h2> Metode 3. Lakukan Boot Bersih. </h2> <p> 1. Jalankan alat &#39;msconfig&#39;. <br> 2. Pada tab Layanan, <strong> memeriksa </strong> itu <strong> Sembunyikan semua Layanan Microsoft </strong> kotak centang dan kemudian tekan <strong> Menonaktifkan semua </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-333.png\" alt=\"clean boot windows\" loading=\"lazy\"></p> <p> </p> <p> 3. Kemudian pilih <strong> Memulai </strong> tab dan klik <strong> Buka Pengelola Tugas. <br> </strong> 4. <strong> </strong> Pilih satu per satu semua program yang terdaftar dan klik <strong> Nonaktifkan. </strong></p> <p><img src=\"images/image_thumb-1-399.png\" alt=\"clean boot windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Setelah selesai, tutup jendela itu lalu klik <strong> baik </strong> di utilitas &#39;Konfigurasi Sistem&#39; untuk <strong> Mengulang kembali </strong> komputer Anda. <br> 6. Setelah restart, jika komputer Anda bekerja dengan baik dan tanpa masalah, * kemudian buka lagi utilitas &#39;System Configuration&#39; (msconfig) dan aktifkan satu per satu semua program yang dinonaktifkan dan restart PC Anda, sampai Anda mengetahui program mana yang menyebabkan masalah. </p> <p> * Catatan: Jika masalah berlanjut, bahkan dalam status Boot Bersih, lanjutkan ke metode berikutnya. </p> <h3> Metode 4. Instal ulang dan daftarkan ulang semua Aplikasi bawaan Windows 10. </h3> <p> Metode selanjutnya untuk menyelesaikan masalah dengan Taskbar, Start menu, Cortana, dll. di Windows 10, adalah menginstal ulang dan mendaftarkan ulang semua aplikasi bawaan. </p> <p> 1. Buka PowerShell sebagai Administrator. Untuk melakukannya: </p> <blockquote><p> 1. Di <strong> Cortana </strong> kotak pencarian, ketik <strong> powershell <br> </strong> 2. Klik kanan pada <strong> Windows PowerShell </strong> hasil dan pilih <strong> Jalankan sebagai administrator. </strong></p></blockquote> <p><img src=\"images/image_thumb-51-691.png\" alt=\"FIX: Windows 10 Start Menu, Settings, Cortana or Taskbar icons Not Working.\" loading=\"lazy\"></p> <p> </p> <p> 3. Di PowerShell Ketik (salin &amp; tempel) perintah berikut &amp; tekan <strong> Memasukkan </strong> : </p> <ul> <li> Dapatkan-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register &quot;$($_.InstallLocation)\\AppXManifest.xml&quot;} </li> </ul> <p><img src=\"images/image_thumb-2-985.png\" alt=\"register re-install windows 10 apps\" loading=\"lazy\"></p> <p> 4. Tunggu perintah untuk menjalankan dan abaikan kesalahan (dalam huruf merah). <br> 5. <strong> Mengulang kembali </strong> komputer Anda dan kemudian periksa apakah masalah Anda telah diperbaiki. </p> <p> </p> <h3> Metode 5. Buat Akun Baru. </h3> <p> Metode lain untuk memperbaiki beberapa masalah di Windows 10, adalah membuat akun baru dan mentransfer file dan data pribadi Anda ke akun baru. Untuk melakukannya: </p> <p> 1. Buka <strong> Command Prompt Sebagai Administrator </strong> . <br> 2. Pada prompt perintah ketik perintah berikut dan tekan <strong> Memasukkan </strong> : </p> <ul> <li><strong> kata sandi akun pengguna bersih / tambahkan </strong></li> </ul> <p> * Catatan: Pada perintah di atas, ganti bidang &quot;akun&quot; &amp; &quot;kata sandi&quot;, dengan pilihan Anda. </p> <p> misalnya jika ingin membuat akun baru dengan username &quot;Admin1&quot; dan password &quot;Admin123&quot; lalu ketik: <em> pengguna bersih Admin1 Admin123 /tambahkan </em></p> <p><img src=\"images/image_thumb-3-388.png\" alt=\"add user windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Kemudian lanjutkan dan tambahkan akun baru, ke grup Administrator, dengan perintah ini: </p> <ul> <li><strong> akun administrator grup lokal bersih / tambahkan </strong></li> </ul> <p> misalnya Dalam contoh kita perintahnya adalah: <em> administrator grup lokal bersih Admin1 /add </em></p> <p><img src=\"images/image_thumb-4-429.png\" alt=\"fix windows 10 start menu, cortana, settings\" loading=\"lazy\"></p> <p> </p> <p> 4. Tutup jendela prompt perintah dan <strong> mengulang kembali </strong> komputer Anda. <br> 5. Setelah restart login dengan akun baru. <br> 6. Periksa apakah masalah masih berlanjut. Jika masalah sudah teratasi, transfer data dan file Anda ke akun baru dan selesai. </p> <p> </p> <h3> Metode 6. Perbaiki Windows 10. </h3> <p> Metode terakhir untuk menyelesaikan masalah Windows 10, adalah untuk <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> perbaiki Windows 10 dengan Peningkatan di Tempat </a> . </p> <p> </p> <p> Itu saja! Apakah itu berhasil untuk Anda? <br> Silakan tinggalkan komentar di bagian komentar di bawah atau bahkan lebih baik: suka dan bagikan posting blog ini di jejaring sosial untuk membantu menyebarkan berita tentang solusi ini. </p>"}