{"title":"Come visualizzare ed esportare le password di Firefox.","content":"<p> In questo tutorial ti mostrerò come visualizzare e gestire le password salvate nel browser web Mozilla Firefox. Come già saprai, il browser Firefox ti offre la possibilità di salvare il tuo nome utente e password di accesso la prima volta che visiti un sito web. Se scegli di salvare le tue credenziali, Firefox le ricorderà e la prossima volta che accedi al sito web, non dovrai reinserirle. </p> <p><img src=\"images/image_thumb-98-507.png\" alt=\"How to View and Export Firefox Passwords.\" loading=\"lazy\"></p> <p> Se, nel tempo, dimentichi le credenziali di accesso, leggi questo tutorial per sapere come visualizzare ed esportare le password memorizzate in Firefox. </p> <h4> Come gestire, mostrare ed esportare le password salvate in Mozilla Firefox. </h4> <p><strong> Come visualizzare le password di Firefox </strong></p> <p> 1. Dal menu di Firefox <img src=\"images/image_thumb-99-587.png\" alt=\"image\" loading=\"lazy\"> scegliere <strong> Login e password </strong> . </p> <p><img src=\"images/image_thumb-100-999.png\" alt=\"View Saved Passwords Firefox\" loading=\"lazy\"></p> <p> </p> <p> 2. Fare clic su <strong> Mostra password </strong> pulsante per visualizzare le password salvate nei siti web. Inoltre in questa finestra, usa il pulsante <strong> Rimuovere </strong> pulsante per rimuovere le password salvate da Firefox. </p> <p><img src=\"images/image_thumb-101-863.png\" alt=\"Manage Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p><strong> Come salvare tutte le password di Firefox in un file </strong></p> <p> Per visualizzare ed esportare tutte le password memorizzate in Firefox: </p> <p> 1. Scarica <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> PasswordFox </a> utilità ( <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> http://www.nirsoft.net/utils/passwordfox.html </a> ) <br> 2. Estrarre il file zip scaricato. <br> 3. Dalla cartella estratta fare doppio clic per eseguire l&#39;applicazione &quot;PasswordFox.exe&quot;. <br> 4. Premere <strong> Ctrl </strong> + <strong> UN </strong> per selezionare tutti i siti elencati, quindi dal <strong> File </strong> menu scegli <strong> Salva gli elementi selezionati. </strong></p> <p><img src=\"images/image_thumb-102-438.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Digitare un nome per il file .txt e fare clic su <strong> Salva </strong> . </p> <p><img src=\"images/image_thumb-103-923.png\" alt=\"How to Save Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p> 6. Aprire il file creato nel blocco note, per visualizzare tutte le password memorizzate nel browser Mozilla Firefox. </p> <p> È tutto! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}