{"title":"Come decifrare i file crittografati EFS e rimuovere la crittografia EFS in Windows 10.","content":"<p> In un precedente tutorial avevo descritto il modo per <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> crittografa i tuoi file utilizzando la crittografia EFS </a> . In questo tutorial scoprirai come rimuovere la crittografia EFS e come decrittografare i file crittografati EFS dopo averli trasferiti su un altro computer. </p> <h4> Come decrittografare i file crittografati EFS e disabilitare la crittografia EFS. </h4> <ul> <li> <p><a href=\"#part-1\"> Parte 1. Come disabilitare e rimuovere la crittografia EFS sullo stesso PC. </a></p> </li> <li> <p><a href=\"#part-2\"> Parte 2. Come decifrare i file EFS su un altro PC. </a></p> </li> </ul> <h6> Parte 1. Come disabilitare e rimuovere la crittografia EFS. </h6> <p> Quando si crittografano i file con EFS, la chiave di decrittografia (certificato) viene archiviata localmente sul computer e i file sono già decrittati. Se desideri disabilitare la crittografia EFS per interrompere la crittografia dei tuoi file/cartelle: </p> <p> 1. Fare clic con il pulsante destro del mouse sulla cartella/file crittografato e modificare il <strong> Proprietà del file </strong> per <strong> Personale </strong> . </p> <p><img src=\"images/image_thumb-26-500.png\" alt=\"how to disable efs encryption\" loading=\"lazy\"></p> <p> 2. Al termine, dovresti vedere che la cartella/il file è sbloccato. Basta eseguire gli stessi passaggi per rimuovere la crittografia su ogni altra cartella e file crittografati. </p> <p> 3. Ora, se non utilizzi la crittografia EFS su nessun altro file/cartella e desideri rimuovere completamente la chiave di ripristino EFS (nota anche come &quot;chiave di decrittazione - certificato&quot;) dal tuo PC: </p> <blockquote> <p> 1. Aprire Internet Explorer e dal <strong> Utensili </strong> menu selezionare <strong> Opzioni Internet </strong> . (o, apri <strong> Opzioni Internet </strong> a partire dal <strong> Pannello di controllo </strong> .) </p> <p> 2. A <strong> Soddisfare </strong> fare clic sulla scheda <strong> Certificati </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-27-186.png\" alt=\"how to remove efs certificate-recovery key\" loading=\"lazy\"></p> <blockquote> <p> 3. Nella scheda Personale, seleziona il certificato di decrittazione e fai clic su <strong> Rimuovere </strong> . * </p> <p><strong> * Attenzione: </strong> Assicurati di aver rimosso (fermato) la crittografia per tutti i file crittografati prima di rimuovere il certificato (chiave di decrittazione) </p> </blockquote> <p><img src=\"images/image_thumb-25-639.png\" alt=\"how to remove efs recovery key\" loading=\"lazy\"></p> <blockquote> <p> 4. <strong> Ricomincia </strong> il tuo computer. </p> </blockquote> <h6></h6> <h6> Parte 2: come decifrare i file crittografati EFS su un altro computer. </h6> <p> Se hai trasferito i file crittografati EFS su un altro computer, l&#39;unico modo per visualizzare (aprire) i file EFS è possedere la chiave di decrittazione. La chiave di decrittazione è il file .pfx del certificato, che hai esportato quando hai crittografato i file. Se non si dispone della chiave di decrittografia EFS, non è possibile decrittografare i file EFS. </p> <p><strong> Per decrittografare i file crittografati EFS, utilizzando la chiave di decrittografia – Certificato: </strong></p> <p> 1. Fare doppio clic sulla chiave di decrittazione (file .pfx del certificato) per installarla. <br> 2. Nella schermata di benvenuto dell&#39;Importazione guidata certificati, fare clic su <strong> Il prossimo </strong> . <br> 3. Quindi fare clic su <strong> Il prossimo </strong> ancora. </p> <p><img src=\"images/image_thumb38_thumb-158.png\" alt=\"How to Decrypt EFS Encrypted files\" loading=\"lazy\"></p> <p> 4. Digita la password che hai utilizzato quando hai esportato la chiave del certificato e fai clic su <strong> Il prossimo </strong> . </p> <p><img src=\"images/image_thumb39_thumb-680.png\" alt=\"install efs .pfx certificate\" loading=\"lazy\"></p> <p> 5. Lascia le impostazioni predefinite nelle opzioni dell&#39;archivio certificati e fai clic su <strong> Il prossimo </strong> . </p> <p><img src=\"images/image_thumb40_thumb-629.png\" alt=\"image_thumb[40]\" loading=\"lazy\"></p> <p> 6. Infine clicca <strong> finire </strong> . </p> <p><img src=\"images/image_thumb41_thumb-225.png\" alt=\"image_thumb[41]\" loading=\"lazy\"></p> <p> </p> <p> 7. Ora puoi aprire i file crittografati. * </p> <p> * Nota: dopo aver decifrato i file, seguire le istruzioni su <a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> parte 1 </a> sopra, per rimuovere completamente la crittografia, se lo desideri. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione </p>"}