{"title":"Come controllare il mouse con la tastiera in Windows 10/8/7.","content":"<p> Questo tutorial contiene istruzioni su come controllare il mouse utilizzando la tastiera, utilizzando la funzione &quot;Tasti mouse&quot; in Windows. L&#39;articolo può essere utile a persone che non possono utilizzare il mouse o nei casi in cui il mouse smette di funzionare (o non esiste) e desideri utilizzare la tastiera come un mouse. per lavorare con il computer per completare un lavoro urgente. </p> <p> Il <strong> Tasti del mouse </strong> è integrata nei sistemi operativi Windows 10, 7 o 7 e consente di utilizzare il tastierino numerico per spostare il puntatore del mouse sullo schermo ed eseguire tutte le normali azioni di un mouse (clic, doppio clic, clic con il tasto destro). </p> <h4> Come usare la tastiera come mouse. </h4> <h6> Metodo 1. Abilita i tasti del mouse utilizzando i tasti di scelta rapida. * </h6> <p> Il primo metodo per spostare il cursore del mouse [senza mouse <img src=\"images/wlemoticon-openmouthedsmile-273.png\" alt=\"Open-mouthed smile\" loading=\"lazy\"> ], è attivare i tasti del mouse, utilizzando il seguente modo: </p> <p> 1. Premere <strong> sinistra ALT </strong> + <strong> tasto maiuscolo di sinistra </strong> + <strong> Bloc Num </strong></p> <p><img src=\"images/image_thumb-10-220.png\" alt=\"How to Control Mouse with Keyboard \" loading=\"lazy\"></p> <p> </p> <p> 2. Quando viene visualizzata la finestra Tasti del mouse sullo schermo, premere <strong> ACCEDERE </strong> per attivare i tasti del mouse. </p> <p><img src=\"images/image_thumb-2-595.png\" alt=\"turn on mouse keys\" loading=\"lazy\"></p> <p> 3. Dopo aver abilitato i tasti del mouse, è possibile utilizzare la tastiera (tastierino numerico) per eseguire tutte le azioni del mouse (spostare, fare clic, fare clic con il pulsante destro del mouse, fare doppio clic) come mostrato nella figura sottostante. * </p> <p> * Nota: se si desidera aumentare o diminuire la velocità del puntatore, leggere le istruzioni nel metodo successivo. </p> <p><strong> Funzioni del mouse dal tastierino numerico </strong></p> <p><img src=\"images/image_thumb-8-332.png\" alt=\"mouse functions numeric keypas\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Metodo 2. Abilita i tasti del mouse da Centro accesso facilitato. </h6> <p> Il secondo metodo per poter controllare il puntatore del mouse con la tastiera è attivare e configurare la funzione &quot;Tasti mouse&quot; dal centro di accesso facilitato. Fare quello: </p> <p> 1. Passare al Pannello di controllo di Windows, impostare &quot;Visualizza per&quot; su <strong> Piccole icone </strong> e poi apri il <strong> Centro di accesso facilitato. </strong></p> <p><img src=\"images/image_thumb-3-309.png\" alt=\"use keyboard as mouse\" loading=\"lazy\"></p> <p> </p> <p> 2. Fare clic su <strong> Rendi il mouse più facile da usare. </strong></p> <p><img src=\"images/image_thumb-4-518.png\" alt=\"enable mouse keys - ease of access\" loading=\"lazy\"></p> <p> </p> <p> 3. Quindi fare clic su <strong> Imposta i tasti del mouse </strong> . </p> <p><img src=\"images/image_thumb-9-206.png\" alt=\"Configure Pointer Speed \" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Ora, controlla il <strong> Attiva i tasti del mouse </strong> casella e fare clic <strong> Applicare. </strong><br> <strong> 5. </strong> Ora prova a spostare il cursore del mouse utilizzando il tastierino numerico e configura il <strong> Velocità del puntatore </strong> come vuoi. (Fai clic su &quot;Applica&quot; ad ogni modifica e &quot;OK&quot; per chiudere le opzioni &quot;Tasti mouse&quot;.) </p> <p><img src=\"images/image_thumb-7-340.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> È tutto! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}