{"title":"CORREZIONE: l&#39;opzione Installa VMware Tools è disattivata. (Risolto)","content":"<p> Se non riesci a installare VMware Tools sul guest operativo perché l&#39;opzione &quot;Install VMware Tools&quot; è disattivata, continua a leggere di seguito. VMware Tools è un insieme gratuito di servizi e moduli che abilitano diverse funzionalità nella macchina virtuale guest come prestazioni grafiche più veloci, prestazioni del mouse migliorate e la più significativa: la possibilità di copiare e incollare tra la macchina Host e la macchina Guest. Pertanto, sebbene il sistema operativo guest possa essere eseguito senza VMware Tools, è necessario installare gli strumenti VMware se si desidera abilitare le funzionalità VMware aggiuntive. </p> <p> Al solito modo per installare VMware Tools, è avviare la macchina guest e quindi dal menu &quot;Player&quot; scegliere <strong> Gestire </strong> &gt; <strong> Installa VMware Tools </strong> . Tuttavia, se hai collegato l&#39;unità CD/DVD virtuale della macchina virtuale a un file immagine ISO quando hai installato il sistema operativo, l&#39;opzione &quot;Installa VMware Tools&quot; è disattivata. </p> <p><img src=\"images/image_thumb-45-164.png\" alt=\"FIX VMware Tools option is Grayed Out\" loading=\"lazy\"></p> <p> </p> <p> Questo tutorial contiene le istruzioni per risolvere il seguente problema in VMware Workstation Player. L&#39;opzione &quot;Installa VMware Tools&quot; è disattivata nel computer Guest. </p> <h4> Come installare VMware Tools se l&#39;opzione &quot;Install VMware Tools&quot; è disattivata. </h4> <p> </p> <p> 1. Spegni la macchina virtuale. <br> 2. Fare clic con il tasto destro sulla macchina virtuale e selezionare <strong> impostazioni </strong> . </p> <p><img src=\"images/image_thumb-39-377.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Selezionare il <strong> CD/DVD </strong> guidare e quindi fare clic su <strong> Rimuovere </strong> . </p> <p><img src=\"images/image_thumb-43-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Quindi selezionare <strong> Floppy </strong> guida, clicca <strong> Rimuovere </strong> e quindi fare clic su <strong> ok </strong> per chiudere le opzioni delle impostazioni. </p> <p><img src=\"images/image_thumb-44-469.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Inizio </strong> la macchina virtuale. <br> 6. Dal menu &#39;Giocatore&#39;, seleziona <strong> Gestire </strong> e clicca <strong> Installa VMware Tools. </strong></p> <p><img src=\"images/image_thumb-42-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> È tutto! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}