{"title":"Come rimuovere l&#39;opzione FARE CLIC QUI PER VISUALIZZARE DI PI SU MICROSOFT EXCHANGE in Outlook.","content":"<p> Se non vuoi fare clic ogni volta sul collegamento ipertestuale &quot;Fai clic qui per visualizzare di più su Exchange&quot; in Outlook, per visualizzare tutte le e-mail archiviate su Exchange, continua a leggere di seguito. Il collegamento ipertestuale &quot;Fai clic qui per ulteriori informazioni su Exchange&quot; in Outlook viene visualizzato perché le cartelle di posta visualizzano solo gli elementi più recenti (e-mail). Questo è un comportamento predefinito, perché quando si utilizza Microsoft Outlook 2019, Outlook 2016, Outlook 2013 o Outlook per Office 365 per connettersi alla cassetta postale di Exchange Server, Outlook visualizza uno dei messaggi di posta elettronica dell&#39;anno passato. </p> <p><img src=\"images/image_thumb-19-421.png\" alt=\"How to Remove the \" click here to view more on exchange option in outlook. loading=\"lazy\"></p> <p> </p> <p> Per rimuovere il collegamento ipertestuale &quot;Fai clic qui per visualizzare di più su Exchange&quot; per visualizzare tutti i tuoi elementi di posta elettronica, quando sei connesso a una casella di posta di Exchange, segui i passaggi seguenti. </p> <h4> Come forzare Outlook a visualizzare tutte le tue e-mail dalla tua cassetta postale di Exchange. </h4> <p> Per visualizzare tutte le tue email di Exchange in Outlook: </p> <p> 1. Fare clic su <strong> File </strong> menu e vai a <strong> account </strong> &gt; <strong> Impostazioni dell&#39;account </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-1-139.png\" alt=\"How to Backup Outlook\" loading=\"lazy\"></p> <p> 2. Evidenzia l&#39;account Exchange e fai clic su <strong> Modificare </strong> . </p> <p><img src=\"images/image_thumb-20-777.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. All&#39;impostazione &quot;Scarica email del passato&quot;, trascina il dispositivo di scorrimento fino alla fine. </p> <p><img src=\"images/image_thumb-17-833.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Al termine, fare clic su <strong> Il prossimo </strong> e <strong> finire </strong> e poi chiudi le Impostazioni account. </p> <p><img src=\"images/image_thumb-18-585.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Ricomincia </strong> Prospettiva. </p> <p> È tutto gente! Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}