{"title":"Come riavviare un server HP dall&#39;interfaccia iLO.","content":"<p> In questo tutorial, troveremo istruzioni passo passo su come riavviare un server HP in remoto, utilizzando l&#39;interfaccia iLO di HP. HP Integrated Lights-Out (iLO) è un componente hardware sui server HP, solitamente integrato nella scheda di sistema. Il componente iLO dispone di una propria connessione di rete, indirizzo IP e interfaccia Web e può aiutare l&#39;utente ad accedere e gestire in remoto il server. </p> <h4> Come riavviare un server HP utilizzando l&#39;interfaccia Web di iLO 5. </h4> <p> Per riavviare un server se si blocca, dall&#39;interfaccia iLO: </p> <p> 1. Da un altro computer, aprire un browser Web e nella barra degli indirizzi digitare l&#39;indirizzo IP dell&#39;interfaccia iLO sul server che si desidera riavviare. <br> 2. Digitare il nome utente e la password di iLO e fare clic su <strong> Accesso </strong> . </p> <p><img src=\"images/image_thumb-8-790.png\" alt=\"restart hp proliant server from ilo\" loading=\"lazy\"></p> <p> </p> <p> 3. Scegli <strong> Potenza e termica </strong> sulla sinistra. <br> 4. Nella sezione Pulsante di accensione virtuale, fare clic su <strong> Ripristina </strong> per riavviare il server HP. * </p> <p> * Informazioni: </p> <ul> <li> Il virtuale <strong> Ripristina </strong> ha la stessa funzione del tasto <strong> Ricomincia </strong> comando nel sistema operativo (avvio a caldo). </li> <li> Il virtuale <strong> Avvio freddo </strong> ha la stessa azione del pulsante <strong> Spegnimento </strong> comando nel sistema operativo. Se si preme il pulsante &quot;Avvio a freddo&quot;, il server si spegnerà e si riavvierà dopo circa 8 secondi. </li> </ul> <p> <img src=\"images/image_thumb-9-784.png\" alt=\"How to Reboot an HP Server using iLO 5 web interface.\" loading=\"lazy\"></p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}