{"title":"Come aprire PowerShell come amministratore nella cartella corrente in Esplora file (Windows 10)","content":"<p> Se desideri aprire PowerShell o PowerShell come amministratore, in qualsiasi posizione/cartella in Esplora file, continua a leggere questo tutorial. Come sai, i soliti modi per aprire PowerShell in Windows 10 sono cercarlo utilizzando la ricerca di Cortana o (più veloce) premere il pulsante <strong> Vincere <img src=\"images/image_thumb8_thumb_thumb-479.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"></strong> + <strong> X </strong> tasti per aprire il &quot;menu Power User&quot; ed eseguire Windows PowerShell da lì. </p> <p><img src=\"images/image_thumb-54-350.png\" alt=\"PoweShell Admin (Win + X menu)\" loading=\"lazy\"></p> <p> </p> <p> Sebbene questi metodi siano utili, a volte è necessario aprire PowerShell in una posizione/cartella specifica. Per farlo, segui le istruzioni di seguito. </p> <h4> Come aprire Windows PowerShell in una posizione specifica in Windows 10. </h4> <p> 1. Passare alla cartella in cui si desidera aprire PowerShell. <br> 2. <strong> tieni premuto </strong> il <strong> CAMBIO </strong> chiave e <strong> tasto destro del mouse </strong> ovunque all&#39;interno della cartella. <br> 3. Dal menu di scelta rapida, selezionare <strong> Apri la finestra di PowerShell qui </strong> per <strong> </strong> apri una nuova finestra di PowerShell su quella cartella. </p> <p> </p> <p><img src=\"images/image_thumb-55-793.png\" alt=\"Open PoweShell at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Se si desidera aprire &quot;PowerShell come amministratore&quot; in qualsiasi cartella, fare clic su <strong> File </strong> menu e selezionare <strong> Apri Windows PowerShell come amministratore </strong> . * </p> <p> * Nota: come puoi vedere dal menu &quot;File&quot;, puoi anche aprire una finestra &quot;semplice&quot; di PowerShell. </p> <p><img src=\"images/image_thumb-56-830.png\" alt=\"Open PoweShell As Administrator at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p><strong> Aiuto aggiuntivo: </strong> Se sei un fan delle scorciatoie da tastiera, un altro modo per aprire PowerShell (Admin) è premere il tasto <strong> Alt </strong> + <strong> F </strong> + <strong> S </strong> + <strong> UN </strong> chiavi in ​​ordine. </p> <p> È tutto gente! Ha funzionato per te? Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}