{"title":"Come aprire sempre Chrome in modalità di navigazione in incognito.","content":"<p> Se stai cercando un modo per fare in modo che Chrome si apra sempre in modalità di navigazione in incognito, continua a leggere di seguito. Quando avvii Chrome in modalità di navigazione in incognito, l&#39;attività del browser rimane riservata agli altri utenti che utilizzano lo stesso dispositivo. In modalità di navigazione in incognito, Chrome non salverà la cronologia di navigazione, i cookie e le informazioni inserite nei moduli. </p> <p> Il modo manuale, per avviare una nuova sessione di Chrome in modalità di navigazione in incognito, è accedere al menu di Chrome <img src=\"images/image_thumb10_thumb-963.png\" alt=\"image_thumb[10]\" loading=\"lazy\"> e per selezionare &quot;Nuova finestra di navigazione in incognito&quot;, oppure premere CTRL + MAIUSC + N. </p> <p><img src=\"images/image_thumb-42-832.png\" alt=\"Chrome New incognito window\" loading=\"lazy\"></p> <p> </p> <p> In questo articolo troverai le istruzioni, su come avviare sempre Google Chrome in modalità di navigazione in incognito. </p> <h4> Come avviare sempre Google Chrome in modalità di navigazione in incognito. </h4> <p> Se desideri avviare Chrome sempre in modalità di navigazione in incognito, crea un nuovo collegamento Chrome e modifica le sue proprietà, come segue: </p> <p> 1, <strong> Fare clic con il pulsante destro del mouse </strong> sopra <strong> Google Chrome </strong> scorciatoia e seleziona <strong> Proprietà </strong> . <br> 2. A <strong> Generale </strong> scheda, aggiungi l&#39;interruttore &quot;–incognito&quot; (senza virgolette), alla fine della riga di destinazione e fai clic su <strong> ok </strong> : </p> <p> per esempio. &quot;C:\\Programmi\\Google\\Chrome\\Application\\chrome.exe&quot; –incognito </p> <p><img src=\"images/image_thumb-43-798.png\" alt=\"How to Always Open Chrome in Incognito mode.\" loading=\"lazy\"></p> <p> 3. D&#39;ora in poi, quando avvii Chrome dal collegamento modificato, Chrome si aprirà in modalità di navigazione in incognito. * </p> <p><strong> * MANCIA: </strong> Se desideri aprire Chrome in modalità di navigazione in incognito, quando apri un collegamento ipertestuale (URL) dalla tua e-mail o da un altro programma, devi modificare il registro. Fare quello: </p> <blockquote> <p> 1. Aprire il <strong> Editor del Registro di sistema </strong> . <br> 2. Nel registro, vai alla seguente chiave: </p> <ul> <li> <p> HKEY_CLASSES_ROOT\\ChromeHTML\\shell\\open\\comando </p> </li> </ul> <p> 3. Nel riquadro di destra fare doppio clic su <strong> Predefinito </strong> Valore della stringa REG_SZ. </p> </blockquote> <p><img src=\"images/image_thumb-44-612.png\" alt=\"open url in chrome incognito\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4.  Aggiungi l&#39;interruttore, aggiungi la parola &quot;navigazione in incognito&quot; (senza virgolette), prima di &quot;%1&quot; e fai clic su <strong> ok </strong> . </p></blockquote> <blockquote><p> per esempio. Modificare i dati del valore da: </p> <p> &quot;C:\\Programmi\\Google\\Chrome\\Application\\chrome.exe&quot; — &quot;%1&quot; </p> <p> per: </p> <p> &quot;C:\\Programmi\\Google\\Chrome\\Application\\chrome.exe&quot; –incognito &quot;%1&quot; </p></blockquote> <p><img src=\"images/image_thumb-45-148.png\" alt=\"open url chrome incognito - registry\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. D&#39;ora in poi, quando fai clic su un URL (HTML), Chrome lo aprirà in modalità di navigazione in incognito. </p></blockquote> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}