{"title":"Come creare copie shadow dei file con l&#39;Utilità di pianificazione in Windows 10.","content":"<p> In un precedente tutorial ho menzionato il modo per eseguire il backup dei file personali con <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cronologia file </a> in Windows 10. In questo tutorial mostrerò come creare automaticamente copie shadow dei tuoi file personali utilizzando l&#39;Utilità di pianificazione. Le copie shadow dei tuoi file ti permetteranno di ripristinare un file o una cartella specifici a una versione precedente (punto nel tempo). </p> <p> La funzionalità Copia Shadow è stata introdotta per la prima volta in Windows Server 2003 e poi aggiunta alle versioni Windows Vista e 7, come parte della funzionalità Ripristino configurazione di sistema. Il processo &#39;Shadow copy&#39; può eseguire copie di backup e snapshot dello stato corrente del sistema e dei file personali, anche se in uso. Il processo di recupero dei file dalle copie shadow è più comunemente noto come &quot;Ripristina versioni precedenti&quot;. </p> <h4> Come creare quotidianamente una copia shadow dei file in Windows 10. * </h4> <p><strong> * Appunti: </strong><br> 1. Utilizzando le istruzioni seguenti, sarai in grado di creare copie shadow giornaliere (istantanee) dell&#39;intero volume &quot;C:\\&quot;. (File di sistema di Windows e dati personali) <br> 2. Le copie shadow possono essere utilizzate per ripristinare i file in un momento precedente, utilizzando la funzione &quot;Ripristina versione precedente&quot; o utilizzando un&#39;utilità di terze parti che può accedere alle copie shadow, come il <a href=\"https://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowExplorer </a> o il <a href=\"https://www.nirsoft.net/utils/shadow_copy_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowCopyView </a> . <br> 3. Le copie Shadow <strong> non può essere utilizzato per ripristinare il sistema </strong> in un momento precedente, utilizzando il <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> Ripristino del sistema </a> attrezzo. Se vuoi essere in grado di ripristinare il tuo sistema utilizzando Ripristino configurazione di sistema, procedi e <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Attiva la protezione Ripristino configurazione di sistema. </a> <br> 4. Infine, tieni presente che le copie shadow create non sono un backup affidabile, perché le &quot;copie shadow&quot; sono memorizzate sull&#39;unità principale C:\\ e se l&#39;unità si guasta perderai tutti i tuoi dati. Per creare un backup affidabile dei tuoi dati, leggi le istruzioni in questo articolo: <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Come eseguire il backup dei file personali con la cronologia dei file in Windows 10. </a></p> <p> </p> <p><strong> Per creare versioni precedenti dei tuoi file personali utilizzando le copie shadow: </strong></p> <p> 1. Apri <strong> Agenda </strong> . Se non sai come farlo, allora... </p> <blockquote><p> 1. Nella casella di ricerca digita <strong> Compito </strong> o <strong> Agenda </strong> . <br> 2. Aprire l&#39;&quot;Utilità di pianificazione&quot; dai risultati della ricerca. </p></blockquote> <p><img src=\"images/image_thumb-31-630.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. In Utilità di pianificazione fare clic su <strong> Crea attività </strong> . </p> <p><img src=\"images/image_thumb-23-462.png\" alt=\"How to Start ThrottleStop at Windows Startup\" loading=\"lazy\"></p> <p> </p> <p> 3. A <strong> Generale </strong> scheda: </p> <blockquote><p> 1. Digitare &quot;Crea copia shadow dei miei file&quot; come nome dell&#39;attività. <br> 2. <strong> Dai un&#39;occhiata </strong> il <strong> Esegui con i massimi privilegi </strong> scatola. </p></blockquote> <p> Nota: se si desidera avviare l&#39;attività in background, posizionare un punto su <strong> Esegui se l&#39;utente è connesso o meno </strong> opzione e quindi digitare la password di accesso. </p> <p><img src=\"images/image_thumb-62-499.png\" alt=\"create shadow copies task windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Quindi selezionare <strong> Trigger </strong> scheda e fare clic <strong> Nuovo </strong> . <br> 4a. Nella finestra &quot;Nuovo trigger&quot;, specifica la frequenza con cui creare un&#39;istantanea dei tuoi file e fai clic su <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-63-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Quindi selezionare il <strong> Azioni </strong> scheda e fare clic <strong> Nuovo </strong> . <br> 5a. Nella finestra &quot;Nuova azione&quot;: </p> <blockquote><p> 1. Seleziona <strong> Avvia un programma </strong> . <br> 2. In &quot;Programma/script&quot;, digitare: <strong> wmic </strong><br> 3. In &quot;Aggiungi argomenti (opzionale)&quot; digita: </p> <ul> <li><strong> chiamata shadowcopy create Volume=C:\\ </strong></li> </ul> <p> 4. Al termine, fare clic su <strong> OK. </strong></p></blockquote> <p><img src=\"images/image_thumb-66-640.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Fare clic su <strong> ok </strong> di nuovo per chiudere le proprietà dell&#39;attività pianificata. </p> <p><img src=\"images/image_thumb-67-138.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Per creare il tuo primo backup, fai clic con il pulsante destro del mouse sull&#39;attività e seleziona <strong> Correre </strong> . </p> <p><img src=\"images/image_thumb-68-388.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Hai finito! D&#39;ora in poi, ogni volta che desideri ripristinare un file/cartella alla sua versione precedente, fai clic destro su di esso e seleziona <strong> Ripristina versioni precedenti </strong> . </p> <p><img src=\"images/image_thumb-69-568.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Informazioni utili: <br> </strong> 1. Lo spazio massimo allocato che può essere utilizzato per archiviare le copie replicate è la quantità di spazio che Ripristino configurazione di sistema potrebbe utilizzare per archiviare nei punti di ripristino. <br> 2. Per scoprire lo spazio di archiviazione utilizzato e massimo allocato per le copie Shadow, dare questo comando nel prompt dei comandi (amministratore): </p> <ul> <li><strong> lista vssadmin shadowstorage </strong></li> </ul> <p><img src=\"images/image_thumb-76-672.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Per modificare lo spazio massimo allocato per le copie replicate e i punti di ripristino del sistema, accedere a <strong> Protezione del sistema </strong> impostazioni per il <strong> Disco locale (C:) </strong><br> 4. Se si desidera eliminare tutte le copie shadow salvate, è necessario eliminare anche i punti di ripristino salvati. Se vuoi farlo, fai clic su <strong> Elimina tutti i punti di ripristino </strong> pulsante nelle impostazioni di protezione del sistema. </p> <p><img src=\"images/image_thumb-77-662.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> È tutto! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}