{"title":"Come disabilitare i dispositivi di archiviazione USB nel sistema operativo Windows 10/8/7.","content":"<p> In alcune aziende c&#39;è la necessità di disabilitare i dispositivi di archiviazione USB, al fine di impedire ai dipendenti di copiare i dati sensibili dell&#39;azienda, o per prevenire il rischio di malware che potrebbe essere eseguito da un dispositivo di archiviazione USB. </p> <p> In questo tutorial troverai le istruzioni su come disabilitare i dispositivi rimovibili USB come le unità USB sul sistema operativo Windows 10/8/7 o in Windows Server 2016/2012. </p> <h2> Come disabilitare l&#39;accesso alle unità USB in Windows. </h2> <h3> Metodo 1. Disabilitare i dispositivi di archiviazione USB dal registro. </h3> <p> * Nota: questo metodo funziona su tutte le edizioni di Windows 10, 8 o 7 (Home e Professional) e nelle versioni di Windows Server. </p> <p> Per bloccare le unità USB in Windows utilizzando il Registro di sistema: </p> <p> 1. Premere contemporaneamente Windows <img src=\"images/image_thumb36-173.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo <strong> regedit </strong> &amp; stampa <strong> Accedere. </strong></p> <p><img src=\"images/image_thumb7-312.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Passare alla seguente chiave nel riquadro di sinistra: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\UsbStor </strong></li> </ul> <p> 4. Nel riquadro di destra, fare doppio clic su <strong> Inizio </strong> valore. </p> <p><img src=\"images/image_thumb-47-900.png\" alt=\"How to Disable USB Storage Devices - Registry\" loading=\"lazy\"></p> <p> </p> <p> 5. Modificare i dati del valore da 3 a <strong> 4 </strong> e clicca <strong> OK. * </strong></p> <p> * Nota: reimpostare i dati di questo valore su <strong> 3 </strong> e i dispositivi di archiviazione USB verranno nuovamente abilitati. </p> <p><img src=\"images/image_thumb-48-559.png\" alt=\"Disable USB Drive \" loading=\"lazy\"></p> <p> </p> <p> 6. Chiudere l&#39;editor del registro e <strong> disconnettersi </strong> qualsiasi unità USB. * </p> <p> * Nota: la restrizione non funziona per le unità USB già collegate. </p> <p> 7. <strong> Ricomincia </strong> il tuo PC. <br> 8. D&#39;ora in poi, tutte le unità USB sono bloccate e non saranno accessibili, con errore: &quot; <em> Posizione non disponibile. L&#39;unità non è accessibile. L&#39;accesso è negato </em> &quot;. * </p> <p><img src=\"images/image_thumb-53-502.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h3> Metodo 2. Disabilitare l&#39;accesso ai dischi USB utilizzando i Criteri di gruppo. * </h3> <p> * Nota: questo metodo funziona nelle versioni Windows 10, 8 o 7 Professional e nelle versioni Windows Server. </p> <p> Per impedire l&#39;accesso a tutti i dispositivi di archiviazione rimovibili in Windows utilizzando i criteri: </p> <p> 1. Premere contemporaneamente Windows <img src=\"images/image_thumb36-342.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo <strong> gpedit.msc </strong> &amp; Stampa <strong> Accedere. </strong></p> <p><img src=\"images/image_thumb-78-178.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Nel riquadro di sinistra, vai a: </p> <ul> <li><strong> Configurazione computer &gt; Modelli amministrativi &gt; Sistema &gt; <strong> Accesso agli archivi rimovibili </strong></strong></li> </ul> <p> 4. Nel riquadro di destra aprire il <strong> Dischi rimovibili: nega l&#39;accesso in lettura </strong> politica. </p> <p><img src=\"images/image_thumb-51-107.png\" alt=\"Block USB Storage Devices - Policy\" loading=\"lazy\"></p> <p> </p> <p> 5. Impostare l&#39;impostazione dei criteri su <strong> Abilitato </strong> e clicca <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-52-585.png\" alt=\"Disable Removable Storage Access\" loading=\"lazy\"></p> <p> </p> <p> 6. Chiudere l&#39;Editor criteri di gruppo e <strong> disconnettersi </strong> qualsiasi unità USB collegata. * </p> <p> * Nota: la restrizione non funziona per le unità USB già collegate. </p> <p> 7. <strong> Ricomincia </strong> il tuo PC. <br> 8. Dopo il riavvio se colleghi un dispositivo di archiviazione USB e provi ad accedervi riceverai l&#39;errore: &quot; <em> Posizione non disponibile. L&#39;unità non è accessibile. L&#39;accesso è negato </em> &quot;. * </p> <p> È tutto gente! Quale metodo ha funzionato per te? Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}