{"title":"COME: Elimina cronologia Internet, password e cookie dal browser Web (Chrome, Firefox, IE)","content":"<p> Quando visiti un sito web con il tuo browser web, il sito web invia alcune informazioni al browser e il browser memorizza tali informazioni in piccoli file di testo chiamati <strong> biscotto </strong> S. I cookie memorizzano le preferenze dell&#39;utente su quel sito web, ad es. i dati di accesso, in modo che l&#39;utente non debba reinserire i dati di accesso (nome utente e/o password) quando torna sullo stesso sito web. I cookie possono anche conservare una cronologia di quali pagine del sito Web l&#39;utente ha visitato, in modo che l&#39;utente non debba ricordarle o navigare attraverso tutte le pagine del sito Web, finché non trova ciò che desidera. </p> <p> Allo stesso tempo, quando visiti un sito Web, il browser memorizza una copia locale di tutte le pagine Web visitate, al fine di risparmiare la larghezza di banda della connessione e ridurre il tempo di caricamento delle pagine Web, la volta successiva che le visiti. Questa &quot;copia locale delle pagine web&quot; è nota come &quot; <strong> File temporanei di Internet </strong> &quot;di <strong> cache </strong> . </p> <p> Cookies e Cache, dopo qualche tempo possono contenere una notevole quantità di spazio su disco e c&#39;è la necessità di cancellarli. In altri casi potrebbe essere necessario eliminare la cache del browser e i cookie al fine di ricaricare totalmente il contenuto del sito web o per motivi di sicurezza e privacy: ad es. se non vuoi, una terza persona per scoprire quali pagine web hai visitato (aka: &quot; <strong> Cronologia di navigazione </strong> &quot;) o quali sono i tuoi dati di accesso a un sito web (es. GMAIL). </p> <p> In questo tutorial troverai due (2) semplici modi per eliminare la cronologia di navigazione, i file temporanei Internet (cache) e i cookie da Internet Explorer, Chrome e Firefox. </p> <h4> Come cancellare la cronologia di navigazione web, le password salvate e i cookie in Chrome, Firefox e Internet Explorer. </h4> <h5><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Metodo 1. Cancella i dati di navigazione da un browser specifico. </a></h5> <h5><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metodo 2. Elimina i dati di navigazione da tutti i browser Web con un clic! </a></h5> <p> </p> <h5> Metodo 1. Elimina cronologia, cache e cookie da un browser specifico. </h5> <p> In generale, ogni browser Web dispone di opzioni per rimuovere i dati di navigazione memorizzati tramite il menu Impostazioni / Opzioni, ma se si desidera accedere facilmente a tali opzioni (senza dover navigare con il mouse nel menu del browser), premere <strong> Ctrl </strong> + <strong> Cambio </strong> + <strong> Elimina </strong> chiavi insieme nella finestra del browser aperta. Così… </p> <p><strong> Per eliminare la cronologia di navigazione, la cache e i cookie da Internet Explorer: </strong></p> <p> 1. Apri Internet Explorer e premi <strong> Ctrl </strong> + <strong> Cambio </strong> + <strong> Elimina. <br> </strong> 2. Seleziona il tipo di informazioni che desideri eliminare e fai clic su <strong> Elimina </strong> pulsante. </p> <p><img src=\"images/image_thumb-18-750.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> Per eliminare la cronologia di navigazione, la cache e i cookie da Chrome: </strong></p> <p> 1. Avvia Chrome e premi <strong> Ctrl </strong> + <strong> Cambio </strong> + <strong> Elimina. <br> </strong> 2. Scegli il tipo di informazioni che vuoi cancellare e poi premi <strong> ELIMINARE I DATI </strong> . </p> <p><img src=\"images/image_thumb-19-667.png\" alt=\"clear chrome history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p><strong> Per eliminare la cronologia di navigazione, la cache e i cookie da Firefox: </strong></p> <p> 1. Apri Firefox e premi contemporaneamente <strong> Ctrl </strong> + <strong> Cambio </strong> + <strong> Elimina. <br> </strong> 2. Seleziona i dati che desideri rimuovere da Firefox e fai clic su <strong> Chiaro ora. </strong></p> <p> </p> <p><img src=\"images/image_thumb-20-864.png\" alt=\"clear firefox history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> Metodo 2. Elimina cronologia del browser, cache e cookie da tutti i browser Web contemporaneamente. </h5> <p> Se vuoi semplificarti la vita, puoi usare il <a href=\"https://www.ccleaner.com/\" target=\"_blank\" rel=\"nofollow noopener\"> CCleaner </a> utility per eliminare facilmente i file temporanei Internet, la cronologia e i cookie da tutti i browser Web in uso, con un clic. </p> <p> 1. <a href=\"https://www.ccleaner.com/ccleaner/download\" target=\"_blank\" rel=\"nofollow noopener\"> Scarica </a> e installa la versione gratuita dell&#39;utilità CCleaner. </p> <p> 2. Avvia <strong> CCleaner </strong> e vai a <strong> finestre </strong> e il <strong> Applicazioni </strong> opzioni della scheda, per selezionare quali informazioni si desidera eliminare dai browser web. </p> <p> 3. Al termine, fare clic su <strong> Esegui pulitore </strong> . </p> <p><img src=\"images/image_thumb-21-173.png\" alt=\"clear internet history cache cookies - ccleaner\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> È tutto! Ha funzionato per te? </p> <p> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}