{"title":"CORREZIONE: reimposta il periodo di tolleranza di 120 giorni sul server RDS 2016/2012.","content":"<p> Se hai installato un server RDS 2016 a scopo di test e il periodo di grazia per la licenza RDS è scaduto, continua a leggere di seguito per sapere come reimpostare il periodo di grazia di 120 giorni. Come forse saprai quando installi il Server RDS 2016 hai 120 giorni per installare le licenze di accesso client Desktop remoto (RD CAL), altrimenti gli utenti non saranno più in grado di stabilire sessioni RDP sul server Host sessione Desktop remoto, con l&#39;errore &quot;The remote la sessione desktop è stata disconnessa perché non sono disponibili server licenze desktop remoto per fornire una licenza&quot;. </p> <p><img src=\"images/image_thumb-32-368.png\" alt=\"Reset 120 Days Grace Period on RDS Server 2012/2016\" loading=\"lazy\"></p> <p> </p> <h4> Come reimpostare il periodo di tolleranza della licenza RDS su Server 2012 o 2016. * </h4> <p><strong> * Importante: </strong> Applicare le istruzioni di seguito, solo se si utilizza RDS Server 2016 in un ambiente di test. Se desideri utilizzare il server RDS in un ambiente di produzione, procedi e acquista RD CAL. </p> <p> Per estendere il periodo di grazia di 120 giorni su RDS Licensing Server: </p> <p> 1. Aprire l&#39;editor del registro e navigare con la seguente chiave: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\\RCM\\GracePeriod </li> </ul> <p> 2. Fare clic con il pulsante destro del mouse sul tasto &quot;GracePeriod&quot; e selezionare <strong> Permessi. </strong></p> <p><img src=\"images/image_thumb-33-473.png\" alt=\"Reset Grace Period RDS 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Quindi fare clic su <strong> Avanzate </strong> . </p> <p><img src=\"images/image_thumb-34-585.png\" alt=\"Reset RDS Grace Period\" loading=\"lazy\"></p> <p> </p> <p> 4. Selezionare il <strong> Amministratori </strong> oggetto e fare clic <strong> modificare </strong> . </p> <p><img src=\"images/image_thumb-18-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Modificare i permessi in <strong> Pieno controllo </strong> e clicca <strong> OK. </strong></p> <p><img src=\"images/image_thumb-19-737.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Fare clic con il tasto destro sul valore &quot;L$RTMTIMEBOMB...&quot; e selezionare <strong> Elimina </strong> . </p> <p><img src=\"images/image_thumb-35-208.png\" alt=\"Reset RDS Licensing Grace Pariod\" loading=\"lazy\"></p> <p> </p> <p> 7. Chiudere l&#39;editor del registro e riavviare il server RDS. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}