{"title":"Come visualizzare le intestazioni dei messaggi senza aprire il messaggio e-mail in Outlook 2016/2019.","content":"<p> Come forse saprai, &quot;Message Headers&quot; (alias &quot;Message Source&quot; o &quot;Internet Headers&quot; in Outlook), contiene tutti i dettagli tecnici di un messaggio di posta elettronica ricevuto. In particolare, le &quot;Intestazioni del messaggio&quot; di un messaggio di posta elettronica contengono, oltre alle consuete informazioni (mittente, ora di invio, ecc.), il software utilizzato per comporre il messaggio e i server passati prima che ti venisse recapitato . </p> <p> Per visualizzare l&#39;origine/le intestazioni del messaggio nell&#39;applicazione desktop di Microsoft Outlook, è possibile utilizzare uno dei seguenti modi: </p> <ol> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Come visualizzare le intestazioni dei messaggi in Outlook 2016/2019 dopo aver aperto il messaggio di posta elettronica? </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Come visualizzare le intestazioni dei messaggi in Outlook 2016/2019 senza aprire il messaggio di posta elettronica. </a></li> </ol> <p> </p> <h2> Come visualizzare le intestazioni dei messaggi in Outlook 2016/2019 dopo aver aperto la posta elettronica. </h2> <p> Il modo consueto per visualizzare l&#39;origine del messaggio di un messaggio di posta elettronica in Microsoft Outlook 2016/2019 è aprire l&#39;e-mail e visualizzarne le proprietà: </p> <p> 1. Aprire il messaggio di posta elettronica (nella propria finestra) e fare clic su <strong> File </strong> menù. </p> <p><img src=\"images/image_thumb-36-771.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Da <strong> File </strong> menu, fare clic su <strong> Proprietà </strong> . </p> <p><img src=\"images/image_thumb-37-974.png\" alt=\"View message headers outlook\" loading=\"lazy\"></p> <p> </p> <p> 3. Guarda <strong> intestazioni Internet, </strong> per visualizzare l&#39;origine del messaggio di posta elettronica (dettagli). </p> <p> * Nota: selezionare e copiare il testo delle intestazioni Internet nel Blocco note, per una lettura più semplice. </p> <p><img src=\"images/image_thumb-38-976.png\" alt=\"View Internet headers in Outlook\" loading=\"lazy\"></p> <p> </p> <h2> Come visualizzare le intestazioni dei messaggi in Outlook 2016/2019 senza aprire il messaggio di posta elettronica. </h2> <p> Il problema della visualizzazione dell&#39;origine del messaggio (intestazioni Internet) dopo aver aperto il messaggio di posta elettronica è che se il messaggio contiene un malware potresti esporre il tuo computer a dei rischi. Per evitare ciò, procedi e segui le istruzioni seguenti per poter leggere la fonte del messaggio senza aprire l&#39;e-mail. </p> <p> 1. Nella finestra principale di Outlook, scegli <strong> File </strong> -&gt; <strong> Opzioni </strong> . <br> 2. Seleziona <strong> Personalizza il nastro </strong> a sinistra e a destra: </p> <p> un. A <strong> Scegli i comandi da </strong> elenco a discesa, selezionare <strong> Comandi non nella barra multifunzione. <br> </strong> b. Assicurati che nelle Schede Principali sia <strong> Casa (posta) </strong> è selezionato e fare clic su <strong> Nuovo gruppo </strong> e quindi fare clic su <strong> Rinominare. </strong></p> <p><img src=\"images/image_thumb-39-295.png\" alt=\"How to view the Message Headers in Outlook 2016-2019 \" loading=\"lazy\"></p> <p> c. <strong> Rinominare </strong> il &quot; <strong> Nuovo gruppo </strong> &quot; per &quot; <strong> Intestazioni Internet </strong> &quot; e clicca <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-40-856.png\" alt=\"image\" loading=\"lazy\"></p> <p> d. Ora scegli <strong> Opzioni messaggio </strong> dall&#39;elenco dei comandi e fare clic su <strong> Inserisci </strong> . </p> <p><img src=\"images/image_thumb-41-344.png\" alt=\"image\" loading=\"lazy\"></p> <p> e. Ora dovresti vedere le &quot;Opzioni messaggio&quot; sotto il nuovo gruppo che hai creato (&quot;Intestazioni Internet&quot;). Clic <strong> ok </strong> per applicare le modifiche <strong> . </strong></p> <p><img src=\"images/image_thumb-42-209.png\" alt=\"view message source without opening email outlook\" loading=\"lazy\"></p> <p> 3. Ora sul tuo <strong> Casa </strong> scheda, dovresti vedere un nuovo pulsante chiamato &quot;Opzioni messaggio - Intestazioni Internet&quot;. <br> 5. D&#39;ora in poi, evidenzia semplicemente il messaggio di cui desideri visualizzare la fonte del messaggio e fai clic sul pulsante &quot;Opzioni messaggio&quot; per visualizzare la fonte del messaggio senza dover aprire il messaggio nella sua finestra. </p> <p><img src=\"images/image_thumb-43-460.png\" alt=\"view headers without opening email outlook\" loading=\"lazy\"></p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}