{"title":"Come eseguire il backup dei file personali con la cronologia dei file in Windows 10.","content":"<p> In questo tutorial ti mostrerò come configurare Windows 10 per creare automaticamente copie e istantanee dei tuoi file utilizzando lo strumento di backup Cronologia file, in modo da poterli ripristinare (se necessario), utilizzando il &quot;Ripristina versioni precedenti&quot; caratteristica. </p> <p> Come avrai già notato, per impostazione predefinita, Windows 10 non conserva le versioni precedenti dei tuoi file o cartelle, come in Windows 7. Questo sta accadendo, perché Windows 10 non utilizza più il servizio &quot;Volume Shadow Copy&quot; per scatta istantanee dei tuoi file, ma utilizza solo lo strumento di backup &quot;Cronologia file&quot;. </p> <p> La &quot;Cronologia file&quot; è un eccellente strumento di backup integrato in Windows 10, che può essere configurato per eseguire copie e istantanee dei file in una posizione di archiviazione alternativa rispetto all&#39;unità principale (ad esempio su un&#39;unità USB, rete, ecc.) . * </p> <p> * Nota: l&#39;unica limitazione dello strumento &quot;Cronologia file&quot; è che non consente di scegliere l&#39;unità C: come destinazione di backup alternativa. se non possiedi un&#39;unità secondaria disponibile per il backup, continua a leggere questo tutorial per scoprire come aggirare questa limitazione... </p> <ul> <li><strong> Articolo correlato: </strong> <a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Come creare copie shadow dei file con l&#39;Utilità di pianificazione in Windows 10. </a></li> </ul> <h4> Come eseguire il backup dei file personali con lo strumento di backup della cronologia dei file in Windows 10. </h4> <p> 1. Come accennato in precedenza, per eseguire il backup dei file con lo strumento di backup Cronologia file, è necessario disporre di un&#39;unità di archiviazione disponibile collegata al PC (ad es. o un dispositivo di archiviazione NAS). * </p> <p> * Nota: se non possiedi un dispositivo di archiviazione alternativo, hai le seguenti opzioni: </p> <blockquote><p> A. To <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> riduci le dimensioni dell&#39;unità principale C:\\ </a> e con lo spazio libero disponibile per creare una nuova unità per archiviare il backup, oppure... </p> <p> B. Per archiviare il backup sull&#39;unità principale C:\\. In questo caso, crea una nuova cartella sull&#39;unità C: e chiamala &quot;FileHistory&quot; (o come preferisci) e continua sotto... </p></blockquote> <p> 2. Vai a Windows <strong> Pannello di controllo </strong> e sotto <strong> Sistema e sicurezza, </strong> clic <strong> Salva backup </strong><strong> copie dei tuoi file con Cronologia file. </strong></p> <p><img src=\"images/image_thumb-42-924.png\" alt=\"How to Backup & Keep Previous Versions of Files in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 3. Ora, secondo il tuo caso, esegui quanto segue: </p> <ul> <li><strong> Caso A. </strong> Se possiedi un&#39;unità disponibile per il backup, allora: </li> </ul> <blockquote><p> un. Clicca il <strong> Accendere </strong> sullo schermo per abilitare la &#39;Cronologia file&#39;. <br> b. Continuare a <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> passo-4 </a> di seguito per configurare le impostazioni di backup di &quot;Cronologia file&quot;. </p></blockquote> <p><img src=\"images/image_thumb-44-788.png\" alt=\"Turn On File History Windows 10\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Caso B: </strong> Se non possiedi un&#39;unità disponibile per il backup della cronologia file o se desideri archiviare il backup in rete, allora: </li> </ul> <blockquote><p> un. Clic <strong> Seleziona un percorso di rete. </strong></p></blockquote> <p><img src=\"images/image_thumb-56-796.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Nella schermata successiva: </p> <p> 1. Se si desidera salvare il backup sulla rete, digitare il percorso di rete completo della posizione di archiviazione del backup e fare clic su <strong> Seleziona cartella </strong> . </p> <p> 2. Se desideri salvare il backup sull&#39;unità principale C:\\, digita il percorso di rete completo della cartella di backup locale sull&#39;unità C:\\, in questo modulo: * </p> <ul> <li> <strong> \\\\Nome-Computer\\C$\\FileHistory </strong></li> </ul> <p> * Appunti: <br> 1. Sostituisci il valore &quot;Nome computer&quot; con il nome del tuo PC. (Per trovare il nome del tuo computer, fai clic con il pulsante destro del mouse sull&#39;icona &quot;Questo PC&quot; in Esplora risorse). <br> 2. Tieni presente che salvare il backup dei file personali nella stessa unità in cui sono già archiviati <strong> non è una soluzione affidabile </strong> . Per sicurezza, archivia sempre il backup su un altro dispositivo di archiviazione. </p></blockquote> <p> es.: se il nome del computer è &quot;Pegasus&quot;, digita: &quot;\\\\Pegasus\\C$\\FileHistory&quot; </p> <p><img src=\"images/image_thumb-53-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> c. Nella schermata successiva, fare clic su <strong> ok </strong> . </p></blockquote> <p><img src=\"images/image_thumb-54-349.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> d. Ora fai clic su <strong> Accendere </strong> per abilitare lo strumento di backup Cronologia file, quindi continuare sotto per configurare le impostazioni di backup. </p></blockquote> <p><img src=\"images/image_thumb-48-620.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Per configurare le opzioni di backup di &quot;Cronologia file&quot;, fare clic su <strong> Impostazioni avanzate </strong> sulla sinistra. </p> <p><img src=\"images/image_thumb-49-919.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4a. poi a <strong> Impostazioni avanzate </strong> opzioni, imposta la frequenza con cui eseguire il backup dei file e per quanto tempo conservare le versioni salvate. Al termine, fare clic su <strong> Salvare le modifiche </strong> . </p> <p><img src=\"images/image_thumb-61-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Infine clicca <strong> Corri adesso </strong> per fare il tuo primo backup. * </p> <p><img src=\"images/image_thumb-55-463.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Aiuto aggiuntivo – Note: <br> 1. Per impostazione predefinita, la &quot;Cronologia file&quot; esegue un backup delle cartelle &quot;Librerie&quot; (Desktop, Documenti, Preferiti, Musica, OneDrive, Immagini e video). Se desideri escludere una di queste cartelle dal backup, includere altre cartelle o rivedere tutte le opzioni di backup di Cronologia file, vai a: </p> <ul> <li> <p><strong> impostazioni <img src=\"images/image_thumb-58-467.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Aggiornamento e sicurezza </strong> &gt; <strong> Backup </strong> &gt; <strong> Più opzioni. </strong></p> </li> </ul> <p><img src=\"images/image_thumb-57-938.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Per ripristinare i file dal backup &quot;Cronologia file&quot;, accedere a una delle seguenti posizioni: </p> <ul> <li><strong> Pannello di controllo </strong> &gt; <strong> Cronologia file </strong> &gt; <strong> Ripristina i file personali. </strong></li> <li><strong> impostazioni <img src=\"images/image_thumb-59-275.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Aggiornamento e sicurezza </strong> &gt; <strong> Backup </strong> &gt; <strong> Più opzioni </strong> &gt; <strong> Ripristina i file da un backup corrente. </strong></li> </ul> <p> 3. Per ripristinare selettivamente un file o una cartella alla versione precedente, fare clic con il pulsante destro del mouse sul file (o sulla cartella) e selezionare <strong> Ripristina versioni precedenti </strong> . </p> <p><img src=\"images/image_thumb-60-867.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> È tutto! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}