{"title":"Come trasferire e-mail e impostazioni di Thunderbird su un nuovo computer","content":"<p> Questo tutorial contiene istruzioni dettagliate su come trasferire i messaggi di posta elettronica di Thunderbird, le impostazioni dell&#39;account e le rubriche su un altro computer. L&#39;applicazione di posta elettronica Thunderbird memorizza tutti i dati in una cartella del profilo che ha l&#39;estensione &quot;.default&quot; alla fine del nome. (ad es. &quot;wyhsxcvs.default&quot;). Per impostazione predefinita, questa cartella del profilo è archiviata nella seguente posizione sul tuo computer: </p> <ul> <li> C:\\Utenti\\\\AppData\\Roaming\\Thunderbird\\Profiles\\ <strong> .predefinito </strong></li> </ul> <p><img src=\"images/image_thumb-14-425.png\" alt=\"How to Transfer Thunderbird Emails & Data to a New Computer.\" loading=\"lazy\"></p> <p> Quindi, se vuoi spostare i tuoi dati di Thunderbird su un nuovo computer, devi trasferire la cartella &quot;Thunderbird&quot; principale sul nuovo computer, quindi puntare Thunderbird a quella cartella. </p> <h4> Come spostare il profilo Thunderbird su un altro PC. </h4> <h6> Passaggio 1. Copia la cartella del profilo di Thunderbird dal vecchio computer. </h6> <p> </p> <p> Sul vecchio computer, vai alla posizione di archiviazione dei dati di Thunderbird. Fare quello: </p> <p> 1. Apri Thunderbird. <br> 2. Dal menu <img src=\"images/image_thumb21_thumb-959.png\" alt=\"image_thumb[21]\" loading=\"lazy\"> , scegli <strong> Aiuto </strong> -&gt; <strong> Informazioni sulla risoluzione dei problemi. <br> </strong> 3. A <strong> Cartella profilo </strong> linea, clic <strong> Cartella aperta </strong> . </p> <p><img src=\"images/image_thumb-8-878.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Chiudere l&#39;applicazione Thunderbird. <br> 5. Nella finestra di Explorer, fare clic su <strong> Roaming </strong> . </p> <p><img src=\"images/image_thumb-9-272.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> copia </strong> e <strong> Incolla </strong> il <strong> Thunderbird </strong> cartella su un supporto di memorizzazione con spazio libero sufficiente. (ad esempio un&#39;unità USB esterna). </p> <p><img src=\"images/image_thumb-10-958.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Passaggio 2. Trasferire il profilo Thunderbird sul nuovo computer. </h6> <p> 1. <a href=\"https://www.thunderbird.net/en-US/download/\" target=\"_blank\" rel=\"nofollow noopener\"> Scarica </a> e installa Thunderbird sul nuovo PC. * </p> <p><strong> * Importante: </strong> Al termine del processo di installazione, <strong> deselezionare </strong> l&#39;opzione &quot;Avvia Mozilla Thunderbird ora&quot; e fare clic su <strong> finire </strong> . </p> <p><img src=\"images/image_thumb-11-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Collegare l&#39;unità USB (con la cartella &quot;Thunderbird&quot;) al nuovo computer. <br> 3. Fare clic con il pulsante destro del mouse sulla cartella &quot;Thunderbird&quot; e fare clic su <strong> copia </strong> . <br> 4. Premi il tasto Windows <img src=\"images/image_thumb8_thumb-1-464.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 5. Digita il seguente comando <strong> </strong> e premi <strong> Accedere: </strong></p> <ul> <li><strong> %appdata% </strong></li> </ul> <p><img src=\"images/image_thumb-12-421.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Nelle finestre di Explorer, fare clic con il pulsante destro del mouse su uno spazio vuoto e fare clic su <strong> Incolla </strong> . </p> <p><img src=\"images/image_thumb-13-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Avvia Thunderbird e dovresti vedere tutte le tue e-mail, le rubriche e le impostazioni dell&#39;account, come sul tuo vecchio computer. </p> <p> È tutto! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}