{"title":"Come reinstallare Windows 10 se Windows non si avvia","content":"<p> In questo tutorial troverai istruzioni dettagliate su come reinstallare Windows 10, se Windows non si avvia. In un precedente tutorial ho menzionato il modo per <a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"nofollow noopener\"> reinstallare Windows 10 utilizzando la funzione &quot;RESET this PC feature </a> . Tuttavia, &quot;RESET this PC&quot; è disponibile solo se Windows 10 può avviarsi normalmente o se è possibile avviare il menu &quot;Avvio avanzato&quot; dopo l&#39;avvio su Windows (l&#39;opzione &quot;RESET this PC&quot; non è disponibile quando si avvia da USB). </p> <p> Questo tutorial contiene le istruzioni per reinstallare Windows 10 se Windows non si avvia, senza perdere i file. </p> <h2> Come reinstallare Windows 10 se Windows non può essere avviato. </h2> <p><strong> Requisiti </strong> Nota: per reinstallare Windows 10 se Windows non si avvia normalmente, sarà necessario avviare il computer da un supporto di installazione di Windows (USB o DVD) e abilitare il menu Opzioni avanzate (menu tasto F8). Se non possiedi un supporto di installazione di Windows, puoi crearne uno utilizzando <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Strumento di creazione multimediale di Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Come creare un supporto di installazione USB di Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Come creare un supporto di installazione DVD di Windows 10. </a></li> </ul> <p> 1. Avviare il computer dal supporto di installazione di Windows. <br> 3. Premere <strong> Il prossimo </strong> nella schermata delle opzioni della lingua. <br> 4. Scegli <strong> Ripara il tuo computer </strong> . <br> 5. Quindi scegli <strong> Risoluzione dei problemi -&gt; </strong><strong> Opzioni avanzate -&gt; Prompt dei comandi. </strong></p> <p> 6. Nella finestra del prompt dei comandi, digitare il seguente comando e premere <strong> Accedere: </strong></p> <ul> <li><strong> bcdedit /set {default} bootmenupolicy legacy </strong></li> </ul> <p><img src=\"images/image_thumb-33-821.png\" alt=\"advanced boot options\" loading=\"lazy\"></p> <p> 7. Tipo <strong> Uscita </strong> per chiudere la finestra del prompt dei comandi. <br> 8. Rimuovere il supporto di installazione di Windows. <br> 9. Chiudere tutte le finestre per riavviare o spegnere il PC. </p> <p> 10. <strong> stampa </strong> il <strong> F8 </strong> chiave <strong> ripetutamente </strong> durante l&#39;accensione del computer. </p> <p> 11. In &quot;Menu Opzioni avanzate&quot;, evidenziare &quot; <strong> Ripara il tuo computer </strong> opzione &quot; e quindi premere then <strong> ACCEDERE </strong> . </p> <p><img src=\"images/image_thumb-13-334.png\" alt=\"Repair your Computer in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 12. Nella schermata &quot;Scegli un&#39;opzione&quot;, seleziona <strong> Risoluzione dei problemi </strong> e quindi fare clic su <strong> Ripristina questo PC -&gt; Conserva i miei file. </strong> * </p> <p> Appunti: <br> 1. Il &quot; <strong> Conserva i miei file&quot; </strong> opzione, rimuoverà tutte le app e le impostazioni ma manterrà i tuoi file personali. <br> 2. Il <strong> &quot;Rimuovi tutto&quot; </strong> opzione, rimuoverà tutte le app, le impostazioni e i file. Selezionando questa opzione, il tuo PC verrà ripristinato allo stato pulito. <br> 3. Se scegli di &quot;Rimuovi tutto&quot;, assicurati di avere un backup recente dei tuoi file personali su un altro supporto di memorizzazione (ad esempio un disco USB), altrimenti tutti i tuoi file andranno persi. </p> <p><img src=\"images/image_thumb-14-296.png\" alt=\"How to Reinstall Windows 10 if Windows Won't Boot.\" loading=\"lazy\"></p> <p> </p> <p> 13. Nella schermata successiva, scegli un account con privilegi di amministratore. ) e nella schermata successiva digita la tua password e clicca su <strong> Il prossimo </strong> . </p> <p><img src=\"images/image_thumb-15-869.png\" alt=\"How to Reinstall Windows 10 if Windows cannot Boot.\" loading=\"lazy\"></p> <p> 14. Digitare la password per l&#39;account selezionato e fare clic su <strong> Continua. </strong></p> <p><img src=\"images/image_thumb-16-692.png\" alt=\"How to Reinstall Windows 10 if Windows fails to boot.\" loading=\"lazy\"></p> <p> </p> <p> 15. Attendere il completamento dell&#39;installazione. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa guida. </p>"}