{"title":"Come nascondere o mostrare le barre di scorrimento nel menu Start, nelle impostazioni o nelle app di Windows 10","content":"<p> Come avrai notato, in Windows 10, quando si avvia il menu Start, l&#39;app Impostazioni o quando si lavora in un&#39;app Store, la barra di scorrimento è invisibile per impostazione predefinita e viene visualizzata solo quando si sposta il cursore sul lato destro dell&#39;area aperta finestra. Questo comportamento era un po&#39; fastidioso e per fortuna Microsoft nell&#39;ultimo aggiornamento delle funzionalità di Windows 10 1803 (aprile 2018) ha aggiunto l&#39;opzione per visualizzare sempre la barra di scorrimento in tutte le finestre aperte (ad esempio, nel menu Start nell&#39;app Impostazioni, ecc.) . </p> <p><img src=\"images/image_thumb-446.png\" alt=\"Show Scroll Bar in Windows 10 \" loading=\"lazy\"></p> <p> Questo tutorial contiene istruzioni su come nascondere o mostrare sempre le barre di scorrimento in tutte le finestre e applicazioni aperte, in Windows 10 v1803 (o successivo). </p> <h4> Come mostrare o nascondere la barra di scorrimento nel menu Start, nelle impostazioni o nelle app di Windows 10 </h4> <p> 1. Dal <strong> Inizio </strong> <img src=\"images/image_thumb-38-810.png\" alt=\"image\" loading=\"lazy\"> menu scegli <strong> impostazioni </strong> <img src=\"images/image_thumb-44-476.png\" alt=\"image\" loading=\"lazy\"> . </p> <p> 2. Apri <strong> Facile accesso </strong> impostazioni. </p> <p><img src=\"images/image_thumb-1-268.png\" alt=\"display scroll bar windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Fare clic su Display a sinistra e quindi &quot;trascinare&quot; il <strong> Nascondi automaticamente le barre di scorrimento in Windows </strong> passa a <strong> Spento. </strong></p> <p><img src=\"images/image_thumb-3-742.png\" alt=\"always show scroll bars windows 10\" loading=\"lazy\"></p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}