{"title":"Come recuperare file DBX di Outlook Express GRATIS.","content":"<p> Outlook Express è un programma client di posta elettronica apparso per la prima volta in Windows XP. Ma anche oggi (anno 2018) alcuni clienti lo utilizzano ancora, come principale programma di posta elettronica. Uno dei problemi principali di Outlook Express è il problema del limite di 2 GB. </p> <p> Descrizione del problema con il limite di dimensione di 2 GB in Outlook Express. <br> Quando una delle cartelle principali di Outlook Express (ad es. &quot;Posta in arrivo&quot; o &quot;Inviati&quot;) supera i 2 GB di dimensione, il file di archivio DBX OE corrispondente potrebbe essere danneggiato e la cartella OE potrebbe sembrare vuota. A causa del problema, Outlook Express non può inviare o ricevere e-mail e visualizza l&#39;errore <a href=\"https://www.repairwin.com/fix-outlook-express-error-0x800c0133-due-to-2gb-size-limit/\" target=\"_blank\" rel=\"nofollow noopener\"> 0x800c0133 </a> durante l&#39;operazione di invio/ricezione. </p> <p> In questo tutorial ti mostrerò come riparare un file DBX danneggiato da Outlook Express e recuperare le tue email! </p> <h4> Come riparare un file DBX di Outlook Express danneggiato </h4> <p> Se una delle cartelle di Outlook Express (Posta in arrivo, Invia, ecc.) è danneggiata, seguire le istruzioni di seguito per riparare la cartella dell&#39;archivio DBX e recuperare le e-mail. </p> <h6> Passaggio 1. Abilita la visualizzazione dei file nascosti. </h6> <p> 1. Aprire Esplora risorse. <br> 2. Dal <strong> Utensili </strong> menu scegli <strong> Opzioni cartella </strong> . <br> 3. Nella scheda Visualizza, fare clic su <strong> Mostra file e cartelle nascosti </strong> e clicca <strong> OK. </strong></p> <p><img src=\"images/image_thumb-2-290.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Passaggio 2. Individua il file DBX di Outlook Express danneggiato sul disco. </h6> <p> 1. Aprire la cartella del negozio di Outlook Express. Di solito questa cartella si trova nel seguente percorso sul disco: </p> <ul> <li> C:\\Documents and Settings\\\\Local Settings\\Application Data\\Identities\\{}\\Microsoft\\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> per esempio. &quot;C:\\Documents and Settings\\User\\Local Settings\\Application Data\\Identities\\{D8F3C56D-965E-41AE-8A23-A58460ABAE00}\\Microsoft\\ <strong> Outlook Express </strong> &quot; </p></blockquote> <p> 3. Dall&#39;esploratore <strong> Visualizza </strong> menu scegli <strong> Dettagli </strong> . <br> 4. Individuare quale file DBX supera il limite di archiviazione di 2 GB o individuare il file DBX danneggiato. (il file DBX corrotto, è la cartella MAIL che sembra vuota nel programma Outlook Express). </p> <p><img src=\"images/image_thumb-3-887.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Copia il file DBX in un&#39;altra posizione sul disco (ad es. in una nuova cartella sul desktop denominata &quot;CorruptedDBX&quot;). </p> <p> </p> <h6> Passaggio 3. Scarica UnDBX – Utilità di recupero DBX Outlook Express gratuita. </h6> <p> UnDBX è un eccellente e gratuito strumento di riparazione DBX di Outlook Express in grado di estrarre tutte le e-mail di Outlook Express contenute in formato .eml. Inoltre, ha la possibilità di riparare e riparare un file .DBX di Outlook Express danneggiato. </p> <p> Puoi scaricare UnDBX da <a href=\"https://sourceforge.net/projects/undbx/\" target=\"_blank\" rel=\"nofollow noopener\"> Qui </a> . </p> <p> </p> <h6> Passaggio 4. Recupera le email dal file DBX di Outlook Express danneggiato. </h6> <p> 1. Per recuperare le email dal file DBX danneggiato, fare doppio clic per eseguire l&#39;utilità UnDBX. <br> 2. Nell&#39;utilità UnDBX: </p> <blockquote><p> 1. Seleziona la cartella che contiene i file .dbx di Outlook Express e poi <strong> dai un&#39;occhiata </strong> il &quot; <strong> abilitare la modalità di ripristino Recovery </strong> &quot; opzione sotto. <br> 2. <strong> Scegli una cartella di destinazione </strong> sul tuo computer, per archiviare (estrarre) i file .eml. (ad es. in una cartella sul desktop denominata &quot;RecoveredInbox&quot;) <br> 3. Infine clicca <strong> Recuperare </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-645.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Una volta completato il ripristino di UnDBX, aprire Outlook Express. <br> 4. Passare alla cartella in cui UnDBX ha salvato i file .eml estratti. <br> 5. Trascina e rilascia le email estratte, nella cartella corrispondente (in Outlook Express). * </p> <p><strong> * Suggerimento: </strong> Per evitare che le cartelle di Outlook Express vengano nuovamente danneggiate (o per aggirare il limite di 2 GB), suggerisco di trascinare e rilasciare le email in gruppi (ad esempio per anno) e di inserirle in cartelle diverse in OE. Ad esempio, seleziona solo le e-mail dell&#39;anno in corso e trascinale in una nuova cartella OE denominata con l&#39;anno in corso (ad es. &quot;Posta in arrivo 2018&quot;). Quindi ripeti gli stessi passaggi da tutte le altre e-mail degli anni precedenti. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}