{"title":"Come rimuovere la protezione BitLocker dall&#39;unità di sistema C: senza la chiave o la password di ripristino di BitLocker.","content":"<p> Questo articolo contiene istruzioni dettagliate su come rimuovere Protezione BitLocker sull&#39;unità di sistema C: per poter eseguire l&#39;installazione pulita di Windows 10 su un computer protetto da BitLocker, se non si dispone della chiave di ripristino di BitLocker o della password di BitLocker o se non è possibile sbloccare l&#39;unità BitLocker per qualsiasi motivo. </p> <p><img src=\"images/image_thumb-51-648.png\" alt=\"Fix Refresh your PC error: Drive where windows is installed is locked\" loading=\"lazy\"></p> <p> </p> <p> Quando un dispositivo Windows 10 (laptop o PC) è protetto con BitLocker, l&#39;unico modo per accedere al suo contenuto o per ripristinare il dispositivo (utilizzando le funzionalità &quot;Ripristina questo PC&quot;, &quot;Aggiorna il PC&quot;) o reinstallarlo Windows, consiste nello sbloccare l&#39;unità C del sistema operativo utilizzando la chiave di ripristino di BitLocker o la password di BitLocker. </p> <p> Se non disponi della chiave di ripristino di BitLocker o della password di BitLocker per sbloccare l&#39;unità di sistema C: o la chiave di BitLocker non viene accettata, l&#39;unica opzione che hai lasciato (purtroppo) è cancellare completamente l&#39;unità ed eseguire un installazione pulita di Windows. </p> <p> In questo tutorial troverai le istruzioni su come risolvere il seguente problema quando tenti di installare Windows 10 o di ripristinare un dispositivo Windows 10 allo stato predefinito di fabbrica: &quot;L&#39;unità in cui è installato Windows è bloccata. Sblocca l&#39;unità e riprova &quot;. </p> <h4> Come pulire l&#39;installazione di Windows 10 su un computer protetto da BitLocker (FIX: Impossibile installare/aggiornare Windows 10 – L&#39;unità è bloccata con BitLocker.) </h4> <p><strong> Requisiti: </strong> <strong> Un supporto di installazione di Windows 10 (USB o DVD). </strong><br> Se non possiedi un supporto di installazione di Windows, puoi crearne uno utilizzando <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Strumento di creazione multimediale di Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Come creare un supporto di installazione USB di Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Come creare un supporto di installazione DVD di Windows 10. </a></li> </ul> <p> Per eseguire un&#39;installazione pulita di Windows 10, su un computer/unità protetto da BitLocker, seguire le istruzioni seguenti: * </p> <p><strong> * ATTENZIONE: LA PROCEDURA QUI SOTTO CANCELLERA&#39; TUTTI I DATI MEMORIZZATI SULL&#39;UNITÀ BLOCCATA. PROCEDI SOLO SE TU <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> IMPOSSIBILE SBLOCCARE L&#39;UNITÀ/COMPUTER PROTETTI DA BITLOCKER. </a></strong></p> <p> 1. Avviare il sistema dal supporto di installazione di Windows 10. * </p> <p> * Nota: <strong> </strong> Per poter avviare da Windows Media (USB o DVD) seguire i passaggi seguenti: </p> <ul> <li><strong> Metodo 1: </strong> Dopo l&#39;accensione, premere il tasto funzione corrispondente (di solito è il tasto &quot;F12&quot; o &quot;F8&quot;) per visualizzare le opzioni &quot;Ordine di avvio&quot; o &quot;Menu di avvio&quot;. Quindi seleziona il dispositivo USB (o il DVD) che contiene il supporto di installazione di Windows (file) e premi Invio. </li> <li><strong> Metodo 2: </strong> Accedere alla configurazione del BIOS (Impostazioni) e impostare il supporto di installazione di Windows come &quot;Primo dispositivo di avvio&quot; nel menu &quot;Ordine di avvio&quot;. Poi <strong> Salva ed esci </strong> dalle impostazioni del BIOS. </li> </ul> <p> 2. Nella schermata sottostante premere il tasto <strong> CAMBIO </strong> + <strong> F10 </strong> tasti per avviare il prompt dei comandi. (o premere <strong> Il prossimo </strong> &gt; <strong> Ripara il mio computer </strong> &gt; <strong> Risoluzione dei problemi </strong> &gt; <strong> Prompt dei comandi </strong> ). * </p> <p> * Nota: se è stata richiesta la chiave di ripristino, fare clic su <strong> SALTA questa unità </strong> . </p> <p><img src=\"images/image_thumb15_thumb-290.png\" alt=\"How to Remove Updates from the Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. Nel prompt dei comandi dare i seguenti comandi in ordine: </p> <ul> <li><strong> diskpart </strong></li> <li><strong> elenco disco </strong></li> <li><strong> seleziona disco 0 </strong></li> <li><strong> elenco volume </strong></li> </ul> <p> 4. Ora individua quale dei volumi elencati ha la dimensione maggiore in GB. Comunemente il volume più grande è quello in cui è installato Windows (l&#39;unità bloccata). * </p> <p> * per esempio. Nello screenshot qui sotto il &quot;Volume 2&quot; ha le dimensioni maggiori. </p> <p> </p> <p><img src=\"images/image_thumb-10-992.png\" alt=\"fix drive is locked Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Quindi seleziona il volume più grande digitando questo comando: * </p> <ul> <li><strong> seleziona il numero del volume </strong></li> </ul> <p> * Nota: modifica il numero del volume al comando precedente in base al tuo caso (ad es. &quot;seleziona volume 2&quot;) </p> <p> 5. Infine elimina il volume selezionato dando questo comando: </p> <p> </p> <ul> <li><strong> elimina l&#39;override del volume </strong></li> </ul> <p><img src=\"images/image_thumb-14-714.png\" alt=\"delete volume override\" loading=\"lazy\"></p> <p> </p> <p> 6. Tipo <strong> Uscita </strong> per chiudere lo strumento DISKPART e quindi chiudere il prompt dei comandi. <br> 7. Spegnere e quindi riaccendere il dispositivo. <br> 8. Avviare dal supporto di installazione di Windows. <br> 9. Fare clic su <strong> Il prossimo </strong> poi <strong> Installa ora </strong> . <br> 10. Scegliere &quot;Non ho un codice prodotto&quot; e quindi accettare il contratto di licenza. <br> 11. Selezionare &quot;Installazione personalizzata&quot; e quindi eliminare tutte le partizioni/volumi rimanenti sul disco. </p> <p><img src=\"images/image_thumb-12-362.png\" alt=\"cannot reset windows 10 drive locked with bitlocker\" loading=\"lazy\"></p> <p> </p> <p> 12. Al termine, scegli &quot;Spazio non allocato&quot; e fai clic su <strong> Il prossimo. <br> </strong> 13. Seguire le istruzioni sullo schermo per <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> installazione pulita di Windows 10 </a> . </p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo problema. </p>"}