{"title":"Come proteggere con password una cartella in Windows 10 (Blocca cartella con password).","content":"<p> Questo tutorial contiene due diversi metodi gratuiti e sicuri per proteggere con password una cartella nel sistema operativo Windows 10/8/7. Se blocchi una cartella con una password, non sarà accessibile a nessuno oltre a te. Proteggere una cartella con una password è utile nei casi in cui condividi il tuo computer con altri e non vuoi che qualcun altro acceda e legga i tuoi file privati. </p> <ul> <li><strong> Articolo correlato: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Come proteggere con password il tuo PC Windows 10 con BitLocker </a> . </strong></li> </ul> <h4> Come bloccare una cartella con una password in Windows 10. </h4> <h6> Metodo 1. Come bloccare e crittografare i file con 7-zip (Windows tutte le versioni). </h6> <p> Il metodo più semplice e sicuro per proteggere una cartella con una password in Windows è utilizzare l&#39;utilità di archiviazione 7-Zip, che supporta anche la crittografia. Per crittografare e proteggere con password una cartella/file con 7-zip: </p> <p> 1. Scarica e installa il <a href=\"https://www.7-zip.org/\" target=\"_blank\" rel=\"nofollow noopener\"> 7-Zip </a> programma di archiviazione. <br> 2. Fare clic con il tasto destro sulla cartella (o file) che si desidera proteggere con una password e scegliere: <strong> 7-Zip </strong> &gt; <strong> Aggiungi all&#39;archivio </strong> . </p> <p><img src=\"images/image_thumb-28-978.png\" alt=\"How to Password Protect a Folder\" loading=\"lazy\"></p> <p> </p> <p> 3. Nelle opzioni &quot;Aggiungi all&#39;archivio&quot;, specificare una password complessa e quindi fare clic su <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-29-728.png\" alt=\"set password to archive with 7-zip\" loading=\"lazy\"></p> <p> </p> <p> 4. Quindi elimina la cartella (o il file) non compresso e il gioco è fatto! </p> <h6> Metodo 2. Come crittografare una cartella con protezione EFS (Windows Pro ed Enterprise). </h6> <p> La protezione EFS è uno strumento di crittografia integrato, nelle edizioni Windows 10 Professional ed Enterprise. Se si protegge una cartella o un file con crittografia EFS è molto difficile per altri accedere ai file crittografati, senza disporre della chiave di decrittazione (chiave PFX del certificato). </p> <p> L&#39;unico aspetto negativo della crittografia EFS è che la crittografia verrà rimossa se si copiano i file crittografati su un altro computer di rete o se si inviano i file crittografati tramite posta elettronica. </p> <p> Inoltre, quando si crittografano i file EFS, la chiave di decrittografia (certificato) viene archiviata localmente sul computer. Ciò significa che chiunque abbia la tua password avrà accesso anche ai tuoi file crittografati. Per questo motivo, se si crittografano i file con la crittografia EFS, specificare una password di accesso sicura e non condividerla con altri. </p> <ul> <li><strong> Articolo correlato: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> Come decifrare i file crittografati EFS e rimuovere la crittografia EFS. </a></strong></li> </ul> <p><strong> Per crittografare una cartella o un file con EFS: </strong><br> 1. Fare clic con il pulsante destro del mouse sulla cartella (o sul file) che si desidera proteggere e selezionare <strong> Proprietà </strong> . <br> 2. Nella scheda Generale, fare clic su <strong> Avanzate </strong> . </p> <p><img src=\"images/image_thumb-13-582.png\" alt=\"enable efs protection\" loading=\"lazy\"></p> <p> </p> <p> 3. Seleziona <strong> Cripta i file per proteggere i dati </strong> e quindi fare clic su <strong> OK. </strong></p> <p><img src=\"images/image_thumb-14-983.png\" alt=\"How to Lock Folder with Password - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Quindi fare clic su <strong> Applicare </strong> e <strong> ok </strong> nuovamente per salvare le modifiche ed uscire. <br> 5. A questo punto Windows ti chiederà di eseguire il backup della chiave di ripristino. Clic <strong> Esegui il backup della chiave di crittografia dei file. </strong></p> <p><img src=\"images/image_thumb-2-823.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Quindi fare clic su <strong> Esegui il backup ora (consigliato) </strong> e salvare la chiave del certificato di decrittografia su un&#39;unità USB. </p> <p><img src=\"images/image_thumb-15-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Nella procedura guidata di esportazione del certificato, fare clic su <strong> Il prossimo </strong> nella schermata di benvenuto. <br> 8. Quindi fare clic su <strong> Il prossimo </strong> di nuovo nella schermata Esporta formato file. </p> <p><img src=\"images/image_thumb-4-842.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. In Opzioni di sicurezza: </p> <blockquote> <p> 1. <strong> Dai un&#39;occhiata </strong> il <strong> Parola d&#39;ordine </strong> scatola. <br> 2. Digitare una password per la chiave del certificato esportata. <br> 3. Seleziona <strong> AES256-SHA256 </strong> crittografia <br> 4. Fare clic su <strong> Il prossimo </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-16-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. Fare clic su <strong> Navigare </strong> e <strong> Salva </strong> il file del certificato (.pfx) sul tuo computer. <br> 11. Al termine, fare clic su <strong> Il prossimo </strong> continuare. </p> <p><img src=\"images/image_thumb-17-804.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. Infine clicca <strong> finire </strong> . </p> <p><img src=\"images/image_thumb-18-449.png\" alt=\"image\" loading=\"lazy\"></p> <p> 13. Al termine dell&#39;esportazione, salvare la chiave del certificato esportata (file .pfx) in un&#39;altra posizione sicura (ad es. su un disco USB). </p> <p><strong> MANCIA: </strong> Quando si crittografa una cartella (o file) con EFS, la chiave di decrittografia (certificato) viene archiviata nella cartella del profilo utente. Quindi, se un altro utente ha la tua password di accesso a Windows, può aprire e leggere i file crittografati. Per evitare che ciò accada, non condividere la password di accesso o rimuovere (disinstallare) il certificato di decrittazione dal tuo profilo quando esci dal PC e reinstallarlo quando torni. * </p> <p> * Nota: per rimuovere e reimportare la chiave di ripristino (certificato), vai a: </p> <blockquote> <p> un. <strong> Pannello di controllo </strong> &gt; <strong> Opzioni Internet. <br> </strong> b. In &quot;Opzioni Internet&quot; fai clic su <strong> Soddisfare </strong> scheda e quindi fare clic su <strong> Certificato </strong> S. <br> c. Nella scheda &quot;Personale&quot; fai clic su <strong> Rimuovere </strong> pulsante, per rimuovere la chiave di decrittazione (certificato), oppure fare clic sul pulsante <strong> Importare </strong> per reinstallare il certificato di decrittografia dall&#39;unità USB. </p> </blockquote> <ul> <li> <p><strong> Articolo correlato: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"noopener noreferrer\"> Come decifrare i file crittografati EFS e rimuovere la crittografia EFS. </a></strong></p> </li> </ul> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione </p>"}