{"title":"Come aggiornare manualmente i componenti di Chrome e Google Chrome.","content":"<p> Ogni volta che è disponibile un nuovo aggiornamento di Chrome, Google Chrome richiede all&#39;utente di riavviare il browser per installare l&#39;aggiornamento. Ma a volte, dopo l&#39;applicazione dell&#39;aggiornamento, Chrome potrebbe bloccarsi o bloccarsi. Questo accade perché Chrome include diversi singoli componenti che potrebbero non essere stati ancora aggiornati e in questo caso devi aggiornarli manualmente. </p> <p> Questo tutorial contiene istruzioni su come aggiornare manualmente i singoli componenti di Chrome e Chrome. </p> <h4> Come aggiornare manualmente Google Chrome e i componenti di Chrome. </h4> <h6> Parte 1. Come aggiornare manualmente Google Chrome. </h6> <p> Per installare l&#39;ultima versione di Google Chrome: </p> <p> 1. Dal menu Chrome <img src=\"images/image_thumb-4-667.png\" alt=\"image\" loading=\"lazy\"> clic <strong> Aiuto -&gt; Informazioni su Google Chrome </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-39-551.png\" alt=\"How to Update Chrome manually\" loading=\"lazy\"></p> <p> </p> <p> 2. Google Chrome verificherà la presenza di aggiornamenti e quindi installerà automaticamente l&#39;ultimo aggiornamento. </p> <p><img src=\"images/image_thumb-40-825.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Una volta completato l&#39;aggiornamento, fare clic su <strong> Rilancio </strong> pulsante. </p> <p><img src=\"images/image_thumb-41-622.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Parte 2. Come aggiornare i singoli componenti di Chrome. </h6> <p> 1. Nella barra degli indirizzi di Chrome, digita: </p> <ul> <li><strong> chrome://components </strong></li> </ul> <p> 2. Fare clic su <strong> Ricerca aggiornamenti </strong> pulsante su ciascun componente di Chrome che desideri aggiornare. </p> <p><img src=\"images/image_thumb-42-446.png\" alt=\"How to Update Chrome Components\" loading=\"lazy\"></p> <p> </p> <p> 3. Al termine dell&#39;aggiornamento, riavvia Chrome. </p> <p> Aiuto aggiuntivo: se dopo l&#39;aggiornamento di Chrome e dei suoi componenti riscontri problemi con il browser, procedi con <a href=\"https://www.repairwin.com/how-to-uninstall-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> rimuovere e reinstallare completamente Chrome </a> . </p> <p> È tutto! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}