{"title":"Come accedere automaticamente a Windows 10/8/7 (senza digitare una password).","content":"<p> Questo tutorial contiene istruzioni su come accedere automaticamente a Windows 10. Imparerai infatti come accedere automaticamente al tuo account utente (Microsoft, account locale o di dominio), senza dover inserire le tue credenziali all&#39;accesso o alla schermata di blocco . Le istruzioni si applicano al sistema operativo Windows 10/8/7. </p> <p> Quando esegui una nuova installazione di Windows 10, ti verrà chiesto di specificare un account utente e una password per utilizzare il computer. A questo punto, puoi utilizzare il tuo account Microsoft (con la password dell&#39;account MS) o creare un nuovo account locale e una nuova password per accedere a Windows. In entrambi i casi (a meno che non crei un account locale con una password vuota), ti verrà chiesto di digitare la password ogni volta che avvii Windows. </p> <p> Proteggere il tuo computer con una password è una buona misura di sicurezza, soprattutto se condividi il tuo computer con altri, o quando viaggi con il tuo laptop, o quando il tuo PC appartiene a un ambiente aziendale. Tuttavia, se sei l&#39;unico utente sul tuo computer desktop autonomo o se stai utilizzando il tuo laptop solo a casa, non è necessario digitare le tue credenziali ogni volta che desideri utilizzarlo. * </p> <p><strong> Avvertimento: </strong> NON ABILITARE L&#39;ACCESSO AUTOMATICO su Windows se condividi il tuo computer con altri, o se viaggi con il tuo laptop o tablet, perché chiunque trovi il tuo computer avrà facile accesso ai tuoi file. </p> <h4> Come accedere automaticamente al tuo account utente in Windows 10/8/7/Vista. (Abilita accesso automatico) </h4> <h6> Metodo 1. Attivare l&#39;accesso automatico utilizzando l&#39;utilità AUTOLOGON. </h6> <p> Microsoft ha progettato uno strumento per automatizzare il processo di accesso in Windows. Lo strumento si chiama &quot;Autologon&quot; e consente di configurare facilmente Windows per l&#39;accesso automatico senza dover digitare le credenziali ad ogni avvio. Il vantaggio di questo strumento è che la password viene memorizzata crittografata nel registro. </p> <p> 1. Scarica <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/autologon\" target=\"_blank\" rel=\"nofollow noopener\"> Accesso automatico </a> utilità. <br> 2. Estrarre il file scaricato. <br> 3. Esegui &quot;autologon.exe&quot; <br> 4. Digita la password e fai clic su <strong> Abilitare </strong> . </p> <p><img src=\"images/image_thumb-44-251.png\" alt=\"windows auto login\" loading=\"lazy\"></p> <p> * Nota: se si desidera disattivare l&#39;accesso automatico, eseguire nuovamente l&#39;utilità e fare clic su <strong> disattivare </strong> . </p> <p> </p> <h6> Metodo 2. Abilitare l&#39;accesso automatico dal pannello di controllo degli account utente. </h6> <p> Il secondo metodo per abilitare l&#39;accesso automatico a Windows 10/8/7 consiste nel disabilitare l&#39;impostazione &quot;Gli utenti devono inserire un nome utente e una password per utilizzare questo computer&quot; nel pannello di controllo degli account utente. Fare quello: </p> <p> Nota: se stai utilizzando un account locale, esiste un altro modo più semplice per forzare l&#39;accesso automatico di Windows: è sufficiente specificare una nuova password vuota (vuota) da Impostazioni &gt; Account &gt; Opzioni di accesso &gt; Modifica password. Quindi digita la password una volta, quindi fai clic su Avanti due volte e su Fine. </p> <p> 1. Premi Finestre <img src=\"images/image_thumb8_thumb_thumb-738.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Nella casella &quot;Apri&quot;, digita: <strong> controllare le password utente2 </strong> &amp; clic <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-29-873.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Nelle opzioni Account utente (scheda &quot;Utenti&quot;), <strong> deselezionare </strong> il <strong> Gli utenti devono inserire un nome utente e una password per utilizzare questa casella di controllo del computer </strong> e quindi fare clic su <strong> Applicare. * </strong></p> <p> * Nota: se vuoi disabilitare l&#39;accesso automatico in futuro, seleziona questa casella. </p> <p><img src=\"images/image_thumb-32-315.png\" alt=\"auto login windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Digita (due volte) la password del tuo account e fai clic su <strong> ok </strong> due volte per chiudere le proprietà dell&#39;account utente. </p> <p><img src=\"images/image_thumb-31-509.png\" alt=\"Auto Login to Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Metodo 3. Abilita l&#39;accesso automatico nel registro (Windows 10/8/7/Vista). </h6> <p> Il metodo finale per disabilitare l&#39;accesso con password, in Windows 10, 8 o 7 OS, è abilitare il registro di accesso automatico. Fare quello: </p> <p> 1. Premi Finestre <img src=\"images/image_thumb8_thumb_thumb-512.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Nella casella &quot;Apri&quot;, digita: <strong> regedit </strong> &amp; clic <strong> ok </strong> . </p> <p><img src=\"images/image_thumb7-114.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Passare a questa chiave dal riquadro di sinistra: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon </li> </ul> <p> 4. Nel riquadro di destra: </p> <blockquote><p> un. Fare clic con il tasto destro in uno spazio vuoto e selezionare <strong> Nuovo </strong> &gt; <strong> Valore stringa. </strong></p> <p><img src=\"images/image_thumb-38-930.png\" alt=\"image\" loading=\"lazy\"></p> <p> b. Rinominare il nuovo valore in <strong> Nome utente predefinito </strong> e premi <strong> accedere </strong> . <br> c. Aprire il valore REG_SZ &quot;DefaultUserName&quot;. <br> d. Digita il nome del tuo account utente locale o il tuo account Microsoft e fai clic su <strong> ok </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-42-933.png\" alt=\"enable auto login registry\" loading=\"lazy\"></p> <p> </p> <p> 5a. Esegui gli stessi passaggi e crea un nuovo valore REG_SZ (Stringa) e chiamalo <strong> Password predefinita </strong> . <br> 5b. Fare doppio clic su &quot;Password predefinita&quot; <strong> &#39; </strong> Valore REG_SZ, digita la tua password nella casella Dati valore e fai clic su <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-43-192.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7a. Infine, crea un nuovo valore REG_SZ e chiamalo <b> Accesso amministratore automatico </b> . <br> 7b. Fare doppio clic sul valore &quot;AutoAdminLogon&quot;, digitare <strong> 1 </strong> nella casella Dati valore e fare clic su <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-41-705.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Chiudere l&#39;editor del registro e riavviare il PC. * </p> <p> * Appunti: <br> 1. Se il tuo computer fa parte di un dominio, devi creare un altro valore REG_SZ con il nome <strong> Nome dominio predefinitoDefault </strong> e poi digitare nella casella dati valore il nome del tuo dominio. <br> 2. Per disabilitare l&#39;accesso automatico in futuro, basta eliminare i valori di stringa appena creati menzionati sopra. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}