{"title":"Come condividere file e cartelle in Windows 10, 8.1 o 7 OS.","content":"<p> La funzione Condivisione file in Windows ti dà la possibilità di condividere facilmente cartelle e file tra gli utenti della tua rete. Condividendo i tuoi file con altri utenti sulla stessa rete, sarai in grado di visualizzare e lavorare con gli stessi file/cartelle. </p> <p> Questo tutorial contiene istruzioni su come condividere cartelle e/o file nei sistemi operativi Windows 10, 8, 8.1 o 7. </p> <h4> Come abilitare la condivisione di file in Windows. </h4> <h5> Passaggio 1. Aggiungi gli utenti richiesti al tuo PC. </h5> <p> Prima di continuare a condividere i tuoi file con altri, aggiungi gli utenti che avranno accesso alla cartella condivisa sul computer. Per eseguire tale attività, seguire le istruzioni nei seguenti articoli, in base alla versione di Windows. </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-create-a-new-user-in-windows-7\" target=\"_blank\" rel=\"nofollow noopener\"> Come aggiungere un nuovo utente in Windows 7. </a></li> <li><a href=\"https://www.repairwin.com/how-to-add-a-new-user-account-in-windows-10-8/\" target=\"_blank\" rel=\"nofollow noopener\"> Come aggiungere un nuovo utente in Windows 10/8.1 </a></li> </ul> <p> </p> <h5> Passaggio 2. Come condividere una cartella o un file con altri. </h5> <p> 1. Fare clic con il pulsante destro del mouse sulla cartella (o sul file) che si desidera condividere e selezionare <strong> Dai accesso a </strong> -&gt; <strong> Persone specifiche. </strong></p> <p><img src=\"images/image_thumb-56-411.png\" alt=\"How to Share Files and Folders in Windows 10, 8.1, 7\" loading=\"lazy\"></p> <p> </p> <p> 2. Utilizzando il menu a discesa, seleziona l&#39;utente con cui desideri condividere i tuoi file e quindi fai clic su <strong> Inserisci </strong> . </p> <p><img src=\"images/image_thumb-57-274.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Ora fai clic sulla freccia in basso, accanto all&#39;utente che hai aggiunto e specifica i suoi permessi di accesso (Livello di autorizzazione) </p> <p><img src=\"images/image_thumb-58-517.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Al termine, premere il tasto <strong> Condividere </strong> pulsante, </p> <p><img src=\"images/image_thumb-59-431.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Prendere nota del collegamento fornito alla cartella condivisa* e fare clic su <strong> Fatto </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-60-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. A questo punto, hai abilitato la condivisione dei file sul tuo computer. Per accedere alla cartella condivisa da un altro PC: </p> <blockquote><p> un. Nella barra degli indirizzi di Explorer, digita il collegamento alla cartella condivisa, come mostrato nel passaggio precedente. (es.&quot;\\\\DESKTOP-HMG31RD\\2Share&quot; senza virgolette) <br> b. stampa <strong> accedere </strong> . <br> c. Digita il nome utente e la password dell&#39;utente a cui hai concesso l&#39;accesso e premi <strong> ok </strong> . </p></blockquote> <p><img src=\"images/image_thumb-61-512.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Informazioni addizionali: <br> 1.Per modificare i permessi dell&#39;utente è sufficiente seguire nuovamente la procedura di cui sopra e modificare il livello di autorizzazione dell&#39;utente. <br> 2. Se vuoi interrompere la condivisione dei file, fai clic con il pulsante destro del mouse sulla cartella/file condivisi e vai su <strong> Dai accesso a </strong> -&gt; e seleziona <strong> Rimuovi accesso </strong> . </p> <p><img src=\"images/image_thumb-62-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo problema. </p>"}