{"title":"Come disabilitare Bitlocker nell&#39;ambiente di ripristino di Windows (WinRE).","content":"<p> Questo tutorial contiene istruzioni su come disabilitare la protezione BitLocker e per decrittografare un&#39;unità crittografata BitLocker in Windows Recovery Environment. Le istruzioni possono essere utili se il computer è protetto da BitLocker e non accetta la chiave di ripristino di BitLocker o la password di BitLocker all&#39;avvio del sistema e non è possibile sbloccare l&#39;unità protetta da BitLocker. </p> <p><img src=\"images/image_thumb-52-511.png\" alt=\"Remove Bitlocker from Windows Recovery Environment \" loading=\"lazy\"></p> <h4></h4> <h4> Come rimuovere la protezione BitLocker e decrittografare l&#39;unità crittografata BitLocker in Windows Recovery Environment (WinRE). </h4> <p><strong> Requisiti: </strong><br> <strong> UN </strong> . <strong> Un supporto di installazione di Windows 10 (USB o DVD). </strong> Se non possiedi un supporto di installazione di Windows, puoi crearne uno utilizzando <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Strumento di creazione multimediale di Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Come creare un supporto di installazione USB di Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Come creare un supporto di installazione DVD di Windows 10. </a></li> </ul> <p><strong> B. La chiave di ripristino di BitLocker o la password di BitLocker: </strong> Per disattivare la protezione Bitlocker, è necessario disporre della password Bitlocker o della chiave di ripristino Bitlocker per sbloccare prima l&#39;unità e poi per decrittografarla. * </p> <p> * Nota: se non si dispone della chiave di ripristino di BitLocker, non è possibile ignorare la protezione di BitLocker. Se un disco è protetto da BitLocker e non si dispone della chiave di ripristino BitLocker o della password per sbloccare l&#39;unità, l&#39;unica opzione disponibile (per utilizzare nuovamente l&#39;unità) è cancellare completamente l&#39;unità seguendo le istruzioni in questo articolo: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Come rimuovere la protezione BitLocker da un&#39;unità senza la chiave o la password di ripristino di BitLocker. </a></p> <p> La chiave di ripristino di Bitlocker è un numero di 48 cifre e può essere trovata nelle seguenti posizioni: </p> <ul> <li> Su una stampa che hai salvato, quando hai abilitato Bitlocker. </li> <li> Su un&#39;unità USB utilizzata durante l&#39;attivazione di Bitlocker per salvare la chiave di ripristino di Bitlocker. </li> <li> Al <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Chiavi di ripristino dell&#39;account Microsoft </a> , utilizzando l&#39;account MS che utilizzi per accedere al tuo dispositivo o che hai aggiunto al dispositivo per scaricare app da Microsoft Store o per attivare MS Office o per la posta elettronica. </li> <li> Sul tuo <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Account Azure </a> per i PC di lavoro che accedono con un account Azure Active Directory. </li> </ul> <p> Una volta trovata la chiave di ripristino di BitLocker o la password ΒitLocker, procedere allo sblocco dell&#39;unità crittografata BitLocker e alla rimozione della crittografia BitLocker in WinRE, seguendo le istruzioni di seguito. </p> <p> Per sbloccare e decrittografare l&#39;unità C: del sistema operativo da WinRE: </p> <p> 1. Avviare il sistema dal supporto di installazione di Windows 10. <br> 2. Nella schermata sottostante premere il tasto <strong> CAMBIO </strong> + <strong> F10 </strong> tasti per avviare il prompt dei comandi. (o premere <strong> Il prossimo </strong> &gt; <strong> Ripara il mio computer </strong> &gt; <strong> Risoluzione dei problemi </strong> &gt; <strong> Prompt dei comandi </strong> ). * </p> <p> * Nota: se è stata richiesta la chiave di ripristino, fare clic su <strong> SALTA questa unità </strong> . </p> <p><img src=\"images/image_thumb15_thumb-548.png\" alt=\"How to disable-unlock bitlocker from Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. Al prompt dei comandi, digitare il seguente comando per visualizzare la lettera di unità dell&#39;unità crittografata: </p> <ul> <li><strong> gestire-bde -status </strong></li> </ul> <p> </p> <p> 4. Quindi procedi a sbloccare l&#39;unità crittografata, utilizzando il seguente comando, in base al tuo caso: </p> <p><strong> Caso A. </strong> Se conosci la chiave di ripristino di BitLocker, dai questo comando: </p> <ul> <li><strong> Manage-bde -unlock drive-lettera: -rp BitLocker-recovery-key​ </strong></li> </ul> <p> * ad esempio: se vuoi sbloccare l&#39;unità &quot;D:&quot; e la chiave di ripristino di bitlocker è: &quot;123456-123456-123456-123456-123456-123456&quot;, digita: </p> <ul> <li> <ul> <li> Manage-bde -unlock <strong> D </strong> : -rp <strong> 123456-123456-123456-123456-123456-123456 </strong></li> </ul> </li> </ul> <p> </p> <p><strong> Caso B. </strong> Se conosci la password di BitLocker per sbloccare l&#39;unità, dai questo comando: </p> <ul> <li><strong> Manage-bde -unlock drive-lettera: -pw BitLocker-Password </strong></li> </ul> <p> * ad esempio: se vuoi sbloccare l&#39;unità &quot;D:&quot; e la password di BitLocker è: &quot;123qwerty&quot;, digita: * </p> <ul> <li> <ul> <li> Manage-bde -unlock <strong> D </strong> : -parola d&#39;ordine <strong> 123qwerty </strong></li> </ul> </li> </ul> <p> </p> <p> 5. Quindi procedere alla decrittografia dell&#39;unità e disattivare la protezione BitLocker con questo comando: </p> <ul> <li><strong> Manage-bde -off drive-lettera: </strong></li> </ul> <p> * ad es.: se si desidera decrittografare l&#39;unità &quot;D:&quot;, digitare: </p> <ul> <li> <ul> <li> gestire-bde –off <strong> D </strong> : </li> </ul> </li> </ul> <p> 6. Il processo di decrittazione con start. Per controllare lo stato di decrittazione, digitare nuovamente il seguente comando e assicurarsi che l&#39;unità sia <strong> Completamente decifrato </strong> e <strong> sbloccato </strong> : </p> <ul> <li><strong> gestire-bde -status </strong></li> </ul> <p><img src=\"images/image_thumb9_thumb-678.png\" alt=\"decrypt bitlocker encrypted drive windows removery environment\" loading=\"lazy\"></p> <p> </p> <p> 7. Al termine, rimuovere il supporto di installazione di Windows e riavviare il computer. * </p> <p> * Nota: se non è possibile avviare Windows, collegare l&#39;unità a un altro computer ed eseguire il backup dei dati personali su un altro supporto. Poi <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> diagnosticare l&#39;unità per problemi </a> e se va bene, rimettere il disco sul computer ed eseguire un <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> installazione pulita di Windows 10 </a> . </p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo problema. </p>"}