{"title":"Come controllare gli aggiornamenti in Office 2019, 2016 o 2013 in Windows 10.","content":"<p> In questo tutorial imparerai come controllare manualmente gli aggiornamenti in Office 2019, 2016 e Office 2013. In tutte le versioni di Office, esistono due modi per installare gli aggiornamenti di Office disponibili: automaticamente e manualmente. </p> <h4> Come aggiornare Office 209/2016/2013/2010 manualmente. </h4> <h6> Metodo 1. Come verificare manualmente gli aggiornamenti di Office in Office 2019, 2016 e Office 2013. </h6> <p> Per controllare e installare manualmente gli aggiornamenti di Office disponibili, in tutte le versioni di Office: </p> <p> 1. Apri un qualsiasi programma di Office (es. Word). <br> 2. Da <strong> File </strong> menu, scegli <strong> account </strong> . * </p> <p> * Nota: in Office 2010 scegliere <strong> Aiuto. </strong></p> <p> 3. Espandi il <strong> Opzioni di aggiornamento </strong> e clicca <strong> Aggiorna ora </strong> . * </p> <p> * Nota: se le &quot;Opzioni di aggiornamento&quot; non sono disponibili, seguire le istruzioni del Metodo-2 di seguito. </p> <p><img src=\"images/image_thumb-19-478.png\" alt=\"How to Check for Updates in Office 2019, 2016 or 2013 in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Metodo 2. Come installare automaticamente gli aggiornamenti di Office per Office 2019, 2016 e Office 2013. </h6> <p> Se desideri che Windows scarichi e installi automaticamente gli aggiornamenti di Office disponibili, vai alle impostazioni di aggiornamento di Windows e controlla la seguente impostazione: </p> <ul> <li> Ricevi aggiornamenti per altri prodotti Microsoft quando aggiorni Windows (Windows 10) </li> <li> Dammi aggiornamenti per altri prodotti Microsoft quando aggiorno Windows (Windows 7) </li> </ul> <h5> Per installare automaticamente gli aggiornamenti di Office in Windows 10. </h5> <p><strong> 1. </strong> Vai a <strong> impostazioni </strong> -&gt; <strong> Aggiornamento e sicurezza -&gt; Opzioni avanzate. </strong></p> <p><img src=\"images/image_thumb-20-149.png\" alt=\"Change Update Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> In Opzioni di aggiornamento, trascina il cursore &quot;Ricevi aggiornamenti per altri prodotti Microsoft quando aggiorni Windows&quot; su <strong> SOPRA. </strong></p> <p><img src=\"images/image_thumb-21-717.png\" alt=\"automatically install office updates windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Passare alla schermata precedente e fare clic su <strong> Controlla gli aggiornamenti </strong> in si desidera installare immediatamente gli aggiornamenti di Office disponibili. </p> <p> </p> <h5> Per installare automaticamente gli aggiornamenti di Office in Windows 7. </h5> <p> 1. Vai a <strong> Pannello di controllo </strong> -&gt; <strong> aggiornamento Windows </strong> e clicca <strong> Cambia impostazioni </strong> . </p> <p><img src=\"images/image_thumb-22-108.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Selezionare il <strong> Dammi aggiornamenti per altri prodotti Microsoft quando aggiorno Windows </strong> casella di controllo e fare clic su <strong> Applicare </strong> . </p> <p> 3. Fare clic su <strong> Controlla gli aggiornamenti </strong> per installare tutti gli aggiornamenti disponibili. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa guida. </p> <p> </p>"}