{"title":"Come impedire a Windows 10 di installare automaticamente le stampanti di rete","content":"<p> Come avrai già notato, Windows 10 installa automaticamente i driver per qualsiasi stampante o altro dispositivo connesso alla rete. Ma, sebbene questa sia una funzione molto utile, è anche molto fastidiosa, specialmente negli ambienti aziendali, dove potresti non volere che tutte le stampanti vengano utilizzate da tutti gli utenti della rete. </p> <p> Ovviamente, se non desideri un dispositivo di rete e le app del produttore, puoi rimuoverlo dal tuo sistema. Ma Windows 10 lo installerà di nuovo automaticamente. Per evitare ciò, è necessario impedire a Windows di installare automaticamente i dispositivi collegati alla rete (stampanti, scanner, fotocamere, ecc.) e le relative app e icone personalizzate del produttore. </p> <h3> Come ARRESTARE Windows 10 per installare automaticamente dispositivi e app di rete </h3> <p> 1. Vai a <strong> Pannello di controllo </strong> . Fare quello: </p> <blockquote><p> un. Digita &quot;pannello di controllo&quot; nella casella di ricerca di Windows <br> b. Clic <strong> Pannello di controllo </strong> dai risultati. </p></blockquote> <p><img src=\"images/image_thumb-53-862.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Impostare il <strong> Visto da </strong> per <strong> Piccole icone </strong> per visualizzare tutti gli elementi del pannello di controllo, quindi fare clic su <strong> Centro connessioni di rete e condivisione. </strong></p> <p><img src=\"images/image_thumb-37-625.png\" alt=\"control panel network and sharing center\" loading=\"lazy\"></p> <p> </p> <p> 3. Scegli <strong> Impostazioni di condivisione avanzate </strong> sulla sinistra <strong> . </strong></p> <p><img src=\"images/image_thumb-38-656.png\" alt=\"Prevent Windows 10 to Install Network Printers Automatically\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Cancella il &quot; <strong> Attiva la configurazione automatica dei dispositivi connessi alla rete&quot; </strong> e clicca <strong> Salvare le modifiche. </strong></p> <p><img src=\"images/image_thumb-39-992.png\" alt=\"Turn Off automatic setup of network connected devices \" loading=\"lazy\"></p> <p> </p> <p><strong> Opzionale: </strong> Se vuoi impedire a Windows 10 di scaricare e installare automaticamente le app del produttore e le icone personalizzate, per qualsiasi dispositivo connesso al PC, allora: </p> <blockquote><p> 1. Vai a <strong> Pannello di controllo </strong> -&gt; <strong> Sistema </strong> . <br> 2. Fare clic su <strong> Protezione del sistema </strong> sulla sinistra. <br> 3. Nella scheda Hardware, fare clic su <strong> Impostazioni di installazione del dispositivo </strong> . </p></blockquote> <p><img src=\"images/image_thumb-40-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. In &quot;Impostazioni di installazione del dispositivo&quot;, scegli  &quot; <strong> No (il tuo dispositivo potrebbe non funzionare come previsto)&quot; </strong> e clicca <strong> Salvare le modifiche </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-728.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa guida. </p>"}