{"title":"Come proteggere il tuo PC con BitLocker in Windows 10.","content":"<p> Questo tutorial contiene istruzioni passo passo su come proteggere con password il tuo PC con la crittografia BitLocker. BitLocker è una funzionalità di crittografia completa del disco inclusa nelle edizioni Windows 10 Professional ed Enterprise e può aiutarti a proteggere i tuoi dati personali da accessi non autorizzati. </p> <p> Immagina il seguente scenario: il tuo laptop personale viene rubato o perso e i tuoi dati privati ​​sono disponibili a occhi indiscreti. Per evitare che ciò accada, leggi questa guida e impara come proteggere con password il tuo PC e i tuoi dati preziosi con una crittografia avanzata, in modo da diventare inaccessibile a chiunque senza la password di decrittazione. </p> <ul> <li><strong> Articolo correlato: <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Come proteggere una cartella con una password. </a></strong></li> </ul> <h4> Come utilizzare BitLocker per crittografare e proteggere il tuo PC Windows 10. </h4> <p> Per proteggere l&#39;unità del sistema operativo, con BitLocker in Windows 10 Pro o Enterprise: </p> <p> 1. Da Windows <strong> Pannello di controllo </strong> , clicca <strong> Sistema e sicurezza </strong> e quindi fare clic su <strong> Crittografia unità Bit Locker </strong> . </p> <p><img src=\"images/image_thumb-33-320.png\" alt=\"How to Protect your PC with BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Accanto all&#39;unità del sistema operativo C:, fare clic su <strong> Attiva BitLocker </strong> . * </p> <p> * Nota: se dopo aver premuto &quot;Attiva BitLocker&quot; viene visualizzato l&#39;errore &quot;Questo dispositivo non può utilizzare un Trusted Platform Module...&quot;, leggi questo articolo per risolvere il problema. </p> <p><img src=\"images/image_thumb-34-100.png\" alt=\"turn on bitlocker operating system drive\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Nella schermata successiva, scegli come vuoi sbloccare l&#39;unità all&#39;avvio. </p> <blockquote><p> 1. Se vuoi sbloccare il tuo PC usando un dispositivo USB clicca <strong> Inserisci un&#39;unità flash USB. <br> </strong> 2. Se vuoi sbloccare il tuo PC digitando una password clicca <strong> Inserisci una password </strong> . (come in questo esempio) </p></blockquote> <p><img src=\"images/image_thumb-35-212.png\" alt=\"enable bitlocker protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Ora digita una password molto forte e fai clic su <strong> Il prossimo </strong> . </p> <p><img src=\"images/image_thumb-36-435.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Ora seleziona dove vuoi salvare* la chiave di ripristino e fai clic su <strong> Il prossimo </strong> . * </p> <p> * Ad esempio: se accedi a Windows 10 con un account Microsoft, fai clic su <strong> Salva sul tuo account Microsoft. </strong> Se accedi a Windows 10 con un account locale, scegli una delle altre opzioni. </p> <p> Appunti: <br> 1. Se salvi la chiave di ripristino di BitLocker sul tuo account Microsoft, puoi visualizzare la chiave dopo l&#39;accesso a <a title=\"https://onedrive.live.com/recoverykey.\" href=\"https://onedrive.live.com/recoverykey.\" target=\"_blank\" rel=\"nofollow noopener\"> https://onedrive.live.com/recoverykey. </a><br> 2. Preferisco sempre archiviare la chiave di ripristino su un&#39;unità USB, per essere pronto a risolvere i problemi di BitLocker. </p> <p> </p> <p><img src=\"images/image_thumb-37-801.png\" alt=\"save bitlocker recovery key\" loading=\"lazy\"></p> <p> </p> <p> 6. Nella schermata successiva lasciare l&#39;impostazione predefinita se il PC e/o l&#39;unità sono nuovi e quindi fare clic su <strong> Il prossimo </strong> ancora. </p> <p><img src=\"images/image_thumb-38-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Nelle opzioni della modalità di crittografia, lasciare l&#39;impostazione predefinita e fare clic su <strong> Il prossimo </strong> . </p> <p><img src=\"images/image_thumb-39-785.png\" alt=\"bitlocker encryption mode\" loading=\"lazy\"></p> <p> </p> <p> 8. Nell&#39;ultima schermata, fare clic su <strong> Continua </strong> , per riavviare e controllare il sistema prima di abilitare la protezione BitLocker. </p> <p><img src=\"images/image_thumb-40-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Al riavvio, ti verrà chiesto di inserire la tua password BitLocker. Digita la tua password e premi <strong> accedere </strong> . * </p> <p> * Nota: se BitLocker non può accettare la password o se si verificano altri problemi, provare una delle seguenti azioni per accedere a Windows: </p> <blockquote><p> 1. Premere il tasto ESC nella schermata Password di BitLocker per accedere alle opzioni di ripristino. <br> 2. Premere ripetutamente il tasto ESC dopo aver acceso il PC per ignorare il test di BitLocker. </p></blockquote> <p> 10. Se i test di BitLocker sono stati superati, dopo l&#39;avvio su Windows 10, BitLocker inizierà a crittografare l&#39;unità del sistema operativo. Per visualizzare lo stato del processo di crittografia, fare clic sulla notifica BitLocker nella barra delle applicazioni o accedere a Pannello di controllo &gt; Crittografia unità BitLocker. </p> <p><img src=\"images/image_thumb-41-171.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}