{"title":"Come bloccare i siti Web su Chrome o Firefox.","content":"<p> Se stai cercando un modo semplice per bloccare un sito Web su Chrome o Firefox, continua a leggere di seguito. </p> <p> Sebbene Internet per la maggior parte di noi sia diventato necessario nella nostra vita quotidiana per il nostro lavoro o divertimento, d&#39;altra parte a volte è utile poter bloccare alcuni siti per evitare distrazioni. Ad esempio, nessuno vuole che il proprio figlio si distragga guardando i video su YouTube mentre legge le lezioni. </p> <p> In questa guida imparerai come bloccare i siti Web in Chrome e <a href=\"#firefox\" target=\"_blank\" rel=\"nofollow noopener\"> Firefox </a> browser. </p> <p> * Nota: se desideri bloccare un sito Web in tutti i browser, leggi questo articolo: <a href=\"https://www.repairwin.com/block-youtube-on-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Come bloccare YouTube su Windows 10. </a></p> <h2> Come bloccare i siti Web su Google Chrome. </h2> <p> Il modo più semplice per bloccare un sito Web in Chrome è utilizzare la famosa estensione BlockSite. L&#39;installazione del componente aggiuntivo BlockSite è simile a qualsiasi altra estensione. </p> <p> 1. Vai a <a href=\"https://chrome.google.com/webstore/detail/blocksite-stay-focused-co/eiimnmioipafcokbfikbljfdeojpcgbh\" target=\"_blank\" rel=\"nofollow noopener\"> Estensione BlockSite </a> nel Chrome Web Store e fai clic su <strong> Aggiungi a Chrome </strong> pulsante. </p> <p><img src=\"images/image_thumb-4-439.png\" alt=\"how to block websites chrome\" loading=\"lazy\"></p> <p> 2. Quando richiesto, fare clic su <strong> Aggiungi estensione </strong> . </p> <p><img src=\"images/image_thumb-5-782.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Al termine dell&#39;installazione, vai al menu Chrome &gt; Altri strumenti &gt; Estensioni </p> <p><img src=\"images/image_thumb-6-830.png\" alt=\"chrome tools extensions\" loading=\"lazy\"></p> <p> 4. Trova il <strong> BlockSite </strong> estensione e clic <strong> Dettagli. </strong></p> <p><img src=\"images/image_thumb-7-415.png\" alt=\"Blocksite details\" loading=\"lazy\"></p> <p> 5. <strong> Aperto </strong> il <strong> Opzioni di estensione </strong> . </p> <p><img src=\"images/image_thumb-8-135.png\" alt=\"How to Block sites chrome\" loading=\"lazy\"></p> <p> 6. Digita il nome del sito che vuoi bloccare (es. <a href=\"http://www.youtube.com\" target=\"_blank\" rel=\"nofollow noopener\"> www.youtube.com </a> ) e premere il simbolo più (+) per aggiungere il sito Web all&#39;elenco dei siti bloccati. </p> <p><img src=\"images/image_thumb-9-298.png\" alt=\"blocked sites chrome\" loading=\"lazy\"></p> <p> 7. Questo è tutto! D&#39;ora in poi, quando proverai a visitare il sito bloccato, verrai informato che il sito è bloccato con l&#39;estensione BlockSite. Per modificare l&#39;elenco dei siti bloccati, fare clic su <strong> Modifica la tua lista </strong> pulsante per apportare le modifiche desiderate o per rimuovere il sito bloccato dall&#39;elenco. </p> <p><img src=\"images/image_thumb-10-951.png\" alt=\"image\" loading=\"lazy\"></p> <h3> Come proteggere con password i siti bloccati nell&#39;estensione BlockSite. </h3> <p> Se vuoi impedire agli utenti di sbloccare un sito bloccato: </p> <p> 1. Aprire il <strong> BlockSite </strong> opzioni di estensione. <br> 2. Vai a <strong> Protezione della password </strong> impostazioni. <br> 3. <strong> Abilitare </strong> l&#39;opzione Proteggi <strong> le tue opzioni BlockSite preferite e la pagina delle estensioni di Chrome con una password </strong> e quindi digita la tua email e una password e fai clic su <strong> Salva. </strong></p> <p><img src=\"images/image_thumb-11-711.png\" alt=\"password protect blocked sites\" loading=\"lazy\"></p> <p> 4. BlockSite ti invierà un&#39;e-mail con un collegamento per verificare il tuo indirizzo e-mail. Dopo la verifica dell&#39;e-mail, la protezione tramite password sarà attiva. </p> <h2> Come bloccare i siti Web in Mozilla Firefox. </h2> <p> 1. Vai a <a href=\"https://addons.mozilla.org/en-US/firefox/addon/blocksite/\" target=\"_blank\" rel=\"nofollow noopener\"> Estensione BlockSite </a> nei componenti aggiuntivi di Firefox. <br> 2. Fare clic su <strong> Aggiungi a Firefox </strong> pulsante. </p> <p><img src=\"images/image_thumb-12-999.png\" alt=\"block websites firefox\" loading=\"lazy\"></p> <p> 2. Quando viene richiesto di consentire l&#39;installazione dell&#39;estensione, fare clic su <strong> Inserisci. </strong></p> <p><img src=\"images/image_thumb-13-588.png\" alt=\"Blocksite firefox\" loading=\"lazy\"></p> <p> 3. Al termine dell&#39;installazione, scegli se desideri bloccare i siti Web nelle finestre private (in incognito) e fai clic su <strong> Va bene </strong> . </p> <p><img src=\"images/image_thumb-14-173.png\" alt=\"how to block site\" loading=\"lazy\"></p> <p> 4. Se vuoi impedire all&#39;estensione BlockSite di leggere i dati sui siti che visiti, fai clic su Forse lettera. </p> <p><img src=\"images/image_thumb-15-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Ora fai clic sull&#39;icona BlockSite e <strong> Modifica elenco blocchi </strong> per specificare quali siti Web si desidera bloccare. </p> <p><img src=\"images/image_thumb-16-657.png\" alt=\"block sites firefox\" loading=\"lazy\"></p> <p> 6. Nella scheda Blocca siti, digita il nome del sito che desideri bloccare (ad es. &quot;facebook.com&quot;) e quindi aggiungilo all&#39;elenco dei siti bloccati. </p> <p><img src=\"images/image_thumb-17-817.png\" alt=\"How to block site Firefox\" loading=\"lazy\"></p> <p> 7. Una volta aggiunti i siti che desideri bloccare, chiudi le impostazioni di BlockSite e il gioco è fatto. </p> <p> Oltre alla sua funzione principale, l&#39;estensione BlockSite ha anche alcune altre funzioni utili come: </p> <ul> <li> <p><strong> Modalità di messa a fuoco </strong> : Blocca i siti per un tempo specifico (ad es. 25 minuti) </p> </li> <li> <p><strong> Protezione della password: </strong> Proteggi le tue impostazioni BlockSite dalla modifica. </p> </li> <li> <p><strong> Blocco per parole: </strong> Blocca gli URL contenenti parole specifiche. </p> </li> </ul> <p> È tutto gente! Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}