{"title":"Come bloccare YouTube su Windows 10.","content":"<p> Poiché l&#39;apprendimento a distanza è diventato parte della vita dei bambini negli ultimi anni, molti genitori stanno cercando un modo per bloccare i video di YouTube durante l&#39;e-learning o ridurre la quantità di tempo che i bambini trascorrono davanti a un computer a guardare video invece di svolgere altre attività. </p> <p> Oltre alla dipendenza da YouTube che preoccupa i genitori, negli ultimi anni sono stati diffusi molti video di YouTube con contenuti inappropriati o pericolosi per i bambini e per questo motivo è necessario limitare l&#39;accesso a YouTube, soprattutto quando non c&#39;è la supervisione dei genitori. </p> <p> In questa guida imparerai come impedire l&#39;accesso al sito web di YouTube su tutti i browser. * </p> <p> * Nota: se vuoi bloccare un sito web solo in Chrome o in Firefox leggi questo articolo: <a href=\"https://www.repairwin.com/block-websites-on-chrome-firefox/\" target=\"_blank\" rel=\"nofollow noopener\"> Come bloccare i siti Web su Chrome e Firefox. </a></p> <h2> Come bloccare YouTube su qualsiasi browser su Windows 10, 8 o 7 OS. </h2> <p> Il modo più affidabile per bloccare qualsiasi sito Web su qualsiasi browser su un PC Windows è utilizzare il file &quot;hosts&quot;. Il <strong> padroni di casa </strong> file è un file del sistema operativo che associa i nomi host (nomi di dominio) agli indirizzi IP. In parole semplici, quando digiti l&#39;indirizzo di un sito web nel tuo browser, il computer guarda prima il locale <strong> padroni di casa </strong> file per risolvere il suo indirizzo IP. Se il nome del sito non appare nel file host, sta cercando di trovare il suo indirizzo IP dal servizio DNS che stai utilizzando sul tuo dispositivo. </p> <p> Per bloccare YouTube su qualsiasi browser Web (ad es. Chrome, Firefox, Edge, ecc.) su Windows tramite il file hosts: </p> <p> 1. Apri <strong> Bloc notes </strong> applicazione <strong> come amministratore </strong> . Fare quello: </p> <blockquote><p> un. genere <strong> bloc notes </strong> nella casella di ricerca </p> <p> b. <strong> Fare clic con il pulsante destro del mouse </strong> sopra <strong> Bloc notes </strong> e seleziona <strong> Esegui come amministratore </strong> . </p> <p><img src=\"images/image_thumb-584.png\" alt=\"run notepad as administrator\" loading=\"lazy\"></p></blockquote> <p> </p> <p> 2. Da <strong> File </strong> menu, selezionare <strong> Aperto. <br> </strong> 3. Passare a questa posizione sul disco: </p> <ul> <li> C:\\Windows\\System32\\drivers\\etc </li> </ul> <p> 4. Cambia il &quot;Tipo di file&quot; in <strong> Tutti i files </strong> e poi apri il <strong> padroni di casa </strong> file </p> <p><img src=\"images/image_thumb-1-968.png\" alt=\"block sites hosts file\" loading=\"lazy\"></p> <p> </p> <p> 5. Alla fine aggiungi le seguenti righe:* </p> <ul> <li> 127.0.0.1    youtube.com </li> <li> 127.0.0.1    www.youtube.com </li> <li> 127.0.0.1    m.youtube.com </li> </ul> <p> * Nota: premere TAB dopo aver digitato 127.0.0.1 </p> <p><img src=\"images/image_thumb-2-460.png\" alt=\"block youtube hosts\" loading=\"lazy\"></p> <p> </p> <p> 6. Al termine, fare clic su <strong> File </strong> &gt; <strong> Salva </strong> e chiudi il blocco note. </p> <p> 7. Infine apri il browser e prova a visitare YouTube. Normalmente dovresti ricevere il messaggio: &quot;Connettiti a Internet. Sei offline. Controlla la tua connessione&quot;. </p> <p><img src=\"images/image_thumb-3-490.png\" alt=\"block youtube.com hosts\" loading=\"lazy\"></p> <p> </p> <p> 8. Hai finito. Se desideri sbloccare YouTube in futuro, segui gli stessi passaggi. ma questa volta rimuovi le tre (3) righe aggiunte nel file hosts o digita il simbolo <strong> # </strong> davanti a ogni riga aggiunta. </p> <p> È tutto gente! Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}