{"title":"Come disabilitare BitLocker in Windows 10.","content":"<p> Questo tutorial contiene istruzioni su come disabilitare la protezione Bitlocker e la crittografia dell&#39;unità in Windows 10. Come forse saprai, la funzione di crittografia BitLocker disponibile nelle versioni Windows 10 pro ed enterprise può aiutarti a proteggere i contenuti del tuo PC da accessi non autorizzati. Ma a volte c&#39;è la necessità di disabilitare Bitlocker su Windows 10, quindi in questa guida puoi trovare come farlo. </p> <p> Se il tuo computer è protetto con BitLocker, all&#39;avvio del sistema ti verrà chiesto di connettere l&#39;unità USB utilizzata durante l&#39;attivazione di BitLocker o di inserire la password di BitLocker per sbloccare l&#39;unità C: per continuare l&#39;avvio. Se non hai nessuno di questi, premi <strong> ESC </strong> per inserire la chiave di ripristino di BitLocker. * </p> <blockquote><p> * Appunti: <br> 1. Se la chiave di ripristino o la password di Bitlocker non vengono accettate all&#39;avvio del sistema, provare a sbloccare e decrittografare il disco rigido su un altro computer Windows 10 o provare a: <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-recovery-environment-winre/\" target=\"_blank\" rel=\"nofollow noopener\"> Sblocca e decrittografa l&#39;unità protetta in Windows Recovery Environment (WinRE). </a><br> 2. Se non riesci a sbloccare l&#39;unità (ad esempio se non possiedi la chiave di ripristino BitLocker o perché la chiave BitLocker non è accettata) e desideri rimuovere la crittografia BitLocker per utilizzare nuovamente l&#39;unità protetta, leggi questo tutorial: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Come rimuovere la protezione BitLocker da un&#39;unità senza la chiave o la password di ripristino di BitLocker </a> . </p></blockquote> <p><img src=\"images/image_thumb-53-752.png\" alt=\"How to Disable BitLocker in Windows 10 GUI - PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Dopo l&#39;avvio su Windows, seguire le istruzioni seguenti per disabilitare la protezione bitlocker e decrittografare l&#39;unità. </p> <h4> Come disattivare la protezione BitLocker e decrittografare un&#39;unità crittografata Bitlocker in Windows 10. </h4> <p> Per disattivare la protezione Bitlocker, è necessario disporre della password Bitlocker o della chiave di ripristino di Bitlocker per sbloccare prima l&#39;unità e poi per decrittografarla. </p> <p> La chiave di ripristino di Bitlocker è una chiave numerica di 48 cifre e può essere trovata nelle seguenti posizioni: </p> <ul> <li> Su una stampa che hai salvato, quando hai abilitato Bitlocker. </li> <li> Su un&#39;unità USB utilizzata durante l&#39;attivazione di Bitlocker per salvare la chiave di ripristino di Bitlocker. </li> <li> Al <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Chiavi di ripristino dell&#39;account Microsoft </a> , utilizzando l&#39;account MS che utilizzi per accedere al tuo dispositivo o che hai aggiunto al dispositivo per scaricare app da Microsoft Store o per attivare MS Office o per la posta elettronica. </li> <li> Sul tuo <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Account Azure </a> per i PC di lavoro che accedono con un account Azure Active Directory. </li> </ul> <p> Una volta trovata la chiave di ripristino di Bitlocker o la password di Bitlocker, procedi a sbloccare l&#39;unità crittografata di Bitlocker e a rimuovere la crittografia di Bitlocker utilizzando uno dei seguenti modi: </p> <ul> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Metodo 1. Disabilita la protezione BitLocker dalla GUI di Windows. </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metodo 2. Disabilita BitLocker e decrittografa un&#39;unità crittografata Bitlocker da PowerShell. </a></li> </ul> <p> </p> <h6> Metodo 1. Come disattivare la protezione Bitlocker nella GUI di Windows 10. </h6> <p> Per disabilitare la protezione sull&#39;unità di sistema C: </p> <p> 1. Vai a Windows <strong> Pannello di controllo </strong> -&gt; <strong> Sistema e sicurezza </strong> e quindi fare clic su <strong> Crittografia unità Bit Locker </strong> . </p> <p><img src=\"images/image_thumb-33-233.png\" alt=\"How to turn off or Turn Onn BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Accanto all&#39;unità del sistema operativo C:, fare clic su <strong> Disattiva BitLocker </strong> . * </p> <p> * Appunti: <br> 1. Se l&#39;opzione &quot;Disattiva BitLocker&quot; non è disponibile, apri <strong> prompt dei comandi come amministratore </strong> e dai il seguente comando: </p> <ul> <li> gestire-bde -off C: </li> </ul> <p> 2. Per vedere lo stato di decrittazione (avanzamento) dell&#39;unità C:, dare questo comando: </p> <ul> <li> gestire-bde -stato C: </li> </ul> <p> </p> <p> </p> <p><img src=\"images/image_thumb-43-236.png\" alt=\"turn off bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Dopo aver disattivato Bitlocker, fare clic sull&#39;icona Bitlocker nella barra delle applicazioni per visualizzare il processo di decrittazione. </p> <p><img src=\"images/image_thumb-41-694.png\" alt=\"remove bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Per disabilitare la protezione su qualsiasi altra unità protetta da BitLocker dalla GUI di Windows: </p> <p> 1. Aprire Esplora risorse e quindi fare doppio clic sull&#39;unità bloccata. <br> 2. Inserisci la password di Bitlocker o fai clic su <strong> Più opzioni </strong> per inserire la chiave di ripristino di Bitlocker, al fine di sbloccare l&#39;unità. </p> <p><img src=\"images/image_thumb-47-646.png\" alt=\"unlock bitlocker windows 10\" loading=\"lazy\"></p> <p> 2. Dopo aver sbloccato l&#39;unità, accedere a <strong> Pannello di controllo </strong> -&gt; <strong> Sistema e sicurezza </strong> -&gt; <strong> Crittografia unità Bit Locker </strong> e dopo aver selezionato l&#39;unità fare clic su <strong> Disattiva BitLocker </strong> per decrittografare l&#39;unità. (vedi gli screenshot qui sopra) </p> <p> </p> <h6> Metodo 2. Come disattivare la protezione BitLocker e decrittografare un&#39;unità crittografata Bitlocker da PowerShell in Windows 10. </h6> <p> 1. Aprire PowerShell come amministratore. Fare quello: </p> <ol> <li> <ol> <li> A <strong> Cortana </strong> la casella di ricerca, digita <strong> powershell </strong></li> <li> Fare clic con il tasto destro su <strong> Windows PowerShell </strong> risultato e selezionare <strong> Esegui come amministratore. </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb_thumb-1-316.png\" alt=\"disable bitlocker powershell windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Quindi controlla lo stato di crittografia di ciascuna unità sul tuo computer, digitando questo comando: </p> <ul> <li><strong> gestire-bde -status </strong></li> </ul> <p> </p> <p> 3. Nota in quale lettera di unità viene visualizzato lo stato di blocco <strong> bloccato </strong> , quindi procedi a sbloccare quell&#39;unità, digitando questo comando: * </p> <ul> <li><strong> Manage-bde -unlock drive-lettera: -rp BitLocker-recovery-key​ </strong></li> </ul> <p> * ad esempio: se vuoi sbloccare l&#39;unità &quot;D:&quot; e la chiave di ripristino di bitlocker è: &quot;123456-123456-123456-123456-123456-123456&quot;, digita: </p> <ul> <li> <ul> <li> Manage-bde -unlock D: -rp 123456-123456-123456-123456-123456-123456 </li> </ul> </li> </ul> <p> </p> <p> * Nota: se conosci la password di Bitlocker, dai questo comando: </p> <ul> <li><strong> Manage-bde -unlock drive-lettera: -pw BitLocker-Password </strong></li> </ul> <p> * ad esempio: se vuoi sbloccare l&#39;unità &quot;D:&quot; e la password di BitLocker è: &quot;123qwerty&quot;, digita: * </p> <ul> <li> <ul> <li> manage-bde -unlock D: -password 123qwerty </li> </ul> </li> </ul> <p> </p> <p> 4. Quindi disabilitare la crittografia bitlocker e decrittografare l&#39;unità crittografata, utilizzando uno dei seguenti comandi: </p> <ul> <li><strong> Disable-BitLocker -MountPoint &quot;lettera di unità:&quot; </strong></li> <li><strong> Manage-bde -off drive-lettera: </strong></li> </ul> <p> * ad esempio: se si desidera disabilitare la crittografia di bitlocker sull&#39;unità &quot;D:&quot;, digitare: </p> <ul> <li> <ul> <li> Disabilita-BitLocker-MountPoint &quot;D:&quot; </li> </ul> </li> </ul> <blockquote> <p> OPPURE digita... </p> </blockquote> <ul> <li> <ul> <li> gestire-bde –off D: </li> </ul> </li> </ul> <p> 5. Al termine del processo di decrittazione, procedere a ricontrollare lo stato della crittografia dando questo comando: </p> <ul> <li><strong> gestire-bde -status </strong></li> </ul> <p> 6. Se viene visualizzato lo stato di blocco <strong> sbloccato </strong> e lo &quot;Stato di conversione&quot; mostra <strong> completamente decifrato, </strong> hai finito! </p> <p><img src=\"images/image_thumb-50-868.png\" alt=\"view bitlocker status\" loading=\"lazy\"></p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo problema. </p>"}