{"title":"Come ripristinare le impostazioni predefinite di Photoshop","content":"<p> Se il programma Photoshop funziona in modo strano, il modo più rapido per risolvere il problema è ripristinare le impostazioni predefinite di Photoshop. In questo tutorial troverai istruzioni dettagliate su come ripristinare le preferenze di Photoshop ai valori predefiniti. </p> <p> Nel programma Adobe Photoshop, tutte le personalizzazioni (opzioni di visualizzazione, opzioni di prestazioni, opzioni di trasparenza, opzioni del cursore, ecc.) vengono salvate nel file &quot;Preferenze di Adobe Photoshop&quot; all&#39;uscita dall&#39;applicazione. Se il file delle preferenze viene danneggiato, il programma Photoshop si comporta in modo strano e quindi l&#39;unico modo per risolvere i problemi è ripristinare le impostazioni delle preferenze ai valori predefiniti. </p> <h4> Come ripristinare le preferenze di Photoshop ai valori predefiniti * </h4> <p> * Nota: i metodi sopra riportati ripristineranno tutte le impostazioni delle preferenze sui valori predefiniti. Se desideri ripristinare uno o tutti gli strumenti di Photoshop in particolare, applica le seguenti azioni: </p> <blockquote><p> 1. Dal menu di Photoshop, fare clic su <strong> finestre </strong> e poi seleziona <strong> Opzioni </strong> articolo. <br> 2. Quindi selezionare lo strumento che si desidera ripristinare dalla casella degli strumenti. <br> 3. Ora fai clic con il pulsante destro del mouse sullo strumento a sinistra della barra delle opzioni e seleziona <strong> Strumento di ripristino </strong> o <strong> Ripristina tutti gli strumenti. </strong></p></blockquote> <p><img src=\"images/image_thumb-25-673.png\" alt=\"reset tools photoshop\" loading=\"lazy\"></p> <h6></h6> <h6> Metodo 1. Ripristina le preferenze all&#39;avvio di Photoshop. </h6> <p> Il primo metodo per ripristinare le impostazioni in Photoshop consiste nell&#39;utilizzare una scorciatoia da tastiera dopo aver avviato Photoshop. Fare quello: </p> <p> 1. <strong> Smettere </strong> Photoshop. <br> 2. <strong> Doppio click </strong> sull&#39;icona di Photoshop e subito <strong> tieni premuto </strong> il <strong> Ctrl+Alt+Maiusc </strong> tasti (in Windows) o il <strong> Comando+Opzione+Maiusc </strong> (in Mac OS). <br> 3. Quando viene chiesto di <strong> &quot;Eliminare il file delle impostazioni di Adobe Photoshop?&quot; </strong> clic <strong> Sì. </strong></p> <p><img src=\"images/image_thumb-24-561.png\" alt=\"delete photoshop settings\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Metodo 2. Ripristina le preferenze dal menu di Photoshop. </h6> <p> 1. Avvia Photoshop. <br> 2. Da <strong> modificare </strong> menu, selezionare <strong> Preferenze </strong> -&gt; <strong> Generale <br> </strong> 3. Fare clic su <strong> Ripristina le preferenze all&#39;uscita. </strong></p> <p><img src=\"images/image_thumb-21-842.png\" alt=\"Reset Adobe Photoshop Preferences on Quit\" loading=\"lazy\"></p> <p> </p> <p> 4. Fare clic su <strong> ok </strong> quando viene chiesto di ripristinare le preferenze all&#39;uscita da Photoshop. </p> <p><img src=\"images/image_thumb-22-194.png\" alt=\"Reset Photoshop Settings on Quit\" loading=\"lazy\"></p> <p> </p> <p> 5. Fare clic su <strong> ok </strong> di nuovo per chiudere la finestra di dialogo Preferenze. <br> 6. Chiudi e riavvia Photoshop. </p> <p> </p> <h6> Metodo 3. Elimina o rinomina il file delle impostazioni di Adobe Photoshop. </h6> <p> Il metodo finale per ripristinare le preferenze di Photoshop ai valori predefiniti consiste nel rinominare o eliminare il file delle impostazioni di Photoshop (Adobe Photoshop %Version% Prefs.psp), nel seguente percorso sul PC:* </p> <ul> <li> C:\\Users\\%Username%\\AppData\\Roaming\\Adobe\\Adobe Photoshop %Version%\\Adobe Photoshop %Version% Settings\\ <strong> Adobe Photoshop %Version% Prefs.psp </strong></li> </ul> <p> * Nota: in MAC OS, vai a: </p> <ul> <li> Utenti\\%Nome utente%\\Libreria\\Preferenze\\Adobe Photoshop %Version% Settings\\ <strong> Adobe Photoshop %Version% Prefs.psp </strong></li> </ul> <p> Per eliminare le preferenze di Adobe in Windows 10, 8, 7 OS: </p> <p> 1. <strong> Smettere </strong> Photoshop. <br> 2. Passare alla cartella &quot;C:\\Users\\%Username%\\AppData\\Roaming\\&quot;. Fare quello: </p> <blockquote><p> 1. Premi il tasto Windows <img src=\"images/image_thumb8_thumb_thumb-455.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Nella casella Cerca, digita: <strong> %appdata% </strong> &amp; clic <strong> ok </strong> . </p></blockquote> <p><img src=\"images/image_thumb-66-926.png\" alt=\"Delete Photoshop Preferences file\" loading=\"lazy\"></p> <p> </p> <p> 4. Quindi vai alla cartella &quot;...\\Adobe\\Adobe Photoshop %Version%\\Adobe Photoshop %Version% Settings\\&quot;. <br> 5. <strong> Elimina </strong> o <strong> rinominare </strong> il file &quot;Adobe Photoshop %Version% Prefs.psp&quot; in Adobe Photoshop %Version% Prefs.OLD&quot; * </p> <p> * Nota: se possiedi Photoshop a 64 bit, rinomina o elimina anche il file &quot;Adobe Photoshop X64 %version% Prefs.psp&quot;. </p> <p><img src=\"images/image_thumb-23-438.png\" alt=\"Re-create Photoshop Settings File\" loading=\"lazy\"></p> <p> </p> <p> 6. Avvia Photoshop. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}