{"title":"Come trovare Windows Media Player in Windows 10.","content":"<p> Per molti anni, Windows Media Player era l&#39;applicazione predefinita per la riproduzione di musica e video. In Windows 10, Windows Player, non è più il lettore predefinito per i file multimediali ed è stato sostituito dall&#39;app &quot;Film e TV&quot;. </p> <p> Questo articolo è scritto per tutti gli utenti che desiderano trovare e utilizzare il classico Windows Media Player, come lettore predefinito per riprodurre musica e video. </p> <h4> Come trovare Windows Media Player in Windows 10. </h4> <p> Il modo più veloce per scoprire se Windows Media Player è installato sul tuo computer è effettuando una ricerca. Fare quello: </p> <p> 1. Nella casella di ricerca di Cortana digita <strong> Windows Media Player </strong> . <br> 2. Se il lettore Windows Media è elencato nei risultati, fare clic su di esso per avviare il programma. (Se non elencato, continua di seguito...) </p> <p><img src=\"images/image_thumb-66-377.png\" alt=\"How to Find Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> MANCIA: </strong> Per impostare Windows Media Player come lettore predefinito per i tuoi video e la tua musica: </p> <blockquote><p> 1. Vai a <strong> Inizio </strong> -&gt; <strong> impostazioni </strong> -&gt; <strong> App </strong> e seleziona <strong> App predefinite </strong> a sinistra. <br> 2. A <strong> Lettore musicale </strong> opzioni, fare clic su <strong> Musica Groove </strong> e poi seleziona <strong> Windows Media Player </strong> . <br> 3. <strong> Nelle opzioni del lettore video </strong> , clicca <strong> Film e TV </strong> e poi seleziona <strong> Windows Media Player </strong> . </p> <p><img src=\"images/image_thumb-72-358.png\" alt=\"set windows media player default widnows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h4> Come installare Windows Media Player in Windows 10 Home, Pro. </h4> <p> Se Windows Media Player non è elencato, puoi installarlo andando su: </p> <p> 1. <strong> Pannello di controllo </strong> -&gt; <strong> Programmi e caratteristiche </strong> . <br> 2. Fare clic su <strong> Attiva o disattiva le caratteristiche di Windows </strong> da sinistra. </p> <p><img src=\"images/image_thumb-68-342.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. A <strong> Funzionalità multimediali </strong> , seleziona il <strong> Windows Media Player </strong> e premi <strong> ok </strong> . * </p> <p> * Nota: se possiedi la versione di Windows 10 N o KN o non puoi installare Windows Media Player dalle &quot;Funzionalità di Windows&quot;, continua a leggere di seguito... </p> <p><img src=\"images/image_thumb-69-565.png\" alt=\"How to Install Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Come scaricare e installare Windows Media Player nelle versioni Windows 10 Home, Pro, N e KN. </h4> <p> Se non riesci a installare Windows Player utilizzando le istruzioni precedenti o se possiedi Windows 10 N o KN, puoi scaricare Windows Media Player per Windows 10 seguendo le istruzioni seguenti: </p> <p> 1. Scarica il <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48231\" target=\"_blank\" rel=\"nofollow noopener\"> Media Feature Pack per le versioni N e KN di Windows 10 </a> . </p> <p> * Nota: Scarica il <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package.msu </strong> per <strong> sistema operativo a 32 bit, </strong> e il <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package_x64.msu </strong> per <strong> Sistema operativo a 64 bit. </strong></p> <p> 2. Esegui il file scaricato e fai clic su <strong> sì </strong> alla prima schermata. </p> <p><img src=\"images/image_thumb-70-480.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Accettare </strong> il contratto di licenza e quindi attendere il completamento dell&#39;installazione. </p> <p><img src=\"images/image_thumb-71-400.png\" alt=\"download windows media player windows 10\" loading=\"lazy\"></p> <p> </p> <p> È tutto gente! Ha funzionato per te? Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}