{"title":"Come abilitare la protezione del ripristino del sistema nel sistema operativo Windows 10/8/7.","content":"<p> Questo tutorial contiene istruzioni su come abilitare la protezione del sistema sui sistemi operativi Windows 10, 8 e 7. La Protezione Ripristino configurazione di sistema (comunemente nota come &quot;Protezione del sistema&quot;) è una funzionalità di Windows che consente di <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> ristabilire </a> il sistema in un momento precedente, se Windows non funziona correttamente dopo una modifica significativa dei file di sistema (ad esempio dopo un aggiornamento di Windows o dopo un attacco di virus). </p> <p> Lo strumento Ripristino configurazione di sistema utilizza il servizio Volume Shadow Copy per acquisire istantanee dei file e del registro di sistema di Windows e salvarli come punti di ripristino. Questi &quot;Punti di ripristino&quot; possono essere utilizzati per ripristinare il sistema a una condizione di lavoro precedente, se Windows non si avvia o diventa instabile, senza dover reinstallare il sistema operativo. </p> <h4> Come attivare la protezione Ripristino configurazione di sistema in Windows 10. </h4> <p> 1. Apri Windows Explorer, fai clic con il pulsante destro del mouse sull&#39;icona &quot;Questo PC&quot; e scegli <strong> Proprietà </strong> . </p> <p><img src=\"images/image_thumb-70-672.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Scegli <strong> Protezione del sistema </strong> a sinistra. </p> <p><img src=\"images/image_thumb-71-762.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Evidenzia il <strong> Disco locale C: (Sistema) </strong> e clicca <strong> Configura. </strong></p> <p><img src=\"images/image_thumb-72-782.png\" alt=\"turn on system restore protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. In Opzioni di protezione del sistema, seleziona <strong> Attiva la protezione del sistema </strong> e clicca <strong> OK. * </strong></p> <p> * Nota: se la &quot;Protezione del sistema: è già abilitata, allora sei a posto. </p> <p><img src=\"images/image_thumb-73-192.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 5. Infine, nelle opzioni di Protezione del sistema, fare clic su <strong> Creare </strong> per creare uno snapshot (Restore Point), dello stato corrente del sistema. </p> <p><img src=\"images/image_thumb-75-308.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> È tutto! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}