{"title":"FIX: Nessun suono dagli altoparlanti interni sul laptop HP OMEN (risolto)","content":"<p> Questo tutorial contiene istruzioni passo passo per risolvere il problema &quot;nessun suono dagli altoparlanti interni&quot;, su a <a href=\"https://support.hp.com/ph-en/document/c05576170\" target=\"_blank\" rel=\"nofollow noopener\"> Laptop Omen di HP – 17-an009nv </a> . Il problema &quot;nessun audio dagli altoparlanti del laptop&quot; può verificarsi su qualsiasi modello di laptop HP e di solito si verifica dopo l&#39;installazione di un aggiornamento del driver di Windows per il dispositivo Realtek High Definition Audio. </p> <p> Problema in dettaglio: su un laptop HP con Windows 10, non viene emesso alcun suono dagli altoparlanti interni durante la riproduzione di musica o video, ma gli altoparlanti funzionano normalmente durante l&#39;esecuzione dei test diagnostici HP al di fuori del sistema operativo. Inoltre, il problema &quot;nessun suono&quot; si verifica solo con gli altoparlanti del laptop e non con altoparlanti o cuffie esterni. </p> <h4> Come risolvere: gli altoparlanti del laptop non emettono alcun suono in Windows 10. </h4> <h6> Passaggio 1. Aumenta il volume del suono </h6> <p> 1. <strong> Fare clic con il tasto destro </strong> al <strong> icona del suono </strong><img src=\"images/image_thumb-11-503.png\" alt=\"image\" loading=\"lazy\"> sulla barra delle applicazioni e seleziona <strong> Apri il mixer del volume. </strong></p> <p><img src=\"images/image_thumb-12-807.png\" alt=\"Open Volume Mixer\" loading=\"lazy\"></p> <p> 2. Trascina il cursore Altoparlanti su <strong> Superiore </strong> e controlla se riesci a sentire il suono. </p> <p><img src=\"images/image_thumb-13-813.png\" alt=\"Adjust Sound Volume\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Passaggio 2. Imposta gli altoparlanti come dispositivo di riproduzione predefinito. </h6> <p> 1. Vai a Windows <strong> Pannello di controllo </strong> e apri <strong> Suono. </strong></p> <p><img src=\"images/image_thumb-14-315.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Assicurati che <strong> Altoparlanti </strong> è il <strong> Predefinito </strong> dispositivo di riproduzione, altrimenti selezionare gli altoparlanti e fare clic su <strong> Imposta default </strong> pulsante. Al termine, prova i tuoi altoparlanti e se il problema persiste, vai al passaggio successivo. </p> <p><img src=\"images/image_thumb-15-993.png\" alt=\"Set Speakers as Default Playback Device\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Passaggio 3. Testare gli altoparlanti interni all&#39;esterno di Windows. </h6> <p> Il passaggio successivo per risolvere il problema &quot;nessun suono sugli altoparlanti interni&quot; sul laptop è verificare se gli altoparlanti funzionano, durante l&#39;esecuzione dei test di diagnostica hardware HP. Fare quello: </p> <p> 1. <strong> Spegni </strong> il tuo portatile. <br> 2. Accendi il tuo laptop e premi immediatamente il tasto <strong> ESC </strong> chiave ripetutamente. <br> 3. Quando viene visualizzato il menu, premere il tasto <strong> F2 </strong> chiave. <br> 4. Nel menu principale, fare clic su <strong> Test dei componenti </strong> e quindi fare clic su <strong> AUDIO. <br> </strong> 5. Se si sente il suono dagli altoparlanti durante i test audio, continuare con il passaggio 3 di seguito. * </p> <p><strong> * Nota: </strong> Se non senti l&#39;audio dagli altoparlanti, fermati qui perché c&#39;è un problema hardware che può essere risolto solo da un tecnico specializzato in laptop (servizio). </p> <p><img src=\"images/image_thumb-22-211.png\" alt=\"HP Diagnostics - Component Test\" loading=\"lazy\"></p> <p> </p> <h6><br clear=\"all\"> Passaggio 4. Ripristina il driver della scheda audio. </h6> <p> 1. Apri <strong> Gestore dispositivi </strong> . Fare quello: </p> <blockquote><p> 1. Premi Finestre <img src=\"images/image_thumb8_thumb_thumb-958.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Nella casella &quot;Apri&quot;, digita: <strong> devmgmt.msc </strong> &amp; clic <strong> ok </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-5-510.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Espandere </strong> il <strong> Controller audio, video e giochi. </strong></p> <p> 3. <strong> Fare clic con il tasto destro </strong> sul <strong> audio ad alta definizione Realtek </strong> dispositivo e selezionare <strong> Proprietà. </strong></p> <p><img src=\"images/image_thumb-17-678.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. Nella scheda Driver, fare clic su <strong> Ripristina driver </strong> pulsante. <strong> * </strong></p> <p><strong> * Nota: </strong> Se il pulsante Ripristina driver non è attivo, vai al passaggio successivo. </p> <p><img src=\"images/image_thumb-18-178.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> </p> <p> 5. Selezionare un motivo per il rollback del pacchetto driver e fare clic su <strong> Sì. </strong></p> <p><img src=\"images/image_thumb-19-167.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Al termine del ripristino del driver, <strong> ricomincia </strong> il tuo computer. <br> 5. Dopo il riavvio, procedere e testare l&#39;audio dagli altoparlanti del laptop. Se ancora non riesci a sentire l&#39;audio dagli altoparlanti del tuo laptop, vai al passaggio successivo. </p> <p> </p> <h6><br clear=\"all\"> Passaggio 5. Modificare il driver della scheda audio. </h6> <p> 1. Apri <strong> Gestore dispositivi. </strong><br> 2. <strong> Espandere </strong> il <strong> Controller audio, video e giochi. <br> </strong> 3. <strong> Fare clic con il tasto destro </strong> a <strong> audio ad alta definizione Realtek </strong> dispositivo, {o al <strong> &#39;Audio ad alta definizione Realtek (SST) </strong> dispositivo} e selezionare <strong> Aggiorna driver. <br> </strong></p> <p><img src=\"images/image_thumb-6-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Seleziona <strong> Sfoglia il mio computer per i driver. </strong></p> <p><img src=\"images/image_thumb-7-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Seleziona <strong> Fammi scegliere da un elenco di driver disponibili sul mio computer </strong> . </p> <p><img src=\"images/image_thumb-8-771.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> </p> <p> 6. Nella schermata successiva, applica una delle seguenti azioni, a seconda del tuo caso: </p> <p><strong> Caso A. </strong> Se nella casella &quot;Mostra hardware compatibile&quot; sono elencati i dispositivi &quot;Dispositivo audio ad alta definizione&quot; e &quot;Audio ad alta definizione Realtek&quot;, quindi selezionare il <strong> Dispositivo audio ad alta definizione </strong> e clicca <strong> Il prossimo. </strong></p> <p><img src=\"images/image_thumb-20-130.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p><strong> Caso B. </strong> Se nella casella &quot;Mostra hardware compatibile&quot; vedi solo il <strong> &#39;Audio ad alta definizione Realtek (SST) </strong> dispositivo, quindi: </p> <blockquote><p> un. <strong> Deseleziona </strong> il <strong> Mostra casella di controllo hardware compatibile. </strong></p></blockquote> <p><img src=\"images/image_thumb-9-565.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Seleziona il <strong> audio ad alta definizione Realtek </strong> autista e clicca <strong> Il prossimo. </strong></p></blockquote> <p><img src=\"images/image_thumb-10-248.png\" alt=\"FIX No Sound from Internal Speakers on Laptop\" loading=\"lazy\"></p> <p> </p> <p> 8. Al termine dell&#39;installazione del driver, <strong> ricomincia </strong> il tuo computer. <br> 9. Dopo il riavvio, procedere e testare l&#39;audio dagli altoparlanti del laptop. </p> <p> </p> <h6><br clear=\"all\"> Passaggio 6. Disinstallare e reinstallare il driver della scheda audio. </h6> <p> 1. Apri <strong> Gestore dispositivi. </strong><br> 2. <strong> Espandere </strong> il <strong> Controller audio, video e giochi. <br> </strong> 3. <strong> Fare clic con il tasto destro </strong> a <strong> audio ad alta definizione Realtek </strong> dispositivo e selezionare <strong> Disinstalla dispositivo. </strong></p> <p><img src=\"images/image_thumb-21-889.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. Dopo la disinstallazione, <strong> ricomincia </strong> computer e lasciare che Windows installi automaticamente i driver audio. Se ciò non accade, vai a <strong> impostazioni </strong> &gt; <strong> Aggiornamento e sicurezza </strong> e forza Windows a <strong> Controlla gli aggiornamenti, </strong> o procedere al passaggio 7 di seguito. </p> <p> </p> <h6><br clear=\"all\"> Passaggio 7. Aggiorna i driver della scheda audio. </h6> <p> Vai al sito di supporto del produttore del tuo laptop e scarica e installa il driver più recente per la tua scheda audio. Se non riesci a trovare un driver per la scheda audio sul sito di supporto del produttore o se continui a riscontrare il problema &quot;nessun suono dagli altoparlanti interni&quot; dopo aver installato il nuovo driver, prova quanto segue se possiedi un dispositivo Realtek HD Audio. </p> <p> 1. Leggi le istruzioni su questo <a href=\"https://www.repairwin.com/how-to-download-realtek-audio-manager-realtek-audio-drivers-windows-10-8-1-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> articolo </strong></a> per <strong> Scarica </strong> il <strong> Driver audio Realtek HD v2.82. <br> </strong> 2. Dopo il download, procedere e <strong> installare </strong> il <strong> Driver audio Realtek HD. <br> </strong> 3. Dopo l&#39;installazione <strong> ricomincia </strong> il PC e testare l&#39;audio dagli altoparlanti. * </p> <p><strong> Nota finale: </strong> Se il problema dell&#39;audio degli altoparlanti persiste, cerca in Gestione dispositivi e se il dispositivo audio è elencato come &quot;Realtek High Definition Audio (SST)&quot;, segui le istruzioni del passaggio 5 sopra e modifica &quot;Realtek High Definition Audio (SST) &quot; per &quot;Audio ad alta definizione Realtek&quot;. </p> <p> È tutto gente! Quale metodo ha funzionato per te? Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}