{"title":"FIX: Il computer non è riuscito a connettersi a un&#39;altra sessione della console perché è già in corso una sessione della console. (Risolto)","content":"<p> Su un computer basato su Windows, viene visualizzato il seguente errore in Connessione desktop remoto: &quot;Il computer non è riuscito a connettersi alla sessione della console sul computer remoto perché è già in corso una sessione della console&quot;. </p> <p> </p> <p><img src=\"images/image_thumb-3-627.png\" alt=\"Your computer could no connect to console session on the remote computer because you already have a console session in progress.\" loading=\"lazy\"></p> <p> </p> <p> Questo tutorial contiene le istruzioni per risolvere il seguente errore di connessione desktop remoto: &quot;Il computer non è riuscito a connettersi alla sessione della console sul computer remoto perché è già in corso una sessione della console&quot;. </p> <h4> Come risolvere: la connessione desktop remoto non è riuscita a connettersi perché hai già una sessione della console in corso. </h4> <p> L&#39;errore &quot;Il tuo computer non è riuscito a connettersi alla sessione della console sul computer remoto perché hai già una sessione della console in corso&quot;, è causato dal fatto che una delle schede di rete sul tuo computer (RDP da), ha lo stesso indirizzo IP con il computer a cui stai tentando di connetterti, tramite il desktop remoto. </p> <p> Ad esempio: se il computer remoto ha l&#39;indirizzo IP: &quot;192.168.1.157&quot;, seguire i passaggi seguenti: </p> <p> 1. Apri <strong> Prompt dei comandi come amministratore </strong> sul tuo computer (RDP da). <br> 2. Dai il seguente comando per visualizzare gli indirizzi IPv4 assegnati sul tuo PC. </p> <ul> <li><strong> ipconfig </strong></li> </ul> <p> </p> <p> 3. Ora individua quale scheda di rete sul tuo computer locale (da RDP) ha lo stesso indirizzo IP del computer remoto (da RDP a). <br> 4. Quando trovi quale adattatore LAN sul tuo computer locale ha lo stesso indirizzo IP con il computer remoto, procedi e cambia l&#39;indirizzo IP su quell&#39;adattatore con uno diverso. * </p> <p> per esempio. In questo esempio l&#39;IP del computer remoto è: &quot;192.168.1.157&quot;, quindi dobbiamo cambiare l&#39;indirizzo IP dell&#39;adattatore Ethernet (sul computer locale), con uno diverso: ad es. a: &quot;192.168.1.160&quot;. </p> <p><img src=\"images/image_thumb-5-946.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> * Nota: se l&#39;indirizzo IP sulla rete locale è assegnato da un server DHCP, sono disponibili le seguenti opzioni per aggirare il problema: </p> <blockquote><p> un. Per specificare manualmente un indirizzo IP statico diverso. <br> b. Per riavviare il router (server DHCP), in modo da &quot;prendere&quot; un indirizzo IP diverso dal server DHCP. <br> c. Per configurare il server DHCP (ad es. sul router), per assegnare indirizzi IP a un intervallo che non include l&#39;indirizzo IP del computer remoto. (es. &quot;192.168.1.200-192.168.1.250&quot; </p></blockquote> <p> </p> <p> 5. Dopo aver modificato l&#39;indirizzo IP sul computer locale (RDP da), aprire la connessione Desktop remoto e provare a connettersi al computer remoto. L&#39;errore &quot;Il computer non è riuscito a connettersi a un&#39;altra sessione della console perché è già in corso una sessione della console&quot; dovrebbe essere risolto. </p> <p> </p> <p> È tutto gente! Ha funzionato per te? </p> <p> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}