{"title":"FIX: Impossibile connettersi alla condivisione file perché non è sicuro e richiede il protocollo SMB1 obsoleto. (Risolto)","content":"<p> Se provi a connetterti a una cartella condivisa di rete da un PC Windows 10 e ricevi l&#39;errore &quot;Impossibile connettersi alla condivisione file perché non è sicura. Questa condivisione richiede il protocollo SMB1 obsoleto, che non è sicuro e potrebbe esporre il tuo sistema per attaccare. Il tuo sistema richiede SMB2 o versione successiva. Per ulteriori informazioni sulla risoluzione di questo problema, vedere: https://go.microsoft.com/fwlink/?linkid=852747&quot;, quindi continuare di seguito per risolvere il problema. </p> <p><img src=\"images/image_thumb-30-812.png\" alt=\"You can't connect to the file share because it's not secure. This share requires the obsolete SMB1 protocol, which is unsafe...\" loading=\"lazy\"></p> <p> In Windows 10 v1709 e versioni successive, il protocollo di rete Server Message Block versione 1 (SMBv1) non è installato per impostazione predefinita e deve essere abilitato manualmente se si desidera accedere a una cartella condivisa su una workstation o un server che utilizza il protocollo SMBv1 per condivisione di file. </p> <p> Questo tutorial contiene le istruzioni per risolvere i seguenti errori quando si tenta di connettersi a una cartella condivisa in Windows 10: </p> <ul> <li> <p><em> Non puoi connetterti alla condivisione file perché non è sicura. Questa condivisione richiede il protocollo SMB1 obsoleto, che non è sicuro... </em></p> </li> <li> <p><em> Il nome di rete specificato non è più disponibile </em></p> </li> <li> <p><em> Errore non specificato 0x80004005 </em></p> </li> <li> <p><em> Il server specificato non può eseguire l&#39;operazione richiesta. </em></p> </li> </ul> <h4> Come risolvere: impossibile connettersi alla condivisione file perché manca il protocollo SMBv1 (Windows 10) </h4> <p> 1. Vai a <strong> Pannello di controllo </strong> -&gt; <strong> Programmi e caratteristiche </strong> . <br> 2. Fare clic su <strong> Attiva o disattiva le caratteristiche di Windows </strong> da sinistra. </p> <p> </p> <p><img src=\"images/image_thumb-68-359.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Espandere l&#39;opzione &quot;Supporto condivisione file SMB 1.0/CIFS&quot; e <strong> dai un&#39;occhiata </strong> il <strong> Cliente SMB 1.0/CIFS </strong> opzione. Clic <strong> ok </strong> quando fatto. </p> <p><img src=\"images/image_thumb-29-360.png\" alt=\"Install SMBv1 Windows 10\" loading=\"lazy\"></p> <p> 4. Quando è installato SMB 1.0/CIFS, quindi fare clic su <strong> Riavvia ora </strong> pulsante per riavviare il PC. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}