{"title":"FIX: Al momento non hai l&#39;autorizzazione per accedere a questa cartella sull&#39;unità USB esterna (risolto)","content":"<p> Questo tutorial contiene istruzioni dettagliate per risolvere il seguente problema, quando si tenta di accedere a un disco USB esterno su un laptop HP con Windows 10: &quot;Attualmente non si dispone dell&#39;autorizzazione per accedere a questa cartella. Fare clic su Continua per ottenere l&#39;accesso permanente a questa cartella&quot; . L&#39;errore persiste, anche dopo aver premuto il pulsante &quot;Continua&quot; per accedere all&#39;unità. </p> <p><img src=\"images/image_thumb-18-636.png\" alt=\"You don't have permission to access this folder\" loading=\"lazy\"></p> <p> Lo strano errore &quot;Non hai l&#39;autorizzazione per accedere a questa cartella&quot; è apparso su un nuovo di zecca <a href=\"http://www8.hp.com/us/en/products/laptops/product-detail.html?oid=17047142\" target=\"_blank\" rel=\"nofollow noopener\"> HP ProBook 450 G5 </a> laptop, quando l&#39;utente tenta di visualizzare il contenuto di un disco USB collegato (Pen drive, USB Drive, ecc.). </p> <p> Dopo aver esaminato il problema, ho scoperto che il problema è causato dalle autorizzazioni di sicurezza applicate sul <a href=\"http://www8.hp.com/us/en/solutions/computer-security.html\" target=\"_blank\" rel=\"nofollow noopener\"> HP Client Security Manager </a> programma. HP Client Security Manager, è un programma sviluppato da Hewlett-Packard e consente di proteggere i dati, il dispositivo e l&#39;identità aumentando la sicurezza del computer. </p> <h2> Come risolvere: nessuna autorizzazione per accedere all&#39;unità USB sul laptop HP (Windows 10/8/7). </h2> <p> 1. Apri <strong> HP Client Security manager </strong> . </p> <p><img src=\"images/image_thumb-13-716.png\" alt=\"HP Client Security manager\" loading=\"lazy\"></p> <p> </p> <p> 2. Quindi fare clic su <strong> Sicurezza del dispositivo. </strong></p> <p><img src=\"images/image_thumb-14-712.png\" alt=\"fix You Don't have permission to access this folder windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. A <strong> Amministratori </strong> scheda, imposta la sicurezza &quot;Rimozione archiviazione&quot; su <strong> Consenti – Accesso completo </strong> e clicca <strong> Invia. </strong></p> <p><img src=\"images/image_thumb-15-364.png\" alt=\"fix You Don't have permission o access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Inoltre (se vuoi), dai <strong> Accesso completo </strong> al supporto di memorizzazione rimovibile per <strong> Utenti standard </strong> . </p> <p><img src=\"images/image_thumb-19-269.png\" alt=\"no permission to access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Infine, se non si desidera che HP Device Access Manager controlli l&#39;accesso all&#39;unità, andare a <strong> Impostazioni unità </strong> e impostare l&#39;interruttore corrispondente su OFF. </p> <p><img src=\"images/image_thumb-20-822.png\" alt=\"You don't have permission to access USB drive\" loading=\"lazy\"></p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo problema. </p>"}