{"title":"FIX: Outlook ricezione errore segnalato 0x80042108 (risolto)","content":"<p> Questo tutorial contiene istruzioni dettagliate per correggere l&#39;errore segnalato dalla ricezione di Outlook 0x80042108. L&#39;errore Outlook 0x80042108 di solito si verifica quando hai digitato in modo errato il nome del server di posta POP3 o perché non hai accesso a Internet. </p> <p> Il problema sono i dettagli. Outlook 2003, 2007, 2010 o Outlook 2013, visualizza il seguente errore durante la procedura di invio-ricezione: &quot;Ricezione errore segnalato (0x80042108): Outlook non è in grado di connettersi al server di posta in arrivo (POP3). Se si continua a ricevere questo messaggio , contattare l&#39;amministratore del server o il provider di servizi Internet (ISP)&quot;. </p> <p><img src=\"images/outlookerror_0x80042108-505.png\" alt=\"Outlook Error 0x80042108\" loading=\"lazy\"></p> <p> L&#39;errore &quot;0x80042108&quot; di Outlook può verificarsi in qualsiasi versione di Outlook (2016, 2013, 2010 o 2007) e viene visualizzato quando il programma client di posta elettronica di Outlook non è in grado di connettersi al server di posta elettronica. </p> <h4> Come correggere l&#39;errore 0x80042108 in Outlook 2007, 2010, 2013 o 2016. </h4> <h6> Passaggio 1. Controlla la tua connessione Internet. </h6> <p> Il primo passo per risolvere l&#39;errore di ricezione di Outlook 80042108 è controllare la connettività Internet. Quindi, apri il tuo browser Internet e visita qualsiasi sito Web per assicurarti che la tua connessione Internet funzioni. </p> <h6> Passaggio 2. Verificare le impostazioni del server di posta POP3. </h6> <p> Il secondo passaggio per correggere l&#39;errore di ricezione di Outlook 0x80042108 consiste nel verificare se sono state specificate le impostazioni corrette del server di posta elettronica. Quindi, contatta il tuo provider di posta elettronica e verifica con lui di aver digitato correttamente il nome del server di posta in arrivo e il numero di porta. Per visualizzare e modificare le impostazioni del server di posta: </p> <p> 1. Apri Outlook. <br> 2. Vai a <strong> File </strong> –&gt; <strong> Impostazioni dell&#39;account </strong> . </p> <p><img src=\"images/image_thumb-7-811.png\" alt=\"switch Account Mail Merge \" loading=\"lazy\"></p> <p> </p> <p> 3. In <strong> E-mail </strong> scheda, fare doppio clic sul proprio account di posta elettronica per modificare/visualizzare le sue impostazioni. <br> 4. Verificare di aver impostato il nome corretto del server di posta in arrivo nella casella corrispondente. <br> 5. Al termine, fare clic su <strong> Più configurazioni </strong> . </p> <p><img src=\"images/image_thumb-31-256.png\" alt=\"FIX: Outlook Receiving reported error 0x80042108\" loading=\"lazy\"></p> <blockquote><p> </p></blockquote> <p> 6. Fare clic su <strong> Avanzate </strong> scheda e verificare di aver specificato la porta e l&#39;impostazione SSL corrette per il server in entrata (POP3). </p> <p> </p> <p><img src=\"images/image_thumb-33-400.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Al termine, fare clic su <strong> ok </strong> e poi chiudi tutte le finestre aperte. <br> 7. Prova nuovamente Outlook. </p> <h6></h6> <h6> Passaggio 3. Controlla le impostazioni di antivirus e firewall. </h6> <p> Se stai utilizzando un programma antivirus con funzionalità di scansione della posta, allora <a href=\"https://www.repairwin.com/how-to-disable-add-ins-in-word-outlook-or-excel-2016-2013-2010-2007-or-2003/\" target=\"_blank\" rel=\"nofollow noopener\"> disabilitare il componente aggiuntivo antivirus in Outlook </a> o disabilitare temporaneamente la protezione antivirus o disinstallare il programma antivirus. Inoltre, controlla le impostazioni del firewall e assicurati che le porte del server di posta elettronica che stai utilizzando non siano bloccate dal programma Firewall. Più specificamente, nelle impostazioni del firewall: </p> <p> A. Abilita i seguenti file per accedere a Internet: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Abilitare le seguenti porte per accedere a Internet: </p> <ul> <li><strong> Porta 110 </strong> (Se stai utilizzando un server di posta in arrivo POP3 senza connessione crittografata) * </li> <li><strong> Porta 995 </strong> (Se stai utilizzando un server di posta in arrivo POP3 con connessione crittografata (SSL abilitato) </li> </ul> <ul> <li><strong> Porta 143 </strong> (se stai utilizzando un server di posta in arrivo IMAP senza connessione crittografata) </li> <li><strong> Porta 993 </strong> (se stai utilizzando un server di posta in arrivo IMAP con connessione crittografata (SSL abilitato) </li> </ul> <ul> <li><strong> Porta 25 </strong> Se il tuo server di posta in uscita SMTP non utilizza SSL. * </li> <li><strong> Porta 465 </strong> o <strong> 587 </strong> se il tuo server di posta in uscita SMTP utilizza SSL </li> </ul> <p> * Nota: per impostazione predefinita, la porta 25 è per l&#39;accesso in uscita e la porta 110 è per l&#39;accesso in entrata. Se non sei sicuro delle porte, contatta il tuo ISP o l&#39;amministratore di sistema. </p> <p> </p> <p><strong> Aiuto aggiuntivo: </strong> Se i metodi precedenti non ti aiutano, prova quanto segue: </p> <p><strong> UN. </strong> Rimuovi e aggiungi nuovamente il tuo account e-mail. <br> <strong> B. </strong><a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Ripara il file di dati PST di Outlook </a> . <br> <strong> c. </strong> Disconnettiti dalla connessione VPN (se sei connesso) <br> <strong> d. </strong> Riparare l&#39;installazione dell&#39;ufficio. Fare quello: </p> <blockquote><p> 1. Vai a Windows <strong> Pannello di controllo </strong> &gt; <strong> Programmi e caratteristiche </strong> . <br> 2. Individua e seleziona l&#39;applicazione MS Office, quindi fai clic su <strong> Modificare </strong> . <br> 3. Quindi selezionare il <strong> Riparazione </strong> opzione. </p></blockquote> <p> </p> <p> </p> <p> È tutto gente! Ha funzionato per te? </p> <p> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}