{"title":"FIX: il laptop Lenovo è bloccato sulla schermata LOGO. (Risolto)","content":"<p> Se il tuo laptop Lenovo si è bloccato sullo schermo del logo, continua a leggere. Questo tutorial contiene istruzioni passo passo per risolvere il seguente problema sui laptop Lenovo: Dopo l&#39;accensione, il laptop non si avvia e si blocca alla schermata iniziale del logo Lenovo. (Il problema persiste anche quando si tenta di avviare da un dispositivo di avvio USB). </p> <p><img src=\"images/image_thumb-17-276.png\" alt=\"FIX: Lenovo laptop is stuck at LOGO screen.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Come risolvere: laptop bloccato sullo schermo LENOVO LOGO. * </h4> <p> * Importante: prima di risolvere i problemi di un computer, scollegare tutte le periferiche per assicurarsi che il problema non sia dovuto a un dispositivo collegato. </p> <p> </p> <h6> Passaggio 1. Ripristina il BIOS alle impostazioni predefinite. </h6> <p> Il primo passo per risolvere il blocco del laptop sul logo Lenovo è ripristinare le impostazioni predefinite del BIOS. Fare quello: </p> <p> 1. <strong> Spegni </strong> il laptop premendo costantemente il pulsante di accensione per 5-7 secondi. <br> 2. Ora segui le istruzioni seguenti in base al tuo modello, per entrare nel BIOS: </p> <ul> <li> Se il tuo sistema è <strong> ThinkPad </strong> , premere il pulsante di accensione, quindi premere immediatamente il tasto (Fn+) F2 o (Fn+) F1 rapidamente e ripetutamente. </li> <li> Se il tuo sistema è <strong> pad delle idee </strong> laptop, individuare e <strong> stampa </strong> il <a href=\"https://support.lenovo.com/us/en/solutions/HT104038\" target=\"_blank\" rel=\"nofollow noopener\"> NOVO </a> pulsante, che si trova comunemente accanto al pulsante di accensione, quindi selezionare <strong> Entra nel menu BIOS </strong> . </li> </ul> <p> 3. A <strong> Uscita </strong> scheda seleziona <strong> Carica le impostazioni di default </strong> o &quot;Carica impostazioni ottimizzate&quot;. <br> 4. <strong> Salva ed esci dal BIOS </strong> impostazioni e vedere se è possibile avviare Windows. <br> 5. Se il laptop si blocca ancora sullo schermo del logo Lenovo, andare al passaggio successivo. </p> <p> </p> <h6> Passaggio 2. Disabilita il motore di servizio Lenovo. </h6> <p> In alcuni laptop (e desktop) Lenovo, il sistema si blocca su &quot;Lenovo Logo&quot; durante l&#39;avvio, quando &quot;Lenovo Service Engine&quot; è abilitato. Per disabilitare il servizio: </p> <p> 1. Entra nel menu del BIOS. <br> 2. A <strong> Sicurezza </strong> scheda, evidenziare e disabilitare &quot;Lenovo Service Engine&quot;. </p> <p><img src=\"images/image_thumb-19-834.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Salva ed esci </strong> dal menu del BIOS. <br> 4. Se il laptop è ancora bloccato sulla schermata iniziale del logo Lenovo, andare al passaggio successivo. </p> <p> </p> <h6> Passaggio 3: eseguire un ripristino dell&#39;alimentazione. </h6> <p> Il metodo successivo per risolvere il problema &quot;Logo Lenovo bloccato&quot; consiste nell&#39;eseguire un ripristino dell&#39;alimentazione. Fare quello: </p> <p> 1. <strong> Disconnetti </strong> tutte le periferiche collegate. <br> 2. <strong> Rimuovere </strong> il <strong> Adattatore per corrente alternata </strong> . <br> 3. <strong> Rimuovere </strong> il <strong> Batteria </strong> . * </p> <p> * Nota: se non è possibile rimuovere la batteria, lasciare il laptop aperto finché la batteria non si scarica. </p> <p> 4. <strong> stampa </strong> e <strong> tieni premuto </strong> il <strong> Energia </strong> per almeno 50-60 secondi, quindi rilasciare il pulsante di accensione. <br> 5. Collegare solo l&#39;adattatore CA e accendere il laptop. <br> 6. Se Windows si avvia normalmente, spegni il laptop e ricollega la batteria e le periferiche. </p> <h6> Passaggio 4. Rimuovere la batteria CMOS. </h6> <p> 1. <strong> Rimuovere </strong> il <strong> Batteria </strong> e il <strong> adattatore per corrente alternata </strong> . <br> 2. Capovolgi il laptop e <strong> rimuovere </strong> il <strong> copertina posteriore </strong> . * </p> <p> * Nota: la modalità di rimozione della cover posteriore varia a seconda del modello di laptop. Quindi, esegui una ricerca su Google su come smontare il tuo modello di laptop Lenovo. </p> <p> 3. Individua e <strong> rimuovere </strong> il <strong> Batteria CMOS </strong> . * </p> <p> * Nota: la batteria CMOS ha la forma di un cerchio e puoi rimuoverla facendo leva delicatamente con un piccolo cacciavite a testa piatta. </p> <p> 4. <strong> stampa </strong> e <strong> tieni premuto </strong> il <strong> Energia </strong> pulsante per almeno 50-60 secondi e poi rilasciarlo. </p> <p> 5. Collegare prima l&#39;adattatore CA e poi reinserire la batteria CMOS. <br> 5. Accendere il portatile. * </p> <p> * Nota: se il problema persiste, rimuovere e lasciare la batteria CMOS scollegata per almeno 30 minuti. Quindi, reinserisci la batteria CMOS, collega l&#39;adattatore CA e accendi il laptop. </p> <p> </p> <h6> Passaggio 5. Rimuovere l&#39;unità DVD. * </h6> <p><strong> * Importante: </strong> Spegnere il computer e rimuovere l&#39;alimentatore prima di aggiungere o rimuovere parti. </p> <p> Se possiedi un laptop con un&#39;unità DVD, rimuovilo e riaccendi il laptop. (Sembra strano, ma in alcuni casi funziona.) </p> <p> </p> <h6> Passaggio 6. Rimuovere e reinstallare la RAM e il disco rigido. </h6> <p> Quando un computer (desktop o laptop) si blocca nella schermata LOGO (POST), di solito significa un problema con il disco rigido (HDD) o la memoria (RAM). Quindi, procedi come segue: </p> <p><strong> * Importante: </strong> Spegnere il computer e rimuovere l&#39;alimentatore prima di aggiungere o rimuovere le sue parti. </p> <p> 1. Rimuovere e reinstallare i moduli RAM. <br> 2. Accendi il laptop e verifica se il problema persiste. Se sì, allora... <br> 3. Spegnere il laptop e rimuovere (scollegare) il disco rigido (HDD). <br> 4. Dopo aver rimosso l&#39;HDD, riaccendere il laptop. <br> 5. Se l&#39;HDD è la causa del problema, la schermata iniziale di Lenovo LOGO scomparirà e riceverai un messaggio che dice &quot;Nessun dispositivo di avvio trovato&quot; o qualcosa del genere. Se ciò accade:* </p> <blockquote><p> un. Spegni il portatile. <br> b. Pulisci i contatti sia sul disco rigido che sulla presa dell&#39;HDD con uno spray per la pulizia dei contatti. <br> c. Ricollegare il disco rigido e continuare a leggere di seguito (6). </p></blockquote> <p> * Nota: se ciò non accade, indica un problema del BIOS o della scheda madre, che può essere riparato solo da un tecnico informatico specializzato. </p> <p> 6. Accendi il laptop e verifica se il problema è stato risolto. In caso contrario, procedere con il backup dei file e quindi eseguire un&#39;installazione pulita di Windows, seguendo i passaggi seguenti: </p> <blockquote><p> un. Rimuovere e collegare il disco rigido a un altro computer funzionante (ad esempio utilizzando un adattatore per disco rigido da USB a SATA). <br> b. Se riesci a leggere il contenuto dell&#39;unità, procedi e <strong> fai il backup dei tuoi file </strong> . * </p> <p> * Nota: se il disco rigido non viene riconosciuto dal computer secondario, l&#39;HDD è difettoso e devi sostituirlo. </p> <p> c. Dopo aver eseguito il backup dei file, procedere e <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> diagnosticare i problemi del disco rigido </a> , e in base ai risultati, sostituire l&#39;HDD (se è difettoso), oppure (se è a posto) procedere e <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> eliminare tutte le partizioni sull&#39;HDD </a> . </p></blockquote> <p> 7. Dopo aver pulito le partizioni, rimettere l&#39;HDD sul laptop e procedere con <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> installazione pulita di Windows </a> . </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}