{"title":"FIX: Non è disponibile spazio di archiviazione sufficiente per elaborare questo comando: impossibile accedere alle cartelle condivise o utilizzare il desktop remoto (risolto)","content":"<p> L&#39;errore &quot;Memoria insufficiente per elaborare questo comando&quot; può essere visualizzato quando si tenta di accedere alle cartelle condivise su un&#39;altra workstation Windows o su un Server 2003, 2008, 2012 o 2016 o quando si utilizza Connessione desktop remoto (RDP ), per connettersi a un altro computer Windows (Workstation o Server). </p> <p><img src=\"images/image_thumb-127.png\" alt=\"Not enough storage is available to process this command\" loading=\"lazy\"></p> <p> </p> <p> Questo tutorial contiene le istruzioni per risolvere i seguenti problemi, che possono apparire su tutte le versioni di Windows (Windows 10, 8/8.1, 7, Vista, XP e Windows Server 2003, 2008, 2012 o 2016): </p> <p> 1. Quando si tenta di accedere alle cartelle condivise sul computer Server, viene visualizzato il messaggio di errore: &quot; <em> Cartella condivisa </em> non è accessibile. Potresti non avere l&#39;autorizzazione per utilizzare questa risorsa di rete. Contatta l&#39;amministratore di questo server per sapere se disponi dei permessi di accesso. Lo spazio di archiviazione del server disponibile non è sufficiente per elaborare questo comando.&quot; </p> <p> 2. Quando si tenta di connettersi in remoto (utilizzando RDP) a un&#39;altra macchina basata su Windows, viene visualizzato il messaggio di errore: &quot;Il sistema non può accedere a causa del seguente motivo. Memoria insufficiente per elaborare questo comando&quot;. </p> <h4> COME RISOLVERE: Messaggio di errore &quot;Memoria insufficiente per elaborare questo comando&quot; in Remote Desktop (RDP) o quando si tenta di accedere alle cartelle condivise. </h4> <p> Sulla macchina &quot;server&quot; Windows, che si desidera accedere ai suoi file o connettersi in remoto: </p> <p><strong> 1. </strong> Stampa &quot; <strong> finestre </strong> ” + “ <strong> R </strong> ” chiavi per aprire il <em> CORRERE </em> finestra. <br> <strong> 2. </strong> genere <strong> regedit </strong> e premi <strong> accedere </strong> per aprire l&#39;editor del registro. </p> <p><img src=\"images/image_thumb7-649.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Quindi vai a questa chiave: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\LanmanServer\\Parameters </strong></li> </ul> <p><img src=\"images/image_thumb-1-198.png\" alt=\"fix Not enough storage - cannot access shared items\" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Nel riquadro di destra fare doppio clic per aprire il <strong> Dimensione IRPStack </strong> valore <strong> . * </strong></p> <p><strong> * Nota: </strong> Se non vedi il <strong> Dimensione IRPStack </strong> valore, quindi: </p> <p> </p> <blockquote><p> 1. Fare clic con il pulsante destro del mouse su uno spazio vuoto (nel riquadro di destra) e quindi selezionare <strong> Nuovo </strong> –&gt; <strong> Valore DWORD (32 bit) </strong></p> <p><img src=\"images/image_thumb-2-236.png\" alt=\"fix Not enough storage using RDP (Remote Desktop)\" loading=\"lazy\"></p> </blockquote> <blockquote><p> 2. Assegna un nome al nuovo valore <strong> Dimensione IRPStack </strong> e colpisci <strong> Accedere. </strong></p></blockquote> <p><strong> 5. </strong> Selezionare <strong> Decimale </strong> , cambia i dati del valore in <strong> 50 </strong> e clicca <strong> ok </strong> . * </p> <p> * Nota: l&#39;intervallo (in decimale) del parametro è compreso tra 1 e 50. </p> <p><img src=\"images/image_thumb-3-255.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 6. </strong> <strong> Vicino </strong> editor del registro e <strong> ricomincia </strong> il server. * </p> <p> * Nota importante: se dopo il riavvio si riceve lo stesso messaggio di errore, quando si utilizza la connessione desktop remoto o quando si tenta di accedere ai file condivisi su un altro computer, applicare la modifica del registro di cui sopra anche al computer. </p> <p> È tutto! Ha funzionato per te? </p> <p> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}