{"title":"FIX: VeraCrypt non risponde (blocco) allo smontaggio in Windows 10 (risolto)","content":"<p> Questa guida contiene le istruzioni per risolvere il seguente problema con VeraCrypt su un computer basato su Windows 10: VeraCrypt non risponde e si blocca (si blocca) quando si smonta il volume crittografato. </p> <p> VeraCrypt Not Responding (Freezing) in dettaglio: Quando si tenta di smontare un volume (con tutti i file chiusi dal volume montato), VeraCrypt si blocca e visualizza &quot;Non risponde&quot;. Quando si verifica questo problema, l&#39;unico modo per ripristinare Windows a uno stato normale è terminare il processo VeraCrypt da Task Manager. </p> <p> Secondo <a href=\"https://www.veracrypt.fr/en/Issues%20and%20Limitations.html\" target=\"_blank\" rel=\"nofollow noopener\"> VeraCripta </a> il problema di blocco è causato da un conflitto tra la finestra di dialogo di attesa VeraCrypt visualizzata durante le operazioni di montaggio/smontaggio e altro software installato sulla macchina (es. Antivirus o Firewall). </p> <h4> Come risolvere: VeraCrypt non risponde al volume di smontaggio/montaggio. </h4> <p> Questo problema è causato da un conflitto tra la finestra di dialogo di attesa VeraCrypt visualizzata durante le operazioni di montaggio/smontaggio e altri software installati sulla macchina (es. Outpost Firewall Pro). </p> <p> 1. Da VeraCrypt <strong> impostazioni </strong> menu, selezionare <strong> Preferenze </strong> . </p> <p><img src=\"images/image_thumb-63-122.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Dai un&#39;occhiata </strong> il <strong> Non mostrare la finestra di dialogo del messaggio di attesa durante l&#39;esecuzione delle operazioni </strong> opzione clic <strong> OK. </strong></p> <p><img src=\"images/image_thumb-64-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Ora procedi a montare/smontare i volumi senza bloccarli! </p> <p> È tutto gente! Ha funzionato per te? Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}