{"title":"FIX: non sono disponibili versioni precedenti in Windows 10 (risolto)","content":"<p> Su un computer basato su Windows 10 con il <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Protezione del sistema </a> abilitata, si verifica il seguente problema quando si tenta di ripristinare un file/cartella utilizzando la funzione &quot;Ripristina versioni precedenti&quot;: &quot;Non sono disponibili versioni precedenti&quot;. </p> <p> <img src=\"images/image_thumb-39-628.png\" alt=\"There No Previous Versions Available in Windows 10 \" loading=\"lazy\"></p> <p> </p> <p> L&#39;errore &quot;Non sono disponibili versioni precedenti&quot; si verifica perché in Windows 10 la funzionalità &quot;Ripristina versioni precedenti&quot; funziona solo se hai configurato il &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cronologia file </a> &#39; per eseguire il backup dei file. Ciò significa che la funzione &quot;Ripristina versioni precedenti&quot; in Windows 10, esamina la posizione di backup dello &quot;strumento Backup cronologia file&quot; per trovare una versione precedente di un file/cartella e non nei punti di ripristino del sistema, come accade in Windows 7. Per abilitare la Cronologia file in Windows 10, seguire le istruzioni nei seguenti articoli: </p> <ul> <li><strong> Articoli Correlati: </strong></li> <li> <ul> <li><a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Come eseguire il backup dei file personali con la cronologia dei file in Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Come creare copie shadow dei tuoi file con l&#39;Utilità di pianificazione in Windows 10 </a></li> </ul> </li> </ul> <h4> Come risolvere: non sono disponibili versioni precedenti di file in Windows 10. </h4> <p> Se &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cronologia file </a> &#39; è già abilitato* sul tuo PC Windows 10, ma ricevi il messaggio &quot;Non sono disponibili versioni precedenti&quot;, quando tenti di ripristinare la versione precedente di un file o di una cartella, segui le istruzioni seguenti: </p> <p> * Nota: le istruzioni di seguito <strong> non funziona se il <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> La cronologia dei file non è GIÀ abilitata </a></strong> sul tuo PC Windows 10. </p> <p> 1. Scarica e installa il <a href=\"http://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowExplorer </a> utilità sul tuo PC. <br> 2. Aprire &quot;ShadowExplorer&quot; e selezionare la data da cui si desidera ripristinare il file. * </p> <p> * Nota: se non vedi una data precedente, significa che la cronologia dei file è disabilitata. Tieni presente che anche se attivi Cronologia file ora, il risultato sarà lo stesso, perché Cronologia file crea istantanee dei tuoi file dal momento in cui viene attivato e poi. </p> <p><img src=\"images/image_thumb-40-348.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Passare alla posizione di archiviazione del file/cartella che si desidera ripristinare alla versione precedente. <br> 4. Quando si individua il file che si desidera ripristinare, fare clic con il tasto destro su di esso e selezionare <strong> Esportare </strong> . </p> <p><img src=\"images/image_thumb-41-653.png\" alt=\"restore previous versions shadow explorer\" loading=\"lazy\"></p> <p> </p> <p> 5. Selezionare un disco diverso (posizione) per salvare il file ripristinato e fare clic su <strong> ok </strong> . * </p> <p><strong> Importante: </strong> Salva i file ripristinati su un altro disco (ad esempio un&#39;unità flash) e solo dopo esserti assicurato di avere i file corretti, copiali nella posizione originale per evitare di sovrascrivere i file originali. </p> <p><img src=\"images/image_thumb-38-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo problema. </p>"}