{"title":"FIX: Schermata nera della fotocamera Skype e altri problemi della webcam su Windows 10.","content":"<p> Il problema dello schermo nero/vuoto della fotocamera Skype è uno dei problemi più comuni su Windows 10 e può essere causato da una serie di motivi, quindi ecco una guida passo passo su come risolverlo. </p> <p> In Windows 10, un nuovo aggiornamento può causare molti problemi con la webcam integrata e la fotocamera potrebbe non funzionare o potrebbe non essere riconosciuta in alcune applicazioni mentre funziona correttamente in altre. Ad esempio, ho visto un caso in cui mentre la fotocamera funzionava senza problemi nelle applicazioni Webex e Zoom, visualizzava uno schermo nero in Skype. </p> <p> Questa guida contiene istruzioni dettagliate per risolvere diversi problemi con la fotocamera integrata sui laptop con Windows 10: * </p> <ul> <li><em> La webcam/fotocamera non funziona su Windows 10 </em></li> <li><em><em> Webcam/fotocamera </em> Ha smesso di funzionare dopo l&#39;aggiornamento in Windows 10. </em></li> <li><em> La webcam non funziona su alcune applicazioni (Skype, Windows Hello WebEx, ecc.). </em></li> <li><em> La webcam visualizza uno schermo nero (o vuoto) quando viene utilizzata su Skype. </em></li> <li><em> La webcam funziona su Skype ma visualizza una schermata nera nella finestra di anteprima della fotocamera </em> . </li> <li> Le applicazioni non sono in grado di riconoscere o trovare la fotocamera/webcam </li> </ul> <p><strong> * Avviso per i possessori di Lenovo ThinkPad: </strong> Se possiedi uno dei modelli ThinkPad elencati nella tabella seguente, procedi con il download e l&#39;installazione <a href=\"/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/DC8297800EA7/Integrated%20Camera%20Driver%20Registry%20Patch%20for%20Windows%2010%20(Version%201709%20or%20later)%20-%20ThinkPad\" target=\"_blank\" rel=\"nofollow noopener\"> patch di registro da Lenovo. </a> La patch risolve un problema per cui il driver della fotocamera integrato potrebbe non funzionare correttamente dopo l&#39;aggiornamento a Windows 10 versione 1709 o successiva. </p> <p><img src=\"images/image_thumb-30-725.png\" alt=\"THinkpad Registry Fix for Integrated Camera\" loading=\"lazy\"></p> <h2> Come risolvere: problemi con la webcam su Windows 10. </h2> <p> </p> <h3> Passaggio 1. Consenti l&#39;accesso della fotocamera alle app. </h3> <p> Su Windows 10, la fotocamera e il microfono potrebbero non essere disponibili per le applicazioni a causa delle impostazioni sulla privacy che potrebbero essere state applicate. Quindi, procedi e consenti all&#39;applicazione con il problema della fotocamera di accedere alla tua fotocamera. Ad esempio, se affronti il ​​problema della fotocamera su Skype, procedi come segue: </p> <p> 1. Naviga per andare a <strong> Inizio </strong> menù <img src=\"images/image_thumb-12-696.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> impostazioni </strong> -&gt; <strong> Privacy </strong> . <br> 2. Seleziona <strong> telecamera </strong> nel riquadro di sinistra e a destra: </p> <blockquote><p> un. Assicurarsi che <strong> Accesso alla fotocamera per questo dispositivo </strong> è <strong> sopra. </strong> In caso contrario, fare clic su <strong> Modificare </strong> e imposta su <strong> SOPRA. </strong><br> b. Quindi impostare su <strong> Sopra </strong> il <strong> Consenti alle app di accedere all&#39;interruttore della fotocamera </strong> . </p> <p><img src=\"images/image_thumb-20-105.png\" alt=\"Allow Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Ora scorri verso il basso e... </p> <p> c. Se stai riscontrando il problema dello schermo nero della fotocamera acceso <strong> Skype </strong> memorizzare l&#39;app, scorrere verso il basso e su <strong> Scegli quali app di Microsoft Store possono accedere alla tua fotocamera </strong> sezione, set <strong> Skype </strong> per <strong> Sopra. </strong></p> <p><img src=\"images/image_thumb-21-826.png\" alt=\"Allow Store Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> d. Se vedi una finestra con lo schermo nero della tua fotocamera mentre usi il <strong> Skype per Windows </strong> (applicazione desktop), quindi assicurarsi che il <strong> Consenti alle app desktop di accedere alla tua fotocamera </strong> l&#39;interruttore è <strong> Sopra </strong> . </p> <p><img src=\"images/image_thumb-22-558.png\" alt=\"Allow Applications to Access Camera Windows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h3> Passaggio 2. Controlla se la tua fotocamera funziona correttamente. </h3> <p> Uno dei primi passaggi per la risoluzione dei problemi della webcam è verificare che funzioni nell&#39;app Fotocamera di Windows 10. </p> <p> 1. Nella casella di ricerca, digitare <strong> telecamera </strong> per aprire l&#39;app Fotocamera. <br> 2. Fare clic sulla lente d&#39;ingrandimento e cercare &quot; <strong> telecamera </strong> &quot;. <br> 3. Aprire il <strong> telecamera </strong> applicazione </p> <p><img src=\"images/image_thumb-23-730.png\" alt=\"Open Camera app Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Ora, in base al risultato, procedi come segue: </p> <blockquote><p> R. Se la tua fotocamera funziona, dovresti vedere la tua immagine sullo schermo. In questo caso, procedi e controlla la tua fotocamera su Skype o in qualsiasi altra app in cui la usi. Se la webcam non funziona o visualizza una schermata nera, applica i passaggi seguenti nell&#39;ordine: </p> <ol> <li> Prova a <strong> disinstallare </strong> e <strong> reinstallare </strong> l&#39;applicazione con il problema della fotocamera (ad es. Skype). </li> <li> Procedere per abilitare o disabilitare la modalità server frame nel registro seguendo le istruzioni su <a href=\"#step-3\" target=\"_blank\" rel=\"nofollow noopener\"> passaggio 3 </a> . </li> </ol> <p> B. Se la tua fotocamera non funziona neanche nell&#39;app Fotocamera, può accadere una delle seguenti cose: </p> <ol> <li> Il driver del dispositivo della fotocamera non è corretto o è danneggiato. In questo caso procedere alla risoluzione dei problemi dei driver della fotocamera seguendo le istruzioni su <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> passo-4 </a> . </li> <li> La fotocamera è danneggiata e non funziona affatto. In questo caso, vai in un&#39;officina di riparazione computer per riparare la tua webcam o usa una fotocamera USB esterna. </li> </ol> </blockquote> <h3></h3> <h3> Passaggio 3. Risolvi il problema della schermata nera della webcam nel registro di Windows 10. </h3> <p> Se la fotocamera viene riconosciuta e funziona senza problemi in alcune app, ma non funziona in altre, o visualizza una schermata nera su Skype, prova a disabilitare o abilitare la &quot;Modalità Frame Server&quot; nel registro. </p> <p> 1. Apri l&#39;editor del registro: per farlo: </p> <blockquote><p> 1. Premi Finestre <img src=\"images/image_thumb41-284.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo <strong> regedit </strong> e premi <strong> accedere </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-845.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> 3. Nell&#39;Editor del Registro di sistema, accedere alla seguente chiave nel riquadro di sinistra: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows Media Foundation\\Platform </li> </ul> <p> 4. <strong> Fare clic con il pulsante destro del mouse </strong> in uno spazio vuoto nel riquadro di destra e selezionare <strong> Nuovo -&gt; Valore DWORD (32 bit). </strong></p> <p><img src=\"images/image_thumb-24-839.png\" alt=\"Fix Webcam black Screen Windows 10\" loading=\"lazy\"></p> <p> 5. Dai il nome <strong> EnableFrameServerMode </strong> al nuovo valore. <br> 6. Fare doppio clic sul valore appena creato e assicurarsi che i dati del valore siano <strong>0</strong> . (Zero). Clic <strong> OK. </strong></p> <p><img src=\"images/image_thumb-25-764.png\" alt=\"Fix Webcam issues Windows 10\" loading=\"lazy\"></p> <p> 7. Ora, segui gli stessi passaggi sopra (4,5 e 6) e apporta le stesse modifiche a questo tasto: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows Media Foundation\\Platform </li> </ul> <p> 8. Al termine, <strong> vicino </strong> Editor del Registro di sistema e <strong> ricomincia </strong> il tuo PC. <br> 9. Dopo il riavvio, avvia Skype e controlla se il problema con WebCam è stato risolto. In caso contrario, segui gli stessi passaggi, ma questa volta <strong> abilitare </strong> il <strong> EnableFrameServerMode </strong> cambiando il suo valore da <strong>0 </strong> per <strong> 1 </strong> e <strong> ricomincia </strong> di nuovo il tuo PC. </p> <p> </p> <h3> Passaggio 4. Risoluzione dei problemi relativi al driver della webcam. </h3> <p> Il passaggio successivo, per risolvere i problemi della fotocamera in Windows 10, consiste nel ripristinare o disinstallare/reinstallare i driver della fotocamera. 1. Apri <strong> Gestore dispositivi </strong> . Fare quello: </p> <blockquote><p> 1. Premi Finestre <img src=\"images/image_thumb8_thumb_thumb-696.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Nella casella &quot;Apri&quot;, digita: <strong> devmgmt.msc </strong> &amp; clic <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-5-837.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Espandi <strong> Immagina dispositivi </strong> (o <strong> Macchine fotografiche </strong> ) <br> 3. <strong> Fare clic con il pulsante destro del mouse </strong> sul tuo <strong> telecamera </strong> e scegli <strong> Proprietà. </strong></p> <p><img src=\"images/image_thumb-26-673.png\" alt=\"Camera Properties\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 4. Selezionare il <strong> autista </strong> scheda e procedere come segue in base al proprio caso: </p> <blockquote><p> A. Se la tua webcam funzionava prima, <strong> Ripristina driver </strong> e <strong> riavviare </strong> sul tuo PC. Quindi controlla se la tua fotocamera funziona. </p> <p><img src=\"images/image_thumb-27-454.png\" alt=\"Roll Back Driver - Camera\" loading=\"lazy\"></p> <p> </p> <p> B. Se la tua fotocamera non ha mai funzionato prima o se è la prima volta che la provi (ad esempio dopo una nuova installazione di Windows), prova quanto segue in questo ordine: </p> <ol> <li> Clicca il <strong> Aggiorna driver </strong> opzione, per verificare la disponibilità di un driver aggiornato della fotocamera. Se Windows trova un nuovo driver, installalo e poi controlla la tua webcam. Altrimenti… </li> <li> Clic <strong> Disinstalla dispositivo </strong> per disinstallare la webcam e poi <strong> ricomincia </strong> il tuo PC. Dopo il riavvio, controlla se la tua fotocamera funziona. Altrimenti… </li> <li> Vai al sito di supporto del produttore del tuo laptop e controlla se è disponibile un nuovo driver per la tua webcam e installalo. </li> </ol> </blockquote> <h3> Aiuto aggiuntivo per risolvere i problemi della fotocamera su Windows 10. </h3> <p> Se hai ancora problemi con la tua webcam dopo i passaggi precedenti, prova quanto segue: </p> <ol> <li> <p> Installa tutti gli aggiornamenti di Windows 10 disponibili ( <strong> Inizio </strong> -&gt; <strong> impostazioni </strong> -&gt; <strong> Aggiornamento e sicurezza </strong> e clicca <strong> Controlla gli aggiornamenti). </strong></p> </li> <li> <p> Aggiorna Windows 10 alla versione più recente utilizzando il <strong> Assistente aggiornamento. </strong> (Per farlo vai a questo <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"noopener\"><strong> collegamento </strong></a> e fai clic su <strong> Aggiorna ora </strong> pulsante). </p> </li> <li> <p><a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"noopener\"><strong> Aggiorna Windows 10 </strong> . </a></p> </li> </ol> <p> È tutto gente! Ha funzionato per te? Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}