{"title":"FIX: Windows 10 funziona molto lentamente dopo l&#39;installazione di v2004 o Edge Chromιum (risolto)","content":"<p> Molti utenti hanno segnalato che il loro PC è estremamente lento dopo aver installato l&#39;aggiornamento di Windows 10 2004 o dopo aver installato la nuova versione basata su Chromium del browser Microsoft Edge. Se stai affrontando uno dei problemi sopra menzionati, segui le istruzioni su questo articolo per risolverli. </p> <p> Problema nei dettagli: dopo aver aggiornato Windows 10 alla versione 2004 o dopo aver installato il <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> aggiornamento, che installa automaticamente il nuovo browser Edge (versione Chromium), Windows impiega molto tempo al processo di avvio o funziona molto lentamente. </p> <h4> Come risolvere: problemi di avvio lento e prestazioni lente in Windows 10 2004. </h4> <h6> Metodo 1. Installa gli aggiornamenti di Windows disponibili e aggiorna i driver del dispositivo. </h6> <p> Il primo metodo, per risolvere i problemi di prestazioni lente in Windows 10, consiste nell&#39;eseguire i seguenti passaggi: </p> <ul> <li><strong> Passo 1. </strong> Scarica e installa tutti gli aggiornamenti di Windows disponibili. </li> <li><strong> Passo 2. </strong> Scarica e installa i driver di Windows 10 più recenti per la scheda video. </li> <li><strong> Passaggio 3. </strong> Se stai utilizzando un programma antivirus di terze parti, disinstallalo e controlla se il problema di prestazioni lente persiste. In caso contrario, installa l&#39;ultima versione del programma AV. </li> </ul> <p> </p> <h6> Metodo 2. Disinstallare la versione di Microsoft Edge Chromium. </h6> <p> Il secondo metodo per risolvere i problemi di prestazioni lente in Windows 10 consiste nel disinstallare la versione di Microsoft Edge Chromium (se installata). </p> <h5> Passaggio 1. Verificare se è installata la nuova versione basata su Chromium di Microsoft Edge. </h5> <p> 1. Dal menu Start <img src=\"images/image_thumb2_thumb_thumb-381.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clic <strong> impostazioni </strong><img src=\"images/image_thumb-66-515.png\" alt=\"image\" loading=\"lazy\"> e clicca <strong> App. <br> </strong> 2. Se il <strong> App e funzionalità </strong> individuare l&#39;app Microsoft Edge e in base alla sua icona procedere come segue: </p> <ul> <li> Se vedi questa immagine dell&#39;icona <img src=\"images/image_thumb-32-976.png\" alt=\"image\" loading=\"lazy\"> , significa che la nuova versione di Microsoft Edge basata su Chromium è già installata sul tuo computer. In questo caso, vai a <strong> <a href=\"#step-2\" target=\"_blank\" rel=\"nofollow noopener\"> passo 2 </a></strong> per disinstallare Edge Chromium dal PC. </li> <li> Se vedi questa immagine dell&#39;icona <img src=\"images/image_thumb-33-372.png\" alt=\"image\" loading=\"lazy\"> , significa che la nuova versione basata su Chromium non è ancora installata sul tuo computer. In questo caso, vai a <a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"><strong> metodo-3 </strong></a> . </li> </ul> <p><img src=\"images/image_thumb-71-268.png\" alt=\"FIX: Windows 10 Running Extremely Slow after 2004 Update\" loading=\"lazy\"></p> <p> </p> <h5> Passaggio 2. Rimuovere Edge Chromium dal PC. </h5> <p> Per disinstallare il nuovo Edge basato su Chromium in Windows 10: </p> <p> 1. Vai alla seguente cartella sul tuo PC: * </p> <ul> <li> C:\\Programmi (x86)\\Microsoft\\Edge\\Application\\85.0.564.41\\Installer </li> </ul> <p> * Nota: il nome della cartella &quot;85.0.564.41&quot; indica la versione installata della nuova versione di Chromium e potrebbe differire a seconda del tuo PC. </p> <p> 2. Selezionare il percorso della cartella nella barra degli indirizzi e fare clic con il pulsante destro del mouse &gt; <strong> Copia. </strong></p> <p><img src=\"images/image_thumb-35-379.png\" alt=\"Uninstall Edge Chromiun\" loading=\"lazy\"></p> <p> </p> <p> 3. Apri <strong> Prompt dei comandi come amministratore, </strong> genere <strong> CD </strong> e poi premere <strong> CTRL+V </strong> per incollare nel percorso della cartella copiata. Al termine, premere <strong> accedere </strong> . * </p> <p> * es.: Nell&#39;esempio attuale, il comando sarà: </p> <p><em> cd C:\\Programmi (x86)\\Microsoft\\Edge\\Application\\85.0.564.41\\Installer </em></p> <p><img src=\"images/image_thumb-36-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Ora, dai il comando seguente (Copia/Incolla) nel prompt dei comandi per rimuovere la versione Chromium del browser Microsoft Edge dal tuo PC. </p> <ul> <li> setup.exe –uninstall –system-level –verbose-logging –force-uninstall </li> </ul> <p><img src=\"images/image_thumb-37-229.png\" alt=\"Remove Edge Chromiun\" loading=\"lazy\"></p> <p> 5. Una volta eseguito il comando precedente, la vecchia versione di EDGE verrà nuovamente attivata. Riavvia il PC per applicare le modifiche. <br> 6. Dopo il riavvio, procedere con l&#39;installazione manuale del <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> nuovo browser Edge basato su Chromium </a> sul PC, per evitare di reinstallare il problematico aggiornamento KB4559309. </p> <p> </p> <h6> Metodo 3. Ripristina Windows 10 alla versione precedente. </h6> <p> 1. Dal <strong> Inizio </strong> menù <img src=\"images/image_thumb2_thumb_thumb-872.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> Aperto <strong> impostazioni </strong> <img src=\"images/image_thumb-66-969.png\" alt=\"image\" loading=\"lazy\"> e quindi fare clic su <strong> Aggiornamento e sicurezza. </strong></p> <p> 2. Scegli <strong> Recupero </strong> a sinistra e quindi, nella sezione &quot;Torna alla versione precedente di Windows 10&quot;, fare clic su <strong> Iniziare </strong> pulsante. </p> <p><img src=\"images/image_thumb-4-708.png\" alt=\"Restore Windows to earlier version\" loading=\"lazy\"></p> <p> 3. Segui le istruzioni sullo schermo per ripristinare Windows 10 alla versione precedente. <br> 4. Dopo essere tornato alla versione precedente di Windows 10, il computer dovrebbe funzionare di nuovo normalmente e senza ritardi. </p> <p> </p> <h6> Metodo 4. Ripara Windows 10. </h6> <p> Il metodo successivo per risolvere i problemi di prestazioni lente in Windows 10 consiste nel riparare Windows utilizzando i comandi SFC e DISM: </p> <p> 1. Apri <strong> Prompt dei comandi come amministratore </strong> . <br> 2. Nel prompt dei comandi dare il seguente comando dism e premere <strong> Accedere: </strong></p> <ul> <li><strong> DISM.exe /Online /Cleanup-image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-175.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> </p> <p> 3. Quando l&#39;operazione DISM è completata, digita il seguente comando e premi <strong> accedere </strong> : </p> <ul> <li><strong> sfc /scannow </strong></li> </ul> <p><img src=\"images/image_thumb31-316.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Ora attendi che il Controllo file di sistema ripari i file di sistema di Windows. <br> 5. Fatto questo, <strong> ricomincia </strong> computer e vedere se il problema è stato risolto. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}