{"title":"FIX: Impossibile installare gli strumenti di correzione di Office 2016 (risolto)","content":"<p> Se non è stato possibile installare gli strumenti di correzione di Office 2016 con l&#39;errore &quot;Oops! È necessaria una versione compatibile di Microsoft Office prima di poter installare strumenti di correzione aggiuntivi&quot;, quindi continua a leggere di seguito per risolvere il problema. </p> <p> </p> <p><img src=\"images/image_thumb-23-190.png\" alt=\"Couldn't Install Office 2016 Proofing Tools - Oops! A compatible version of Microsoft Office is required \" loading=\"lazy\"></p> <p> </p> <p> L&#39;errore di installazione di Microsoft Office Proofing Tools 2016 &quot;È necessaria una versione compatibile di Microsoft Office prima di poter installare strumenti di correzione aggiuntivi&quot;, viene comunemente visualizzato se si tenta di installare una versione incompatibile degli strumenti di correzione per la versione e l&#39;architettura di Office installate o se si hanno installato una versione a 32 bit di Office 2016 su un sistema operativo Windows a 64 bit. </p> <h4> Come risolvere: non è possibile installare gli strumenti di correzione in Office 2016 o Office 2019. </h4> <p> </p> <h6> Metodo 1. Scarica gli strumenti di correzione corretti. </h6> <p> Prima di tutto, assicurati di aver scaricato il file di installazione degli strumenti di correzione corretto, in base alla versione e all&#39;architettura di Office installata (32 o 64 bit). Fare quello: </p> <p> 1. Aprire qualsiasi applicazione di Office (ad es. Word). <br> 2. Dal <strong> File </strong> clic sul menu <strong> account </strong> (o <strong> Aiuto </strong> ). <br> 3. Ora fai clic su <strong> A proposito di Word </strong> pulsante nel riquadro di destra. <br> 4. Notare la versione di Office installata (ad es. &quot;2016&quot;) e l&#39;architettura (ad es. &quot;64 bit&quot;). </p> <p><img src=\"images/image_thumb-24-106.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Ora secondo la versione di Office: </p> <ul> <li> Per <strong> Ufficio 2016 </strong> scarica gli strumenti di correzione da qui: <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=52668\" target=\"_blank\" rel=\"nofollow noopener\"> Strumenti di correzione di Office 2016 </a> . </li> <li> Per <strong> Ufficio 2019 </strong> scarica gli strumenti di correzione da qui: <a href=\"https://support.office.com/en-us/article/language-accessory-pack-for-office-82ee1236-0f9a-45ee-9c72-05b026ee809f?ui=en-US&rs=en-US&ad=US\" target=\"_blank\" rel=\"nofollow noopener\"> Strumenti di correzione di Office 2019 </a></li> </ul> <p> 6. Quindi, scegli la lingua desiderata per gli strumenti di correzione. <br> 7. Infine, secondo l&#39;architettura di Office (32 o 64 bit): </p> <ul> <li> Per Office a 32 bit, scarica il file di installazione x86. (ad es. &quot;proofingtools2016_en-us-x86.exe) </li> <li> Per Office a 64 bit, scarica il file di installazione x64. (ad es. &quot;proofingtools2016_en-us-x64.exe) </li> </ul> <p> 8. Fare doppio clic sul file .exe scaricato per installare gli strumenti di correzione. </p> <p> </p> <h6> Metodo 2. Ripristinare l&#39;installazione di Office. </h6> <p> 1. Vai a <strong> Programmi e </strong><strong> Caratteristiche. </strong> Fare quello: </p> <blockquote><p> 1. Premere contemporaneamente Windows <img src=\"images/image_thumb36-318.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo: <strong> appwiz.cpl </strong> e clicca <strong> ok </strong> . </p></blockquote> <p><img src=\"images/image_thumb-24-189.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. In Programmi e funzionalità, seleziona il prodotto Microsoft Office installato sul tuo sistema e fai clic su <strong> Modificare </strong> . </p> <p><img src=\"images/image_thumb-2-328.png\" alt=\"repair office 2016 and office 2019\" loading=\"lazy\"></p> <p> </p> <p> 3. Infine clicca <strong> Riparazione </strong> e segui gli altri passaggi per riparare Microsoft Office. * </p> <p> * Avviso: se dopo aver fatto clic su Ripara, ricevi il &quot; <strong> Come vorresti riparare i tuoi programmi Office Office </strong> &quot;, selezionare il <strong> Riparazione rapida </strong> opzione, che controlla e sostituisce i file mancanti o danneggiati. Se dopo la &quot;Riparazione rapida&quot;, i problemi non vengono risolti, quindi scegli il <strong> Riparazione in linea </strong> opzione per reinstallare il prodotto Office. (richiede una connessione Internet). </p> <p><img src=\"images/image_thumb-26-143.png\" alt=\"Repair Office\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Al termine della riparazione, riavviare il PC. <br> 5. Installare gli strumenti di correzione. </p> <p> </p> <h6> Metodo 3. Disinstalla e reinstalla Office 2016 a 64 bit. </h6> <p> Il metodo successivo per risolvere i problemi di installazione degli strumenti di correzione di Office consiste nel rimuovere e reinstallare Office 2016 sul sistema. Fare quello: </p> <h2> Passaggio 1. Disinstalla Office dal sistema. </h2> <p> 1. Scarica il <a href=\"http://go.microsoft.com/?linkid=9815935\" target=\"_blank\" rel=\"nofollow noopener\"> Disinstallare la correzione di Microsoft Office </a> strumento per disinstallare automaticamente Office 365,  Office 2016 o Office 2013. <br> 2. Esegui &quot;Disinstalla Microsoft Office Fix&quot; e premi <strong> Il prossimo </strong> alla prima schermata. </p> <p><img src=\"images/image_thumb-19-681.png\" alt=\"office uninstall tool\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Lascia che il processo risolva i problemi con Office Disinstalla e rimuovi il software Office dal tuo computer. </p> <p><img src=\"images/image_thumb-20-361.png\" alt=\"cannot uninstall office\" loading=\"lazy\"></p> <p> </p> <h2> Passaggio 2. Scarica e installa Office 2016. </h2> <p> 1. Vai a <a href=\"https://www.heidoc.net/joomla/technology-science/microsoft/67-microsoft-windows-iso-download-tool\" target=\"_blank\" rel=\"nofollow noopener\"> HeiDoc.net </a> e scarica il <strong><a href=\"https://www.heidoc.net/php/Windows-ISO-Downloader.exe\" target=\"_blank\" rel=\"nofollow noopener\"> Strumento per scaricare ISO di Windows </a></strong> . <br> 2. Fare doppio clic per eseguire il file scaricato &quot;Windows-ISO-Downloader.exe&quot;. <br> 3. Nello strumento downloader ISO di Windows: </p> <blockquote><p> un. Scegli il <strong> Ufficio </strong> scheda nel riquadro di destra. <br> b. <strong> Selezionare </strong> il <strong> Versione per ufficio </strong> che vuoi scaricare. (es. &quot;Ufficio 2016&quot;). <br> c. Quindi a sinistra scegli il <strong> Edizione </strong> di ufficio e il desiderato <strong> linguaggio </strong> sotto. <br> d. Al termine, fare clic su <strong> Scarica </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-595.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Al termine del download, fare doppio clic sul file immagine scaricato (ProPlusRetail.img) per montarlo in Explorer. <br> 5. Esplora il contenuto dell&#39;immagine montata (unità) e apri la cartella &quot;Office&quot;. <br> 6. Fare doppio clic su &quot;setup32.exe&quot; per installare la versione di Office a 32 bit o su &quot;setup64.exe&quot; per installare la versione di Office a 64 bit. * </p> <p> * Nota: suggerisco, se hai una versione a 64 bit di Windows, di installare la versione a 64 bit di Office (setup64.exe). </p> <p><img src=\"images/image_thumb-25-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Al termine dell&#39;installazione, utilizzare la chiave di licenza per attivare Office. <br> 8. Seguire le istruzioni del metodo 1 sopra per installare gli strumenti di correzione. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}