{"title":"FIX: Impossibile terminare il processo. Impossibile completare l&#39;operazione, Accesso negato.","content":"<p> Se non riesci a terminare un processo o un servizio in Windows, perché ricevi l&#39;errore &quot;Impossibile terminare il processo. L&#39;operazione non può essere completata, l&#39;accesso è negato&quot;, continua a leggere di seguito per sapere come risolvere il problema. </p> <p><img src=\"images/image_thumb-10-874.png\" alt=\"Unable to terminate process. Access is denied\" loading=\"lazy\"></p> <p> Il modo normale per interrompere un processo in esecuzione in Windows è aprire Task Manager, fare clic con il pulsante destro del mouse sul nome del processo e selezionare &quot;Termina operazione&quot;. Ma, come forse saprai, a volte è impossibile interrompere un processo perché ricevi il messaggio &quot;Impossibile terminare il processo. Accesso negato&quot;. </p> <p> Allo stesso modo, potresti riscontrare un problema simile se desideri interrompere un servizio e non puoi, perché l&#39;opzione &quot;Stop&quot; è disattivata o perché viene visualizzato l&#39;errore &quot;Impossibile interrompere il servizio. Accesso negato&quot; quando si tenta di interrompere il servizio. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"Unable to Terminate Service\" loading=\"lazy\"></p> <p> In questo tutorial imparerai come terminare qualsiasi servizio o processo che non puoi terminare usando i soliti modi. </p> <h4> Come forzare l&#39;interruzione di qualsiasi servizio o programma da PowerShell nel sistema operativo Windows 10/8/7. </h4> <ul> <li><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> Come forzare la chiusura di qualsiasi applicazione da PowerShell. </a></li> <li><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> Come forzare la chiusura di qualsiasi servizio da PowerShell. </a></li> </ul> <h6></h6> <h6> Parte 1. Come terminare un&#39;applicazione da PowerShell. </h6> <p> 1. Aprire PowerShell come amministratore. </p> <p> 2. In PowerShell, digita il seguente comando per ottenere l&#39;ID del processo (PID). </p> <ul> <li><strong> elenco delle attività </strong></li> </ul> <p><img src=\"images/image_thumb-12-275.png\" alt=\"Terminate process from powershell\" loading=\"lazy\"></p> <p> </p> <p> 3. Prendere nota del nome dell&#39;applicazione che si desidera eliminare e quindi digitare il comando seguente per chiudere tutte le istanze dell&#39;applicazione. * </p> <ul> <li> Stop-Process -Nome &quot;Application_Name&quot; </li> </ul> <p> * Nota: in Application_Name, digitare il nome dell&#39;applicazione senza l&#39;estensione .exe. Ad esempio, se vuoi forzare la chiusura dell&#39;applicazione &quot;chrome.exe&quot;, digita: </p> <ul> <li><em> Stop-Process -Nome &quot;chrome&quot; </em></li> </ul> <p><img src=\"images/image_thumb-16-974.png\" alt=\"Stop Program PowerShell\" loading=\"lazy\"></p> <p> </p> <p><strong> MANCIA: </strong> Se vuoi terminare una singola istanza di un programma, digita il seguente comando: </p> <ul> <li> Stop-Processo -ID PID </li> </ul> <p> * Nota: in PID digita il numero univoco dell&#39;istanza del programma. </p> <p> </p> <h6> Parte 2. Come terminare un servizio da PowerShell. </h6> <p> 1. Aprire il task manager e dal <strong> Servizi </strong> scheda, notare il <strong> PID </strong> del servizio che si desidera interrompere. </p> <p><em> per esempio. In questo esempio forzeremo l&#39;arresto del servizio &quot;AdobeARMservice&quot; con PID <strong> 1640 </strong> . </em></p> <p><img src=\"images/image_thumb-14-150.png\" alt=\"Force Stop Service PowerShell\" loading=\"lazy\"></p> <p> </p> <p> 2. Quindi, corri <strong> PowerShell come amministratore </strong> e digita questo comando: </p> <ul> <li> kill -id PID </li> </ul> <p> * Nota: come PID digita il PID che hai notato in Task Manager. In questo esempio il comando sarà: </p> <ul> <li><em> kill -id 1640 </em></li> </ul> <p><img src=\"images/image_thumb-15-147.png\" alt=\"Kill Running Service from PowerShell\" loading=\"lazy\"></p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}