{"title":"FIX: errore di Outlook Express 0x800c0133 a causa del limite di dimensione di 2 GB nel file DBX (risolto)","content":"<p> Questo tutorial contiene le istruzioni per correggere l&#39;errore 0x800c0133 di Outlook Express a causa del limite di dimensione di 2 GB. L&#39;errore 0x800c0133 in OE si verifica perché una delle cartelle di Outlook supera il limite di 2 GB di dimensione. </p> <p> Descrizione del problema con il limite di dimensione di .DBX 2GB in Outlook Express. <br> Quando una delle cartelle principali di Outlook Express (ad esempio &quot;Posta in arrivo&quot; o &quot;Inviati&quot;) supera i 2 GB di dimensione, OE restituisce l&#39;errore 0x800c0133 durante l&#39;operazione di invio/ricezione e talvolta la cartella OE corrispondente diventa vuota (corrotta). Ad esempio, se la cartella &quot;Posta in arrivo&quot; (Inbox.dbx) supera i 2 GB di dimensione, OE non può ricevere le nuove e-mail e visualizza l&#39;errore 0x800c0133. </p> <p> * Nota: se una delle cartelle degli ambienti operativi è vuota, il file DBX associato è danneggiato. In tal caso, prova a recuperare le tue email dalla cartella OE danneggiata seguendo le istruzioni in questo articolo: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Come recuperare file DBX di Outlook Express GRATIS </a> . </p> <h4> Come risolvere il problema relativo al limite di 2 GB di Outlook Express (errore di invio/ricezione 0x800c0133). </h4> <h6> Passaggio 1. Abilita la visualizzazione dei file nascosti. </h6> <p> 1. Aprire Esplora risorse. <br> 2. Dal <strong> Utensili </strong> menu scegli <strong> Opzioni cartella </strong> . <br> 3. Nella scheda Visualizza, fare clic su <strong> Mostra file e cartelle nascosti </strong> e clicca <strong> OK. </strong></p> <p><img src=\"images/image_thumb1_thumb-210.png\" alt=\"image_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Passaggio 2. Individua il file DBX di Outlook Express da 2 GB sul disco. </h6> <p> 1. Aprire la cartella del negozio di Outlook Express. Di solito questa cartella si trova nel seguente percorso sul disco: </p> <ul> <li> C:\\Documents and Settings\\\\Local Settings\\Application Data\\Identities\\{}\\Microsoft\\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> per esempio. “C:\\Documents and Settings\\Admin\\Local Settings\\Application Data\\Identities\\{D8F3C56D-965E-41AE-8A23-A58460ABAE00}\\Microsoft\\ <strong> Outlook Express </strong> &quot; </p></blockquote> <p> 3. Dall&#39;esploratore <strong> Visualizza </strong> menu scegli <strong> Dettagli </strong> . <br> 4. Individua quale file DBX supera il limite di archiviazione di 2 GB. * </p> <p> * In questo esempio, il file &quot;Inbox.dbx&quot; supera i 2 GB di dimensione. </p> <p><img src=\"images/image_thumb2_thumb-339.png\" alt=\"FIX Outlook Express Error 0x800c0133\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Passaggio 3. Sposta le email dalla cartella Posta sovradimensionata a una cartella Nuova posta. </h6> <p> 1. Aprire Outlook Express. <br> 2. Selezionare la cartella di posta sovradimensionata (con dimensioni superiori a 2 GB, ad esempio la cartella &quot;Posta in arrivo&quot; in questo esempio). <br> 3. Se riesci a vedere le tue e-mail in quella cartella (la cartella non è vuota), procedi come segue: * </p> <p> * Avviso: se la cartella sembra vuota (non si vedono messaggi di posta elettronica su di essa), la cartella OE (e il file DBX associato) è danneggiata. In tal caso, devi recuperare le tue e-mail dalla cartella DBX danneggiata seguendo le istruzioni in questo articolo. </p> <p> 4. Nel riquadro sinistro, del programma OE, fare clic con il pulsante destro del mouse sulla cartella sovradimensionata e scegliere <strong> Nuova cartella </strong> (per creare una nuova cartella di posta) </p> <p><img src=\"images/image_thumb-6-403.png\" alt=\"outlook express 2gb limit\" loading=\"lazy\"></p> <p> </p> <p> 5. Digita un nome riconoscibile per la nuova cartella seguito da un anno (es. &quot;Posta in arrivo-2016&quot;) </p> <p><img src=\"images/image_thumb-7-434.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Quindi, dalla cartella sovradimensionata (es. da &quot;Posta in arrivo&quot;), seleziona un gruppo di email (es. tutte le email dell&#39;anno 2016) e trascinale (spostale) nella nuova cartella Mail che hai creato in precedenza (es. in &quot; Posta in arrivo-2016&quot;). </p> <p><img src=\"images/image_thumb-8-450.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Ripetere gli stessi passaggi (creare cartelle diverse per anno, ad esempio, e spostare i messaggi dalla cartella sovradimensionata alle nuove cartelle). * </p> <p> * Avviso: in caso di problemi durante l&#39;operazione di spostamento (ad es. se non è possibile spostare alcuni messaggi nella nuova cartella), allora: </p> <blockquote><p> 1. Chiudere Outlook Express. <br> 2. Copiare (backup) la cartella &quot;Outlook Express&quot; dalla posizione dell&#39;OE Store in un&#39;altra destinazione sul disco. <br> 3. Quindi seguire le istruzioni al passaggio 4 per eliminare il file .dbx sovradimensionato. <br> 4. Aprire Outlook Express. <br> 5. Importa le email dalla cartella di backup dell&#39;ambiente operativo (Da <strong> File </strong> menu vai a -&gt; <strong> Importare </strong> <strong> Messaggi </strong> -&gt; <strong> Microsoft Outlook Express 6 </strong> -&gt; <strong> Importa la posta dalla directory del negozio OE... </strong> ). ** </p> <p> ** Se si verificano ancora problemi durante l&#39;importazione, seguire le istruzioni in questo articolo per riparare il file DBX danneggiato. </p></blockquote> <p> </p> <p> 8. Quando hai finito con il trasferimento dell&#39;e-mail e la cartella da 2 GB si svuota dalle e-mail (ad es. la &quot;Posta in arrivo&quot; in questo esempio), vai al passaggio successivo. </p> <p><img src=\"images/image_thumb-10-811.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Passaggio 4. Elimina il file DBX di Outlook Express di grandi dimensioni dal disco. </h6> <p> 1. Aprire la cartella del negozio di Outlook Express sul disco. <br> 2. Eliminare il file DBX sovradimensionato (ad es. &quot;Inbox.dbx&quot; in questo esempio). </p> <p><img src=\"images/image_thumb-9-996.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Avvia Outlook Express. <br> 4. OE creerà (automaticamente) una nuova cartella di posta pulita e sana per archiviare le e-mail. * </p> <p> * Nota: se ricevi ancora lo stesso errore, prova a riparare la cartella OE danneggiata seguendo le istruzioni in questo articolo: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Come recuperare file DBX di Outlook Express GRATIS </a> . </p> <p> È tutto gente! Ha funzionato per te? </p> <p> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}