{"title":"FIX: ERRORE FATALE VIDEO DXGKRNL in Windows 10 (risolto)","content":"<p> Se riscontri l&#39;errore con schermata blu &quot;VIDEO DXGKRNL FATAL ERROR&quot; in Windows 10, segui le istruzioni di seguito per risolvere il problema. </p> <p> L&#39;errore BSOD di Windows 10 &quot; <em> Il tuo PC ha riscontrato un problema e deve essere riavviato. Stiamo solo raccogliendo alcune informazioni sugli errori, quindi riavvieremo per te. Se vuoi saperne di più, puoi cercare online in seguito questo errore: VIDEO DXGKRNL FATAL ERROR&quot;, </em> di solito indica un problema con i driver video. </p> <p><img src=\"images/image_thumb-7-129.png\" alt=\"FIX: VIDEO DXGKRNL FATAL ERROR in Windows 10\" loading=\"lazy\"></p> <p> Questo tutorial contiene istruzioni dettagliate per risolvere l&#39;errore della schermata blu &quot;VIDEO DXGKRNL FATAL ERROR&quot; in Windows 10. </p> <h2> Come risolvere: Windows 10 VIDEO DXGKRNL ERRORE FATALE. </h2> <h3> Passaggio 1. Correggi l&#39;ERRORE FATALE VIDEO DXGKRNL disinstallando/reinstallando i driver video. </h3> <p> 1. Apri <strong> Gestore dispositivi </strong> . Fare quello: </p> <ol> <li> <ol> <li> Premi Windows <img src=\"images/image_thumb8_thumb_thumb-153.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. </li> <li> Nella casella &quot;Apri&quot;, digita: <strong> devmgmt.msc </strong> &amp; clic <strong> ok </strong> . </li> </ol> </li> </ol> <blockquote> <p><img src=\"images/image_thumb-5-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p></blockquote> <p> 2. <strong> Espandere </strong> il <strong> Adattatori per display. <br> </strong> 3. <strong> Fare clic con il pulsante destro del mouse </strong> sugli adattatori video installati e selezionare <strong> Disinstalla dispositivo. </strong></p> <p><img src=\"images/image_thumb-46-240.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. Nella finestra successiva, se hai l&#39;opzione: &quot; <strong> Elimina il software del driver per questo dispositivo </strong> &quot;, selezionalo e fai clic su <strong> ok </strong> per rimuovere i driver installati dal computer. </p> <p> 5. Dopo la disinstallazione, <strong> ricomincia </strong> il tuo computer e vai a <strong> Gestore dispositivi </strong> ancora. <br> 6. Fare clic con il pulsante destro del mouse sul nome del computer (in alto) e selezionare <strong> Scansione per modifiche hardware. </strong></p> <p><img src=\"images/image_thumb-8-911.png\" alt=\"Scan for hardware changes\" loading=\"lazy\"></p> <p> </p> <p> 7. Lascia che Windows rilevi e installi i driver dello schermo e poi <strong> ricomincia </strong> nuovamente il computer e verificare se il &quot;VIDEO DXGKRNL FATAL ERROR&quot; persiste. * </p> <p> * Nota: se Windows non è in grado di installare automaticamente i driver dello schermo o se si verifica ancora l&#39;errore della schermata blu, procedere al passaggio successivo. </p> <p> </p> <h3><br clear=\"all\"> Passaggio 2. Reinstallare i driver video dal sito del produttore. </h3> <p> 1. Vai a <strong> Gestore dispositivi </strong> e <strong> disinstallare </strong> la scheda video installata. * </p> <p> * Nota: se possiedi un laptop con due (2) adattatori video, disinstallali entrambi. </p> <p> 2. Vai al sito di supporto del produttore del tuo computer (o della scheda grafica) e scarica i driver più recenti per le tue schede grafiche. </p> <ul> <li> <ul> <li> Per <strong> NVIDIA </strong> basate su GPU, vai a <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Pagina di ricerca avanzata dei driver NVIDIA </a> . </li> <li> Per <strong> AMD </strong> basate su GPU, vai a <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Centro download driver AMD (ATI). </a></li> <li> Per <strong> Intel </strong> basate su GPU, vai a <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Centro di download della grafica Intel. </a></li> </ul> </li> </ul> <p> 3. Procedere e installare il driver scaricato. * </p> <p><strong> * Nota importante: </strong> Se possiedi un laptop con due (2) adattatori video, procedi prima con l&#39;installazione dei driver per l&#39;adattatore AMD o NVIDIA e riavvia il laptop. Dopo il riavvio, procedere e installare i driver per la scheda video INTEL, quindi riavviare nuovamente il laptop. </p> <p> 4. Dopo l&#39;installazione, <strong> ricomincia </strong> il tuo PC e controlla se il VIDEO DXGKRNL FATAL ERROR è stato risolto. In caso contrario, procedere al passaggio successivo. </p> <p> </p> <h3><br clear=\"all\"> Passaggio 3. Ripara DirectX per correggere VIDEO DXGKRNL FATAL ERROR. </h3> <p> Il VIDEO DXGKRNL FATAL ERROR, indica un problema sui driver DirectX di Microsoft. Quindi, procedi con la riparazione DirectX. </p> <p> 1. Scarica il <a href=\"https://www.microsoft.com/en-us/download/details.aspx?displaylang=en&id=35\" target=\"_blank\" rel=\"nofollow noopener\"> Programma di installazione Web di runtime per l&#39;utente finale di DirectX </a> . <br> 2. Eseguire il file scaricato (dxwebsetup.exe) e seguire le istruzioni sullo schermo per installare i componenti opzionali di DirectX Runtime. </p> <p><img src=\"images/image_thumb-9-847.png\" alt=\"Install DirectX Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Al termine dell&#39;installazione <strong> ricomincia </strong> il tuo PC. </p> <p> 4. Dopo il riavvio, vai su <strong> Inizio <img src=\"images/image_thumb-55-571.png\" alt=\"image\" loading=\"lazy\"> -&gt; Impostazioni </strong> -&gt; <strong> Aggiornamento e sicurezza -&gt; </strong> e clicca <strong> Controlla gli aggiornamenti. </strong></p> <p><img src=\"images/image_thumb-76-281.png\" alt=\"Windows 10 - Check For Updates \" loading=\"lazy\"></p> <p> 5. Dopo l&#39;installazione degli aggiornamenti, riavvia nuovamente il PC e controlla se l&#39;errore BSOD è stato risolto. In caso contrario, procedere al passaggio successivo. </p> <p> </p> <h3><br clear=\"all\"> Passaggio 4. Ripara i file di sistema di Windows 10. </h3> <p> 1. Apri <strong> Prompt dei comandi come amministratore </strong> . <br> 2. Nel prompt dei comandi dare il seguente comando e premere <strong> Accedere: </strong></p> <ul> <li><strong> DISM.exe /Online /Cleanup-image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-176.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Quando l&#39;operazione DISM è completata, digita il seguente comando e premi <strong> accedere </strong> : </p> <ul> <li><strong> sfc /scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-464.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Ora attendi che il Controllo file di sistema ripari i file di sistema di Windows. <br> 5. Fatto questo, <strong> ricomincia </strong> computer e controlla se l&#39;errore persiste. </p> <p> </p> <h3><br clear=\"all\"> Passaggio 5. Analizzare il file di registro Minidump (BSOD). </h3> <p> Quando Windows si arresta in modo anomalo con una schermata blu, memorizza i dettagli della schermata BSoD in piccoli file, che hanno chiamato &quot; <strong> MiniDump </strong> &quot;. L&#39;analisi del <strong> Minidump </strong> file possono aiutarti a risolvere e risolvere il problema VIDEO DXGKRNL FATAL ERROR della schermata blu. Per eseguire questa attività, seguire le istruzioni in questo articolo: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Come analizzare i file MiniDump con BlueScreenView </a> . </p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}