{"title":"FIX: la barra delle colonne di Outlook (barra dell&#39;intestazione) scompare in Outlook 2016/2019. (Risolto)","content":"<p> Qualche giorno fa, uno dei miei clienti mi ha contattato per segnalarmi che in Outlook 2019 manca la barra con i titoli delle colonne (Invia, Da, Oggetto, Ricevuto, Dimensioni, ecc.). le intestazioni delle colonne sono scomparse dopo che l&#39;utente ha personalizzato le &quot;Impostazioni di visualizzazione&quot; e ha aumentato la dimensione del carattere della riga. </p> <p><img src=\"images/image_thumb-567.png\" alt=\"FIX: Outlook Columns Bar (Header Bar) Disappear in Outlook 2016/2019\" loading=\"lazy\"></p> <p> Questo tutorial contiene istruzioni su come risolvere il problema &quot;Barra dell&#39;intestazione di Outlook (riga di colonne) mancante&quot; in Outlook 2016/2019. </p> <h4> Come risolvere: la riga di intestazione della colonna manca in Outlook 2016/2019. </h4> <p> 1. Nel riquadro di sinistra, con le cartelle di Outlook, selezionare la cartella in cui non è possibile visualizzare la riga con le colonne (intestazioni). </p> <p> 2. Nella barra dei menu, scegli <strong> Visualizza </strong> e quindi fare clic su <strong> Visualizza impostazioni </strong> . </p> <p><img src=\"images/image_thumb-1-535.png\" alt=\"FIX Column Heading Row is Missing Outlook 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Nelle opzioni &quot;Impostazioni di visualizzazione avanzate&quot;, fare clic su <strong> Altre impostazioni </strong> . </p> <p><img src=\"images/image_thumb-2-711.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Nelle opzioni &quot;Altre impostazioni&quot;, <strong> deselezionare </strong> il <strong> Usa layout compatto con meno di 125 caratteri </strong> casella di controllo e fare clic su <strong> ok </strong> due volte per applicare l&#39;impostazione e chiudere tutte le finestre. </p> <p><img src=\"images/image_thumb-3-736.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Riavvia Outlook (o vai a un&#39;altra cartella e torna di nuovo alla cartella in cui hai applicato la modifica), per vedere la barra con le intestazioni delle colonne al loro posto. </p> <p><img src=\"images/image_thumb-4-249.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> È tutto! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-5.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p>"}