{"title":"FIX: errore di ripristino del sistema 0x8100010B (risolto)","content":"<p> Questo tutorial contiene istruzioni per risolvere l&#39;errore di ripristino del sistema 0x8100010B in Windows 10. L&#39;errore 0x8100010B può apparire quando si tenta di aumentare l&#39;utilizzo dello spazio massimo per la protezione del sistema o quando si tenta di eliminare tutti i precedenti punti di ripristino. </p> <p><img src=\"images/image_thumb-19-393.png\" alt=\"FIX System Restore Error 0x8100010B\" loading=\"lazy\"></p> <p> Più specificamente, questo articolo contiene istruzioni per risolvere il seguente problema in Ripristino configurazione di sistema: </p> <p><strong> 1. Impossibile aumentare lo spazio su disco massimo per la protezione del sistema </strong> con errore: &quot;C&#39;era un <strong> errore imprevisto nella pagina delle proprietà </strong> Nota: il nome del file, il nome della directory o la sintassi dell&#39;etichetta del volume non sono corretti. (0x8007007B)). </p> <p><strong> 2. Impossibile eliminare i punti di ripristino </strong> su Windows 10 con errore: &quot;Impossibile eliminare i punti di ripristino per il seguente motivo: Windows non è stato in grado di eliminare tutte le istantanee. Riprova o visualizza il registro eventi per ulteriori informazioni. (0x8100010B).&quot; </p> <h2> Come risolvere: errore 0x8100010B nella protezione del ripristino del sistema. </h2> <p> 1. <strong> Ricomincia </strong> il tuo PC. </p> <p> 2. Vai a <strong> Protezione del sistema </strong> impostazioni: </p> <ul> <li><b> Pannello di controllo &gt; Sistema &gt; Impostazioni di sistema avanzate &gt; Proprietà del sistema &gt; Protezione del sistema </b></li> </ul> <p> 3. Evidenzia il <strong> Disco locale C: (Sistema) </strong> e clicca <strong> Configura. </strong></p> <p><img src=\"images/image_thumb-22-902.png\" alt=\"0x8100010B System Protection\" loading=\"lazy\"></p> <p> </p> <p> 4. Seleziona <strong> Disabilita la protezione del sistema </strong> e clicca <strong> Applica &gt; OK. </strong> * </p> <p> * Nota: questa azione eliminerà definitivamente tutti i precedenti punti di ripristino. Se si desidera aumentare l&#39;utilizzo massimo dello spazio per la protezione del sistema, senza perdere i punti di ripristino, fornire il comando seguente in un prompt dei comandi con privilegi elevati e quindi verificare se il problema è stato risolto. </p> <ul> <li> vssadmin ridimensiona shadowstorage /For=C: /On=C: /MaxSize=15% </li> </ul> <p><img src=\"images/image_thumb-23-863.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Vicino </strong> e <strong> riaprire </strong> le impostazioni di protezione del sistema. </p> <p> 6. Ora seleziona <strong> Attiva la protezione del sistema </strong> , configura l&#39;Utilizzo massimo e fai clic su <strong> ok </strong> . </p> <p> 7. In Opzioni di protezione del sistema, seleziona <strong> Attiva la protezione del sistema </strong> e clicca <strong> OK. </strong></p> <p><img src=\"images/image_thumb-73-430.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> È tutto! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}