{"title":"FIX: Viber, Yahoo e altre app si bloccano sui dispositivi Android - marzo 2021 (risolto).","content":"<p> Diversi utenti nelle ultime ore hanno segnalato che molte app Android stanno andando in crash (22 marzo 2021). In particolare, Gmail, Viber, Google Chrome e altre app importanti non si aprono e si chiudono subito dopo l&#39;apertura. Il problema riguarda molti dispositivi Android e in particolare i dispositivi Samsung. Se riscontri un problema simile, continua a leggere di seguito per sapere come risolverlo. </p> <p> Aggiornamento (23 marzo 2021): Google ha identificato rapidamente il problema e ha scoperto che il <strong> Android WebView </strong> app era il colpevole e l&#39;ha risolto inviando aggiornamenti per esso e altre app di Chrome. </p> <h4> Come RISOLVERE: Android Google Apps, Viber, ecc. Problema di arresto anomalo (22 marzo 2021). </h4> <p> 1. Apri Android <strong> Impostazioni. </strong></p> <p> 2. Tocca <strong> Gestisci app </strong> (o <strong> App e notifiche </strong> o <strong> Applicazioni </strong> su alcuni dispositivi Android). </p> <p><img src=\"images/image_thumb-27-815.png\" alt=\"FIX: Android Apps are Crashing on Samsung or other Devices.\" loading=\"lazy\"></p> <p> </p> <p> 3. Fare clic sul menu con il <strong> tre punti </strong><img src=\"images/image_thumb-28-382.png\" alt=\"image\" loading=\"lazy\"> nell&#39;angolo in alto a destra e seleziona <strong> Mostra tutte le app </strong> (o <strong> Mostra app di sistema </strong> ). </p> <p><img src=\"images/image_thumb-29-272.png\" alt=\"FIX Android GMAIL or Viber Crash \" loading=\"lazy\"></p> <p> </p> <p> 3. Trova il <strong> Sistema Android WebView </strong> app (o <strong> Android WebView </strong> ) nell&#39;elenco e aprirlo. </p> <p><img src=\"images/image_thumb-30-842.png\" alt=\"FIX GMAIL Chrome or Viber Crash on Android - March 2021\" loading=\"lazy\"></p> <p> </p> <p> 4. Fare clic su <strong> Disinstalla aggiornamenti. </strong></p> <p><img src=\"images/image_thumb-31-471.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Tocca <strong> ok </strong> al messaggio di avviso. </p> <p> 6. <strong> Ricomincia </strong> il tuo dispositivo e il problema dovrebbe essere sparito. </p> <p> È tutto gente! Quale metodo ha funzionato per te? Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}