{"title":"FIX: Outlook 0x80042112 - Ricezione errore segnalato (risolto)","content":"<p> Outlook 0x80042112 La ricezione dell&#39;errore segnalato si verifica in genere quando Outlook tenta di ricevere e-mail di dimensioni molto grandi (ad es. In questo caso, Outlook visualizza il seguente errore durante lo &#39;Invio/Ricezione avanzamento&#39;: Errore segnalato &quot;Attività &#39;%Account e-mail% – Ricezione&#39; (0x80042112): &#39;I seguenti messaggi di posta elettronica sul server di posta non possono essere scaricati. Contatta il tuo provider di servizi Internet (ISP) o l&#39;amministratore della posta se continui a ricevere questo errore.&quot; </p> <p><img src=\"images/image_thumb-7-121.png\" alt=\"FIX: Outlook 0x80042112 Receiving reported error. \" loading=\"lazy\"></p> <p> Questo tutorial contiene istruzioni dettagliate per risolvere l&#39;errore di ricezione di Outlook 0x80042112. </p> <h4> Come correggere l&#39;errore segnalato di ricezione di Outlook 0x80042112. </h4> <h6> Passaggio 1. Assicurati di essere connesso a Internet. </h6> <p> A volte l&#39;errore di ricezione di Outlook 0x80042112, si verifica perché la connessione Internet è stata interrotta. Quindi, prima di tutto, verifica che la tua connessione Internet funzioni. Per fare ciò, apri il tuo browser Internet e visita qualsiasi sito Web per verificare la tua connessione. </p> <p> </p> <h6> Passaggio 2. Elimina i messaggi di posta elettronica in uscita. </h6> <p> Il secondo metodo per risolvere l&#39;errore 0x80042112 in Outlook consiste nell&#39;eliminare o spostare nelle bozze, tutti i messaggi email che sono stati bloccati nella Posta in uscita. Fare quello: </p> <p> 1. In Outlook, fare clic su <strong> Invia Ricevi </strong> scheda, quindi fare clic su <strong> Lavoro offline </strong> . </p> <p><img src=\"images/image_thumb-8-737.png\" alt=\"Move Outbox Emails to Drafts folder\" loading=\"lazy\"></p> <p> 2. <strong> Ricomincia </strong> Prospettiva. <br> 3. Selezionare il <strong> Posta in uscita </strong> cartella (a sinistra) e poi premere <strong> CTRL </strong> + <strong> UN </strong> per selezionare tutte le email (a destra). <br> 4. Fare clic con il tasto destro sulle e-mail selezionate e spostarle in <strong> bozze </strong> cartella, facendo clic su <strong> Sposta -&gt; Altra cartella </strong> , quindi selezionare il <strong> bozze </strong> cartella dall&#39;elenco. </p> <p><img src=\"images/image_thumb-10-352.png\" alt=\"FIX Outlook error 0x80042112\" loading=\"lazy\"></p> <p> </p> <p> 5. Al termine, fare clic su <strong> Invia Ricevi </strong> scheda e fare clic su <strong> Lavora in linea. <br> </strong> 6. <strong> Ricomincia </strong> Outlook ed eseguire un invio/ricezione. </p> <h6></h6> <h6> Passaggio 3. Esegui Outlook senza componenti aggiuntivi. </h6> <p> Un altro metodo per correggere l&#39;errore di Outlook 0x80042112 in ricezione è avviare l&#39;applicazione Outlook in modalità provvisoria e disabilitare eventuali componenti aggiuntivi che potrebbero causare l&#39;errore. </p> <p> 1. Per avviare Outlook in modalità provvisoria, tieni premuto il tasto <strong> CTRL </strong> (sulla tastiera) e quindi fare doppio clic sul collegamento Microsoft Outlook, oppure: </p> <blockquote><p> un. Premi contemporaneamente i tasti Windows <img src=\"images/image_thumb36-371.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> b. Genere: <strong> prospettiva/sicuro </strong> e clicca <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-14-671.png\" alt=\"outlook safe mode\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. In modalità provvisoria di Outlook, vai alle opzioni dei componenti aggiuntivi e <strong> disabilita tutti i componenti aggiuntivi </strong> . Fare quello: </p> <ul> <li> Per disabilitare i componenti aggiuntivi in <strong> Outlook 2007 </strong> : </li> </ul> <blockquote><p> 1. <strong> Sopra </strong> il <strong> Utensili </strong> menu, fare clic su <strong> Centro di fiducia. </strong><br> 2. Seleziona <strong> Componenti aggiuntivi </strong> nel riquadro di sinistra. <br> 3. Nel riquadro di destra, selezionare <strong> Componenti aggiuntivi COM </strong> e clicca <strong> Partire… <br> </strong> 4. <strong> Deseleziona </strong> tutte le caselle di controllo, per disabilitare tutti i componenti aggiuntivi e fare clic su <strong> OK. </strong></p></blockquote> <ul> <li> Per disabilitare i componenti aggiuntivi in <strong> Prospettive 2016, 2013 </strong> o <strong> 2010 </strong> : </li> </ul> <blockquote><p> 1. Fare clic su <strong> File </strong> menu e selezionare <strong> Opzioni </strong> . <br> 2. Seleziona <strong> Componenti aggiuntivi su </strong> il riquadro di sinistra. <br> 3. Nel riquadro di destra, selezionare <strong> Componenti aggiuntivi COM </strong> e clicca <strong> Partire… </strong></p></blockquote> <p><img src=\"images/image_thumb-20-411.png\" alt=\"disable outlook add-ins\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. <strong> Deseleziona </strong> <strong> tutti </strong> le caselle di controllo e fare clic su <strong> ok </strong> per disabilitare tutti i componenti aggiuntivi. </p> <p><strong><img src=\"images/image_thumb-21-683.png\" alt=\"turn off outlook add-ins\" loading=\"lazy\"><strong><br> </strong></strong></p> </blockquote> <p> 3. <strong> Ricomincia </strong> Prospettiva. <br> 4. Prova a inviare/ricevere. Se l&#39;avanzamento di invio/ricezione termina normalmente e senza visualizzare l&#39;errore 0x80042112, procedere e riattivare uno per uno tutti i plug-in disabilitati e riavviare Outlook, fino a trovare quale causa il problema. </p> <p> </p> <h6> Passaggio 4. Controlla le impostazioni di antivirus e firewall. </h6> <p> Se stai utilizzando un programma antivirus con funzionalità di scansione della posta, disattiva il componente aggiuntivo antivirus in Outlook (consulta le istruzioni al passaggio 3 sopra), oppure disabilita temporaneamente la protezione antivirus o disinstalla il programma antivirus. Inoltre, controlla le impostazioni del firewall e assicurati che le porte del server di posta elettronica che stai utilizzando non siano bloccate dal programma Firewall. Più specificamente, nelle impostazioni del firewall: </p> <p> A. Abilita i seguenti file per accedere a Internet: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Abilita le seguenti porte in Firewall: </p> <ul> <li><strong> Porta 110 </strong> (Se stai utilizzando un server di posta in arrivo POP3 senza connessione crittografata) * </li> <li><strong> Porta 995 </strong> (Se stai utilizzando un server di posta in arrivo POP3 con connessione crittografata (SSL abilitato) </li> </ul> <ul> <li><strong> Porta 143 </strong> (se stai utilizzando un server di posta in arrivo IMAP senza connessione crittografata) </li> <li><strong> Porta 993 </strong> (se stai utilizzando un server di posta in arrivo IMAP con connessione crittografata (SSL abilitato) </li> </ul> <ul> <li><strong> Porta 25 </strong> Se il tuo server di posta in uscita SMTP non utilizza SSL. * </li> <li><strong> Porta 465 </strong> o <strong> 587 </strong> se il tuo server di posta in uscita SMTP utilizza SSL </li> </ul> <p> * Nota: per impostazione predefinita, la porta 25 è per l&#39;accesso in uscita e la porta 110 è per l&#39;accesso in entrata. Se non sei sicuro delle porte, contatta il tuo ISP o l&#39;amministratore di sistema. </p> <p> </p> <h6> Passaggio 5. Riparare il file di dati PST di Outlook. </h6> <p> Il passaggio successivo per correggere l&#39;errore 0x80042112 segnalato dalla ricezione di Outlook consiste nell&#39;eseguire lo strumento di riparazione Posta in arrivo per riparare il file .pst. Le istruzioni dettagliate per farlo possono essere trovate in questo tutorial: <a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Come riparare file di dati PST di Outlook? </a> . </p> <p> </p> <h6> Passaggio 6. Controllare la dimensione dei messaggi e-mail dal WEB. </h6> <p> Se hai accesso al tuo account e-mail sul Web, accedi al tuo account e-mail utilizzando il browser Web e controlla se la dimensione di un&#39;e-mail è il problema. Ad esempio, se trovi un&#39;e-mail di grandi dimensioni nella Posta in arrivo, scarica i suoi allegati e quindi elimina l&#39;e-mail. * </p> <p> * Nota: se non hai accesso al tuo account di posta elettronica tramite il Web, contatta il tuo provider di posta elettronica per segnalare il problema. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}