{"title":"FIX: Impossibile aprire i collegamenti da Windows 10 e-mail o Outlook in Windows 10. (Risolto)","content":"<p> Se non riesci ad aprire i collegamenti dalle e-mail nelle app Posta e Outlook di Windows 10, continua a leggere di seguito per risolvere il problema. Molti utenti hanno segnalato che dopo l&#39;aggiornamento di Windows 10, non saranno in grado di aprire i collegamenti incorporati dalle e-mail nel browser Web e ricevere un errore sconosciuto. </p> <p> Problema in dettaglio: su un computer basato su Windows 10, i collegamenti ipertestuali dalle e-mail di Outlook o dall&#39;app Windows 10 Mail non si aprono nel browser Web, soprattutto se si utilizza come browser predefinito Chrome o Firefox e non Microsoft Edge . </p> <h4> Come risolvere: impossibile aprire i collegamenti HTML dalle e-mail dopo l&#39;aggiornamento di Windows 10. </h4> <h6> Metodo 1. Ripristina le app predefinite. </h6> <p> 1. Chiudere tutti i browser Web aperti. <br> 2. Chiudi l&#39;applicazione di posta elettronica che stai utilizzando (ad es. Windows 10 Mail, Outlook) </p> <p> 3. Dal menu Start <img src=\"images/image_thumb2_thumb_thumb-709.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clic <strong> impostazioni </strong><img src=\"images/image_thumb-66-594.png\" alt=\"image\" loading=\"lazy\"> e clicca <strong> App </strong></p> <p><img src=\"images/image_thumb-72-875.png\" alt=\"Windows 10 Apps\" loading=\"lazy\"></p> <p> 4. Scegli <strong> App predefinite </strong> dal riquadro di sinistra e quindi fare clic su <strong> Ripristina </strong> pulsante per ripristinare le app consigliate da Microsoft. </p> <p><img src=\"images/image_thumb-73-622.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 5. Ora apri il tuo programma di posta elettronica e apri un collegamento ipertestuale da un&#39;e-mail. Normalmente il collegamento si aprirà nel browser Microsoft Edge senza problemi. </p> <p> 6. Ora, <strong> vicino </strong> nuovamente l&#39;applicazione di posta. </p> <p> 7. Apri il browser web e impostalo come predefinito, oppure vai a <strong> Impostazioni &gt; </strong> <strong> Applicazioni &gt; App predefinite </strong> e a <strong> Programma di navigazione in rete </strong> opzioni, fare clic su <strong> Microsoft Edge </strong> e seleziona il tuo browser preferito come browser web predefinito. </p> <p><img src=\"images/image_thumb-75-384.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 8. Apri di nuovo l&#39;app Mail e prova ad aprire un collegamento ipertestuale. Se il problema persiste, seguire i passaggi del metodo-2. </p> <h6> Metodo 2. Modificare le associazioni HTML nel registro. </h6> <p> 1. Premere contemporaneamente Windows <img src=\"images/image_thumb36-617.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo <strong> regedit </strong> &amp; stampa <strong> Accedere. </strong></p> <p><img src=\"images/image_thumb7-779.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2. Nel riquadro di sinistra, vai a questa sottochiave: </p> <ul> <li><strong> HKEY_CURRENT_USER\\Software\\Classes\\.html </strong></li> </ul> <p> 3. Adesso <em> doppio click </em> al <strong> (Predefinito) </strong> Stringa nel riquadro di destra e imposta i dati del valore su <strong> file html </strong></p> <p><img src=\"images/image_thumb2-467.png\" alt=\"Cannot Open Links from Windows 10 Email or Outlook in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 4. Eseguire la stessa operazione e modificare il <em><strong> Predefinito </strong></em> valore stringa a <strong> file html </strong> in queste sottochiavi: </p> <ul> <li><em> HKEY_CURRENT_USER\\Software\\Classes\\.htm </em></li> <li><em> HKEY_CURRENT_USER\\Software\\Classes\\.shtml </em></li> <li><em> HKEY_CURRENT_USER\\Software\\Classes\\.xhtml </em></li> <li><em> HKEY_CURRENT_USER\\Software\\Classes\\.xht <br> </em></li> </ul> <p> 5. Chiudere l&#39;editor del Registro di sistema e <strong> ricomincia </strong> il tuo computer. <br> 6. Prova ad aprire i collegamenti ipertestuali dal tuo programma di posta elettronica. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo. </p>"}