{"title":"FIX: Touchpad non funziona o si blocca in Windows 10 (risolto)","content":"<p> Negli ultimi anni ho risolto molti problemi del touchpad in Windows 10 su diversi laptop (ad esempio il touchpad non funziona, il touchpad si blocca, ecc.), Quindi ho deciso di scrivere un tutorial per risolvere questi problemi. </p> <p> Se possiedi un laptop, di tanto in tanto potresti avere problemi con il dispositivo touchpad. Soprattutto se hai Windows 10, il touchpad può spesso smettere di funzionare o non funzionare correttamente dopo aver installato un aggiornamento. Ovviamente i problemi del touchpad possono indicare un problema hardware, ma in molti casi i malfunzionamenti del touchpad sono dovuti a problemi software. </p> <p> Su Windows 10, il touchpad del laptop potrebbe non funzionare per vari motivi, quindi questo tutorial coprirà tutti i metodi per risolvere il problema. </p> <h2> Come risolvere i problemi del touchpad in Windows 10. </h2> <p> Segui questi passaggi prima di procedere con i seguenti metodi per risolvere i problemi del touchscreen. </p> <ol> <li> Assicurati che Windows 10 non sia bloccato, premendo ALT + CTRL + CANC e verifica se Task Manager si apre. </li> <li> Se il tuo laptop ha una combinazione di tasti funzione per disabilitare e abilitare il touchpad. (ad es. Fn + F3), quindi premere la combinazione di tasti Fn per accendere il touchpad. (Su alcuni laptop il touchpad può essere acceso/spento toccando due volte la superficie del touchpad) </li> <li> Riavvia il tuo computer. </li> <li> Esegui un arresto completo di Windows 10, quindi riaccendi il laptop. (Per eseguire uno spegnimento completo: tenere premuto il tasto <strong> CAMBIO </strong> tasto e quindi fare clic su <strong> Inizio </strong> &gt; <strong> Energia </strong> &gt; <strong> Spegnimento </strong> ). </li> </ol> <p><strong> </strong></p> <h3> Metodo 1. Abilita il touchpad in Windows 10. </h3> <p> Windows 10 ha la capacità di disabilitare o spegnere il touchpad quando è collegato un mouse esterno. Quindi, procedi e assicurati che il Touchpad sia abilitato nelle impostazioni del Touchpad. </p> <p> 1. Vai a <strong> Inizio </strong><img src=\"images/image_thumb2_thumb_thumb-670.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menu -&gt; <strong> impostazioni </strong> <img src=\"images/image_thumb-66-512.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Dispositivi. <br> </strong> 2. Seleziona <strong> Touchpad </strong> sul pannello di sinistra e a destra assicurati che l&#39;interruttore del Touchpad sia impostato su <strong> SOPRA </strong> e anche <strong> dai un&#39;occhiata </strong> il <strong> Lascia il touchpad acceso quando è collegato un mouse </strong> opzione. * </p> <p><img src=\"images/image_thumb-38-467.png\" alt=\"Disable Touchpad Windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Nota: se non riesci a trovare qui l&#39;interruttore/interruttore del touchpad... </p> <p> 1. Apri <strong> Altre impostazioni </strong> sotto il <strong> Impostazioni correlate </strong> sezione. </p> <ul> <li> Articolo correlato: <a href=\"https://www.repairwin.com/disable-touchpad-option-missing-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Disabilita l&#39;opzione Touchpad mancante su Windows 10. </strong></a></li> </ul> <p><img src=\"images/image_thumb-39-742.png\" alt=\"touchpad additional settings\" loading=\"lazy\"></p> <p> 2. Abilitare il touchpad nelle opzioni Proprietà del mouse. (Se il touchpad è già abilitato, prova a disabilitarlo e riattivarlo.) </p> <p><img src=\"images/image_thumb-31-122.png\" alt=\"enable touchpad windows 10\" loading=\"lazy\"></p> <h3> Metodo 2. Ripristina le impostazioni del touchpad in Windows 10. </h3> <p> Un metodo comune per risolvere i problemi del touchpad in Windows 10 è ripristinare le impostazioni predefinite del touchpad. </p> <p> 1. Vai a <strong> Inizio </strong><img src=\"images/image_thumb2_thumb_thumb-596.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menu -&gt; <strong> impostazioni </strong> <img src=\"images/image_thumb-66-851.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Dispositivi. <br> </strong> 2. A <strong> Touchpad </strong> opzioni <strong> , </strong> scorri verso il basso e clicca <strong> Ripristina </strong> sotto <strong> Reimposta il tuo touchpad. * </strong></p> <p><img src=\"images/image_thumb-40-277.png\" alt=\"reset touchpad windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Nota: se non riesci a vedere il <strong> Ripristina </strong> pulsante… </p> <p> 1. Aprire il <strong> Altre impostazioni </strong> . <br> 2. Fare clic su <strong> Ripristina dispositivi </strong> nelle opzioni Proprietà del mouse. </p> <p><img src=\"images/image_thumb-33-928.png\" alt=\"reset touchpad settings windows 10\" loading=\"lazy\"></p> <h3> Metodo 3. Disinstalla e reinstalla il driver del dispositivo Touchpad. </h3> <p> Un&#39;altra soluzione per risolvere i problemi del touchpad in Windows 10 è disinstallare e reinstallare completamente i driver del touchpad. </p> <p> 1. Apri <strong> Gestore dispositivi </strong> . Fare quello: </p> <blockquote><p> 1. Premi Finestre <img src=\"images/image_thumb8_thumb_thumb-140.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Nella casella &quot;Apri&quot;, digita: <strong> devmgmt.msc </strong> &amp; clic <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-5-568.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Espandi Mouse e altri dispositivi di puntamento. <br> 3. <strong> Fare clic con il pulsante destro del mouse </strong> sul <strong> TouchPad </strong> dispositivo e fare clic <strong> Disinstalla. </strong></p> <blockquote> <p><img src=\"images/image_thumb-34-656.png\" alt=\"uninstall touchpad windows 10\" loading=\"lazy\"></p> </blockquote> <p> 4. Dopo il riavvio, attendi 4-5 minuti affinché Windows reinstalli il driver del touchpad e controlla se il touchpad funziona. Se il tuo touchpad non funziona di nuovo, prova a installare il suo driver dal sito di supporto del produttore del tuo laptop. </p> <h3> Metodo 4. Disabilita e abilita il touchpad nel BIOS. * </h3> <p> * Nota: questo metodo non si applica a tutti i modelli di laptop, ma so che funziona su molti laptop ASUS. </p> <p> 1. Spegni completamente il laptop tenendo premuto il tasto MAIUSC mentre fai clic <strong> Inizio </strong> &gt; <strong> Energia </strong> &gt; <strong> Spegnimento </strong><br> 2. Accendere il laptop e premere il tasto Funzione corrispondente per accedere alle impostazioni del BIOS. (es. F2, F10, ecc.), <br> 3. Nelle impostazioni del BIOS, controlla se è presente un&#39;impostazione per il touchpad o il dispositivo di puntamento interno o il dispositivo trackpad (di solito questa impostazione si trova in &#39; <strong> Avanzate </strong> &#39; sezione). Se è così, <strong> disattivare </strong> il <strong> dispositivo touchpad </strong> e <strong> Salva ed esci </strong> dalle impostazioni del BIOS. <br> 4. Lascia caricare Windows 10. <br> 5. Spegni e riaccendi il laptop. <br> 6. Rientrare nelle impostazioni del BIOS e ri- <strong> abilitare il touchpad </strong> &amp; <strong> Salva ed esci </strong> . <br> 7. Dopo aver avviato Windows 10, il touchpad dovrebbe funzionare. </p> <p><strong> Conclusione: </strong> Se, dopo i passaggi precedenti, il tuo touchpad continua a non funzionare, ciò indica un problema hardware. In questo caso, utilizzare un mouse esterno o recarsi in un&#39;officina di riparazione di laptop per riparare il dispositivo touchpad. </p> <p> È tutto gente! Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}