{"title":"FIX: relazione di fiducia tra questa workstation e il dominio primario non riuscita (risolto)","content":"<p> Se ricevi l&#39;errore &quot;La relazione di fiducia tra questa workstation e il dominio primario non è riuscita&quot; quando tenti di accedere al tuo dominio o quando tenti di accedere a una cartella condivisa su un&#39;altra macchina del dominio, continua a leggere di seguito per risolvere il problema. </p> <p> L&#39;errore &quot;Relazione di fiducia tra workstation e dominio primario non riuscita&quot; può essere visualizzato per i seguenti motivi: </p> <ul> <li> Il computer ha lo stesso nome di un altro computer nel dominio. </li> <li> Le credenziali di dominio (nome utente o password) non sono valide. </li> <li> L&#39;account del computer è scaduto. * </li> </ul> <p> * Nota: alcune organizzazioni precostruiscono computer (o cloni di computer) per un uso successivo. Se l&#39;account del computer è scaduto, non sarà più in grado di autenticarsi con il dominio. In tali casi, i computer che non possono autenticarsi con il dominio devono essere rimossi dal dominio e ricongiunti ad esso. (passo-4) </p> <p><img src=\"images/image_thumb-32-740.png\" alt=\"FIX: Trust Relationship Between this Workstation and the Primary Domain Failed \" loading=\"lazy\"></p> <h4> Come risolvere: relazione di fiducia tra workstation e dominio non riuscita. </h4> <h6> Metodo 1. Verificare che le credenziali di dominio siano corrette. </h6> <p> Prima di tutto assicurati che le credenziali siano corrette e soprattutto la password. se hai clonato la macchina da un&#39;immagine del computer presa in passato e da allora il codice è cambiato. </p> <h6> Metodo 2. Verificare la presenza di nomi di computer duplicati. </h6> <p> Assicurati che il nome del computer sia univoco e che non ci siano altri computer in rete con lo stesso nome. </p> <h6> Metodo 3. Verificare la presenza di indirizzi IP duplicati. </h6> <p> Assicurarsi che l&#39;indirizzo IP del computer sia univoco e non sia in conflitto con un altro indirizzo IP sulla rete. </p> <h6> Metodo 4. Rimuovere e ricollegarsi al computer nel dominio. </h6> <p> Il metodo usuale per correggere una relazione di trust tra un computer e un dominio consiste nel rimuovere e aggiungere nuovamente il computer interessato al dominio. </p> <h5> Passaggio 1. Elimina l&#39;account del computer dal dominio. </h5> <p> 1. Accedere al server Active Directory. <br> 2. Apri <strong> Utenti e computer di Active Directory. <br> </strong> 3. Espandi il <strong> Computer </strong> contenitore. <br> 4. Fare clic con il pulsante destro del mouse sul computer interessato e selezionare <strong> Elimina. </strong></p> <p><img src=\"images/image_thumb-39-366.png\" alt=\"Delete Computer Account from Domain\" loading=\"lazy\"></p> <h5> Passaggio 1. Rimuovere e ricollegarsi al computer nel dominio. </h5> <p> 1. Accedere al computer interessato con l&#39;account Amministratore LOCALE (Nome computer\\Amministratore). </p> <p> 2. Premi Finestre <img src=\"images/image_thumb8_thumb-480.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. </p> <p> 2a. genere <strong> sysdm.cpl </strong> &amp; clic <strong> ok </strong> . </p> <p><img src=\"images/image_thumb7_thumb-169.png\" alt=\"system properties\" loading=\"lazy\"></p> <p> 3. Nella scheda &quot;Nome computer&quot;, fare clic su <strong> Modificare </strong> . </p> <p><img src=\"images/image_thumb-37-924.png\" alt=\"Remove Computer from Domain\" loading=\"lazy\"></p> <p> 4. In Membro di, seleziona <strong> gruppo di lavoro </strong> , digita il nome di un gruppo di lavoro (ad es. WORKGROUP&quot;) e fai clic su <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-34-169.png\" alt=\"Change Computer Name - Membership\" loading=\"lazy\"></p> <p> 5. Digitare le credenziali dell&#39;amministratore e fare clic su <strong> ok </strong> . <br> 6. <strong> Ricomincia </strong> il computer. </p> <p> 7. Eseguire nuovamente i passaggi 1-4 ma questa volta, al passaggio 4, selezionare <strong> Dominio, </strong> digita il nome di dominio e fai clic su <strong> OK. </strong></p> <p><img src=\"images/image_thumb-38-928.png\" alt=\"Add computer to domain\" loading=\"lazy\"></p> <p> 8. Digitare le credenziali dell&#39;amministratore di dominio e fare clic su <strong> ok </strong> . <br> 9. <strong> Ricomincia </strong> il tuo PC e accedi al dominio utilizzando l&#39;account utente di dominio. </p> <h6> Metodo 5. Reimpostare l&#39;account del computer nel dominio. </h6> <p> 1. Accedere al server Active Directory. <br> 2. Apri <strong> Utenti e computer di Active Directory. <br> </strong> 3. Espandi il <strong> Computer </strong> contenitore. <br> 4. Fare clic con il pulsante destro del mouse sul computer interessato e selezionare <strong> Reimposta account. </strong></p> <p><img src=\"images/image_thumb-36-935.png\" alt=\"Reset Computer Account in Domain\" loading=\"lazy\"></p> <p> 5. Infine, <strong> ricomincia </strong> il <strong> macchina interessata </strong> e accedi a Dominio. </p> <p> È tutto gente! Quale metodo ha funzionato per te? Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}