{"title":"FIX: problema con lo sfondo posteriore in Windows 7 (risolto)","content":"<p> Questo tutorial contiene istruzioni per risolvere il problema dello sfondo nero quando l&#39;immagine di sfondo è impostata su &quot;Allunga&quot; nel sistema operativo Windows 7. Il problema dello sfondo nero può apparire nei computer basati su Windows 7 dopo l&#39;installazione dell&#39;aggiornamento 14 gennaio 2020 - KB4534310. </p> <p><img src=\"images/image_thumb-16-423.png\" alt=\"FIX: Back Wallpaper issue in Windows 7\" loading=\"lazy\"></p> <p> Il problema dello sfondo nero di Windows 7 è un bug noto dopo l&#39;installazione del <a href=\"http://www.catalog.update.microsoft.com/Search.aspx?q=KB4534310\" target=\"_blank\" rel=\"nofollow noopener\"> aggiornamento KB4534310 </a> e come Microsoft <a href=\"https://support.microsoft.com/en-us/help/4534310/windows-7-update-kb4534310\" target=\"_blank\" rel=\"nofollow noopener\"> dice </a> : &quot;Stiamo lavorando a una risoluzione e forniremo un aggiornamento in una prossima versione, che verrà rilasciata a tutti i clienti che eseguono Windows 7 e Windows Server 2008 R2 SP1&quot;. </p> <p> Se desideri risolvere il problema dello &quot;sfondo nero&quot;, fino a quando Microsoft non rilascerà un aggiornamento per risolverlo, segui le istruzioni riportate di seguito. </p> <h4> Come risolvere il problema dello sfondo nero in Windows 7. </h4> <h6> Metodo 1. Disinstallare l&#39;aggiornamento KB4534310. </h6> <p> Il primo metodo per risolvere i problemi dello sfondo nero in Windows 7 consiste nel rimuovere l&#39;aggiornamento KB4534310.* </p> <p> * Nota: poiché l&#39;aggiornamento KB4534310 include miglioramenti della sicurezza e correzioni per Windows 7, non è consigliabile disinstallarlo. Quindi, suggeriamo di risolvere il problema seguendo le istruzioni su <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metodo-2 </a> sotto. </p> <p> Per disinstallare l&#39;aggiornamento KB4534310: </p> <p> 1. Fare clic con il pulsante destro del mouse su <strong> Inizio </strong> menù <img src=\"images/image_thumb-38-451.png\" alt=\"image\" loading=\"lazy\"> e scegli <strong> Pannello di controllo </strong> . <br> 2. Impostare il <strong> Visualizza per: a Icone piccole </strong> e clicca <strong> Programma e funzionalità. </strong></p> <p><img src=\"images/image_thumb-51-750.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 3. Fare clic su <strong> Visualizza gli aggiornamenti installati </strong> nel riquadro di sinistra. </p> <p> </p> <p><img src=\"images/image_thumb-52-942.png\" alt=\"uninstall updates windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Nella casella di ricerca, digita &quot; <strong> KB4534310 </strong> &quot; e premi Invio. <br> 5. Evidenziare &quot;Aggiornamento di sicurezza per Microsoft Windows (KB4534310)&quot; e fare clic su <strong> Disinstalla </strong> . </p> <p><img src=\"images/image_thumb-12-776.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Metodo 2. Modifica la posizione dell&#39;immagine oltre a &quot;Stira&quot;. </h6> <p> Il problema dello sfondo nero in Windows 7 viene visualizzato solo quando l&#39;immagine di sfondo selezionata viene allungata. Quindi, il metodo successivo per risolvere il problema è impostare un&#39;altra posizione dell&#39;immagine per l&#39;immagine di sfondo. Fare quello: </p> <p> 1. Fare clic con il pulsante destro del mouse sul desktop e fare clic su <strong> Personalizzare </strong> . </p> <p><img src=\"images/image_thumb-17-501.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Fare clic su <strong> Sfondo del desktop </strong></p> <p><img src=\"images/image_thumb-14-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Ora, applica le seguenti azioni: </p> <p> un. In Posizione immagine, seleziona <strong> Libreria di immagini. </strong><br> b. Seleziona l&#39;immagine che desideri per lo sfondo o qualsiasi altra immagine/foto personalizzata che corrisponda alla risoluzione dello schermo. * </p> <blockquote> <p> * Suggerimento: per scoprire l&#39;attuale risoluzione dello schermo, fare clic con il pulsante destro del mouse su Desktop e fare clic su <strong> Risoluzione dello schermo </strong> . </p> </blockquote> <p> c. A <strong> Posizione dell&#39;immagine </strong> , seleziona qualsiasi altra opzione eccetto &quot; <strong> Allungare </strong> &quot;, come &quot;Riempi&quot;, &quot;Adatta&quot;, &quot;Affianca&quot; o &quot;Centra&quot;. <br> d. Al termine, fai clic su Salva <strong> i cambiamenti </strong> . </p> <p><img src=\"images/image_thumb-15-519.png\" alt=\"image\" loading=\"lazy\"></p> <p> È tutto! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}