{"title":"FIX: problema di utilizzo della memoria elevata di Chrome (risolto)","content":"<p> Come avrai già notato, Google Chrome apre molti processi in background, anche quando hai aperto solo poche finestre/schede di Chrome. Questo accade, perché Google Chrome è progettato in modo tale da creare un processo individuale per ogni plug-in o estensione installato quando si apre una nuova finestra o scheda. </p> <p> Sebbene l&#39;apertura di più processi da Google Chrome sia un comportamento normale, in realtà è un problema, perché questo comportamento causa molto utilizzo della memoria e rende il computer non rispondente. </p> <p><img src=\"images/image_thumb-17-610.png\" alt=\"FIX: Multiple Processes in Chrome with High Memory Usage\" loading=\"lazy\"></p> <p> </p> <p> Questo tutorial contiene istruzioni passo passo su come impedire a Chrome di aprire più processi per ogni finestra o scheda, al fine di risolvere il problema dell&#39;utilizzo elevato della memoria di Chrome. </p> <h4> Come disabilitare più processi Chrome in Windows 10. </h4> <h6> Passaggio 1. Scansiona il tuo computer alla ricerca di malware e virus. </h6> <p> Il primo passaggio prima di risolvere l&#39;errore &quot;ERR_CONNECTION_CLOSED&quot; in Chrome è assicurarsi che il sistema sia privo di virus/malware. Per questo compito segui le istruzioni in questa guida: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Come eseguire la scansione del computer alla ricerca di virus e altri programmi dannosi. </a></p> <h6></h6> <h6> Passaggio 2. Disabilita le estensioni di Chrome indesiderate. </h6> <p> Prima di tutto, controlla se hai bisogno di tutte le estensioni di Chrome installate e disabilita quelle che non ti servono. Fare quello: </p> <p> 1. Dal menu di Chrome <img src=\"images/image_thumb-47-380.png\" alt=\"image\" loading=\"lazy\"> , vai a <strong> Altri strumenti </strong> -&gt; <strong> Estensioni </strong></p> <p><img src=\"images/image_thumb-51-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Rimuovi (o disabilita) qualsiasi estensione che non ti serve o che non riconosci. </p> <p><img src=\"images/image_thumb-49-442.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Passaggio 3. Impedisci l&#39;esecuzione di Chrome in background quando Chrome è chiuso. </h6> <p> 1. Dal menu Chrome <img src=\"images/image_thumb-78-665.png\" alt=\"image\" loading=\"lazy\"> Selezionare <strong> impostazioni </strong> . </p> <p><img src=\"images/image_thumb-79-868.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> 2. A <strong> impostazioni </strong> pagina, scorri verso il basso e clicca <strong> Avanzate </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <p> 3. Imposta l&#39;opzione &quot;Continua a eseguire app in background quando Google Chrome è chiuso&quot; su <strong> OFF </strong> . </p> <p><img src=\"images/image_thumb-18-557.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <p> </p> <h6> Passaggio 4. Impedisci a Chrome di aprire più processi per lo stesso sito. </h6> <p> 1, <strong> Fare clic con il pulsante destro del mouse </strong> sopra <strong> Google Chrome </strong> scorciatoia e seleziona <strong> Proprietà </strong> . <br> 2. A <strong> Generale </strong> scheda, aggiungi l&#39;interruttore &quot; –process-per-site&quot; (senza virgolette), alla fine della riga di destinazione e fai clic su <strong> ok </strong> e <strong> Continua </strong> per applicare la modifica <strong> . * </strong></p> <p> per esempio. &quot;C:\\Programmi\\Google\\Chrome\\Application\\chrome.exe&quot; –processo per sito </p> <p> Nota: c&#39;è uno spazio prima di –process-per-site </p> <p><img src=\"images/image_thumb-19-818.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Passaggio 5. Disabilita l&#39;isolamento del sito di Google Chrome. </h6> <p> Nella modalità di isolamento del sito, Chrome caricherà ogni sito Web nel proprio processo. Questa è infatti una funzione di sicurezza aggiuntiva per impedire a un sito Web di rubare i tuoi dati da un altro sito Web aperto su un&#39;altra finestra/scheda. Tuttavia, la modalità &quot;Isolamento del sito&quot;, aumenterà l&#39;utilizzo della memoria di Chrome di circa il 10%. </p> <p> 1. Sulla barra degli indirizzi di Chrome, digita <a href=\"//flags/#site-isolation-trial-opt-out\" target=\"_blank\" rel=\"nofollow noopener\"> chrome://flags/#site-isolation-trial-opt-out </a> e fai clic su invio. </p> <p> 2. Impostare il <strong> Disabilita l&#39;isolamento del sito </strong> modalità a <strong> Disabilitato </strong> e quindi fare clic su <strong> Riavvia ora </strong> . * </p> <p> * Nota: </p> <p><img src=\"images/image_thumb-20-397.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> È tutto gente! Ha funzionato per te? </p> <p> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}