{"title":"FIX: La protezione da virus e minacce è gestita dalla tua organizzazione in Windows 10. (Risolto)","content":"<p> Questo tutorial contiene le istruzioni per risolvere il seguente problema in Windows Defender Security Center: &quot;La tua protezione da virus e minacce è gestita dalla tua organizzazione&quot; nel sistema operativo Windows 10. </p> <p> I messaggi (errori) di Windows Defender: &quot;La protezione da virus e minacce è gestita dalla tua organizzazione&quot;, &quot;Alcune impostazioni sono gestite dalla tua organizzazione&quot; e <br> &quot;La protezione in tempo reale è gestita dall&#39;amministratore&quot;, viene comunemente visualizzata sui computer aziendali in cui la protezione antivirus è gestita dall&#39;amministratore di dominio. Se il computer non appartiene a un dominio, gli errori di cui sopra vengono visualizzati dopo l&#39;installazione di un antivirus di terze parti o dopo un attacco di virus. </p> <p><img src=\"images/image_thumb-25-853.png\" alt=\"FIX: Virus & Threat Protection is Managed by your Organization - Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Come risolvere: la tua protezione da virus e minacce è gestita dalla tua organizzazione in Windows 10. </h4> <h6> Passaggio 1. Disinstallare qualsiasi altro antivirus non Microsoft. </h6> <p> Il primo passo per risolvere l&#39;errore di Windows Defender &quot;La protezione da virus e minacce è gestita dalla tua organizzazione&quot; consiste nel disinstallare qualsiasi altro antivirus di terze parti (ad esempio Avast, MacAfee, MalwareBytes, ecc.) dal sistema. </p> <p> </p> <h6> Passaggio 2. Scansiona il tuo sistema alla ricerca di virus e malware. </h6> <p> Il secondo passaggio per risolvere l&#39;errore di Windows Defender &quot;Alcune impostazioni sono gestite dalla tua organizzazione&quot; è assicurarsi che il sistema sia privo di virus/minacce informatiche. Per questo compito segui le istruzioni in questa guida: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Come eseguire la scansione del computer alla ricerca di virus e altri programmi dannosi. </a></p> <p> </p> <h6> Passaggio 3. Ripristina le impostazioni di Windows Defender ai valori predefiniti. </h6> <p> Procedi e abilita la protezione in tempo reale in Windows Defender, utilizzando uno dei metodi seguenti: </p> <h4> Metodo 1. Attiva la protezione antivirus di Defender nel registro. </h4> <p> 1. Apri <strong> Editor del Registro di sistema </strong> : Fare quello: </p> <ul> <li> Premi contemporaneamente Windows <img src=\"images/image_thumb36-979.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. </li> <li> genere <strong> regedit </strong> &amp; stampa <strong> Accedere. </strong></li> </ul> <p><img src=\"images/image_thumb7-229.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2.. Passare alla seguente chiave nel riquadro di sinistra: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Windows Defender </strong></li> </ul> <p> 3. Nel riquadro di destra, fare doppio clic su <strong> Disattiva AntiSpyware </strong> REG_DWORD valore e modificare i dati del valore da 1 a <strong> 0. </strong></p> <p><img src=\"images/image_thumb-26-852.png\" alt=\"enable defender antivirus protection - registry\" loading=\"lazy\"></p> <p> </p> <p> 4. Fare clic su <strong> ok </strong> e <strong> vicino </strong> Editore del registro. <br> 5. <strong> Ricomincia </strong> il tuo PC. Normalmente dopo il riavvio, Windows Defender dovrebbe essere abilitato. * </p> <p> * Nota: se dopo aver riavviato il PC Windows Defender è ancora disabilitato, con lo stato &quot;La tua protezione da virus e minacce è gestita dalla tua organizzazione&quot;, procedi e modifica il <br> <strong> Inizio </strong> REG_DWORD valore da 4 a <strong> 2 </strong> alle seguenti chiavi di registro: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SecurityHealthService </li> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\WinDefend </li> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\WdNisSvc </li> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\MpsSvc </li> </ul> <p> </p> <h5> Metodo 2. Eliminare il <strong> Disattiva AntiSpyware </strong> Valore di registro dal prompt dei comandi. </h5> <p> 1. Apri <strong> Prompt dei comandi come amministratore </strong> . Fare quello: </p> <ul> <li> Nella casella di ricerca digita: <strong> prompt dei comandi </strong> o <strong> cmd </strong></li> <li> Fare clic con il tasto destro su <strong> cmd </strong> o <strong> Prompt dei comandi </strong> risultato e selezionare <strong> Esegui come amministratore. </strong></li> </ul> <p><img src=\"images/image_thumb-10-243.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. Nel prompt dei comandi digitare (Copia/Incolla) il seguente comando e premere <strong> Accedere: </strong></p> <ul> <li> REG DELETE &quot;HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows Defender&quot; /v DisableAntiSpyware </li> </ul> <p> 3. Quindi premere <strong> sì </strong> per confermare la tua decisione. </p> <p><img src=\"images/image_thumb-28-288.png\" alt=\"enable defender antivirus protection command\" loading=\"lazy\"></p> <p> </p> <p> 4. Chiudere il prompt dei comandi e <strong> ricomincia </strong> il tuo computer. </p> <p> </p> <h5> Metodo 3. Attiva la protezione in tempo reale di Windows Defender in Criteri di gruppo. </h5> <p> Se possiedi l&#39;edizione Windows 10 Professional, Enterprise o Education, procedi e abilita le protezioni Windows Defender Antivirus in Criteri di gruppo. Fare quello: </p> <p> 1. Premere contemporaneamente Windows <img src=\"images/image_thumb36-102.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo <strong> gpedit.msc </strong> &amp; Stampa <strong> Accedere. </strong></p> <p><img src=\"images/image_thumb-78-343.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Nel riquadro di sinistra, vai a: </p> <ul> <li><strong> Configurazione computer\\Modelli amministrativi\\Componenti di Windows\\Windows Defender Antivirus </strong></li> </ul> <p> 4. Nel riquadro di destra aprire il <strong> Disattiva Windows Defender Antivirus </strong> ambientazione. </p> <p><img src=\"images/image14_thumb-207.png\" alt=\"turn on defender antivirus protection- group policy\" loading=\"lazy\"></p> <p> </p> <p> 5. Impostare l&#39;impostazione dei criteri su <strong> Non configurato </strong> o <strong> Disabilitato </strong> per abilitare la protezione in tempo reale e fare clic <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-29-337.png\" alt=\"enable defender antivirus protection group policy\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Ricomincia </strong> il computer. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo problema. </p>"}