{"title":"FIX: HDMI No Sound to TV o HDMI non mostrato nei dispositivi di riproduzione (risolto).","content":"<p> Se hai collegato la TV al laptop utilizzando un cavo HDMI e non viene emesso alcun suono durante la riproduzione di un video o l&#39;HDMI non viene visualizzato come dispositivo di riproduzione, continua a leggere questo tutorial. </p> <p> Problema in dettaglio: su un laptop con Windows 10, il dispositivo di uscita digitale (HDMI) non è elencato come dispositivo di riproduzione e non viene emesso alcun suono quando è collegato alla TV con un cavo HDMI. </p> <p> Il problema &quot;Nessuna uscita audio da HDMI&quot; in Windows 10 può apparire per diversi motivi, quindi in questa guida troverai istruzioni dettagliate per risolvere il problema. </p> <h2> Come risolvere: nessuna uscita audio da HDMI e HDMI non visualizzata nei dispositivi di riproduzione in Windows 10 * </h2> <p> * Suggerimenti: prima di continuare con i passaggi seguenti: </p> <ul> <li><strong> Fare clic con il tasto destro </strong> al <strong> icona del suono </strong><img src=\"images/image_thumb-11-109.png\" alt=\"image\" loading=\"lazy\"> sulla barra delle applicazioni per <strong> Apri mixer volume </strong> e assicurarsi che il <strong> Dispositivo di uscita digitale </strong> non è disattivato. </li> <li> Assicurati che il cavo HDMI sia collegato correttamente sia sul laptop che sulla TV. </li> <li> Dopo aver collegato il cavo HDMI, <strong> ricomincia </strong> il tuo computer. </li> <li> Nella TV, imposta la porta HDMI corretta come dispositivo di ingresso video. </li> <li> Se possiedi un laptop, chiudi il coperchio o premi una volta il pulsante di accensione per mettere il laptop in sospensione. Quindi premere nuovamente il pulsante di accensione e controllare nuovamente l&#39;audio dall&#39;HDMI. </li> <li> Controlla se il problema persiste, con un altro cavo HDMI. </li> </ul> <p> </p> <h3> Passaggio 1. Imposta HDMI come dispositivo di riproduzione predefinito. </h3> <p> Il primo passo per risolvere i problemi di audio HDMI su Windows 10 consiste nell&#39;impostare HDMI come dispositivo audio predefinito. </p> <p> 1. Vai a Windows <strong> Pannello di controllo </strong> e apri <strong> Suono. </strong></p> <p><img src=\"images/image_thumb-14-686.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Assicurati che <strong> Output digitale </strong> (HDMI) è il <strong> Predefinito </strong> dispositivo di riproduzione, altrimenti selezionare il <strong> Output digitale </strong> dispositivo e fare clic su <strong> Imposta default </strong> pulsante. Al termine, riproduci un video per testare l&#39;audio HDMI e, se il problema persiste, vai al passaggio successivo. * </p> <p><img src=\"images/image_thumb-43-106.png\" alt=\"FIX: HDMI No Sound Output \" loading=\"lazy\"></p> <p> </p> <p> * Note: Prova quanto segue, secondo il tuo caso: </p> <p> 1. Se il <strong> Output digitale </strong> il dispositivo è <strong> Disabilitato </strong> , fai clic destro su di esso e fai clic su <strong> Abilitare </strong> . Quindi evidenzialo e premi <strong> Imposta default </strong> . </p> <p><img src=\"images/image_thumb-44-233.png\" alt=\"FIX: HDMI Not Listed in Playback devices \" loading=\"lazy\"></p> <p> 2. Se il dispositivo di uscita digitale non viene visualizzato come dispositivo di riproduzione: </p> <blockquote><p> un. Fare clic con il pulsante destro del mouse su uno spazio vuoto e assicurarsi che entrambi i <strong> Mostra dispositivi disabilitati </strong> e il <strong> Mostra dispositivi disconnessi </strong> le opzioni sono selezionate (selezionate). Se una delle opzioni di cui sopra non è selezionata, fai clic su di essa per selezionarla. </p></blockquote> <p><img src=\"images/image_thumb-45-410.png\" alt=\"Enable HDMI DIgital Output\" loading=\"lazy\"></p> <blockquote><p> b. Quindi fare clic con il pulsante destro del mouse sul dispositivo di uscita digitale e scegliere <strong> Abilitare. <br> c. </strong> Al termine, imposta come <strong> predefinito </strong> il <strong> Output digitale </strong> dispositivo. </p> </blockquote> <h3><br clear=\"all\"> Passaggio 2. Ripristina il driver della scheda audio. </h3> <p> In alcuni casi, il problema &quot;HDMI no sound to TV&quot; potrebbe apparire dopo un aggiornamento automatico del driver. Quindi, procedi e ripristina il driver audio. </p> <p> 1. Apri <strong> Gestore dispositivi </strong> . Fare quello: </p> <blockquote><p> 1. Premi Finestre <img src=\"images/image_thumb8_thumb_thumb-781.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Nella casella &quot;Apri&quot;, digita: <strong> devmgmt.msc </strong> &amp; clic <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-5-389.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Espandere </strong> il <strong> Controller audio, video e giochi. <br> 3. Fare clic con il tasto destro </strong> sul <strong> Dispositivo audio ad alta definizione </strong> e seleziona <strong> Proprietà. </strong></p> <p><img src=\"images/image_thumb-17-970.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. Nella scheda Driver, fare clic su <strong> Ripristina driver </strong> pulsante. <strong> * </strong></p> <p> * Nota: se il pulsante Ripristina driver non è attivo, andare al passaggio successivo. </p> <p><img src=\"images/image_thumb-18-921.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> 5. Selezionare un motivo per il rollback del pacchetto driver e fare clic su <strong> Sì. </strong></p> <p><img src=\"images/image_thumb-19-748.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Al termine del ripristino del driver, <strong> ricomincia </strong> il tuo computer. <br> 5. Dopo il riavvio, procedere e testare l&#39;audio dall&#39;HDMI. Se ancora non riesci a sentire l&#39;audio sulla TV, vai al passaggio successivo. </p> <h3> Passaggio 3. Cambia il driver della scheda audio. </h3> <p> L&#39;assenza di audio è spesso dovuta al driver della scheda audio sbagliato. Per risolvere, questo problema: </p> <p> 1. Apri <strong> Gestore dispositivi. </strong><br> 2. <strong> Espandere </strong> il <strong> Controller audio, video e giochi. <br> </strong> 3. <strong> Fare clic con il tasto destro </strong> a <strong> audio ad alta definizione Realtek </strong> dispositivo e selezionare <strong> Aggiorna driver. <br> </strong></p> <p><img src=\"images/image_thumb-6-937.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Seleziona <strong> Sfoglia il mio computer per i driver. </strong></p> <p><img src=\"images/image_thumb-7-874.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Seleziona <strong> Fammi scegliere da un elenco di driver disponibili sul mio computer </strong> . </p> <p><img src=\"images/image_thumb-8-498.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. Nella schermata successiva, seleziona <strong> Dispositivo audio ad alta definizione </strong> e clicca <strong> Il prossimo. </strong></p> <p><img src=\"images/image_thumb-20-756.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/07/image-10.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 8. Al termine dell&#39;installazione del driver, <strong> ricomincia </strong> il tuo computer. <br> 9. Dopo il riavvio, procedere e testare l&#39;audio dagli altoparlanti del laptop. </p> <h3> Passaggio 4. Disinstalla e reinstalla il driver della scheda audio. </h3> <p> 1. Apri <strong> Gestore dispositivi. </strong><br> 2. <strong> Espandere </strong> il <strong> Controller audio, video e giochi. <br> </strong> 3. <strong> Fare clic con il tasto destro </strong> a <strong> Audio ad alta definizione </strong> dispositivo e selezionare <strong> Disinstalla dispositivo. </strong></p> <p><img src=\"images/image_thumb-21-678.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. Dopo la disinstallazione, <strong> ricomincia </strong> computer e lasciare che Windows installi automaticamente i driver audio. Se ciò non accade, vai a <strong> impostazioni </strong> &gt; <strong> Aggiornamento e sicurezza </strong> e forza Windows a <strong> Controlla gli aggiornamenti. </strong></p> <p> </p> <h3> Passaggio 5. Disinstallare e reinstallare la scheda video. </h3> <p> 1. Apri <strong> Gestore dispositivi. <br> </strong> 2. <strong> Espandere </strong> il <strong> Adattatori per display. <br> </strong> 3. <strong> Fare clic con il pulsante destro del mouse </strong> sulla scheda video installata e selezionare <strong> Disinstalla dispositivo. </strong></p> <p><img src=\"images/image_thumb-46-871.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. Dopo la disinstallazione, <strong> ricomincia </strong> computer e consentire a Windows di installare automaticamente i driver dello schermo. Se ciò non accade, o se il problema persiste, accedi al sito di supporto del produttore del tuo laptop e scarica i driver di visualizzazione più recenti in base al modello del tuo laptop. </p> <p> È tutto gente! Quale metodo ha funzionato per te? Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}