{"title":"FIX: Microsoft Office Installer ha riscontrato un problema a causa dei programmi di Office basati sul programma di installazione Click to Run (risolto).","content":"<p> Questo tutorial contiene le istruzioni per risolvere l&#39;errore di installazione di Office &quot;Abbiamo riscontrato un problema! Siamo spiacenti, il programma di installazione di Microsoft Office ha riscontrato un problema perché sul tuo computer sono installati questi programmi di installazione di Office a portata di clic: Microsoft Office Professional&quot;. </p> <p> L&#39;errore sopra riportato viene visualizzato comunemente quando si tenta di installare Visio, Project, Skype for Business o OneDrive for Business, mentre si dispone di Microsoft Office 2019, 2016 o 2013 Professional Plus o Standard, già installato sul computer </p> <p><img src=\"images/image_thumb-12-962.png\" alt=\"FIX: Microsoft Office Installer encountered a problem because of Click to Run installer based Office programs \" loading=\"lazy\"></p> <p> L&#39;errore &quot;Siamo spiacenti, il programma di installazione a portata di clic di Office ha riscontrato un problema perché sul computer sono installati questi programmi di Office basati su Windows Installer&quot;, viene visualizzato perché le versioni più recenti di Office (2013, 2016, 2019, 365) utilizzano la tecnologia &quot;Click-to-Run&quot; per l&#39;installazione, mentre le edizioni a volume di queste versioni utilizzano la &quot;tecnologia Windows Installer (MSI)&quot;. Ciò significa che puoi avere un solo tipo di installatore installato alla volta. </p> <h4> Come risolvere: il programma di installazione di Microsoft Office ha riscontrato un problema a causa dei programmi di Office basati sul programma di installazione di Click to Run. </h4> <h6> Metodo 1. Disinstalla Fare clic per eseguire i programmi di installazione. </h6> <p> 1. Premere <strong> finestre </strong> <img src=\"images/image_thumb41-136.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo <strong> installatore </strong> e premi <strong> accedere </strong> per accedere alla cartella &quot;C:\\Windows\\Installer&quot;. </p> <p><img src=\"images/image_thumb5_thumb-550.png\" alt=\"image_thumb[5]\" loading=\"lazy\"></p> <p> 3. Dal <strong> Visualizza </strong> menu, fare clic su <strong> Aggiungi colonne </strong> e quindi fare clic su <strong> Scegli colonne </strong></p> <p><img src=\"images/image_thumb9_thumb-870.png\" alt=\"image_thumb[9]\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Dai un&#39;occhiata </strong> il <strong> Soggetto </strong> e clicca <strong> ok </strong> . </p> <p><img src=\"images/image_thumb13_thumb-850.png\" alt=\"image_thumb[13]\" loading=\"lazy\"></p> <p><a href=\"file:///C:/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/supfiles10B8394/image%5B20%5D.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 5. Ordina i risultati per Oggetto e poi scorri verso il basso fino a individuare il &quot; <em> Componente di localizzazione a portata di clic di Office 16&quot; </em> . </p> <p><img src=\"images/image_thumb-16-433.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Quando lo trovi, fai clic destro su di esso e scegli <strong> Disinstalla </strong> . * </p> <p> * Nota: se usi vedi più di un &quot; <em> Componenti di localizzazione a portata di clic di Office 16&quot; , </em> quindi procedere e disinstallarli tutti. </p> <p><img src=\"images/image_thumb-17-609.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7. Al termine della disinstallazione, procedere con l&#39;installazione di Microsoft Office nuovamente. * </p> <p> * Nota: se continui a ricevere lo stesso errore, procedi e disinstalla tutti i &quot;Componenti di Office 16 a portata di clic&quot; e prova a configurare nuovamente Office. </p> <h6></h6> <h6> Metodo 2. Scarica e installa la versione finale del prodotto Microsoft Office. </h6> <p> 1. Vai a <a href=\"https://www.heidoc.net/joomla/technology-science/microsoft/67-microsoft-windows-iso-download-tool\" target=\"_blank\" rel=\"nofollow noopener\"> HeiDoc.net </a> e scarica il <strong><a href=\"https://www.heidoc.net/php/Windows-ISO-Downloader.exe\" target=\"_blank\" rel=\"nofollow noopener\"> Strumento per scaricare ISO di Windows </a></strong> . <br> 2. Fare doppio clic per eseguire il file scaricato &quot;Windows-ISO-Downloader.exe&quot;. <br> 3. Nel riquadro di destra selezionare <strong> Ufficio </strong> scheda e quindi selezionare il prodotto Office Versione Edizione e lingua che si desidera installare. <br> 4. Al termine, fare clic su <strong> Scarica. </strong></p> <p><img src=\"images/image_thumb-13-868.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Al termine del download, fare clic con il pulsante destro del mouse sul file immagine scaricato e fare clic su <strong> Montare. </strong></p> <p><img src=\"images/image_thumb-18-609.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Fare doppio clic su <strong> Setup.exe </strong> per installare il prodotto Office. </p> <p><img src=\"images/image_thumb-15-851.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Metodo 3. Completare la disinstallazione della versione installata di Office. </h6> <p> 1. Scarica il <a href=\"http://go.microsoft.com/?linkid=9815935\" target=\"_blank\" rel=\"nofollow noopener\"> Disinstalla Microsoft Office Fix </a> strumento per rimuovere automaticamente la versione di Windows Installer di Office Office 365,  Office 2019, Office 2016 o Office 2013. </p> <p> 2. Esegui &quot;Disinstalla Microsoft Office Fix&quot; e premi <strong> Il prossimo </strong> alla prima schermata. </p> <p><img src=\"images/image_thumb-19-947.png\" alt=\"office uninstall tool\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Lascia che il processo risolva i problemi con Office Disinstalla e rimuovi il software Office dal tuo computer. </p> <p><img src=\"images/image_thumb-20-436.png\" alt=\"cannot uninstall office\" loading=\"lazy\"></p> <p> 4. Al termine della disinstallazione, riavviare il computer e provare a installare nuovamente Microsoft Office. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo. </p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-22.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p>"}