{"title":"FIX: Il server non è accessibile. Potresti non avere l&#39;autorizzazione per utilizzare questa risorsa di rete. L&#39;handle non è valido. (Risolto)","content":"<p> Questo tutorial contiene le istruzioni per correggere il seguente errore quando si tenta di accedere a una cartella condivisa sulla rete: &quot;Il server non è accessibile. Potresti non avere l&#39;autorizzazione per utilizzare questa risorsa di rete. Contatta l&#39;amministratore di questo server per scoprire se hai accesso autorizzazioni. L&#39;handle non è valido.&quot; </p> <p><img src=\"images/image_thumb-5-437.png\" alt=\"You might not have permission to use this network resource\" loading=\"lazy\"></p> <p> </p> <h2> Come FIX: Impossibile accedere alla cartella condivisa. Potresti non avere l&#39;autorizzazione per utilizzare questa risorsa di rete. L&#39;handle non è valido. </h2> <p> Normalmente, il problema di connessione per la condivisione di file &quot;Potresti non avere l&#39;autorizzazione per utilizzare questa risorsa di rete&quot; viene visualizzato quando un utente tenta di accedere a una cartella condivisa di rete, senza disporre delle autorizzazioni necessarie. In questo caso e per risolvere il problema, è necessario assicurarsi che l&#39;utente disponga delle autorizzazioni di accesso appropriate sulla cartella condivisa. </p> <p> Tuttavia, se sai che le autorizzazioni dell&#39;utente sulla cartella condivisa sono corrette e il problema di connessione &quot;Potrebbe non avere l&#39;autorizzazione per utilizzare questa risorsa di rete&quot; è apparso all&#39;improvviso e senza una ragione ovvia, il problema è probabilmente dovuto all&#39;installazione di Aggiornare. In questo caso, continua a leggere di seguito per risolvere il problema. </p> <p> * Nota: se si verifica l&#39;errore di condivisione a metà gennaio 2019, il colpevole è il seguente aggiornamento di sicurezza di Windows: <a href=\"https://support.microsoft.com/el-gr/help/4480970/windows-7-update-kb4480970\" target=\"_blank\" rel=\"nofollow noopener\"> 8 gennaio 2019 - KB4480970 (aggiornamento cumulativo mensile) </a> . </p> <h6> Metodo 1. Disinstallare l&#39;ultimo aggiornamento di Windows. </h6> <p> Sulla macchina con la cartella condivisa: </p> <p> 1. Fare clic con il pulsante destro del mouse sull&#39;icona &quot;Risorse del computer&quot; e selezionare <strong> Proprietà </strong> . <br> 2. Fare clic su <strong> aggiornamento Windows </strong> . </p> <p><img src=\"images/image_thumb-6-686.png\" alt=\"fix Network Shared Folder is Not Accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. Fare clic su <strong> Aggiornamenti installati </strong> . </p> <p><img src=\"images/image_thumb-7-999.png\" alt=\"fix cannot access shared folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Ordina gli aggiornamenti per data di installazione, facendo clic su <strong> Installato su. </strong></p> <p><img src=\"images/image_thumb-8-158.png\" alt=\"uninstall windows update\" loading=\"lazy\"></p> <p> </p> <p> 5. Evidenzia l&#39;ultimo aggiornamento installato per Windows e fai clic su <strong> Disinstalla. </strong> * </p> <p> * per esempio. Se riscontri l&#39;errore di condivisione a metà gennaio 2019, procedi e disinstalla &quot;Aggiornamento di sicurezza per Microsoft Windows KB4480970&quot;. </p> <p><img src=\"images/image_thumb-9-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Al termine dell&#39;installazione, <strong> ricomincia </strong> il computer. <br> 7. Dopo il riavvio, riprovare ad accedere alla cartella condivisa dal computer client. Quindi applica le azioni suggerite in base al tuo caso: </p> <ul> <li><strong> Caso A: </strong> Se il problema persiste, procedere con la disinstallazione di tutti gli ultimi aggiornamenti installati o continuare con <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> metodo 2 </a> sotto. </li> <li><strong> Caso B: </strong> Se il problema viene risolto, impedire l&#39;installazione dell&#39;aggiornamento rimosso in futuro. Fare quello: </li> </ul> <blockquote><p> 1. Passare a Windows Update e <strong> Controlla gli aggiornamenti </strong> . <br> 2. Fare clic su <strong> Aggiornamenti importanti </strong> . </p></blockquote> <p><img src=\"images/image_thumb-22-393.png\" alt=\"view important updates\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 3. Fare clic con il pulsante destro del mouse sull&#39;aggiornamento problematico e fare clic su <strong> Nascondi aggiornamento </strong> . <br> 4. Infine clicca <strong> ok </strong> e quindi chiudi Windows Update. </p></blockquote> <p><img src=\"images/image_thumb-23-795.png\" alt=\"hide update windows 7\" loading=\"lazy\"></p> <h6> Metodo 2. Ripristina il tuo PC a uno stato di lavoro precedente. </h6> <p> Sulla macchina con la cartella condivisa: </p> <p> 1. Premi Finestre <img src=\"images/image_thumb8_thumb-632.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo <strong> rstrui </strong> &amp; clic <strong> ok </strong> per avviare Ripristino configurazione di sistema. </p> <p><img src=\"images/rstui-1-300x148-611.png\" alt=\"rstui\" loading=\"lazy\"></p> <p> </p> <p> 3. Fare clic su <strong> Il prossimo </strong> alla prima schermata. <br> 4. Scegliere uno stato di lavoro precedente (data/ora) e fare clic su <strong> Il prossimo </strong> per avviare il processo di ripristino. </p> <p><img src=\"images/image_thumb-50-355.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Dopo il ripristino del sistema, riprovare ad accedere alla cartella condivisa dal computer client. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo problema. </p>"}