{"title":"FIX: nomi utente duplicati nella schermata di accesso dopo l&#39;aggiornamento di Windows 10.","content":"<p> Questo tutorial contiene diversi metodi per risolvere il problema dei nomi utente duplicati nella schermata di accesso dopo l&#39;aggiornamento di Windows 10. Il problema dei &quot;nomi utente duplicati nella schermata di accesso&quot; viene segnalato da molti utenti e causato dopo l&#39;installazione degli aggiornamenti su Windows 10. </p> <p><img src=\"images/image_thumb-44-494.png\" alt=\"FIX: Duplicate User Names in Sign-in Screen Windows 10\" loading=\"lazy\"></p> <p> Problema nei dettagli: dopo aver rinominato il computer o dopo aver installato gli aggiornamenti in Windows 10, il sistema non accede automaticamente al tuo account utente con l&#39;errore &quot;il nome utente o la password non sono corretti. Riprova&quot; e allo stesso tempo viene visualizzato il tuo nome utente due volte nella schermata di accesso. </p> <h4> Come risolvere: la schermata di accesso di Windows 10 mostra lo stesso utente due volte. </h4> <h6> Metodo 1. Rimuovere l&#39;account duplicato dalle opzioni dell&#39;account utente. </h6> <p> Il primo metodo per rimuovere i nomi utente duplicati dalla schermata di accesso è eliminare l&#39;account duplicato dal PC. </p> <p> 1. Premi Finestre <img src=\"images/image_thumb8_thumb_thumb-923.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Nella casella &quot;Apri&quot;, digita: <strong> controllare le password utente2 </strong> &amp; clic <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-29-663.png\" alt=\"control userpasswords2 \" loading=\"lazy\"></p> <p> 3. Nelle opzioni Account utente, esegui le seguenti azioni in base al tuo caso: </p> <ul> <li><strong> Caso A. </strong> Se vedi due account con lo stesso nome utente: </li> </ul> <blockquote><p> un. Seleziona l&#39;account secondario e fai clic su <strong> Rimuovere </strong> . <br> b. Clic <strong> ok </strong> e <strong> ricomincia </strong> il tuo PC. <br> c. Se dopo il riavvio vedi ancora il tuo nome utente due volte nella schermata di accesso, continua con il Metodo 2. </p></blockquote> <p><img src=\"images/image_thumb-37-605.png\" alt=\"User Accounts Options\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Caso B. </strong> Se vedi un solo account: </li> </ul> <blockquote><p> un. Seleziona l&#39;account e fai clic su <strong> Proprietà </strong> . <br> b. Copia il Nome completo e incollalo nel campo Nome utente, in modo che corrisponda. * <br> c. Clic <strong> ok </strong> e <strong> ricomincia </strong> il tuo PC. </p></blockquote> <p> * Nota: se il nome utente e il nome completo corrispondono già, passare al metodo 2. </p> <p><img src=\"images/image_thumb-38-262.png\" alt=\"Remove Duplicate User Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Metodo 2. Disabilitare il requisito della password all&#39;accesso. </h6> <p> 1. Segui i passaggi 1 e 2 del metodo precedente per aprire le opzioni &quot;Account utente&quot;. <br> 2. <strong> Deseleziona </strong> il <strong> L&#39;utente deve inserire un nome utente e una password per utilizzare questo computer </strong> e clicca <strong> Applicare </strong></p> <p><img src=\"images/image_thumb-42-373.png\" alt=\"User must enter a user name and password to use this computer \" loading=\"lazy\"></p> <p> </p> <p> 3. Digita la tua password (due volte) e fai clic su <strong> ok </strong> due volte per chiudere tutte le finestre. </p> <p><img src=\"images/image_thumb-43-970.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. <strong> Riavvia </strong> il tuo computer. Se il tuo nome utente viene visualizzato di nuovo due volte, passa al metodo successivo. </p> <h6></h6> <h6> Metodo 3. Modificare le opzioni di accesso. </h6> <p> </p> <p> 1. Dall&#39;inizio <img src=\"images/image_thumb-39-183.png\" alt=\"image\" loading=\"lazy\"> menu, apri <strong> impostazioni </strong> <img src=\"images/image_thumb-50-520.png\" alt=\"image\" loading=\"lazy\"> e quindi fare clic su <strong> Conti </strong> . </p> <p><img src=\"images/image_thumb-43-892.png\" alt=\"How to Add a New User in Windows 10, 8.1.\" loading=\"lazy\"></p> <p> </p> <p> 2. Seleziona <strong> Opzioni di accesso </strong> nel riquadro di sinistra, e <strong> Spegni </strong> il <strong> Usa le mie informazioni di accesso per completare automaticamente la configurazione del mio dispositivo e riaprire le mie app dopo l&#39;aggiornamento o il riavvio </strong> . </p> <p><img src=\"images/image_thumb-40-207.png\" alt=\"Modify Sign in Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Ricomincia </strong> il tuo PC. </p> <p> </p> <h6> Metodo 4. Passare a Account locale. </h6> <p> Il metodo finale per risolvere il problema dei &quot;nomi utente duplicati&quot; consiste nell&#39;utilizzare un account locale per accedere a Windows 10. Per farlo: </p> <p> 1. Dall&#39;inizio <img src=\"images/image_thumb-41-454.png\" alt=\"image\" loading=\"lazy\"> menu, apri <strong> impostazioni </strong> <img src=\"images/image_thumb-50-790.png\" alt=\"image\" loading=\"lazy\"> e quindi fare clic su <strong> Conti </strong> . <br> 2. Fare clic su <strong> E-mail e account </strong> nel riquadro di sinistra. <br> 3. Fare clic successivo <strong> Accedi invece con un account locale. </strong></p> <p> </p> <p><img src=\"images/image_thumb-37-653.png\" alt=\"sign-in with a local account instead windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Inserisci la password dell&#39;account Microsoft e fai clic su <strong> Il prossimo </strong> . <br> 5. Quindi digita il nome utente, la password (opzionale) per il nuovo account locale e fai clic su <strong> Il prossimo </strong> . <br> 6. Dopo il riavvio, digitare la password per accedere con il nuovo account locale. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}