{"title":"FIX: 0x800707e7, 0x000007E7 errori nell&#39;aggiornamento di Windows 10.","content":"<p> Il codice di errore di Windows 10 Update &quot;0x800707E7 – 0x3000D: l&#39;installazione non è riuscita nella fase FIRST_BOOT con un errore durante l&#39;operazione MIGRATE_DATA&quot;, di solito si verifica quando Windows non riesce a migrare un profilo utente. </p> <p> L&#39;errore 0x800707E7 in Windows 10 Update, comunemente riscontrato su computer con schede grafiche NVIDIA, che utilizzano il servizio di aggiornamento NVIDIA per aggiornare i driver o altro software NVIDIA. In particolare, sui sistemi con scheda NVIDIA, quando si installa il software NVIDIA, viene creato automaticamente un nuovo utente in Windows, denominato &quot;UpdatusUser&quot; che viene utilizzato dal servizio NVIDIA Update. </p> <p> In questa guida troverai istruzioni dettagliate per risolvere i seguenti errori in Windows 10 Update: </p> <ul> <li> <ul> <li> 0x800707E7 – 0x3000D: L&#39;installazione non è riuscita nella fase FIRST_BOOT con un errore durante l&#39;operazione MIGRATE_DATA </li> <li> 0x000007E7: ERROR_PROFILE_DOES_NOT_MATCH_DEVICE, il profilo specificato è destinato a un dispositivo di tipo diverso rispetto al dispositivo specificato. </li> </ul> </li> </ul> <h2> Come risolvere gli errori di aggiornamento di Windows 10 0x800707e7, 0x000007E7. </h2> <h3> Passaggio 1. Disinstallare il software NVIDIA dalla macchina. </h3> <p> Se possiedi una scheda grafica NVIDIA, vai a <strong> Pannello di controllo </strong> -&gt; <strong> Programmi e caratteristiche </strong> e <strong> Disinstalla </strong> tutti <strong> Software NVIDIA </strong> .* </p> <p> * Nota: questo passaggio si applica solo ai sistemi con schede NVIDIA. Se non possiedi una scheda grafica NVIDIA, vai al passaggio 2. </p> <p><strong> Per disinstallare il software NVIDIA. </strong></p> <p> 1. Naviga in <strong> Programmi e caratteristiche </strong> nel Pannello di controllo. Fare quello: </p> <blockquote><p> 1. Premere contemporaneamente Windows <img src=\"images/image_thumb36-131.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo: <strong> appwiz.cpl </strong> e clicca <strong> ok </strong> . </p></blockquote> <p><img src=\"images/image_thumb-24-479.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 2. Seleziona uno per uno tutti i software NVIDIA e fai clic su <strong> Disinstalla. </strong></p> <p><img src=\"images/image_thumb-67-843.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Segui le istruzioni sullo schermo per rimuovere il software NVIDIA dal tuo computer. <br> 4. Al termine della disinstallazione <strong> ricomincia </strong> il tuo PC e vai al passaggio successivo. </p> <h3> Passaggio 2. Elimina &quot;UpdatusUser&quot; e qualsiasi profilo utente sconosciuto. </h3> <p> 1. Fai clic con il pulsante destro del mouse sull&#39;icona del tuo computer (Questo PC) in Esplora risorse e scegli <strong> Proprietà </strong> . <br> 2. Fare clic su <strong> Impostazioni avanzate di sistema </strong> . <br> 3. A <strong> Profili utente </strong> , clicca <strong> impostazioni </strong> . </p> <p><img src=\"images/image_thumb-68-812.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Selezionare e <strong> Elimina </strong> il <strong> Aggiorna utente </strong> profilo o qualsiasi altro profilo a te sconosciuto ( <strong> tranne </strong> il tuo profilo e il <strong> Profilo base </strong> ). </p> <p><img src=\"images/image_thumb-69-946.png\" alt=\"Delete User Profile\" loading=\"lazy\"></p> <p> 4. Al termine, fare clic su <strong> ok </strong> e vai al passaggio successivo. </p> <h3></h3> <h3> Passaggio 3. Rimuovere i profili utente sconosciuti nel registro. </h3> <p> 1. Apri l&#39;editor del registro: per farlo: </p> <blockquote><p> 1. Premi Finestre <img src=\"images/image_thumb41-520.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo <strong> regedit </strong> e premi <strong> accedere </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-235.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Nell&#39;Editor del Registro di sistema, accedere alla seguente chiave nel riquadro di sinistra: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\ProfileList </li> </ul> <p> 4a. Ora espandi il <strong> Elenco profili </strong> tasto e fare clic su ciascun profilo &quot;S-1-5-21-xxxx&quot; e vedere se qualcuno di essi ha il valore &quot; <strong> C:\\Users\\UpdatusUser&quot; </strong> a <strong> ProfileImagePath. </strong></p> <p><img src=\"images/image_thumb-70-754.png\" alt=\"FIX: 0x800707e7 or 0x000007E7 errors in Windows 10 Update.\" loading=\"lazy\"></p> <p> 4b. Se trovi il &quot; <strong> C:\\Users\\UpdatusUser&quot; </strong> valore <strong> </strong> su un profilo, quindi selezionare il profilo nel riquadro di sinistra e <strong> Elimina </strong> esso. </p> <p><img src=\"images/image_thumb-71-506.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5.  Infine, vedere il nome completo di ciascuna chiave di profilo &quot;S-1-5-21-xxxx&quot; (sotto la &quot;chiave ProfileList&quot;) e <strong> Elimina </strong> qualsiasi chiave di profilo che ha un <strong> .bak </strong> estensione alla fine del nome. </p> <p><img src=\"images/image_thumb-72-738.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Al termine, chiudere l&#39;editor del registro e <strong> ricomincia </strong> il tuo PC. <br> 7. Dopo il riavvio: </p> <blockquote> <p> un. Navigare verso <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Sito di download di Windows 10 </a> e fai clic su <strong> Aggiorna ora </strong> pulsante. </p> <p><img src=\"images/image_thumb-65-120.png\" alt=\"Download Windows 10 21H1 \" loading=\"lazy\"></p> <p> b. Salva il file &quot;Windows10Upgrade9252.exe&quot; sul desktop. <br> c. Fare doppio clic sul file scaricato per aprire il <strong> Assistente aggiornamento Windows </strong> . <br> d. Clic <strong> Aggiorna ora </strong> per avviare l&#39;aggiornamento. </p></blockquote> <p> 8. Windows Update dovrebbe ora essere completato senza problemi e senza errori 0x800707e7 (o 0x000007E7). <br> 9. Infine, dopo aver aggiornato Windows 10 e se possiedi una scheda grafica NVIDIA, procedi e reinstalla il software NVIDIA. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo problema. </p>"}