{"title":"FIX: Lexmark stampa lenta di più pagine su Windows 10 (risolto)","content":"<p> Su un PC Windows 10, con una stampante Lexmark installata, la stampa è lenta quando si stampano più pagine. Il problema della stampa lenta di Lexmark in Windows 10 è solitamente dovuto al driver della stampante errato o alle impostazioni della stampante errate (Preferenze). Per risolvere il problema, continua a leggere di seguito. </p> <p><img src=\"images/image_thumb-29-115.png\" alt=\"FIX: Lexmark Slow Printing in Multiple Pages on Windows 10 \" loading=\"lazy\"></p> <p> Problema Lexmark Slow Print in dettaglio: In Windows 10, la stampante Lexmark stampa rapidamente quando si stampa una singola pagina, ma quando si desidera stampare più pagine, la stampa è lenta perché il processo di stampa impiega troppo tempo per avviarsi e quindi la stampante ne stampa pagina alla volta ogni 1-2 minuti. </p> <p> Questo tutorial contiene le istruzioni per risolvere il problema di stampa lenta di più pagine di Lexmark, in Windows 10. </p> <ul> <li><strong> Articolo correlato: </strong> <a href=\"https://www.repairwin.com/fix-slow-pdf-printing-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> FIX: Stampa PDF lenta in Windows 10 </a></li> </ul> <h4> Come risolvere: stampa lenta di più pagine nella stampante Lexmark su Windows 10. </h4> <h6> Metodo 1. Modificare le impostazioni della stampante. </h6> <p> 1. Vai a <strong> Pannello di controllo </strong> -&gt; <strong> Strumenti e stampanti. </strong><br> 2. Fare clic con il pulsante destro del mouse sulla stampante e selezionare <strong> Proprietà. </strong></p> <p><img src=\"images/image_thumb-30-253.png\" alt=\"Printer Properties\" loading=\"lazy\"></p> <p> 3. Nella scheda &quot;Generale&quot;, <strong> fare clic su Modifica proprietà. </strong></p> <p><img src=\"images/image_thumb-31-900.png\" alt=\"Change Printer Properties\" loading=\"lazy\"></p> <p> 4. In Preferenze stampa Lexmark, impostare il <strong> Tipo di carta </strong> per <strong> pianura </strong> e clicca <strong> OK. * </strong></p> <p> * Nota: altre impostazioni che possono essere applicate alla stampante per migliorare la velocità di stampa: </p> <ul> <li><strong> Risoluzione di stampa </strong><strong> : </strong> 600 dpi rallenterà la stampante. </li> <li><strong> Modalità silenziosa </strong><strong> : </strong> spento </li> </ul> <p><img src=\"images/image_thumb-32-858.png\" alt=\"FIX Slow Lexmark Printing Lexmark - Windows 10\" loading=\"lazy\"></p> <p> 5. Ora, fai clic su <strong> Applicare </strong> e <strong> ok </strong> nella finestra &quot;Proprietà stampante&quot; per applicare la modifica. <br> 6. Aprire un documento con più pagine e verificare se il problema è stato risolto. In caso contrario, continuare con il metodo-2 di seguito. </p> <h6> Metodo 2. Modificare il driver della stampante. </h6> <p> 1. Vai a <strong> Pannello di controllo </strong> -&gt; <strong> Strumenti e stampanti. </strong><br> 2. Fare clic con il pulsante destro del mouse sulla stampante e selezionare <strong> Rimuovi dispositivo. </strong></p> <p><img src=\"images/image_thumb-33-755.png\" alt=\"Uninstall Printer Windows 10\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 2. Dopo la rimozione della stampante, accedere a <strong> Programmi e caratteristiche </strong> nel Pannello di controllo e <strong> disinstallare </strong> il <strong> Software Lexmark </strong> (di qualsiasi). </p> <p> 3. Vai a <a href=\"https://www.lexmark.com/en_us/support/download-search.html\" target=\"_blank\" rel=\"nofollow noopener\"> Driver e download Lexmark </a> sito e cercare i driver disponibili per il modello della stampante e il sistema operativo. <br> 4. Dall&#39;elenco dei driver disponibili, scaricare e installare uno dei seguenti driver: * </p> <ul> <li> <p> Driver di stampa universale. </p> </li> <li> <p> Driver di stampa per emulazione PCL5e universale. </p> </li> <li> <p> Driver di stampa per emulazione PostScript 3 universale. </p> </li> </ul> <p> * Nota: ti suggerisco di provare i driver di stampa nell&#39;ordine sopra elencato. </p> <p> 5. Al termine dell&#39;installazione del driver della stampante, <strong> ricomincia </strong> il tuo PC. <br> 6. Dopo il riavvio, provare a stampare un documento lungo. Il problema della stampa lenta dovrebbe essere risolto. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo problema. </p>"}