{"title":"FIX: Debugger Just-In-Time Si è verificata un&#39;eccezione win32 non gestita in Outlook.exe o in un altro programma. (Risolto)","content":"<p> In questo tutorial troverai le istruzioni per interrompere la visualizzazione della finestra di dialogo Just-In-Time Debugger. La finestra di dialogo &quot;Debugger just-in-time: si è verificata un&#39;eccezione win32 non gestita in Outlook.exe&quot; (o in qualsiasi altro programma) viene visualizzata perché l&#39;applicazione segnalata nella finestra di dialogo non può essere avviata. </p> <p><img src=\"images/image_thumb-7-733.png\" alt=\"FIX: Just-In-Time Debugger An unhandled win32 exception occurred in Outlook.exe, or in another program\" loading=\"lazy\"></p> <p> La finestra di dialogo &quot;Scegli debugger just-in-time&quot; offre la possibilità di avviare Visual Studio per eseguire il debug dell&#39;errore. Tuttavia, se Visual Studio non è installato o non è in grado di eseguire il debug dell&#39;errore, l&#39;applicazione segnalata si arresta in modo anomalo e si chiude. </p> <p> Se vuoi evitare che appaia la finestra di dialogo &quot;Scegli il debugger just-in-time&quot;, devi disabilitare il debugger just-in-time, seguendo le istruzioni di seguito. </p> <h4> Come fermare il debugger just-in-time. * </h4> <p> * Nota: se all&#39;avvio di Outlook viene visualizzata la finestra di dialogo &quot;Debugger just-in-time – Si è verificata un&#39;eccezione win32 non gestita…&quot;, quindi, prima di procedere con i metodi seguenti, applicare le seguenti azioni: </p> <blockquote><p> 1. <a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Ripara il file di dati PST di Outlook </a> e quindi apri Outlook. </p> <p> 2. <a href=\"https://www.repairwin.com/how-to-repair-office-2016-2013-2010-or-2007/\" target=\"_blank\" rel=\"nofollow noopener\"> Riparare l&#39;installazione di Office. </a></p></blockquote> <p> </p> <h6> Metodo 1. Modificare la prevenzione dell&#39;esecuzione dei dati (DEP) alle impostazioni predefinite. </h6> <p> 1. Fare clic con il tasto destro su <strong> Il mio PC </strong> e seleziona <strong> Proprietà </strong> . <br> 2. Fare clic su <strong> Impostazioni avanzate di sistema </strong> sulla sinistra. </p> <p><img src=\"images/image_thumb-14-901.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Nella scheda &quot;Avanzate&quot; fare clic su <strong> impostazioni </strong> nella sezione &quot;Prestazioni&quot;. </p> <p><img src=\"images/image_thumb-15-391.png\" alt=\"fix High CPU and DISK Usage Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. In &quot;Opzioni prestazioni&quot; seleziona <strong> prevenzione di esecuzione dei dati </strong> scheda. <br> 5. Scegli <strong> Attiva DEP per Essentials solo per programmi e servizi Essentials Windows </strong> e clicca <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-8-913.png\" alt=\"Turn On DEP for Essentials for Essentials Windows programs \" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Ricomincia </strong> il tuo PC e controlla se la finestra di dialogo Debugger Just-In-Time ha smesso di apparire. </p> <p> </p> <p> </p> <h6> Metodo 2. Disabilitare il debugger JIT in Visual Studio. </h6> <p> Se hai installato Visual Studio, procedi e disabilita il debugger JIT in Visual Studio. Fare quello: </p> <p> 1. vai a <strong> Pannello di controllo </strong> -&gt; <strong> Programmi e caratteristiche. <br> </strong> 2. <strong> Evidenziare </strong> il <strong> Visual Studio </strong> e clicca <strong> Modificare. </strong></p> <p><img src=\"images/image_thumb-10-917.png\" alt=\"Visual Studio - Turn off Just In Time Debugger\" loading=\"lazy\"><strong><br> </strong></p> <p> 3. In una nuova finestra aperta scegli <strong> Scheda Singoli componenti. <br> </strong> 4. <strong> Deseleziona </strong> il <strong> Debugger Just in Time </strong> e clicca <strong> Modificare. </strong></p> <p><img src=\"images/image_thumb-11-499.png\" alt=\"How to Disable Just-In-Time Debugger in Visual Studio\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Metodo 3. Disabilitare il debugger JIT dal registro. </h6> <p> 1. Aprire l&#39;editor del registro. Fare quello: </p> <blockquote><p> 1. Premi Finestre <img src=\"images/image_thumb8_thumb_thumb-187.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Nella casella &quot;Apri&quot;, digita: <strong> regedit </strong> &amp; clic <strong> ok </strong> . </p></blockquote> <p><img src=\"images/image_thumb7-250.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2. Trova e <strong> Elimina </strong> le seguenti voci di registro (in grassetto): </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\.NETFramework\\ <strong> DbgManagedDebugger </strong></li> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\AeDebug\\ <strong> Debugger </strong></li> </ul> <p><img src=\"images/image_thumb-12-426.png\" alt=\"Disable Just-In-Time Debugger from Registry\" loading=\"lazy\"></p> <p> </p> <p> 3. Se si dispone di un sistema operativo a 64 bit, eliminare anche le seguenti voci di registro (in grassetto): </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Wow6432Node\\Microsoft\\.NETFramework\\ <strong> DbgManagedDebugger </strong></li> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Wow6432Node\\Microsoft\\Windows NT\\CurrentVersion\\AeDebug\\ <strong> Debugger </strong></li> </ul> <p> 4. Chiudere l&#39;editor del registro e <strong> ricomincia </strong> il computer. <br> 5. Dopo il riavvio, il messaggio &quot;Just-In-Time Debugger – Si è verificata un&#39;eccezione win32 non gestita…&quot; scompare. </p> <p> * Nota: se la finestra di dialogo Debugger Just-In-Time appare ancora, vai a <strong> Pannello di controllo </strong> -&gt; <strong> Programmi e caratteristiche </strong> e <strong> disinstallare </strong> il <strong> Microsoft Visual Studion 2010 Shell (isolato </strong> ). </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}