{"title":"FIX: Utilizzo elevato della CPU DWM.EXE durante la connessione tramite RDP in Windows 10 (risolto)","content":"<p> Il seguente problema potrebbe presentarsi su un computer basato su Windows 10, mentre altri client sono connessi ad esso, tramite RDP (Remote Desktop Connection): Il processo &quot;DWM.EXE&quot; causa un elevato utilizzo della CPU sull&#39;host remoto o si blocca e termina sessione desktop remoto. Il problema si verifica comunemente se il computer host desktop remoto esegue Windows 10 v1903 e possiede una scheda video (GPU) basata su Intel. </p> <p><img src=\"images/image_thumb-35-158.png\" alt=\"FIX: Event 1000, Application error dwm.exe\" loading=\"lazy\"></p> <p> </p> <p> Problema in dettaglio: quando un computer client è connesso tramite RDP a un computer host Windows 10 (destinazione), il computer host disconnette il client desktop remoto perché il processo Desktop Windows Manager (dwm.exe) utilizza il 100% della CPU. Quando si verifica il problema, nel Visualizzatore eventi viene registrato il seguente evento: </p> <p><em> &quot;Nome applicazione in errore: dwm.exe, versione: 10.0.17134.1, timestamp: 0xf5178e97 <br> Nome del modulo in errore: sconosciuto, versione: 0.0.0.0, timestamp: 0x00000000 <br> Codice di eccezione: 0x8898009b <br> Offset guasto: 0x0000000000000000 <br> ID processo di errore: 0x3a8 <br> Ora di inizio dell&#39;applicazione in errore: 0x01d51ae025b941b3 <br> Percorso dell&#39;applicazione in errore: C:\\WINDOWS\\system32\\dwm.exe <br> Percorso del modulo guasto: sconosciuto <br> ID rapporto: fba8573a-ee4e-4430-b40c-3627888dbfd9&quot; </em></p> <p> </p> <p> Questo tutorial contiene le istruzioni per risolvere l&#39;utilizzo elevato della CPU DWM.EXE su un computer Windows 10 host remoto, dopo la connessione con desktop remoto (RDP). </p> <h4> Come correggere l&#39;utilizzo elevato della CPU DWM.EXE sull&#39;host Windows 10 del desktop remoto. </h4> <p> Per risolvere l&#39;utilizzo elevato della CPU di DWM.EXE, applica le istruzioni sui seguenti metodi al computer Windows 10 a cui ti connetti tramite la connessione desktop remoto (PC host): </p> <h6> Metodo 1. Forzare Remote Desktop Connections per utilizzare il driver dello schermo grafico XDDM. </h6> <p> 1. Premere contemporaneamente Windows <img src=\"images/image_thumb36-341.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo <strong> gpedit.msc </strong> &amp; Stampa <strong> Accedere. </strong></p> <p><img src=\"images/image_thumb-78-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Nel riquadro di sinistra, vai a: </p> <ul> <li><strong> Configurazione del computer </strong> &gt; <strong> Modelli amministrativi </strong> &gt; <strong> Componenti di Windows </strong> &gt; <strong> Servizi desktop remoto </strong> &gt; <strong> Host sessione desktop remoto </strong> &gt; <strong> Ambiente di sessione remota </strong></li> </ul> <p> 4. Nel riquadro di destra, fare doppio clic su <strong> Usa il driver del display grafico WDDM per le connessioni desktop remoto </strong></p> <p><img src=\"images/image_thumb-24-327.png\" alt=\"FIX: DWM.EXE High CPU Usage while using RDP \" loading=\"lazy\"></p> <p> </p> <p> 5. Imposta l&#39;impostazione della politica su <strong> Disabilitato </strong> e clicca <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-25-498.png\" alt=\"FIX: DWM.EXE High CPU Usage while connecting through RDP in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Chiudere l&#39;editor dei criteri di gruppo e <strong> riavviare </strong> il computer. </p> <p> </p> <p> </p> <h6> Metodo 2. Installare il driver di visualizzazione di base Microsoft. </h6> <p> 1. Passare a Gestione dispositivi. Fare quello: </p> <blockquote><p> 1. Premi Finestre <img src=\"images/image_thumb8_thumb_thumb-301.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo: <strong> devmgmt.msc </strong> &amp; clic <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-26-428.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. Espandi <strong> Adattatori display Display </strong> . <br> 3. Fare clic con il pulsante destro del mouse sulla scheda video installata e selezionare <strong> Proprietà </strong> . <br> 4. Selezionare il <strong> autista </strong> scheda e quindi fare clic su <strong> Aggiorna driver </strong> . </p> <p><img src=\"images/image_thumb-27-371.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Fare clic su <strong> Sfoglia il mio computer per il software del driver </strong> . </p> <p><img src=\"images/image_thumb-28-269.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Scegli <strong> Fammi scegliere da un elenco di driver disponibili sul mio computer </strong> . </p> <p><img src=\"images/image_thumb-29-401.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Scegli il <strong> Adattatore display di base Microsoft </strong> e clicca <strong> Il prossimo </strong> . </p> <p><img src=\"images/image_thumb-30-520.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Al termine dell&#39;installazione, chiudi tutte le finestre aperte e il gioco è fatto. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo problema. </p>"}