{"title":"FIX: Il file non ha flussi audio o video su Adobe Premiere.","content":"<p> Se ricevi l&#39;errore di Adobe Premiere &quot;File Import Failure&quot; con la descrizione &quot;Il file non ha flussi audio o video&quot; durante l&#39;importazione di un file video MP4, continua a leggere di seguito. L&#39;errore &quot;Il file non ha flussi audio o video&quot; in Adobe Premiere, potrebbe apparire anche se il video viene riprodotto correttamente in qualsiasi altro lettore multimediale (VLC, Windows Media Player ecc.). </p> <p><img src=\"images/image_thumb-43-349.png\" alt=\"FIX: File has no audio or video streams on Adobe Premiere\" loading=\"lazy\"></p> <p> </p> <p> Gli errori di Adobe Premiere, durante l&#39;importazione di un file video possono apparire per diversi motivi, quindi in questo tutorial troverai tutti i metodi disponibili per risolvere il problema. </p> <h4> Come risolvere: &quot;Il file non ha flussi audio o video&quot; in Adobe Premiere. </h4> <h6> Metodo 1. Installare QuickTime. </h6> <p> Prima di tutto, assicurati di aver installato l&#39;ultima <a href=\"https://support.apple.com/downloads/quicktime\" target=\"_blank\" rel=\"nofollow noopener\"> Tempo veloce </a> versione sul tuo PC e poi prova a importare il file mp4 in Adobe Premiere. </p> <p> </p> <h6> Metodo 2. Rinominare il file video. </h6> <p> 1. Crea una copia del file video mp4 in un&#39;altra posizione sul tuo PC. (ad es. sul tuo desktop) <br> 2. Rinominare il file video come segue: </p> <blockquote><p> un. Assegna un nome file più breve al file video e... <br> b. Rimuovi eventuali caratteri speciali dal suo nome. (sottolineatura, parentesi, ecc.). </p></blockquote> <p> 3. Apri il file video in Adobe Premiere. </p> <p> </p> <h6> Metodo 3. Modificare l&#39;estensione del nome file da MP4 a MOV. </h6> <p> Il prossimo metodo per aggirare l&#39;errore di Adobe Premiere &quot;Il file non ha flussi audio o video&quot; è cambiare l&#39;estensione del file video, da .mp4 a .mov (o viceversa). Fare quello: </p> <p> 1. In Esplora file, fare clic su <strong> Visualizza </strong> -&gt; <strong> Opzioni </strong> -&gt; <strong> Cambia cartella e opzioni di ricerca </strong> . </p> <p><img src=\"images/image_thumb-45-776.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. A <strong> Visualizza </strong> scheda, <strong> chiaro </strong> la casella &quot;Nascondi le estensioni per i tipi di file conosciuti&quot; e fai clic su <strong> ok </strong> . * </p> <p> * Nota: per rendere permanente questa impostazione, fare clic su &quot;Applica alle cartelle&quot;, prima di fare clic su OK. </p> <p><img src=\"images/image_thumb-46-490.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Ora procedi e rinomina/cambia l&#39;estensione del file video, come segue: </p> <ul> <li> Se il file video è in formato MP4 (.mp4), cambia la sua estensione in .mov </li> <li> Se il file video è in formato MOV (.mov), cambia la sua estensione in .mp4 </li> </ul> <p><img src=\"images/image_thumb-47-586.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Infine, apri il file video in Adobe Premiere. </p> <p> </p> <p> </p> <h6> Metodo 4. Cancella il database della cache multimediale e i file della cache. </h6> <p> Quando importi un file multimediale (video o audio) e mentre lavori con questo file in Adobe Premiere, il programma crea i file della cache multimediale per prestazioni più veloci. Inoltre, il programma crea collegamenti per questi file di cache in Media Cache Database. Nel corso del tempo, questi file della cache multimediale e il database della cache multimediale potrebbero diventare troppo grandi o danneggiati e devono essere puliti per evitare problemi. </p> <p> Quindi, il metodo successivo per risolvere il &quot;File non ha flussi audio o video&quot; in Premiere, è pulire il &quot;Database cache multimediale&quot; ed eliminare i file della cache. Fare quello: * </p> <p><strong> A. Come pulire il database della cache multimediale di Adobe Premiere. </strong></p> <p> 1. Apri Adobe Premiere. <br> 2. Dal menu vai a <strong> modificare </strong> -&gt; <strong> Preferenze </strong> -&gt; <strong> Media. <br> </strong> 3. In Media Cache Database fare clic su <strong> Pulito </strong> pulsante. </p> <p><img src=\"images/image_thumb-48-167.png\" alt=\"Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> 4. <strong> Ricomincia </strong> Adobe Premiere e prova ad aprire il file video. se l&#39;errore &quot;Il file non ha flussi audio o video&quot; persiste, procedi alla pulizia dei file della cache di Adobe Premiere seguendo le istruzioni seguenti: </p> <p><strong> B. Come cancellare i file della cache multimediale di Adobe Premiere. </strong></p> <p> 1. <strong> Aperto </strong> Adobe Premiere. <br> 2. Dal menu vai a <strong> modificare </strong> -&gt; <strong> Preferenze </strong> -&gt; <strong> Media. <br> </strong> 3. In File cache multimediale fare clic su <strong> Navigare </strong> o prendere nota della posizione dei file della cache multimediale. </p> <p><img src=\"images/image_thumb-49-331.png\" alt=\"FIX: Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Vicino </strong> Adobe Premiere. <br> 5. In Esplora file, <strong> Elimina </strong> tutto il contenuto della cartella &quot;File della cache multimediale&quot;. <br> 6. Importa il file video in Premiere. </p> <p> </p> <h6> Metodo 5. Ricodifica il file video. </h6> <p> Il metodo finale per risolvere il problema &quot;Il file non ha flussi audio o video&quot; nel processo di importazione di Adobe Premiere consiste nel ricodificare il file video. Fare quello: </p> <p> 1. Scarica e installa <a href=\"https://handbrake.fr/downloads.php\" target=\"_blank\" rel=\"nofollow noopener\"> Freno a mano </a> . <br> 2. Apri il freno a mano e fai clic su <strong> File – Apri un singolo file video </strong> . </p> <p><img src=\"images/image_thumb-50-634.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Seleziona il file video che non puoi importare in Adobe Premiere e fai clic su <strong> Aperto </strong> . <br> 4. Imposta il formato di output su <strong> MP4, </strong> e quindi fare clic su <strong> Navigare </strong> e specificare la posizione del negozio e il nome del file video di output (ricodificato). </p> <p><img src=\"images/image_thumb-51-817.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. A <strong> Dimensioni </strong> scheda, imposta le stesse dimensioni del file di origine. <br> 6. Al termine, fare clic su <strong> Avvia codifica. </strong></p> <p><img src=\"images/image_thumb-52-713.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Al termine del processo di codifica, chiudere Handbrake. <br> 7. Apri il file video ricodificato in Adobe Premiere. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}