{"title":"FIX: Adobe Reader DC – Salva con nome è vuoto (risolto)","content":"<p> Dopo un aggiornamento automatico di Adobe Reader DC, si è verificato il problema seguente: La funzione &quot;Salva con nome&quot; visualizza una finestra vuota (vuota) (vuota) che non consente all&#39;utente di salvare il documento PDF. </p> <p><img src=\"images/image_thumb-38-290.png\" alt=\"Adobe Reader DC - Save As is blank - fix\" loading=\"lazy\"></p> <p> Questo tutorial contiene le istruzioni per risolvere il seguente problema: La funzione &quot;Salva con nome&quot;, non funziona in Adobe Reader DC in Windows o MAC OS. </p> <h4> Come risolvere: Salva con nome è vuoto in Adobe Reader DC. </h4> <h6> Metodo 1. Scansiona il tuo sistema alla ricerca di virus e malware. </h6> <p> Il primo passo per risolvere il problema delle &quot;cartelle mancanti&quot; in Outlook è assicurarsi che il sistema sia privo di virus/malware. Per questo compito segui le istruzioni in questa guida: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Come eseguire la scansione del computer alla ricerca di virus e altri programmi dannosi. </a></p> <p> </p> <h6> Metodo 2. Disabilita l&#39;archiviazione online durante il salvataggio dei file. </h6> <p> 1. Da Adobe Reader DC <strong> modificare </strong> clic sul menu <strong> Preferenze </strong> . </p> <p><img src=\"images/image_thumb-39-749.png\" alt=\"save as not working fix in Adobe Reader DC\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Deseleziona </strong> il <strong> Mostra lo spazio di archiviazione online durante il salvataggio dei file </strong> e clicca <strong> OK. * </strong></p> <p> * Nota: facoltativamente, deseleziona anche la funzione &quot;Mostra spazio di archiviazione online all&#39;apertura dei file&quot;. </p> <p><img src=\"images/image_thumb-40-312.png\" alt=\"save as blank - abobe reader DC - fix\" loading=\"lazy\"></p> <p> </p> <p> 3. Ora prova a utilizzare la funzione Salva con nome in Adobe DC. Il problema deve essere risolto. </p> <p> </p> <h6> Metodo 3. Disinstallare e reinstallare Adobe Reader DC. </h6> <p> Il metodo finale per risolvere le finestre vuote nella funzione &quot;Salva con nome&quot; in Adobe DC è disinstallare completamente Adobe Reader DC e quindi scaricare e reinstallare l&#39;ultima versione del programma da <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> Qui </a> . </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a diffondere la notizia su questo. </p>"}