{"title":"FIX: Errore installazione aggiornamento Windows 10 non riuscita 0x800711C7 – 0x2000A (risolto)","content":"<p> Questo tutorial contiene le istruzioni per correggere l&#39;errore di aggiornamento di Windows 10 0x800711C7 – 0x2000A: &quot;L&#39;installazione non è riuscita nella fase SAFE_OS con un errore durante PREPARE_FIRST_BOOT&quot;. </p> <p> </p> <p><img src=\"images/image_thumb-51-797.png\" alt=\"FIX Error 0x800711C7 - 0x2000A installation failed in the SAFE_OS phase during PREPARE_FIRST_BOOT\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Problema di aggiornamento di Windows 10 0x800711C7 – 0x2000A in dettaglio: Quando si tenta di aggiornare Windows 10 all&#39;ultima versione (build) l&#39;installazione si interrompe con l&#39;errore &quot;Impossibile installare Windows 10 - 0x800711C7 - 0x2000A - L&#39;installazione non è riuscita nella fase SAFE_OS un errore durante PREPARE_FIRST_BOOT&quot;, quindi torna alla versione precedente di Windows. </p> <h4> Come risolvere l&#39;errore di installazione dell&#39;aggiornamento di Windows 10 v1809 0x800711C7 – 0x2000A </h4> <p> </p> <h6> Metodo 1. Disabilitare Device Guard da PowerShell. </h6> <p> L&#39;errore 0x800711C7 – 0x2000A nell&#39;aggiornamento a Windows 10 viene visualizzato nei sistemi con il &quot; <a href=\"https://techcommunity.microsoft.com/t5/iis-support-blog/windows-10-device-guard-and-credential-guard-demystified/ba-p/376419\" target=\"_blank\" rel=\"nofollow noopener\"> Protezione del dispositivo </a> &quot; abilitato, quindi, il primo metodo per risolvere l&#39;errore 0x800711C7 – 0x2000A nell&#39;aggiornamento di Windows 10, è disabilitare Device Guard sul tuo sistema. </p> <p> 1. Procedi e scarica il <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=53337\" target=\"_blank\" rel=\"nofollow noopener\"> Strumento di preparazione hardware di Device Guard e Credential Guard </a> da Microsoft. <br> 2. Al termine del download estrarre il file &quot;dgreadiness&quot;_v3.6.zip. <br> 3. Aprire la cartella estratta e dal menu File scegliere Apri Windows PowerShell come amministratore. </p> <p><img src=\"images/image_thumb-52-765.png\" alt=\"FIX Error 0x800711C7 - 0x2000A Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. In PowerShell digita il seguente comando per <strong> consentire (impostare) la politica di esecuzione per eseguire script </strong> (Stampa <strong> UN </strong> quando viene chiesto di modificare la politica di esecuzione). </p> <ul> <li> Set-ExecutionPolicy senza restrizioni </li> </ul> <p> 5. Quindi dai questo comando a <strong> disattivare </strong> il <strong> Protezione del dispositivo </strong> e il <strong> Protezione delle credenziali </strong> : </p> <ul> <li> .\\DG_Readiness_Tool_v3.6 -Disabilita </li> </ul> <p><img src=\"images/image_thumb-53-648.png\" alt=\"Disable Device Guard and Credential Guard Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Dopo l&#39;esecuzione del comando, <strong> riavviare </strong> il computer. <br> 7. Prova ad aggiornare Windows 10. * </p> <p> * Nota: dopo aver aggiornato Windows 10, segui la stessa procedura per abilitare Device Guard e Credential Guard, con questi comandi: </p> <ul> <li> Set-ExecutionPolicy senza restrizioni </li> <li> .\\DG_Readiness_Tool_v3.6 -Abilita </li> </ul> <p> </p> <h6> Metodo 2. Disabilita Hyper-V dal prompt dei comandi. </h6> <p> Il metodo successivo per risolvere l&#39;errore 0x800711C7 – 0x2000A nell&#39;aggiornamento di Windows 10 consiste nel disabilitare l&#39;hypervisor all&#39;avvio di Windows. </p> <p> 1. Apri <strong> prompt dei comandi come amministratore </strong> . <br> 2. Digitare il seguente comando per disabilitare Hyper-V all&#39;avvio di Windows. </p> <ul> <li> bcdedit /set hypervisorlaunchtype off </li> </ul> <p><img src=\"images/image_thumb-50-768.png\" alt=\"Disable Hyper-V Command Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Riavvia </strong> il tuo PC. <br> 4. Prova a installare l&#39;aggiornamento.* </p> <p> * Nota: dopo aver aggiornato Windows 10, dai il seguente comando per avviare automaticamente Hypervisor all&#39;avvio del computer: </p> <ul> <li> bcdedit /set hypervisorlaunchtype auto </li> </ul> <p> </p> <h6> Metodo 3. Disabilitare l&#39;avvio protetto dalle impostazioni del BIOS. </h6> <p> Un&#39;altra causa dell&#39;errore di aggiornamento di Windows 10 0x800711C7 - 0x2000A è l&#39;avvio protetto. Quindi, procedi e disabilita l&#39;avvio protetto dalle impostazioni del BIOS. Fare quello: </p> <p> 1. Accendere il sistema e premere immediatamente il tasto corrispondente* per entrare in <strong> IMPOSTAZIONI DEL BIOS. </strong></p> <p> </p> <p> * Nota: di solito per entrare nel BIOS, devi premere il tasto <strong> DEL </strong> o <strong> F1 </strong> o <strong> F2 </strong> o il <strong> F10 </strong> chiave. (dipende dal produttore) </p> <p> 2. Guarda <strong> Sicurezza </strong> o a <strong> Opzioni di avvio, </strong> o a <strong> Autenticazione </strong> impostazioni,* per trovare il <strong> Avvio sicuro </strong> opzione e <strong> disattivare </strong> è <strong> . </strong></p> <p> * Appunti: <br> 1.La posizione dell&#39;impostazione &quot;Avvio protetto&quot; nel BIOS dipende dal produttore del dispositivo. <br> 2. Se non riesci a trovare l&#39;impostazione &quot;Avvio protetto&quot;, allora <strong> disattivare </strong> il <strong> Supporto CSM </strong> poi <strong> Salva ed esci </strong> dal setup del BIOS. Quindi accedere nuovamente alla configurazione del BIOS per trovare l&#39;avvio protetto. </p> <p><img src=\"images/image_thumb-23-385.png\" alt=\"Disable Secure Boot\" loading=\"lazy\"></p> <p> 3. <strong> Salva </strong> impostazioni e <strong> USCITA </strong> Impostazioni del BIOS. <br> 4. Lascia che Windows si avvii normalmente e prova a installare l&#39;aggiornamento. Se l&#39;aggiornamento fallisce di nuovo, riattivare &quot;Avvio protetto&quot; e passare al metodo successivo. </p> <p> </p> <h6> Metodo 4. Aggiorna Windows 10 utilizzando l&#39;Assistente aggiornamento </h6> <p> 1. Vai a <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Sito di download di Windows 10 </a> e fai clic su <strong> Aggiorna ora </strong> pulsante. </p> <p><img src=\"images/image_thumb_thumb-680.png\" alt=\"Update Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Salva il file &quot;Windows10Upgrade9252.exe&quot; sul desktop. <br> 3. Fare doppio clic sul file scaricato per aprire il <strong> Assistente aggiornamento Windows </strong> . <br> 4. Fare clic su <strong> Aggiorna ora </strong> per avviare l&#39;aggiornamento. </p> <p><img src=\"images/image_thumb4_thumb-918.png\" alt=\"Windows 10 Update Assistant\" loading=\"lazy\"></p> <p> 5. Lascia che Windows finisca il download e la verifica. <br> 6. Quando la verifica raggiunge il 100%, <strong> disconnetti il ​​computer da Internet </strong> , o impostalo su &quot; <strong> Modalità aereo </strong> &quot;. <br> 7. Attendi che Windows aggiorni il tuo sistema. <br> 8. Quando richiesto, riavviare il sistema per installare l&#39;aggiornamento. </p> <p> </p> <p> È tutto gente! Ha funzionato per te? Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}