{"title":"FIX: Laptop Dell Inspiron a bassa velocità della CPU (risolto)","content":"<p> Questo tutorial contiene le istruzioni per risolvere il problema della velocità della CPU molto lenta su un laptop Dell Inspiron 5558. Di recente, un mio amico ha portato il suo laptop Dell nel mio laboratorio perché improvvisamente è diventato troppo lento. In effetti, il laptop funzionava velocemente in passato, ma ora ci vuole molto tempo per caricare il sistema operativo (Windows 10) e le applicazioni. </p> <p> Dopo aver controllato il laptop, e come puoi vedere nello screenshot qui sotto, ho scoperto che la CPU funziona sempre a 0,48 GHz anziché 2,20 GHz. Quindi, ho avviato la risoluzione dei problemi e alla fine ho trovato i seguenti due metodi per risolvere il problema della bassa velocità della CPU... </p> <p> (La velocità della CPU è stata ridotta di circa l&#39;85-87% su un laptop Dell) </p> <p><img src=\"images/image_thumb-16-354.png\" alt=\"FIX Dell Laptop Slow CPU Speed\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Come risolvere il problema della bassa velocità della CPU su un laptop Dell </h4> <h6> Metodo 1. Sostituire l&#39;adattatore di alimentazione CA. </h6> <p> Il problema della bassa velocità della CPU è un problema noto sui laptop Dell, quando l&#39;adattatore di alimentazione CA non viene riconosciuto correttamente dal computer. In questi casi, e anche se l&#39;adattatore di alimentazione sembra funzionare correttamente, all&#39;accensione del laptop viene visualizzato il seguente messaggio di avviso &quot;Impossibile determinare il tipo di adattatore di alimentazione CA. Ciò impedirà prestazioni ottimali del sistema&quot;. </p> <p> Quindi, il primo metodo per risolvere il tuo problema di prestazioni lente sul tuo laptop Dell è sostituire l&#39;adattatore di alimentazione con un nuovo adattatore di alimentazione CA Dell compatibile. </p> <p> </p> <h6> Metodo 2. ARRESTARE la limitazione della CPU con ThrottleStop. </h6> <p> Se il tuo adattatore CA funziona bene e il tuo laptop non si surriscalda,* quindi, un altro metodo per risolvere il problema di prestazioni lente del sistema sul tuo laptop Dell è disabilitare la limitazione sconosciuta dell&#39;adattatore di alimentazione, con il <strong><a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"> ThrottleStop </a></strong> utilità. Fare quello: </p> <p> 1. Scarica il <a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> ThrottleStop </strong></a> utility ed estrai l&#39;archivio che hai scaricato. <br> 2. Dalla cartella estratta, fare doppio clic per eseguire l&#39;applicazione &quot;ThorttleStop.exe&quot;. * <br> 3. <strong> Deseleziona </strong> il <strong> BD PROCHOT </strong> *** casella di controllo e quindi fare clic su <strong> Salva </strong> . </p> <p> * Appunti: <br> 1. Per monitorare la temperatura della CPU, è possibile utilizzare il <a href=\"https://www.alcpu.com/CoreTemp/\" target=\"_blank\" rel=\"nofollow noopener\"> CoreTemp </a> programma. <br> 2. Se viene visualizzato l&#39;errore &quot;MFC120U.dll non trovato&quot; o &quot;MSVCR120.dll mancante&quot;, dopo aver eseguito ThrottleStop, procedere e installare il <a title=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" href=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Pacchetti ridistribuibili di Visual C++ per Visual Studio 2013 </a> . ( <strong> Importante: </strong> Se possiedi Windows a 64 bit, devi installare sia la versione a 64 bit che quella a 32 bit del pacchetto Visual C++). <br> 3. BD PROCHOT sta per prochot bidirezionale. PROCHOT è l&#39;acronimo di processore caldo, che è il segnale che viene attivato all&#39;interno della CPU quando raggiunge circa 100°C - 105°C a seconda del numero di modello. Questo segnale è ciò che avvia la limitazione termica in modo che la CPU possa rallentare e evitare il surriscaldamento. La disabilitazione di PROCHOT consentirà alla CPU di continuare a funzionare alla massima velocità. (Fonte: <a href=\"http://forum.notebookreview.com/threads/the-throttlestop-guide.531329/\" target=\"_blank\" rel=\"nofollow noopener\"> La guida ThrottleStop </a> ). </p> <p><img src=\"images/image_thumb-20-666.png\" alt=\"FIX Slow CPU Speed with ThrottleStop\" loading=\"lazy\"></p> <p> 4. Chiudi ThrottleStop e il gioco è fatto. Ora la CPU funzionerà alla massima velocità, fino al riavvio o allo spegnimento del laptop. * </p> <p> * Nota: devi eseguire il <strong> ThrottleStop </strong> programma ogni volta che si avvia il computer, se si desidera eseguire alla massima velocità della CPU. Per semplificarti la vita, segui i passaggi in questo <a href=\"https://www.repairwin.com/how-to-start-throttlestop-at-windows-startup/\" target=\"_blank\" rel=\"nofollow noopener\"> guida </a> per avviare automaticamente ThrottleStop all&#39;avvio di Windows. </p> <p><img src=\"images/image_thumb-21-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}