{"title":"FIX: Impossibile connettersi al desktop remoto perché è già in corso una sessione della console (risolto).","content":"<p> Viene visualizzato il messaggio di errore su Connessione desktop remoto &quot;Il computer non è riuscito a connettersi a un&#39;altra sessione della console sul computer remoto perché è già in corso una sessione della console&quot; perché il computer locale e quello remoto hanno lo stesso indirizzo IP. Il problema si verifica solitamente quando si tenta di connettersi in remoto a un altro computer tramite una connessione VPN e si ha &quot;ricevuto&quot; lo stesso indirizzo IP dal router locale, come il computer remoto. Per risolvere il problema, seguire le istruzioni di seguito. </p> <p> </p> <p><img src=\"images/image_thumb-7-243.png\" alt=\"Remote Desktop Connection Could Not Connect because already have a console session in progress\" loading=\"lazy\"></p> <h4> Come correggere l&#39;errore RDP: Remote Desktop non è riuscito a connettersi a un&#39;altra sessione della console perché è già in corso una sessione della console. </h4> <p> Il problema in Connessione desktop remoto &quot;Impossibile connettersi a un&#39;altra sessione della console perché è già in corso una sessione della console&quot; si verifica comunemente quando il computer locale riceve in modo casuale (dal server DHCP), lo stesso indirizzo IP dell&#39;indirizzo IP del telecomando computer che si desidera connettere tramite RDP. </p> <p> L&#39;unico modo per risolvere il problema di cui sopra è disabilitare l&#39;assegnazione automatica dell&#39;indirizzo IP dal server DHCP, nel computer locale e specificare manualmente un indirizzo IP. Fare quello: </p> <p> 1. <strong> Fare clic con il tasto destro </strong> sul <strong> Rete </strong> icona <img src=\"images/image_thumb-42-527.png\" alt=\"image\" loading=\"lazy\"> nella barra delle applicazioni e fare clic su <strong> Rete aperta e centro di condivisione. </strong> * </p> <p><img src=\"images/image_thumb-104-485.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Seleziona <strong> Ethernet </strong> (o Wi-Fi) a sinistra, quindi nella sezione &quot;Impostazioni correlate&quot;, fare clic su <strong> Modifica le opzioni dell&#39;adattatore </strong> . </p> <p><img src=\"images/image_thumb-43-117.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Doppio click </strong> sull&#39;adattatore di rete attivo (Ethernet o Wi-Fi) e fare clic su <strong> Dettagli </strong> . </p> <p><img src=\"images/image_thumb-8-177.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Annotare i dettagli dell&#39;indirizzo IP nei seguenti campi e quindi fare clic su <strong> Vicino </strong> : </p> <ul> <li> Indirizzo IPv4 </li> <li> Maschera di sottorete IPv4 </li> <li> Gateway predefinito IPv4 </li> <li> Server DNS IPv4 </li> </ul> <p><img src=\"images/image_thumb-9-793.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Ora, fai clic su <strong> Proprietà </strong> . </p> <p><img src=\"images/image_thumb-10-628.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Selezionare il <strong> &#39;Protocollo Internet versione 4 (TCP/IPv4) </strong> &#39; e clicca <strong> Proprietà </strong></p> <p><img src=\"images/image_thumb-106-954.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 7. Nelle proprietà Protocollo Internet versione 4 (TCP/IPv4), applicare le seguenti impostazioni: </p> <p> A. Seleziona <strong> Utilizza il seguente indirizzo IP: </strong></p> <blockquote><p> 1. Nel campo Indirizzo IP, digitare a <strong> indirizzo IP diverso dall&#39;indirizzo IP che hai notato prima </strong> . (Cambia solo l&#39;ultimo numero con un valore più alto). <br> 2. In Subnet mask archiviata, digita lo stesso indirizzo IP di sottorete di quello che hai notato prima. <br> 3. In Gateway predefinito, digita lo stesso Gateway predefinito di quello che hai notato prima. </p></blockquote> <p> B. Seleziona <strong> Usa i seguenti indirizzi del server DNS </strong> : </p> <blockquote><p> 1. In Server DNS preferito, digita l&#39;indirizzo DNS che hai notato prima. </p></blockquote> <p> C. Al termine, fare clic su <strong> ok </strong> due volte e <strong> Vicino </strong> per chiudere le proprietà dell&#39;adapter. </p> <blockquote> <p><img src=\"images/image_thumb-11-850.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 8. Ora prova a connetterti al computer Desktop remoto. Il problema dovrebbe essere risolto. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}