{"title":"FIX: le impostazioni hardware sono cambiate. Si prega di riavviare all&#39;avvio di Windows 10. (Risolto)","content":"<p> Questa guida contiene le istruzioni per risolvere il seguente problema ad ogni avvio di Windows 10: &quot;Le impostazioni hardware sono cambiate. Riavvia il computer per rendere effettive queste modifiche.&quot;. </p> <p> L&#39;errore di avvio di Windows 10 &quot;le impostazioni hardware sono cambiate... riavviare&quot;, può apparire anche dopo una nuova installazione di Windows 10, in particolare su computer (desktop o laptop) che possiedono una scheda grafica AMD. </p> <p><img src=\"images/image_thumb-71-941.png\" alt=\"FIX Hardware Settings Have Changed. Please Reboot - Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Come correggere l&#39;errore di avvio di Windows 10: le impostazioni hardware sono cambiate. Riavvia il computer... </h4> <p> 1. Aprire il pannello di controllo dei servizi di Windows: per farlo: </p> <ul> <li> Premi Windows <img src=\"images/image_thumb8_thumb_thumb-332.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. </li> <li> Nella casella Cerca, digita: <strong><em> servizi.msc </em></strong> &amp; clic <strong> ok </strong> . </li> </ul> <p><img src=\"images/image_thumb-12-644.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Nel pannello di controllo Servizi, fare clic con il pulsante destro del mouse su <strong> Utility per eventi esterni AMD </strong> servizio e scegli <strong> Proprietà </strong> . </p> <p><img src=\"images/image_thumb-72-951.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Impostare il <strong> Tipo di avvio </strong> per <strong> Disabilitato </strong> e quindi fare clic su <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-73-548.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Riavvia </strong> il tuo computer. Se dopo il riavvio si riceve ancora l&#39;errore: &quot;le impostazioni hardware sono state modificate... riavviare&quot;, procedere come segue: </p> <p> 1. Vai a Pannello di controllo -&gt; <strong> Programmi e caratteristiche </strong> e <strong> disinstallare </strong> tutti i <strong> AMD </strong> Software. <br> 2. Vai a <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Pagina di download del driver AMD </a> per scaricare e installare un driver meno recente per la scheda video. </p> <p> È tutto gente! Ha funzionato per te? Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}