{"title":"FIX: Thunderbird non risponde o si blocca. (Risolto)","content":"<p> Se Thunderbird non risponde, continua di seguito per risolvere il problema. Thunderbird è un popolare client di posta elettronica open source disponibile per tutte le piattaforme. Ma a volte Thunderbird smette di rispondere o si blocca per 4-5 minuti prima di essere nuovamente utilizzabile. </p> <p><img src=\"images/image_thumb-18-762.png\" alt=\"Thunderbird is not responding or freezing - fix\" loading=\"lazy\"></p> <p> Thunderbird potrebbe non funzionare per i seguenti motivi: </p> <ul> <li> Il programma antivirus potrebbe impedire a Thunderbird di connettersi a Internet. </li> <li> La funzione di ricerca di Windows nei messaggi di Thunderbird può causare il blocco di Thunderbird. </li> <li> Un&#39;impostazione o un componente aggiuntivo problematico di Thunderbird. </li> <li> I file di indicizzazione di Thunderbird (file MSF) potrebbero essere danneggiati. </li> </ul> <p> Poiché Thunderbird potrebbe non rispondere per una serie di motivi, in questo tutorial ti mostreremo tutti i modi disponibili per risolvere il problema. </p> <h2> Come risolvere: Thunderbird non risponde o si blocca in Windows 10. </h2> <h3> Metodo 1. Scansiona il tuo computer alla ricerca di virus. </h3> <p><strong> Importante: </strong> Molti virus o programmi dannosi possono causare problemi con l&#39;aggiornamento di Windows. Quindi, prima di continuare con i passaggi per la risoluzione dei problemi di seguito, usa questo <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Guida alla scansione e alla rimozione di malware </a> per controllare e rimuovere virus e/o programmi dannosi che potrebbero essere in esecuzione sul tuo computer. </p> <h3></h3> <h3> Metodo 2. Disabilita la ricerca di Windows nei messaggi di Thunderbird. </h3> <p> 1. Dal menu di Thunderbird, seleziona <strong> Utensili </strong> &gt; <strong> Opzioni </strong> . </p> <p> 2. In Impostazioni generali, <strong> deselezionare </strong> l&#39;opzione <strong> Consenti a Windows Search di cercare i messaggi </strong> . </p> <p><img src=\"images/image_thumb-24-636.png\" alt=\"Disable Windows Search in Thunderbird Messages\" loading=\"lazy\"></p> <p> 3. <strong> Ricomincia </strong> Thunderbird. </p> <p> </p> <h3> Metodo 3. Aggiungi Thunderbird alle eccezioni di Antivirus. </h3> <p> Se stai utilizzando un antivirus di terze parti sul tuo computer, procedi e aggiungi il programma eseguibile &quot;thunderbird.exe&quot; alle eccezioni del tuo programma antivirus. </p> <p> Ad esempio, se possiedi AVG Antivirus: </p> <p> 1. Vai a <strong> Menù </strong> &gt; <strong> impostazioni </strong> . <br> 2. In <strong> Generale </strong> scheda, fare clic su <strong> Eccezioni </strong> &gt; <strong> Aggiungere eccezione </strong> . <br> 3. Fare clic su <strong> Navigare </strong> pulsante e individuare il <strong> thunderbird.exe </strong> file, (o <strong> copia </strong> &amp; <strong> incolla la riga sottostante) </strong> e quindi fare clic su <strong> Aggiungere eccezione. * </strong></p> <ul> <li> C:\\Programmi (x86)\\Mozilla Thunderbird\\thunderbird.exe </li> </ul> <p><strong> * Nota: </strong> Se dopo aver aggiunto il file &quot;thunderbird.exe alle eccezioni AV il problema persiste, <strong> Inserisci </strong> anche <strong> alle eccezioni AV </strong> il <strong> cartella in cui è stato installato Thunderbird </strong> e il <strong> Cartella profilo Thunderbird </strong> . </p> <p><img src=\"images/image_thumb-19-734.png\" alt=\"add thunderbird to antivirus exceptions\" loading=\"lazy\"></p> <p> </p> <p> </p> <h3> Metodo 4. Disabilita: disinstalla i tuoi programmi antivirus. </h3> <p> Poiché il problema &quot;non risponde&quot; nel programma Thunderbird, di solito è dovuto al programma antivirus, suggerisco di <strong> disattivare </strong> o a <strong> disinstallare completamente </strong> il tuo programma antivirus e per vedere se il problema persiste. </p> <h3></h3> <p> </p> <h3> Metodo 5. Avvia Thunderbird in modalità provvisoria. </h3> <p> Thunderbird potrebbe bloccarsi e non rispondere, se un&#39;estensione installata causa problemi o è danneggiata. Per risolvere i problemi con i componenti aggiuntivi di Thunderbird, procedere come segue. </p> <p> 1. Premere e <strong> tieni premuto </strong> il <strong> CAMBIO </strong> tasto sulla tastiera e apri <strong> Thunderbird. </strong></p> <p> 2. Nella finestra successiva fare clic su <strong> Continua in modalità provvisoria. </strong></p> <p><img src=\"images/image_thumb-21-196.png\" alt=\"Strat Thunderbird in Safe Mode\" loading=\"lazy\"></p> <p> </p> <p> 3. Se Thunderbird non si blocca in modalità provvisoria, il problema potrebbe essere causato da un componente aggiuntivo installato. In questo caso: </p> <ol> <li> Chiudi Thunderbird. </li> <li> Premi il tasto MAIUSC e avvia di nuovo Thunderbird. </li> <li> Alla finestra successiva, <strong> dai un&#39;occhiata </strong> <strong> Disattiva tutti i componenti aggiuntivi </strong> e clicca <strong> Apporta modifiche e riavvia </strong> . </li> </ol> <p><img src=\"images/image_thumb-22-149.png\" alt=\"Disable Thunderbird add-ons\" loading=\"lazy\"></p> <p> 4. Se Thunderbird non risponde più, passare al metodo successivo. </p> <h3> Metodo 5. Ripristina barre degli strumenti e controlli di Thunderbird. </h3> <p> 1. Premere e <strong> tieni premuto </strong> il <strong> CAMBIO </strong> tasto sulla tastiera e apri <strong> Thunderbird. </strong></p> <p> 2. Nella finestra successiva scegli <strong> Ripristina barre degli strumenti e controlli </strong> e clicca <strong> Apportare modifiche e riavviare. </strong></p> <p><img src=\"images/image_thumb-23-344.png\" alt=\"Reset Thunderbird Toolbars\" loading=\"lazy\"></p> <p> </p> <h3> Metodo 6. Eliminare i file di indice (.msf) di Thunderbird. </h3> <p> In alcuni casi Thunderbird si blocca, perché i file di indicizzazione (noti anche come file MSF) vengono danneggiati. Quindi, il metodo finale per risolvere il problema &quot;Thunderbird non risponde&quot; è eliminare i file .MSF. * </p> <p><strong> * IMPORTANTE: </strong> Sebbene i file MSF (Mail Summary Files) possano essere eliminati in sicurezza perché contengono solo le intestazioni e lo stato dell&#39;e-mail (letto, non letto, ecc.) e non l&#39;e-mail effettiva, <a href=\"https://www.repairwin.com/how-to-transfer-thunderbird-email-and-settings-to-a-new-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> eseguire il backup della cartella del profilo di Thunderbird </a> prima di eliminare i file MSF. </p> <p><strong> Passaggio 1. Chiudi Thunderbird. </strong></p> <p><strong> Passaggio 2. Abilita la visualizzazione dei file nascosti. </strong></p> <p> 1. Vai a Windows <strong> Pannello di controllo </strong> e apri il <strong> Opzioni cartella </strong> . (o il <strong> Opzioni di Esplora file </strong> in Windows 10). </p> <p> 2. Selezionare il <strong> Visualizza </strong> scheda, e sotto <strong> &quot;File e cartelle nascosti&quot; </strong> sezione, <strong> dai un&#39;occhiata </strong> il <strong> Mostra file, cartelle e unità nascosti </strong> opzione e fare clic <strong> OK. </strong></p> <p><img src=\"images/image_thumb-34-553.png\" alt=\"Show Hidden files\" loading=\"lazy\"></p> <p> </p> <p><strong> Passaggio 3. Elimina i file .MSF </strong></p> <p> 1. Passare alla cartella del profilo Thunderbird sul disco e aprire il <strong> posta </strong> cartella: * </p> <ul> <li> C:\\Utenti\\nomeutente\\AppData\\Roaming\\Thunderbird\\Profiles\\ProfileName <strong> .default\\Mail </strong></li> </ul> <p> * Dove username è il tuo nome utente di Windows e ProfileName è il nome del profilo Mozilla in cui sono archiviate le email. </p> <p> 2. Ora esplora tutte le cartelle contenute all&#39;interno del <strong> posta </strong> cartella, per vedere quale contiene i file .msf. (nelle installazioni predefinite, con un solo account di posta elettronica, i file MSF si trovano nella cartella &quot;Cartelle locali&quot;. </p> <p> 3. <strong> Elimina </strong> tutti <strong> .msf </strong> file, o -meglio- <strong> mossa </strong> li in una (nuova) cartella sul desktop. </p> <p><img src=\"images/image_thumb-25-355.png\" alt=\"Delete Thunderbird MSF files\" loading=\"lazy\"></p> <p> 4. Al termine, aprire Thunderbird e attendere che Thunderbird ricrei i file di indicizzazione (file MSF). </p> <p> È tutto gente! Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}