{"title":"FIX: Non è possibile installare Office a causa di Office 16 Fare clic per eseguire la registrazione del componente di estensibilità. (Risolto)","content":"<p> Se non è possibile installare Office a causa dell&#39;installazione di &quot;Office 16 Click to Run Extensibility Component Registration&quot;, continuare a leggere questo tutorial, che contiene istruzioni dettagliate per risolvere i seguenti problemi di installazione di Office: </p> <p><strong> Problema n.1: </strong> Quando tenti di installare una versione a 32 bit di Microsoft Office, viene visualizzato l&#39;errore: <br> <em> &quot;Non possiamo installare la versione a 32 bit di Office perché abbiamo trovato i seguenti programmi a 64 bit sul tuo PC: <br> Registrazione a 64 bit del componente di estensibilità a portata di clic di Office 16 <br> Disinstallare tutti i programmi di Office a 64 bit, quindi riprovare a installare Office a 32 bit. Se invece desideri installare Office a 64 bit, esegui l&#39;installazione a 64 bit.&quot; </em></p> <p><img src=\"images/image_thumb-6-215.png\" alt=\"FIX: We can't Install Office because of Office 16 Click to Run Extensibility Component Registration\" loading=\"lazy\"></p> <p> </p> <p><strong> Problema n°2 </strong> : quando tenti di installare una versione a 64 bit di Microsoft Office, viene visualizzato l&#39;errore: <br> <em> &quot;Non possiamo installare la versione a 64 bit di Office perché abbiamo trovato i seguenti programmi a 32 bit sul tuo PC: <br> <em> Registrazione a 32 bit del componente di estensibilità a portata di clic di Office 16 <br> <em> Disinstallare tutti i programmi di Office a 32 bit, quindi riprovare a installare Office a 64 bit. Se invece desideri installare Office a 32 bit, esegui l&#39;installazione a 32 bit.&quot; </em></em></em></p> <p> </p> <h2> Come risolvere: non possiamo installare questa versione di Office perché abbiamo trovato i seguenti programmi sul tuo PC: Office 16 Registrazione a 32 bit del componente di estensibilità a portata di clic </h2> <p> 1. Premere <strong> finestre </strong> <img src=\"images/image_thumb41-277.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo <strong> installatore </strong> e premi <strong> accedere </strong> per accedere alla cartella &quot;C:\\Windows\\Installer&quot;. </p> <p><img src=\"images/image_thumb-7-594.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Dal <strong> Visualizza </strong> menu, fare clic su <strong> Aggiungi colonne </strong> e quindi fare clic su <strong> Scegli colonne </strong></p> <p><img src=\"images/image_thumb-8-367.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Dai un&#39;occhiata </strong> il <strong> Soggetto </strong> e clicca <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-9-532.png\" alt=\"image\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-43.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 5. Ordina i risultati per Oggetto e poi scorri verso il basso fino a individuare il &quot; <em> Componente di estendibilità a portata di clic di Office 16&quot; </em> menzionato nel messaggio di errore di installazione di Office. </p> <p><img src=\"images/image_thumb-10-106.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Quando lo trovi, fai clic destro su di esso e scegli <strong> Disinstalla </strong> . </p> <p><img src=\"images/image_thumb-11-389.png\" alt=\"Remove office Click to Run installer\" loading=\"lazy\"></p> <p> 7. Al termine della disinstallazione, procedere con l&#39;installazione di Microsoft Office nuovamente. * </p> <p> * Nota: se ricevi ancora lo stesso errore, allora... </p> <p> 1. Procedi e disinstalla tutti i &quot;Componenti a portata di clic di Office 16&quot; e se l&#39;installazione fallisce di nuovo... <br> 2. Disinstallare completamente Microsoft Office dal PC, utilizzando le istruzioni in questo <a href=\"https://www.repairwin.com/fix-couldnt-uninstall-office-365-2016-2013-2010-or-2007/\" target=\"_blank\" rel=\"nofollow noopener\"> tutorial </a> e quindi procedere alla reinstallazione di Office. </p> <ul> <li> <p> Articolo correlato: : <a href=\"https://www.repairwin.com/fix-couldnt-uninstall-office-365-2016-2013-2010-or-2007/\" target=\"_blank\" rel=\"noopener noreferrer\"> FIX: Impossibile disinstallare Office 365, 2016, 2013, 2010 o 2007. </a></p> </li> </ul> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo. </p>"}