{"title":"FIX: Accesso rapido non funzionante e impossibile digitare nella casella di ricerca in Windows 10 (risolto)","content":"<p> Se <strong> Accesso rapido </strong> s non funziona in Windows 10, quindi leggi questo tutorial per risolvere il problema. L&#39;opzione Accesso rapido in Esplora file consente all&#39;utente di navigare facilmente nei file e nelle cartelle aperti di recente. Ma a volte, specialmente quando hai aperto in precedenza un file / cartella da un&#39;unità esterna (ad esempio il tuo disco USB), che ora è offline, l&#39;accesso rapido non mostra i file recenti o non puoi digitare nella barra &quot;Cerca&quot;. </p> <p><img src=\"images/image_thumb-2-490.png\" alt=\"FIX: Quick Access Not Working in Windows 10 (Solved)\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Come risolvere: la funzione di accesso rapido e la funzione di ricerca non funzionano in Windows 10. </h4> <p> </p> <h6> Metodo 1. Riavvia Esplora risorse. </h6> <p> Il primo metodo per risolvere il problema di accesso rapido consiste nel riavviare il processo di Esplora risorse di Windows dal Task Manager. Fare quello: </p> <p> 1. Premere <strong> Ctrl </strong> + <strong> Alt </strong> + <strong> Del </strong> aprire <strong> Task Manager </strong> . <br> 2. A <strong> Processi </strong> * scheda, evidenzia il <strong> Windows Explorer </strong> elaborare e fare clic <strong> Ricomincia </strong> . </p> <p> * Nota: se non vedi la scheda &quot;Processo&quot;, fai clic su <strong> Più dettagli. </strong></p> <p><img src=\"images/image_thumb-951.png\" alt=\"restart windows explorer\" loading=\"lazy\"></p> <p><strong> </strong></p> <h6> Metodo 2. Abilita l&#39;accesso rapido agli elementi recenti e cancella la cronologia di Esplora file. </h6> <p> 1. Apri <strong> Opzioni cartella. </strong> Per farlo, apri Esplora risorse e dal menu vai su <strong> Visualizza </strong> &gt; <strong> Opzioni </strong> . </p> <p><img src=\"images/image_thumb-3-949.png\" alt=\"enable quick access windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. In <strong> Generale </strong> scheda, assicurati che le seguenti caselle di controllo siano selezionate. </p> <ul> <li><strong> Mostra i file utilizzati di recente in Accesso rapido </strong></li> <li><strong> Mostra le cartelle utilizzate di frequente in Accesso rapido. </strong></li> </ul> <p> 3. Quindi fare clic su <strong> Chiaro </strong> pulsante per cancellare la cronologia di Esplora file. </p> <p><img src=\"images/image_thumb-4-329.png\" alt=\"clear quick access history\" loading=\"lazy\"></p> <p> </p> <p> 3. Fare clic su <strong> ok </strong> e controlla se l&#39;Accesso rapido e la funzione di ricerca funzionano. In caso contrario, riavvia &quot;Esplora file&quot; utilizzando il Task Manager (vedi il metodo 1 sopra) e ricontrolla. Se il problema persiste, passare al metodo successivo. </p> <h6> Metodo 3. Cancella manualmente la cronologia degli elementi recenti. </h6> <p> Il metodo successivo per risolvere i problemi con gli elementi recenti di accesso rapido o con la funzione &quot;Cerca&quot; in Windows 10 è eliminare manualmente la cronologia degli elementi recenti. Fare quello: </p> <p> 1. Aprire Esplora risorse. <br> 2. Copia e incolla il seguente indirizzo nella barra degli indirizzi e premi <strong> accedere </strong> : </p> <p> %AppData%\\Microsoft\\Windows\\Recent\\AutomaticDestinations </p> <p><img src=\"images/image_thumb-1-410.png\" alt=\"clear recent items windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3.  Premi <strong> Ctrl </strong> + <strong> UN </strong> (per selezionare tutti gli elementi) e premere <strong> Elimina </strong> (o fare clic con il tasto destro del mouse &gt; <strong> Elimina </strong> ). </p> <p><img src=\"images/image_thumb-5-834.png\" alt=\"Delete Quick Access History\" loading=\"lazy\"></p> <p> </p> <p> 4. Quindi copia/incolla il seguente indirizzo nella barra degli indirizzi e premi <strong> accedere </strong> . </p> <p> %AppData%\\Microsoft\\Windows\\Recent\\CustomDestinations </p> <p><img src=\"images/image_thumb-6-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Premere <strong> Ctrl </strong> + <strong> UN </strong> di nuovo (per selezionare tutti gli elementi) e premere <strong> Elimina. <br> </strong> 6. Ora premi <strong> Ctrl + Alt + Canc </strong> aprire <strong> Task Manager </strong> . <br> 7. A <strong> Processi </strong> scheda, evidenziare il <strong> Windows Explorer </strong> elaborare e fare clic <strong> Ricomincia </strong> . <br> 8. Normalmente, i problemi con la funzione &quot;Accesso rapido&quot; o con la funzione &quot;Cerca&quot; devono essere stati risolti. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}