{"title":"FIX Windows 10 Threat Service è stato interrotto e non può essere avviato (risolto)","content":"<p> In questa guida troverai le istruzioni passo passo per risolvere &quot;Errore imprevisto, siamo spiacenti, abbiamo riscontrato un problema&quot;, dopo aver premuto il pulsante &quot;Riavvia ora&quot; per avviare il servizio Minacce al fine di risolvere il problema &quot;Il servizio Minacce si è interrotto . Riavvia ora&quot; nel sistema operativo Windows 10. </p> <p><img src=\"images/image_thumb-689.png\" alt=\"Threat Service has Stopped and Cannot Start\" loading=\"lazy\"></p> <p> </p> <p> Problemi in dettaglio: la funzione Virus e minacce in Windows Defender Antivirus visualizza &quot;Sconosciuto&quot; e poiché il servizio Minacce è stato interrotto e non è in grado di iniziare con errori: </p> <ul> <li><em> Errore imprevisto, Spiacenti, abbiamo riscontrato un problema. Per favore riprova. </em></li> <li><em> Pagina non disponibile. Il tuo amministratore IT ha accesso limitato ad alcune aree di questa app e l&#39;elemento a cui hai provato ad accedere non è disponibile. Contatta l&#39;help desk IT per ulteriori informazioni. </em></li> </ul> <p><img src=\"images/image_thumb-1-155.png\" alt=\"Unable to Start Threat Service. Page not available.\" loading=\"lazy\"></p> <p> </p> <h4> Come risolvere il problema: il servizio minacce è stato interrotto e non può essere avviato in Windows 10 Defender. </h4> <h6> Passaggio 1. Rimuovere qualsiasi altro antivirus. </h6> <p> Il primo passo per correggere l&#39;errore &quot;Threat Service has Stopped&quot; è disinstallare qualsiasi altro antivirus dal PC. </p> <p> </p> <h6> Passaggio 2. Abilita i criteri di Windows Defender. </h6> <p> 1. Apri <strong> Editor del Registro di sistema </strong> : Fare quello: </p> <ul> <li> Premi contemporaneamente i tasti Windows <img src=\"images/image_thumb36-454.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. </li> <li> genere <strong> regedit </strong> &amp; Stampa <strong> Accedere. </strong></li> </ul> <p><img src=\"images/image_thumb7-613.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Passare alla seguente chiave nel riquadro di sinistra: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Windows Defender </li> </ul> <p> 4. Nel riquadro di destra modificare il valore &#39;DisableAntiSpyware&#39; da 1 a <strong> 0 * </strong></p> <p> * Nota: se non trovi il valore &quot;DisableAntiSpyware&quot;, fai clic con il pulsante destro del mouse su uno spazio vuoto e seleziona <strong> Nuovo </strong> -&gt; <strong> Valore DWORD (32 bit) </strong> e poi dare al valore il nome &quot; <strong> Disattiva AntiSpyware </strong> &quot; </p> <p><img src=\"images/image_thumb-2-284.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Chiudere l&#39;editor del registro e <strong> ricomincia </strong> il tuo PC. <br> 6. Ora controlla se la protezione dalle minacce è OK e se il problema persiste, vai al passaggio successivo. </p> <p> </p> <h6> Passaggio 3. Abilita il servizio antivirus di Windows Defender nel registro. </h6> <p> 1. Aprire l&#39;editor del registro. <br> 2. Passare alla seguente chiave nel riquadro di sinistra: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\WinDefend </li> </ul> <p> 3. Nel riquadro di destra modificare il <strong> Inizio </strong> valore da 4 a <strong> 2 </strong> . * </p> <p> * Nota: se non è possibile modificare il valore del registro, avviare Windows 10 in modalità provvisoria e riprovare. </p> <p><img src=\"images/image_thumb-3-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Chiudere l&#39;editor del registro e <strong> ricomincia </strong> il tuo PC. <br> 6. Ora controlla se la protezione dalle minacce è OK e se il problema persiste, vai al passaggio successivo. </p> <p> </p> <h6> Passaggio 4. RISOLVI i problemi di Windows Defender con DISM. </h6> <p> Il metodo successivo per risolvere l&#39;errore di Windows 10 Defender Security Center &quot;Il servizio minacce è stato interrotto e non può essere avviato&quot; consiste nel riparare Windows utilizzando lo strumento System Update Readiness (DISM). </p> <p> 1. Apri <strong> Prompt dei comandi come amministratore </strong> . Fare quello: </p> <ul> <li> Nella casella di ricerca digita: <strong> prompt dei comandi </strong> o <strong> cmd </strong></li> <li> Fare clic con il tasto destro su <strong> Prompt dei comandi </strong> risultato e selezionare <strong> Esegui come amministratore. </strong></li> </ul> <p><img src=\"images/image_thumb-10-227.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. Nel prompt dei comandi dare il seguente comando dism e premere <strong> Accedere: </strong></p> <ul> <li><strong> DISM.exe /Online /Cleanup-image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-140.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> </p> <p> 3. Quando l&#39;operazione DISM è completata, digita il seguente comando e premi <strong> accedere </strong> : </p> <ul> <li><strong> sfc /scannow </strong></li> </ul> <p><img src=\"images/image_thumb31-197.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Ora attendi che il Controllo file di sistema ripari i file di sistema di Windows. <br> 5. Fatto questo, <strong> ricomincia </strong> il tuo computer. </p> <p> </p> <h6> Passaggio 5. Ripara Windows 10 con l&#39;aggiornamento sul posto. </h6> <p> Il metodo finale per risolvere i problemi di installazione di Windows 10 Update è quello di <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> riparare Windows 10 con l&#39;aggiornamento sul posto. </a></p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}