{"title":"FIX: Chrome apre sempre le opzioni Sfoglia come ospite - Cambia persona all&#39;avvio.","content":"<p> Il tutorial contiene istruzioni su come impedire a Chrome di visualizzare la finestra &quot;Cambia persona - Naviga come ospite&quot; all&#39;avvio. Problema in dettaglio: su un computer basato su Windows, il browser Google Chrome apre sempre le opzioni &quot;Sfoglia come ospite&quot; e &quot;Aggiungi persona&quot; all&#39;avvio e l&#39;utente deve sempre selezionare il suo profilo per utilizzare il browser Chrome. </p> <p><img src=\"images/image_thumb-26-805.png\" alt=\"FIX Remove Chrome Browse as Guest\" loading=\"lazy\"></p> <p> </p> <h4> Come rimuovere la finestra delle opzioni &quot;Browser come ospite - Aggiungi persona&quot; all&#39;avvio di Chrome. </h4> <h6> Metodo 1. Verifica se Chrome è impostato su Avvia sempre in modalità di navigazione ospite. </h6> <p> Una delle funzioni più utili del browser Google Chrome è creare più profili utente, soprattutto se condividi il tuo computer con altri o se desideri separare i tuoi segnalibri e le impostazioni tra più account. In questo caso puoi sempre avviare Chrome con la finestra &quot;Cambia persona&quot;, aggiungendo uno dei seguenti interruttori (voci di testo) nel collegamento Chrome: </p> <ul> <li><strong> –profile-directory=&quot;Profilo ospite&quot; </strong></li> <li><strong> –bwsi </strong></li> </ul> <p> </p> <p> Quindi, prima di tutto, controlla se Chrome è impostato per aprire sempre la finestra &quot;Cambia persona/Sfoglia come ospite&quot;. Fare quello: </p> <p> 1. Chiudi Google Chrome. <br> 2. Fare clic con il pulsante destro del mouse su Collegamento Chrome sul desktop e selezionare <strong> Proprietà </strong> . <br> 3. A <strong> scorciatoia </strong> scheda, guarda il <strong> Bersaglio </strong> casella di testo e (se presente) <strong> rimuovere </strong> le voci di testo sopra alla fine e quindi fare clic su <strong> ok </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-27-916.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Avvia Chrome e nella finestra &quot;Cambia persona&quot;, fai clic sull&#39;icona/immagine del tuo profilo (&quot;Tu&quot;). <br> 5. <strong> Ricomincia </strong> Cromo. </p> <p> </p> <h6> Metodo 2. Crea un nuovo profilo Google Chrome pulito. </h6> <p> Per impostazione predefinita, Chrome memorizza tutte le impostazioni del profilo (segnalibri, password, estensioni e così via) all&#39;interno della cartella &quot;Dati utente&quot; nella seguente posizione sul computer: </p> <ul> <li><strong> C:\\Users\\%Username%\\AppData\\Local\\Google\\Chrome\\User DataUser </strong></li> </ul> <p> Se per qualche motivo, la cartella del profilo Chrome viene danneggiata o modificata in modo improprio dal malware, l&#39;opzione migliore è forzare Chrome a ricreare una nuova cartella del profilo Chrome (vuota*). Fare quello: </p> <p><strong> * Attenzione: </strong> Tieni presente che, eliminando la cartella di archiviazione del tuo profilo Chrome, elimini tutti i dati memorizzati (Segnalibri, Impostazioni, Estensioni, Cronologia, ecc.). Quindi, prima di eliminare il tuo profilo Chrome, prendi a <a href=\"https://www.repairwin.com/backup-restore-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> backup dei tuoi segnalibri di Chrome </a> nel caso in cui desideri reinstallare Chrome di nuovo. </p> <h5> Passaggio 1: abilita la visualizzazione di file e cartelle nascosti. </h5> <p> 1. Apri <strong> Opzioni cartella </strong> . <br> 2. A <strong> Visualizza </strong> scheda, <strong> dai un&#39;occhiata </strong> il <strong> Mostra file, cartelle e unità nascosti </strong> spunta la casella e clicca <strong> OK. </strong></p> <p><img src=\"images/image_thumb-6-189.png\" alt=\"enable hidden files folders\" loading=\"lazy\"></p> <h6></h6> <h5> Passaggio 2. Forza Chrome a creare una nuova cartella del profilo (pulita). </h5> <p> 1. <strong> Vicino </strong> Google Chrome. <br> 2. <strong> Aperto </strong> Esplora risorse e vai a questa posizione: </p> <ul> <li><strong> C:\\Users\\%USERNAME%\\AppData\\Local\\Google\\Chrome\\ </strong></li> </ul> <p> * Dove %USERNAME% = Il tuo nome utente. (ad es. se il tuo nome utente è &quot;Admin&quot;, devi navigare in questo percorso: &quot;C:\\Users\\Admin\\AppData\\Local\\Google\\Chrome&quot;) </p> <p> 3. <strong> Rinominare </strong> la cartella &quot;Dati Utente&quot; in &quot;Dati Utente.BAK&quot;. </p> <p><img src=\"images/image_thumb-28-373.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Ora apri Google Chrome. (Durante l&#39;avvio Chrome creerà automaticamente una nuova cartella &quot;Dati utente&quot; pulita per memorizzare i tuoi segnalibri e le impostazioni). </p> <p> </p> <h6> Metodi aggiuntivi per risolvere i problemi di Chrome. </h6> <p><strong> 1. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Controlla il tuo computer per virus, malware, ecc. </a></p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Disinstalla e reinstalla completamente Chrome. </a></p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}