{"title":"FIX: questo dispositivo non può usare un Trusted Platform Module in BitLocker. (Risolto)","content":"<p> Su un computer Windows 10 Pro o Enterprise potrebbe apparire il seguente errore quando si tenta di <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> attiva la crittografia dell&#39;unità BitLocker sull&#39;unità del sistema operativo </a> : &quot;Questo dispositivo non può utilizzare un Trusted Platform Module. L&#39;amministratore deve impostare l&#39;opzione &quot;Consenti BitLocker senza un TPM compatibile&quot; nel criterio &quot;Richiedi autenticazione aggiuntiva all&#39;avvio&quot; per i volumi del sistema operativo&quot;. </p> <p><img src=\"images/image_thumb-30-150.png\" alt=\"This device can't use a Trusted Platform Module in BitLocker\" loading=\"lazy\"></p> <p> Questo tutorial contiene le istruzioni per risolvere il seguente errore di BitLocker: &quot;Questo dispositivo non può usare un Trusted Platform Module...&quot; su Windows 10 Pro ed Enterprise Edition. </p> <h4> Come risolvere: errore &quot;Questo dispositivo non può utilizzare un Trusted Platform Module&quot; in Bit Locker. </h4> <p> BitLocker offre la massima protezione se usato con un Trusted Platform Module (TPM) versione 1.2 o successiva. Se possiedi un computer che non dispone di un modulo TPM, devi disabilitare il requisito TPM per BitLocker nei criteri di gruppo. Fare quello: </p> <p> 1. Premere contemporaneamente Windows <img src=\"images/image_thumb36-579.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo <strong> gpedit.msc </strong> &amp; Stampa <strong> Accedere. </strong></p> <p><img src=\"images/image_thumb-78-692.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Nel riquadro di sinistra, vai a: </p> <ul> <li><strong> Configurazione computer\\Modelli amministrativi\\Componenti di Windows\\Crittografia unità BitLocker\\Unità del sistema operativo </strong></li> </ul> <p> 4. Quindi fare clic su <strong> Richiedi autenticazione aggiuntiva all&#39;avvio </strong> nel riquadro di destra. </p> <p><img src=\"images/image_thumb-31-186.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Fare clic su <strong> Abilitato </strong> e poi controlla <strong> Consenti BitLocker senza un TPM compatibile </strong> casella di controllo. <strong><br> </strong> 6. Fare clic su <strong> ok </strong> e <strong> vicino </strong> l&#39;Editor criteri di gruppo. </p> <p><img src=\"images/image_thumb-32-380.png\" alt=\"Allow BitLocker without compatible Trusted Platform Module\" loading=\"lazy\"></p> <p> </p> <p> 7. Hai finito! Procedere per abilitare la protezione BitLocker sull&#39;unità del sistema operativo, senza alcun problema. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}