{"title":"FIX: La cartella BOZZA di Outlook non è presente nel riquadro di spostamento in Outlook 2013, 2010 o 2007. (Risolto)","content":"<p> Si è verificato il seguente problema in uno dei miei clienti: Improvvisamente e senza una ragione ovvia la cartella Bozze manca dal riquadro di navigazione in Outlook 2013. La prima azione per ripristinare la cartella Bozze mancante è cercare in tutte le altre cartelle di Outlook per assicurati che la cartella non sia stata spostata o cancellata per errore. Se ancora non riesci a trovare la cartella mancante, continua di seguito per risolvere il problema. </p> <p><img src=\"images/image_thumb-37-460.png\" alt=\"Drafts folder Missing Outlook\" loading=\"lazy\"></p> <p> </p> <p> Questo tutorial contiene istruzioni su come ripristinare una cartella mancante in Outlook 2007, 2010, 2013, 2016 o 365. </p> <h4> Come ripristinare una cartella mancante dal riquadro di navigazione di Outlook </h4> <h6> Metodo 1. Scansiona il tuo sistema alla ricerca di virus e malware. </h6> <p> Il primo passo per risolvere il problema delle &quot;cartelle mancanti&quot; in Outlook è assicurarsi che il sistema sia privo di virus/malware. Per questo compito segui le istruzioni in questa guida: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Come eseguire la scansione del computer alla ricerca di virus e altri programmi dannosi. </a></p> <p> </p> <h6> Metodo 2. RESET cartelle di Outlook. </h6> <p> Dopo la scansione antivirus, procedi e ripristina le cartelle di Outlook sui valori predefiniti utilizzando la procedura seguente: </p> <p> 1. Chiudere l&#39;applicazione Outlook. <br> 2. Premere il tasto <strong> finestre </strong> <img src=\"images/image_thumb8_thumb_thumb-622.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 3. Nella casella Cerca, digita: <strong> outlook/resetfolders </strong> &amp; clic <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-36-732.png\" alt=\"outlook reset folders\" loading=\"lazy\"></p> <p> </p> <p> 4. Outlook si aprirà e tutte le cartelle mancanti verranno ripristinate. </p> <p> È tutto gente! Ha funzionato per te? </p> <p> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a diffondere la notizia su questo. </p>"}