{"title":"FIX: Il componente aggiuntivo di Outlook è installato per tutti gli utenti e non può essere rimosso. (Risolto)","content":"<p> Se non è possibile disabilitare o abilitare un componente aggiuntivo di Outlook a causa di un errore &quot; <em> Il componente aggiuntivo è installato per tutti gli utenti su questo computer e può essere connesso o disconnesso solo da un amministratore </em> &quot;, continua a leggere di seguito per risolvere il problema. </p> <p><img src=\"images/image_thumb-76-527.png\" alt=\"The add-is installed for all users on this computer, and can only be connected or disconnected by an administrator\" loading=\"lazy\"></p> <p> Viene visualizzato l&#39;errore &quot;Il componente aggiuntivo può essere disabilitato solo da un amministratore&quot; perché quando hai installato il componente aggiuntivo, scegli di installarlo per tutti gli utenti sul computer. In questo caso, l&#39;unica soluzione per risolvere l&#39;errore consiste nel disinstallare il componente aggiuntivo utilizzando i privilegi di amministratore. </p> <h2> Come risolvere: impossibile abilitare o disabilitare il componente aggiuntivo perché è installato per tutti gli utenti in Outlook, Word o Excel. </h2> <p> Se non è possibile rimuovere o attivare un componente aggiuntivo di un&#39;applicazione Microsoft Office, a causa di un errore &quot; <em> L&#39;add-è installato per tutti gli utenti su questo computer e può essere connesso o disconnesso solo da un amministratore&quot;, </em> avvia l&#39;applicazione corrispondente come amministratore e procedi alla rimozione del componente aggiuntivo senza problemi. Fare quello: </p> <p><strong> 1. </strong> Fare clic con il pulsante destro del mouse sull&#39;applicazione Office, dove si verifica l&#39;errore sopra menzionato (ad esempio Outlook) e selezionare <strong> Esegui come amministratore. * </strong></p> <p> * Appunti: <strong><br> </strong> 1. Se non vedi l&#39;opzione &quot;Esegui amministratore&quot;, tieni premuto il tasto <strong> CAMBIO </strong> chiave e <strong> tasto destro del mouse </strong> nell&#39;app di Office si verifica l&#39;errore. <br> 2. Se fai clic con il pulsante destro del mouse sull&#39;app di Office da Windows 10 <strong> Inizio </strong> menù <img src=\"images/image_thumb2_thumb_thumb-340.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Programmi </strong> , vai a <strong> Di più </strong> &gt; <strong> Esegui come amministratore. </strong></p> <p><img src=\"images/image_thumb-77-661.png\" alt=\"FIX: Unable to Enable or Disable Add-in \" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Quando ti viene chiesto di consentire a questa app di apportare modifiche al tuo dispositivo, scegli <strong> Sì. </strong></p> <p><img src=\"images/image_thumb-78-120.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Dopo aver aperto l&#39;applicazione Office, procedere per disabilitare o abilitare il componente aggiuntivo desiderato. Questa volta il componente aggiuntivo verrà rimosso senza problemi. </p> <p> Questo è tutto! Fammi sapere se questa guida ti ha aiutato lasciando il tuo commento sulla tua esperienza. Metti mi piace e condividi questa guida per aiutare gli altri. </p>"}