{"title":"FIX: Errore DISM 1016 Si è verificato un errore durante il tentativo di accedere all&#39;immagine (risolto)","content":"<p> Questo tutorial contiene le istruzioni per risolvere il seguente errore durante l&#39;esecuzione del comando DISM in Windows 10: &quot;Errore 1016: si è verificato un errore durante il tentativo di accedere all&#39;immagine&quot;. L&#39;errore DISM 1016 potrebbe essere visualizzato quando si tenta di riparare un&#39;immagine Windows danneggiata, utilizzando uno dei seguenti comandi DISM nel prompt dei comandi di Windows 10: </p> <ul> <li> Dism/Online/Cleanup-Image/Restorehealth </li> <li> Dism /Online /Cleanup-image /Restorehealth /source:wim:X:\\sources\\install.wim:1 /LimitAccess </li> </ul> <p> …o quando si utilizza il comando DISM in Windows Recovery Environment (WinRE) </p> <ul> <li> Dism.exe /Image:X:\\ /Cleanup-Image /Restorehealth </li> </ul> <p> </p> <h4> Come correggere DISM Error 1016: si è verificato un errore durante il tentativo di accedere all&#39;immagine. </h4> <p><strong> Requisiti </strong> Nota: per risolvere i problemi menzionati in questo articolo, seguendo i metodi seguenti, sarà necessario avviare il computer da un supporto di installazione di Windows (USB o DVD). Se non possiedi un supporto di installazione di Windows, puoi crearne uno utilizzando <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Strumento di creazione multimediale di Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Come creare un supporto di installazione USB di Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Come creare un supporto di installazione DVD di Windows 10. </a></li> </ul> <p> </p> <h6> Metodo 1. Ripristina Windows 10 com&#39;era prima di installare gli aggiornamenti. </h6> <p> L&#39;errore DISM 1016, appare comunemente dopo un&#39;installazione non riuscita di un aggiornamento di Windows. Quindi, prima di tutto annulla l&#39;installazione degli aggiornamenti. Fare quello: </p> <p> 1. Avviare il sistema da un supporto di installazione di Windows. <br> 2. Nella schermata sottostante premere il tasto <strong> CAMBIO </strong> + <strong> F10 </strong> tasti per avviare il prompt dei comandi. (o fare clic su <strong> Il prossimo </strong> e vai a <strong> Ripara il mio computer </strong> &gt; <strong> Risoluzione dei problemi </strong> &gt; <strong> Prompt dei comandi </strong> ). </p> <p><img src=\"images/image_thumb17_thumb-172.png\" alt=\"FIX DISM Error 1016: An error occurred while attempting to access the image\" loading=\"lazy\"></p> <p> </p> <p> 3. Al prompt dei comandi, ottieni un elenco di tutte le unità, sul tuo sistema con questo comando: </p> <ul> <li><strong> wmic disco logico ottenere il nome </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-327.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> 4. Quindi scopri quale unità contiene la cartella &quot;Windows&quot;, digitando questo comando: * </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * per esempio. Per vedere il contenuto dell&#39;unità C:, digitare: &quot; <strong> dir C: </strong> &quot; (senza virgolette). Se non è possibile visualizzare la cartella &quot;Windows&quot; sull&#39;unità C:, passare alla lettera successiva dell&#39;unità (ad es. &quot;dir D:&quot;, &quot;dir E:&quot;, ecc.), finché non viene visualizzata la Cartella &quot;Windows&quot; su una delle unità elencate (dal comando sopra). </p> <p> [Come puoi vedere nello screenshot qui sotto, la cartella Windows (in questo caso) si trova nell&#39;unità D:.] </p> <p> </p> <p><img src=\"images/image_thumb13_thumb-1-454.png\" alt=\"image_thumb[13]\" loading=\"lazy\"></p> <p> </p> <p> 5. Una volta individuata l&#39;unità su quale unità si trova l&#39;unità &quot;Windows&quot; (ad esempio nell&#39;unità &quot;D:&quot; in questo esempio), accedere a tale unità digitando DriveLetter <strong> : </strong> + <strong> accedere </strong> . </p> <p> 6. Quindi creare una cartella scratch sull&#39;unità digitando questo comando: </p> <ul> <li><strong> mkdir D:\\Scratch </strong></li> </ul> <p><img src=\"images/image_thumb7_thumb-1-575.png\" alt=\"image_thumb[7]\" loading=\"lazy\"></p> <p> </p> <p> 7. Quindi dai il comando seguente per eseguire il rollback del sistema, dopo l&#39;aggiornamento non riuscito: </p> <ul> <li><strong> DISM /Image:D:\\ /ScratchDir:D:\\Scratch /Cleanup-Image /RevertPendingActions </strong></li> </ul> <p> * Nota: cambia la lettera dell&#39;unità <strong> D </strong> secondo il tuo caso. </p> <p> 8. Una volta eseguito il comando DISM precedente, dovresti ricevere il seguente messaggio sullo schermo: </p> <p><em> &quot;Ripristino delle azioni in sospeso dall&#39;immagine... <br> L&#39;operazione è stata completata. Qualsiasi ripristino delle azioni in sospeso verrà tentato dopo il riavvio <br> L&#39;operazione è stata completata con successo.&quot; </em></p> <p><img src=\"images/image_thumb11_thumb-753.png\" alt=\"image_thumb[11]\" loading=\"lazy\"></p> <p> </p> <p> 9. <strong> Vicino </strong> prompt dei comandi e <strong> ricomincia </strong> il tuo computer. * </p> <p> 10. Se Windows si avvia normalmente, continua con il tuo lavoro. Se Windows non si avvia e riprova a installare gli aggiornamenti, allora: </p> <blockquote><p> 1. Spegnere il PC. <br> 2. Riavvia il computer dal supporto di installazione di Windows. <br> 3. Avviare il prompt dei comandi. <br> 4. Al prompt dei comandi dare i seguenti comandi in ordine (non dimenticare di cambiare la lettera dell&#39;unità drive <strong> D </strong> secondo il tuo caso): </p></blockquote> <ul> <li> <ul> <li> del D:\\Windows\\SoftwareDistribution </li> <li> del D:\\Windows\\WinSxS\\cleanup.xml </li> <li> del D:\\Windows\\WinSxS\\pending.xml </li> </ul> </li> </ul> <blockquote><p> 5. Al termine, chiudere il prompt dei comandi e <strong> ricomincia </strong> il tuo PC. * </p></blockquote> <p> * Nota: se l&#39;avvio fallisce di nuovo, riavviare è il prompt dei comandi di WinRE e dare i seguenti comandi (non dimenticare di cambiare la lettera dell&#39;unità <strong> D </strong> secondo il tuo caso): </p> <ul> <li> chkdsk /f D: </li> <li> sfc /scannow /offbootdir=D:\\ /offwindir=D:\\windows </li> <li> dism /image:D:\\ /cleanup-image /restorehealth </li> </ul> <p> </p> <h6> Metodo 2. Ripristina il registro di Windows dal backup. </h6> <p> Il metodo successivo per correggere l&#39;errore dism 1016 (si è verificato un errore durante il tentativo di accedere all&#39;immagine), è ripristinare il registro di Windows dalla cartella &#39;RegBack&#39;. * </p> <p> * Info: La cartella &#39;RegBack&#39;, (percorso completo=Windows\\System32\\Config\\RegBack), è la posizione in cui Windows memorizza automaticamente un backup dei file di registro all&#39;avvio della macchina. </p> <p> Per ripristinare il registro dalla cartella RegBack: </p> <p> 1. Avviare il sistema da un supporto di installazione di Windows e quindi seguire i passaggi 1-5 dal metodo 1 sopra per accedere all&#39;unità Windows. (ad es. la &quot;D:&quot; in questo esempio). </p> <p> 2. Prima di tutto, fai un backup dei file di registro correnti, dando i seguenti comandi nell&#39;ordine. (Stampa <strong> accedere </strong> dopo aver digitato ogni comando): </p> <ul> <li><strong> cd\\windows\\system32\\config </strong></li> <li><strong> md Backup </strong></li> <li><strong> copia *.* Backup </strong></li> </ul> <p><img src=\"images/image_thumb-26-867.png\" alt=\"infinite Automatic Repair loop windows 10 fix\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Ora vai a <strong> RegBack </strong> cartella dando questo comando: </p> <ul> <li><strong> cd RegBack </strong></li> </ul> <p> 4. Quindi digitare <strong> DIR </strong> (per visualizzare il contenuto della cartella RegBack). </p> <p> 5. Ora controlla se qualcuno dei file elencati ha <strong> 0</strong> (zero) byte nella loro dimensione del file e procedi di seguito secondo il tuo caso: </p> <ul> <li><strong> Caso A. </strong> Se uno dei file elencati ha 0 (Zero) byte nella sua dimensione, allora <strong> Si fermi qui </strong> , e <strong> passa al metodo successivo </strong> , perché i file di backup del registro sono inutili o danneggiati. </li> <li><strong> Caso B. </strong> Se tutti i file elencati hanno una dimensione diversa da zero (come nello screenshot qui sotto), procedi al passaggio successivo. </li> </ul> <p><img src=\"images/image_thumb-27-314.png\" alt=\"restore registry from backup\" loading=\"lazy\"></p> <p> </p> <p> 6. Copiare i file di registro dal <strong> Windows\\System32\\Config\\RegBack </strong> cartella in <strong> Windows\\System32\\Config\\ </strong> cartella, dando questo comando: </p> <p> </p> <ul> <li><strong> copia *.* .. </strong></li> </ul> <p> 7. Quando richiesto, premere <strong> UN </strong> per sovrascrivere i file nella destinazione dopo aver dato il comando di copia. </p> <p><img src=\"images/image_thumb-28-604.png\" alt=\"fix startup repair loop\" loading=\"lazy\"></p> <p> </p> <p> 8. Una volta completata la copia, digitare <strong> Uscita </strong> e premi <strong> accedere </strong> per chiudere il prompt dei comandi. <br> 9. <strong> Ricomincia </strong> tuo computer e prova ad avviare Windows. </p> <p> * Nota: se Windows non si avvia di nuovo, riavviare il prompt dei comandi di WinRE e dare i seguenti comandi (non dimenticare di cambiare la lettera dell&#39;unità <strong> D </strong> secondo il tuo caso): </p> <ul> <li> chkdsk /f D: </li> <li> sfc /scannow /offbootdir=D:\\ /offwindir=D:\\windows </li> <li> dism /image:D:\\ /cleanup-image /restorehealth </li> </ul> <p> </p> <h6> Metodo 3. Ripristina Windows 10 a uno stato di lavoro precedente. </h6> <p> Il prossimo metodo per risolvere l&#39;errore DISM 1016 è ripristinare il sistema a uno stato di lavoro precedente. Fare quello: </p> <p> 1. Avviare il sistema dal supporto di installazione di Windows. <br> 2. Nella schermata sottostante, fare clic su <strong> Il prossimo </strong> e quindi fare clic su <strong> Ripara il tuo computer </strong> &gt; <strong> Risoluzione dei problemi. </strong></p> <p><img src=\"images/image_thumb20_thumb-815.png\" alt=\"image_thumb[20]\" loading=\"lazy\"></p> <p> </p> <p> 3. A <strong> Opzioni avanzate </strong> clic <strong> Ripristino del sistema. * </strong></p> <p> * Nota: se il <strong> Torna a una build precedente </strong> opzione, è disponibile in questa schermata, quindi scegli quell&#39;opzione. </p> <p><img src=\"images/image_thumb28_thumb-863.png\" alt=\"image_thumb[28]\" loading=\"lazy\"></p> <p> </p> <p> 4. Nella schermata successiva, fai clic sul tuo sistema operativo. </p> <p><img src=\"images/image_thumb29_thumb-664.png\" alt=\"image_thumb[29]\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 5. Quindi in Ripristino configurazione di sistema guidato, fare clic su <strong> Il prossimo </strong> e quindi scegli uno stato di lavoro precedente (Data/Ora) e fai clic su <strong> Il prossimo </strong> per avviare il processo di ripristino. </p> <p><img src=\"images/image_thumb-50-619.png\" alt=\"system restore windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Metodo 4. Ripara Windows 10. </h6> <p> Il metodo finale per risolvere l&#39;errore 1016 in DISM è quello di <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> riparare Windows 10 con l&#39;aggiornamento sul posto </a> o per eseguire il backup dei file e quindi per <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> installazione pulita di Windows 10 </a> . </p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}