{"title":"FIX: microfono non rilevato o non funzionante in Windows 10 (risolto)","content":"<p> Questa guida contiene le istruzioni per risolvere i problemi di &quot;microfono non rilevato&quot; o &quot;microfono non funzionante&quot; in Windows 10. Se si verificano problemi con il microfono in Windows 10, ciò può essere causato da diversi motivi. Il problema del &quot;microfono non funzionante&quot; è un problema per molti utenti di Windows 10 e di solito compare dopo un aggiornamento di Windows. </p> <p> Questo tutorial contiene diverse soluzioni per risolvere i problemi del microfono in Windows 10. </p> <h4> Come risolvere: il microfono di Windows 10 non funziona o non viene rilevato. * </h4> <p> * Nota: se hai problemi con il microfono, in una particolare app, prova quanto segue: </p> <blockquote><p> 1. Assicurarsi che l&#39;app specifica sia autorizzata a utilizzare il microfono, utilizzando le istruzioni nel metodo 1 di seguito. <br> 2. Assicurati che il microfono sia selezionato come dispositivo di input predefinito nelle impostazioni dell&#39;app. (ad es. in Skype, vai su <strong> impostazioni </strong> e assicurati che sia selezionato il microfono o l&#39;auricolare). <br> 3. Chiudi qualsiasi altra app che potrebbe utilizzare il microfono. <br> 4. Riavvia il PC e prova di nuovo il microfono. </p></blockquote> <h6> Soluzione 1. Consenti alle app di accedere al tuo microfono. </h6> <p> Il primo metodo, per risolvere i problemi con il microfono in Windows 10, è assicurarsi che tutte le app abbiano accesso al microfono. Fare quello: </p> <p> 1. . Dal menu Start <img src=\"images/image_thumb2_thumb_thumb-856.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clic <strong> impostazioni </strong><img src=\"images/image_thumb-66-804.png\" alt=\"image\" loading=\"lazy\"> e poi apri <strong> Privacy </strong> . <br> 2.  Seleziona <strong> Microfono </strong> nel riquadro di sinistra e poi <strong> Accendere </strong> il <strong> Consenti alle app di accedere al tuo microfono. </strong></p> <p><img src=\"images/image_thumb-34-268.png\" alt=\"How to FIX: Windows 10 Microphone Not Detected or Not Working\" loading=\"lazy\"></p> <p> 3. Quindi scorrere verso il basso e assicurarsi che l&#39;app che si desidera utilizzare il microfono sia in grado di accedervi. * </p> <p> * Suggerimento: per la tua privacy, disattiva l&#39;accesso al microfono per qualsiasi app che non desideri utilizzare con il microfono. </p> <p><img src=\"images/image_thumb-35-517.png\" alt=\" FIX Windows 10 Microphone Not Working\" loading=\"lazy\"></p> <p> 4. Al termine, prova il microfono. </p> <h6> Soluzione 2. Controlla se il tuo microfono è il dispositivo di input predefinito (dispositivo di registrazione). </h6> <p> 1. . Dal menu Start <img src=\"images/image_thumb2_thumb_thumb-930.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clic <strong> impostazioni </strong><img src=\"images/image_thumb-66-142.png\" alt=\"image\" loading=\"lazy\"> e poi apri <strong> Sistema </strong> . <br> 2. Fare clic su <strong> Suono </strong> nel riquadro di sinistra, quindi parlare per testare il microfono. Se il tuo microfono funziona, dovresti vedere la barra di scorrimento che si sposta in basso. In caso contrario, fare clic su <strong> Gestisci i dispositivi audio. </strong></p> <p><img src=\"images/image_thumb-36-254.png\" alt=\"Test Microphone Windows 10\" loading=\"lazy\"></p> <p> 3. Nelle opzioni &quot;Gestisci dispositivi audio&quot;, assicurati che il tuo microfono sia elencato sotto &quot;Dispositivi di input&quot; come dispositivo di input predefinito e il suo <strong> Abilitato </strong> . In caso contrario, fai clic sul microfono e fai clic su <strong> Abilitare. </strong></p> <p><img src=\"images/image_thumb-37-753.png\" alt=\"Enable Microphone Windows 10\" loading=\"lazy\"></p> <h6> Soluzione 3. Controllare le impostazioni del microfono nel Pannello di controllo. </h6> <p> 1. Vai a Windows <strong> Pannello di controllo </strong> e apri <strong> Suono. </strong></p> <p><img src=\"images/image_thumb-14-511.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Al <strong> Registrazione </strong> scheda, seleziona il tuo microfono e fai clic su <strong> Proprietà. </strong></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"Microphone Properties\" loading=\"lazy\"></p> <p> 3. Al <strong> Livello </strong> scheda, <strong> trascinare </strong> il cursore per il <strong> giusto </strong> , per aumentare il volume del microfono e assicurarsi che l&#39;audio del microfono non sia disattivato (nel caso in cui il microfono sia disattivato, l&#39;icona del volume <img src=\"images/image_thumb-39-434.png\" alt=\"image\" loading=\"lazy\"> , verrà visualizzato con un simbolo rosso <img src=\"images/image_thumb-40-819.png\" alt=\"image\" loading=\"lazy\"> ). Quando hai finito clicca <strong> ok </strong> e <strong> ok </strong> per chiudere le Proprietà del suono. </p> <p><img src=\"images/image_thumb-41-896.png\" alt=\"Microphone Levels\" loading=\"lazy\"></p> <h6> Soluzione 4. Modificare il driver della scheda audio. </h6> <p> Il metodo finale per risolvere i problemi del microfono in Windows 10 è cambiare il driver audio, soprattutto se possiedi un dispositivo Realtek Audio. Fare quello: </p> <p> 1. Apri <strong> Gestore dispositivi </strong> . Fare quello: </p> <blockquote><p> 1. Premi Finestre <img src=\"images/image_thumb8_thumb_thumb-918.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Nella casella &quot;Apri&quot;, digita: <strong> devmgmt.msc </strong> &amp; clic <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-5-732.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Espandere </strong> il <strong> Controller audio, video e giochi. </strong></p> <p> 3. <strong> Fare clic con il tasto destro </strong> sul <strong> audio ad alta definizione Realtek </strong> dispositivo e selezionare <strong> Aggiorna driver. <br> </strong></p> <p><img src=\"images/image_thumb-6-629.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Seleziona <strong> Sfoglia il mio computer per i driver. </strong></p> <p><img src=\"images/image_thumb-7-637.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Seleziona <strong> Fammi scegliere da un elenco di driver disponibili sul mio computer </strong> . </p> <p><img src=\"images/image_thumb-8-118.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. Nella schermata successiva, seleziona <strong> Dispositivo audio ad alta definizione </strong> e clicca <strong> Il prossimo. </strong></p> <p><img src=\"images/image_thumb-20-989.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p> 8. Nella finestra &quot;Avviso di aggiornamento del driver&quot;, fare clic su &quot;Sì&quot; per installare il nuovo driver. <br> 9. Al termine dell&#39;installazione del driver, <strong> ricomincia </strong> il tuo computer. <br> 10. Dopo il riavvio, procedere e testare il microfono. </p> <h6></h6> <h6> Soluzione 5. Disinstallare e reinstallare i driver della scheda audio. </h6> <p> La soluzione finale per risolvere il problema del microfono che non funziona, in Windows 10 è disinstallare e reinstallare completamente i driver della scheda audio. </p> <p> 1. Vai a <strong> Pannello di controllo </strong> &gt; <strong> Programma e funzionalità </strong> e <strong> disinstallare </strong> qualsiasi software relativo alla tua scheda audio. <br> 2. Apri <strong> Gestore dispositivi </strong> e <strong> espandere </strong> il <strong> Controller audio, video e giochi. <br> </strong> 3. <strong> Fare clic con il tasto destro </strong> sull&#39;installato <strong> Dispositivo audio </strong> e clicca <strong> Disinstalla dispositivo. </strong></p> <p><img src=\"images/image_thumb-42-701.png\" alt=\"Uninstall Sound Card Device\" loading=\"lazy\"></p> <p> </p> <p> 4. Al termine, vai al sito di supporto del produttore del tuo computer o laptop e scarica e installa il driver più recente per la tua scheda audio. <br> 5. Dopo l&#39;installazione, <strong> ricomincia </strong> il tuo pc e controlla se il tuo microfono funziona. </p> <p><strong> Aiuto aggiuntivo: </strong> Se dopo aver applicato le soluzioni di cui sopra, il microfono non funziona ancora, probabilmente è danneggiato. Per assicurarti, se possiedi un laptop, collega un microfono esterno o usa un altro microfono se possiedi un desktop. </p> <p> È tutto gente! Quale metodo ha funzionato per te? Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}