{"title":"FIX: Impossibile cambiare tema – Temi Aero in grigio in Windows 7 (risolto)","content":"<p> Il seguente problema si è verificato in un computer basato su Windows 7: Windows è passato al tema di base e l&#39;utente non può cambiare il tema perché, quando vengono aperte le impostazioni di personalizzazione, tutti i temi aerodinamici sono disattivati. Invece, tutte le altre impostazioni nel pannello di personalizzazione sono abilitate (sfondo del desktop, colore di Windows, salvaschermo, ecc.), aspettati di selezionare un tema diverso. </p> <p><img src=\"images/image_thumb-28-129.png\" alt=\"Cannot Change Theme – Themes Greyed Out\" loading=\"lazy\"></p> <p> </p> <p> Questo tutorial contiene le istruzioni per risolvere il seguente problema in Windows 7: Il tema non può essere modificato - Temi in grigio. </p> <h4> Come risolvere: impossibile cambiare tema: i temi aerodinamici sono disattivati. </h4> <h6> Metodo 1. Scansiona il tuo sistema alla ricerca di virus e malware. </h6> <p> Il primo passo per risolvere il problema &quot;impossibile modificare il tema di base&quot; è assicurarsi che il sistema sia privo di virus/malware. Per questo compito segui le istruzioni in questa guida: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Come eseguire la scansione del computer alla ricerca di virus e altri programmi dannosi. </a></p> <h6> Metodo 2. Riavviare il servizio temi. </h6> <p> 1. Aprire il pannello di controllo dei servizi di Windows: per farlo: </p> <ul> <li> Premi Windows <img src=\"images/image_thumb8_thumb_thumb-720.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. </li> <li> Nella casella Cerca, digita: <strong><em> servizi.msc </em></strong> &amp; clic <strong> ok </strong> . </li> <li> (Accetta l&#39;avviso UAC se appare). </li> </ul> <p><img src=\"images/image_thumb-12-580.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. Nel pannello di controllo Servizi, fare clic con il pulsante destro del mouse su <strong> Temi </strong> servizio e scegli <strong> Ricomincia </strong> . * </p> <p> * Nota: se il servizio è interrotto, fare clic su <strong> Inizio </strong> . </p> <p><img src=\"images/image_thumb-29-242.png\" alt=\"Themes Greyed Out - restart theme service\" loading=\"lazy\"></p> <p> </p> <h6> Metodo 3. Abilita stili di visualizzazione su finestre e pulsanti. </h6> <p> 1. Fare clic su <strong> Inizio </strong> pulsante, fare clic con il tasto destro su <strong> Computer e </strong> e seleziona <strong> Proprietà </strong> . </p> <p><img src=\"images/image_thumb-30-382.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2.  Fai clic su <strong> Impostazioni avanzate di sistema </strong> sulla sinistra. </p> <p><img src=\"images/image_thumb-31-876.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Nella scheda &quot;Avanzate&quot; fare clic su <strong> impostazioni </strong> nella sezione &quot;Prestazioni&quot;. </p> <p><img src=\"images/image_thumb-15-696.png\" alt=\"fix High CPU and DISK Usage Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. A <strong> Effetti visivi </strong> scheda, seleziona l&#39;opzione &quot;Usa stili di visualizzazione su finestre e pulsanti&quot; e fai clic su <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-32-631.png\" alt=\"fix Theme cannot be changed - themes greyed out\" loading=\"lazy\"></p> <p> </p> <h6> Metodo 4. Installare i driver video più recenti. </h6> <p><strong> 1. </strong> Navigare verso <strong> Pannello di controllo </strong> &gt; <strong> Programmi e caratteristiche </strong> e <strong> disinstallare </strong> il driver VGA attualmente installato. </p> <p><strong> 2. </strong> Al termine dell&#39;operazione di disinstallazione <strong> ricomincia </strong> il tuo computer. </p> <p><strong> 3. </strong> Dopo il riavvio, vai al sito di supporto del produttore del tuo computer per scaricare e installare i driver più recenti per la tua scheda grafica. Se possiedi un computer desktop o laptop* con una scheda AMD/ATI o NVIDIA VGA, segui i passaggi seguenti per trovare, scaricare e installare l&#39;ultima versione del driver per la tua scheda video. </p> <p><strong> * Nota: </strong> Se non riesci a trovare i driver dai collegamenti seguenti, vai al sito di supporto del produttore del tuo computer. </p> <p> </p> <p><strong> Per GPU basate su NVIDIA. </strong></p> <ol> <li> <ol> <li> Vai a <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Pagina di ricerca dei driver avanzati NVIDIA </a> e cerca il driver corrispondente per la tua scheda video. </li> <li> Nella pagina dei risultati di ricerca scarica una versione precedente del driver. </li> <li> Installa il driver che hai scaricato e riavvia il computer. </li> </ol> </li> </ol> <p> </p> <p><strong> Per GPU basate su AMD. </strong></p> <ul> <li> <ol> <li> Vai a <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Download del driver AMD (ATI) </a> e cerca il driver corrispondente per la tua scheda video. </li> <li> Nella pagina dei risultati di ricerca, premi il tasto <strong> Driver e software precedenti </strong> collegamento a destra. </li> <li> Installa il driver che hai scaricato e riavvia il computer. </li> </ol> </li> </ul> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}