{"title":"FIX: Operazione Outlook non riuscita. Le interfacce di messaggistica hanno restituito un errore sconosciuto in Outlook 2016, 2013, 2010 o 2007 (risolto)","content":"<p> L&#39;errore di Outlook &quot;Operazione non riuscita. Le interfacce di messaggistica hanno restituito un errore sconosciuto. Se l&#39;errore persiste, riavvia Outlook. Impossibile risolvere il destinatario&quot;, potrebbe apparire nella versione di Outlook 2003, 2007, 2010 o 2013 e può essere causato per diversi motivi. Quindi, in questo tutorial, troverai diversi metodi per risolverlo. </p> <p><img src=\"images/image_thumb-59-377.png\" alt=\"The Operation failed. The messaging interfaces has returned an unknown error. If the error persists, restart Outlook\" loading=\"lazy\"></p> <p> L&#39;errore &quot;Operazione non riuscita. L&#39;interfaccia di messaggistica ha restituito un errore sconosciuto&quot; in Outlook può essere visualizzato nei seguenti casi: </p> <blockquote><p> 1. Quando si tenta di visualizzare o eliminare i messaggi di posta elettronica in una cartella di Outlook. </p> <p> 2. Quando si stampa un&#39;e-mail o un&#39;attività del calendario. </p> <p> 3. Quando si tenta di creare un nuovo profilo di Outlook. </p></blockquote> <p> </p> <h4> Come risolvere: l&#39;interfaccia di messaggistica di Outlook ha restituito un errore sconosciuto. Impossibile risolvere il destinatario. </h4> <h6> Metodo 1. Ripristina la visualizzazione delle cartelle di Outlook. </h6> <p> Se una o più visualizzazioni personalizzate sono interrotte, impedisce a Outlook di visualizzare alcuni elementi/cartelle. Quindi, il metodo successivo per risolvere le &quot;interfacce di messaggistica ha restituito un errore sconosciuto&quot; in Outlook è ripristinare tutte le visualizzazioni delle cartelle di Outlook alle impostazioni predefinite. Fare quello: </p> <p> 1. Chiudi Outlook. <br> 2. Premere il tasto <strong> finestre </strong> <img src=\"images/image_thumb8_thumb_thumb-501.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 3. Nella casella &quot;Apri&quot; digita il seguente comando e premi <strong> accedere </strong> . </p> <ul> <li><strong> outlook / cleanviews </strong></li> </ul> <p><img src=\"images/image_thumb-57-310.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. L&#39;Outlook dovrebbe avviarsi normalmente. Controllalo e se l&#39;errore persiste, vai al passaggio successivo. </p> <p> </p> <h6> Metodo 2. Elimina le impostazioni dello stile di stampa di Outlook. </h6> <p> Outlook memorizza le impostazioni dello stile di stampa nel file &quot;OutlPrnt&quot;. Se questo file è danneggiato, potrebbe causare il problema &quot;le interfacce di messaggistica hanno restituito uno sconosciuto&quot; durante la stampa in Outlook. In questo caso: </p> <p> 1. Chiudi Outlook. <br> 2. Premere il tasto <strong> finestre </strong> <img src=\"images/image_thumb8_thumb_thumb-409.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 3. Nella casella &quot;Apri&quot; digita il seguente comando e premi <strong> accedere </strong> . </p> <ul> <li> C:\\Utenti\\%nomeutente%\\AppData\\Roaming\\Microsoft\\Outlook\\ </li> </ul> <p> 4. <strong> Rinominare </strong> il &quot; <strong> OutlPrint </strong> &quot;file in&quot; <strong> OutlStamp.old </strong> &quot;. </p> <p><img src=\"images/image_thumb-58-286.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Avvia Outlook e controlla se l&#39;errore è stato risolto. (All&#39;avvio di Outlook, ricostruirà il file &quot;Outlprnt&quot;). </p> <h6></h6> <h6> Metodo 3. Riparare il file di dati di Outlook. </h6> <p> In base al tuo caso, segui le istruzioni seguenti per riparare i danneggiamenti del file di dati di Outlook. </p> <p><strong> Caso 1: account per Exchange (IMAP) (.OST) <br> </strong> Se stai utilizzando un account Exchange (IMAP), forza Outlook a ricreare il file .OST di Outlook danneggiato, procedendo come segue: </p> <p> 1. <strong> Vicino </strong> prospettiva. <br> 2. <strong> Rinominare </strong> l&#39;OST per l&#39;account che causa il problema. <br> 3. Apri Outlook. (Outlook ricreerà il file OST). <br> 4. Se l&#39;errore persiste, continuare con il passaggio 2 di seguito. </p> <p> </p> <p><strong> Caso 2: per account POP3 (PST) <br> </strong> Se stai utilizzando un account POP3, ripara il file .PST di Outlook danneggiato, procedendo come segue: </p> <p><strong> 1. </strong> <strong> Vicino </strong> Prospettiva. <br> <strong> 2. </strong> Apri Windows Explorer e individua il locate <strong> scanpst.exe </strong> strumento di riparazione in questa posizione: * </p> <ul> <li> C:\\Programmi\\Microsoft Office\\%OfficeVersion%\\SCANPST.EXE </li> </ul> <p> * Posizione del file &quot;SCANPST.EXE&quot; in base alla versione di Office: * </p> <blockquote><p><strong> Outlook 2013 e Outlook 2016 </strong><br> Windows a 32 bit &gt; C:\\Programmi\\Microsoft Office\\Office15 <br> Windows a 64 bit &gt; C:\\Programmi (x86)\\Microsoft Office\\Office15 <br> Outlook a 64 bit &gt; C:\\Programmi\\Microsoft Office\\Office15 <br> A portata di clic  &gt;  C:\\Programmi\\Microsoft Office 15\\root\\office15 <br> <strong><br> Outlook 2010 </strong><br> Windows a 32 bit &gt; C:\\Programmi\\Microsoft Office\\Office14 <br> Windows a 64 bit &gt; C:\\Programmi (x86)\\Microsoft Office\\Office14 <br> Outlook a 64 bit &gt;  C:\\Programmi\\Microsoft Office\\Office14 <br> <strong><br> Outlook 2007 </strong><br> Windows a 32 bit &gt; C:\\Programmi\\Microsoft Office\\Office12 <br> Windows a 64 bit &gt;  C:\\Programmi (x86)\\Microsoft Office\\Office12 </p></blockquote> <p> </p> <p> * Nota: se non riesci a trovare &quot;scanpst.exe&quot; nelle posizioni sopra, guarda: </p> <ul> <li> C:\\Programmi (x86)\\Microsoft Office\\root\\Office16. </li> </ul> <p><strong> 3. </strong> Fare doppio clic per <strong> Aperto </strong> il file SCANPST.EXE <br> <strong> 4. </strong> Clic <strong> Navigare </strong> . </p> <p><img src=\"images/image_thumb-55-702.png\" alt=\"scanpst.exe\" loading=\"lazy\"></p> <p> </p> <p><strong> 5. </strong> Individua il file di dati di Outlook danneggiato (ad es. Outlook.pst) in questa posizione: </p> <p> </p> <p><strong> Windows XP </strong></p> <ul> <li><strong> C:\\Documents and Settings\\%Username%\\Local Settings\\Application Data\\Microsoft\\Outlook\\Outlook.pst </strong></li> </ul> <p><strong> Windows 7 o Vista </strong></p> <ul> <li><strong> C:\\Utenti\\%Nome utente%\\AppData\\Local\\Microsoft\\Outlook\\Outlook.pst </strong></li> </ul> <p> * Nota: in Outlook 2016, 2013 e 2010, il file di dati di Outlook è archiviato per impostazione predefinita in: </p> <ul> <li><strong> C:\\Utenti\\%Nome utente%\\Documenti\\File di Outlook\\Outlook.pst </strong></li> </ul> <p><strong> 6. </strong> premi il <strong> Scansione </strong> e sii paziente finché lo strumento di riparazione Posta in arrivo non ripara il file danneggiato. * </p> <p> * Nota: nella fase di riparazione finale ti verrà chiesto se desideri creare un backup. Risposta &quot; <strong> sì </strong> &quot; per continuare l&#39;operazione di riparazione. </p> <p><img src=\"images/image_thumb-56-936.png\" alt=\"Outlook Inbox Repair Tool\" loading=\"lazy\"></p> <p> </p> <p> 7. Al termine del processo di riparazione, aprire Outlook e verificare se il problema &quot;l&#39;interfaccia di messaggistica ha restituito un errore sconosciuto&quot; è stato risolto. </p> <p> </p> <h6> Metodo 4. Elimina e ricrea il profilo di Outlook. </h6> <p> Il metodo finale per risolvere il problema &quot;L&#39;interfaccia di messaggistica ha restituito un errore sconosciuto&quot; consiste nell&#39;eliminare e ricreare il profilo di Outlook. </p> <p> 1. Passare al Pannello di controllo di Windows. Fare quello: </p> <blockquote><p> un. Digita &quot;pannello di controllo&quot; nella casella di ricerca di Windows <br> b. Clic <strong> Pannello di controllo </strong> dai risultati. </p></blockquote> <p><img src=\"images/image_thumb-53-981.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Impostare il <strong> Visto da </strong> per <strong> Piccole icone </strong> per visualizzare tutti gli elementi del pannello di controllo, quindi fare clic su <strong> posta </strong> . </p> <p><img src=\"images/image_thumb-54-839.png\" alt=\"control panel mail options\" loading=\"lazy\"></p> <p> </p> <p> 3. Fare clic su <strong> Mostra profili. * </strong></p> <p><strong> * Nota importante: </strong> Se utilizzi più di un account e-mail, controlla se l&#39;errore viene visualizzato in tutti gli account e-mail. Se l&#39;errore viene visualizzato solo in un account, prova a eliminare e aggiungere nuovamente solo l&#39;account con il problema, utilizzando la seguente procedura: </p> <blockquote><p> un. Clicca il <strong> Account email </strong> pulsante e rimuovere l&#39;account e-mail con il problema. <br> b. Quindi fare clic su <strong> File di dati </strong> e rimuovere il file di dati di Outlook, associato all&#39;account rimosso. <br> c. Finalmente clicca <strong> Account email </strong> di nuovo e aggiungere nuovamente l&#39;account e-mail rimosso. </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-2-573.png\" alt=\"Create Secondary Outlook Profile\" loading=\"lazy\"></p> <p> </p> <p> 4. Selezionare il profilo corrente e fare clic su <strong> Rimuovere </strong> . Quindi fare clic su <strong> sì </strong> per confermare la tua decisione. </p> <p><img src=\"images/image_thumb-53-706.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Quindi fare clic su <strong> Inserisci </strong> e dai un nome al profilo: (es. &quot;Outlook&quot;). </p> <p><img src=\"images/image_thumb-54-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Segui i passaggi della procedura guidata &quot;Aggiungi account&quot; per riconfigurare il tuo account di posta. </p> <p> </p> <p><img src=\"images/image_thumb-9-658.png\" alt=\"outlook account setup\" loading=\"lazy\"></p> <p> </p> <p> 7. Dopo aver aggiunto il tuo account, apri Outlook e controlla se &quot;Le interfacce di messaggistica hanno restituito un errore sconosciuto&quot; è stato risolto. * </p> <p> * Nota: se Outlook funziona correttamente e senza errori e desideri ripristinare le email dal vecchio file di dati .PST di Outlook, segui le istruzioni seguenti: </p> <ol> <li> <ol> <li> A partire dal <strong> prospettiva </strong> &#39;S <strong> File </strong> menu, selezionare <strong> Apri ed esporta </strong> &gt; <strong> Importa/Esporta </strong> . </li> <li> In &quot;Scegli un&#39;azione per eseguire le opzioni, seleziona <strong> Importa da un altro programma o file </strong> &amp; clic <strong> Il prossimo. </strong></li> <li> Nelle opzioni &quot;Seleziona il tipo di file da cui importare&quot;, seleziona <strong> File di dati di Outlook (.pst) </strong> &amp; clic <strong> Il prossimo </strong> . </li> <li> Nella schermata &quot;File da importare&quot;, fare clic su <strong> Navigare. </strong></li> <li> Seleziona il vecchio file PST di Outlook da cui vuoi importare le tue e-mail e fai clic su <strong> Aperto. </strong></li> <li> Clic <strong> Il prossimo </strong> &amp; <strong> Finire. </strong></li> </ol> </li> </ol> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}