{"title":"FIX: Menu Start di Windows 10, Impostazioni, Cortana o barra delle applicazioni non funzionano. (Risolto)","content":"<p> Questo tutorial contiene le istruzioni per risolvere i seguenti problemi in Windows 10: il menu Start non si apre, la ricerca Cortana non funziona, l&#39;app Impostazioni non si avvia, le icone della barra delle applicazioni non si aprono. </p> <p> Molti utenti di Windows 10 hanno segnalato problemi con il menu Start, la barra delle applicazioni, Cortana e Impostazioni, quindi in questa guida elenco i metodi più comuni per risolvere i problemi di cui sopra. </p> <h2> Come risolvere: barra delle applicazioni di Windows 10, menu Start, impostazioni o problemi di Cortana. </h2> <h3> Metodo 1. Disinstallare l&#39;ultimo aggiornamento di Windows 10. </h3> <p> Molti utenti hanno segnalato che i problemi menzionati in questo articolo sono stati risolti dopo la disinstallazione <strong><a href=\"https://support.microsoft.com/en-us/topic/august-11-2020-kb4566782-os-build-19041-450-ec5cf4b6-86ed-b0d3-539c-5fbe1b17f56a\" target=\"_blank\" rel=\"nofollow noopener\"> KB4566782 </a></strong> Aggiornare. </p> <p> Se non riesci a trovare l&#39;aggiornamento KB4566782 nell&#39;elenco degli aggiornamenti installati, controlla e installa tutti gli aggiornamenti disponibili e se il problema persiste, prova a <strong><a href=\"https://www.repairwin.com/how-to-uninstall-updates-in-windows-10/#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> disinstallare gli ultimi aggiornamenti installati. </a></strong></p> <h3> Metodo 2. Riavvia Windows 10 in modalità provvisoria. </h3> <p> 1. Premi il tasto Windows <img src=\"images/image_thumb8_thumb_thumb-268.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo <strong> msconfig </strong> e premi <strong> accedere </strong> . </p> <p><img src=\"images/image_thumb-47-537.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. A <strong> Stivale </strong> scheda selezionare il <strong> Avvio sicuro </strong> opzione, quindi fare clic su <strong> ok </strong> e riavvia il computer. </p> <p><img src=\"images/image_thumb-48-665.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 4. Dopo il riavvio e in modalità provvisoria, controlla se i problemi persistono. <br> 5. Quindi, eseguire nuovamente lo strumento &#39;msconfig&#39; e al <strong> Generale </strong> scheda, controlla il <strong> Avvio normale </strong> e clicca <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-859.png\" alt=\"normal startup windows\" loading=\"lazy\"></p> <p> 6. <strong> Ricomincia </strong> il tuo computer. <br> 7. Dopo il riavvio, controlla se il problema persiste, altrimenti passa al metodo successivo. </p> <p> </p> <h2> Metodo 3. Eseguire un avvio pulito. </h2> <p> 1. Eseguire lo strumento &#39;msconfig&#39;. <br> 2. Nella scheda Servizi, <strong> dai un&#39;occhiata </strong> il <strong> nascondi tutti i servizi Microsoft </strong> casella di controllo e quindi premere <strong> Disabilitare tutto </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-333.png\" alt=\"clean boot windows\" loading=\"lazy\"></p> <p> </p> <p> 3. Quindi selezionare il <strong> Avviare </strong> scheda e fare clic <strong> Apri Gestione attività. <br> </strong> 4. <strong> </strong> Seleziona uno ad uno tutti i programmi elencati e clicca <strong> Disattivare. </strong></p> <p><img src=\"images/image_thumb-1-399.png\" alt=\"clean boot windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Al termine, chiudi la finestra e fai clic su <strong> ok </strong> nell&#39;utility &#39;Configurazione di sistema&#39; per <strong> Ricomincia </strong> il tuo computer. <br> 6. Dopo il riavvio, se il computer funziona correttamente e senza problemi,* quindi apri nuovamente l&#39;utility &#39;Configurazione di sistema&#39; (msconfig) e abilita uno ad uno tutti i programmi disabilitati e riavvia il PC, fino a scoprire quale programma causa il problema. </p> <p> * Nota: se il problema persiste, anche in stato di avvio parziale, passare al metodo successivo. </p> <h3> Metodo 4. Reinstallare e registrare nuovamente tutte le app integrate di Windows 10. </h3> <p> Il prossimo metodo per risolvere i problemi con la barra delle applicazioni, il menu Start, Cortana, ecc. In Windows 10, è reinstallare e registrare nuovamente tutte le app integrate. </p> <p> 1. Aprire PowerShell come amministratore. Fare quello: </p> <blockquote><p> 1. A <strong> Cortana </strong> casella di ricerca di, digitare <strong> powershell <br> </strong> 2. Fare clic con il tasto destro su <strong> Windows PowerShell </strong> risultato e selezionare <strong> Esegui come amministratore. </strong></p></blockquote> <p><img src=\"images/image_thumb-51-691.png\" alt=\"FIX: Windows 10 Start Menu, Settings, Cortana or Taskbar icons Not Working.\" loading=\"lazy\"></p> <p> </p> <p> 3. In PowerShell Digita (copia e incolla) il seguente comando e premi <strong> accedere </strong> : </p> <ul> <li> Get-AppXPackage -AllUsers | Per ogni {Add-AppxPackage -DisableDevelopmentMode -Register &quot;$($_.InstallLocation)\\AppXManifest.xml&quot;} </li> </ul> <p><img src=\"images/image_thumb-2-985.png\" alt=\"register re-install windows 10 apps\" loading=\"lazy\"></p> <p> 4. Attendere l&#39;esecuzione del comando e ignorare gli errori (in lettere rosse). <br> 5. <strong> Ricomincia </strong> il tuo computer e quindi controlla se il problema è stato risolto. </p> <p> </p> <h3> Metodo 5. Crea un nuovo account. </h3> <p> Un altro metodo per risolvere diversi problemi in Windows 10 è creare un nuovo account e trasferire i tuoi file e dati personali sul nuovo account. Fare quello: </p> <p> 1. Apri <strong> Prompt dei comandi come amministratore </strong> . <br> 2. Al prompt dei comandi digitare il seguente comando e premere <strong> accedere </strong> : </p> <ul> <li><strong> password dell&#39;account utente di rete / aggiungi </strong></li> </ul> <p> * Nota: Al comando precedente sostituisci i campi &quot;account&quot; e &quot;password&quot;, con la tua scelta. </p> <p> per esempio. se vuoi creare un nuovo account con username &quot;Admin1&quot; e password &quot;Admin123&quot; digita: <em> utente netto Admin1 Admin123 /add </em></p> <p><img src=\"images/image_thumb-3-388.png\" alt=\"add user windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Quindi procedi e aggiungi il nuovo account, al gruppo Administrators, con questo comando: </p> <ul> <li><strong> net localgroup administrators account /add </strong></li> </ul> <p> per esempio. Nel nostro esempio il comando è: <em> net localgroup amministratori Admin1 /add </em></p> <p><img src=\"images/image_thumb-4-429.png\" alt=\"fix windows 10 start menu, cortana, settings\" loading=\"lazy\"></p> <p> </p> <p> 4. Chiudere la finestra del prompt dei comandi e <strong> ricomincia </strong> il tuo computer. <br> 5. Dopo il riavvio accedi con al nuovo account. <br> 6. Verificare se il problema persiste. Se il problema è stato risolto, trasferisci i tuoi dati e file sul nuovo account e il gioco è fatto. </p> <p> </p> <h3> Metodo 6. Ripara Windows 10. </h3> <p> Il metodo finale per risolvere i problemi di Windows 10 è quello di <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> riparare Windows 10 con l&#39;aggiornamento sul posto </a> . </p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}