{"title":"FIX: Errore di aggiornamento di Windows 10 0XC1900101 – 0x20017. Installazione non riuscita nella fase SAFE_OS durante l&#39;operazione BOOT.","content":"<p> </p><div id=\"body\" class=\"clearfix\"> <div id=\"layout\" class=\"pagewidth clearfix\"> <div id=\"content\" class=\"clearfix\"> <div id=\"loops-wrapper\" class=\"loops-wrapper sidebar1 list-thumb-image\"> <div class=\"post-content\"> <div class=\"entry-content\"> <div id=\"8817bc62-7927-473e-ae46-7000d673a519\" class=\"postBody\"> <p> Questo tutorial contiene le istruzioni per correggere l&#39;errore di aggiornamento di Windows 10 0XC1900101 – 0x20017: &quot;L&#39;installazione non è riuscita nella fase SAFE_OS con un errore durante l&#39;operazione di avvio&quot;. L&#39;errore 0XC1900101 – 0x20017 potrebbe essere visualizzato durante l&#39;aggiornamento di Windows 10 all&#39;ultima build o quando si aggiorna il sistema da Windows 7 o 8 a Windows 10. Quando si verifica l&#39;errore, l&#39;aggiornamento si interrompe e quindi il sistema torna alla versione precedente di Windows. </p> </div> </div> </div> </div> </div> </div> </div>  <p><img src=\"images/image_thumb-68-870.png\" alt=\"fix Windows 10 Update Error 0XC1900101 – 0x20017\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Come risolvere l&#39;errore di aggiornamento di Windows 10 0XC1900101 – 0x20017 &quot;Installazione non riuscita nella fase SAFE_OS con un errore durante l&#39;operazione di avvio&quot; </h4> <p> Di solito, l&#39;errore di aggiornamento 0XC1900101 – 0x20017 in Windows 10 indica un problema con i driver del dispositivo e nella maggior parte dei casi con i driver della scheda di rete. Quindi, prima di continuare ad applicare i metodi seguenti, controlla e prova quanto segue: </p> <p> 1. Prima di tutto, assicurati che le impostazioni di Data e Ora siano corrette. <br> 2. Quindi, assicurati di avere abbastanza spazio libero. Il tuo dispositivo richiede almeno 20 GB di spazio libero per aggiornare un sistema operativo a 32 bit o 32 GB per un sistema operativo a 64 bit. Per liberare spazio su disco usa <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Pulitura disco </a> . <br> 3. Installa i driver più recenti per tutti i dispositivi sul tuo sistema, in particolare per l&#39;adattatore Ethernet e wireless (se presente). * <br> 4. Disinstallare temporaneamente qualsiasi software di sicurezza non Microsoft (Antivirus, Firewall). <br> 5. Disabilitare la crittografia del disco rigido (se abilitata). <br> 6. Dopo il primo riavvio del sistema e prima dell&#39;avvio di Windows: </p> <p> </p><div id=\"body\" class=\"clearfix\"> <div id=\"layout\" class=\"pagewidth clearfix\"> <div id=\"content\" class=\"clearfix\"> <div id=\"loops-wrapper\" class=\"loops-wrapper sidebar1 list-thumb-image\"> <div class=\"post-content\"> <div class=\"entry-content\"> <div id=\"8817bc62-7927-473e-ae46-7000d673a519\" class=\"postBody\"> <blockquote><p> un. Scollegare tutti i dispositivi esterni che non sono necessari durante l&#39;installazione (es. unità USB, stampanti, ecc.). <br> b. Disabilitare il Wireless e l&#39;adattatore Bluetooth dalle impostazioni del BIOS. </p></blockquote> <p><strong> * Nota: </strong> Se dopo aver applicato tutti i suggerimenti di cui sopra e i metodi seguenti, l&#39;installazione di Windows 10 Update continua a non riuscire, procedi e aggiorna anche il BIOS (firmware) sul tuo sistema. </p> </div> </div> </div> </div> </div> </div> </div>  <p> </p> <h6> Metodo 1. <strong> Disabilita l&#39;avvio protetto. </strong></h6> <p> 1. Accendere il sistema e premere il tasto corrispondente* per entrare in <strong> IMPOSTAZIONI DEL BIOS. </strong></p> <p> * Nota: di solito per entrare nel BIOS, devi premere il tasto <strong> DEL </strong> o <strong> F1 </strong> o <strong> F2 </strong> o <strong> F10 </strong> chiave. (dipende dal produttore) </p> <p> 2. Guarda <strong> Sicurezza </strong> o a <strong> Opzioni di avvio </strong> impostazioni,* per trovare il <strong> Avvio sicuro </strong> opzione e <strong> disattivare </strong> è <strong> . </strong></p> <p> * Nota: la posizione dell&#39;impostazione &quot;Avvio protetto&quot; nel BIOS dipende dal produttore del dispositivo. </p> <p> 3. <strong> Salva </strong> impostazioni e <strong> USCITA </strong> Impostazioni del BIOS. <br> 4. Lascia che Windows si avvii normalmente e prova a installare l&#39;aggiornamento. Se l&#39;aggiornamento fallisce di nuovo, passa al metodo successivo. </p> <h6></h6> <h6> Metodo 2. Eseguire lo strumento di risoluzione dei problemi di Windows Update. </h6> <p> Il primo metodo per correggere l&#39;errore di aggiornamento di Windows 10 0XC1900101 – 0x20017 consiste nell&#39;eseguire lo strumento di risoluzione dei problemi di Windows Update. </p> <p> 1. Vai a Windows <strong> Pannello di controllo </strong> , imposta &quot;Visualizza per&quot; su <strong> Piccole icone </strong> e apri <strong> Risoluzione dei problemi. </strong></p> <p><img src=\"images/image_thumb-5-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. In Opzioni di risoluzione dei problemi, fare clic su <strong> Risolvi i problemi con Windows Update. </strong></p> <p><img src=\"images/image_thumb-9-899.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Fare clic su <strong> Il prossimo </strong> per risolvere i problemi di aggiornamento di Windows. </p> <p><img src=\"images/image_thumb-8-236.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Al termine del processo di risoluzione dei problemi, <strong> vicino </strong> lo strumento di risoluzione dei problemi e <strong> ricomincia </strong> il tuo PC. <br> 6. Controlla gli aggiornamenti. </p> <h6></h6> <h6> Metodo 3. <strong> Elimina la cartella SoftwareDistribution. </strong></h6> <p> La &quot;C:\\Windows\\SoftwareDistribution&quot;, è la posizione in cui Windows memorizza gli aggiornamenti di Windows. Molte volte questa cartella viene danneggiata ed è necessario ricrearla per scaricare gli aggiornamenti e installarli da zero. Per ricostruire (ricreare) la cartella &quot;SoftwareDistribution&quot; seguire i passaggi seguenti: </p> <p><strong> Passaggio 1: arresta il servizio Windows Update. </strong></p> <p> 1. Aprire il pannello di controllo dei servizi di Windows: per farlo: </p> <ul> <li> Premi Windows <img src=\"images/image_thumb8_thumb_thumb-515.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. </li> <li> Nella casella Cerca, digita: <strong><em> servizi.msc </em></strong> &amp; clic <strong> ok </strong> . </li> <li> (Accetta l&#39;avviso UAC se appare). </li> </ul> <p><img src=\"images/image_thumb-12-902.png\" alt=\"services\" loading=\"lazy\"></p> <p> 2. Nel pannello di controllo Servizi individuare il <strong><em> aggiornamento Windows </em></strong> servizio. <br> 3. Fare clic con il pulsante destro del mouse su <strong> aggiornamento Windows </strong> servizio e selezionare &quot; <strong> Fermare </strong> ”. </p> <p><img src=\"images/image_thumb-9-281.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Passaggio 2: eliminare la cartella SoftwareDistribution. </strong></p> <p> 1. Apri Esplora risorse e vai a: <strong> C:\\Windows </strong> cartella. <br> 2. Trova e <strong> Elimina </strong> il &quot; <strong><em> SoftwareDistribution </em></strong> ” (o rinominala, ad es. in “SoftwareDistributionOLD”) . </p> <p><img src=\"images/image_thumb-10-498.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p><strong> Passaggio 3: avviare il servizio Windows Update. </strong></p> <p> 1. Aprire il pannello di controllo dei servizi di Windows. <br> 2. Fare clic con il pulsante destro del mouse su <strong> aggiornamento Windows </strong> servizio e selezionare &quot; <strong> Inizio </strong> ”. </p> <p><img src=\"images/image_thumb-11-792.png\" alt=\"start windows update service\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Passaggio 4: verifica e installa l&#39;aggiornamento di Windows 10. </strong></p> <p> 1. Vai a <strong> impostazioni </strong> -&gt; <strong> Aggiornamento e sicurezza </strong> e clicca <strong> Controlla gli aggiornamenti </strong> . </p> <p> </p> <h6> Metodo 4. Disabilitare la tecnologia di virtualizzazione Intel. </h6> <p> In alcuni casi, viene visualizzato l&#39;errore di aggiornamento di Windows 10 0XC1900101 – 0x20017 se Intel Virtual Techonology è abilitata sul sistema. Quindi, procedi e disabilita la tecnologia Intel_VT dalle impostazioni del BIOS. Fare quello: </p> <p> 1. Accedere alle impostazioni del BIOS. <br> 2. <strong> disattivare </strong> il <strong> Intel </strong> <strong> VT-d </strong> caratteristiche in <strong> Avanzate </strong> impostazioni -&gt; <strong> Chipset </strong> . <br> 3. <strong> Salva ed esci </strong> dalle impostazioni del BIOS. <br> 4. Prova a installare l&#39;aggiornamento. </p> <p> </p> <h6> Metodo 5. Ripara Windows 10. </h6> <p> Il metodo finale per risolvere i problemi di installazione di Windows 10 Update è quello di <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> riparare Windows 10 con l&#39;aggiornamento sul posto </a> . </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}