{"title":"FIX: Le schede del foglio Excel mancano nella parte inferiore di una cartella di lavoro. (Risolto)","content":"<p> Alcuni giorni fa, uno dei miei clienti mi ha detto che le schede dei fogli mancano in una delle cartelle di lavoro di Excel. Dopo aver risolto il problema &quot;Schede Excel mancanti&quot; sul suo computer, ho deciso di scrivere un tutorial con i passaggi dettagliati che ho seguito per ripristinare le schede del foglio mancanti dal file Excel. </p> <p><img src=\"images/image_thumb-52-600.png\" alt=\"FIX: Excel Sheets are Missing at the bottom of a Workbook\" loading=\"lazy\"></p> <p> Questo articolo fornisce istruzioni dettagliate per risolvere il problema dei &quot;fogli mancanti&quot; su una cartella di lavoro di Excel. </p> <h4> Come risolvere: schede del foglio di lavoro Excel non visibili. </h4> <p> Se non riesci a vedere le schede in una cartella di lavoro di Excel, prova quanto segue: </p> <h6> Metodo 1. Disporre tutte le finestre della cartella di lavoro attiva. </h6> <p> 1. Vai a <strong> Visualizza </strong> scheda e fare clic su <strong> Disponi tutto. </strong></p> <p><img src=\"images/image_thumb-47-872.png\" alt=\"Fix missing excel tabs\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Seleziona <strong> piastrellato </strong> e <strong> Finestre della cartella di lavoro attiva </strong> e clicca <strong> OK. </strong></p> <p><img src=\"images/image_thumb-48-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Se vedi le schede mancanti, fai clic su <strong> Salva </strong> per salvare la vista corrente, altrimenti continua sotto. </p> <p> </p> <h6> Metodo 2. Rivela i fogli di lavoro Excel nascosti. </h6> <p> 1. Per rivelare i fogli di lavoro Excel nascosti, posiziona il mouse sul <strong> 3 punti </strong><img src=\"images/image_thumb-41-979.png\" alt=\"image\" loading=\"lazy\"> nella barra in basso finché non vedi il <strong> freccia a doppia punta </strong><img src=\"images/image_thumb-42-990.png\" alt=\"image\" loading=\"lazy\"> . </p> <p><img src=\"images/image_thumb-49-473.png\" alt=\"reveal hidden sheets excel\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Clic </strong> sulla freccia a due punte <img src=\"images/image_thumb-44-186.png\" alt=\"image\" loading=\"lazy\"> e <strong> trascina il mouse verso destra </strong> finché non vedi tutte le schede della cartella di lavoro di Excel. </p> <p><img src=\"images/image_thumb-50-847.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Se le schede nascoste sono di nuovo visibili, fare clic su <strong> Salva </strong> per salvare questa visualizzazione, altro altrimenti continuare di seguito. </p> <p> </p> <h6> Metodo 3. Attiva l&#39;opzione &quot;Mostra schede foglio&quot;. </h6> <p> Se i fogli Excel non sono visibili dopo aver applicato quanto sopra, controlla l&#39;impostazione &quot;Mostra schede foglio&quot; nelle opzioni di Excel. Fare quello: </p> <p> 1. Vai a <strong> File </strong> menu e selezionare <strong> Opzioni </strong> . </p> <p> 2. Selezionare il <strong> Avanzate </strong> scheda a sinistra e a destra, sotto il <b> Visualizza le opzioni per questa cartella di lavoro, controlla </b> il <b> Mostra le schede dei fogli </b> casella e fare clic <strong> OK. </strong></p> <p><img src=\"images/image_thumb-51-664.png\" alt=\"show sheet tabs excel\" loading=\"lazy\"></p> <p> 3. Fare clic su <strong> Salva </strong> per salvare questa visualizzazione. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo. </p>"}