{"title":"FIX: L&#39;esecuzione degli script è disabilitata su questo sistema in Windows 10 (risolto)","content":"<p> Se stai cercando di eseguire uno script in Windows 10 PowerShell e ricevi il messaggio di errore &quot;Impossibile caricare perché l&#39;esecuzione degli script è disabilitata su questo sistema&quot;, continua a leggere di seguito per risolvere il problema. </p> <p><img src=\"images/image_thumb-8-134.png\" alt=\"FIX: script cannot be loaded because is disabled on Windows 10\" loading=\"lazy\"></p> <p> </p> <h2> Come risolvere: impossibile eseguire lo script di PowerShell perché i criteri di sicurezza impediscono l&#39;esecuzione degli script in Windows 10. </h2> <p> L&#39;errore di PowerShell &quot;Impossibile caricare %ScriptName%.ps1 perché è disabilitato su questo sistema&quot; viene visualizzato a causa di un criterio di sicurezza che impedisce l&#39;esecuzione degli script. Per rimuovere la restrizione e abilitare l&#39;esecuzione di script in Windows 10, procedi come segue: </p> <p> 1. Apri <strong> PowerShell come amministratore </strong> . Fare quello: </p> <blockquote><p> 1. Premere il tasto <strong> finestre <img src=\"images/image_thumb-97-958.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> tasti per aprire la casella di comando &#39;Esegui&#39; <strong><br> </strong> 2. Tipo <strong> powershell </strong> e poi premere <strong> CTRL </strong> + <strong> CAMBIO </strong> + <strong> ACCEDERE. </strong></p></blockquote> <p><img src=\"images/image_thumb-41-395.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. In PowerShell copia/incolla il comando seguente e premi <strong> accedere </strong> : </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Unrestricted </li> </ul> <p> 3. Premere <strong> sì </strong> e colpisci <strong> accedere </strong> al messaggio di avviso della politica di esecuzione per accettare la modifica.. </p> <p><img src=\"images/image_thumb-9-581.png\" alt=\"Enable Running Scripts on Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Una volta completata la modifica della politica, <strong> vicino </strong> la finestra di PowerShell. </p> <p> 5. Ora, esegui lo script che ti ha dato l&#39;errore &quot;Gli script sono disabilitati&quot; con <strong> amministratore </strong> privilegi. L&#39;errore dovrebbe essere sparito ora. * </p> <blockquote><p> * Nota: se ricevi ancora l&#39;errore &quot;Gli script sono disabilitati su questo sistema&quot;, dai uno dei seguenti comandi e riprova a eseguire lo script: </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy RemoteSigned </li> <li> set-executionpolicy remotesigned </li> </ul> </blockquote> <p> 6. Infine, torna alla precedente impostazione dei criteri di esecuzione di PowerShell (restrizione), eseguendo questo comando in PowerShell (amministratore): * </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Restricted </li> </ul> <p> * Nota: dopo aver eseguito il comando sopra, riceverai un messaggio di avviso che spiega i rischi per la sicurezza di una modifica della politica di esecuzione. stampa <strong> sì </strong> , quindi premere <strong> accedere </strong> per accettare la modifica e ripristinare l&#39;impostazione dei criteri precedente. </p> <p><img src=\"images/image_thumb-10-246.png\" alt=\"Disable running scripts windows 10\" loading=\"lazy\"></p> <p> 7. Chiudi la finestra di PowerShell e il gioco è fatto! </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}