{"title":"FIX: Questo sito non può essere raggiunto in Chrome (risolto)","content":"<p> Questo tutorial contiene le istruzioni per correggere l&#39;errore di Chrome: &quot;Impossibile raggiungere questo sito&quot;. L&#39;errore &quot;Questo sito non può essere raggiunto&quot; in Chrome, significa che il tuo browser non riesce a stabilire una connessione con il sito web a cui tenti di accedere, perché la tua connessione Internet è persa o perché il sito a cui vuoi accedere non esiste. </p> <p> </p> <p><img src=\"images/image_thumb-14-568.png\" alt=\"FIX: This site can't be reached in Chrome \" loading=\"lazy\"></p> <p> Per risolvere l&#39;errore di Chrome &quot;Impossibile raggiungere questo sito&quot;, segui le istruzioni riportate di seguito: </p> <h4> Come correggere l&#39;errore di Google Chrome: questo sito non può essere raggiunto. </h4> <p><strong> Consigli: </strong> Prima di procedere con i metodi seguenti, applicare questi passaggi: <br> 1. Assicurati di aver digitato correttamente l&#39;indirizzo del sito web. <br> 2. Riavvia il tuo router Internet. <br> 3. Prova a visitare altri siti Web, per assicurarti che la tua connessione Internet funzioni. <br> 4. Se possiedi un altro computer/dispositivo al tuo posto, prova a visitare il sito web in cui ricevi l&#39;errore &quot;Questo sito non può essere raggiunto&quot;, per assicurarti che il sito che stai cercando di visitare non sia bloccato dal tuo ISP. <br> 5. Se hai impostato una connessione VPN, disconnettiti da essa. </p> <p> </p> <h6> Metodo 1. Modificare le impostazioni DNS. </h6> <p> Il metodo successivo per risolvere l&#39;errore di Google Chrome &quot;Impossibile raggiungere questo sito&quot; è modificare le impostazioni DNS e utilizzare i server DNS pubblici di Google. Fare quello: </p> <p> 1. <strong> Fare clic con il tasto destro </strong> sull&#39;icona Rete attiva nella barra delle applicazioni (o vai al Pannello di controllo di Windows) e fai clic su <strong> Centro connessioni di rete e condivisione </strong></p> <p><img src=\"images/image_thumb14_thumb-1-913.png\" alt=\"image_thumb[14]\" loading=\"lazy\"></p> <p> </p> <p> 2. Selezionare la scheda di rete attiva e quindi fare clic su <strong> Modifica le opzioni dell&#39;adattatore. </strong></p> <p><img src=\"images/image_thumb17_thumb-1-994.png\" alt=\"FIX CHROME ERR_CONNECTION_CLOSED\" loading=\"lazy\"></p> <p> 3. Fare clic con il pulsante destro del mouse sull&#39;adattatore di rete attivo e selezionare <strong> Proprietà </strong> . <br> 4. Selezionare il <strong> &#39;Protocollo Internet versione 4 (TCP/IPv4) </strong> &#39; e clicca <strong> Proprietà </strong></p> <p><img src=\"images/image_thumb18_thumb-1-801.png\" alt=\"image_thumb[18]\" loading=\"lazy\"></p> <p> 5a. Controlla il &quot; <strong> Utilizza i seguenti indirizzi del server DNS: </strong> &quot;pulsante di opzione. <br> 5b. Digita i seguenti indirizzi dei server DNS (server DNS pubblici di Google) e fai clic su <strong> OK. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> <p><img src=\"images/image_thumb20_thumb-1-963.png\" alt=\"image_thumb[20]\" loading=\"lazy\"></p> <p> 6. <strong> Ricomincia </strong> il tuo computer. </p> <p> </p> <h6> Metodo 2. Ripristina impostazioni TCP/IP e WINSOCK. </h6> <p> 1. Aprire il prompt dei comandi in modalità amministrativa. Fare quello: </p> <blockquote><p> 1. Nella casella di ricerca, digitare <strong> cmd </strong> o <strong> prompt dei comandi </strong></p> <p> 2. Fare clic con il tasto destro su <strong> Prompt dei comandi </strong> risultato e selezionare <strong> Esegui come amministratore. </strong></p></blockquote> <p><img src=\"images/image_thumb-38-528.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Nel prompt dei comandi, digita il seguente comando e premi <strong> accedere </strong> . </p> <ul> <li> ipconfig /release </li> </ul> <p><img src=\"images/image_thumb11_thumb-364.png\" alt=\"image_thumb[11]\" loading=\"lazy\"></p> <p> </p> <p> 3. Ora digita i seguenti comandi in ordine (premi <strong> accedere </strong> dopo ogni comando).: </p> <ul> <li> ipconfig /flushdns </li> <li> ipconfig /renew </li> <li> netsh winsock reset </li> </ul> <p><img src=\"images/image_thumb12_thumb-449.png\" alt=\"image_thumb[12]\" loading=\"lazy\"></p> <p> 3. <strong> Ricomincia </strong> il tuo computer. </p> <p> </p> <h6> Metodo 3. Ripristina le impostazioni di Chrome. </h6> <p> Per ripristinare le impostazioni predefinite di Chrome: </p> <p> 1. Fare clic sul menu di Chrome <img src=\"images/image_thumb_thumb_thumb_thumb-979.png\" alt=\"image_thumb_thumb_thumb\" loading=\"lazy\"> icona nell&#39;angolo in alto a destra) e scegli <strong> impostazioni </strong> . </p> <p><img src=\"images/image_thumb31-186.png\" alt=\"chrome-options\" loading=\"lazy\"></p> <p> 2. A <strong> impostazioni </strong> pagina, scorrere verso il basso e fare clic su <strong> Mostra impostazioni avanzate. </strong></p> <p><img src=\"images/image_thumb2_thumb-809.png\" alt=\"FIX ERR_CONNECTION_CLOSED CHROME\" loading=\"lazy\"></p> <p> </p> <p> 3. Alla fine della pagina, fare clic su <strong> Ripristina le impostazioni ai valori predefiniti originali </strong> . </p> <p><img src=\"images/image_thumb5_thumb-192.png\" alt=\"image_thumb[5]\" loading=\"lazy\"></p> <p> 4. Infine clicca <strong> Ripristina le impostazioni </strong> . </p> <p><img src=\"images/image_thumb6_thumb-812.png\" alt=\"CHROME ERR_CONNECTION_CLOSED - FIX\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Ricomincia </strong> Cromo. </p> <p> </p> <h6> Metodo 4. Scansiona il tuo computer alla ricerca di malware e virus. </h6> <p> L&#39;ultimo metodo per correggere l&#39;errore &quot;Impossibile raggiungere questo sito&quot; in Chrome consiste nell&#39;assicurarsi che il sistema sia privo di virus/malware. Per questo compito segui le istruzioni in questa guida: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Come eseguire la scansione del computer alla ricerca di virus e altri programmi dannosi. </a></p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}