{"title":"FIX: Scarica batteria in Windows 10 (risolto)","content":"<p> Con Windows 10, molti utenti si lamentano del fatto che la batteria del laptop si scarica rapidamente anche con un utilizzo ridotto o addirittura con lo spegnimento completo. Questo problema di &quot;esaurimento della batteria&quot; in Windows 10 si verifica per due motivi fondamentali. Il primo motivo è che Windows 10 carica troppe applicazioni in background che consumano la batteria anche se non vengono utilizzate. </p> <p> Il motivo successivo, che causa il consumo della batteria, anche in caso di spegnimento completo, è la funzione &quot;Avvio rapido&quot;. Windows 10 (e Windows 8/8.1) ha abilitato per impostazione predefinita la funzione &quot;Avvio rapido&quot;, che consente al sistema di avviarsi e avviarsi più velocemente. Infatti, quando l&#39;&quot;Avvio rapido&quot; è abilitato, Windows 10 non esegue l&#39;arresto completo del sistema e riprende da uno stato di ibernazione. </p> <p> In questo tutorial troverai le istruzioni per evitare che Windows 10 scarichi la batteria. </p> <h4> Come RISOLVERE il problema di esaurimento della batteria in Windows 10. </h4> <p> </p> <h6> Passaggio 1. Impedisci l&#39;esecuzione delle app in background. </h6> <p> Il primo passo, per risolvere il problema di esaurimento della batteria in Windows 10, è evitare che le app vengano eseguite in background. Per disabilitare le app in background: </p> <p> 1. Vai a <strong> Inizio </strong> -&gt; <strong> impostazioni </strong> -&gt; <strong> Privacy </strong> . <br> 2. Seleziona <strong> App in background </strong> a sinistra, e poi a destra, metti il ​​&quot; <strong> Consenti alle app di funzionare in background&quot; </strong> passa a <strong> spento, </strong> oppure scegli singolarmente le app che non desideri eseguire in background e disattivale. </p> <p><img src=\"images/image_thumb-8-676.png\" alt=\"Prevent Apps from Running in the Background - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Passaggio 2. Attiva il risparmio energetico. </h6> <p> Il passaggio successivo consiste nell&#39;abilitare il risparmio batteria per prolungare la durata della batteria limitando l&#39;attività in background. </p> <p> 1. Vai a <strong> Inizio </strong> -&gt; <strong> impostazioni </strong> -&gt; <strong> Sistema </strong> . <br> 2. A <strong> Batteria </strong> opzioni: </p> <blockquote> <p> un. Fai clic su &quot;Vedi quali app stanno influenzando la durata della batteria&quot;, per scoprire l&#39;utilizzo della batteria dalle app aperte. <br> b. <strong> Dai un&#39;occhiata </strong> il &quot; <strong> Attiva automaticamente il risparmio batteria se la batteria si scarica sotto&quot; </strong> casella di controllo e sposta il cursore in una posizione adatta. <br> c. Inoltre, seleziona &quot;Riduci la luminosità dello schermo durante il risparmio energetico. </p> </blockquote> <p><img src=\"images/image_thumb-9-289.png\" alt=\"turn on battery saver Windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Passaggio 3. Disabilita l&#39;avvio rapido. </h6> <p> Il passaggio successivo consiste nel forzare lo spegnimento completo di Windows 10, disabilitando la funzione di avvio rapido. </p> <p> 1. Vai a <strong> Inizio </strong> -&gt; <strong> impostazioni </strong> -&gt; <strong> Sistema </strong> . <br> 2. A <strong> Energia </strong> fare clic su opzioni <strong> Impostazioni di potenza aggiuntive. </strong></p> <p><img src=\"images/image_thumb-10-405.png\" alt=\"FIX Battery Drain in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Seleziona <strong> Scegli cosa fanno i pulsanti di accensione </strong> a sinistra. </p> <p><img src=\"images/image_thumb-11-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Quindi fare clic su <strong> Modifica le impostazioni attualmente non disponibili </strong> . </p> <p><img src=\"images/image_thumb-12-235.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> Deseleziona </strong> il <strong> Attiva avvio rapido (consigliato) </strong> opzione e fare clic <strong> Salvare le modifiche. * </strong></p> <p> * Nota: se l&#39;opzione di avvio rapido era già deselezionata, selezionala e riavvia il computer. Dopo il riavvio, deselezionalo e riavvia nuovamente il computer. </p> <p><img src=\"images/image_thumb-13-410.png\" alt=\"Turn Off Fast Startup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Ricomincia </strong> il tuo computer. </p> <h6></h6> <h6> Passaggio 4. Disabilita l&#39;ibernazione. </h6> <p> &quot;Ibernazione&quot; è una funzione di alimentazione, che utilizza meno energia rispetto alla sospensione e quando si riavvia il PC, si torna da dove si era interrotto. In alcuni casi, la funzione di ibernazione fa sì che il tuo PC Windows 10 non si spenga completamente. Per disabilitare l&#39;ibernazione: </p> <p> </p> <p> 1. Nella casella di ricerca digita: <strong> prompt dei comandi </strong> o <strong> cmd <br> </strong> 2. Fai clic con il pulsante destro del mouse su <strong> Prompt dei comandi e seleziona Esegui come amministratore </strong></p> <p><img src=\"images/image_thumb-14-379.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Al prompt dei comandi dare il seguente comando e premere <strong> Accedere. </strong></p> <ul> <li><strong> powercfg -h spento </strong></li> </ul> <p><img src=\"images/image_thumb-15-234.png\" alt=\"Disable Hibernate Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. <strong> Ricomincia </strong> il tuo computer. * </p> <p> * Nota: se desideri riattivare la funzione &quot;Ibernazione&quot;, digita questo comando nel prompt dei comandi amministrativo: </p> <ul> <li> <ul> <li> powercfg -h spento </li> </ul> </li> </ul> <p> </p> <h6> Passaggio 5. Modificare le impostazioni di alimentazione sull&#39;adattatore di rete. </h6> <p> Il prossimo metodo per risolvere il problema di esaurimento della batteria in Windows 10 è modificare le impostazioni di alimentazione sugli adattatori di rete. </p> <p> 1. Apri <strong> Gestore dispositivi </strong> . <br> 2. Espandi <strong> Adattatori di rete </strong> . <br> 3. Fare clic con il pulsante destro del mouse sull&#39;adattatore di rete installato e selezionare <strong> Proprietà </strong> . <br> 3. Selezionare il <strong> Gestione energetica </strong> scheda. <br> 4. <strong> Deseleziona </strong> il <strong> &#39;Consenti a questo dispositivo di riattivare il computer </strong> &#39; spunta la casella e clicca <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-7-574.png\" alt=\"modify power settings\" loading=\"lazy\"></p> <h6></h6> <h6> Passaggio 6. Eseguire il rollback del driver dell&#39;interfaccia del motore di gestione Intel. </h6> <p> Se il problema di esaurimento della batteria viene visualizzato dopo l&#39;installazione di un aggiornamento di Windows 10, procedere e ripristinare il driver per Intel Management Engine Interface. Fare quello: </p> <p> 1.  Premi Finestre <img src=\"images/image_thumb8_thumb_thumb-592.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo: <strong> devmgmt.msc </strong> &amp; clic <strong> ok </strong> . <br> 3. Espandi <strong> Dispositivi di sistema </strong> . <br> 4. Fare clic con il tasto destro su <strong> Interfaccia del motore di gestione Intel </strong> e seleziona <strong> Proprietà </strong> . </p> <p><img src=\"images/image_thumb-5-532.png\" alt=\"device properties\" loading=\"lazy\"></p> <p> </p> <p> 5. Selezionare la scheda Driver e fare clic su <strong> Ripristina driver </strong> . * </p> <p> </p> <p> * Se la <strong> Ripristina driver </strong> è disattivato, quindi accedere al sito di supporto del produttore del laptop o della scheda madre per scaricare e installare una versione precedente del driver per Intel Management Engine Interface. </p> <p><img src=\"images/image_thumb-6-551.png\" alt=\"roll back driver\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Ricomincia </strong> il tuo computer. </p> <h6> Passaggio 7. Altri suggerimenti per risolvere il problema di esaurimento della batteria. </h6> <p> 1. Sostituisci il caricabatterie del laptop e usa sempre un caricabatterie di marca, per prolungare la durata della batteria. <br> 2. Se la batteria del tuo laptop è vecchia, probabilmente la sua capacità è diminuita e dovrebbe essere sostituita. Per diagnosticare lo stato di salute della batteria, utilizzare il <a href=\"http://www.nirsoft.net/utils/battery_information_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> BatteryInfoView </a> utilità. </p> <p><img src=\"images/image_thumb-16-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo problema. </p>"}