{"title":"FIX: Sembra che tu abbia avviato un aggiornamento e avviato dal supporto di installazione (risolto)","content":"<p> Il seguente problema potrebbe verificarsi se si tenta di eseguire un&#39;installazione pulita o un aggiornamento di riparazione di Windows 10 da un supporto di installazione: &quot;Sembra che tu abbia avviato un aggiornamento e avviato dal supporto di installazione. Se desideri continuare con l&#39;aggiornamento, rimuovi il media dal PC e fare clic su Sì. Se invece si desidera eseguire un&#39;installazione pulita, fare clic su No&quot;. </p> <p><img src=\"images/image_thumb-36-818.png\" alt=\"FIX: It looks like you started an upgrade and booted from installation media \" loading=\"lazy\"></p> <p> </p> <p> Il messaggio di errore sopra riportato indica che hai interrotto l&#39;aggiornamento di Windows 10 una volta avviato. Come indica il messaggio, se si desidera eseguire un&#39;installazione pulita di Windows 10, è necessario selezionare &quot;No&quot; per continuare, altrimenti rimuovere il supporto di installazione e fare clic su &quot;Sì&quot; per continuare l&#39;aggiornamento di Windows 10. </p> <p> In generale, il messaggio sopra non è un problema, ma diventa un grosso problema se l&#39;aggiornamento di Windows non si installa o se Windows 10 si blocca in loop dopo aver provato a installare gli aggiornamenti e si desidera riparare Windows 10 avviando da un&#39;installazione media. </p> <p> In questo tutorial troverai istruzioni dettagliate su come ignorare il messaggio &quot;Sembra che tu abbia avviato un aggiornamento e avviato dal supporto di installazione&quot;, annullando il processo di aggiornamento di Windows 10 attualmente in esecuzione, al fine di eseguire una riparazione di Windows 10 aggiornamento dal supporto di installazione. </p> <h4> Come annullare l&#39;aggiornamento di Windows 10 in corso se Windows non può essere avviato * </h4> <p><strong> * Importante: </strong> Se puoi avviare Windows 10, ma non puoi installare l&#39;aggiornamento dall&#39;ambiente Windows, applica prima le seguenti azioni: </p> <blockquote><p> 1. Vai a <strong> Inizio </strong> &gt; <strong> impostazioni </strong> &gt; <strong> Aggiornamento e sicurezza </strong> e fai clic su &quot;Riavvia ora&quot;, per avviare il processo di aggiornamento. <br> 2. Dopo il primo riavvio, lascia l&#39;avanzamento &quot;Lavorare sugli aggiornamenti&quot; per passare all&#39;1-2%. <br> 3. Al termine, premere il tasto <strong> Energia </strong> per 10-15 secondi, per spegnere completamente il PC. <br> 4. Collegare il supporto di installazione di Windows e accendere il PC. <br> 5. Seguire gli altri passaggi di seguito per annullare l&#39;aggiornamento in corso. </p></blockquote> <p> </p> <h6> Passaggio 1. Annulla le azioni in sospeso di Windows Update. </h6> <p> 1. Avviare il sistema da un supporto di installazione di Windows. <br> 2. Quando viene visualizzato il messaggio &quot;Sembra che tu abbia avviato un aggiornamento e avviato dal supporto di installazione...&quot;, premi il tasto <strong> CAMBIO </strong> + <strong> F10 </strong> tasti per avviare il prompt dei comandi. </p> <p><img src=\"images/image_thumb-37-729.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Al prompt dei comandi, ottieni un elenco di tutte le unità, sul tuo sistema con questo comando: </p> <ul> <li><strong> wmic disco logico ottenere il nome </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-991.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> </p> <p> 4. Quindi scopri quale unità contiene la cartella &quot;Windows&quot;, digitando questo comando: * </p> <p> </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * per esempio. Per vedere il contenuto dell&#39;unità C:, digitare: &quot; <strong> dir C: </strong> &quot; (senza virgolette). Se non è possibile visualizzare la cartella &quot;Windows&quot; sull&#39;unità C:, passare alla lettera successiva dell&#39;unità (ad es. &quot;dir D:&quot;, &quot;dir E:&quot;, ecc.), finché non viene visualizzata la Cartella &quot;Windows&quot; su una delle unità elencate (dal comando sopra). </p> <p> es.: Come puoi vedere nello screenshot qui sotto, la cartella Windows (in questo esempio) si trova in at <strong> D </strong> : guidare.] </p> <p><img src=\"images/image_thumb-69-578.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Una volta individuata l&#39;unità su quale unità si trova l&#39;unità &quot;Windows&quot; (ad esempio nell&#39;unità &quot;D:&quot; in questo esempio), accedere a tale unità digitando DriveLetter <strong> : </strong> + <strong> accedere </strong> . </p> <p> 6. Quindi creare una cartella scratch sull&#39;unità Windows digitando questo comando: </p> <p> </p> <ul> <li><strong> mkdir D:\\Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-229.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Quindi dai il comando seguente per ripristinare le azioni in sospeso dell&#39;aggiornamento in corso: </p> <ul> <li><strong> DISM /Image:D:\\ /ScratchDir:D:\\Scratch /Cleanup-Image /RevertPendingActions </strong></li> </ul> <p> * Nota: cambia la lettera dell&#39;unità <strong> D </strong> secondo il tuo caso. </p> <p> 8. Una volta eseguito il comando DISM precedente, dovresti ricevere il seguente messaggio sullo schermo: </p> <p> &quot; <em> Ripristino delle azioni in sospeso dall&#39;immagine…. <br> L&#39;operazione è stata completata. Il ripristino delle azioni in sospeso verrà tentato dopo il riavvio. <br> L&#39;operazione è stata completata con successo.&quot; </em></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"DISM - RevertPendingActions\" loading=\"lazy\"></p> <p> </p> <p> 9. Chiudere la finestra del prompt dei comandi, rimuovere il supporto di installazione e consentire a Windows di avviarsi normalmente. </p> <p> 10. Dopo il riavvio, dovresti vedere il seguente messaggio sullo schermo: &quot;Annullamento delle modifiche apportate al computer&quot;. Al termine di questo processo, Windows dovrebbe avviarsi normalmente. </p> <p><img src=\"images/image_thumb-39-836.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Passaggio 2. Rimuovere i file di aggiornamento con Pulizia disco. </h6> <p> Dopo l&#39;avvio in Windows 10, è necessario preparare Windows 10 per la riparazione/l&#39;aggiornamento USB, eliminando gli aggiornamenti già scaricati con lo strumento Pulitura disco. Fare quello: </p> <p> 1. Apri Esplora file, fai clic con il pulsante destro del mouse sull&#39;unità C: e seleziona <strong> Proprietà </strong> . <br> 2. Fare clic su <strong> Pulitura disco </strong> pulsante. </p> <p><img src=\"images/image_thumb_thumb-190.png\" alt=\"Disk cleanup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Quindi fare clic su <strong> Pulisci i file di sistema </strong> . </p> <p><img src=\"images/image_thumb-40-950.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Ora controlla di rimuovere i seguenti file e fai clic su <strong> ok </strong> : </p> <ul> <li> <ul> <li> <ul> <li> Pulizia di Windows Update. </li> <li> Antivirus Windows Defender. </li> <li> File di programma scaricati. </li> <li> File temporanei di Internet. </li> <li> Precedenti installazioni di Windows. </li> <li> Cestino. </li> <li> File temporanei. </li> <li> File temporanei di installazione di Windows </li> </ul> </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-41-458.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Quando richiesto, <strong> Cancella file </strong> . </p> <p><img src=\"images/image_thumb-42-931.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Al termine della pulizia, chiudere le proprietà del disco e continuare con il passaggio successivo. </p> <p> </p> <h6> Passaggio 3. Elimina la cartella &quot;SoftwareDistribution&quot;. </h6> <p> Il &quot;C:\\Windows\\ <strong> SoftwareDistribution </strong> &quot;, è la posizione in cui Windows memorizza gli aggiornamenti di Windows. Molte volte, questa cartella viene danneggiata e devi ricrearla per scaricare nuovamente gli aggiornamenti da zero. Quindi, procedi come segue: </p> <p><strong> 1. Arrestare il servizio Windows Update: </strong> Fare quello: </p> <blockquote><p> un. Premi Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> b. Nella casella Cerca, digita: <strong><em> servizi.msc </em></strong> &amp; clic <strong> ok </strong> . </p></blockquote> <p><img src=\"images/image_thumb-12-264.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> c. Nel pannello di controllo dei servizi individuare il &quot; <strong> Aggiornamento Windows&quot; </strong> servizio. <br> d. Fare clic con il tasto destro su <strong> aggiornamento Windows </strong> servizio e selezionare &quot; <strong> Fermare </strong> &quot;. </p></blockquote> <p><img src=\"images/image_thumb-9-434.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. Eliminare la cartella SoftwareDistribution. </strong></p> <blockquote><p> un. Apri Esplora risorse e vai a: <strong> C:\\Windows </strong> cartella. <br> b. Trova e <strong> Elimina </strong> il &quot; <strong><em> SoftwareDistribution </em></strong> &quot; (o rinominala, ad es. in &quot;SoftwareDistributionOLD&quot;) . </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-10-140.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Riavvia il tuo computer </strong> per applicare le modifiche. </p> <p> </p> <h6> Passaggio 4. Aggiorna Windows 10 dal supporto di installazione. </h6> <p> Ora sei pronto per riparare e aggiornare Windows 10 da un supporto di installazione. Fare quello: </p> <p> 1. <strong> Riavvia </strong> il tuo computer e <strong> stivale </strong> da Windows USB (o DVD) <strong> supporti di installazione </strong> . <br> 2. Nella procedura guidata di installazione di Windows, premere <strong> Il prossimo </strong> e quindi fare clic su <strong> Installa ora </strong> . <br> 3. <strong> Accettare </strong> il &quot;contratto di licenza&quot;. <br> 4. Quando richiesto, seleziona Aggiorna <strong> : installa Windows e conserva file, impostazioni e applicazioni </strong> . </p> <blockquote><p><img src=\"images/image_thumb8_thumb-241.png\" alt=\"image_thumb8\" loading=\"lazy\"></p></blockquote> <p> 5. Quindi segui le istruzioni sullo schermo per aggiornare Windows 10. </p> <p> È tutto gente! Ha funzionato per te? Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}