{"title":"FIX: HP Smart Error – Stato della stampante sconosciuto (risolto)","content":"<p> Questo tutorial contiene le istruzioni per risolvere il <a href=\"https://www.hpsmart.com/us/en\" target=\"_blank\" rel=\"nofollow noopener\"> HP Smart </a> errore dell&#39;app &quot;Stato stampante sconosciuto&quot; sul sistema operativo Windows 10. Lo &quot;Stato stampante sconosciuto&quot; sull&#39;applicazione HP SMART può apparire per motivi sconosciuti e impedisce all&#39;utente di utilizzare la funzione Scansione o Stampa sulla stampante. </p> <p> Problema in dettaglio: su un computer Windows 10 con una stampante HP installata, l&#39;errore &quot;Stato stampante sconosciuto&quot; viene visualizzato nell&#39;app HP Smart, nonostante la stampante stampi senza problemi dal Web o da altre applicazioni. Il problema principale di questo errore è che l&#39;utente non può utilizzare l&#39;opzione SCANSIONE nell&#39;applicazione HP Smart per eseguire la scansione di un documento. </p> <p> </p> <p> </p> <p><img src=\"images/image_thumb-23-787.png\" alt=\"FIX: HP Smart \" printer status unknown loading=\"lazy\"></p> <h4> FIX: &quot;Stato stampante sconosciuto&quot; su HP Smart App. (Windows 10). </h4> <p> 1. Dal menu Start <img src=\"images/image_thumb2_thumb_thumb-697.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> fare clic su Impostazioni <img src=\"images/image_thumb-66-822.png\" alt=\"image\" loading=\"lazy\"> e poi apri <strong> App </strong> . </p> <p><img src=\"images/image_thumb-25-257.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Fare clic su <strong> Applicazione HP Smart </strong> e quindi fare clic su <strong> Opzioni avanzate </strong> . </p> <p><img src=\"images/image_thumb-26-912.png\" alt=\"FIX: Printer Status unknown on HP Smart app\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Fare clic su <strong> Ripristina </strong> pulsante. </p> <p><img src=\"images/image_thumb-27-494.png\" alt=\"Fix Printer Status Unknow on HP Smart app\" loading=\"lazy\"></p> <p> 4. Una volta completato il ripristino, chiudere tutte le finestre e aprire il <strong> HP Smart </strong> app. <br> 5. Normalmente l&#39;errore &quot;Stato stampante sconosciuto&quot; dovrebbe essere risolto. Basta fare clic su <strong> Impostare </strong> pulsante per abilitare tutte le funzionalità HP Smart e il gioco è fatto! * </p> <p><img src=\"images/image_thumb-28-849.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Nota: se l&#39;errore HP Smart &quot;Stato stampante sconosciuto&quot; persiste, provare quanto segue: </p> <blockquote><p> 1. <strong> Spegnimento </strong> il computer. <br> 2. <strong> Disconnetti </strong> il <strong> cavo di alimentazione dalla stampante </strong> per 1 minuto. <br> 3. Dopo 1 minuto, <strong> accensione </strong> il tuo <strong> computer </strong> . <br> 4. Dopo aver avviato Windows 10, <strong> ricollegare il cavo di alimentazione della stampante </strong> e controlla se l&#39;errore &quot;Stato stampante sconosciuto&quot; sull&#39;app HP Smart è stato risolto. Se l&#39;errore persiste, disinstallare e reinstallare la stampante e il software della stampante sul PC. </p></blockquote> <p> È tutto gente! Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}