{"title":"FIX: Errore 0x80248007 nell&#39;aggiornamento di Windows 10 (risolto)","content":"<p> Su un computer basato su Windows 10, potresti ricevere il seguente messaggio di errore quando tenti di installare gli aggiornamenti: &quot;Si sono verificati alcuni problemi durante l&#39;installazione degli aggiornamenti, ma riproveremo più tardi. Se continui a visualizzare questo messaggio e desideri eseguire ricerche sul Web o contattare l&#39;assistenza per ottenere informazioni, potrebbe essere utile: (0x80248007)&quot;. L&#39;errore di aggiornamento di Windows 10 0x80248007 viene visualizzato comunemente se i file di Windows Update sono danneggiati o se Windows non può ricevere aggiornamenti a causa della rete problemi. </p> <p><img src=\"images/image_thumb-14-418.png\" alt=\"FIX Error 0x80248007 in Windows 10 Update \" loading=\"lazy\"></p> <p> </p> <p> Questo tutorial contiene le istruzioni per risolvere l&#39;errore 0x80248007 durante l&#39;installazione degli aggiornamenti in Windows 10. </p> <h4> Come risolvere l&#39;errore 0x80248007 nell&#39;aggiornamento di Windows 10. </h4> <h6> Passaggio 1. Scansiona il tuo computer alla ricerca di virus. </h6> <p><strong> Importante: </strong> Molti virus o programmi dannosi possono causare problemi con l&#39;aggiornamento di Windows. Quindi, prima di continuare con i passaggi per la risoluzione dei problemi di seguito, usa questo <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Guida alla scansione e alla rimozione di malware </a> per controllare e rimuovere virus e/o programmi dannosi che potrebbero essere in esecuzione sul tuo computer. </p> <p> </p> <h6> Passaggio 2. Esegui lo strumento di risoluzione dei problemi di Windows Update. </h6> <p> 1. Vai a Windows <strong> Pannello di controllo </strong> , imposta &quot;Visualizza per&quot; su <strong> Piccole icone </strong> e apri <strong> Risoluzione dei problemi. </strong></p> <p><img src=\"images/image_thumb-5-564.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. In Opzioni di risoluzione dei problemi, fare clic su <strong> Risolvi i problemi con Windows Update. </strong></p> <p><img src=\"images/image_thumb-9-777.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Fare clic su <strong> Il prossimo </strong> per risolvere i problemi di aggiornamento di Windows. </p> <p><img src=\"images/image_thumb-8-840.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Al termine del processo di risoluzione dei problemi, <strong> vicino </strong> lo strumento di risoluzione dei problemi e <strong> ricomincia </strong> il tuo PC. <br> 6. Controlla gli aggiornamenti. </p> <h6> Passaggio 3. &quot;Ricostruire&quot; la cartella SoftwareDistribution. </h6> <p> Il &quot; <strong> SoftwareDistribution </strong> &quot; (C:WindowsSoftwareDistribution), è la posizione in cui Windows memorizza gli aggiornamenti di Windows. A volte questa cartella è danneggiata e devi ricrearla per scaricare e installare gli aggiornamenti da zero. Per ricostruire (ricreare) la cartella &quot;SoftwareDistribution&quot; seguire i passaggi seguenti: </p> <p> 1. Aprire il pannello di controllo dei servizi di Windows: per farlo: </p> <ul> <li> Premi Windows <img src=\"images/image_thumb8_thumb_thumb-939.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra di comando Esegui. </li> <li> Nella casella Cerca, digita: <strong> servizi.msc </strong> &amp; clic <strong> ok </strong> . </li> <li> (Accetta l&#39;avviso UAC se appare). </li> </ul> <p><img src=\"images/image_thumb14_thumb_thumb-709.png\" alt=\"image_thumb[14]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 2. Nel pannello di controllo Servizi individuare il <strong> aggiornamento Windows </strong> servizio. <br> 3. Fare clic con il pulsante destro del mouse su <strong> aggiornamento Windows </strong> servizio e selezionare <strong> Fermare </strong> . </p> <p><img src=\"images/image_thumb7_thumb_thumb-509.png\" alt=\"image_thumb[7]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> </strong> Apri Esplora risorse e vai a: <strong> C: Finestre </strong> cartella. <br> 5. Trova e <strong> Elimina </strong> il <strong> SoftwareDistribution </strong> cartella. </p> <p> </p> <p><img src=\"images/image_thumb9_thumb_thumb-248.png\" alt=\"image_thumb[9]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Ricomincia </strong> il tuo computer e controlla gli aggiornamenti. </p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}