{"title":"FIX: Il programma non può essere avviato perché manca VCRUNTIME140.DLL (risolto)","content":"<p> Questo tutorial contiene le istruzioni per correggere il seguente errore all&#39;avvio di Windows 10 o quando si tenta di eseguire o installare un programma: &quot;Il programma non può essere avviato perché VCRUNTIME140.dll non è presente nel computer. Prova a reinstallare il programma per risolvere questo problema”. </p> <p><img src=\"images/image_thumb-31-814.png\" alt=\"FIX Program can’t start because VCRUNTIME140.DLL is missing\" loading=\"lazy\"></p> <p> </p> <p> Il file &quot;VCRUNTIME140.dll&quot; fa parte di Microsoft Visual C++ 2015 ed è richiesto dalle applicazioni sviluppate utilizzando Visual Studio 2015. Se il file &quot;VCRUNTIME140.dll&quot; è mancante o danneggiato, il sistema visualizza il file &quot;VCRUNTIME140.DLL manca&quot; errore ogni volta che è necessario il file &quot;VCRUNTIME140.DLL&quot; per eseguire un&#39;applicazione. </p> <h4> Come risolvere: Manca VCRUNTIME140.DLL. </h4> <p> 1. Scarica il <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=52685\" target=\"_blank\" rel=\"nofollow noopener\"> Pacchetto ridistribuibile Microsoft Visual C++ 2015 </a> . </p> <p><img src=\"images/image_thumb-32-401.png\" alt=\"fix VCRUNTIME140.DLL is missing\" loading=\"lazy\"></p> <p> </p> <p> 2. Nella schermata successiva, seleziona in base alla tua architettura Windows (32 o 64 bit), il file &quot;vc_redist.exe&quot; corrispondente da scaricare (o scarica entrambi i file se non sei sicuro). </p> <p><img src=\"images/image_thumb-33-787.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Al termine del download, fare doppio clic su &quot;vc_redist.exe&quot; scaricato. <br> 4. <strong> Accettare </strong> i termini della licenza e fare clic su <strong> Installare </strong> . </p> <p><img src=\"images/image_thumb-34-802.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questo problema. </p>"}