{"title":"FIX: Impossibile installare il visualizzatore XPS in Windows 10 (risolto)","content":"<p> In un precedente tutorial ho menzionato i passaggi necessari per <a href=\"https://www.repairwin.com/how-to-install-xps-viewer-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> installa XPS Viewer su Windows 10 </a> . Tuttavia, alcuni utenti si lamentano di non poter installare XPS Viewer, perché il visualizzatore XPS non è elencato dopo aver premuto il pulsante &quot;Aggiungi una funzionalità&quot; (App&gt; Gestisci funzionalità opzionali&gt; Aggiungi una funzionalità) o non può essere installato. </p> <p> Questo tutorial contiene istruzioni su come risolvere i problemi di installazione del visualizzatore XPS nelle versioni Windows 10 1803 e 1809. </p> <h4> Come risolvere i problemi di installazione del visualizzatore XPS in Windows 10. </h4> <h6> Metodo 1. Disinstallare e reinstallare Microsoft XPS Document Writer. </h6> <p> 1. Apri <strong> Programmi e caratteristiche </strong> e quindi fare clic su <strong> Attiva o disattiva le caratteristiche di Windows </strong> . </p> <p><img src=\"images/image_thumb-61-948.png\" alt=\"FIX: Cannot Install XPS Viewer - Windows 10\" loading=\"lazy\"></p> <p> 2. <strong> Deseleziona </strong> il <strong> Casella Microsoft XPS Document Writer </strong> e colpisci <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-62-338.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Ora fai clic su <strong> Attiva o disattiva le caratteristiche di Windows </strong> di nuovo e <strong> dai un&#39;occhiata </strong> il <strong> Microsoft XPS Document Writer </strong> casella e fare clic <strong> OK. <br> </strong> 4. <strong> Ricomincia </strong> il tuo PC. <br> 5. Prova a installare il visualizzatore XPS. </p> <p> </p> <h6> Metodo 2. Installare XPS Viewer utilizzando il comando DISM. </h6> <p> 1. Apri <strong> Prompt dei comandi come amministratore </strong> . <br> 2. Nel prompt dei comandi, dai il seguente comando e premi <strong> accedere </strong> . </p> <ul> <li><strong> dism /Online /Add-Capability /CapabilityName:XPS.Viewer~~~~0.0.1.0 </strong></li> </ul> <p><img src=\"images/image_thumb-65-661.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Metodo 3. Scarica XPS Viewer da Windows Update invece che da WSUS. (Windows 10 Pro e Enterprise). </h6> <p> Se stai utilizzando Windows 10 Pro o Enterprise, applica i passaggi seguenti nell&#39;Editor criteri di gruppo. * </p> <p> * Nota: se il computer appartiene a un dominio, è necessario modificare le impostazioni dei criteri di gruppo del dominio (GPO) e quindi eseguire il comando &quot;gpupdate /force&quot;, prima di installare XPS Viewer. </p> <p> 1. Aprire Editor criteri di gruppo. Fare quello: </p> <blockquote><p> 1. Premere contemporaneamente Windows <img src=\"images/image_thumb36-656.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo <strong> gpedit.msc </strong> &amp; Stampa <strong> Accedere. </strong></p></blockquote> <p><img src=\"images/image_thumb-78-514.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Nel riquadro di sinistra, vai a: </p> <ul> <li><strong> Configurazione del computer </strong> -&gt; <strong> Modelli amministrativi </strong> -&gt; <strong> Sistema </strong></li> </ul> <p> 3. Nel riquadro di destra fare doppio clic su <strong> Specificare le impostazioni per l&#39;installazione e la riparazione dei componenti facoltativi </strong></p> <p><img src=\"images/image_thumb-63-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Imposta il criterio su <strong> Abilitato </strong> e poi controlla <strong> Scarica il contenuto di riparazione e le funzionalità facoltative direttamente da Windows Update anziché da Windows Server Update Services (WSUS) </strong> scatola. </p> <p> 5. Al termine, fare clic su <strong> Applicare </strong> e <strong> ok </strong> e <strong> ricomincia </strong> il tuo PC. </p> <p><img src=\"images/image_thumb-64-264.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Dopo il riavvio, provare a <a href=\"#install-xps-viewer-dism\" target=\"_blank\" rel=\"nofollow noopener\"> installare il visualizzatore XPS utilizzando il metodo DISM </a> sopra. <br> 7. Dopo l&#39;installazione del visualizzatore XPS, aprire l&#39;Editor criteri di gruppo e ripristinare le modifiche. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}