{"title":"FIX: Errore dell&#39;app fotocamera 0xA00F424F (0x8004005) in Windows 10. (Risolto)","content":"<p> L&#39;errore dell&#39;app Fotocamera 0xA00F424F in Windows 10, durante il tentativo di scattare foto o video, significa che l&#39;app Fotocamera non può salvare le foto o i file video nella posizione di archiviazione specificata sul computer. L&#39;errore 0xA00F424F (0x8004005) può essere visualizzato per molti motivi, quindi segui i metodi seguenti per risolverlo. </p> <p><img src=\"images/image_thumb-9-592.png\" alt=\"FIX: Camera App Error 0xA00F424F in Windows 10\" loading=\"lazy\"></p> <p> Questo tutorial contiene istruzioni dettagliate per risolvere l&#39;errore &quot;Qualcosa è andato storto. Spiacenti, non è stato possibile salvare le foto&quot; con l&#39;errore: &quot;0xA00F424F (0x80004005)&quot; o &quot;PhotoCaptureFileCreationFailed (0x80131500)&quot; </p> <h4> Come risolvere: app Fotocamera - Salva errore 0xA00F424F (0x8004005) in Windows 10. </h4> <h6> Metodo 1. Consenti all&#39;app Fotocamera di accedere alla Fotocamera. </h6> <p> Il primo metodo per correggere l&#39;errore della fotocamera 0xA00F424F è assicurarsi che l&#39;app Fotocamera abbia accesso alla fotocamera. Fare quello: </p> <p> 1. Vai a <strong> impostazioni </strong> &gt; <strong> Privacy. <br> </strong> 2. Selezionare il <strong> telecamera </strong> app nel riquadro di sinistra e nel riquadro di destra effettuare le seguenti impostazioni: </p> <p> un. Attiva/disattiva <strong> Consenti alle app di accedere alla tua fotocamera </strong> passa a <strong> SOPRA </strong> . <br> b. Scorri verso il basso e sotto il <strong> &quot;Scegli quali app di Microsoft Store possono accedere alla tua fotocamera&quot; </strong> sezione, attiva/disattiva <strong> telecamera </strong> passaggio dell&#39;app a <strong> SOPRA </strong> . * </p> <p><img src=\"images/image_thumb-4-435.png\" alt=\"Allow apps to access your camera in Windows 10\" loading=\"lazy\"></p> <h6> Metodo 2. Ripristina le impostazioni dell&#39;app della fotocamera. </h6> <p> 1. Vai a <strong> impostazioni </strong> &gt; <strong> App </strong> . <br> 2. Nell&#39;elenco &quot;App e funzionalità&quot;, seleziona l&#39;app Fotocamera e fai clic su <strong> Opzioni avanzate </strong> . </p> <p><img src=\"images/image_thumb-5-262.png\" alt=\"Reset Camera App Settings - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Scorri verso il basso e fai clic su <strong> Ripristina. </strong></p> <p><img src=\"images/image_thumb-6-318.png\" alt=\"Reset app settings Windows 10\" loading=\"lazy\"></p> <h6></h6> <h6> Metodo 3. Elimina e ricrea la cartella &quot;Rullino fotografico&quot;. </h6> <p> Il metodo successivo per correggere il codice di errore 0xA00F424F (0x80004005) nell&#39;app Fotocamera consiste nell&#39;assicurarsi che la cartella &quot;Rullino foto&quot; (C:\\Utenti\\%Nome utente%\\Immagini\\Rullino foto), che è la posizione di salvataggio predefinita per il foto e video, esiste e dispone delle autorizzazioni corrette per il salvataggio di foto e video. Fare quello: </p> <p> 1. Aprire Esplora risorse e nella barra degli indirizzi digitare il seguente indirizzo e premere <strong> accedere </strong> : </p> <ul> <li> %APPDATA%\\Microsoft\\Windows\\Librerie\\Immagini </li> </ul> <p><img src=\"images/image_thumb-10-952.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Apri la cartella &quot;Rullino fotografico&quot;* e assicurati che sia priva di file. (Altrimenti, sposta tutti i suoi file in un&#39;altra posizione sul tuo disco.). </p> <p> * Nota: se la cartella Rullino foto non esiste, vai al passaggio 4. </p> <p> 3. Ora, <strong> Elimina </strong> il <strong> Rullino fotografico </strong> cartella. </p> <p><img src=\"images/image_thumb-11-440.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Infine, crea una nuova cartella e chiamala &quot; <strong> Rullino fotografico </strong> &quot; <br> 5. Al termine, apri l&#39;app Fotocamera e prova a scattare una foto o registrare un video per vedere se il problema è stato risolto. </p> <p> </p> <h6> Metodo 4. Aggiungere la cartella Rullino fotografico alla Libreria immagini. </h6> <p> Il metodo finale per correggere l&#39;errore dell&#39;app della fotocamera 0xA00F424F consiste nello specificare un&#39;altra posizione in cui archiviare le foto/i video. Fare quello: </p> <p> 1. Aprire Esplora risorse e nella barra degli indirizzi digitare il seguente indirizzo e premere <strong> accedere </strong> : </p> <ul> <li> %APPDATA%\\Microsoft\\Windows\\Libraries </li> </ul> <p> 2. Fare clic con il pulsante destro del mouse su <strong> Rullino fotografico </strong> cartella e selezionare <strong> Proprietà </strong> . </p> <p><img src=\"images/image_thumb-8-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Ora, esegui una delle seguenti operazioni: </p> <p> un. Se il &quot;Rullino fotografico&quot; non è elencato sotto la &quot;Posizione delle biblioteche, fare clic su <strong> Inserisci </strong> pulsante, apri il <strong> Immagini </strong> cartella e quindi selezionare <strong> Rullino fotografico </strong> cartella come posizione di salvataggio predefinita per le foto e i video. </p> <p> b. Se la cartella &quot;Rullino fotografico&quot; è elencata sotto &quot;Posizione librerie&quot;, fare clic su <strong> Inserisci </strong> e specifica una nuova cartella di archiviazione per l&#39;app Fotocamera. Al termine, fare clic su <strong> Imposta posizione di salvataggio </strong> e clicca <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-12-180.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Infine, apri l&#39;app Fotocamera e prova a scattare una foto o un video. </p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}