{"title":"FIX: Windows 10 Update non è riuscito a disinstallare Avira AntiVir (risolto)","content":"<p> Su un computer Windows 10, quando si tenta di aggiornare Windows 10 alla versione 1803 o 1809 viene visualizzato il seguente messaggio: &quot;È necessario disinstallare alcune app: è necessario disinstallare questi programmi perché non sono compatibili con l&#39;aggiornamento: Avira Antivirus&quot; quando si preme il pulsante &quot;Disinstalla e continua&quot;, viene visualizzato il seguente errore: &quot;Impossibile disinstallare queste app: Avira AntiVir&quot;. La cosa divertente di questo problema, è che Avira Antivir (Antivirus) non è installato sul PC (non elencato nei programmi installati). </p> <p><img src=\"images/image_thumb-10-929.png\" alt=\"Windows 10 Update Couldn't uninstall Avira AntiVir\" loading=\"lazy\"></p> <p> Il problema &quot;Impossibile disinstallare Avira AntiVir&quot; durante l&#39;aggiornamento a Windows 10 v1803, si è verificato perché il programma di aggiornamento trova alcuni file sul PC associati ad Avira Antivirus e che non sono stati rimossi durante la disinstallazione di Avira. * </p> <p> * Nota: se hai davvero il programma &quot;Avira Antivirus&quot; installato sul tuo computer, disinstallalo utilizzando l&#39;opzione &quot;Programmi e funzionalità&quot; nel pannello di controllo, quindi procedi con l&#39;aggiornamento del sistema a Windows 10 v1803 (o 1809). Dopo l&#39;aggiornamento, scarica e installa l&#39;ultima versione di Avira Antivirus nel tuo sistema. </p> <h4> Come correggere l&#39;errore di aggiornamento di Windows 10: impossibile disinstallare Avira AntiVir. </h4> <p> </p> <p> 1. Avvia Windows in <strong> Modalità sicura </strong> . Fare quello: </p> <ul> <li> <ul> <li> Premi le finestre <img src=\"images/image_thumb8_thumb_thumb-432.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. </li> <li> genere <strong> msconfig </strong> e premi <strong> accedere </strong> . </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-47-667.png\" alt=\"msconfig\" loading=\"lazy\"></p> <ul> <li> <ul> <li> A <strong> Stivale </strong> scheda selezionare il <strong> Avvio sicuro </strong> opzione, quindi fare clic su <strong> ok </strong> e riavvia il computer. </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-48-342.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Dopo il riavvio, apri Esplora file ed elimina il file <strong> avipbb.sys </strong> file dalle seguenti posizioni: </p> <ul> <li> C:\\Windows\\System32\\drivers </li> <li> C:\\Windows\\SysWOW64\\drivers </li> </ul> <p> </p> <p> 3. Procedere per eliminare dalle posizioni di cui sopra ogni altro file denominato <strong> avipbb </strong> nonostante la sua estensione. </p> <p> 4. Quindi eliminare il <strong> Avira </strong> cartella dal seguente percorso: </p> <ul> <li> (Windows a 64 bit): C:\\Programmi (x86)\\ <strong> Avira\\Antivirus </strong></li> <li> (Windows 32 bit): C:\\Programmi\\ <strong> Avira\\Antivirus </strong></li> </ul> <p> 5. Corri <strong> msconfig </strong> ancora. <br> 6. Nella scheda Generale, fare clic su Avvio normale e fare clic su <strong> ok </strong> , per riavviare il computer normalmente. </p> <p><img src=\"images/image_thumb-11-949.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Controllare e installare gli aggiornamenti. * </p> <p> * Nota: se si verifica ancora l&#39;errore &quot;Impossibile disinstallare Avira AntiVir&quot; durante l&#39;aggiornamento, scaricare ed eseguire il <a href=\"https://www.avira.com/en/support-download-avira-registrycleaner/1//\" target=\"_blank\" rel=\"nofollow noopener\"> Avira Registry Cleaner </a> . </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}