{"title":"FIX: errore di corruzione del file di dati di Outlook. (Risolto)","content":"<p> Il tutorial contiene istruzioni dettagliate su come riparare il danneggiamento del file di dati di Outlook in Outlook 2019, 2016, 2013, 2010 o 2007. Il danneggiamento del file di dati di Outlook può essere causato per diversi motivi. (ad es. dopo un&#39;interruzione di corrente, disco rigido danneggiato, problemi di connettività di rete, ecc.) e quando accade impedisce a Outlook di avviarsi normalmente con errore &quot;Sono stati rilevati problemi con uno dei file di dati di Outlook attualmente in uso. Questo processo e tutti gli altri l&#39;utilizzo di questo file si chiuderà in x secondi. Dovrai riavviare Outlook per riparare il file.&quot; </p> <p><img src=\"images/image_thumb-3-839.png\" alt=\"FIX: Outlook Data File Corruption\" loading=\"lazy\"></p> <p> Per riparare il file di dati di Outlook danneggiato e per risolvere l&#39;errore di danneggiamento del file di dati di Outlook, seguire i passaggi seguenti. </p> <h4> Come risolvere: corruzione del file di dati di Outlook. </h4> <p> 1. Passare al Pannello di controllo di Windows. Fare quello: </p> <blockquote><p> un. Digita &quot;pannello di controllo&quot; nella casella di ricerca di Windows <br> b. Clic <strong> Pannello di controllo </strong> dai risultati. </p></blockquote> <p><img src=\"images/image_thumb-53-981.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> 2. Impostare il <strong> Visto da </strong> per <strong> Piccole icone </strong> per visualizzare tutti gli elementi del pannello di controllo, quindi fare clic su <strong> posta </strong> . </p> <p><img src=\"images/image_thumb-54-211.png\" alt=\"control panel mail options\" loading=\"lazy\"></p> <p> 3. Fare clic su <strong> File di dati </strong> pulsante. </p> <p><img src=\"images/image_thumb4_thumb-710.png\" alt=\"image_thumb[4]\" loading=\"lazy\"></p> <p> 4. Notare il nome e la posizione del file di dati &quot;Outlook.pst&quot; e chiudere tutte le finestre aperte. * </p> <p> * Nota: se disponi di un Exchange (account IMAP), vedrai un file di dati .OST (ad es. &quot;Outlook.ost&quot;). In questo caso, forzare Outlook a ricreare il &quot;file .OST di Outlook danneggiato, effettuando le seguenti operazioni: </p> <blockquote><p> 1. Fare clic su <strong> Aprire la destinazione del file </strong> . <br> 2. <strong> Rinominare </strong> i dati OST per l&#39;account che causa il problema (se si dispone di più account IMAP). <br> 3. Apri Outlook per ricreare il file OST... </p> <p><img src=\"images/image_thumb6_thumb-615.png\" alt=\"image_thumb[6]\" loading=\"lazy\"></p> </blockquote> <p> 5. Aprire Esplora risorse e individuare il <strong> scanpst.exe </strong> strumento di riparazione in questa posizione: * </p> <ul> <li> C:\\Programmi\\Microsoft Office\\%OfficeVersion%\\SCANPST.EXE </li> </ul> <p> * Nota: di seguito sono indicate le posizioni del file &quot;SCANPST.EXE&quot; in base alla versione di Office installata. Se non riesci a trovare &quot;scanpst.exe&quot; nelle posizioni sopra riportate, guarda: </p> <ul> <li> <ul> <li> C:\\Programmi (x86)\\Microsoft Office\\root\\Office16. </li> </ul> </li> </ul> <blockquote><p><strong> Outlook 2013 </strong><br> Windows a 32 bit &gt; C:\\Programmi\\Microsoft Office\\Office15 <br> Windows a 64 bit &gt; C:\\Programmi (x86)\\Microsoft Office\\Office15 <br> Outlook a 64 bit &gt; C:\\Programmi\\Microsoft Office\\Office15 <br> A portata di clic  &gt;  C:\\Programmi\\Microsoft Office 15\\root\\office15 <br> <strong><br> Outlook 2010 </strong><br> Windows a 32 bit &gt; C:\\Programmi\\Microsoft Office\\Office14 <br> Windows a 64 bit &gt; C:\\Programmi (x86)\\Microsoft Office\\Office14 <br> Outlook a 64 bit &gt;  C:\\Programmi\\Microsoft Office\\Office14 <br> <strong><br> Outlook 2007 </strong><br> Windows a 32 bit &gt; C:\\Programmi\\Microsoft Office\\Office12 <br> Windows a 64 bit &gt;  C:\\Programmi (x86)\\Microsoft Office\\Office12 </p></blockquote> <p> 6. Fare doppio clic per <strong> Aperto </strong> il file SCANPST.EXE <br> 7. Fare clic su <strong> Navigare </strong> . </p> <p><img src=\"images/image_thumb-55-340.png\" alt=\"scanpst.exe\" loading=\"lazy\"></p> <p> </p> <p> 8. Individua e seleziona il file di dati di Outlook danneggiato (ad es. Outlook.pst) e fai clic su <strong> OK. </strong></p> <p> 9. Premere il tasto <strong> Scansione </strong> e sii paziente finché lo strumento di riparazione Posta in arrivo non ripara il file danneggiato. * </p> <p> * Nota: nella fase di riparazione finale ti verrà chiesto se desideri creare un backup. Risposta &quot; <strong> sì </strong> &quot; per continuare l&#39;operazione di riparazione. </p> <p><img src=\"images/image_thumb-56-120.png\" alt=\"Outlook Inbox Repair Tool\" loading=\"lazy\"></p> <p> </p> <p> 10. Al termine del processo di riparazione, aprire Outlook. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}