{"title":"FIX: Impossibile trasmettere l&#39;errore di Office durante l&#39;installazione o la disinstallazione di Office. (Risolto)","content":"<p> In questa guida troverai istruzioni passo passo per risolvere l&#39;errore &quot;Impossibile eseguire lo streaming di Office&quot; quando tenti di aggiornare, installare o disinstallare Office 2013, Office 2016, Office 2019 o Office 365 su un PC Windows. </p> <p> Problema in dettaglio: quando si tenta di aggiornare, installare o rimuovere Office 365, 2016 o 2013, utilizzando il &quot; <em> Programma e funzionalità </em> &quot; opzione nel Pannello di controllo, viene visualizzato il seguente messaggio di errore: &quot; <em> Impossibile eseguire lo streaming di Office. Siamo spiacenti, abbiamo riscontrato un problema durante lo streaming di Office. Per favore riprova più tardi. Codici di errore: 30015-25 (1006) o 30182-1 (2) o 30183-39 (-2147014790) o codice di errore 30179-25). </em></p> <p><img src=\"images/image_thumb-4-575.png\" alt=\"Couldn't Stream Office error \" loading=\"lazy\"></p> <p> </p> <h4> Come risolvere: impossibile eseguire lo streaming di Office 2013, 2016, 2019 o 365. </h4> <p> * Importante: il messaggio di errore &quot;Impossibile eseguire lo streaming di Office&quot; potrebbe essere visualizzato per i seguenti motivi: </p> <ol> <li> <ol> <li> Il tuo programma antivirus/firewall potrebbe impedire la connessione ai server Microsoft per aggiornare Office. </li> <li> Potresti esaurire lo spazio su disco. </li> </ol> </li> </ol> <p> Quindi, prima di continuare con il metodo seguente, prova quanto segue prima di installare, disinstallare o aggiornare Office: </p> <ol> <li> <ol> <li> Disabilita (o disinstalla completamente) il tuo programma antivirus/firewall. </li> <li> Libera spazio sul disco rigido, quindi prova a reinstallare o aggiornare Office. </li> </ol> </li> </ol> <p> Se dopo aver provato quanto sopra, riscontri ancora l&#39;errore &quot;Impossibile eseguire lo streaming di Office&quot;, procedi e rimuovi e reinstalla completamente Office. Fare quello: </p> <p> 1. Scarica il <a href=\"https://aka.ms/SaRA-officeUninstallFromPC\" target=\"_blank\" rel=\"nofollow noopener\"> Disinstallare lo strumento di supporto di Microsoft Office </a> . <br> 2. Al termine del download, fare doppio clic per eseguire &quot;SetupProd_OffScrub.exe&quot;. <br> 3. Fare clic su <strong> Installare </strong> per installare &#39;Microsoft Support and Recovery Assistant&#39;. </p> <p><img src=\"images/image_thumb-5-986.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Al termine dell&#39;installazione, fare clic su <strong> Essere d&#39;accordo </strong> e quindi fare clic su <strong> Sì. </strong></p> <p><img src=\"images/image_thumb-6-745.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Attendere fino alla risoluzione del problema da parte di &quot;Microsoft Support and Recovery Assistant&quot;. <br> 6. Selezionare la casella di controllo a sinistra del nome del prodotto Office per <strong> seleziona tutti i prodotti Office installati </strong> e clicca <strong> Il prossimo </strong> . </p> <p><img src=\"images/image_thumb-7-956.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Ora attendi fino al completamento del processo di rimozione di Office e, al termine, <strong> ricomincia </strong> il tuo computer. <br> 8. Dopo il riavvio, procedere e reinstallare Office seguendo le istruzioni da questi collegamenti: </p> <ul> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Ufficio 365 </a></li> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Ufficio 2019 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Ufficio 2016 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Ufficio 2013 </a></li> </ul> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}