{"title":"FIX: Questa modalità di Windows esegue solo app verificate dallo Store su Windows 10.","content":"<p> L&#39;errore &quot;Per sicurezza e prestazioni, questa modalità di Windows esegue solo app verificate dallo Store&quot; viene visualizzato quando Windows 10 è in esecuzione in modalità S o a causa di un&#39;impostazione sul computer che limita l&#39;installazione di app e software di terze parti . </p> <p><img src=\"images/image_thumb-19-156.png\" alt=\"FIX: For security and performance, this mode of Windows only runs verified apps from the Store in Windows 10.\" loading=\"lazy\"></p> <p> Questo tutorial contiene istruzioni per risolvere l&#39;errore &quot;Per sicurezza e prestazioni, questa modalità di Windows esegue solo app verificate dallo Store&quot;, quando si tenta di installare un&#39;applicazione di terze parti in Windows 10. </p> <h2> Come consentire l&#39;installazione di applicazioni di terze parti in Windows 10. </h2> <h5> Passaggio 1. Scopri la versione di Windows 10 installata. </h5> <p> 1. Premi il tasto Windows <img src=\"images/image_thumb8_thumb-1-482.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Digitare il seguente comando e premere <strong> Accedere: </strong></p> <ul> <li><strong> vincitore </strong></li> </ul> <p><img src=\"images/image_thumb-13-360.png\" alt=\"See Windows 10 Installed Version\" loading=\"lazy\"></p> <p> 3. Ora, se in Windows Edition vedi che stai eseguendo Windows 10 Home o Pro, segui le istruzioni in <a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Metodo-1 </a> , altrimenti, se hai <strong> Windows 10 Home S </strong> , seguire le istruzioni in <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metodo-2 </a> . </p> <p><img src=\"images/image_thumb-14-709.png\" alt=\"See Installed Windows 10 Edition\" loading=\"lazy\"></p> <p><strong> </strong></p> <p><strong> </strong></p> <h3> Metodo 1. Consenti a Windows 10 di installare app da qualsiasi luogo. </h3> <p> 1. Dal menu Start <img src=\"images/image_thumb2_thumb_thumb-909.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> fare clic su Impostazioni <img src=\"images/image_thumb-66-797.png\" alt=\"image\" loading=\"lazy\"> e poi apri <strong> App </strong> . </p> <p><img src=\"images/image_thumb-15-604.png\" alt=\"Windows Settings - Apps\" loading=\"lazy\"></p> <p> </p> <p> 2. In Impostazioni app e funzionalità, seleziona per installare le app da <strong> Dovunque </strong> . </p> <p><img src=\"images/image_thumb-16-670.png\" alt=\"Install Apps from Anywhere - Windows 10\" loading=\"lazy\"></p> <h3> Metodo 2. Esci dalla modalità S di Windows 10. </h3> <p> Windows 10 in modalità S è progettato per la sicurezza e le prestazioni e per questo motivo non consente di eseguire app al di fuori di Microsoft Store. Per aggirare questa limitazione, devi uscire dalla modalità S, che è un modo molto semplice, ma tieni presente che una volta usciti dalla modalità S, non sarai in grado di tornare a Windows 10 in modalità S.. </p> <p> Per uscire dalla modalità S di Windows 10 a Windows 10 Home: </p> <p> 1. Dal menu Start <img src=\"images/image_thumb2_thumb_thumb-829.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> fare clic su Impostazioni <img src=\"images/image_thumb-66-853.png\" alt=\"image\" loading=\"lazy\"> e poi apri <strong> Aggiornamento e sicurezza. </strong></p> <p> 2. Seleziona <strong> Attivazione </strong> a sinistra e quindi fare clic su <a href=\"//switchwindows\" target=\"_blank\" rel=\"nofollow noopener\"> Andare al negozio </a><strong> . </strong></p> <p><img src=\"images/image_thumb-17-920.png\" alt=\"Switch Out S Mode Windows 10\" loading=\"lazy\"></p> <p> 3. Nella pagina Esci dalla modalità S, fare clic su <strong> Ottenere </strong> e quindi fare clic su <strong> Installare. </strong> * <br> 4. Infine clicca <strong> Si, andiamo </strong> per uscire dalla modalità S. </p> <p> * Nota: se dopo aver fatto clic sul pulsante &quot;Installa&quot; ricevi l&#39;errore &quot;È successo qualcosa e non è stato possibile avviare l&#39;aggiornamento&quot;, procedi e <strong> installa tutti gli aggiornamenti di Windows 10 disponibili </strong> , <strong> riavvia il tuo PC </strong> e prova ancora. </p> <p><img src=\"images/image_thumb-18-502.png\" alt=\"Switch Out S Mode\" loading=\"lazy\"></p> <p> </p> <p> 4. Al termine dell&#39;installazione, verrai informato che potrai installare app dall&#39;esterno di Microsoft Store. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}