{"title":"FIX: Monitor PNP generico su Windows 10 (risolto)","content":"<p> Il problema del monitor PNP generico in Windows 10 si verifica perché il monitor collegato non viene riconosciuto correttamente dal sistema. Il problema &quot;Monitor PNP generico&quot; si verifica sui computer desktop o quando si utilizza un monitor esterno con il laptop ed è causato da uno dei seguenti tre (3) motivi: </p> <ol> <li> <ol> <li> <p> Il driver per la scheda video (VGA) non è corretto o non è installato. </p> </li> <li> <p> Il driver per il monitor non è installato correttamente. </p> </li> <li> <p> Il cavo video ha un problema. </p> </li> </ol> </li> </ol> <p><img src=\"images/image_thumb-71-767.png\" alt=\"FIX Generic PNP Monitor on Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Questo tutorial contiene istruzioni dettagliate su come risolvere il problema &quot;Monitor PNP generico&quot; su Windows 10. </p> <h4> Come risolvere: monitor PNP generico in Windows 10. </h4> <h6> Metodo 1. Installa tutti gli aggiornamenti di Windows 10 disponibili. </h6> <p> Se il problema del monitor PNP generico viene visualizzato dopo l&#39;installazione o dopo l&#39;aggiornamento di Windows 10, procedere e installare tutti gli aggiornamenti disponibili. Fare quello, </p> <p> 1. Vai a <strong> Inizio <img src=\"images/image_thumb-55-849.png\" alt=\"image\" loading=\"lazy\"> -&gt; Impostazioni </strong> -&gt; <strong> Aggiornamento e sicurezza -&gt; </strong> e clicca <strong> Controlla gli aggiornamenti. </strong></p> <p><img src=\"images/image_thumb-76-951.png\" alt=\"Windows 10 - Check For Updates \" loading=\"lazy\"></p> <p> 2. Scarica e installa tutti gli aggiornamenti di Windows e poi <strong> ricomincia </strong> il tuo PC. </p> <h6><br clear=\"all\"> Metodo 2. Installare o eseguire il rollback dei driver della scheda video. </h6> <p> Il secondo passaggio per risolvere il problema del monitor PNP generico consiste nell&#39;installare (o ripristinare) i driver dell&#39;adattatore grafico. Fare quello: </p> <p> 1. Apri <strong> Gestore dispositivi </strong> . Fare quello: </p> <ol> <li> <ol> <li> Premi Windows <img src=\"images/image_thumb8_thumb_thumb-458.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. </li> <li> Nella casella &quot;Apri&quot;, digita: <strong> devmgmt.msc </strong> &amp; clic <strong> ok </strong> . </li> </ol> </li> </ol> <blockquote> <p><img src=\"images/image_thumb-5-538.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. In Gestione dispositivi espandere il <strong> Adattatori di visualizzazione. <br> </strong> 3. Ora esegui l&#39;azione corrispondente, secondo il tuo caso: </p> <p><strong> Caso A. </strong> Se la scheda video installata è elencata come &quot; <strong> Adattatore display di base Microsoft </strong> &quot; (come nello screenshot qui sotto), questo significa che i driver per la tua scheda grafica non sono installati. </p> <p><img src=\"images/image_thumb-61-521.png\" alt=\"image\" loading=\"lazy\"></p> <p> In questo caso, per risolvere il problema &quot;Monitoraggio PNP generico&quot;: </p> <blockquote> <p> un. <strong> Fare clic con il pulsante destro del mouse </strong> sul <strong> Adattatore display di base Microsoft </strong> e seleziona <strong> Aggiorna driver. </strong></p> </blockquote> <p><img src=\"images/image_thumb-62-511.png\" alt=\"image\" loading=\"lazy\"></p> <blockquote> <p> b. Nella schermata successiva, fare clic su <strong> Cerca automaticamente i driver </strong> e consentire a Windows di scaricare e installare i driver per il dispositivo di visualizzazione. * </p> </blockquote> <p><img src=\"images/image_thumb-69-707.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Nota: se Windows non riesce a trovare un driver diverso per la tua scheda grafica, accedi al sito di assistenza del produttore del computer (o della scheda grafica) e scarica e installa i driver più recenti per la tua scheda grafica. </p> <ul> <li> <ul> <li> Per <strong> NVIDIA </strong> basate su GPU, vai a <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Pagina di ricerca avanzata dei driver NVIDIA </a> . </li> <li> Per <strong> AMD </strong> basate su GPU, vai a <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Centro download driver AMD (ATI). </a></li> <li> Per <strong> Intel </strong> basate su GPU, vai a <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Centro di download della grafica Intel. </a></li> </ul> </li> </ul> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/07/image-56.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p><strong> Caso B. </strong> Se vedi che la tua scheda grafica è stata riconosciuta correttamente da Windows 10, probabilmente il driver grafico installato non è corretto. </p> <p> In questo caso, procedi e installa i driver più recenti per la tua scheda grafica dal sito di supporto del produttore o, se il problema &quot;Monitor PNP generico&quot;, viene visualizzato dopo un aggiornamento di Windows 10, procedi e ripristina i driver video. </p> <p> Per eseguire il rollback dei driver grafici: </p> <blockquote> <p> un. Fare clic con il pulsante destro del mouse sulla scheda video installata e fare clic su <strong> Proprietà. </strong></p> </blockquote> <p><img src=\"images/image_thumb-64-665.png\" alt=\"image\" loading=\"lazy\"></p> <blockquote> <p> b. Seleziona il <strong> autista </strong> scheda e quindi fare clic su <strong> Ripristina driver </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-58-555.png\" alt=\"Roll Back Driver\" loading=\"lazy\"></p> <blockquote><p> c. Seleziona un motivo per il rollback del pacchetto driver e fai clic su <strong> Sì. </strong></p></blockquote> <p><img src=\"images/image_thumb-19-797.png\" alt=\"image\" loading=\"lazy\"></p> <blockquote><p> d. Al termine del ripristino del driver, <strong> ricomincia </strong> il tuo computer. </p></blockquote> <h6> Metodo 3. Disinstallare il dispositivo Monitor PNP generico e riconnettere il monitor. </h6> <p> 1. Vai a <strong> Gestore dispositivi </strong> . <br> 2. Espandi <strong> Monitor. </strong><br> 3. <strong> Fare clic con il pulsante destro del mouse </strong> a <strong> Monitor PnP generico </strong> e seleziona <strong> Disinstalla dispositivo. </strong></p> <p><img src=\"images/image_thumb-59-687.png\" alt=\"Generic PNP Monitor\" loading=\"lazy\"></p> <p> </p> <p> 4. Fare clic su <strong> Disinstalla </strong> per confermare la tua decisione. </p> <p><img src=\"images/image_thumb-60-394.png\" alt=\"Unisntall Generic PNP Monitor\" loading=\"lazy\"></p> <p> 5. <strong> Spegnimento </strong> il tuo computer. <br> 6. <strong> Spegni </strong> il tuo <strong> tenere sotto controllo </strong> e <strong> rimuovere il cavo di alimentazione </strong> dalla spina. <br> 7. <strong> Disconnetti </strong> il <strong> cavo video </strong> dal computer. <br> 8. Lasciare i cavi scollegati per 2-3 minuti, quindi ricollegare tutti i cavi. <br> 9. Accendi il PC e controlla se il problema è stato risolto. </p> <h6><br clear=\"all\"> Metodo 4. Installare il driver del monitor generico non PNP. </h6> <p> 1. Vai a <strong> Gestore dispositivi </strong> . <br> 2. Espandi <strong> Monitor. <br> </strong> 3. <strong> Fare clic con il pulsante destro del mouse </strong> sopra <strong> Monitor PNP generico </strong> e seleziona <strong> Aggiorna driver. </strong></p> <p><img src=\"images/image_thumb-65-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Fare clic su <strong> Sfoglia il mio computer per i driver. </strong></p> <p><img src=\"images/image_thumb-66-706.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Seleziona <strong> Fammi scegliere da un elenco di driver disponibili sul mio computer </strong> . </p> <p><img src=\"images/image_thumb-67-249.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Dai un&#39;occhiata </strong> il <strong> Mostra hardware compatibile </strong> casella di controllo e selezionare e installare uno degli altri driver compatibili o il driver &quot;Monitor generico non PNP&quot;. </p> <p><img src=\"images/image_thumb-68-287.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Metodo 5. Prova con un altro cavo video. </h6> <p> Il metodo finale per risolvere il problema del &quot;Monitor PNP generico&quot; in Windows 10 consiste nel collegare il PC al monitor con un cavo diverso. Fare quello: </p> <p> * Nota: questo metodo si applica solo ai desktop o quando si utilizza un monitor esterno con il laptop. </p> <p> 1. <strong> Spegnimento </strong> il tuo PC. <br> 2. <strong> Sostituire </strong> il <strong> cavo video </strong> con uno simile, ma di un produttore diverso. <br> 3. <strong> Accensione </strong> il tuo PC. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}