{"title":"FIX: ERR_CONNECTION_CLOSED in Google Chrome (risolto)","content":"<p> Questo tutorial contiene le istruzioni per correggere l&#39;errore di Chrome: &quot;ERR_CONNECTION_CLOSED&quot;. L&#39;errore &quot;ERR_CONNECTION_CLOSED&quot; in Google Chrome, significa che il tuo browser non riesce a stabilire una connessione con il sito web che stai cercando di raggiungere, perché la tua connessione Internet è stata interrotta o perché il tuo provider di servizi Internet ha bloccato l&#39;accesso al sito web. </p> <h4> Come risolvere: errore CHROME ERR_CONNECTION_CLOSED. </h4> <p><strong> Consigli: </strong> Prima di procedere alla risoluzione dell&#39;errore di Chrome: &quot;ERR_CONNECTION_CLOSED&quot;, applicando i metodi seguenti, prova quanto segue: <br> 1. Riavvia il tuo router Internet. <br> 2. Prova a visitare altri siti Web, per assicurarti che la tua connessione Internet funzioni. <br> 3. Se possiedi un altro computer/dispositivo al tuo posto, prova a visitare il sito Web in cui ricevi l&#39;errore &quot;ERR_CONNECTION_CLOSED&quot;, per assicurarti che il sito che stai cercando di visitare non sia bloccato dal tuo ISP. <br> 4. Se hai impostato una connessione VPN, disconnettiti da essa. <br> 5. Disattiva temporaneamente l&#39;applicazione Firewall (se ne hai uno). </p> <p> </p> <h6> Metodo 1. Scansiona il tuo computer alla ricerca di malware e virus. </h6> <p> Il primo passaggio prima di risolvere l&#39;errore &quot;ERR_CONNECTION_CLOSED&quot; in Chrome è assicurarsi che il sistema sia privo di virus/malware. Per questo compito segui le istruzioni in questa guida: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Come eseguire la scansione del computer alla ricerca di virus e altri programmi dannosi. </a></p> <p> </p> <h6> Metodo 2. Ripristina le impostazioni di Chrome ai valori predefiniti. </h6> <p> Per ripristinare le impostazioni predefinite di Chrome: </p> <p> 1. Fare clic sul menu di Chrome <img src=\"images/image_thumb_thumb_thumb_thumb-657.png\" alt=\"image_thumb_thumb_thumb\" loading=\"lazy\"> icona nell&#39;angolo in alto a destra) e scegli <strong> impostazioni </strong> . </p> <p><img src=\"images/image_thumb31-256.png\" alt=\"chrome-options\" loading=\"lazy\"></p> <p> </p> <p> 2. A <strong> impostazioni </strong> pagina, scorrere verso il basso e fare clic su <strong> Mostra impostazioni avanzate. </strong></p> <p><img src=\"images/image_thumb2_thumb-894.png\" alt=\"FIX ERR_CONNECTION_CLOSED CHROME\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Alla fine della pagina, fare clic su <strong> Ripristina le impostazioni ai valori predefiniti originali </strong> . </p> <p><img src=\"images/image_thumb5_thumb-475.png\" alt=\"image_thumb[5]\" loading=\"lazy\"></p> <p> </p> <p> 4. Infine clicca <strong> Ripristina le impostazioni </strong> . </p> <p><img src=\"images/image_thumb6_thumb-389.png\" alt=\"CHROME ERR_CONNECTION_CLOSED - FIX\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Ricomincia </strong> Cromo. </p> <p> </p> <h6> Metodo 3. Reimpostare il protocollo Winsock. </h6> <p> 1. Aprire il prompt dei comandi in modalità amministrativa. Fare quello: </p> <blockquote><p> 1. Nella casella di ricerca, digitare <strong> cmd </strong> o <strong> prompt dei comandi </strong></p> <p> </p> <p> 2. Fare clic con il tasto destro su <strong> Prompt dei comandi </strong> risultato e selezionare <strong> Esegui come amministratore. </strong></p></blockquote> <p><img src=\"images/image_thumb-38-412.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Nel prompt dei comandi, digita il seguente comando e premi <strong> accedere </strong> . </p> <ul> <li><strong> catalogo di ripristino di netsh winsock </strong></li> </ul> <p><img src=\"images/image_thumb_thumb-865.png\" alt=\"netsh winsock reset catalog\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Ricomincia </strong> il tuo computer. </p> <p> </p> <h6> Metodo 4. Modificare le impostazioni DNS. </h6> <p> – Utilizza i server DNS pubblici di Google per risolvere l&#39;errore &quot;ERR_CONNECTION_CLOSED&quot; in Chrome. </p> <p> </p> <p><strong> Per modificare le impostazioni DNS: </strong></p> <p> 1. <strong> Fare clic con il tasto destro </strong> sull&#39;icona Rete attiva nella barra delle applicazioni (o vai al Pannello di controllo di Windows) e fai clic su <strong> Centro connessioni di rete e condivisione </strong></p> <p><img src=\"images/image_thumb14_thumb-1-229.png\" alt=\"image_thumb[14]\" loading=\"lazy\"></p> <p> </p> <p> 2. Selezionare la scheda di rete attiva e quindi fare clic su <strong> Modifica le opzioni dell&#39;adattatore. </strong></p> <p><img src=\"images/image_thumb17_thumb-1-221.png\" alt=\"FIX CHROME ERR_CONNECTION_CLOSED\" loading=\"lazy\"></p> <p> </p> <p> 3. Fare clic con il pulsante destro del mouse sull&#39;adattatore di rete attivo e selezionare <strong> Proprietà </strong> . <br> 4. Selezionare il <strong> «Protocollo Internet versione 4 (TCP/IPv4) </strong> &#39; e fare clic <strong> Proprietà </strong></p> <p><img src=\"images/image_thumb18_thumb-1-963.png\" alt=\"image_thumb[18]\" loading=\"lazy\"></p> <p> </p> <p> 5a. Controlla il &quot; <strong> Utilizza i seguenti indirizzi del server DNS: </strong> pulsante di opzione &quot;. <br> 5b. Digita i seguenti indirizzi del server DNS (server DNS pubblici di Google) e fai clic su <strong> OK. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> <p><img src=\"images/image_thumb20_thumb-1-904.png\" alt=\"image_thumb[20]\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> Ricomincia </strong> il tuo computer. </p> <p> </p> <h6> Metodo 5. Connettiti a Internet tramite Opera VPN. </h6> <p> Se il tuo provider di servizi Internet (ISP) ha bloccato l&#39;accesso ai siti che stai cercando di visitare, puoi provare a connetterti a tali siti, utilizzando una rete privata virtuale gratuita (o provider di servizi VPN) o semplicemente utilizzando il browser Opera che ha la funzione VPN integrata. * </p> <p> * Nota: la connessione a Internet tramite un servizio VPN ti consente di &quot;mascherare&quot; il tuo vero indirizzo IP del tuo dispositivo per far sembrare che sei online da un altro paese. </p> <p> Per abilitare la funzione VPN nel browser Opera: </p> <p> 1. Apri il menu Opera e poi scegli <strong> impostazioni </strong> . </p> <p><img src=\"images/image_thumb10_thumb-360.png\" alt=\"image_thumb[10]\" loading=\"lazy\"></p> <p> </p> <p> 2. Fare clic su <strong> Avanzate </strong> a sinistra e quindi fare clic su <strong> Caratteristiche </strong> . <br> 3. Trascina il <strong> Abilita VPN </strong> passa a <strong> SOPRA </strong> . </p> <p><img src=\"images/image_thumb13_thumb-171.png\" alt=\"image_thumb[13]\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Ricomincia </strong> Musica lirica. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}