{"title":"FIX: unità visualizzate due volte nel riquadro di spostamento di Windows 10 (risolto)","content":"<p> In questo tutorial troverai le istruzioni per risolvere il seguente strano problema in Windows 10: Unità visualizzate due volte nel riquadro di spostamento. L&#39;aspetto duplicato delle unità nel riquadro di navigazione è una nuova funzionalità di Windows 10, che aiuta l&#39;utente a esplorare facilmente il contenuto di l&#39;unità collegata, senza dover espandere il menu &quot;Questo PC&quot;, ma questa funzione diventa fastidiosa, perché se si utilizza per mantenere aperto il menu &quot;Questo PC&quot;, la stessa unità viene visualizzata due volte nel riquadro di navigazione. </p> <p><img src=\"images/image_thumb-22-749.png\" alt=\"Drives Displayed Twice in Navigation Pane of Windows 10\" loading=\"lazy\"></p> <p> Se vedi voci duplicate delle tue unità USB collegate o delle unità fisse in Windows 10, segui le istruzioni di seguito per risolvere il problema. </p> <h4> Come rimuovere le lettere di unità duplicate in Esplora risorse di Windows 10 (menu di navigazione). </h4> <p> Per impedire a Windows 10 di visualizzare due volte un&#39;unità collegata o fissa, applicare la seguente modifica del registro: </p> <p> 1. Aprire l&#39;editor del registro. fare quello: </p> <blockquote><p> 1. Premi Finestre <img src=\"images/image_thumb8_thumb_thumb-493.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Nella casella Cerca, digita <strong> regedit </strong> e premi <strong> accedere </strong> per avviare l&#39;editor del registro. </p></blockquote> <p><img src=\"images/image_thumb7-138.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Quindi vai a questa chiave di registro: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Desktop\\NameSpace\\DelegateFolders </li> </ul> <p> 3. Quindi fare clic con il tasto destro ed eliminare il <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> chiave. </p> <p><img src=\"images/image_thumb-23-428.png\" alt=\"remove duplicate drive entries windows 10 navigation pane\" loading=\"lazy\"></p> <p> </p> <p> 4. Quindi vai a questa chiave: * </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Desktop\\NameSpace\\DelegateFolders </li> </ul> <p> 5. Eliminare il <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> chiave. </p> <p> 6. Chiudere l&#39;editor del registro. </p> <p> * Nota: se non riesci a vedere la chiave &quot;WOW6432Node&quot;, ignora i passaggi 4 e 5 sopra, perché si applicano solo alle versioni a 64 bit di Windows 10. </p> <p><strong> MANCIA: </strong> Se modifichi la tua decisione in futuro, fai clic con il pulsante destro del mouse su &quot;DelegateFolders&quot; nelle posizioni del registro di cui sopra, seleziona <strong> Nuovo </strong> -&gt; <strong> Chiave </strong> e ricreare il cancellato <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> chiave/e. </p> <p> È tutto! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}