{"title":"FIX: Stampa PDF lenta in Windows 10 (risolto)","content":"<p> Questo tutorial contiene le istruzioni per risolvere il problema della stampa PDF lenta da Acrobat Reader in Windows 10. Quindi, se stai provando a stampare un file PDF utilizzando Adobe Acrobat e la stampa è lenta, continua a leggere di seguito. </p> <p> Problema in dettaglio: quando si tenta di stampare un file PDF su una stampante locale o di rete, la stampa richiede molto tempo perché dopo l&#39;invio del lavoro di stampa, la stampante inizia a stampare la prima pagina molto lentamente e quindi è necessario attendere più di 2 minuti per la stampa delle pagine rimanenti. Allo stesso tempo, il problema della stampa lenta, non si verifica quando si stampa da altri programmi. (ad es. da Word, Excel, ecc.) </p> <p> La stampa lenta dei documenti Adobe PDF in Windows 10 può apparire per diversi motivi, quindi questo tutorial contiene diversi metodi per risolvere il problema. </p> <h4> Come risolvere: la stampa di file PDF è molto lenta in Windows 10. </h4> <h6> Metodo 1. Stampa il documento PDF come immagine. </h6> <p> 1. Aprire Acrobat Reader e fare clic su <strong> Stampa </strong> pulsante. <br> 2. Nella finestra di dialogo Stampa, fare clic su <strong> Avanzate. </strong></p> <p><img src=\"images/image_thumb-345.png\" alt=\"FIX: Slow PDF Printing in Windows 10\" loading=\"lazy\"></p> <p> 3. Selezionare il <strong> Stampa come immagine </strong> casella di controllo e fare clic su <strong> OK. </strong></p> <p><img src=\"images/image_thumb-1-653.png\" alt=\"FIX PDF Slow Printing in Windows 10\" loading=\"lazy\"></p> <p> 4. Prova a stampare il tuo file PDF. </p> <h6><br clear=\"all\"> Metodo 2. Lascia che la stampante determini i colori. </h6> <p> 1. Aprire Acrobat Reader e fare clic su <strong> Stampa </strong> pulsante. <br> 2. Nella finestra di dialogo Stampa, fare clic su <strong> Avanzate. </strong></p> <p> 3. <strong> Deseleziona </strong> il <strong> Stampa come immagine </strong> casella di controllo (se selezionata), e <strong> dai un&#39;occhiata </strong> il <strong> Lascia che sia la stampante a determinare i colori </strong> casella di controllo. <br> 4. Fare clic su <strong> ok </strong> per salvare le impostazioni e provare a stampare il file PDF. * </p> <p> * Nota: se la stampa è di nuovo bassa, allora <strong> deselezionare </strong> il <strong> &quot;Lascia che la stampante determini i colori&quot; </strong> opzione e passare al metodo successivo. </p> <p><img src=\"images/image_thumb-2-580.png\" alt=\"FIX Adobe Acrobat Slow PDF Print\" loading=\"lazy\"></p> <h6> Metodo 3. Reinstallare o modificare il driver della stampante. </h6> <p> Come ultima risorsa, per risolvere la stampa lenta dei documenti PDF, eseguire le seguenti azioni. </p> <p><strong> Passaggio 1. Reinstallare i driver della stampante. </strong></p> <p> 1. Vai a Pannello di controllo &gt; <strong> Strumenti e stampanti </strong> . <br> 2. Fare clic con il pulsante destro del mouse sulla stampante e fare clic su <strong> Rimuovi dispositivo </strong> . </p> <p><img src=\"images/image_thumb-3-877.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Quindi, vai a Pannello di controllo &gt; <strong> Programmi e caratteristiche </strong> e <strong> disinstallare </strong> il software della stampante. <br> 4. <strong> Ricomincia </strong> il tuo PC. <br> 5. Dal sito di supporto del produttore della stampante, scaricare i driver più recenti per la stampante. <br> 6. Installare i driver della stampante e provare a stampare. Se la stampa è di nuovo lenta, andare al passaggio 2. </p> <p><strong> Passaggio 2. Modificare il driver della stampante. </strong></p> <p> Passa di nuovo al sito di supporto del produttore della tua stampante e controlla se è offerto un altro tipo di driver per la tua stampante. (es. Stampa universale, PostScript, PCL6, ecc.). In tal caso, scarica e installa uno degli altri tipi di driver e prova a stampare. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}