{"title":"FIX: Il periodo di timeout del semaforo è scaduto durante la copia dei file (risolto)","content":"<p> L&#39;errore &quot;Il periodo di timeout del semaforo è scaduto&quot; può essere visualizzato quando si tenta di copiare file di grandi dimensioni sulla rete o durante il trasferimento di file da un&#39;unità USB esterna al computer. In altri casi viene visualizzato l&#39;&quot;Errore 0x80070079: il periodo di timeout del semaforo è scaduto&quot; quando si tenta di copiare file da un dispositivo collegato tramite USB (ad es. dalla fotocamera, dal telefono cellulare, ecc.). </p> <p><img src=\"images/image_thumb-4-812.png\" alt=\"Semaphore Timeout Period has Expired\" loading=\"lazy\"></p> <p> </p> <p> In questa guida troverai diversi modi per risolvere il &quot;periodo di timeout del semaforo scaduto. Errore 0x80070079&quot; durante la copia di file da/a rete o USB, in Windows 10, 8, 8.1, 7 o Vista. </p> <h4> Come risolvere: errore durante la copia di file o cartelle. Il periodo del semaforo è scaduto. </h4> <p><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> PARTE 1. CORREZIONE &quot;Il periodo del semaforo è scaduto&quot; durante la copia di file da USB. </a></p> <p><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> PARTE 2. CORREZIONE &quot;Il periodo del semaforo è scaduto&quot; durante la copia di file dalla rete. </a></p> <p> </p> <h6> PARTE 1. CORREZIONE &quot;Il periodo del semaforo è scaduto&quot; durante la copia di file da USB. </h6> <p> Se ricevi l&#39;errore &quot;Semaphore Period is Expired&quot; quando copi file da un dispositivo USB (ad esempio da un disco USB esterno o dalla tua fotocamera digitale), prova quanto segue per risolvere il problema: </p> <p><strong> 1. </strong> Chiudi tutti i programmi aperti e <strong> ricomincia </strong> il tuo computer. <br> <strong> 2. </strong> Collega il dispositivo USB a <strong> un&#39;altra porta USB </strong> . Se il tuo computer possiede una porta USB 2.0, collega il dispositivo USB a quella porta. <br> <strong> 3. </strong> Usare un <strong> cavo USB diverso </strong> per collegare il dispositivo USB al computer. <br> <strong> 4. </strong> Se desideri copiare file da un dispositivo USB (ad esempio il tuo telefono cellulare o la tua fotocamera digitale), che possiede una scheda SD, allora <strong> rimuovere </strong> e <strong> reinserire </strong> il <strong> scheda SD </strong> . Inoltre, rimuovere la scheda SD dal dispositivo USB e collegarla a un <strong> lettore di schede </strong> (se ne possiedi uno). <br> <strong> 5. </strong> <strong> Dai un&#39;occhiata </strong> e <strong> riparare gli errori </strong> sull&#39;unità USB utilizzando il &#39; <strong> chkdsk </strong> &#39; comando. Fare quello: </p> <blockquote><p> 1. Lancio <strong> Prompt dei comandi come amministratore </strong> . </p></blockquote> <p><img src=\"images/image_thumb-30-765.png\" alt=\"command prompt administrator\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 2. Nella finestra del prompt dei comandi, digita il seguente comando e premi <strong> accedere </strong> : * </p></blockquote> <ul> <li> <ul> <li> <ul> <li><strong> chkdsk X: /F /R </strong></li> </ul> </li> </ul> </li> </ul> <p><strong> * Nota: </strong> Sostituire la lettera dell&#39;unità X in base alla lettera dell&#39;unità USB. </p> <p> </p> <p> </p> <h6> PARTE 2. CORREZIONE &quot;Il periodo del semaforo è scaduto&quot; durante la copia di file sulla rete. </h6> <p> Se ricevi l&#39;errore &quot;Semaforo periodo è scaduto&quot; quando tenti di copiare i file sulla rete, prova quanto segue: </p> <h2> Metodo 1. Utilizzare un indirizzo IP statico. </h2> <p> Se stai utilizzando DHCP, disabilitalo e specifica un indirizzo IP statico su entrambi i computer di rete. </p> <p> </p> <h2> Metodo 2. Aggiorna i driver di rete su entrambi i computer. </h2> <ul> <li> Se possiedi un computer portatile, prova quanto segue: <ul> <li> Se sei connesso tramite Wi-Fi, prova a copiare i file utilizzando la connessione Ethernet (LAN) o... </li> <li> Vai al sito di supporto del produttore del tuo laptop per scaricare e installare i driver di rete più recenti. </li> </ul> </li> <li> Se possiedi un computer desktop, scarica i driver più recenti per la tua scheda di rete dal sito di supporto del produttore della scheda madre. </li> </ul> <p><strong> MANCIA: </strong> Se non riesci a trovare il modello del tuo laptop o della tua scheda madre, procedi come segue: </p> <blockquote><p> 1.  Premi il tasto <strong> finestre </strong> <img src=\"images/image_thumb8_thumb_thumb-904.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo: <strong> devmgmt.msc </strong> &amp; clic <strong> ok </strong> per aprire &quot;Gestione dispositivi&quot; <strong> . </strong></p></blockquote> <p><img src=\"images/image_thumb-1-166.png\" alt=\"device manager\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> </p> <p> 3. In Gestione dispositivi espandere il <strong> Adattatori di rete. <br> </strong> 4. Fare clic con il pulsante destro del mouse sull&#39;adattatore di rete e fare clic su <strong> Aggiorna driver </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-946.png\" alt=\"update driver\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Consentire a Windows di cercare automaticamente un driver di aggiornamento per la scheda di rete. * </p></blockquote> <p><strong> *Nota: </strong> Se Windows non riesce a trovare un driver aggiornato, utilizza il nome dell&#39;adattatore (ad es. &quot;Scheda di rete Broadcom 802.11g&quot;) e cerca manualmente un driver aggiornato. </p> <p><img src=\"images/image_thumb-6-471.png\" alt=\"search for drivers\" loading=\"lazy\"></p> <p> </p> <p> </p> <h2> Metodo 3. Disabilita temporaneamente antivirus o firewall. </h2> <p> Il metodo successivo per risolvere il problema &quot;Il periodo di semaforo è scaduto&quot; consiste nel disabilitare temporaneamente Windows Firewall e il programma antivirus. Per disabilitare Windows Firewall: </p> <p> 1.  Premi il tasto <strong> finestre </strong> <img src=\"images/image_thumb8_thumb_thumb-462.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Tipo: <strong> controllo </strong> &amp; clic <strong> ok </strong><strong> . </strong></p> <p><img src=\"images/image_thumb7-807.png\" alt=\"control panel command\" loading=\"lazy\"></p> <p> </p> <p> 3. Imposta &quot;Visualizza per:&quot;  su <strong> Piccole icone </strong> per visualizzare tutti gli elementi del pannello di controllo. </p> <p> </p> <p><img src=\"images/image_thumb8-567.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Apri <strong> firewall di Windows </strong> (o &quot;Windows Defender Firewall&quot; in Windows 10). </p> <p><img src=\"images/image_thumb-7-921.png\" alt=\"disable firewall wiindows\" loading=\"lazy\"></p> <p> </p> <p> 5. Fare clic su <strong> Attiva o disattiva Windows Firewall </strong> . </p> <p><img src=\"images/image_thumb-8-655.png\" alt=\"turn off windows defender firewall\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Dai un&#39;occhiata </strong> il &quot; <strong> Disattiva Windows Firewall (non consigliato) </strong> &quot; opzione e fare clic <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-9-907.png\" alt=\"turn off windows firewall\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Ricomincia </strong> computer e quindi copiare i file. * </p> <p> * Nota: dopo aver copiato i file, segui i passaggi precedenti per riattivare Windows Firewall. </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}