{"title":"FIX: problema di utilizzo del disco elevato di SrTasks.exe (risolto)","content":"<p> Il seguente problema potrebbe apparire su un computer basato su Windows 10. Il &quot;SrTasks.exe&quot; fa funzionare il disco al 100%. Il processo &quot;SrTasks.exe&quot; (Microsoft System Protection Background Tasks) è un processo legittimo di Windows e veniva utilizzato per avviare il servizio Copia Shadow del volume e il servizio Provider di copie shadow del software Microsoft. </p> <p> Il processo &quot;SrTasks.exe&quot; avvia i relativi servizi necessari per creare punti di ripristino e normalmente non dovrebbe influenzare le prestazioni del sistema in modo continuo, soprattutto nei sistemi in cui la &quot;Protezione del sistema&quot; è disabilitata. </p> <p><img src=\"images/image_thumb-58-374.png\" alt=\"FIX SrTasks.exe High Disk Usage - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Questo tutorial contiene le istruzioni per risolvere il problema di utilizzo del disco al 100% di SrTasks.exe su Windows 10. </p> <h4> Come risolvere l&#39;utilizzo elevato del disco di SrTasks.exe in Windows 10 </h4> <p> </p> <h6> Metodo 1. Scansiona il tuo computer alla ricerca di malware e virus. </h6> <p> Il primo passo per risolvere il problema &quot;Utilizzo elevato del disco di SrTasks.exe&quot; è assicurarsi che il sistema sia privo di virus/malware. Per questo compito segui le istruzioni in questa guida: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Come eseguire la scansione del computer alla ricerca di virus e altri programmi dannosi. </a></p> <p> </p> <h6> Metodo 2. Disabilita la protezione del sistema. </h6> <p> Il secondo metodo per risolvere il problema dell&#39;utilizzo elevato del disco causato dal processo &quot;SrTasks.exe&quot; consiste nel disabilitare la Protezione ripristino configurazione di sistema sul PC. Fare quello: </p> <p> 1. Apri Windows Explorer, fai clic con il pulsante destro del mouse su &quot;Questo PC&quot; e scegli <strong> Proprietà </strong> . </p> <p><img src=\"images/image_thumb-70-978.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Scegli <strong> Protezione del sistema </strong> a sinistra. </p> <p><img src=\"images/image_thumb-71-135.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Evidenzia il <strong> Disco locale C: (Sistema) </strong> e clicca <strong> Configura. </strong></p> <p><img src=\"images/image_thumb-59-973.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. In Opzioni di protezione del sistema, seleziona <strong> Disabilita la protezione del sistema </strong> e clicca <strong> OK. * </strong></p> <p> </p> <p> * Nota: se la &quot;Protezione del sistema&quot; è già disabilitata, passa al metodo successivo. </p> <p><img src=\"images/image_thumb-60-732.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Ricomincia </strong> il tuo PC e quindi controlla se il problema di utilizzo del disco elevato è stato risolto. Se il problema persiste, riattivare la protezione del sistema e passare al metodo successivo. </p> <p> </p> <h6> Metodo 3. Disabilita il servizio Superfetch. </h6> <p> In molti casi, il problema dell&#39;utilizzo del disco al 100% viene risolto dopo aver disabilitato il servizio Superfetch. Per disabilitare il servizio &quot;Superfetch&quot;: </p> <p> 1. Premi Finestre <img src=\"images/image_thumb8_thumb_thumb-289.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tasti per aprire la finestra dei comandi di esecuzione. <br> 2. Nella casella Cerca, digita: <strong><em> servizi.msc </em></strong> &amp; clic <strong> ok </strong> . </p> <p><img src=\"images/image_thumb-12-431.png\" alt=\"services.msc\" loading=\"lazy\"></p> <p> </p> <p> 3. Nell&#39;elenco dei servizi, fare doppio clic sul servizio Superfetch per aprire le sue proprietà. <br> 4. Imposta il &quot;Tipo di avvio&quot; su <strong> Disabilitato </strong> poi <strong> OK. </strong></p> <p><img src=\"images/image_thumb-61-575.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Ricomincia </strong> il tuo computer. Se dopo il riavvio il problema persiste, riattivare il servizio &quot;SuperFetch&quot; e passare al metodo successivo. </p> <p> </p> <h6> Metodo-4. Esegui Check Disk per trovare e correggere gli errori del disco rigido. </h6> <p> 1. Apri <strong> Prompt dei comandi come amministratore </strong> . Fare quello: </p> <p> </p> <p> 1. Premere il tasto <strong> finestre <img src=\"images/image_thumb-97-652.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> tasti per aprire la casella di comando &#39;Esegui&#39; <strong><br> </strong> 2. Tipo <strong> CMD </strong> e poi premere <strong> CTRL </strong> + <strong> CAMBIO </strong> + <strong> ACCEDERE. </strong></p> <p><img src=\"images/image_thumb-35-581.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Al prompt dei comandi dare il seguente comando per riparare il disco e premere <strong> accedere </strong> . </p> <ul> <li><strong> chkdsk C: /F /R </strong></li> </ul> <p> 3. Premere il tasto <strong> sì </strong> tasto per programmare il controllo al prossimo riavvio. <br> 4. <strong> Ricomincia </strong> il tuo computer. </p> <p><img src=\"images/image_thumb-62-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Ora attendi che il processo di controllo del disco finisca. (ci vorranno diverse ore). <br> 6. Una volta completato il processo di verifica del disco, controllare se &quot;SrTasks.exe High Disk Usage&quot; è stato risolto. </p> <p> </p> <p> </p> <h6> Metodo 5. Risolvere i problemi di Windows eseguendo le Attività di manutenzione. </h6> <p> 1. Vai a <strong> Pannello di controllo </strong> e apri <strong> Risoluzione dei problemi </strong> . * </p> <p> * Nota: se non vedi il <strong> Risoluzione dei problemi </strong> opzione, imposta &#39;Visualizza per&#39; su <strong> Piccole icone. </strong></p> <p><img src=\"images/image_thumb-63-494.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. In &quot;Sistema e sicurezza&quot;, seleziona <strong> Esegui attività di manutenzione </strong> . </p> <p><img src=\"images/image_thumb-27-812.png\" alt=\"run maintenance in windows 10 & Windows 8\" loading=\"lazy\"></p> <p> </p> <p> 3. Premere <strong> Il prossimo </strong> e quindi attendere che l&#39;utilità di manutenzione del sistema rilevi i problemi. <br> 4. Seguire le istruzioni sullo schermo per risolvere i problemi rilevati. </p> <p> </p> <h6> Metodo 6. Riparare i file di sistema di Windows. </h6> <p> Un altro metodo per risolvere il problema dell&#39;utilizzo del disco elevato di SrTasks.exe in Windows 10 consiste nel riparare Windows utilizzando i comandi DISM e SFC. </p> <p> 1. Apri <strong> Prompt dei comandi come amministratore </strong> . <br> 2. Nel prompt dei comandi dare il seguente comando e premere <strong> Accedere: </strong></p> <ul> <li><strong> DISM.exe /Online /Cleanup-image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-583.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Quando l&#39;operazione DISM è completata, digita il seguente comando e premi <strong> accedere </strong> : </p> <ul> <li><strong> sfc /scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-428.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Ora attendi che il Controllo file di sistema ripari i file di sistema di Windows. <br> 5. Fatto questo, <strong> ricomincia </strong> il tuo computer. </p> <p> </p> <p> È tutto gente! Ha funzionato per te? <br> Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}