{"title":"Modulo di contatto 7 non funzionante: si è verificato un errore nell&#39;invio del messaggio. Per favore riprova più tardi. (Risolto)","content":"<p> Se il modulo di contatto 7 sul tuo sito WordPress non funziona, continua a leggere di seguito per risolvere il problema. Contact Form 7, è uno dei plugin WordPress gratuiti più famosi, che ti aiuta a creare, gestire e personalizzare il modulo di contatto nel tuo sito WordPress. Di recente, ho scoperto che il plug-in &quot;Contact Form 7&quot; sul mio sito (e in molti altri) ha smesso di funzionare con l&#39;errore &quot;C&#39;è stato un errore per inviare il tuo messaggio. Riprova più tardi&quot;, che è circondato da un rettangolo arancione , dopo aver inviato il modulo. </p> <p><img src=\"images/image_thumb-14-729.png\" alt=\"Contact Form 7: There was an error to send your message. Please try again later\" loading=\"lazy\"></p> <p> Questo tutorial contiene le istruzioni per correggere l&#39;errore &quot;Si è verificato un errore nell&#39;invio del messaggio. Riprova più tardi&quot; all&#39;interno di una casella arancione, dopo aver inviato il modulo di contatto. </p> <h4> Come risolvere: modulo di contatto non funzionante con errore &quot;Si è verificato un errore nell&#39;invio del messaggio&quot;. </h4> <p> Se il tuo Contact Form 7 sul tuo sito WordPress non funziona più, segui i passaggi seguenti: </p> <h6> Passaggio 1. Convalidare il modulo di contatto 7. </h6> <p> 1. Vai alla dashboard di amministrazione di WordPress e fai clic su <strong> Contatto </strong> &gt; <strong> Moduli di contatto. </strong><br> 2. Nella parte superiore della pagina, controlla se c&#39;è un messaggio di errore che dice &quot;L&#39;errata configurazione porta a un errore di consegna della posta o ad altri problemi. Convalida i tuoi moduli di contatto ora&quot;. <br> 3. Se vedi quel messaggio,* allora <strong> clic </strong> il <strong> Convalida la configurazione del modulo di contatto 7 </strong> collegamento. </p> <p> * Nota: se non vedi quel messaggio, vai al passaggio 2. </p> <p><img src=\"images/image_thumb-813.png\" alt=\"Validate Contact Form 7 Configuration \" loading=\"lazy\"></p> <p> 4. Nella schermata successiva, fare clic su <strong> Convalida ora 2 moduli di contatto </strong> pulsante. </p> <p><img src=\"images/image_thumb-1-270.png\" alt=\"Validate Contact Form\" loading=\"lazy\"></p> <p> 5. Una volta completata la convalida della configurazione, dovresti ricevere il messaggio &quot;Nessun modulo di contatto non valido trovato&quot;. </p> <p><img src=\"images/image_thumb-17-318.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Prova il tuo modulo di contatto e se l&#39;errore persiste, continua con il passaggio 2 di seguito. </p> <h6> Passaggio 2. Configura il modulo di contatto 7 con le chiavi reCAPTCHA V3. </h6> <p> Durante la mia ricerca, ho scoperto che le ultime versioni del Contact Form 7 (v5.1 e successive) utilizzano l&#39;API reCAPTCHA v3 per proteggerti dallo spam e da altri tipi di abusi automatici. Quindi, in base a questo, hai le seguenti due opzioni per risolvere l&#39;errore del modulo di contatto &quot;Si è verificato un errore nell&#39;invio del messaggio. Riprova più tardi.&quot;: * </p> <ul> <li> <p><strong> Opzione 1. </strong> Per configurare Contact Form 7 con i tasti reCAPTCHA V3. </p> </li> <li> <p><strong> Opzione 2. </strong> Per usare il <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"noopener noreferrer\"> Modulo di contatto 7 – reCaptcha v2 </a> plugin per i tuoi moduli di contatto. </p> </li> </ul> <p> * Nota: in questo articolo, ti mostrerò come configurare Contact Form 7 con le chiavi reCAPTCHA V3. Se non desideri utilizzare la protezione reCAPTCHA V3, disinstalla il plug-in &quot;Contact Form 7&quot; e installa il <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"nofollow noopener\"> Modulo di contatto 7 – reCaptcha v2 </a> collegare. </p> <p><strong> Per configurare il modulo di contatto 7 con le chiavi reCAPTCHA V3: </strong></p> <p> 1. Accedi al tuo account Google, che hai utilizzato per impostare reCAPTCHA sul tuo sito e vai al <a href=\"https://www.google.com/recaptcha/admin\" target=\"_blank\" rel=\"nofollow noopener\"> Console di amministrazione reCAPTCHA di Google. </a></p> <p> 2. Fare clic su Impostazioni <img src=\"images/image_thumb-2-494.png\" alt=\"image\" loading=\"lazy\"> icona. </p> <p><img src=\"images/image_thumb-3-786.png\" alt=\"Setup Contact Form 7 with recaptcha v3\" loading=\"lazy\"></p> <p> 3. Fare clic su <strong> Cestino </strong> icona <img src=\"images/image_thumb-4-167.png\" alt=\"image\" loading=\"lazy\"> e <strong> Elimina </strong> il <strong> chiavi reCAPTCHA V2. </strong></p> <p><img src=\"images/image_thumb-5-757.png\" alt=\"Recaptcha v3\" loading=\"lazy\"></p> <p> 4. Fare clic sull&#39;icona Più <img src=\"images/image_thumb-6-851.png\" alt=\"image\" loading=\"lazy\"> per registrare nuovamente il tuo sito. </p> <p><img src=\"images/image_thumb-7-337.png\" alt=\"Register Site with Recaptcha\" loading=\"lazy\"></p> <p> 5. Nella schermata &quot;Registra un nuovo sito&quot;: </p> <blockquote> <p> un. <strong> Digita un nome </strong> per identificare il tuo sito in futuro, <br> b. <strong> Scegliere </strong> il <strong> reCAPTCHA v3 </strong> genere. <br> c. <strong> genere </strong> il <strong> nome del dominio </strong> del tuo sito. <br> d. <strong> Accettare </strong> il <strong> Termini di servizio di reCAPTCHA. </strong><br> e. Clic <strong> INVIA. </strong></p> </blockquote> <p><img src=\"images/image_thumb-8-227.png\" alt=\"Register Site with Recaptcha V3\" loading=\"lazy\"></p> <p> 6. Dopo la registrazione, viene visualizzata una schermata con il pulsante <strong> CHIAVE DEL SITO </strong> e il <strong> CHIAVE SEGRETA </strong> . <br> 7. Fare clic su <strong> COPIA CHIAVE DEL SITO </strong> e <strong> NON CHIUDERE </strong> questa finestra. </p> <p><img src=\"images/image_thumb-9-995.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. In un&#39;altra finestra del browser, vai alla dashboard di amministrazione di WordPress e fai clic su <strong> Contatto </strong> &gt; <strong> Integrazione. </strong></p> <p> 9. Fare clic su <strong> Integrazione della configurazione </strong> pulsante. </p> <p><img src=\"images/image_thumb-10-834.png\" alt=\"Integrate Recaptcha in Contact Form 7\" loading=\"lazy\"></p> <p> 10. Fare clic su <strong> Rimuovere le chiavi </strong> pulsante per eliminare le chiavi reCAPTCHA V2. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"image\" loading=\"lazy\"></p> <p> 11. <strong> Incolla </strong> il nuovo <strong> Chiave del sito </strong> e poi copia e incolla il nuovo <strong> Chiave segreta </strong> dalla console di amministrazione di reCAPTCHA e fare clic su <strong> Salvare le modifiche. </strong></p> <p><img src=\"images/image_thumb-12-147.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. <strong> Elimina </strong> il <strong> cache </strong> sul tuo sito. <br> 13. Apri una nuova finestra del browser e prova il modulo di contatto. </p> <p> È tutto gente! Ha funzionato per te? Per favore lascia un commento nella sezione commenti qui sotto o ancora meglio: metti mi piace e condividi questo post del blog nei social network per aiutare a spargere la voce su questa soluzione. </p>"}