{"title":"修正：すでにコンソールセッションが進行中であるため、コンピューターが別のコンソールセッションに接続できませんでした。 （解決済み）","content":"<p> Windowsベースのコンピューターでは、リモートデスクトップ接続に次のエラーが表示されます：「コンソールセッションが既に進行中であるため、コンピューターはリモートコンピューターのコンソールセッションに接続できませんでした」。 </p> <p> </p> <p><img src=\"images/image_thumb-3-627.png\" alt=\"Your computer could no connect to console session on the remote computer because you already have a console session in progress.\" loading=\"lazy\"></p> <p> </p> <p> このチュートリアルには、次のリモートデスクトップ接続エラーを解決する手順が含まれています：「コンソールセッションが既に進行中であるため、コンピューターはリモートコンピューターのコンソールセッションに接続できませんでした」。 </p> <h4> 修正方法：コンソールセッションがすでに進行中であるため、リモートデスクトップ接続を接続できませんでした。 </h4> <p> 「コンソールセッションが既に進行中のため、コンピューターはリモートコンピューターのコンソールセッションに接続できませんでした」というエラーは、コンピューターのネットワークアダプターの1つ（からのRDP）がコンピューターと同じIPアドレスを持っているために発生します。リモートデスクトップを介して接続しようとしているもの。 </p> <p> 例：リモートコンピューターのIPアドレスが「192.168.1.157」の場合は、次の手順に従います。 </p> <p> 1.開く <strong> 管理者としてのコマンドプロンプト </strong> コンピューター上（からのRDP）。 <br> 2.次のコマンドを実行して、PCに割り当てられたIPv4アドレスを表示します。 </p> <ul> <li><strong> ipconfig </strong></li> </ul> <p> </p> <p> 3.次に、ローカルコンピューター（RDPから）で、リモートコンピューター（RDPから）と同じIPアドレスを持つネットワークアダプターを見つけます。 <br> 4.ローカルコンピューターでリモートコンピューターと同じIPアドレスを持つLANアダプターを見つけたら、次に進み、そのアダプターのIPアドレスを別のアダプターに変更します。 * </p> <p> 例えばこの例では、リモートコンピューターのIPは「192.168.1.157」であるため、（ローカルコンピューター上の）イーサネットアダプターのIPアドレスを別のアドレスに変更する必要があります。宛先：「192.168.1.160」。 </p> <p><img src=\"images/image_thumb-5-946.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> *注：ローカルネットワーク上のIPアドレスがDHCPサーバーによって割り当てられている場合、問題を回避するために次のオプションがあります。 </p> <blockquote><p> a。別の静的IPアドレスを手動で指定します。 <br> b。 DHCPサーバーから別のIPアドレスを「取得」するために、ルーター（DHCPサーバー）を再起動します。 <br> c。 DHCPサーバー（ルーターなど）を構成し、リモートコンピューターのIPアドレスを含まない範囲にIPアドレスを指定します。 （例：「192.168.1.200-192.168.1.250」 </p></blockquote> <p> </p> <p> 5.ローカルコンピューター（からのRDP）のIPアドレスを変更した後、リモートデスクトップ接続を開き、リモートコンピューターへの接続を試みます。 「すでにコンソールセッションが進行中であるため、コンピュータは別のコンソールセッションに接続できませんでした」というエラーを解決する必要があります。 </p> <p> </p> <p> それはすべての人々です！それはあなたのために働きましたか？ </p> <p> 以下のコメントセクションにコメントを残してください。このソリューションについての情報を広めるために、ソーシャルネットワークでこのブログ投稿を高く評価して共有してください。 </p>"}