{"title":"FIX 0xC1900101 – 0x40017: Instalacja nie powiodła się w fazie SECOND_BOOT w Windows 10 Update. (Rozwiązany)","content":"<p> Ten samouczek zawiera instrukcje naprawy błędu aktualizacji systemu Windows 10 0xC1900101 – 0x40017: „Instalacja nie powiodła się w fazie SECOND_BOOT z błędem podczas operacji BOOT”. </p> <p> </p> <p><img src=\"images/image_thumb-63-307.png\" alt=\"FIX 0xC1900101 – 0x40017 Installation failed in SECOND_BOOT phase \" loading=\"lazy\"></p> <p> </p> <p> Problem z aktualizacją systemu Windows 10 0xC1900101 – 0x40017 w szczegółach: Podczas próby uaktualnienia systemu Windows 10 do najnowszej wersji (kompilacji) lub podczas próby uaktualnienia systemu z Windows 7 lub 8.1 do Windows 10 instalacja zatrzymuje się z błędem „Nie mogliśmy” t zainstalować Windows 10 – 0xC1900101 – 0x40017 – Instalacja nie powiodła się w fazie SECOND BOOT z błędem podczas operacji BOOT”, a następnie powraca do poprzedniej wersji Windows. </p> <h2> Jak naprawić błąd aktualizacji systemu Windows 10 0xC1900101 – 0x40017 „Instalacja nie powiodła się w fazie SECOND_BOOT z błędem podczas operacji BOOT” </h2> <p> Kod błędu 0xC1900101 – 0x40017 podczas aktualizacji systemu Windows 10 wskazuje na problem z niekompatybilnym urządzeniem, sterownikiem lub programem w systemie. Tak więc, zanim będziesz kontynuować stosowanie poniższych metod, zastosuj następujące: </p> <p> </p> <p> 1. Przede wszystkim upewnij się, że ustawienia daty i godziny są prawidłowe. <br> 2. Następnie upewnij się, że masz wystarczająco dużo wolnego miejsca. Windows 10 wymaga co najmniej 32 GB wolnego miejsca na aktualizację. Aby zwolnić miejsce na dysku, użyj <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Czyszczenie dysku </a> . <br> 3. Zainstaluj najnowsze sterowniki dla wszystkich urządzeń w systemie, zwłaszcza dla karty sieciowej Ethernet i bezprzewodowej (jeśli jest). * <br> 4. Odłącz wszystkie zewnętrzne dyski USB i karty SD oraz wszelkie inne urządzenia USB, które nie są potrzebne. <br> 5. Jeśli używasz programu antywirusowego innej firmy, wyłącz go tymczasowo lub -lepiej- odinstaluj. <br> 6. Wyłącz szyfrowanie dysku twardego (jeśli jest włączone). <br> 7. Na koniec, przed ponownym uruchomieniem komputera w celu zainstalowania aktualizacji, odłącz się od sieci. (np. odłącz kabel Ethernet lub wyłącz adapter Wi-Fi). </p> <p><strong> * Uwaga: </strong> Jeśli po zastosowaniu instrukcji zawartych w tym artykule instalacja aktualizacji do systemu Windows 10 nadal nie powiedzie się, kontynuuj i zaktualizuj również BIOS (oprogramowanie układowe) w swoim systemie. </p> <h6> Metoda 1. Uruchom narzędzie do rozwiązywania problemów z Windows Update. </h6> <p> Pierwszą metodą naprawienia błędu aktualizacji systemu Windows 10 0xC1900101 – 0x4001E jest uruchomienie narzędzia do rozwiązywania problemów z Windows Update. </p> <p> 1. Przejdź do Windows <strong> Panel sterowania </strong> , ustaw „Wyświetl według” na <strong> Małe ikony </strong> i otwarte <strong> Rozwiązywanie problemów. </strong></p> <p><img src=\"images/image_thumb-5-978.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. W opcjach rozwiązywania problemów kliknij <strong> Napraw problemy z Windows Update. </strong></p> <p><img src=\"images/image_thumb-9-833.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Kliknij <strong> Kolejny </strong> do rozwiązywania problemów z aktualizacją systemu Windows. </p> <p><img src=\"images/image_thumb-8-522.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Po zakończeniu procesu rozwiązywania problemów <strong> blisko </strong> narzędzie do rozwiązywania problemów i <strong> uruchom ponownie </strong> Twój komputer. <br> 6. Sprawdź aktualizacje. </p> <p> </p> <h6></h6> <h6></h6> <h6> Metoda 2. <strong> Usuń folder „SoftwareDistribution”. </strong></h6> <p> „C:\\Windows\\ <strong> Dystrybucja oprogramowania </strong> “ folder, to lokalizacja, w której system Windows przechowuje aktualizacje systemu Windows. Wiele razy ten folder ulega uszkodzeniu i musisz go ponownie utworzyć, aby pobrać aktualizacje od zera. Aby odbudować (odtworzyć) folder „SoftwareDistribution”, wykonaj następujące czynności: </p> <p><strong> Krok 1: Zatrzymaj usługę Windows Update. </strong></p> <p> 1. Otwórz panel sterowania Windows Services: Aby to zrobić: </p> <ul> <li> Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-650.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. </li> <li> W polu wyszukiwania wpisz: <strong><em> services.msc </em></strong> &amp; Kliknij <strong> dobrze </strong> . </li> <li> (Zaakceptuj ostrzeżenie UAC, jeśli się pojawi). </li> </ul> <p><img src=\"images/image_thumb-12-595.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. W panelu sterowania Usługi zlokalizuj „ <strong> Aktualizacja systemu Windows&quot; </strong> usługa. <br> 3. Kliknij prawym przyciskiem myszy <strong> Aktualizacja systemu Windows </strong> usługę i wybierz „ <strong> Zatrzymać </strong> ”. </p> <p><img src=\"images/image_thumb-9-376.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Krok 2: Usuń folder SoftwareDistribution. </strong></p> <p> 1. Otwórz Eksploratora Windows i przejdź do: <strong> C:\\Windows </strong> teczka. <br> 2. Znajdź i <strong> Kasować </strong> „ <strong><em> Dystrybucja oprogramowania </em></strong> ” (lub zmień jego nazwę, np. na „SoftwareDistributionOLD”) . </p> <p> </p> <p><img src=\"images/image_thumb-10-350.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p><strong> Krok 3: Uruchom usługę Windows Update. </strong></p> <p> 1. Otwórz panel sterowania usług Windows. <br> 2. Kliknij prawym przyciskiem myszy <strong> Aktualizacja systemu Windows </strong> usługę i wybierz „ <strong> Początek </strong> ”. </p> <p><img src=\"images/image_thumb-11-613.png\" alt=\"start windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Krok 4: Sprawdź i zainstaluj aktualizację systemu Windows 10. </strong></p> <p> 1. Przejdź do <strong> Ustawienia </strong> -&gt; <strong> Aktualizacja i bezpieczeństwo </strong> i kliknij <strong> Sprawdź aktualizacje </strong> . </p> <p> </p> <h6> Metoda 3. Zaktualizuj system Windows 10 za pomocą Asystenta aktualizacji </h6> <p> 1. Przejdź do <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Witryna pobierania systemu Windows 10 </a> i kliknij <strong> Aktualizuj teraz </strong> przycisk. </p> <p><img src=\"images/image_thumb-60-575.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Zapisz plik „Windows10Upgrade9252.exe” na pulpicie. <br> 3. Kliknij dwukrotnie pobrany plik, aby otworzyć <strong> Asystent aktualizacji systemu Windows </strong> . <br> 4. Kliknij <strong> Aktualizuj teraz </strong> aby rozpocząć aktualizację. </p> <p><img src=\"images/image_thumb-61-861.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Pozwól systemowi Windows zakończyć pobieranie i weryfikację. <br> 6. Gdy weryfikacja osiągnie 100%, <strong> odłącz komputer od Internetu </strong> lub ustaw go na „ <strong> Tryb samolotowy </strong> &quot;. <br> 7. Poczekaj, aż system Windows zaktualizuje system. <br> 8. Po wyświetleniu monitu uruchom ponownie system, aby zainstalować aktualizację. </p> <h6></h6> <h6> Metoda 4. Zaktualizuj system Windows 10 z ISO/USB. </h6> <p> Następną metodą naprawienia błędu aktualizacji systemu Windows 10 „Instalacja nie powiodła się w fazie SECOND_BOOT” jest aktualizacja systemu Windows 10 z pliku ISO systemu Windows. Aby to zrobić: </p> <p><strong> Krok 1. Pobierz system Windows 10 w pliku ISO. </strong></p> <p> 1. Przejdź do <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Strona pobierania systemu Windows 10 </a> i pobierz <strong> Narzędzie do tworzenia mediów </strong> . </p> <p><img src=\"images/image_thumb-62-759.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Uruchom „Narzędzie do tworzenia multimediów” i <strong> Zaakceptować </strong> Warunki licencji na pierwszym ekranie. <br> 3. Wybierz <strong> Utwórz nośnik instalacyjny dla innego komputera </strong> . </p> <p><img src=\"images/image_thumb1_thumb-893.png\" alt=\"create Windows 10 DVD\" loading=\"lazy\"></p> <p> </p> <p> 4. Na ekranie „Język, architektura i edycja” kliknij <strong> Kolejny. <br> </strong> 5. Wybierz <strong> Plik ISO </strong> i kliknij <strong> Kolejny </strong> . </p> <p><img src=\"images/image_thumb-30-122.png\" alt=\"download windows 10 iso\" loading=\"lazy\"></p> <p> 6. <strong> Zapisać </strong> plik „Windows.iso” na pulpit. <br> 7. Media Creation Tool rozpocznie teraz pobieranie systemu Windows 10 w formacie ISO. <br> 8. Po zakończeniu pobierania <strong> blisko </strong> narzędzie do tworzenia multimediów. </p> <p> </p> <p><strong> Krok 2. Zaktualizuj system Windows 10 z pliku ISO. </strong></p> <p> 1. <strong> Odłącz komputer od Internetu </strong> , (lub ustaw „Tryb samolotowy”, jeśli masz laptopa). <br> 2. <strong> Wyłączyć </strong> lub <strong> tymczasowo odinstaluj </strong> każdy <strong> antywirus innych firmparty </strong> . <br> 3. Następnie kliknij prawym przyciskiem myszy plik „Windows.iso” (na pulpicie) i kliknij <strong> Uchwyt </strong> . <br> 4. Kliknij dwukrotnie na <strong> Ustawiać </strong> podanie. </p> <p><img src=\"images/image_thumb-36-800.png\" alt=\"windows 10 setup\" loading=\"lazy\"></p> <p> </p> <p> 5. Na poniższym ekranie wybierz <strong> &#39;Nie teraz&#39; </strong> i kliknij <strong> Kolejny </strong> . </p> <p><img src=\"images/image_thumb-11-579.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Postępuj zgodnie z pozostałymi instrukcjami wyświetlanymi na ekranie, aby zaktualizować system. </p> <h4></h4> <h6> Metoda 5. Czysta instalacja systemu Windows 10. </h6> <p> Ostatnią metodą rozwiązania problemów z aktualizacją systemu Windows 10 jest wykonanie czystej instalacji systemu Windows 10 w systemie. </p> <p><strong> Ważny: </strong> Czysta instalacja systemu Windows 10 oznacza, że ​​wszystkie pliki i ustawienia zostaną utracone podczas procesu instalacji. Więc kontynuuj i <strong> przed kontynuowaniem wykonaj kopię zapasową wszystkich ważnych plików i ustawień na innym nośniku pamięci </strong> . (np. na zewnętrzny dysk USB). </p> <p> Aby wykonać czystą instalację systemu Windows 10, przeczytaj instrukcje zawarte w tym artykule: <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak wyczyścić instalację systemu Windows 10 </a></p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}