{"title":"Jak wyświetlić nagłówki wiadomości bez otwierania wiadomości e-mail w programie Outlook 2016/2019.","content":"<p> Jak być może wiesz, „Nagłówki wiadomości” (inaczej „Źródło wiadomości” lub „Nagłówki internetowe” w programie Outlook) zawierają wszystkie szczegóły techniczne otrzymanej wiadomości e-mail. Mówiąc dokładniej, „Nagłówki wiadomości” wiadomości e-mail zawierają, oprócz zwykłych informacji (nadawca, czas wysłania itp.), oprogramowanie użyte do utworzenia wiadomości oraz serwery, które przeszły przed jej dostarczeniem do Ciebie . </p> <p> Aby wyświetlić źródło/nagłówki wiadomości w aplikacji komputerowej Microsoft Outlook, możesz użyć jednego z następujących sposobów: </p> <ol> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Jak wyświetlić nagłówki wiadomości w Outlooku 2016/2019 po otwarciu wiadomości e-mail? </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Jak wyświetlić nagłówki wiadomości w programie Outlook 2016/2019 bez otwierania wiadomości e-mail. </a></li> </ol> <p> </p> <h2> Jak wyświetlić nagłówki wiadomości w Outlooku 2016/2019 po otwarciu wiadomości e-mail. </h2> <p> Zwykłym sposobem wyświetlenia źródła wiadomości e-mail w programie Microsoft Outlook 2016/2019 jest otwarcie wiadomości e-mail i wyświetlenie jej właściwości: </p> <p> 1. Otwórz wiadomość e-mail (w osobnym oknie) i kliknij <strong> Plik </strong> menu. </p> <p><img src=\"images/image_thumb-36-771.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Od <strong> Plik </strong> menu, kliknij <strong> Nieruchomości </strong> . </p> <p><img src=\"images/image_thumb-37-974.png\" alt=\"View message headers outlook\" loading=\"lazy\"></p> <p> </p> <p> 3. Spójrz na <strong> nagłówki internetowe, </strong> aby wyświetlić źródło wiadomości e-mail (szczegóły). </p> <p> * Uwaga: zaznacz i skopiuj tekst nagłówków internetowych w Notatniku, aby ułatwić czytanie. </p> <p><img src=\"images/image_thumb-38-976.png\" alt=\"View Internet headers in Outlook\" loading=\"lazy\"></p> <p> </p> <h2> Jak wyświetlić nagłówki wiadomości w programie Outlook 2016/2019 bez otwierania wiadomości e-mail. </h2> <p> Problem z przeglądaniem źródła wiadomości (nagłówków internetowych) po otwarciu wiadomości e-mail polega na tym, że jeśli wiadomość zawiera złośliwe oprogramowanie, możesz narazić swój komputer na ryzyko. Aby tego uniknąć, postępuj zgodnie z poniższymi instrukcjami, aby móc odczytać źródło wiadomości bez otwierania wiadomości e-mail. </p> <p> 1. W głównym oknie Outlooka wybierz <strong> Plik </strong> -&gt; <strong> Opcje </strong> . <br> 2. Wybierz <strong> Dostosuj wstążkę </strong> po lewej i po prawej: </p> <p> za. W <strong> Wybierz polecenia z </strong> lista rozwijana, wybierz <strong> Polecenia nie na wstążce. <br> </strong> b. Upewnij się, że w zakładkach głównych <strong> Strona główna (poczta) </strong> jest zaznaczony i kliknij <strong> Nowa grupa </strong> a następnie kliknij <strong> Przemianować. </strong></p> <p><img src=\"images/image_thumb-39-295.png\" alt=\"How to view the Message Headers in Outlook 2016-2019 \" loading=\"lazy\"></p> <p> do. <strong> Przemianować </strong> „ <strong> Nowa grupa </strong> &quot; do &quot; <strong> Nagłówki internetowe </strong> &quot; i kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-40-856.png\" alt=\"image\" loading=\"lazy\"></p> <p> re. Teraz wybierz <strong> Opcje wiadomości </strong> z listy poleceń i kliknij <strong> Dodaj </strong> . </p> <p><img src=\"images/image_thumb-41-344.png\" alt=\"image\" loading=\"lazy\"></p> <p> mi. Teraz powinieneś zobaczyć „Opcje wiadomości” pod nowo utworzoną grupą („Nagłówki internetowe”). Kliknij <strong> dobrze </strong> zastosować zmiany <strong> . </strong></p> <p><img src=\"images/image_thumb-42-209.png\" alt=\"view message source without opening email outlook\" loading=\"lazy\"></p> <p> 3. Teraz na twoim <strong> Dom </strong> Powinieneś zobaczyć nowy przycisk o nazwie „Opcje wiadomości – Nagłówki internetowe”. <br> 5. Od teraz po prostu zaznacz wiadomość, którą chcesz wyświetlić, i kliknij przycisk „Opcje wiadomości”, aby wyświetlić źródło wiadomości bez konieczności otwierania wiadomości w jej własnym oknie. </p> <p><img src=\"images/image_thumb-43-460.png\" alt=\"view headers without opening email outlook\" loading=\"lazy\"></p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}