{"title":"Jak odszyfrować pliki zaszyfrowane EFS i usunąć szyfrowanie EFS w systemie Windows 10.","content":"<p> W poprzednim samouczku opisałem drogę do <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> zaszyfruj swoje pliki za pomocą szyfrowania EFS </a> . W tym samouczku dowiesz się, jak usunąć szyfrowanie EFS i jak odszyfrować zaszyfrowane pliki EFS po przeniesieniu ich na inny komputer. </p> <h4> Jak odszyfrować zaszyfrowane pliki EFS i wyłączyć szyfrowanie EFS. </h4> <ul> <li> <p><a href=\"#part-1\"> Część 1. Jak wyłączyć i usunąć szyfrowanie EFS na tym samym komputerze. </a></p> </li> <li> <p><a href=\"#part-2\"> Część 2. Jak odszyfrować pliki EFS na innym komputerze. </a></p> </li> </ul> <h6> Część 1. Jak wyłączyć i usunąć szyfrowanie EFS. </h6> <p> Podczas szyfrowania plików za pomocą EFS klucz odszyfrowywania (certyfikat) jest przechowywany lokalnie na komputerze, a pliki są już odszyfrowane. Jeśli chcesz wyłączyć szyfrowanie EFS, aby zatrzymać szyfrowanie plików/folderów: </p> <p> 1. Kliknij prawym przyciskiem myszy zaszyfrowany folder/plik i zmień <strong> Własność pliku </strong> do <strong> Osobisty </strong> . </p> <p><img src=\"images/image_thumb-26-500.png\" alt=\"how to disable efs encryption\" loading=\"lazy\"></p> <p> 2. Po zakończeniu powinieneś zobaczyć, że folder/plik jest odblokowany. Po prostu wykonaj te same kroki, aby usunąć szyfrowanie z każdego innego zaszyfrowanego folderu i pliku. </p> <p> 3. Teraz, jeśli nie używasz szyfrowania EFS do żadnego innego pliku/folderu i chcesz całkowicie usunąć klucz odzyskiwania EFS (aka „klucz odszyfrowywania – certyfikat”) ze swojego komputera: </p> <blockquote> <p> 1. Otwórz Internet Explorera i z <strong> Przybory </strong> wybór menu <strong> opcje internetowe </strong> . (lub otwórz <strong> opcje internetowe </strong> z <strong> Panel sterowania </strong> .) </p> <p> 2. W <strong> Zawartość </strong> kliknij kartę <strong> Certyfikaty </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-27-186.png\" alt=\"how to remove efs certificate-recovery key\" loading=\"lazy\"></p> <blockquote> <p> 3. Na karcie Osobiste wybierz certyfikat odszyfrowywania i kliknij <strong> Usunąć </strong> . * </p> <p><strong> * Uwaga: </strong> Upewnij się, że usunąłeś (zatrzymałeś) szyfrowanie wszystkich zaszyfrowanych plików przed usunięciem certyfikatu (klucza odszyfrowywania) </p> </blockquote> <p><img src=\"images/image_thumb-25-639.png\" alt=\"how to remove efs recovery key\" loading=\"lazy\"></p> <blockquote> <p> 4. <strong> Uruchom ponownie </strong> Twój komputer. </p> </blockquote> <h6></h6> <h6> Część 2: Jak odszyfrować zaszyfrowane pliki EFS na innym komputerze. </h6> <p> Jeśli przeniosłeś pliki zaszyfrowane EFS na inny komputer, jedynym sposobem przeglądania (otwierania) plików EFS jest posiadanie klucza deszyfrującego. Klucz odszyfrowywania to plik certyfikatu .pfx, który został wyeksportowany podczas szyfrowania plików. Jeśli nie masz klucza odszyfrowywania EFS, nie ma sposobu na odszyfrowanie plików EFS. </p> <p><strong> Aby odszyfrować zaszyfrowane pliki EFS, za pomocą klucza deszyfrującego – Certyfikat: </strong></p> <p> 1. Kliknij dwukrotnie klucz deszyfrujący (plik certyfikatu .pfx), aby go zainstalować. <br> 2. Na ekranie powitalnym Kreatora importu certyfikatów kliknij <strong> Kolejny </strong> . <br> 3. Następnie kliknij <strong> Kolejny </strong> jeszcze raz. </p> <p><img src=\"images/image_thumb38_thumb-158.png\" alt=\"How to Decrypt EFS Encrypted files\" loading=\"lazy\"></p> <p> 4. Wpisz hasło użyte podczas eksportowania klucza certyfikatu i kliknij <strong> Kolejny </strong> . </p> <p><img src=\"images/image_thumb39_thumb-680.png\" alt=\"install efs .pfx certificate\" loading=\"lazy\"></p> <p> 5. Pozostaw ustawienia domyślne w opcjach magazynu certyfikatów i kliknij <strong> Kolejny </strong> . </p> <p><img src=\"images/image_thumb40_thumb-629.png\" alt=\"image_thumb[40]\" loading=\"lazy\"></p> <p> 6. Na koniec kliknij <strong> koniec </strong> . </p> <p><img src=\"images/image_thumb41_thumb-225.png\" alt=\"image_thumb[41]\" loading=\"lazy\"></p> <p> </p> <p> 7. Teraz możesz otworzyć zaszyfrowane pliki. * </p> <p> * Uwaga: Po odszyfrowaniu plików postępuj zgodnie z instrukcjami na <a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> Część 1 </a> powyżej, aby całkowicie usunąć szyfrowanie, jeśli chcesz. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu </p>"}