{"title":"Jak przeglądać i eksportować hasła Firefoksa.","content":"<p> W tym samouczku pokażę, jak przeglądać i zarządzać zapisanymi hasłami w przeglądarce internetowej Mozilla Firefox. Jak już wiesz, przeglądarka Firefox oferuje opcję zapisania nazwy użytkownika i hasła logowania przy pierwszej wizycie na stronie. Jeśli zdecydujesz się zapisać swoje dane uwierzytelniające, Firefox je zapamięta i przy następnym logowaniu do witryny nie będziesz musiał ich ponownie wpisywać. </p> <p><img src=\"images/image_thumb-98-507.png\" alt=\"How to View and Export Firefox Passwords.\" loading=\"lazy\"></p> <p> Jeśli z biegiem czasu zapomnisz swoich danych logowania, przeczytaj ten samouczek, aby dowiedzieć się, jak przeglądać i eksportować zapisane hasła Firefoksa. </p> <h4> Jak zarządzać, wyświetlać i eksportować zapisane hasła w Mozilla Firefox. </h4> <p><strong> Jak przeglądać hasła do Firefoksa </strong></p> <p> 1. Z menu Firefox <img src=\"images/image_thumb-99-587.png\" alt=\"image\" loading=\"lazy\"> wybierać <strong> Login i hasła </strong> . </p> <p><img src=\"images/image_thumb-100-999.png\" alt=\"View Saved Passwords Firefox\" loading=\"lazy\"></p> <p> </p> <p> 2. Kliknij <strong> Pokaż hasła </strong> przycisk, aby wyświetlić zapisane hasła na stronach internetowych. Dodatkowo w tym oknie użyj <strong> Usunąć </strong> przycisk, aby usunąć zapisane hasła z Firefoksa. </p> <p><img src=\"images/image_thumb-101-863.png\" alt=\"Manage Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p><strong> Jak zapisać wszystkie hasła Firefoksa do pliku. </strong></p> <p> Aby wyświetlić i wyeksportować wszystkie zapisane hasła w Firefoksie: </p> <p> 1. Pobierz <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> HasłoFox </a> narzędzie ( <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> http://www.nirsoft.net/utils/passwordfox.html </a> ) <br> 2. Rozpakuj pobrany plik zip. <br> 3. W wyodrębnionym folderze kliknij dwukrotnie, aby uruchomić aplikację „PasswordFox.exe”. <br> 4. Naciśnij <strong> Ctrl </strong> + <strong> ZA </strong> aby wybrać wszystkie wymienione witryny, a następnie z <strong> Plik </strong> wybierz menu <strong> Zapisz wybrane pozycje. </strong></p> <p><img src=\"images/image_thumb-102-438.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Wpisz nazwę pliku .txt i kliknij <strong> Zapisać </strong> . </p> <p><img src=\"images/image_thumb-103-923.png\" alt=\"How to Save Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p> 6. Otwórz utworzony plik w notatniku, aby wyświetlić wszystkie zapisane hasła w przeglądarce Mozilla Firefox. </p> <p> To wszystko! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}