{"title":"Jak wyłączyć funkcję BitLocker w systemie Windows 10.","content":"<p> Ten samouczek zawiera instrukcje dotyczące wyłączania funkcji Bitlocker Protection i szyfrowania dysku w systemie Windows 10. Jak być może wiesz, funkcja szyfrowania BitLocker dostępna w wersjach Windows 10 pro i Enterprise może pomóc w ochronie zawartości komputera przed nieautoryzowanym dostępem. Czasami jednak istnieje potrzeba wyłączenia funkcji Bitlocker w systemie Windows 10, więc w tym przewodniku dowiesz się, jak to zrobić. </p> <p> Jeśli komputer jest chroniony funkcją BitLocker, po uruchomieniu systemu zostanie wyświetlony monit o podłączenie dysku USB, którego użyłeś podczas aktywacji funkcji BitLocker, lub wprowadzenie hasła funkcji BitLocker w celu odblokowania dysku C: w celu kontynuowania uruchamiania. Jeśli nie masz żadnego z nich, naciśnij <strong> WYJŚCIE </strong> aby wprowadzić klucz odzyskiwania funkcji BitLocker. * </p> <blockquote><p> * Uwagi: <br> 1. Jeśli klucz odzyskiwania Bitlocker lub hasło nie są akceptowane podczas uruchamiania systemu, spróbuj odblokować i odszyfrować dysk twardy na innym komputerze z systemem Windows 10 lub spróbuj: <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-recovery-environment-winre/\" target=\"_blank\" rel=\"nofollow noopener\"> Odblokuj i odszyfruj chroniony dysk w środowisku odzyskiwania systemu Windows (WinRE). </a><br> 2. Jeśli nie możesz odblokować dysku (np. nie jesteś właścicielem klucza odzyskiwania funkcji BitLocker lub ponieważ klucz BitLocker nie jest akceptowany) i chcesz usunąć szyfrowanie funkcją BitLocker, aby ponownie korzystać z chronionego dysku, przeczytaj ten samouczek: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak usunąć ochronę funkcją BitLocker z dysku bez klucza odzyskiwania funkcji BitLocker lub hasła </a> . </p></blockquote> <p><img src=\"images/image_thumb-53-752.png\" alt=\"How to Disable BitLocker in Windows 10 GUI - PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Po uruchomieniu systemu Windows postępuj zgodnie z poniższymi instrukcjami, aby wyłączyć ochronę bitlockerem i odszyfrować dysk. </p> <h4> Jak wyłączyć ochronę funkcją BitLocker i odszyfrować dysk zaszyfrowany funkcją BitLocker w systemie Windows 10. </h4> <p> Aby wyłączyć ochronę Bitlocker, musisz mieć hasło Bitlocker lub klucz odzyskiwania Bitlocker, aby najpierw odblokować dysk, a następnie go odszyfrować. </p> <p> Klucz odzyskiwania funkcji Bitlocker to 48-cyfrowy klucz numeryczny, który można znaleźć w następujących lokalizacjach: </p> <ul> <li> Na wydruku, który zapisałeś, gdy włączyłeś funkcję Bitlocker. </li> <li> Na dysku USB, którego użyłeś, podczas aktywacji funkcji Bitlocker, aby zapisać klucz odzyskiwania funkcji Bitlocker. </li> <li> Na <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Klucze odzyskiwania konta Microsoft </a> , korzystając z konta MS, którego używasz do logowania się do urządzenia, lub dodanego do urządzenia w celu pobierania aplikacji ze sklepu Microsoft Store, aktywacji pakietu MS Office lub poczty e-mail. </li> <li> Na Twoim <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Konto Azure </a> dla komputerów służbowych, które logują się przy użyciu konta Azure Active Directory. </li> </ul> <p> Po znalezieniu klucza odzyskiwania funkcji Bitlocker lub hasła bitlocker przejdź do odblokowania dysku zaszyfrowanego funkcją Bitlocker i usunięcia szyfrowania funkcją Bitlocker, korzystając z jednego z następujących sposobów: </p> <ul> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda 1. Wyłącz ochronę funkcją BitLocker z GUI systemu Windows. </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda 2. Wyłącz funkcję BitLocker i odszyfruj dysk zaszyfrowany funkcją BitLocker z programu PowerShell. </a></li> </ul> <p> </p> <h6> Metoda 1. Jak wyłączyć ochronę funkcją BitLocker w graficznym interfejsie użytkownika systemu Windows 10. </h6> <p> Aby wyłączyć ochronę na dysku systemowym C: </p> <p> 1. Przejdź do Windows <strong> Panel sterowania </strong> -&gt; <strong> System i bezpieczeństwo </strong> a następnie kliknij <strong> Szyfrowanie dysków bitlocker </strong> . </p> <p><img src=\"images/image_thumb-33-233.png\" alt=\"How to turn off or Turn Onn BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Obok napędu C: systemu operacyjnego kliknij <strong> Wyłącz funkcję BitLocker </strong> . * </p> <p> * Uwagi: <br> 1. Jeśli opcja „Wyłącz funkcję BitLocker” nie jest dostępna, otwórz <strong> wiersz polecenia jako administrator </strong> i wydaj następujące polecenie: </p> <ul> <li> zarządzanie-bde-off C: </li> </ul> <p> 2. Aby zobaczyć stan odszyfrowywania (postęp) dysku C:, wydaj to polecenie: </p> <ul> <li> zarządzanie-bde -stan C: </li> </ul> <p> </p> <p> </p> <p><img src=\"images/image_thumb-43-236.png\" alt=\"turn off bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Po wyłączeniu funkcji Bitlocker kliknij ikonę Bitlocker na pasku zadań, aby wyświetlić proces odszyfrowywania. </p> <p><img src=\"images/image_thumb-41-694.png\" alt=\"remove bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Aby wyłączyć ochronę na dowolnym innym dysku chronionym funkcją BitLocker z GUI systemu Windows: </p> <p> 1. Otwórz Eksploratora Windows, a następnie kliknij dwukrotnie zablokowany dysk. <br> 2. Wprowadź hasło Bitlocker lub kliknij <strong> Więcej opcji </strong> aby wprowadzić klucz odzyskiwania funkcji Bitlocker w celu odblokowania dysku. </p> <p><img src=\"images/image_thumb-47-646.png\" alt=\"unlock bitlocker windows 10\" loading=\"lazy\"></p> <p> 2. Po odblokowaniu dysku przejdź do <strong> Panel sterowania </strong> -&gt; <strong> System i bezpieczeństwo </strong> -&gt; <strong> Szyfrowanie dysków bitlocker </strong> a po wybraniu napędu kliknij <strong> Wyłącz funkcję BitLocker </strong> aby odszyfrować dysk. (patrz zrzuty ekranu powyżej) </p> <p> </p> <h6> Metoda 2. Jak wyłączyć ochronę funkcją BitLocker i odszyfrować dysk zaszyfrowany funkcją BitLocker z programu PowerShell w systemie Windows 10. </h6> <p> 1. Otwórz PowerShell jako Administrator. Aby to zrobić: </p> <ol> <li> <ol> <li> W <strong> Cortana </strong> pole wyszukiwania, wpisz <strong> powershell </strong></li> <li> Kliknij prawym przyciskiem myszy <strong> Windows PowerShell </strong> wynik i wybierz <strong> Uruchom jako administrator. </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb_thumb-1-316.png\" alt=\"disable bitlocker powershell windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Następnie sprawdź stan szyfrowania każdego dysku na komputerze, wpisując to polecenie: </p> <ul> <li><strong> zarządzanie-bde -stan </strong></li> </ul> <p> </p> <p> 3. Zanotuj, w której literze dysku wyświetlany jest stan blokady <strong> Zablokowany </strong> , a następnie przejdź do odblokowania tego dysku, wpisując to polecenie: * </p> <ul> <li><strong> manage-bde -unlock drive-letter: -rp BitLocker-recovery-key​ </strong></li> </ul> <p> * np.: Jeśli chcesz odblokować dysk „D:”, a klucz odzyskiwania bitlockera to: „123456-123456-123456-123456-123456-123456”, wpisz: </p> <ul> <li> <ul> <li> zarządzaj-bde -odblokuj D: -rp 123456-123456-123456-123456-123456-123456 </li> </ul> </li> </ul> <p> </p> <p> * Uwaga: Jeśli znasz hasło Bitlocker, wydaj to polecenie: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -pw BitLocker-Password </strong></li> </ul> <p> * np.: Jeśli chcesz odblokować dysk „D:” a hasło funkcji BitLocker to: „123qwerty” wpisz: * </p> <ul> <li> <ul> <li> zarządzanie-bde -odblokowanie D: -hasło 123qwerty </li> </ul> </li> </ul> <p> </p> <p> 4. Następnie wyłącz szyfrowanie bitlockerem i odszyfruj zaszyfrowany dysk za pomocą jednego z następujących poleceń: </p> <ul> <li><strong> Wyłącz-BitLocker-MountPoint „litera dysku:” </strong></li> <li><strong> management-bde -off drive-letter: </strong></li> </ul> <p> * np.: Jeśli chcesz wyłączyć szyfrowanie bitlockerem na dysku „D:”, wpisz: </p> <ul> <li> <ul> <li> Wyłącz funkcję BitLocker - MountPoint &quot;D:&quot; </li> </ul> </li> </ul> <blockquote> <p> LUB wpisz… </p> </blockquote> <ul> <li> <ul> <li> zarządzanie-bde-off D: </li> </ul> </li> </ul> <p> 5. Po zakończeniu procesu deszyfrowania przejdź do ponownego sprawdzenia stanu szyfrowania, wydając następujące polecenie: </p> <ul> <li><strong> zarządzanie-bde -stan </strong></li> </ul> <p> 6. Jeśli wyświetla się „Status blokady” <strong> Odblokowany </strong> i pojawi się „Stan konwersji” <strong> W pełni odszyfrowane, </strong> Jesteś skończony! </p> <p><img src=\"images/image_thumb-50-868.png\" alt=\"view bitlocker status\" loading=\"lazy\"></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym problemie. </p>"}