{"title":"Jak usunąć ochronę funkcją BitLocker z dysku systemowego C: bez klucza odzyskiwania funkcji BitLocker lub hasła.","content":"<p> Ten artykuł zawiera instrukcje krok po kroku dotyczące usuwania ochrony funkcją BitLocker z dysku systemowego C: w celu umożliwienia czystej instalacji systemu Windows 10 na komputerze chronionym funkcją BitLocker, jeśli nie masz klucza odzyskiwania funkcji BitLocker lub hasła funkcji BitLocker lub jeśli z jakiegokolwiek powodu nie możesz odblokować dysku BitLocker. </p> <p><img src=\"images/image_thumb-51-648.png\" alt=\"Fix Refresh your PC error: Drive where windows is installed is locked\" loading=\"lazy\"></p> <p> </p> <p> Gdy urządzenie z systemem Windows 10 (laptop lub komputer PC) jest chronione za pomocą funkcji BitLocker, jedynym sposobem uzyskania dostępu do jego zawartości lub zresetowania urządzenia (za pomocą funkcji „Zresetuj ten komputer”, „Odśwież komputer”) lub ponownej instalacji Windows polega na odblokowaniu dysku systemu operacyjnego C: za pomocą klucza odzyskiwania funkcji BitLocker lub hasła funkcji BitLocker. </p> <p> Jeśli nie masz klucza odzyskiwania funkcji BitLocker lub hasła funkcji BitLocker do odblokowania dysku systemowego C: lub klucz funkcji BitLocker nie jest akceptowany, jedyną pozostawioną opcją (niestety) jest całkowite wymazanie dysku i wykonanie czysta instalacja systemu Windows. </p> <p> W tym samouczku znajdziesz instrukcje, jak rozwiązać następujący problem podczas próby zainstalowania systemu Windows 10 lub zresetowania urządzenia z systemem Windows 10 do jego ustawień fabrycznych: „Dysk, na którym jest zainstalowany system Windows, jest zablokowany. Odblokuj dysk i spróbuj ponownie &quot;. </p> <h4> Jak wyczyścić Zainstaluj system Windows 10 na komputerze chronionym funkcją BitLocker (NAPRAWKA: Nie można zainstalować/odświeżyć systemu Windows 10 — dysk jest zablokowany funkcją BitLocker). </h4> <p><strong> Wymaganie: </strong> <strong> Nośnik instalacyjny systemu Windows 10 (USB lub DVD). </strong><br> Jeśli nie posiadasz nośnika instalacyjnego Windows, możesz go utworzyć za pomocą <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Narzędzie do tworzenia multimediów firmy Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak utworzyć nośnik instalacyjny USB systemu Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak utworzyć nośnik instalacyjny DVD z systemem Windows 10. </a></li> </ul> <p> Aby wykonać czystą instalację systemu Windows 10 na komputerze/dysku chronionym funkcją BitLocker, postępuj zgodnie z poniższymi instrukcjami: * </p> <p><strong> * UWAGA: PONIŻSZA PROCEDURA USUNIE WSZYSTKIE DANE PRZECHOWYWANE Z ZABLOKOWANEGO DYSKU. KONTYNUUJ TYLKO JEŚLI TY <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> NIE MOŻNA ODBLOKOWAĆ DYSK/KOMPUTER ZABEZPIECZONY BITLOCKER. </a></strong></p> <p> 1. Uruchom system z nośnika instalacyjnego Windows 10. * </p> <p> * Uwaga: <strong> </strong> Aby móc uruchomić komputer z Windows Media (USB lub DVD), wykonaj poniższe czynności: </p> <ul> <li><strong> Metoda 1: </strong> Po włączeniu naciśnij odpowiedni klawisz funkcyjny (zazwyczaj jest to klawisz „F12” lub „F8”), aby wyświetlić opcje „Kolejność rozruchu” lub „Menu rozruchu”. Następnie wybierz urządzenie USB (lub DVD), które zawiera nośnik instalacyjny systemu Windows (pliki) i naciśnij Enter. </li> <li><strong> Metoda 2: </strong> Przejdź do konfiguracji systemu BIOS (Ustawienia) i ustaw nośnik instalacyjny systemu Windows jako „Pierwsze urządzenie rozruchowe” w menu „Kolejność rozruchu”. Następnie <strong> Zapisz i wyjdź </strong> z ustawień BIOS. </li> </ul> <p> 2. Na poniższym ekranie naciśnij <strong> ZMIANA </strong> + <strong> F10 </strong> klawisze, aby uruchomić wiersz polecenia. (lub naciśnij <strong> Kolejny </strong> &gt; <strong> Napraw mój komputer </strong> &gt; <strong> Rozwiązywanie problemów </strong> &gt; <strong> Wiersz polecenia </strong> ). * </p> <p> * Uwaga: Jeśli pojawi się monit o klucz odzyskiwania, kliknij <strong> POMIŃ ten przejazd </strong> . </p> <p><img src=\"images/image_thumb15_thumb-290.png\" alt=\"How to Remove Updates from the Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. W wierszu poleceń podaj kolejno następujące polecenia: </p> <ul> <li><strong> dyskpart </strong></li> <li><strong> lista dysków </strong></li> <li><strong> wybierz dysk 0 </strong></li> <li><strong> objętość listy </strong></li> </ul> <p> 4. Teraz zlokalizuj, który z wymienionych woluminów ma większy rozmiar w GB. Zwykle większy wolumin to miejsce, w którym zainstalowano system Windows (zablokowany dysk). * </p> <p> * np. Na poniższym zrzucie ekranu „Tom 2” ma większy rozmiar. </p> <p> </p> <p><img src=\"images/image_thumb-10-992.png\" alt=\"fix drive is locked Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Następnie wybierz większy wolumen, wpisując to polecenie: * </p> <ul> <li><strong> wybierz numer tomu </strong></li> </ul> <p> * Uwaga: Zmień numer woluminu w powyższym poleceniu zgodnie z Twoim przypadkiem (np. „wybierz wolumin 2”) </p> <p> 5. Na koniec usuń wybrany wolumin, wydając to polecenie: </p> <p> </p> <ul> <li><strong> usuń nadpisanie głośności </strong></li> </ul> <p><img src=\"images/image_thumb-14-714.png\" alt=\"delete volume override\" loading=\"lazy\"></p> <p> </p> <p> 6. Typ <strong> Wyjście </strong> aby zamknąć narzędzie DISKPART, a następnie zamknąć wiersz polecenia. <br> 7. Wyłącz, a następnie ponownie włącz urządzenie. <br> 8. Uruchom komputer z nośnika instalacyjnego systemu Windows. <br> 9. Kliknij <strong> Kolejny </strong> i wtedy <strong> Zainstaluj teraz </strong> . <br> 10. Wybierz „Nie mam klucza produktu”, a następnie zaakceptuj Umowę licencyjną. <br> 11. Wybierz opcję „Instalacja niestandardowa”, a następnie usuń wszystkie pozostałe partycje/woluminy z dysku. </p> <p><img src=\"images/image_thumb-12-362.png\" alt=\"cannot reset windows 10 drive locked with bitlocker\" loading=\"lazy\"></p> <p> </p> <p> 12. Po zakończeniu wybierz „Nieprzydzielone miejsce” i kliknij <strong> Kolejny. <br> </strong> 13. Postępuj zgodnie z instrukcjami wyświetlanymi na ekranie, aby: <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> czysta instalacja systemu Windows 10 </a> . </p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym problemie. </p>"}