{"title":"Jak ponownie uruchomić serwer HP z interfejsu iLO.","content":"<p> W tym samouczku znajdziemy instrukcje krok po kroku, jak zrestartować serwer HP zdalnie za pomocą interfejsu HP iLO. HP Integrated Lights-Out (iLO) to składnik sprzętowy serwerów HP, zwykle zintegrowany z płytą systemową. Komponent iLO ma własne połączenie sieciowe, adres IP i interfejs sieciowy i może pomóc użytkownikowi uzyskać dostęp do serwera i zarządzać nim zdalnie. </p> <h4> Jak ponownie uruchomić serwer HP za pomocą interfejsu internetowego iLO 5. </h4> <p> Aby zrestartować serwer, jeśli się zawiesi, z interfejsu iLO: </p> <p> 1. Na innym komputerze otwórz przeglądarkę internetową iw pasku adresu wpisz adres IP interfejsu iLO na serwerze, który chcesz zrestartować. <br> 2. Wpisz nazwę użytkownika iLO i hasło i kliknij <strong> Zaloguj sie </strong> . </p> <p><img src=\"images/image_thumb-8-790.png\" alt=\"restart hp proliant server from ilo\" loading=\"lazy\"></p> <p> </p> <p> 3. Wybierz <strong> Moc i termiczna </strong> po lewej. <br> 4. W sekcji Wirtualny przycisk zasilania kliknij przycisk <strong> Resetowanie </strong> przycisk, aby ponownie uruchomić serwer HP. * </p> <p> * Informacje: </p> <ul> <li> Wirtualny <strong> Resetowanie </strong> przycisk ma taką samą funkcję jak <strong> Uruchom ponownie </strong> polecenie w systemie operacyjnym (ciepły rozruch). </li> <li> Wirtualny <strong> Zimny ​​But </strong> przycisk ma taką samą akcję jak <strong> Zamknąć </strong> polecenie w systemie operacyjnym. Jeśli naciśniesz przycisk „Cold Boot”, serwer zostanie zamknięty i ponownie uruchomiony po około 8 sekundach. </li> </ul> <p> <img src=\"images/image_thumb-9-784.png\" alt=\"How to Reboot an HP Server using iLO 5 web interface.\" loading=\"lazy\"></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}