{"title":"Jak ponownie zainstalować system Windows 10, jeśli system Windows nie chce się uruchomić.","content":"<p> W tym samouczku znajdziesz szczegółowe instrukcje dotyczące ponownej instalacji systemu Windows 10, jeśli system Windows nie uruchamia się. W poprzednim samouczku wspomniałem o drodze do <a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"nofollow noopener\"> ponownie zainstaluj system Windows 10 za pomocą funkcji „Zresetuj ten komputer” </a> . Ale „Zresetuj ten komputer” jest dostępny tylko wtedy, gdy system Windows 10 może uruchomić się normalnie lub jeśli możesz uruchomić menu „Zaawansowane uruchamianie” po uruchomieniu systemu Windows (opcja „Zresetuj ten komputer” jest niedostępna podczas uruchamiania z USB). </p> <p> Ten samouczek zawiera instrukcje dotyczące ponownej instalacji systemu Windows 10, jeśli system Windows nie uruchamia się bez utraty plików. </p> <h2> Jak ponownie zainstalować parę Windows 10, jeśli system Windows nie może się uruchomić. </h2> <p><strong> Wymagania </strong> : Aby ponownie zainstalować system Windows 10, jeśli system Windows nie uruchamia się normalnie, należy uruchomić komputer z nośnika instalacyjnego systemu Windows (USB lub DVD) i włączyć menu opcji zaawansowanych (menu z klawiszem F8). Jeśli nie posiadasz nośnika instalacyjnego Windows, możesz go utworzyć za pomocą <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Narzędzie do tworzenia multimediów firmy Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak utworzyć nośnik instalacyjny USB systemu Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak utworzyć nośnik instalacyjny DVD z systemem Windows 10. </a></li> </ul> <p> 1. Uruchom komputer z nośnika instalacyjnego Windows. <br> 3. Naciśnij <strong> Kolejny </strong> na ekranie opcji językowych. <br> 4. Wybierz <strong> Napraw swój komputer </strong> . <br> 5. Następnie wybierz <strong> Rozwiązywanie problemów -&gt; </strong><strong> Opcje zaawansowane -&gt; Wiersz polecenia. </strong></p> <p> 6. W oknie wiersza poleceń wpisz następujące polecenie i naciśnij <strong> Wchodzić: </strong></p> <ul> <li><strong> bcdedit /set {default} bootmenupolicy dziedzictwo </strong></li> </ul> <p><img src=\"images/image_thumb-33-821.png\" alt=\"advanced boot options\" loading=\"lazy\"></p> <p> 7. Typ <strong> Wyjście </strong> aby zamknąć okno wiersza polecenia. <br> 8. Usuń nośnik instalacyjny systemu Windows. <br> 9. Zamknij wszystkie okna, aby ponownie uruchomić lub wyłączyć komputer. </p> <p> 10. <strong> naciśnij </strong> <strong> F8 </strong> klucz <strong> wielokrotnie </strong> podczas uruchamiania komputera. </p> <p> 11. W „Menu opcji zaawansowanych” zaznacz „ <strong> Napraw swój komputer </strong> &quot;, a następnie naciśnij <strong> WCHODZIĆ </strong> . </p> <p><img src=\"images/image_thumb-13-334.png\" alt=\"Repair your Computer in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 12. Na ekranie „Wybierz opcję” wybierz <strong> Rozwiązywanie problemów </strong> a następnie kliknij <strong> Zresetuj ten komputer -&gt; Zachowaj moje pliki. </strong> * </p> <p> Uwagi: <br> 1. „ <strong> Zachowaj moje pliki&quot; </strong> opcja, usunie wszystkie aplikacje i ustawienia, ale zachowa Twoje osobiste pliki. <br> 2. <strong> „Usuń wszystko” </strong> opcja usunie wszystkie aplikacje, ustawienia i pliki. Wybierając tę ​​opcję, twój komputer zostanie przywrócony do stanu czystego. <br> 3. Jeśli wybierzesz opcję „Usuń wszystko”, upewnij się, że masz ostatnią kopię zapasową swoich osobistych plików na innym nośniku pamięci (np. na dysku USB), w przeciwnym razie wszystkie pliki zostaną utracone. </p> <p><img src=\"images/image_thumb-14-296.png\" alt=\"How to Reinstall Windows 10 if Windows Won't Boot.\" loading=\"lazy\"></p> <p> </p> <p> 13. Na następnym ekranie wybierz konto z uprawnieniami administratora. ) i na następnym ekranie wpisz swoje hasło i kliknij <strong> Kolejny </strong> . </p> <p><img src=\"images/image_thumb-15-869.png\" alt=\"How to Reinstall Windows 10 if Windows cannot Boot.\" loading=\"lazy\"></p> <p> 14. Wpisz hasło do wybranego konta i kliknij <strong> Kontyntynuj. </strong></p> <p><img src=\"images/image_thumb-16-692.png\" alt=\"How to Reinstall Windows 10 if Windows fails to boot.\" loading=\"lazy\"></p> <p> </p> <p> 15. Poczekaj na zakończenie instalacji. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym przewodniku. </p>"}