{"title":"Jak automatycznie zalogować się do systemu Windows 10/8/7 (bez wpisywania hasła).","content":"<p> Ten samouczek zawiera instrukcje dotyczące automatycznego logowania do systemu Windows 10. W rzeczywistości dowiesz się, jak automatycznie logować się na swoje konto użytkownika (konto Microsoft, lokalne lub domenowe), bez konieczności wprowadzania danych logowania na ekranie logowania lub na ekranie blokady . Instrukcje dotyczą systemu Windows 10/8/7. </p> <p> Podczas wykonywania nowej instalacji systemu Windows 10 zostanie wyświetlony monit o określenie konta użytkownika i hasła do korzystania z komputera. Na tym etapie możesz użyć swojego konta Microsoft (z hasłem do konta MS) lub utworzyć nowe konto lokalne i nowe hasło, aby zalogować się do systemu Windows. W obu przypadkach (chyba że utworzysz konto lokalne z pustym hasłem) przy każdym uruchomieniu systemu Windows pojawi się monit o wpisanie hasła. </p> <p> Ochrona własnego komputera hasłem jest dobrym środkiem bezpieczeństwa, zwłaszcza jeśli dzielisz komputer z innymi, podróżujesz z laptopem lub gdy komputer należy do środowiska biznesowego. Ale jeśli jesteś jedynym użytkownikiem na samodzielnym komputerze stacjonarnym lub jeśli używasz laptopa tylko w domu, nie musisz wpisywać poświadczeń za każdym razem, gdy chcesz z niego korzystać. * </p> <p><strong> Ostrzeżenie: </strong> NIE WŁĄCZAJ AUTOMATYCZNEGO LOGOWANIA w systemie Windows, jeśli udostępniasz swój komputer innym osobom lub podróżujesz z laptopem lub tabletem, ponieważ każdy, kto znajdzie Twój komputer, będzie miał łatwy dostęp do Twoich plików. </p> <h4> Jak automatycznie zalogować się na swoje konto użytkownika w systemie Windows 10/8/7/Vista. (Włącz automatyczne logowanie) </h4> <h6> Metoda 1. Włącz automatyczne logowanie za pomocą narzędzia AUTOLOGON. </h6> <p> Microsoft zaprojektował narzędzie do automatyzacji procesu logowania w systemie Windows. Narzędzie nosi nazwę „Autologon” i umożliwia łatwe skonfigurowanie systemu Windows do automatycznego logowania bez konieczności wpisywania poświadczeń przy każdym uruchomieniu. Zaletą tego narzędzia jest to, że hasło jest przechowywane w postaci zaszyfrowanej w rejestrze. </p> <p> 1. Pobierz <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/autologon\" target=\"_blank\" rel=\"nofollow noopener\"> Automatyczne logowanie </a> użyteczność. <br> 2. Wyodrębnij pobrany plik. <br> 3. Uruchom &quot;autologon.exe&quot; <br> 4. Wpisz swoje hasło i kliknij <strong> Włączyć </strong> . </p> <p><img src=\"images/image_thumb-44-251.png\" alt=\"windows auto login\" loading=\"lazy\"></p> <p> * Uwaga: Jeśli chcesz wyłączyć automatyczne logowanie, uruchom ponownie narzędzie i kliknij <strong> Wyłączyć </strong> . </p> <p> </p> <h6> Metoda 2. Włącz automatyczne logowanie z panelu sterowania Konta użytkowników. </h6> <p> Drugą metodą włączenia automatycznego logowania do systemu Windows 10/8/7 jest wyłączenie ustawienia „Użytkownicy muszą wprowadzić nazwę użytkownika i hasło, aby korzystać z tego komputera” w panelu sterowania Konta użytkowników. Aby to zrobić: </p> <p> Uwaga: jeśli korzystasz z konta lokalnego, istnieje inny prostszy sposób na wymuszenie automatycznego logowania w systemie Windows: po prostu określ nowe puste (puste) hasło w Ustawieniach&gt; Konta&gt; Opcje logowania&gt; Zmień hasło. Następnie wpisz hasło raz, a następnie kliknij dwukrotnie Dalej i Zakończ. </p> <p> 1. Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-738.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. W polu „Otwórz” wpisz: <strong> kontroluj hasła użytkowników2 </strong> &amp; Kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-29-873.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. W opcjach Kont użytkowników (zakładka „Użytkownicy”), <strong> odznacz </strong> <strong> Użytkownicy muszą wprowadzić nazwę użytkownika i hasło, aby korzystać z pola wyboru tego komputera </strong> a następnie kliknij <strong> Zastosować. * </strong></p> <p> * Uwaga: Jeśli chcesz wyłączyć automatyczne logowanie w przyszłości, po prostu zaznacz to pole. </p> <p><img src=\"images/image_thumb-32-315.png\" alt=\"auto login windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Wpisz (dwukrotnie) hasło do konta i kliknij <strong> dobrze </strong> dwukrotnie, aby zamknąć właściwości Konta Użytkownika. </p> <p><img src=\"images/image_thumb-31-509.png\" alt=\"Auto Login to Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Metoda 3. Włącz automatyczne logowanie w rejestrze (Windows 10/8/7/Vista). </h6> <p> Ostatnią metodą wyłączenia logowania hasłem w systemie Windows 10, 8 lub 7 jest włączenie rejestru automatycznego logowania. Aby to zrobić: </p> <p> 1. Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-512.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. W polu „Otwórz” wpisz: <strong> regedit </strong> &amp; Kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb7-114.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Przejdź do tego klucza z lewego panelu: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon </li> </ul> <p> 4. W prawym okienku: </p> <blockquote><p> za. Kliknij prawym przyciskiem na puste miejsce i wybierz <strong> Nowy </strong> &gt; <strong> Wartość ciągu. </strong></p> <p><img src=\"images/image_thumb-38-930.png\" alt=\"image\" loading=\"lazy\"></p> <p> b. Zmień nazwę nowej wartości na <strong> Domyślna nazwa użytkownika </strong> i naciśnij <strong> Wchodzić </strong> . <br> do. Otwórz wartość REG_SZ „DefaultUserName”. <br> re. Wpisz nazwę swojego lokalnego konta użytkownika lub konta Microsoft i kliknij <strong> dobrze </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-42-933.png\" alt=\"enable auto login registry\" loading=\"lazy\"></p> <p> </p> <p> 5a. Wykonaj te same kroki i utwórz nową wartość REG_SZ (String) i nazwij ją <strong> Domyślne hasło </strong> . <br> 5b. Kliknij dwukrotnie na „DefaultPassword” <strong> &#39; </strong> Wartość REG_SZ, wpisz swoje hasło w polu Dane wartości i kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-43-192.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7a. Na koniec utwórz nową wartość REG_SZ i nazwij ją <b> Logowanie do automatycznego administratora </b> . <br> 7b. Kliknij dwukrotnie wartość „AutoAdminLogon”, wpisz <strong> 1 </strong> w polu Dane wartości i kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-41-705.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Zamknij Edytor rejestru i uruchom ponownie komputer. * </p> <p> * Uwagi: <br> 1. Jeśli komputer jest częścią domeny, musisz utworzyć kolejną wartość REG_SZ o nazwie <strong> Domyślna nazwa domeny </strong> a następnie wpisać w polu danych wartości nazwę swojej domeny. <br> 2. Aby wyłączyć automatyczne logowanie w przyszłości, po prostu usuń nowo utworzone wartości ciągu, o których mowa powyżej. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}