{"title":"Jak otworzyć PowerShell jako administrator w bieżącym folderze w Eksploratorze plików (Windows 10)","content":"<p> Jeśli chcesz otworzyć PowerShell lub PowerShell jako administrator, w dowolnej lokalizacji/folderze w Eksploratorze plików, kontynuuj czytanie tego samouczka. Jak wiesz, zwykłymi sposobami otwierania PowerShell w systemie Windows 10 jest wyszukiwanie go za pomocą wyszukiwania Cortana lub (szybciej) naciśnięcie <strong> Zdobyć <img src=\"images/image_thumb8_thumb_thumb-479.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"></strong> + <strong> X </strong> klawisze, aby otworzyć „Menu użytkownika zaawansowanego” i uruchomić stamtąd program Windows PowerShell. </p> <p><img src=\"images/image_thumb-54-350.png\" alt=\"PoweShell Admin (Win + X menu)\" loading=\"lazy\"></p> <p> </p> <p> Chociaż te metody są przydatne, czasami istnieje potrzeba otwarcia PowerShell w określonej lokalizacji / folderze. Aby to zrobić, postępuj zgodnie z poniższymi instrukcjami. </p> <h4> Jak otworzyć program Windows PowerShell w określonej lokalizacji w systemie Windows 10. </h4> <p> 1. Przejdź do folderu, w którym chcesz otworzyć PowerShell. <br> 2. <strong> Przytrzymaj </strong> <strong> ZMIANA </strong> klucz i <strong> kliknij prawym przyciskiem myszy </strong> w dowolnym miejscu w folderze. <br> 3. Z menu prawego przycisku myszy wybierz <strong> Otwórz tutaj okno PowerShell </strong> do <strong> </strong> otwórz nowe okno PowerShell w tym folderze. </p> <p> </p> <p><img src=\"images/image_thumb-55-793.png\" alt=\"Open PoweShell at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Jeśli chcesz otworzyć „PowerShell jako administrator” w dowolnym folderze, kliknij <strong> Plik </strong> menu i wybierz <strong> Otwórz Windows PowerShell jako administrator </strong> . * </p> <p> * Uwaga: Jak widać z menu „Plik”, możesz również otworzyć „proste” okno PowerShell. </p> <p><img src=\"images/image_thumb-56-830.png\" alt=\"Open PoweShell As Administrator at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p><strong> Dodatkowa pomoc: </strong> Jeśli jesteś fanem skrótów klawiaturowych, innym sposobem na otwarcie PowerShell (Administrator) jest naciśnięcie klawisza <strong> Alt </strong> + <strong> fa </strong> + <strong> S </strong> + <strong> ZA </strong> klucze w kolejności. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}