{"title":"Jak blokować strony internetowe w przeglądarce Chrome lub Firefox.","content":"<p> Jeśli szukasz łatwego sposobu na zablokowanie witryny w przeglądarce Chrome lub Firefox, czytaj dalej poniżej. </p> <p> Chociaż Internet dla większości z nas stał się niezbędny w naszym codziennym życiu do pracy lub rozrywki, z drugiej strony czasami przydaje się możliwość zablokowania niektórych witryn, aby uniknąć rozproszenia uwagi. Na przykład nikt nie chce, aby jego dziecko było rozpraszane przez oglądanie filmów na YouTube podczas czytania lekcji. </p> <p> Z tego przewodnika dowiesz się, jak blokować strony internetowe w Chrome i <a href=\"#firefox\" target=\"_blank\" rel=\"nofollow noopener\"> Firefox </a> przeglądarki. </p> <p> * Uwaga: jeśli chcesz zablokować witrynę we wszystkich przeglądarkach, przeczytaj ten artykuł: <a href=\"https://www.repairwin.com/block-youtube-on-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak zablokować YouTube w systemie Windows 10. </a></p> <h2> Jak blokować strony internetowe w Google Chrome. </h2> <p> Najłatwiejszym sposobem zablokowania strony internetowej w Chrome jest użycie słynnego rozszerzenia BlockSite. Instalacja dodatku BlockSite jest podobna jak w przypadku każdego innego rozszerzenia. </p> <p> 1. Przejdź do <a href=\"https://chrome.google.com/webstore/detail/blocksite-stay-focused-co/eiimnmioipafcokbfikbljfdeojpcgbh\" target=\"_blank\" rel=\"nofollow noopener\"> Rozszerzenie BlockSite </a> w sklepie internetowym Chrome i kliknij <strong> Dodaj do Chrome </strong> przycisk. </p> <p><img src=\"images/image_thumb-4-439.png\" alt=\"how to block websites chrome\" loading=\"lazy\"></p> <p> 2. Po wyświetleniu monitu kliknij <strong> Dodaj rozszerzenie </strong> . </p> <p><img src=\"images/image_thumb-5-782.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Po zakończeniu instalacji przejdź do menu Chrome &gt; Więcej narzędzi &gt; Rozszerzenia </p> <p><img src=\"images/image_thumb-6-830.png\" alt=\"chrome tools extensions\" loading=\"lazy\"></p> <p> 4. Znajdź <strong> BlockSite </strong> rozszerzenie i kliknij <strong> Detale. </strong></p> <p><img src=\"images/image_thumb-7-415.png\" alt=\"Blocksite details\" loading=\"lazy\"></p> <p> 5. <strong> otwarty </strong> <strong> Opcje rozszerzenia </strong> . </p> <p><img src=\"images/image_thumb-8-135.png\" alt=\"How to Block sites chrome\" loading=\"lazy\"></p> <p> 6. Wpisz nazwę witryny, którą chcesz zablokować (np. <a href=\"http://www.youtube.com\" target=\"_blank\" rel=\"nofollow noopener\"> www.youtube.com </a> ) i naciśnij symbol plusa (+), aby dodać witrynę do listy zablokowanych witryn. </p> <p><img src=\"images/image_thumb-9-298.png\" alt=\"blocked sites chrome\" loading=\"lazy\"></p> <p> 7. To wszystko! Odtąd, gdy spróbujesz odwiedzić zablokowaną witrynę, zostaniesz poinformowany, że witryna jest zablokowana za pomocą rozszerzenia BlockSite. Aby zmodyfikować listę zablokowanych witryn, kliknij <strong> Edytuj swoją listę </strong> , aby wprowadzić dowolne zmiany lub usunąć zablokowaną witrynę z listy. </p> <p><img src=\"images/image_thumb-10-951.png\" alt=\"image\" loading=\"lazy\"></p> <h3> Jak zabezpieczyć hasłem zablokowane witryny w rozszerzeniu BlockSite. </h3> <p> Jeśli chcesz uniemożliwić użytkownikom odblokowanie zablokowanej witryny: </p> <p> 1. Otwórz <strong> BlockSite </strong> opcje rozszerzenia. <br> 2. Przejdź do <strong> Ochrona hasła </strong> ustawienia. <br> 3. <strong> Włączyć </strong> opcja Chroń <strong> preferowane opcje BlockSite i strona rozszerzenia Chrome z hasłem </strong> a następnie wpisz swój adres e-mail i hasło i kliknij <strong> Zapisać. </strong></p> <p><img src=\"images/image_thumb-11-711.png\" alt=\"password protect blocked sites\" loading=\"lazy\"></p> <p> 4. BlockSite wyśle ​​Ci wiadomość e-mail z linkiem do weryfikacji Twojego adresu e-mail. Po weryfikacji mailowej ochrona hasłem będzie aktywna. </p> <h2> Jak blokować strony internetowe w Mozilla Firefox. </h2> <p> 1. Przejdź do <a href=\"https://addons.mozilla.org/en-US/firefox/addon/blocksite/\" target=\"_blank\" rel=\"nofollow noopener\"> Rozszerzenie BlockSite </a> w dodatkach do Firefoksa. <br> 2. Kliknij <strong> Dodaj do Firefoksa </strong> przycisk. </p> <p><img src=\"images/image_thumb-12-999.png\" alt=\"block websites firefox\" loading=\"lazy\"></p> <p> 2. Po wyświetleniu monitu o zezwolenie na instalację rozszerzenia kliknij <strong> Dodaj. </strong></p> <p><img src=\"images/image_thumb-13-588.png\" alt=\"Blocksite firefox\" loading=\"lazy\"></p> <p> 3. Po zakończeniu instalacji wybierz, czy chcesz blokować strony internetowe w oknach prywatnych (incognito) i kliknij <strong> w porządku </strong> . </p> <p><img src=\"images/image_thumb-14-173.png\" alt=\"how to block site\" loading=\"lazy\"></p> <p> 4. Jeśli chcesz uniemożliwić rozszerzeniu BlockSite odczytywanie danych z odwiedzanych witryn, kliknij Może litera. </p> <p><img src=\"images/image_thumb-15-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Teraz kliknij ikonę BlockSite i <strong> Edytuj listę bloków </strong> aby określić, które witryny chcesz blokować. </p> <p><img src=\"images/image_thumb-16-657.png\" alt=\"block sites firefox\" loading=\"lazy\"></p> <p> 6. W zakładce Blokuj witryny wpisz nazwę witryny, którą chcesz zablokować (np. „facebook.com”), a następnie dodaj ją do listy zablokowanych witryn. </p> <p><img src=\"images/image_thumb-17-817.png\" alt=\"How to block site Firefox\" loading=\"lazy\"></p> <p> 7. Po dodaniu witryn, które chcesz zablokować, zamknij ustawienia BlockSite i gotowe. </p> <p> Oprócz swojej głównej funkcji, rozszerzenie BlockSite posiada również kilka innych przydatnych funkcji, takich jak: </p> <ul> <li> <p><strong> Tryb ostrości </strong> : Blokuj witryny na określony czas (np. 25 minut) </p> </li> <li> <p><strong> Ochrona hasła: </strong> Chroń swoje ustawienia BlockSite przed modyfikacją. </p> </li> <li> <p><strong> Blokuj po słowach: </strong> Blokuj adresy URL zawierające określone słowa. </p> </li> </ul> <p> To wszystko ludzie! Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}