{"title":"Jak tworzyć kopie plików w tle za pomocą Harmonogramu zadań w systemie Windows 10.","content":"<p> W poprzednim samouczku wspomniałem o sposobie tworzenia kopii zapasowych plików osobistych za pomocą <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Historia pliku </a> w systemie Windows 10. W tym samouczku pokażę, jak automatycznie tworzyć kopie w tle swoich plików osobistych za pomocą Harmonogramu zadań. Kopie w tle Twoich plików pozwolą Ci przywrócić określony plik lub folder do wcześniejszej wersji (punkt w czasie). </p> <p> Funkcja kopiowania w tle wprowadzona po raz pierwszy w systemie Windows Server 2003, a następnie dodana do wersji systemu Windows Vista i 7 jako część funkcji przywracania systemu. Proces „Kopia w tle” umożliwia tworzenie kopii zapasowych i migawek bieżącego stanu systemu oraz plików osobistych, nawet jeśli są używane. Proces odzyskiwania plików z kopii w tle jest powszechnie znany jako „Przywróć poprzednie wersje”. </p> <h4> Jak codziennie tworzyć kopię w tle swoich plików w systemie Windows 10. * </h4> <p><strong> * Uwagi: </strong><br> 1. Korzystając z poniższych instrukcji, będziesz mógł tworzyć codzienne kopie w tle (migawki) całego tomu &quot;C:\\&quot;. (Pliki systemowe Windows i dane osobowe) <br> 2. Kopie w tle mogą być używane do przywracania plików do wcześniejszego punktu w czasie za pomocą funkcji „Przywróć poprzednią wersję” lub za pomocą narzędzia innej firmy, które może uzyskać dostęp do kopii w tle, takiego jak <a href=\"https://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> Eksplorator Cieni </a> albo <a href=\"https://www.nirsoft.net/utils/shadow_copy_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> Widok kopii w tle </a> . <br> 3. Kopie Cienia <strong> nie można użyć do przywrócenia systemu </strong> do wcześniejszego punktu w czasie, używając <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> Przywracanie systemu </a> narzędzie. Jeśli chcesz mieć możliwość przywrócenia systemu za pomocą funkcji Przywracanie systemu, kontynuuj i <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Włącz ochronę Przywracania systemu. </a> <br> 4. Na koniec pamiętaj, że utworzone kopie w tle nie są niezawodną kopią zapasową, ponieważ „kopie w tle” są przechowywane na dysku głównym C:\\, a jeśli dysk ulegnie awarii, utracisz wszystkie dane. Aby utworzyć niezawodną kopię zapasową swoich danych, przeczytaj instrukcje w tym artykule: <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak wykonać kopię zapasową plików osobistych z historią plików w systemie Windows 10. </a></p> <p> </p> <p><strong> Aby utworzyć poprzednie wersje swoich plików osobistych za pomocą kopii w tle: </strong></p> <p> 1. Otwórz <strong> Harmonogram zadań </strong> . Jeśli nie wiesz, jak to zrobić, to… </p> <blockquote><p> 1. W polu wyszukiwania wpisz <strong> Zadanie </strong> lub <strong> Harmonogram zadań </strong> . <br> 2. Otwórz „Harmonogram zadań” z wyników wyszukiwania. </p></blockquote> <p><img src=\"images/image_thumb-31-630.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. W Harmonogramie zadań kliknij <strong> Utwórz zadanie </strong> . </p> <p><img src=\"images/image_thumb-23-462.png\" alt=\"How to Start ThrottleStop at Windows Startup\" loading=\"lazy\"></p> <p> </p> <p> 3. W <strong> Generał </strong> patka: </p> <blockquote><p> 1. Wpisz „Utwórz kopię w tle moich plików” jako nazwę zadania. <br> 2. <strong> Czek </strong> <strong> Biegaj z najwyższymi uprawnieniami </strong> pudełko. </p></blockquote> <p> Uwaga: Jeśli chcesz uruchomić zadanie w tle, umieść kropkę na <strong> Uruchom niezależnie od tego, czy użytkownik jest zalogowany, czy nie </strong> opcję, a następnie wpisz hasło logowania. </p> <p><img src=\"images/image_thumb-62-499.png\" alt=\"create shadow copies task windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Następnie wybierz <strong> Wyzwalacze </strong> tab i kliknij <strong> Nowy </strong> . <br> 4a. W oknie „Nowy wyzwalacz” określ, jak często tworzyć zrzuty plików i kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-63-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Następnie wybierz <strong> działania </strong> tab i kliknij <strong> Nowy </strong> . <br> 5a. W oknie „Nowa akcja”: </p> <blockquote><p> 1. Wybierz <strong> Uruchom program </strong> . <br> 2. W &#39;Program/skrypt&#39; wpisz: <strong> wmic </strong><br> 3. W polu „Dodaj argumenty (opcjonalne)” wpisz: </p> <ul> <li><strong> wywołanie shadowcopy utwórz Volume=C:\\ </strong></li> </ul> <p> 4. Po zakończeniu kliknij <strong> DOBRZE. </strong></p></blockquote> <p><img src=\"images/image_thumb-66-640.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Kliknij <strong> dobrze </strong> ponownie, aby zamknąć właściwości zaplanowanego zadania. </p> <p><img src=\"images/image_thumb-67-138.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Aby utworzyć pierwszą kopię zapasową, kliknij prawym przyciskiem myszy zadanie i wybierz <strong> Biegać </strong> . </p> <p><img src=\"images/image_thumb-68-388.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Gotowe! Od teraz, gdy chcesz przywrócić plik/folder do jego poprzedniej wersji, kliknij go prawym przyciskiem myszy i wybierz <strong> Przywróć poprzednie wersje </strong> . </p> <p><img src=\"images/image_thumb-69-568.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Przydatna informacja: <br> </strong> 1. Maksymalna przydzielona przestrzeń, której można użyć do przechowywania kopii w tle, to ilość miejsca, które narzędzie Przywracanie systemu może wykorzystać do przechowywania w punktach przywracania. <br> 2. Aby sprawdzić wykorzystane i maksymalne przydzielone miejsce do przechowywania kopii w tle, wydaj to polecenie w wierszu polecenia (administrator): </p> <ul> <li><strong> lista cieni vssadmin </strong></li> </ul> <p><img src=\"images/image_thumb-76-672.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Aby zmodyfikować maksymalną przydzieloną przestrzeń dla kopii w tle i punktów przywracania systemu, przejdź do <strong> Ochrona systemu </strong> ustawienia dla <strong> Dysk lokalny (C:) </strong><br> 4. Jeśli chcesz usunąć wszystkie zapisane kopie w tle, musisz usunąć również zapisane punkty przywracania. Jeśli chcesz to zrobić, kliknij <strong> Usuń wszystkie punkty przywracania </strong> w Ustawieniach ochrony systemu. </p> <p><img src=\"images/image_thumb-77-662.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> To wszystko! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}