{"title":"Jak sterować myszą za pomocą klawiatury w systemie Windows 10/8/7.","content":"<p> Ten samouczek zawiera instrukcje dotyczące sterowania myszą za pomocą klawiatury, przy użyciu funkcji „Klawisze myszy&quot; w systemie Windows. Artykuł może być przydatny dla osób, które nie mogą obsługiwać myszy lub w przypadkach, gdy mysz przestaje działać (lub nie istnieje) i chcesz używać klawiatury jako myszy. Pracować z komputerem w celu dokończenia pilnej pracy. </p> <p> <strong> Klawisze myszy </strong> Funkcja jest wbudowana w systemy operacyjne Windows 10, 7 lub 7 i umożliwia używanie klawiatury numerycznej do przesuwania wskaźnika myszy na ekranie i wykonywania wszystkich zwykłych czynności myszy (kliknij, kliknij dwukrotnie, kliknij prawym przyciskiem myszy). </p> <h4> Jak używać klawiatury jako myszy. </h4> <h6> Metoda 1. Włącz klawisze myszy za pomocą skrótu klawiaturowego. * </h6> <p> Pierwsza metoda przesuwania kursora myszy [bez myszy <img src=\"images/wlemoticon-openmouthedsmile-273.png\" alt=\"Open-mouthed smile\" loading=\"lazy\"> ] jest włączenie Klawiszy Myszy w następujący sposób: </p> <p> 1. Naciśnij <strong> lewy ALT </strong> + <strong> lewy SHIFT </strong> + <strong> Num Lock </strong></p> <p><img src=\"images/image_thumb-10-220.png\" alt=\"How to Control Mouse with Keyboard \" loading=\"lazy\"></p> <p> </p> <p> 2. Gdy na ekranie pojawi się okno Klawiszy myszy, naciśnij <strong> WCHODZIĆ </strong> aby włączyć Klawisze Myszy. </p> <p><img src=\"images/image_thumb-2-595.png\" alt=\"turn on mouse keys\" loading=\"lazy\"></p> <p> 3. Po włączeniu Klawiszy Myszy, możesz używać klawiatury (klawiatury numerycznej) do wykonywania wszystkich czynności myszy (przesuń, kliknij, kliknij prawym przyciskiem myszy, kliknij dwukrotnie), jak pokazano na poniższym rysunku. * </p> <p> * Uwaga: Jeśli chcesz zwiększyć lub zmniejszyć szybkość wskaźnika, przeczytaj instrukcje w następnej metodzie. </p> <p><strong> Funkcje myszy z klawiatury numerycznej </strong></p> <p><img src=\"images/image_thumb-8-332.png\" alt=\"mouse functions numeric keypas\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Metoda 2. Włącz klawisze myszy z Centrum ułatwień dostępu. </h6> <p> Drugą metodą, aby móc sterować wskaźnikiem myszy za pomocą klawiatury, jest włączenie i skonfigurowanie funkcji „Klawisze myszy” z centrum ułatwień dostępu. Aby to zrobić: </p> <p> 1. Przejdź do Panelu sterowania systemu Windows, ustaw „Wyświetl według” na <strong> Małe ikony </strong> a następnie otwórz <strong> Centrum łatwości dostępu. </strong></p> <p><img src=\"images/image_thumb-3-309.png\" alt=\"use keyboard as mouse\" loading=\"lazy\"></p> <p> </p> <p> 2. Kliknij <strong> Spraw, aby mysz była łatwiejsza w użyciu. </strong></p> <p><img src=\"images/image_thumb-4-518.png\" alt=\"enable mouse keys - ease of access\" loading=\"lazy\"></p> <p> </p> <p> 3. Następnie kliknij <strong> Skonfiguruj klawisze myszy </strong> . </p> <p><img src=\"images/image_thumb-9-206.png\" alt=\"Configure Pointer Speed \" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Teraz sprawdź <strong> Włącz klawisze myszy </strong> pole i kliknij <strong> Zastosować. </strong><br> <strong> 5. </strong> Teraz spróbuj przesunąć kursor myszy za pomocą klawiatury numerycznej i skonfiguruj <strong> Szybkość wskaźnika </strong> jak sobie życzysz. (Kliknij „Zastosuj” przy każdej zmianie i „OK”, aby zamknąć opcje „Klawisze myszy”). </p> <p><img src=\"images/image_thumb-7-340.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> To wszystko! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}