{"title":"Jak udostępniać pliki i foldery w systemie Windows 10, 8.1 lub 7.","content":"<p> Funkcja udostępniania plików w systemie Windows umożliwia łatwe udostępnianie folderów i plików między użytkownikami w sieci. Udostępniając swoje pliki innym użytkownikom w tej samej sieci, będziesz mógł przeglądać i pracować z tymi samymi plikami/folderami. </p> <p> Ten samouczek zawiera instrukcje dotyczące udostępniania folderów i/lub plików w systemach operacyjnych Windows 10, 8, 8.1 lub 7. </p> <h4> Jak włączyć udostępnianie plików w systemie Windows. </h4> <h5> Krok 1. Dodaj wymaganych użytkowników do swojego komputera. </h5> <p> Zanim będziesz dalej udostępniać swoje pliki innym, dodaj użytkowników, którzy będą mieli dostęp do folderu udostępnionego na komputerze. Aby wykonać to zadanie, postępuj zgodnie z instrukcjami w następujących artykułach, zgodnie z wersją systemu Windows. </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-create-a-new-user-in-windows-7\" target=\"_blank\" rel=\"nofollow noopener\"> Jak dodać nowego użytkownika w systemie Windows 7. </a></li> <li><a href=\"https://www.repairwin.com/how-to-add-a-new-user-account-in-windows-10-8/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak dodać nowego użytkownika w systemie Windows 10/8.1? </a></li> </ul> <p> </p> <h5> Krok 2. Jak udostępnić folder lub plik innym. </h5> <p> 1. Kliknij prawym przyciskiem myszy folder (lub plik), który chcesz udostępnić i wybierz <strong> Daj dostęp do </strong> -&gt; <strong> Specyficzni ludzie. </strong></p> <p><img src=\"images/image_thumb-56-411.png\" alt=\"How to Share Files and Folders in Windows 10, 8.1, 7\" loading=\"lazy\"></p> <p> </p> <p> 2. Korzystając z rozwijanego menu wybierz użytkownika, któremu chcesz udostępnić swoje pliki, a następnie kliknij <strong> Dodaj </strong> . </p> <p><img src=\"images/image_thumb-57-274.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Teraz kliknij strzałkę w dół obok dodanego użytkownika i określ jego uprawnienia dostępu (Poziom uprawnień) </p> <p><img src=\"images/image_thumb-58-517.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Po zakończeniu naciśnij <strong> Dzielić </strong> przycisk, </p> <p><img src=\"images/image_thumb-59-431.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Zanotuj podany link do udostępnionego folderu* i kliknij <strong> Gotowy </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-60-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. W tym momencie włączyłeś udostępnianie plików na swoim komputerze. Aby uzyskać dostęp do folderu współdzielonego z innego komputera: </p> <blockquote><p> za. Na pasku adresu Eksploratora wpisz łącze do udostępnionego folderu, jak pokazano w poprzednim kroku. (np. &quot;\\\\DESKTOP-HMG31RD\\2Share&quot; bez cudzysłowów) <br> b. naciśnij <strong> Wchodzić </strong> . <br> do. Wpisz nazwę użytkownika i hasło użytkownika, któremu przyznałeś dostęp i naciśnij and <strong> dobrze </strong> . </p></blockquote> <p><img src=\"images/image_thumb-61-512.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Dodatkowe informacje: <br> 1. Aby zmienić uprawnienia użytkownika, wykonaj ponownie powyższą procedurę i zmień poziom uprawnień użytkownika. <br> 2. Jeśli chcesz zatrzymać udostępnianie plików, kliknij prawym przyciskiem myszy udostępniony folder/plik i przejdź do <strong> Daj dostęp do </strong> -&gt; i wybierz <strong> Usuń dostęp </strong> . </p> <p><img src=\"images/image_thumb-62-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym problemie. </p>"}