{"title":"Jak zabezpieczyć hasłem folder w systemie Windows 10 (Zablokuj folder hasłem).","content":"<p> Ten samouczek zawiera dwie różne bezpłatne i bezpieczne metody ochrony folderu hasłem w systemie Windows 10/8/7 OS. Jeśli zablokujesz folder hasłem, nie będzie on dostępny dla nikogo poza Tobą. Ochrona folderu hasłem jest przydatna w przypadkach, gdy udostępniasz swój komputer innym osobom i nie chcesz, aby ktoś inny miał dostęp do Twoich prywatnych plików i je odczytywał. </p> <ul> <li><strong> Powiązany artykuł: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak zabezpieczyć hasłem komputer z systemem Windows 10 za pomocą funkcji BitLocker </a> . </strong></li> </ul> <h4> Jak zablokować folder hasłem w systemie Windows 10. </h4> <h6> Metoda 1. Jak zablokować i zaszyfrować pliki za pomocą 7-zip (Windows Wszystkie wersje). </h6> <p> Najłatwiejszą i najbezpieczniejszą metodą ochrony folderu hasłem w systemie Windows jest użycie narzędzia do archiwizacji 7-Zip, które obsługuje również szyfrowanie. Aby zaszyfrować i zabezpieczyć hasłem folder/plik za pomocą 7-zip: </p> <p> 1. Pobierz i zainstaluj <a href=\"https://www.7-zip.org/\" target=\"_blank\" rel=\"nofollow noopener\"> 7-zip </a> program archiwizujący. <br> 2. Kliknij prawym przyciskiem myszy folder (lub plik), który chcesz zabezpieczyć hasłem i wybierz: <strong> 7-zip </strong> &gt; <strong> Dodaj do archiwum </strong> . </p> <p><img src=\"images/image_thumb-28-978.png\" alt=\"How to Password Protect a Folder\" loading=\"lazy\"></p> <p> </p> <p> 3. W opcjach „Dodaj do archiwum” określ silne hasło, a następnie kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-29-728.png\" alt=\"set password to archive with 7-zip\" loading=\"lazy\"></p> <p> </p> <p> 4. Następnie usuń nieskompresowany folder (lub plik) i gotowe! </p> <h6> Metoda 2. Jak zaszyfrować folder z ochroną EFS (Windows Pro i Enterprise). </h6> <p> Ochrona EFS to wbudowane narzędzie do szyfrowania w wersjach Windows 10 Professional i Enterprise. Jeśli chronisz folder lub plik za pomocą szyfrowania EFS, dostęp do zaszyfrowanych plików jest bardzo trudny dla innych osób bez posiadania klucza odszyfrowywania (klucza certyfikatu PFX). </p> <p> Jedyną wadą szyfrowania EFS jest to, że szyfrowanie zostanie usunięte, jeśli skopiujesz zaszyfrowane pliki na inny komputer sieciowy lub wyślesz zaszyfrowane pliki pocztą e-mail. </p> <p> Ponadto podczas szyfrowania plików EFS klucz odszyfrowywania (certyfikat) jest przechowywany lokalnie na komputerze. Oznacza to, że każdy, kto zna Twoje hasło, będzie miał również dostęp do Twoich zaszyfrowanych plików. Z tego powodu, jeśli szyfrujesz pliki za pomocą szyfrowania EFS, określ silne hasło logowania i nie udostępniaj go innym. </p> <ul> <li><strong> Powiązany artykuł: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> Jak odszyfrować pliki zaszyfrowane EFS i usunąć szyfrowanie EFS. </a></strong></li> </ul> <p><strong> Aby zaszyfrować folder lub plik za pomocą EFS: </strong><br> 1. Kliknij prawym przyciskiem myszy folder (lub plik), który chcesz chronić i wybierz <strong> Nieruchomości </strong> . <br> 2. Na karcie Ogólne kliknij <strong> zaawansowane </strong> . </p> <p><img src=\"images/image_thumb-13-582.png\" alt=\"enable efs protection\" loading=\"lazy\"></p> <p> </p> <p> 3. Wybierz <strong> Szyfruj pliki, aby zabezpieczyć dane </strong> a następnie kliknij <strong> DOBRZE. </strong></p> <p><img src=\"images/image_thumb-14-983.png\" alt=\"How to Lock Folder with Password - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Następnie kliknij <strong> Zastosować </strong> i <strong> dobrze </strong> ponownie, aby zapisać zmiany i wyjść. <br> 5. W tym momencie system Windows poprosi o wykonanie kopii zapasowej klucza odzyskiwania. Kliknij <strong> Utwórz kopię zapasową klucza szyfrowania plików. </strong></p> <p><img src=\"images/image_thumb-2-823.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Następnie kliknij <strong> Utwórz kopię zapasową teraz (zalecane) </strong> i zapisz klucz certyfikatu deszyfrowania na dysku USB. </p> <p><img src=\"images/image_thumb-15-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. W kreatorze eksportu certyfikatów kliknij <strong> Kolejny </strong> na ekranie powitalnym. <br> 8. Następnie kliknij <strong> Kolejny </strong> ponownie na ekranie Eksportuj format pliku. </p> <p><img src=\"images/image_thumb-4-842.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. W opcjach bezpieczeństwa: </p> <blockquote> <p> 1. <strong> Czek </strong> <strong> Hasło </strong> pudełko. <br> 2. Wpisz hasło dla wyeksportowanego klucza certyfikatu. <br> 3. Wybierz <strong> AES256-SHA256 </strong> szyfrowanie <br> 4. Kliknij <strong> Kolejny </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-16-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. Kliknij <strong> Przeglądaj </strong> i <strong> Zapisać </strong> plik certyfikatu (.pfx) na komputerze. <br> 11. Po zakończeniu kliknij <strong> Kolejny </strong> kontynuować. </p> <p><img src=\"images/image_thumb-17-804.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. Na koniec kliknij <strong> koniec </strong> . </p> <p><img src=\"images/image_thumb-18-449.png\" alt=\"image\" loading=\"lazy\"></p> <p> 13. Po zakończeniu eksportu zapisz wyeksportowany klucz certyfikatu (plik .pfx) w innej bezpiecznej lokalizacji (np. na dysku USB). </p> <p><strong> WSKAZÓWKA: </strong> Gdy szyfrujesz folder (lub pliki) za pomocą EFS, klucz odszyfrowywania (certyfikat) jest przechowywany w folderze profilu użytkownika. Jeśli więc inny użytkownik ma twoje hasło logowania do systemu Windows, może otworzyć i odczytać zaszyfrowane pliki. Aby tego uniknąć, nie udostępniaj swojego hasła logowania ani nie usuwaj (odinstaluj) certyfikatu odszyfrowywania ze swojego profilu, gdy opuszczasz komputer, i zainstaluj go ponownie, gdy wrócisz. * </p> <p> * Uwaga: Aby usunąć i ponownie zaimportować klucz odzyskiwania (certyfikat), przejdź do: </p> <blockquote> <p> za. <strong> Panel sterowania </strong> &gt; <strong> Opcje internetowe. <br> </strong> b. W „Opcjach internetowych” kliknij <strong> Zawartość </strong> zakładka, a następnie kliknij <strong> Certyfikat </strong> s. <br> do. W zakładce „Osobiste” kliknij <strong> Usunąć </strong> , aby usunąć klucz deszyfrujący (certyfikat) lub kliknij <strong> Import </strong> przycisk, aby ponownie zainstalować certyfikat deszyfrowania z dysku USB. </p> </blockquote> <ul> <li> <p><strong> Powiązany artykuł: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"noopener noreferrer\"> Jak odszyfrować pliki zaszyfrowane EFS i usunąć szyfrowanie EFS. </a></strong></p> </li> </ul> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu </p>"}