{"title":"Jak zmienić połączenie drukarki HP z USB na bezprzewodowe.","content":"<p> Jeśli posiadasz drukarkę HP obsługującą łączność bezprzewodową, podłączoną kablem USB i chcesz zmienić jej połączenie na bezprzewodowe, przeczytaj ten samouczek, aby wykonać to zadanie. Instrukcje są przydatne, jeśli nie masz routera obsługującego WPS lub jeśli chcesz ponownie skonfigurować ustawienia bezprzewodowe drukarki w przypadku zmiany routera bezprzewodowego. </p> <h4> Jak podłączyć drukarkę podłączoną przez USB do sieci bezprzewodowej. </h4> <p> 1. Na panelu drukarki naciśnij przycisk Sieć bezprzewodowa <img src=\"images/image_thumb-55-307.png\" alt=\"image\" loading=\"lazy\"> aby włączyć sieć bezprzewodową. * </p> <p> * Uwaga: Jeśli wcześniej podłączyłeś drukarkę do innej sieci bezprzewodowej, przytrzymaj <strong> Bezprzewodowy </strong> przycisk <img src=\"images/image_thumb-57-212.png\" alt=\"image\" loading=\"lazy\"> i <strong> Anuluj </strong> przycisk <strong> X </strong> z panelu sterowania drukarki, aby przywrócić domyślne ustawienia sieci bezprzewodowej. (Ta procedura działa w większości modeli drukarek HP. Sprawdź w instrukcji obsługi drukarki, że proces resetowania jest prawidłowy.) </p> <p> 2. Podłącz drukarkę do komputera za pomocą kabla USB. </p> <p> 3. Pobierz i zainstaluj najnowsze pełne oprogramowanie i sterowniki dla swojej drukarki z <a href=\"https://support.hp.com/us-en/drivers/printers\" target=\"_blank\" rel=\"nofollow noopener\"> Witryna pomocy technicznej dla drukarek HP </a> . </p> <p> 4. Po zainstalowaniu oprogramowania drukarki otwórz ikonę z nazwą drukarki, aby uruchomić <strong> Asystent drukarki HP </strong> . </p> <p> 5. Kliknij <strong> Konfiguracja urządzenia i oprogramowanie </strong> . </p> <p><img src=\"images/image_thumb-48-818.png\" alt=\" Change HP Printer Connection from USB to Wireless\" loading=\"lazy\"></p> <p> </p> <p> 6. Kliknij <strong> Konwertuj urządzenie podłączone przez USB na bezprzewodowe </strong> . </p> <p><img src=\"images/image_thumb-49-582.png\" alt=\"Connect HP Pinter to Wireless Network using the USB Connection\" loading=\"lazy\"></p> <p> </p> <p> 7. W ustawieniach sieci bezprzewodowej sprawdź, czy nazwa sieci bezprzewodowej (SSID) jest poprawna. Następnie… </p> <blockquote><p> 1. Kliknij, aby <strong> Pokaż hasło do sieci bezprzewodowej </strong> . </p> <p> 2. Upewnij się, że hasło sieci bezprzewodowej jest poprawne (w przeciwnym razie wpisz hasło sieci bezprzewodowej). </p> <p> 3. Wybierz <strong> Tak, chcę korzystać z tej sieci </strong> . </p> <p> 4. Kliknij <strong> Kolejny </strong> . </p></blockquote> <p><img src=\"images/image_thumb-50-641.png\" alt=\"Connect HP Pinter to Wireless using USB\" loading=\"lazy\"></p> <p> </p> <p> 8. Poczekaj na zakończenie konfiguracji bezprzewodowej. </p> <p><img src=\"images/image_thumb-51-477.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Gdy zostaniesz o to poproszony, kliknij <strong> tak </strong> w Udostępnianiu urządzeń. </p> <p><img src=\"images/image_thumb-52-556.png\" alt=\"Connect HP Pinter to Wireless network using USB\" loading=\"lazy\"></p> <p> </p> <p> 10. Po zakończeniu konfiguracji sieci bezprzewodowej odłącz kabel USB i kliknij <strong> Kolejny </strong> . </p> <p><img src=\"images/image_thumb-58-143.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 11. Kliknij <strong> dobrze </strong> aby sprawdzić, czy kabel USB został usunięty. </p> <p><img src=\"images/image_thumb-59-549.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 12. Jesteś teraz gotowy do bezprzewodowego korzystania z drukarki HP. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}