{"title":"Jak odzyskać plik DBX programu Outlook Express za darmo.","content":"<p> Outlook Express to program klienta poczty e-mail, który po raz pierwszy pojawił się w systemie Windows XP. Ale nawet dzisiaj (rok 2018) niektórzy klienci nadal używają go jako głównego programu poczty e-mail. Jednym z głównych problemów programu Outlook Express jest problem z limitem 2 GB. </p> <p> Opis problemu z limitem rozmiaru 2 GB w programie Outlook Express. <br> Gdy jeden z głównych folderów programu Outlook Express (np. „Skrzynka odbiorcza” lub „Wysłane”) przekracza rozmiar 2 GB, odpowiedni plik magazynu OE DBX może zostać uszkodzony, a folder OE może wydawać się pusty. W wyniku tego problemu program Outlook Express nie może wysyłać ani odbierać wiadomości e-mail i wyświetla błąd <a href=\"https://www.repairwin.com/fix-outlook-express-error-0x800c0133-due-to-2gb-size-limit/\" target=\"_blank\" rel=\"nofollow noopener\"> 0x800c0133 </a> podczas operacji wysyłania/odbierania. </p> <p> W tym samouczku pokażę, jak naprawić uszkodzony plik DBX z programu Outlook Express i odzyskać swoje e-maile! </p> <h4> Jak naprawić uszkodzony plik DBX programu Outlook Express. </h4> <p> Jeśli jeden z folderów programu Outlook Express (skrzynka odbiorcza, Wyślij itp.) zostanie uszkodzony, postępuj zgodnie z poniższymi instrukcjami, aby naprawić folder sklepu DBX i odzyskać swoje wiadomości e-mail. </p> <h6> Krok 1. Włącz widok ukrytych plików. </h6> <p> 1. Otwórz Eksploratora Windows. <br> 2. Od <strong> Przybory </strong> wybierz menu <strong> Opcje folderu </strong> . <br> 3. Na karcie Widok kliknij <strong> Pokaż ukryte pliki i foldery </strong> i kliknij <strong> DOBRZE. </strong></p> <p><img src=\"images/image_thumb-2-290.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Krok 2. Zlokalizuj uszkodzony plik DBX programu Outlook Express na dysku. </h6> <p> 1. Otwórz folder sklepu Outlook Express. Zwykle ten folder znajduje się w następującej ścieżce na dysku: </p> <ul> <li> C:\\Documents and Settings\\\\Ustawienia lokalne\\Dane aplikacji\\Identities\\{}\\Microsoft\\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> na przykład „C: \\ Dokumenty i ustawienia \\ Użytkownik \\ Ustawienia lokalne \\ Dane aplikacji \\ Tożsamości \\ {D8F3C56D-965E-41AE-8A23-A58460ABAE00} \\ Microsoft \\ <strong> Outlook Express </strong> ” </p></blockquote> <p> 3. Od Odkrywcy <strong> Widok </strong> wybierz menu <strong> Detale </strong> . <br> 4. Zlokalizuj, który plik DBX przekracza limit 2 GB lub zlokalizuj uszkodzony plik DBX. (uszkodzony plik DBX to folder MAIL, który wydaje się pusty w programie Outlook Express). </p> <p><img src=\"images/image_thumb-3-887.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Skopiuj ten plik DBX do innej lokalizacji na dysku (np. do nowego folderu na pulpicie o nazwie „CorruptedDBX”). </p> <p> </p> <h6> Krok 3. Pobierz UnDBX – bezpłatne narzędzie do odzyskiwania DBX Outlook Express. </h6> <p> UnDBX to doskonałe i bezpłatne narzędzie do naprawy DBX programu Outlook Express, które może wyodrębnić wszystkie zawarte wiadomości e-mail programu Outlook Express w formacie .eml. Dodatkowo posiada opcję naprawy i naprawy uszkodzonego pliku .DBX programu Outlook Express. </p> <p> Możesz pobrać UnDBX z <a href=\"https://sourceforge.net/projects/undbx/\" target=\"_blank\" rel=\"nofollow noopener\"> tutaj </a> . </p> <p> </p> <h6> Krok 4. Odzyskaj wiadomości e-mail z uszkodzonego pliku DBX programu Outlook Express. </h6> <p> 1. Aby odzyskać wiadomości e-mail z uszkodzonego pliku DBX, kliknij dwukrotnie, aby uruchomić narzędzie UnDBX. <br> 2. W narzędziu UnDBX: </p> <blockquote><p> 1. Wybierz folder zawierający pliki .dbx programu Outlook Express, a następnie <strong> czek </strong> „ <strong> włącz tryb odzyskiwania </strong> ” poniżej. <br> 2. <strong> Wybierz folder docelowy </strong> na komputerze w celu przechowywania (wyodrębniania) plików .eml. (np. do folderu na pulpicie o nazwie „RecoveredInbox”) <br> 3. Na koniec kliknij <strong> Wyzdrowieć </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-645.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Po zakończeniu odzyskiwania UnDBX otwórz program Outlook Express. <br> 4. Przejdź do folderu, w którym UnDBX zapisał wyodrębnione pliki .eml. <br> 5. Przeciągnij i upuść wyodrębnione wiadomości e-mail do odpowiedniego folderu (w programie Outlook Express). * </p> <p><strong> * Sugestia: </strong> Aby uniknąć ponownego uszkodzenia folderów programu Outlook Express (lub ominąć limit 2 GB), sugeruję przeciąganie i upuszczanie e-maili w grupach (np. według roku) i umieszczanie ich w różnych folderach w OE. Na przykład wybierz tylko e-maile z bieżącego roku i przeciągnij je i upuść do nowego folderu OE o nazwie z bieżącym rokiem (np. &quot;Skrzynka odbiorcza 2018&quot;). Następnie powtórz te same kroki ze wszystkich innych e-maili z poprzednich lat. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}