{"title":"Jak odinstalować wersję Edge Chromium w systemie Windows 10.","content":"<p> Wielu użytkowników zgłosiło, że po zainstalowaniu nowej wersji przeglądarki Microsoft Edge opartej na Chromium w systemie Windows 10 system stawał się zbyt wolny lub zawieszał się losowo. Jeśli napotykasz ten sam problem, kontynuuj czytanie poniżej, aby odinstalować wersję Edge Chromium z komputera. * </p> <p> * Uwaga: jeśli wersja przeglądarki Microsoft Edge na Chromium nie jest jeszcze zainstalowana w Twoim systemie, przeczytaj instrukcje na ten temat <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> artykuł </a> aby zapobiec automatycznej instalacji Microsoft Edge. </p> <p><img src=\"images/image_thumb-38-388.png\" alt=\"Remove Edge Chromium in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Nowa wersja przeglądarki Microsoft Edge oparta na Chromium jest instalowana automatycznie z <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> aktualizacja. W takim przypadku nie można usunąć przeglądarki Microsoft Edge z <strong> Początek </strong> menu <img src=\"images/image_thumb2_thumb_thumb-565.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Ustawienia </strong><img src=\"images/image_thumb-66-219.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Aplikacje </strong> -&gt; <strong> Aplikacje i funkcje </strong> opcje, ponieważ <strong> Odinstaluj </strong> opcja jest wyszarzona. Aby ominąć to ograniczenie, wykonaj poniższe czynności. </p> <p><img src=\"images/image_thumb-39-654.png\" alt=\"How to Uninstall Edge Chromium version in Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Jak usunąć Edge Chromium z Windows 10. </h4> <p> Aby odinstalować nowy Edge oparty na Chromium w systemie Windows 10: </p> <p> 1. Przejdź do następującego folderu na swoim komputerze: * </p> <ul> <li> C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\85.0.564.41\\Installer </li> </ul> <p> * Uwaga: nazwa folderu „85.0.564.41” wskazuje zainstalowaną wersję nowej wersji Chromium i może się różnić na Twoim komputerze. </p> <p> 2. Wybierz ścieżkę folderu w pasku adresu i kliknij prawym przyciskiem myszy &gt; <strong> Kopiuj. </strong></p> <p><img src=\"images/image_thumb35_thumb-738.png\" alt=\"image_thumb[35]\" loading=\"lazy\"></p> <p> </p> <p> 3. Otwórz <strong> Wiersz Poleceń jako Administrator, </strong> rodzaj <strong> Płyta CD </strong> a następnie naciśnij <strong> CTRL+V </strong> do wklejenia do skopiowanej ścieżki folderu. Po zakończeniu naciśnij <strong> Wchodzić </strong> . * </p> <p> * np.: W obecnym przykładzie poleceniem będzie: </p> <p><em> cd C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\85.0.564.41\\Installer </em></p> <p><img src=\"images/image_thumb39_thumb-252.png\" alt=\"Uninstall Edge Chromium\" loading=\"lazy\"></p> <p> </p> <p> 4. Teraz podaj poniższe polecenie (Kopiuj / Wklej) w wierszu polecenia, aby usunąć wersję Chromium przeglądarki Microsoft Edge z komputera. </p> <ul> <li> setup.exe –odinstaluj –poziom systemu –pełne rejestrowanie –force-uninstall </li> </ul> <p><img src=\"images/image_thumb47_thumb-506.png\" alt=\"Uninstall Edge Chromium command\" loading=\"lazy\"></p> <p> 5. Po wykonaniu powyższego polecenia, stara wersja EDGE zostanie ponownie aktywowana. Uruchom ponownie komputer, aby zastosować zmiany. <br> 6. Po ponownym uruchomieniu przejdź do ręcznej instalacji <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> nowa przeglądarka Edge oparta na Chromium </a> na komputerze, aby uniknąć automatycznej dostawy lub uniemożliwić przyszłą instalację Edge Chromium, korzystając z instrukcji zawartych w tym artykule: <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak zapobiec automatycznej instalacji Edge Chromium w systemie Windows 10. </a></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}