{"title":"Jak zablokować YouTube w systemie Windows 10.","content":"<p> Ponieważ nauka na odległość stała się częścią życia dzieci w ostatnich latach, wielu rodziców szuka sposobu na blokowanie filmów z YouTube podczas e-learningu lub zmniejszenie ilości czasu, jaki dzieci spędzają przed komputerem oglądając filmy zamiast wykonywać inne czynności. </p> <p> Oprócz uzależnienia od YouTube, które niepokoi rodziców, w ostatnich latach na YouTube pojawiło się wiele filmów z nieodpowiednimi lub niebezpiecznymi treściami dla dzieci i z tego powodu konieczne jest ograniczenie dostępu do YouTube, zwłaszcza gdy nie ma nadzoru ze strony rodziców. </p> <p> W tym przewodniku dowiesz się, jak uniemożliwić dostęp do witryny YouTube we wszystkich przeglądarkach. * </p> <p> * Uwaga: jeśli chcesz zablokować witrynę tylko w przeglądarce Chrome lub Firefox, przeczytaj ten artykuł: <a href=\"https://www.repairwin.com/block-websites-on-chrome-firefox/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak blokować strony internetowe w Chrome i Firefox. </a></p> <h2> Jak zablokować YouTube w dowolnej przeglądarce w systemie Windows 10, 8 lub 7. </h2> <p> Najbardziej niezawodnym sposobem zablokowania dowolnej witryny w dowolnej przeglądarce na komputerze z systemem Windows jest użycie pliku „hosts”. <strong> zastępy niebieskie </strong> plik to plik systemu operacyjnego, który mapuje nazwy hostów (nazwy domen) na adresy IP. W prostych słowach, kiedy wpisujesz adres strony internetowej w przeglądarce, komputer najpierw patrzy na lokalną <strong> zastępy niebieskie </strong> plik, aby rozwiązać jego adres IP. Jeśli nazwa witryny nie pojawia się w pliku hosta, oznacza to, że próbuje znaleźć swój adres IP z usługi DNS, której używasz na swoim urządzeniu. </p> <p> Aby zablokować YouTube w dowolnej przeglądarce internetowej (np. Chrome, Firefox, Edge itp.) w systemie Windows za pomocą pliku hosts: </p> <p> 1. Otwórz <strong> Notatnik </strong> podanie <strong> jako Administrator </strong> . Aby to zrobić: </p> <blockquote><p> za. Rodzaj <strong> notatnik </strong> w polu wyszukiwania </p> <p> b. <strong> Kliknij prawym przyciskiem myszy </strong> na <strong> Notatnik </strong> i wybierz <strong> Uruchom jako administrator </strong> . </p> <p><img src=\"images/image_thumb-584.png\" alt=\"run notepad as administrator\" loading=\"lazy\"></p></blockquote> <p> </p> <p> 2. Od <strong> Plik </strong> menu, wybierz <strong> Otwarty. <br> </strong> 3. Przejdź do tej lokalizacji na dysku: </p> <ul> <li> C:\\Windows\\System32\\sterowniki\\itp </li> </ul> <p> 4. Zmień „Typ pliku” na <strong> Wszystkie pliki </strong> a następnie otwórz <strong> zastępy niebieskie </strong> plik </p> <p><img src=\"images/image_thumb-1-968.png\" alt=\"block sites hosts file\" loading=\"lazy\"></p> <p> </p> <p> 5. Na koniec dodaj następujące wiersze:* </p> <ul> <li> 127.0.0.1    youtube.com </li> <li> 127.0.0.1    www.youtube.com </li> <li> 127.0.0.1    m.youtube.com </li> </ul> <p> * Uwaga: naciśnij TAB po wpisaniu 127.0.0.1 </p> <p><img src=\"images/image_thumb-2-460.png\" alt=\"block youtube hosts\" loading=\"lazy\"></p> <p> </p> <p> 6. Po zakończeniu kliknij <strong> Plik </strong> &gt; <strong> Zapisać </strong> i zamknij notatnik. </p> <p> 7. Na koniec otwórz przeglądarkę i spróbuj odwiedzić YouTube. Zwykle powinien pojawić się komunikat: „Połącz z Internetem. Jesteś offline. Sprawdź połączenie”. </p> <p><img src=\"images/image_thumb-3-490.png\" alt=\"block youtube.com hosts\" loading=\"lazy\"></p> <p> </p> <p> 8. Gotowe. Jeśli chcesz odblokować YouTube w przyszłości, wykonaj te same kroki. ale tym razem usuń trzy (3) dodane linie w pliku hosts lub wpisz symbol <strong> # </strong> przed każdą dodaną linią. </p> <p> To wszystko ludzie! Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}