{"title":"Jak zawsze otwierać Chrome w trybie incognito.","content":"<p> Jeśli szukasz sposobu, aby Chrome zawsze otwierał się w trybie incognito, czytaj dalej poniżej. Gdy uruchamiasz Chrome w trybie incognito, Twoja aktywność w przeglądarce pozostaje prywatna przed innymi użytkownikami korzystającymi z tego samego urządzenia. W trybie incognito Chrome nie zapisuje historii przeglądania, plików cookie ani informacji wprowadzanych w formularzach. </p> <p> Ręczny sposób, aby rozpocząć nową sesję Chrome w trybie incognito, to przejście do menu Chrome <img src=\"images/image_thumb10_thumb-963.png\" alt=\"image_thumb[10]\" loading=\"lazy\"> i wybierz „Nowe okno incognito” lub naciśnij CTRL + SHIFT + N. </p> <p><img src=\"images/image_thumb-42-832.png\" alt=\"Chrome New incognito window\" loading=\"lazy\"></p> <p> </p> <p> W tym artykule znajdziesz instrukcje, jak zawsze uruchamiać Google Chrome w trybie incognito. </p> <h4> Jak zawsze uruchamiać Google Chrome w trybie incognito. </h4> <p> Jeśli chcesz zawsze uruchamiać Chrome w trybie incognito, utwórz nowy skrót do Chrome i zmodyfikuj jego właściwości w następujący sposób: </p> <p> 1, <strong> Kliknij prawym przyciskiem myszy </strong> na <strong> Google Chrome </strong> skrót i wybierz <strong> Nieruchomości </strong> . <br> 2. W <strong> Generał </strong> dodaj przełącznik „–incognito” (bez cudzysłowów), na końcu linii docelowej i kliknij <strong> dobrze </strong> : </p> <p> na przykład „C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe” – incognito </p> <p><img src=\"images/image_thumb-43-798.png\" alt=\"How to Always Open Chrome in Incognito mode.\" loading=\"lazy\"></p> <p> 3. Od teraz, po uruchomieniu Chrome ze zmodyfikowanego skrótu, Chrome otworzy się w trybie incognito. * </p> <p><strong> * WSKAZÓWKA: </strong> Jeśli chcesz otworzyć Chrome w trybie incognito, otwierając hiperłącze (URL) z poczty e-mail lub innego programu, musisz zmodyfikować rejestr. Aby to zrobić: </p> <blockquote> <p> 1. Otwórz <strong> Edytor rejestru </strong> . <br> 2. W rejestrze przejdź do następującego klucza: </p> <ul> <li> <p> HKEY_CLASSES_ROOT Chrome HTML shell otwórz polecenie </p> </li> </ul> <p> 3. W prawym okienku kliknij dwukrotnie ikonę <strong> Domyślna </strong> Wartość ciągu REG_SZ. </p> </blockquote> <p><img src=\"images/image_thumb-44-612.png\" alt=\"open url in chrome incognito\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. Dodaj przełącznik dodaj słowo „incognito” (bez cudzysłowów) przed „%1” i kliknij <strong> dobrze </strong> . </p></blockquote> <blockquote><p> na przykład Zmień dane wartości z: </p> <p> „C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe” — „%1” </p> <p> do: </p> <p> „C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe” – incognito „%1” </p></blockquote> <p><img src=\"images/image_thumb-45-148.png\" alt=\"open url chrome incognito - registry\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Od teraz, po kliknięciu adresu URL (HTML), Chrome otworzy go w trybie incognito. </p></blockquote> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}