{"title":"Jak uniemożliwić systemowi Windows 10 automatyczną instalację drukarek sieciowych.","content":"<p> Jak już zapewne zauważyłeś, system Windows 10 automatycznie instaluje sterowniki dla dowolnej drukarki podłączonej do sieci lub innego urządzenia. Ale chociaż jest to bardzo przydatna funkcja, jest również bardzo denerwująca, szczególnie w środowiskach biznesowych, w których nie chcesz, aby wszystkie drukarki były używane przez wszystkich użytkowników sieci. </p> <p> Oczywiście, jeśli nie chcesz urządzenia sieciowego i aplikacji jego producenta, możesz usunąć je ze swojego systemu. Ale system Windows 10 automatycznie zainstaluje go ponownie. Aby tego uniknąć, należy uniemożliwić systemowi Windows automatyczne instalowanie urządzeń podłączonych do sieci (drukarek, skanerów, aparatów itp.) oraz ich aplikacji i ikon niestandardowych producenta. </p> <h3> Jak ZATRZYMAĆ system Windows 10, aby automatycznie zainstalować urządzenia sieciowe i aplikacje. </h3> <p> 1. Przejdź do <strong> Panel sterowania </strong> . Aby to zrobić: </p> <blockquote><p> za. Wpisz „panel sterowania” w polu wyszukiwania systemu Windows <br> b. Kliknij <strong> Panel sterowania </strong> z wyników. </p></blockquote> <p><img src=\"images/image_thumb-53-862.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Ustaw <strong> Widok przez </strong> do <strong> Małe ikony </strong> aby wyświetlić wszystkie elementy panelu sterowania, a następnie kliknij <strong> Centrum sieci i udostępniania. </strong></p> <p><img src=\"images/image_thumb-37-625.png\" alt=\"control panel network and sharing center\" loading=\"lazy\"></p> <p> </p> <p> 3. Wybierz <strong> Zaawansowane ustawienia udostępniania </strong> po lewej <strong> . </strong></p> <p><img src=\"images/image_thumb-38-656.png\" alt=\"Prevent Windows 10 to Install Network Printers Automatically\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Wyczyść „ <strong> Włącz automatyczną konfigurację urządzeń podłączonych do sieci&quot; </strong> i kliknij <strong> Zapisz zmiany. </strong></p> <p><img src=\"images/image_thumb-39-992.png\" alt=\"Turn Off automatic setup of network connected devices \" loading=\"lazy\"></p> <p> </p> <p><strong> Opcjonalny: </strong> Jeśli chcesz uniemożliwić systemowi Windows 10 automatyczne pobieranie i instalowanie aplikacji producenta i niestandardowych ikon dla dowolnego podłączonego urządzenia na komputerze, wykonaj następujące czynności: </p> <blockquote><p> 1. Przejdź do <strong> Panel sterowania </strong> -&gt; <strong> System </strong> . <br> 2. Kliknij <strong> Ochrona systemu </strong> po lewej. <br> 3. Na karcie Sprzęt kliknij <strong> Ustawienia instalacji urządzenia </strong> . </p></blockquote> <p><img src=\"images/image_thumb-40-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. W sekcji „Ustawienia instalacji urządzenia” wybierz  „ <strong> Nie (Twoje urządzenie może nie działać zgodnie z oczekiwaniami)&quot; </strong> i kliknij <strong> Zapisz zmiany </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-728.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym przewodniku. </p>"}