{"title":"Jak sprawdzić dostępność aktualizacji w pakiecie Office 2019, 2016 lub 2013 w systemie Windows 10.","content":"<p> W tym samouczku dowiesz się, jak ręcznie sprawdzać dostępność aktualizacji w pakietach Office 2019, 2016 i Office 2013. We wszystkich wersjach pakietu Office dostępne są dwa sposoby instalowania dostępnych aktualizacji pakietu Office: automatycznie i ręcznie. </p> <h4> Jak ręcznie zaktualizować pakiet Office 209/2016/2013/2010. </h4> <h6> Metoda 1. Jak ręcznie sprawdzić dostępność aktualizacji pakietu Office w pakietach Office 2019, 2016 i Office 2013. </h6> <p> Aby ręcznie sprawdzić i zainstalować dostępne aktualizacje pakietu Office, we wszystkich wersjach pakietu Office: </p> <p> 1. Otwórz dowolny program pakietu Office (np. Word). <br> 2. Od <strong> Plik </strong> menu, wybierz <strong> Konto </strong> . * </p> <p> * Uwaga: w pakiecie Office 2010 wybierz <strong> Wsparcie. </strong></p> <p> 3. Rozwiń <strong> Opcje aktualizacji </strong> i kliknij <strong> Aktualizuj teraz </strong> . * </p> <p> * Uwaga: Jeśli „Opcje aktualizacji” nie są dostępne, postępuj zgodnie z instrukcjami w Method-2 poniżej. </p> <p><img src=\"images/image_thumb-19-478.png\" alt=\"How to Check for Updates in Office 2019, 2016 or 2013 in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Metoda 2. Jak automatycznie zainstalować aktualizacje pakietu Office dla pakietu Office 2019, 2016 i pakietu Office 2013. </h6> <p> Jeśli chcesz, aby system Windows automatycznie pobierał i instalował dostępne aktualizacje pakietu Office, przejdź do ustawień aktualizacji systemu Windows i sprawdź następujące ustawienie: </p> <ul> <li> Otrzymuj aktualizacje dla innych produktów firmy Microsoft podczas aktualizacji systemu Windows (Windows 10) </li> <li> Daj mi aktualizacje innych produktów firmy Microsoft, gdy aktualizuję system Windows (Windows 7) </li> </ul> <h5> Aby automatycznie zainstalować aktualizacje pakietu Office w systemie Windows 10. </h5> <p><strong> 1. </strong> Iść do <strong> Ustawienia </strong> -&gt; <strong> Aktualizacja i zabezpieczenia -&gt; Opcje zaawansowane. </strong></p> <p><img src=\"images/image_thumb-20-149.png\" alt=\"Change Update Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> W opcjach aktualizacji przeciągnij suwak „Otrzymuj aktualizacje innych produktów firmy Microsoft podczas aktualizacji systemu Windows” do <strong> NA. </strong></p> <p><img src=\"images/image_thumb-21-717.png\" alt=\"automatically install office updates windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Przejdź do poprzedniego ekranu i kliknij <strong> Sprawdź aktualizacje </strong> przycisk, w którym chcesz natychmiast zainstalować dostępne aktualizacje pakietu Office. </p> <p> </p> <h5> Aby automatycznie zainstalować aktualizacje pakietu Office w systemie Windows 7. </h5> <p> 1. Przejdź do <strong> Panel sterowania </strong> -&gt; <strong> Aktualizacja systemu Windows </strong> i kliknij <strong> Zmień ustawienia </strong> . </p> <p><img src=\"images/image_thumb-22-108.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Wybierz <strong> Informuj mnie o aktualizacjach innych produktów firmy Microsoft, gdy aktualizuję system Windows </strong> pole wyboru i kliknij <strong> Zastosować </strong> . </p> <p> 3. Kliknij <strong> Sprawdź aktualizacje </strong> zainstalować wszystkie dostępne aktualizacje. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym przewodniku. </p> <p> </p>"}