{"title":"Jak przenieść pocztę Thunderbird i ustawienia na nowy komputer.","content":"<p> Ten samouczek zawiera szczegółowe instrukcje dotyczące przenoszenia wiadomości e-mail Thunderbirda, ustawień konta i książek adresowych na inny komputer. Aplikacja poczty e-mail Thunderbird przechowuje wszystkie dane w folderze profilu, który ma rozszerzenie „.default” na końcu swojej nazwy. (np. „wyhsxcvs.default”). Domyślnie ten folder profilu jest przechowywany w następującej lokalizacji na komputerze: </p> <ul> <li> C:\\Użytkownicy\\\\AppData\\Roaming\\Thunderbird\\Profile\\ <strong> .domyślna </strong></li> </ul> <p><img src=\"images/image_thumb-14-425.png\" alt=\"How to Transfer Thunderbird Emails & Data to a New Computer.\" loading=\"lazy\"></p> <p> Tak więc, jeśli chcesz przenieść dane Thunderbirda na nowy komputer, musisz przenieść nadrzędny folder „Thunderbird” na nowy komputer, a następnie wskazać Thunderbirdowi ten folder. </p> <h4> Jak przenieść profil Thunderbirda na inny komputer. </h4> <h6> Krok 1. Skopiuj folder Thunderbird Profile ze starego komputera. </h6> <p> </p> <p> Na starym komputerze przejdź do lokalizacji przechowywania danych Thunderbirda. Aby to zrobić: </p> <p> 1. Otwórz Thunderbirda. <br> 2. Z menu <img src=\"images/image_thumb21_thumb-959.png\" alt=\"image_thumb[21]\" loading=\"lazy\"> , wybierz <strong> Wsparcie </strong> -&gt; <strong> Informacje o rozwiązywaniu problemów. <br> </strong> 3. W <strong> Folder profilu </strong> linia, kliknij <strong> Otwórz folder </strong> . </p> <p><img src=\"images/image_thumb-8-878.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Zamknij aplikację Thunderbird. <br> 5. W oknie Eksploratora kliknij na <strong> Roaming </strong> . </p> <p><img src=\"images/image_thumb-9-272.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Kopiuj </strong> i <strong> Pasta </strong> <strong> Thunderbird </strong> folder na nośnik pamięci z wystarczającą ilością wolnego miejsca. (np. zewnętrzny dysk USB). </p> <p><img src=\"images/image_thumb-10-958.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Krok 2. Przenieś profil Thunderbirda na nowy komputer. </h6> <p> 1. <a href=\"https://www.thunderbird.net/en-US/download/\" target=\"_blank\" rel=\"nofollow noopener\"> Ściągnij </a> i zainstaluj Thunderbirda na nowym komputerze. * </p> <p><strong> * Ważne: </strong> Pod koniec procesu instalacji, <strong> odznacz </strong> opcję „Uruchom Mozilla Thunderbird teraz” i kliknij <strong> koniec </strong> . </p> <p><img src=\"images/image_thumb-11-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Podłącz dysk USB (z folderem „Thunderbird”) do nowego komputera. <br> 3. Kliknij prawym przyciskiem myszy folder „Thunderbird” i kliknij <strong> Kopiuj </strong> . <br> 4. Naciśnij Windows <img src=\"images/image_thumb8_thumb-1-464.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 5. Wpisz następujące polecenie <strong> </strong> i naciśnij <strong> Wchodzić: </strong></p> <ul> <li><strong> %dane aplikacji% </strong></li> </ul> <p><img src=\"images/image_thumb-12-421.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. W oknach Eksploratora kliknij prawym przyciskiem myszy puste miejsce i kliknij <strong> Pasta </strong> . </p> <p><img src=\"images/image_thumb-13-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Uruchom Thunderbirda i powinieneś zobaczyć wszystkie swoje e-maile, książki adresowe i ustawienia konta, tak jak na starym komputerze. </p> <p> To wszystko! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}