{"title":"Jak chronić komputer za pomocą funkcji BitLocker w systemie Windows 10.","content":"<p> Ten samouczek zawiera instrukcje krok po kroku dotyczące ochrony hasłem komputera za pomocą szyfrowania BitLocker. BitLocker to funkcja pełnego szyfrowania dysku zawarta w wersjach Windows 10 Professional i Enterprise, która może pomóc w ochronie danych osobistych przed nieautoryzowanym dostępem. </p> <p> Wyobraź sobie następujący scenariusz: Twój osobisty laptop zostanie skradziony lub zgubiony, a Twoje prywatne dane są dostępne dla niedyskretnych oczu. Aby tego uniknąć, przeczytaj ten przewodnik i dowiedz się, jak zabezpieczyć hasłem swój komputer i cenne dane za pomocą silnego szyfrowania, aby stać się niedostępnym dla nikogo bez hasła odszyfrowywania. </p> <ul> <li><strong> Powiązany artykuł: <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak chronić folder hasłem. </a></strong></li> </ul> <h4> Jak używać funkcji BitLocker do szyfrowania i ochrony komputera z systemem Windows 10. </h4> <p> Aby chronić dysk z systemem operacyjnym za pomocą funkcji BitLocker w systemie Windows 10 Pro lub Enterprise: </p> <p> 1. Z systemu Windows <strong> Panel sterowania </strong> , Kliknij <strong> System i bezpieczeństwo </strong> a następnie kliknij <strong> Szyfrowanie dysków bitlocker </strong> . </p> <p><img src=\"images/image_thumb-33-320.png\" alt=\"How to Protect your PC with BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Obok napędu C: systemu operacyjnego kliknij <strong> Włącz funkcję BitLocker </strong> . * </p> <p> * Uwaga: jeśli po naciśnięciu „Włącz funkcję BitLocker” pojawi się błąd „To urządzenie nie może korzystać z modułu Trusted Platform…”, przeczytaj ten artykuł, aby rozwiązać problem. </p> <p><img src=\"images/image_thumb-34-100.png\" alt=\"turn on bitlocker operating system drive\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Na następnym ekranie wybierz sposób odblokowania dysku podczas uruchamiania. </p> <blockquote><p> 1. Jeśli chcesz odblokować komputer za pomocą urządzenia USB, kliknij <strong> Włóż dysk flash USB. <br> </strong> 2. Jeśli chcesz odblokować komputer, wpisując hasło, kliknij <strong> Wprowadź hasło </strong> . (jak w tym przykładzie) </p></blockquote> <p><img src=\"images/image_thumb-35-212.png\" alt=\"enable bitlocker protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Teraz wpisz bardzo silne hasło i kliknij <strong> Kolejny </strong> . </p> <p><img src=\"images/image_thumb-36-435.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Teraz wybierz, gdzie chcesz zapisać* klucz odzyskiwania i kliknij <strong> Kolejny </strong> . * </p> <p> * Na przykład: jeśli logujesz się do systemu Windows 10 za pomocą konta Microsoft, kliknij <strong> Zapisz na swoim koncie Microsoft. </strong> Jeśli logujesz się do systemu Windows 10 za pomocą konta lokalnego, wybierz jedną z pozostałych opcji. </p> <p> Uwagi: <br> 1. Jeśli zapiszesz klucz odzyskiwania funkcji BitLocker na swoim koncie Microsoft, możesz wyświetlić klucz po zalogowaniu się do <a title=\"https://onedrive.live.com/recoverykey.\" href=\"https://onedrive.live.com/recoverykey.\" target=\"_blank\" rel=\"nofollow noopener\"> https://onedrive.live.com/recoverykey. </a><br> 2. Zawsze wolę przechowywać klucz odzyskiwania na dysku USB, aby być przygotowanym na rozwiązywanie problemów z funkcją BitLocker. </p> <p> </p> <p><img src=\"images/image_thumb-37-801.png\" alt=\"save bitlocker recovery key\" loading=\"lazy\"></p> <p> </p> <p> 6. Na następnym ekranie pozostaw ustawienia domyślne, jeśli komputer i/lub dysk są nowe, a następnie kliknij <strong> Kolejny </strong> jeszcze raz. </p> <p><img src=\"images/image_thumb-38-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. W opcjach trybu szyfrowania pozostaw ustawienie domyślne i kliknij <strong> Kolejny </strong> . </p> <p><img src=\"images/image_thumb-39-785.png\" alt=\"bitlocker encryption mode\" loading=\"lazy\"></p> <p> </p> <p> 8. Na ostatnim ekranie kliknij <strong> Kontyntynuj </strong> , w celu ponownego uruchomienia i sprawdzenia systemu przed włączeniem ochrony BitLocker. </p> <p><img src=\"images/image_thumb-40-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Po ponownym uruchomieniu zostaniesz poproszony o podanie hasła funkcji BitLocker. Wpisz swoje hasło i naciśnij <strong> Wchodzić </strong> . * </p> <p> * Uwaga: jeśli funkcja BitLocker nie może zaakceptować hasła lub jeśli napotkasz inne problemy, spróbuj wykonać jedną z następujących czynności, aby zalogować się do systemu Windows: </p> <blockquote><p> 1. Naciśnij klawisz ESC na ekranie Hasło funkcji BitLocker, aby uzyskać dostęp do opcji odzyskiwania. <br> 2. Naciśnij kilkakrotnie klawisz ESC po włączeniu komputera, aby ominąć test funkcji BitLocker. </p></blockquote> <p> 10. Jeśli testy funkcji BitLocker zakończą się pomyślnie, po uruchomieniu systemu Windows 10 funkcja BitLocker rozpocznie szyfrowanie dysku systemu operacyjnego. Aby wyświetlić stan procesu szyfrowania, kliknij powiadomienie BitLocker na pasku zadań lub przejdź do Panelu sterowania &gt; Szyfrowanie dysków funkcją BitLocker. </p> <p><img src=\"images/image_thumb-41-171.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}