{"title":"Jak znaleźć Windows Media Player w Windows 10.","content":"<p> Przez wiele lat domyślną aplikacją do odtwarzania muzyki i filmów był Windows Media Player. W systemie Windows 10 Windows Player nie jest już domyślnym odtwarzaczem plików multimedialnych i został zastąpiony przez aplikację „Filmy i TV”. </p> <p> Ten artykuł jest przeznaczony dla wszystkich użytkowników, którzy chcą znaleźć i używać klasycznego programu Windows Media Player jako domyślnego odtwarzacza do odtwarzania muzyki i filmów. </p> <h4> Jak znaleźć Windows Media Player w Windows 10. </h4> <p> Najszybszym sposobem sprawdzenia, czy na komputerze jest zainstalowany program Windows Media Player, jest jego przeszukanie. Aby to zrobić: </p> <p> 1. W polu wyszukiwania Cortany wpisz <strong> Windows Media Player </strong> . <br> 2. Jeśli w wynikach wyszukiwania znajduje się odtwarzacz Windows Media, kliknij go, aby uruchomić program. (Jeśli nie ma na liście, kontynuuj poniżej…) </p> <p><img src=\"images/image_thumb-66-377.png\" alt=\"How to Find Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> WSKAZÓWKA: </strong> Aby ustawić Windows Media Player jako domyślny odtwarzacz filmów i muzyki: </p> <blockquote><p> 1. Przejdź do <strong> Początek </strong> -&gt; <strong> Ustawienia </strong> -&gt; <strong> Aplikacje </strong> i wybierz <strong> Aplikacje domyślne </strong> po lewej. <br> 2. W <strong> Odtwarzacz muzyki </strong> opcje, kliknij <strong> Muzyka Groove </strong> a następnie wybierz <strong> Odtwarzacz multimedialny Windows </strong> . <br> 3. <strong> W opcjach odtwarzacza wideo </strong> , Kliknij <strong> Filmy i telewizja </strong> a następnie wybierz <strong> Odtwarzacz multimedialny Windows </strong> . </p> <p><img src=\"images/image_thumb-72-358.png\" alt=\"set windows media player default widnows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h4> Jak zainstalować odtwarzacz Windows Media w systemie Windows 10 Home, Pro. </h4> <p> Jeśli Windows Media Player nie znajduje się na liście, możesz go zainstalować, przechodząc do: </p> <p> 1. <strong> Panel sterowania </strong> -&gt; <strong> Programy i funkcje </strong> . <br> 2. Kliknij <strong> Włącz lub wyłącz funkcje systemu Windows </strong> z lewej. </p> <p><img src=\"images/image_thumb-68-342.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. W <strong> Funkcje multimedialne </strong> , Wybierz <strong> Windows Media Player </strong> i naciśnij <strong> dobrze </strong> . * </p> <p> * Uwaga: jeśli posiadasz wersję Windows 10 N lub KN albo nie możesz zainstalować Windows Media Player z „Funkcje Windows”, kontynuuj czytanie poniżej… </p> <p><img src=\"images/image_thumb-69-565.png\" alt=\"How to Install Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Jak pobrać i zainstalować odtwarzacz Windows Media w wersjach Windows 10 Home, Pro, N i KN. </h4> <p> Jeśli nie możesz zainstalować programu Windows Player zgodnie z powyższymi instrukcjami lub jeśli posiadasz system Windows 10 N lub KN, możesz pobrać program Windows Media Player dla systemu Windows 10, postępując zgodnie z poniższymi instrukcjami: </p> <p> 1. Pobierz <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48231\" target=\"_blank\" rel=\"nofollow noopener\"> Pakiet Media Feature Pack dla wersji N i KN systemu Windows 10 </a> . </p> <p> * Uwaga: Pobierz <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package.msu </strong> dla <strong> 32-bitowy system operacyjny, </strong> i <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package_x64.msu </strong> dla <strong> 64-bitowy system operacyjny. </strong></p> <p> 2. Uruchom pobrany plik i kliknij <strong> tak </strong> na pierwszym ekranie. </p> <p><img src=\"images/image_thumb-70-480.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Zaakceptować </strong> Umowę licencyjną, a następnie poczekaj na zakończenie instalacji. </p> <p><img src=\"images/image_thumb-71-400.png\" alt=\"download windows media player windows 10\" loading=\"lazy\"></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}