{"title":"Jak wykonać kopię zapasową plików osobistych z historią plików w systemie Windows 10.","content":"<p> W tym samouczku pokażę, jak skonfigurować system Windows 10, aby automatycznie tworzył kopie i migawki plików za pomocą narzędzia do tworzenia kopii zapasowych historii plików, aby móc je przywrócić (w razie potrzeby) za pomocą „Przywróć poprzednie wersje” funkcja. </p> <p> Jak być może już zauważyłeś, domyślnie system Windows 10 nie przechowuje poprzednich wersji plików lub folderów, tak jak w systemie Windows 7. Dzieje się tak, ponieważ system Windows 10 nie korzysta już z usługi „kopiowania woluminów w tle” do robić migawki plików, ale zamiast tego używa tylko narzędzia do tworzenia kopii zapasowych „Historia plików”. </p> <p> „Historia plików” to doskonałe wbudowane narzędzie do tworzenia kopii zapasowych w systemie Windows 10, które można skonfigurować do wykonywania kopii i migawek plików w innej lokalizacji niż dysk główny (np. na dysk USB, sieć itp.) . * </p> <p> * Uwaga: Jedynym ograniczeniem narzędzia „Historia plików” jest to, że nie pozwala wybrać dysku C: jako alternatywnego miejsca docelowego kopii zapasowej. jeśli nie masz dodatkowego dysku dostępnego do tworzenia kopii zapasowej, kontynuuj czytanie tego samouczka, aby dowiedzieć się, jak ominąć to ograniczenie… </p> <ul> <li><strong> Powiązany artykuł: </strong> <a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak tworzyć kopie w tle plików za pomocą Harmonogramu zadań w systemie Windows 10. </a></li> </ul> <h4> Jak wykonać kopię zapasową plików osobistych za pomocą narzędzia do tworzenia kopii zapasowych historii plików w systemie Windows 10. </h4> <p> 1. Jak wspomniałem powyżej, aby wykonać kopię zapasową plików za pomocą narzędzia do tworzenia kopii zapasowych historii plików, musisz mieć dostępny dysk pamięci podłączony do komputera (np. dysk USB) lub lokalizację sieciową (np. inny komputer w sieci lub urządzenie pamięci masowej NAS). * </p> <p> * Uwaga: jeśli nie masz alternatywnego urządzenia pamięci masowej, masz następujące możliwości: </p> <blockquote><p> A. To <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> zmniejsz rozmiar dysku głównego C:\\ </a> oraz z dostępną wolną przestrzenią na utworzenie nowego dysku do przechowywania kopii zapasowej lub… </p> <p> B. Aby przechowywać kopię zapasową na głównym dysku C:\\. W takim przypadku utwórz nowy folder na dysku C: i nazwij go „Historia pliku” (lub cokolwiek chcesz) i kontynuuj poniżej… </p></blockquote> <p> 2. Przejdź do Windows <strong> Panel sterowania </strong> i pod <strong> System i bezpieczeństwo, </strong> Kliknij <strong> Zapisz kopię zapasową </strong><strong> kopie plików z Historią plików. </strong></p> <p><img src=\"images/image_thumb-42-924.png\" alt=\"How to Backup & Keep Previous Versions of Files in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 3. Teraz, zgodnie ze swoim przypadkiem, wykonaj następujące czynności: </p> <ul> <li><strong> Przypadek A. </strong> Jeśli posiadasz dostępny dysk do tworzenia kopii zapasowej, to: </li> </ul> <blockquote><p> za. Kliknij <strong> Włączyć </strong> na ekranie, aby włączyć „Historię plików”. <br> b. Kontynuuj <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> krok 4 </a> poniżej, aby skonfigurować ustawienia kopii zapasowej „Historia plików”. </p></blockquote> <p><img src=\"images/image_thumb-44-788.png\" alt=\"Turn On File History Windows 10\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Przypadek B: </strong> Jeśli nie masz dostępnego dysku dla kopii zapasowej historii plików lub chcesz przechowywać kopię zapasową w sieci, to: </li> </ul> <blockquote><p> za. Kliknij <strong> Wybierz lokalizację sieciową. </strong></p></blockquote> <p><img src=\"images/image_thumb-56-796.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Na następnym ekranie: </p> <p> 1. Jeśli chcesz zapisać kopię zapasową w sieci, wpisz pełną ścieżkę sieciową lokalizacji przechowywania kopii zapasowych i kliknij <strong> Wybierz katalog </strong> . </p> <p> 2.  Jeśli chcesz zapisać kopię zapasową na dysku głównym C:\\, wpisz pełną ścieżkę sieciową do lokalnego folderu kopii zapasowej na dysku C:\\ w tym formularzu: * </p> <ul> <li> <strong> \\\\Nazwa komputera\\C$\\Historia pliku </strong></li> </ul> <p> * Uwagi: <br> 1. Zastąp wartość „Nazwa komputera” nazwą swojego komputera. (Aby znaleźć nazwę komputera, kliknij prawym przyciskiem myszy ikonę „Ten komputer” w Eksploratorze Windows). <br> 2. Pamiętaj, że zapisywanie kopii zapasowej plików osobistych na tym samym dysku, na którym zostały już zapisane <strong> nie jest niezawodnym rozwiązaniem </strong> . Aby być bezpiecznym, zawsze przechowuj kopię zapasową na innym urządzeniu pamięci masowej. </p></blockquote> <p> np.: jeśli nazwa komputera to „Pegasus”, wpisz: „\\\\Pegasus\\C$\\FileHistory” </p> <p><img src=\"images/image_thumb-53-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> do. Na następnym ekranie kliknij <strong> dobrze </strong> . </p></blockquote> <p><img src=\"images/image_thumb-54-349.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> re. Teraz kliknij <strong> Włączyć </strong> , aby włączyć narzędzie do tworzenia kopii zapasowych historii plików, a następnie kontynuuj poniżej, aby skonfigurować ustawienia kopii zapasowej. </p></blockquote> <p><img src=\"images/image_thumb-48-620.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Aby skonfigurować opcje tworzenia kopii zapasowej „Historia plików”, kliknij <strong> Zaawansowane ustawienia </strong> po lewej. </p> <p><img src=\"images/image_thumb-49-919.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4a. Następnie w <strong> Zaawansowane ustawienia </strong> opcje, ustaw częstotliwość tworzenia kopii zapasowych plików i czas przechowywania zapisanych wersji. Po zakończeniu kliknij <strong> Zapisz zmiany </strong> . </p> <p><img src=\"images/image_thumb-61-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Na koniec kliknij <strong> Biegnij teraz </strong> zrobić pierwszą kopię zapasową. * </p> <p><img src=\"images/image_thumb-55-463.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Dodatkowa pomoc – uwagi: <br> 1. Domyślnie „Historia plików” tworzy kopię zapasową folderów „Biblioteki” (Pulpit, Dokumenty, Ulubione, Muzyka, OneDrive, Obrazy i wideo). Jeśli chcesz wykluczyć jeden z tych folderów z kopii zapasowej, dołączyć inne foldery lub przejrzeć wszystkie opcje tworzenia kopii zapasowej historii plików, przejdź do: </p> <ul> <li> <p><strong> Ustawienia <img src=\"images/image_thumb-58-467.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Aktualizacja i bezpieczeństwo </strong> &gt; <strong> Utworzyć kopię zapasową </strong> &gt; <strong> Więcej opcji. </strong></p> </li> </ul> <p><img src=\"images/image_thumb-57-938.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Aby przywrócić pliki z kopii zapasowej „Historia plików”, przejdź do jednej z następujących lokalizacji: </p> <ul> <li><strong> Panel sterowania </strong> &gt; <strong> Historia pliku </strong> &gt; <strong> Przywróć pliki osobiste. </strong></li> <li><strong> Ustawienia <img src=\"images/image_thumb-59-275.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Aktualizacja i bezpieczeństwo </strong> &gt; <strong> Utworzyć kopię zapasową </strong> &gt; <strong> Więcej opcji </strong> &gt; <strong> Przywróć pliki z bieżącej kopii zapasowej. </strong></li> </ul> <p> 3. Aby selektywnie przywrócić plik lub folder do jego poprzedniej wersji, kliknij prawym przyciskiem plik (lub folder) i wybierz <strong> Przywróć poprzednie wersje </strong> . </p> <p><img src=\"images/image_thumb-60-867.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> To wszystko! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}