{"title":"JAK: Usunąć historię internetową, hasła i pliki cookie z przeglądarki internetowej (Chrome, Firefox, IE)","content":"<p> Kiedy odwiedzasz witrynę internetową za pomocą przeglądarki internetowej, witryna wysyła pewne informacje do przeglądarki, a przeglądarka przechowuje te informacje w małych plikach tekstowych zwanych <strong> ciastko </strong> s. Cookies przechowują preferencje użytkownika dotyczące tej witryny, m.in. dane logowania, dzięki czemu użytkownik nie musi ponownie wprowadzać danych logowania (nazwy użytkownika i/lub hasła) po powrocie na tę samą stronę. Pliki cookie mogą również przechowywać historię tego, jakie strony witryny odwiedził użytkownik, dzięki czemu użytkownik nie musi ich zapamiętywać ani nawigować po wszystkich stronach witryny, dopóki nie znajdzie tego, czego chce. </p> <p> Jednocześnie, gdy odwiedzasz witrynę, przeglądarka przechowuje lokalną kopię wszystkich odwiedzonych stron internetowych, aby zaoszczędzić przepustowość połączenia i skrócić czas ładowania stron internetowych przy następnej wizycie. Ta „lokalna kopia stron internetowych” jest znana jako „ <strong> Tymczasowe pliki internetowe </strong> &quot; z <strong> Pamięć podręczna </strong> . </p> <p> Pliki cookie i pamięć podręczna po pewnym czasie mogą pomieścić znaczną ilość miejsca na dysku i istnieje konieczność ich wyczyszczenia. W innych przypadkach może być konieczne usunięcie pamięci podręcznej przeglądarki i plików cookie w celu całkowitego przeładowania zawartości strony internetowej lub ze względów bezpieczeństwa i prywatności: np. jeśli nie chcesz, trzecia osoba, aby dowiedzieć się, które strony internetowe odwiedziłeś (aka: &quot; <strong> Historia przeglądania </strong> &quot;) lub które są Twoimi danymi logowania do serwisu (np. GMAIL). </p> <p> W tym samouczku znajdziesz dwa (2) proste sposoby usunięcia historii przeglądania, tymczasowych plików internetowych (pamięci podręcznej) i plików cookie z przeglądarki Internet Explorer, Chrome i Firefox. </p> <h4> Jak wyczyścić historię przeglądania sieci, zapisane hasła i pliki cookie w przeglądarkach Chrome, Firefox i Internet Explorer. </h4> <h5><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda 1. Wyczyść dane przeglądania z określonej przeglądarki. </a></h5> <h5><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda 2. Usuń dane przeglądania ze wszystkich przeglądarek internetowych jednym kliknięciem! </a></h5> <p> </p> <h5> Metoda 1. Usuń historię, pamięć podręczną i pliki cookie z określonej przeglądarki. </h5> <p> Ogólnie rzecz biorąc, każda przeglądarka internetowa ma opcje usuwania zapisanych danych przeglądania za pomocą menu Ustawienia / Opcje, ale jeśli chcesz łatwo uzyskać dostęp do tych opcji (bez konieczności poruszania się myszą po menu przeglądarki), naciśnij <strong> Ctrl </strong> + <strong> Zmiana </strong> + <strong> Kasować </strong> klawisze razem w otwartym oknie przeglądarki. Więc… </p> <p><strong> Aby usunąć historię przeglądania, pamięć podręczną i pliki cookie z Internet Explorera: </strong></p> <p> 1. Otwórz Internet Explorer i naciśnij <strong> Ctrl </strong> + <strong> Zmiana </strong> + <strong> Kasować. <br> </strong> 2. Wybierz rodzaj informacji, które chcesz usunąć i kliknij <strong> Kasować </strong> przycisk. </p> <p><img src=\"images/image_thumb-18-750.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> Aby usunąć historię przeglądania, pamięć podręczną i pliki cookie z Chrome: </strong></p> <p> 1. Uruchom Chrome i naciśnij <strong> Ctrl </strong> + <strong> Zmiana </strong> + <strong> Kasować. <br> </strong> 2. Wybierz rodzaj informacji, które chcesz usunąć, a następnie naciśnij <strong> WYCZYŚĆ DANE </strong> . </p> <p><img src=\"images/image_thumb-19-667.png\" alt=\"clear chrome history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p><strong> Aby usunąć historię przeglądania, pamięć podręczną i pliki cookie z Firefoksa: </strong></p> <p> 1. Otwórz Firefox i jednocześnie naciśnij <strong> Ctrl </strong> + <strong> Zmiana </strong> + <strong> Kasować. <br> </strong> 2. Wybierz dane, które chcesz usunąć z Firefoksa i kliknij <strong> Wyczyść teraz. </strong></p> <p> </p> <p><img src=\"images/image_thumb-20-864.png\" alt=\"clear firefox history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> Metoda 2. Usuń historię przeglądarki, pamięć podręczną i pliki cookie ze wszystkich przeglądarek internetowych naraz. </h5> <p> Jeśli chcesz ułatwić sobie życie, możesz skorzystać z <a href=\"https://www.ccleaner.com/\" target=\"_blank\" rel=\"nofollow noopener\"> CCleaner </a> Narzędzie do łatwego usuwania tymczasowych plików internetowych, historii i plików cookie ze wszystkich używanych przeglądarek internetowych za pomocą jednego kliknięcia. </p> <p> 1. <a href=\"https://www.ccleaner.com/ccleaner/download\" target=\"_blank\" rel=\"nofollow noopener\"> Ściągnij </a> i zainstaluj bezpłatną wersję narzędzia CCleaner. </p> <p> 2. Uruchom <strong> CCleaner </strong> i przejdź do <strong> Okna </strong> i <strong> Aplikacje </strong> opcje zakładki, aby wybrać informacje, które chcesz usunąć z przeglądarek internetowych. </p> <p> 3. Po zakończeniu kliknij <strong> Uruchom czystsze </strong> . </p> <p><img src=\"images/image_thumb-21-173.png\" alt=\"clear internet history cache cookies - ccleaner\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> To wszystko! Czy to zadziałało dla Ciebie? </p> <p> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}