{"title":"Jak wyłączyć funkcję Bitlocker w środowisku odzyskiwania systemu Windows (WinRE).","content":"<p> Ten samouczek zawiera instrukcje dotyczące wyłączania ochrony funkcją BitLocker i odszyfrowywania dysku zaszyfrowanego funkcją BitLocker w środowisku odzyskiwania systemu Windows. Instrukcje mogą być przydatne, jeśli komputer jest chroniony funkcją BitLocker i nie akceptuje klucza odzyskiwania funkcji BitLocker ani hasła funkcji BitLocker podczas uruchamiania systemu oraz nie można odblokować dysku chronionego funkcją BitLocker. </p> <p><img src=\"images/image_thumb-52-511.png\" alt=\"Remove Bitlocker from Windows Recovery Environment \" loading=\"lazy\"></p> <h4></h4> <h4> Jak usunąć ochronę funkcją BitLocker i odszyfrować zaszyfrowany dysk funkcją BitLocker w środowisku odzyskiwania systemu Windows (WinRE). </h4> <p><strong> Wymagania: </strong><br> <strong> ZA </strong> . <strong> Nośnik instalacyjny systemu Windows 10 (USB lub DVD). </strong> Jeśli nie posiadasz nośnika instalacyjnego Windows, możesz go utworzyć za pomocą <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Narzędzie do tworzenia multimediów firmy Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak utworzyć nośnik instalacyjny USB systemu Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak utworzyć nośnik instalacyjny DVD z systemem Windows 10. </a></li> </ul> <p><strong> B. Klucz odzyskiwania funkcji BitLocker lub hasło funkcji BitLocker: </strong> Aby wyłączyć ochronę funkcją Bitlocker, musisz mieć hasło Bitlocker lub klucz odzyskiwania funkcji Bitlocker, aby najpierw odblokować dysk, a następnie go odszyfrować. * </p> <p> * Uwaga: jeśli nie masz klucza odzyskiwania funkcji BitLocker, nie ma możliwości ominięcia ochrony funkcją BitLocker. Jeśli dysk jest chroniony funkcją BitLocker i nie masz klucza odzyskiwania funkcji BitLocker ani hasła do odblokowania dysku, jedyną dostępną opcją (w celu ponownego użycia dysku) jest całkowite wymazanie dysku za pomocą instrukcji w tym artykule: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak usunąć ochronę funkcją BitLocker z dysku bez klucza odzyskiwania funkcji BitLocker lub hasła. </a></p> <p> Klucz odzyskiwania funkcji Bitlocker to 48-cyfrowy numer, który można znaleźć w następujących lokalizacjach: </p> <ul> <li> Na wydruku, który zapisałeś, gdy włączyłeś funkcję Bitlocker. </li> <li> Na dysku USB, którego użyłeś, podczas aktywacji funkcji Bitlocker, aby zapisać klucz odzyskiwania funkcji Bitlocker. </li> <li> Na <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Klucze odzyskiwania konta Microsoft </a> , korzystając z konta MS, którego używasz do logowania się do urządzenia, lub dodanego do urządzenia w celu pobierania aplikacji ze sklepu Microsoft Store, aktywacji pakietu MS Office lub poczty e-mail. </li> <li> Na Twoim <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Konto Azure </a> dla komputerów służbowych, które logują się przy użyciu konta Azure Active Directory. </li> </ul> <p> Po znalezieniu klucza odzyskiwania funkcji BitLocker lub hasła ΒitLocker przejdź do odblokowania dysku zaszyfrowanego funkcją BitLocker i usunięcia szyfrowania funkcją BitLocker w WinRE, postępując zgodnie z poniższymi instrukcjami. </p> <p> Aby odblokować i odszyfrować dysk systemu operacyjnego C: z WinRE: </p> <p> 1. Uruchom system z nośnika instalacyjnego Windows 10. <br> 2. Na poniższym ekranie naciśnij <strong> ZMIANA </strong> + <strong> F10 </strong> klawisze, aby uruchomić wiersz polecenia. (lub naciśnij <strong> Kolejny </strong> &gt; <strong> Napraw mój komputer </strong> &gt; <strong> Rozwiązywanie problemów </strong> &gt; <strong> Wiersz polecenia </strong> ). * </p> <p> * Uwaga: Jeśli pojawi się monit o klucz odzyskiwania, kliknij <strong> POMIŃ ten przejazd </strong> . </p> <p><img src=\"images/image_thumb15_thumb-548.png\" alt=\"How to disable-unlock bitlocker from Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. W wierszu polecenia wpisz następujące polecenie, aby wyświetlić literę zaszyfrowanego dysku: </p> <ul> <li><strong> zarządzanie-bde -stan </strong></li> </ul> <p> </p> <p> 4. Następnie przejdź do odblokowania zaszyfrowanego dysku, używając następującego polecenia, zgodnie z Twoim przypadkiem: </p> <p><strong> Przypadek A. </strong> Jeśli znasz klucz odzyskiwania funkcji BitLocker, wydaj to polecenie: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -rp BitLocker-recovery-key​ </strong></li> </ul> <p> * np.: Jeśli chcesz odblokować dysk „D:”, a klucz odzyskiwania bitlockera to: „123456-123456-123456-123456-123456-123456”, wpisz: </p> <ul> <li> <ul> <li> zarządzaj-bde -odblokuj <strong> re </strong> : -rp <strong> 123456-123456-123456-123456-123456-123456 </strong></li> </ul> </li> </ul> <p> </p> <p><strong> Przypadek B. </strong> Jeśli znasz hasło funkcji BitLocker, aby odblokować dysk, wydaj to polecenie: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -pw BitLocker-Password </strong></li> </ul> <p> * np.: Jeśli chcesz odblokować dysk „D:” a hasło funkcji BitLocker to: „123qwerty” wpisz: * </p> <ul> <li> <ul> <li> zarządzaj-bde -odblokuj <strong> re </strong> : -hasło <strong> 123qwerty </strong></li> </ul> </li> </ul> <p> </p> <p> 5. Następnie przejdź do odszyfrowania dysku i wyłącz ochronę BitLocker za pomocą tego polecenia: </p> <ul> <li><strong> management-bde -off drive-letter: </strong></li> </ul> <p> * np.: Jeśli chcesz odszyfrować dysk „D:”, wpisz: </p> <ul> <li> <ul> <li> zarządzaj-bde – wył. <strong> re </strong> : </li> </ul> </li> </ul> <p> 6. Proces deszyfrowania z startem. Aby sprawdzić stan odszyfrowania, wpisz ponownie następujące polecenie i upewnij się, że dysk jest: <strong> W pełni odszyfrowane </strong> i <strong> Odblokowany </strong> : </p> <ul> <li><strong> zarządzanie-bde -stan </strong></li> </ul> <p><img src=\"images/image_thumb9_thumb-678.png\" alt=\"decrypt bitlocker encrypted drive windows removery environment\" loading=\"lazy\"></p> <p> </p> <p> 7. Po zakończeniu wyjmij nośnik instalacyjny systemu Windows i uruchom ponownie komputer. * </p> <p> * Uwaga: Jeśli system Windows nie może się uruchomić, podłącz dysk do innego komputera i wykonaj kopię zapasową danych osobistych na innym nośniku. Następnie <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> zdiagnozować napęd pod kątem problemów </a> a jeśli wszystko jest w porządku, włóż dysk z powrotem do komputera i wykonaj <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> czysta instalacja systemu Windows 10 </a> . </p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym problemie. </p>"}