{"title":"NAPRAW: Błąd aktywacji 0x80072EE7 w systemie Windows 10. (rozwiązany)","content":"<p> Jeśli podczas próby aktywacji systemu Windows 10 pojawi się błąd aktywacji 0x80072EE7, kontynuuj czytanie tego samouczka, aby rozwiązać problem. Błąd aktywacji &quot; <em> Nie możemy aktywować systemu Windows na tym urządzeniu, ponieważ nasze serwery aktywacyjne nie są w tej chwili dostępne. Upewnij się, że masz połączenie z Internetem, a my automatycznie spróbujemy aktywować system Windows, gdy usługa stanie się dostępna” z kodem błędu: 0x80072EE7, </em> zwykle pojawia się z powodu problemów z siecią. </p> <p><img src=\"images/image_thumb-5-942.png\" alt=\"FIX: We can’t activate Windows on this device - Error 0x80072EE7\" loading=\"lazy\"></p> <p> Ten samouczek zawiera instrukcje naprawy błędu aktywacji systemu Windows 10 0x80072EE7: „Nie możemy aktywować systemu Windows na tym urządzeniu, ponieważ nasze serwery aktywacji nie są w tej chwili dostępne”. </p> <h4> Jak rozwiązać błąd aktywacji systemu Windows 10 0x80072EE7? </h4> <h6> Krok 1. Upewnij się, że masz połączenie z Internetem. </h6> <p> Jeśli nie możesz aktywować systemu Windows 10 z powodu błędu 0x80072EE7, przede wszystkim sprawdź połączenie internetowe. Aby to zrobić, otwórz przeglądarkę internetową i odwiedź dowolną witrynę, aby upewnić się, że połączenie internetowe działa. </p> <p> </p> <h6> Krok 2. Użyj prawidłowego klucza produktu dla systemu Windows 10. </h6> <p> Błąd aktywacji systemu Windows 10 0x80072EE7 może pojawić się, jeśli zainstalowany klucz produktu jest nieprawidłowy. Upewnij się więc, że używasz ważnego i legalnego klucza licencyjnego do aktywacji systemu Windows 10. Klucz licencyjny musi odnosić się do zainstalowanej wersji systemu Windows 10 (np. Home lub Pro) i musi być wpisany poprawnie. </p> <p> Aby zmienić klucz produktu Windows 10, przejdź do <strong> Ustawienia </strong> &gt; <strong> Aktualizacja i bezpieczeństwo </strong> &gt; <strong> Aktywacja </strong> i kliknij <strong> Zmień klucz produktu </strong> . </p> <p><img src=\"images/image_thumb-6-424.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Krok 3. Zmień ustawienia DNS </h6> <p> 1. <strong> Kliknij prawym przyciskiem myszy </strong> na <strong> Sieć </strong> Ikona <img src=\"images/image_thumb-42-792.png\" alt=\"image\" loading=\"lazy\"> na pasku zadań i kliknij <strong> Centrum otwartej sieci i udostępniania. </strong> * </p> <p><img src=\"images/image_thumb-104-479.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Wybierz <strong> Ethernet </strong> (lub Wi-Fi) po lewej stronie, a następnie w sekcji „Powiązane ustawienia” kliknij&#39; <strong> Zmień opcje adaptera </strong> . </p> <p><img src=\"images/image_thumb-43-166.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> 3. Kliknij prawym przyciskiem myszy aktywną kartę sieciową (Ethernet lub Wi-Fi) i wybierz <strong> Nieruchomości </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-44-500.png\" alt=\"network properties\" loading=\"lazy\"></p> <p> 4. Wybierz <strong> „Protokół internetowy w wersji 4 (TCP/IPv4) </strong> &#39; i kliknij <strong> Nieruchomości </strong></p> <p><img src=\"images/image_thumb-106-472.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> 5. We właściwościach protokołu internetowego w wersji 4 (TCP/IPv4): </p> <blockquote><p> za. <strong> Czek </strong> <strong> Użyj następujących adresów serwerów DNS: </strong> Przycisk radiowy. <br> b. Następnie wpisz następujące adresy serwerów DNS (publiczne serwery DNS firmy Google) i kliknij <strong> DOBRZE. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> </blockquote> <p><img src=\"images/image_thumb-109-991.png\" alt=\"google dns settings\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Uruchom ponownie </strong> Twój komputer. </p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}