{"title":"NAPRAW: Problem z wysokim zużyciem pamięci Chrome (rozwiązany)","content":"<p> Jak być może już zauważyłeś, Google Chrome otwiera wiele procesów w tle, nawet jeśli otworzyłeś tylko kilka okien / kart Chrome. Dzieje się tak, ponieważ Google Chrome został zaprojektowany w taki sposób, aby utworzyć indywidualny proces dla każdej wtyczki lub rozszerzenia instalowanego po otwarciu nowego okna lub karty. </p> <p> Chociaż otwieranie wielu procesów z Google Chrome jest normalnym zachowaniem, w rzeczywistości stanowi problem, ponieważ to zachowanie powoduje duże zużycie pamięci i sprawia, że ​​komputer nie odpowiada. </p> <p><img src=\"images/image_thumb-17-610.png\" alt=\"FIX: Multiple Processes in Chrome with High Memory Usage\" loading=\"lazy\"></p> <p> </p> <p> Ten samouczek zawiera instrukcje krok po kroku, jak uniemożliwić Chrome otwieranie wielu procesów dla każdego okna lub karty, aby rozwiązać problem wysokiego zużycia pamięci w Chrome. </p> <h4> Jak wyłączyć wiele procesów Chrome w systemie Windows 10. </h4> <h6> Krok 1. Przeskanuj komputer w poszukiwaniu złośliwego oprogramowania i wirusów. </h6> <p> Pierwszym krokiem przed rozwiązaniem błędu „ERR_CONNECTION_CLOSED” w Chrome jest upewnienie się, że Twój system jest wolny od wirusów/złośliwego oprogramowania. W tym celu postępuj zgodnie z instrukcjami w tym przewodniku: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak skanować komputer w poszukiwaniu wirusów i innych złośliwych programów. </a></p> <h6></h6> <h6> Krok 2. Wyłącz niechciane rozszerzenia Chrome. </h6> <p> Przede wszystkim sprawdź, czy potrzebujesz wszystkich zainstalowanych rozszerzeń Chrome i wyłącz te, których nie potrzebujesz. Aby to zrobić: </p> <p> 1. Z menu Chrome <img src=\"images/image_thumb-47-380.png\" alt=\"image\" loading=\"lazy\"> , iść do <strong> Więcej narzędzi </strong> -&gt; <strong> Rozszerzenia </strong></p> <p><img src=\"images/image_thumb-51-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Usuń (lub wyłącz) każde rozszerzenie, którego nie potrzebujesz lub którego nie rozpoznajesz. </p> <p><img src=\"images/image_thumb-49-442.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Krok 3. Zapobiegaj uruchamianiu Chrome w tle, gdy Chrome jest zamknięty. </h6> <p> 1. Z menu Chrome <img src=\"images/image_thumb-78-665.png\" alt=\"image\" loading=\"lazy\"> Wybierz <strong> Ustawienia </strong> . </p> <p><img src=\"images/image_thumb-79-868.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> 2. W <strong> Ustawienia </strong> stronę, przewiń w dół i kliknij <strong> zaawansowane </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <p> 3. Ustaw przełącznik „Kontynuuj działanie aplikacji w tle po zamknięciu przeglądarki Google Chrome” na <strong> POZA </strong> . </p> <p><img src=\"images/image_thumb-18-557.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <p> </p> <h6> Krok 4. Zablokuj Chrome otwieranie wielu procesów dla tej samej witryny. </h6> <p> 1, <strong> Kliknij prawym przyciskiem myszy </strong> na <strong> Google Chrome </strong> skrót i wybierz <strong> Nieruchomości </strong> . <br> 2. W <strong> Generał </strong> dodaj przełącznik „ –process-per-site” (bez cudzysłowów), na końcu linii docelowej i kliknij <strong> dobrze </strong> i <strong> Kontyntynuj </strong> zastosować zmianę <strong> . * </strong></p> <p> na przykład „C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe” – proces na witrynę </p> <p> Uwaga: jest spacja przed –proces-per-site </p> <p><img src=\"images/image_thumb-19-818.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Krok 5. Wyłącz izolację witryny Google Chrome. </h6> <p> W trybie izolacji witryny Chrome wczytuje każdą witrynę we własnym procesie. Jest to w rzeczywistości dodatkowa funkcja bezpieczeństwa, która zapobiega kradzieży danych przez witrynę z innej witryny, która jest otwarta na inne okno/kartę. Jednak tryb „Izolacja witryny” zwiększy użycie pamięci Chrome o około 10%. </p> <p> 1. Na pasku adresu Chrome wpisz <a href=\"//flags/#site-isolation-trial-opt-out\" target=\"_blank\" rel=\"nofollow noopener\"> chrome://flagi/#rezygnacja z wersji próbnej izolacji witryny </a> i kliknij enter. </p> <p> 2. Ustaw <strong> Wyłącz izolację witryn </strong> tryb do <strong> Niepełnosprawny </strong> a następnie kliknij <strong> Uruchom ponownie teraz </strong> . * </p> <p> * Uwaga: </p> <p><img src=\"images/image_thumb-20-397.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? </p> <p> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}