{"title":"NAPRAW: Adobe Reader DC – Zapisz jako jest pusty (rozwiązany)","content":"<p> Po automatycznej aktualizacji programu Adobe Reader DC wystąpił następujący problem: Funkcja „Zapisz jako” wyświetla puste (puste) okno (puste), które nie pozwala użytkownikowi na zapisanie dokumentu PDF. </p> <p><img src=\"images/image_thumb-38-290.png\" alt=\"Adobe Reader DC - Save As is blank - fix\" loading=\"lazy\"></p> <p> Ten samouczek zawiera instrukcje dotyczące rozwiązania następującego problemu: Funkcja „Zapisz jako” nie działa w programie Adobe Reader DC w systemie Windows lub MAC OS. </p> <h4> Jak naprawić: Pole Zapisz jako jest puste w programie Adobe Reader DC. </h4> <h6> Metoda 1. Przeskanuj system w poszukiwaniu wirusów i złośliwego oprogramowania. </h6> <p> Pierwszym krokiem do rozwiązania problemu „brakujących folderów” w programie Outlook jest upewnienie się, że system jest wolny od wirusów/złośliwego oprogramowania. W tym celu postępuj zgodnie z instrukcjami w tym przewodniku: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak skanować komputer w poszukiwaniu wirusów i innych złośliwych programów. </a></p> <p> </p> <h6> Metoda 2. Wyłącz Magazyn online podczas zapisywania plików. </h6> <p> 1. Z Adobe Reader DC <strong> Edytować </strong> kliknij menu <strong> Preferencje </strong> . </p> <p><img src=\"images/image_thumb-39-749.png\" alt=\"save as not working fix in Adobe Reader DC\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Odznacz </strong> <strong> Pokaż pamięć online podczas zapisywania plików </strong> i kliknij <strong> DOBRZE. * </strong></p> <p> * Uwaga: opcjonalnie odznacz także opcję „Pokaż pamięć online podczas otwierania plików”. </p> <p><img src=\"images/image_thumb-40-312.png\" alt=\"save as blank - abobe reader DC - fix\" loading=\"lazy\"></p> <p> </p> <p> 3. Teraz spróbuj użyć funkcji Zapisz jako w Adobe DC. Problem musi zostać rozwiązany. </p> <p> </p> <h6> Metoda 3. Odinstaluj i ponownie zainstaluj Adobe Reader DC. </h6> <p> Ostatnią metodą rozwiązania pustych okien w funkcji „Zapisz jako” w programie Adobe DC jest całkowite odinstalowanie programu Adobe Reader DC, a następnie pobranie i ponowne zainstalowanie najnowszej wersji programu z <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> tutaj </a> . </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym. </p>"}