{"title":"NAPRAW: Adobe Acrobat Reader DC jest już zainstalowana nowsza wersja — błąd 1722 (rozwiązany)","content":"<p> Na komputerze z systemem Windows wystąpił następujący problem: Adobe Acrobat Reader DC nie można zainstalować, ponieważ „zainstalowano już nowszą wersję”. Dziwne z tym problemem jest to, że Adobe Reader DC nie został zainstalowany na komputerze, ponieważ nie ma żadnych śladów programu Adobe Reader ani plików ani na Dodaj/Usuń programy, ani na dysku twardym. </p> <p><img src=\"images/image_thumb-19-522.png\" alt=\"Adobe Acrobat Reader DC Newer Version already installed – Error 1722 - fix\" loading=\"lazy\"></p> <p> </p> <p> Dodatkowo, podczas rozwiązywania problemu z instalacją „nowa wersja już zainstalowana” programu Adobe Reader DC, podczas próby zainstalowania programu za pomocą <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Pakiet dystrybucyjny Adobe Acrobat Reader DC </a> : &quot;Błąd 1722. Wystąpił problem z pakietem Instalatora Windows. Program uruchomiony jako część instalacji nie zakończył się zgodnie z oczekiwaniami. Skontaktuj się z personelem pomocy technicznej lub dostawcą pakietu....&quot; </p> <p><img src=\"images/image_thumb-20-398.png\" alt=\"Acrobat reader Error 1722 There is a problem with this Windows Installer package\" loading=\"lazy\"></p> <p> </p> <p> Ten samouczek zawiera szczegółowe kroki i instrukcje rozwiązywania następujących błędów podczas instalacji programu Adobe Reader DC: „Nowa wersja już zainstalowana” i „Błąd 1722. Wystąpił problem z tym pakietem Instalatora Windows” w systemie Windows 10/8/7. </p> <h4> Jak naprawić problemy z instalacją programu Adobe Acrobat Reader DC: Zainstalowano już nowszą wersję – Błąd 1722 Problem z pakietem instalatora. </h4> <h6> Metoda 1. Usuń produkty Adobe Acrobat za pomocą narzędzia Acrobat Cleaner. </h6> <p> Pierwszym krokiem do rozwiązania problemów z instalacją programu Adobe Reader DC jest usunięcie wszystkich poprzednich instalacji programów Adobe Acrobat i Adobe Reader za pomocą <a href=\"https://labs.adobe.com/downloads/acrobatcleaner.html\" target=\"_blank\" rel=\"nofollow noopener\"> Program narzędziowy Acrobat Reader DC i Adobe Acrobat DC Cleanup </a> * a następnie zainstalować <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> Adobe Reader DC </a> . </p> <p> * Adobe Reader i Acrobat Cleaner Tool są przeznaczone do czyszczenia uszkodzonych instalacji Adobe Acrobat i Adobe Reader, w tym usuwania lub naprawiania uszkodzonych plików, usuwania lub zmieniania wpisów rejestru uprawnień itp. </p> <p><img src=\"images/image_thumb-21-370.png\" alt=\"Acrobat Reader DC & Adobe Acrobat DC Cleanup tool\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Metoda 2. Uruchom narzędzie do rozwiązywania problemów z instalacją i dezinstalacją programów firmy Microsoft. </h6> <p> 1. Pobierz <a href=\"https://support.microsoft.com/en-us/help/17588/fix-problems-that-block-programs-from-being-installed-or-removed\" target=\"_blank\" rel=\"nofollow noopener\"> Narzędzie do rozwiązywania problemów z instalacją i dezinstalacją programu </a> od firmy Microsoft. <br> 2. Uruchom pobrany program i kliknij Dalej na pierwszym ekranie. <br> 3. Po wyświetleniu monitu kliknij <strong> Odinstalowywanie </strong></p> <p><img src=\"images/image_thumb-22-965.png\" alt=\"Program Install & Uninstall Troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 4. Wybierz <strong> Adobe Acrobat Reader DC </strong> program i wybierz <strong> Kolejny </strong> .* Następnie postępuj zgodnie z instrukcjami wyświetlanymi na ekranie, aby rozwiązać problem. </p> <p> * Uwaga: Jeśli nie widzisz na liście „Adobe Acrobat Reader DC”, kliknij <strong> Anuluj </strong> i ponownie uruchom narzędzie do rozwiązywania problemów. Ale tym razem po wyświetleniu monitu wybierz „Instalowanie”. </p> <p><img src=\"images/image_thumb-23-917.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Metoda 3. Zainstaluj program Adobe Reader, korzystając z pełnego pakietu instalacyjnego programu Acrobat Reader DC. </h6> <p> Spróbuj zainstalować Adobe Reader DC, używając <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Pakiet dystrybucyjny Adobe Acrobat Reader DC </a> . </p> <p> </p> <h6> Metoda 4. Uruchom usługę Instalator Windows. </h6> <p> 1. Otwórz panel sterowania Windows Services: Aby to zrobić: </p> <ul> <li> Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-698.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. </li> <li> W polu wyszukiwania wpisz: <strong> services.msc </strong> &amp; Kliknij <strong> dobrze </strong> . </li> <li> (Zaakceptuj ostrzeżenie UAC, jeśli się pojawi). </li> </ul> <p><img src=\"images/image_thumb-12-635.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. W panelu sterowania usługami kliknij prawym przyciskiem myszy na <strong> Instalator Windows </strong> serwis i kliknij <strong> Początek </strong> . * </p> <p> * Uwaga: Jeśli usługa jest uruchomiona, kliknij <strong> Uruchom ponownie </strong> . </p> <p><img src=\"images/image_thumb-24-258.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Metoda 5. Ponownie zarejestruj usługę Instalator Windows. </h6> <p> 1. Otwórz <strong> Wiersz polecenia jako administrator. <br> </strong> 2. Wpisz kolejno następujące polecenia (po wpisaniu każdego polecenia naciśnij Enter) </p> <ul> <li><strong> msiexec / wyrejestruj </strong></li> <li><strong> msiexec /regserver </strong></li> </ul> <p><img src=\"images/image_thumb-25-162.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Zamknij okno wiersza polecenia i <strong> uruchom ponownie </strong> Twój komputer. <br> 4. Spróbuj zainstalować Acrobat Reader DC. </p> <p> </p> <h6> Metoda 6. Zainstaluj aktualizacje systemu Windows i program Visual C++. </h6> <p> 1. Zainstaluj wszystkie dostępne aktualizacje systemu Windows. <br> 2. Zainstaluj obie wersje x86 i x64 <a href=\"https://www.microsoft.com/en-in/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Pakiety redystrybucyjne Visual C++ dla Visual Studio 2013 </a><br> 3. Zainstaluj obie wersje x86 i x64 <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48145\" target=\"_blank\" rel=\"nofollow noopener\"> Pakiety redystrybucyjne Visual C++ dla Visual Studio 2015 </a><br> 4. Spróbuj zainstalować Acrobat Reader DC. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}