{"title":"NAPRAW: Dyski wyświetlane dwukrotnie w okienku nawigacji systemu Windows 10 (rozwiązane)","content":"<p> W tym samouczku znajdziesz instrukcje rozwiązania następującego dziwnego problemu w systemie Windows 10: Dyski wyświetlane dwukrotnie w okienku nawigacji. Zduplikowany wygląd dysków w okienku nawigacji to nowa funkcja systemu Windows 10, która pomaga użytkownikowi łatwo przeglądać zawartość podłączony dysk, bez konieczności rozwijania menu „Ten komputer&quot;. Ta funkcja staje się jednak irytująca, ponieważ jeśli użyjesz do pozostawienia otwartego menu „Ten komputer&quot;, ten sam dysk zostanie wyświetlony dwukrotnie w okienku nawigacji. </p> <p><img src=\"images/image_thumb-22-749.png\" alt=\"Drives Displayed Twice in Navigation Pane of Windows 10\" loading=\"lazy\"></p> <p> Jeśli widzisz zduplikowane wpisy podłączonych dysków USB lub dysków stałych w systemie Windows 10, postępuj zgodnie z poniższymi instrukcjami, aby rozwiązać problem. </p> <h4> Jak usunąć zduplikowane litery dysków w Eksploratorze Windows 10 (menu nawigacyjne). </h4> <p> Aby zapobiec dwukrotnemu wyświetlaniu podłączonego lub stałego dysku w systemie Windows 10, zastosuj następującą poprawkę rejestru: </p> <p> 1. Otwórz Edytor rejestru. aby to zrobić: </p> <blockquote><p> 1. Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-493.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. W polu wyszukiwania wpisz <strong> regedit </strong> i naciśnij <strong> Wchodzić </strong> aby uruchomić Edytor rejestru. </p></blockquote> <p><img src=\"images/image_thumb7-138.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Następnie przejdź do tego klucza rejestru: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Desktop\\NameSpace\\DelegateFolders </li> </ul> <p> 3. Następnie kliknij prawym przyciskiem myszy i usuń <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> klucz. </p> <p><img src=\"images/image_thumb-23-428.png\" alt=\"remove duplicate drive entries windows 10 navigation pane\" loading=\"lazy\"></p> <p> </p> <p> 4. Następnie przejdź do tego klucza: * </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Desktop\\NameSpace\\DelegateFolders </li> </ul> <p> 5. Usuń <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> klucz. </p> <p> 6. Zamknij Edytor rejestru. </p> <p> * Uwaga: jeśli nie widzisz klucza „WOW6432Node”, zignoruj ​​powyższe kroki 4 i 5, ponieważ dotyczą one tylko 64-bitowych wersji systemu Windows 10. </p> <p><strong> WSKAZÓWKA: </strong> Jeśli zmienisz swoją decyzję w przyszłości, po prostu kliknij prawym przyciskiem myszy „DelegateFolders” w powyższych lokalizacjach rejestru, wybierz <strong> Nowy </strong> -&gt; <strong> Klucz </strong> i odtwórz usunięte <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> Klucze). </p> <p> To wszystko! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}