{"title":"NAPRAW: Podłączanie pulpitu zdalnego nie może się połączyć, ponieważ trwa już sesja konsoli (rozwiązano).","content":"<p> Komunikat o błędzie dotyczący Podłączania pulpitu zdalnego „Twój komputer nie może połączyć się z inną sesją konsoli na komputerze zdalnym, ponieważ trwa już sesja konsoli”, pojawia się, ponieważ komputer lokalny i zdalny mają ten sam adres IP. Problem zwykle występuje, gdy próbujesz połączyć się zdalnie z innym komputerem za pośrednictwem połączenia VPN, a „otrzymałeś” ten sam adres IP z routera lokalnego, co komputer zdalny. Aby rozwiązać problem, postępuj zgodnie z poniższymi instrukcjami. </p> <p> </p> <p><img src=\"images/image_thumb-7-243.png\" alt=\"Remote Desktop Connection Could Not Connect because already have a console session in progress\" loading=\"lazy\"></p> <h4> Jak naprawić błąd RDP: Pulpit zdalny nie mógł połączyć się z inną sesją konsoli, ponieważ trwa już sesja konsoli. </h4> <p> Problem w Podłączaniu pulpitu zdalnego „Nie można połączyć się z inną sesją konsoli, ponieważ masz już sesję konsoli w toku” często występuje, gdy komputer lokalny otrzymuje losowo (z serwera DHCP) ten sam adres IP, co adres IP zdalnego komputer, z którym chcesz się połączyć za pośrednictwem protokołu RDP. </p> <p> Jedynym sposobem rozwiązania powyższego problemu jest wyłączenie automatycznego przypisywania adresu IP z serwera DHCP na komputerze lokalnym i ręczne określenie adresu IP. Aby to zrobić: </p> <p> 1. <strong> Kliknij prawym przyciskiem myszy </strong> na <strong> Sieć </strong> Ikona <img src=\"images/image_thumb-42-527.png\" alt=\"image\" loading=\"lazy\"> na pasku zadań i kliknij <strong> Centrum otwartej sieci i udostępniania. </strong> * </p> <p><img src=\"images/image_thumb-104-485.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Wybierz <strong> Ethernet </strong> (lub Wi-Fi) po lewej stronie, a następnie w sekcji „Powiązane ustawienia” kliknij&#39; <strong> Zmień opcje adaptera </strong> . </p> <p><img src=\"images/image_thumb-43-117.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Podwójne kliknięcie </strong> na aktywnej karcie sieciowej (Ethernet lub Wi-Fi) i kliknij <strong> Detale </strong> . </p> <p><img src=\"images/image_thumb-8-177.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Zanotuj szczegóły adresu IP w następujących polach, a następnie kliknij <strong> Blisko </strong> : </p> <ul> <li> Adres IPv4 </li> <li> Maska podsieci IPv4 </li> <li> Brama domyślna IPv4 </li> <li> Serwer DNS IPv4 </li> </ul> <p><img src=\"images/image_thumb-9-793.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Teraz kliknij <strong> Nieruchomości </strong> . </p> <p><img src=\"images/image_thumb-10-628.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Wybierz <strong> „Protokół internetowy w wersji 4 (TCP/IPv4) </strong> &#39; i kliknij <strong> Nieruchomości </strong></p> <p><img src=\"images/image_thumb-106-954.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 7. We właściwościach protokołu internetowego w wersji 4 (TCP/IPv4) zastosuj następujące ustawienia: </p> <p> A. Wybierz <strong> Użyj następującego adresu IP: </strong></p> <blockquote><p> 1. W polu Adres IP wpisz a <strong> inny adres IP niż adres IP, który zauważyłeś wcześniej </strong> . (Zmień tylko ostatnią liczbę na wyższą wartość). <br> 2. W polu Maska podsieci wpisz ten sam adres IP podsieci, który zauważyłeś wcześniej. <br> 3. W Default Gateway wpisz tę samą domyślną bramę, którą zauważyłeś wcześniej. </p></blockquote> <p> B. Wybierz <strong> Użyj następujących adresów serwerów DNS </strong> : </p> <blockquote><p> 1. W polu Preferowany serwer DNS wpisz adres DNS, który zauważyłeś wcześniej. </p></blockquote> <p> C. Po zakończeniu kliknij <strong> dobrze </strong> dwa razy i <strong> Blisko </strong> aby zamknąć właściwości adaptera. </p> <blockquote> <p><img src=\"images/image_thumb-11-850.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 8. Teraz spróbuj połączyć się z komputerem Pulpitu zdalnego. Problem powinien zostać rozwiązany. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}