{"title":"NAPRAW: Touchpad nie działa lub zawiesza się w systemie Windows 10 (rozwiązany)","content":"<p> W ciągu ostatnich lat rozwiązałem wiele problemów z touchpadem w systemie Windows 10 na kilku laptopach (np. touchpad nie działa, touchpad zawiesza się itp.), więc postanowiłem napisać samouczek, aby rozwiązać te problemy. </p> <p> Jeśli posiadasz laptopa, od czasu do czasu możesz mieć problemy z urządzeniem touchpad. Zwłaszcza jeśli masz system Windows 10, touchpad często może przestać działać lub nie działać poprawnie po zainstalowaniu aktualizacji. Oczywiście problemy z touchpadem mogą wskazywać na problem sprzętowy, ale w wielu przypadkach awarie touchpada są spowodowane problemami z oprogramowaniem. </p> <p> W systemie Windows 10 touchpad laptopa może nie działać z różnych powodów, więc w tym samouczku zostaną omówione wszystkie metody rozwiązania problemu. </p> <h2> Jak naprawić problemy z touchpadem w systemie Windows 10. </h2> <p> Wykonaj poniższe czynności przed kontynuowaniem następujących metod rozwiązywania problemów z ekranem dotykowym. </p> <ol> <li> Upewnij się, że system Windows 10 nie jest zamrożony, naciskając ALT + CTRL + DEL i sprawdź, czy otworzy się Menedżer zadań. </li> <li> Jeśli twój laptop ma kombinację klawiszy funkcyjnych do wyłączania i włączania touchpada. (np. Fn + F3), a następnie naciśnij kombinację klawiszy Fn, aby włączyć touchpad. (W niektórych laptopach touchpad można włączyć / wyłączyć, dwukrotnie dotykając powierzchni touchpada) </li> <li> Zrestartuj swój komputer. </li> <li> Wykonaj pełne zamknięcie systemu Windows 10, a następnie ponownie włącz laptopa. (Aby wykonać pełne wyłączenie: naciśnij i przytrzymaj <strong> ZMIANA </strong> klucz, a następnie kliknij <strong> Początek </strong> &gt; <strong> Moc </strong> &gt; <strong> Zamknąć </strong> ). </li> </ol> <p><strong> </strong></p> <h3> Metoda 1. Włącz touchpad w systemie Windows 10. </h3> <p> Windows 10 ma możliwość wyłączenia lub wyłączenia touchpada, gdy podłączona jest mysz zewnętrzna. Więc kontynuuj i upewnij się, że Touchpad jest włączony w ustawieniach Touchpada. </p> <p> 1. Przejdź do <strong> Początek </strong><img src=\"images/image_thumb2_thumb_thumb-670.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menu -&gt; <strong> Ustawienia </strong> <img src=\"images/image_thumb-66-512.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Urządzenia. <br> </strong> 2. Wybierz <strong> Panel dotykowy </strong> na lewym panelu, a po prawej upewnij się, że przełącznik Touchpad jest ustawiony na <strong> NA </strong> i również <strong> czek </strong> <strong> Pozostaw włączony touchpad, gdy mysz jest podłączona </strong> opcja. * </p> <p><img src=\"images/image_thumb-38-467.png\" alt=\"Disable Touchpad Windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Uwaga: jeśli nie możesz znaleźć tutaj przełącznika/przełącznika touchpada… </p> <p> 1. Otwórz <strong> Dodatkowe ustawienia </strong> pod <strong> Powiązane ustawienia </strong> Sekcja. </p> <ul> <li> Powiązany artykuł: <a href=\"https://www.repairwin.com/disable-touchpad-option-missing-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Wyłącz brak opcji touchpada w systemie Windows 10. </strong></a></li> </ul> <p><img src=\"images/image_thumb-39-742.png\" alt=\"touchpad additional settings\" loading=\"lazy\"></p> <p> 2. Włącz touchpad w opcjach Właściwości myszy. (Jeśli touchpad jest już włączony, spróbuj go wyłączyć i włączyć ponownie). </p> <p><img src=\"images/image_thumb-31-122.png\" alt=\"enable touchpad windows 10\" loading=\"lazy\"></p> <h3> Metoda 2. Zresetuj ustawienia touchpada w systemie Windows 10. </h3> <p> Powszechną metodą rozwiązywania problemów z touchpadem w systemie Windows 10 jest przywrócenie domyślnych ustawień touchpada. </p> <p> 1. Przejdź do <strong> Początek </strong><img src=\"images/image_thumb2_thumb_thumb-596.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menu -&gt; <strong> Ustawienia </strong> <img src=\"images/image_thumb-66-851.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Urządzenia. <br> </strong> 2. W <strong> Panel dotykowy </strong> opcje <strong> , </strong> przewiń w dół i kliknij <strong> Resetowanie </strong> pod <strong> Zresetuj touchpad. * </strong></p> <p><img src=\"images/image_thumb-40-277.png\" alt=\"reset touchpad windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Uwaga: jeśli nie widzisz <strong> Resetowanie </strong> przycisk… </p> <p> 1. Otwórz <strong> Dodatkowe ustawienia </strong> . <br> 2. Kliknij <strong> Zresetuj urządzenia </strong> w opcjach Właściwości myszy. </p> <p><img src=\"images/image_thumb-33-928.png\" alt=\"reset touchpad settings windows 10\" loading=\"lazy\"></p> <h3> Metoda 3. Odinstaluj i ponownie zainstaluj sterownik urządzenia Touchpad. </h3> <p> Innym rozwiązaniem problemów z touchpadem w systemie Windows 10 jest całkowite odinstalowanie i ponowna instalacja sterowników touchpada. </p> <p> 1. Otwórz <strong> Menadżer urządzeń </strong> . Aby to zrobić: </p> <blockquote><p> 1. Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-140.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. W polu „Otwórz” wpisz: <strong> devmgmt.msc </strong> &amp; Kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-5-568.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Rozwiń Myszy i inne urządzenia wskazujące. <br> 3. <strong> Kliknij prawym przyciskiem myszy </strong> na <strong> Panel dotykowy </strong> urządzenie i kliknij <strong> Odinstaluj. </strong></p> <blockquote> <p><img src=\"images/image_thumb-34-656.png\" alt=\"uninstall touchpad windows 10\" loading=\"lazy\"></p> </blockquote> <p> 4. Po ponownym uruchomieniu odczekaj 4-5 minut, aż system Windows ponownie zainstaluje sterownik touchpada i sprawdź, czy touchpad działa. Jeśli touchpad nie działa ponownie, spróbuj zainstalować jego sterownik ze strony pomocy technicznej producenta laptopa. </p> <h3> Metoda 4. Wyłącz i włącz touchpad w systemie BIOS. * </h3> <p> * Uwaga: ta metoda nie dotyczy wszystkich modeli laptopów, ale wiem, że działa na wielu laptopach ASUS. </p> <p> 1. Całkowicie wyłącz laptopa, naciskając i przytrzymując klawisz SHIFT podczas klikania <strong> Początek </strong> &gt; <strong> Moc </strong> &gt; <strong> Zamknąć </strong><br> 2. Włącz laptopa i naciśnij odpowiedni klawisz funkcyjny, aby wejść do ustawień BIOS. (np. F2, F10 itd.), <br> 3. W ustawieniach systemu BIOS sprawdź, czy istnieje ustawienie dla touchpada, wewnętrznego urządzenia wskazującego lub gładzika (zazwyczaj to ustawienie można znaleźć w &#39; <strong> zaawansowane </strong> &#39; Sekcja). W takim razie, <strong> Wyłączyć </strong> <strong> urządzenie z panelem dotykowym </strong> i <strong> Zapisz i wyjdź </strong> z ustawień BIOS. <br> 4. Niech system Windows 10 się załaduje. <br> 5. Wyłącz i ponownie włącz laptopa. <br> 6. Wejdź ponownie w ustawienia BIOS i ponownie <strong> włącz touchpad </strong> &amp; <strong> Wyjście bezpieczeństwa </strong> . <br> 7. Po uruchomieniu systemu Windows 10 touchpad powinien działać. </p> <p><strong> Wniosek: </strong> Jeśli po wykonaniu powyższych kroków touchpad nadal nie działa, oznacza to problem ze sprzętem. W takim przypadku użyj zewnętrznej myszy lub udaj się do warsztatu naprawy laptopa, aby naprawić urządzenie touchpad. </p> <p> To wszystko ludzie! Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}