{"title":"NAPRAW: Błąd programu Outlook Express 0x800c0133 z powodu limitu rozmiaru 2 GB w pliku DBX (rozwiązany)","content":"<p> Ten samouczek zawiera instrukcje naprawy błędu programu Outlook Express 0x800c0133 z powodu limitu rozmiaru 2 GB. Błąd 0x800c0133 w OE występuje, ponieważ jeden z folderów programu Outlook przekracza limit 2 GB. </p> <p> Opis problemu z limitem rozmiaru .DBX 2GB w programie Outlook Express. <br> Gdy jeden z głównych folderów programu Outlook Express (np. „Skrzynka odbiorcza” lub „Wysłane”) przekracza rozmiar 2 GB, OE zwraca błąd 0x800c0133 podczas operacji wysyłania/odbierania, a czasami odpowiedni folder OE staje się pusty (uszkodzony).* Na przykład, jeśli folder „Skrzynka odbiorcza” (Inbox.dbx) przekracza rozmiar 2 GB, OE nie może odbierać nowych wiadomości e-mail i wyświetla błąd 0x800c0133. </p> <p> * Uwaga: jeśli jeden z folderów OE jest pusty, powiązany plik DBX jest uszkodzony. W takim przypadku spróbuj odzyskać e-maile z uszkodzonego folderu OE, postępując zgodnie z instrukcjami w tym artykule: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak odzyskać plik DBX Outlook Express za DARMO </a> . </p> <h4> Jak naprawić problem z limitem 2 GB w programie Outlook Express (błąd wysyłania/odbierania 0x800c0133). </h4> <h6> Krok 1. Włącz widok ukrytych plików. </h6> <p> 1. Otwórz Eksploratora Windows. <br> 2. Od <strong> Przybory </strong> wybierz menu <strong> Opcje folderu </strong> . <br> 3. Na karcie Widok kliknij <strong> Pokaż ukryte pliki i foldery </strong> i kliknij <strong> DOBRZE. </strong></p> <p><img src=\"images/image_thumb1_thumb-210.png\" alt=\"image_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Krok 2. Zlokalizuj plik DBX programu Outlook Express 2GB na dysku. </h6> <p> 1. Otwórz folder sklepu Outlook Express. Zwykle ten folder znajduje się w następującej ścieżce na dysku: </p> <ul> <li> C:\\Documents and Settings\\\\Ustawienia lokalne\\Dane aplikacji\\Identities\\{}\\Microsoft\\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> na przykład „C:\\Documents and Settings\\Admin\\Ustawienia lokalne\\Dane aplikacji\\Tożsamości\\{D8F3C56D-965E-41AE-8A23-A58460ABAE00}\\Microsoft\\ <strong> Outlook Express </strong> ” </p></blockquote> <p> 3. Od Odkrywcy <strong> Widok </strong> wybierz menu <strong> Detale </strong> . <br> 4. Zlokalizuj, który plik DBX przekracza limit pamięci 2 GB. * </p> <p> * W tym przykładzie rozmiar pliku „Skrzynka odbiorcza.dbx” przekracza 2 GB. </p> <p><img src=\"images/image_thumb2_thumb-339.png\" alt=\"FIX Outlook Express Error 0x800c0133\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Krok 3. Przenieś wiadomości e-mail z folderu Oversized Mail do folderu Nowa poczta. </h6> <p> 1. Otwórz Outlook Express. <br> 2. Wybierz zbyt duży folder poczty (o rozmiarze ponad 2 GB, np. folder „Skrzynka odbiorcza” w tym przykładzie). <br> 3. Jeśli widzisz swoje wiadomości e-mail w tym folderze (folder nie jest pusty), wykonaj następujące czynności: * </p> <p> * Uwaga: Jeśli folder wydaje się pusty (nie widzisz w nim żadnych wiadomości e-mail), oznacza to, że folder OE (i powiązany plik DBX) jest uszkodzony. W takim przypadku musisz odzyskać wiadomości e-mail z uszkodzonego folderu DBX, postępując zgodnie z instrukcjami w tym artykule. </p> <p> 4. W lewym okienku programu OE kliknij prawym przyciskiem myszy folder z dużym rozmiarem i wybierz <strong> Nowy folder </strong> (w celu utworzenia nowego folderu poczty) </p> <p><img src=\"images/image_thumb-6-403.png\" alt=\"outlook express 2gb limit\" loading=\"lazy\"></p> <p> </p> <p> 5. Wpisz rozpoznawalną nazwę nowego folderu, po której następuje rok (np. „Skrzynka odbiorcza-2016”) </p> <p><img src=\"images/image_thumb-7-434.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Następnie z nadwymiarowego folderu (np. ze „Skrzynki odbiorczej”) wybierz grupę wiadomości e-mail (np. wszystkie e-maile z roku 2016) i przeciągnij i upuść (przenieś) je do utworzonego wcześniej nowego folderu Poczta (np. do „ Skrzynka odbiorcza-2016&quot;). </p> <p><img src=\"images/image_thumb-8-450.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Powtórz te same kroki (na przykład utwórz różne foldery według roku i przenieś wiadomości z folderu o dużym rozmiarze do nowych folderów). * </p> <p> * Uwaga: Jeśli napotkasz problemy podczas operacji przenoszenia (np. jeśli nie możesz przenieść niektórych wiadomości do nowego folderu), to: </p> <blockquote><p> 1. Zamknij Outlook Express. <br> 2. Skopiuj (wykonaj kopię zapasową) folder „Outlook Express” z lokalizacji Sklepu OE do innego miejsca docelowego na dysku. <br> 3. Następnie postępuj zgodnie z instrukcjami w kroku 4, aby usunąć zbyt duży plik .dbx. <br> 4. Otwórz Outlook Express. <br> 5. Zaimportuj wiadomości e-mail z folderu kopii zapasowej OE (Z <strong> Plik </strong> menu przejdź do -&gt; <strong> Import </strong> <strong> Wiadomości </strong> -&gt; <strong> Microsoft Outlook Express 6 </strong> -&gt; <strong> Importuj pocztę z katalogu sklepu OE… </strong> ). ** </p> <p> ** Jeśli nadal występują problemy podczas importowania, postępuj zgodnie z instrukcjami w tym artykule, aby naprawić uszkodzony plik DBX. </p></blockquote> <p> </p> <p> 8. Gdy zakończysz przesyłanie wiadomości e-mail, a folder 2 GB stanie się pusty w wiadomościach e-mail (np. „Skrzynka odbiorcza” w tym przykładzie), przejdź do następnego kroku. </p> <p><img src=\"images/image_thumb-10-811.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Krok 4. Usuń zbyt duży plik DBX programu Outlook Express z dysku. </h6> <p> 1. Otwórz folder przechowywania programu Outlook Express na dysku. <br> 2. Usuń zbyt duży plik DBX (np. &quot;Inbox.dbx&quot; w tym przykładzie). </p> <p><img src=\"images/image_thumb-9-996.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Uruchom Outlook Express. <br> 4. OE utworzy (automatycznie) nowy, czysty i zdrowy folder poczty do przechowywania wiadomości e-mail. * </p> <p> * Uwaga: Jeśli nadal pojawia się ten sam błąd, spróbuj naprawić uszkodzony folder OE, postępując zgodnie z instrukcjami w tym artykule: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak odzyskać plik DBX Outlook Express za DARMO </a> . </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? </p> <p> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}