{"title":"NAPRAW: Obecnie nie masz uprawnień dostępu do tego folderu na zewnętrznym dysku USB (rozwiązany)","content":"<p> Ten samouczek zawiera szczegółowe instrukcje dotyczące rozwiązania następującego problemu podczas próby uzyskania dostępu do zewnętrznego dysku USB na laptopie HP z systemem Windows 10: „Obecnie nie masz uprawnień dostępu do tego folderu. Kliknij przycisk Kontynuuj, aby na stałe uzyskać dostęp do tego folderu” . Błąd utrzymuje się nawet po naciśnięciu przycisku „Kontynuuj”, aby uzyskać dostęp do dysku. </p> <p><img src=\"images/image_thumb-18-636.png\" alt=\"You don't have permission to access this folder\" loading=\"lazy\"></p> <p> Dziwny błąd „Nie masz uprawnień dostępu do tego folderu” pojawił się na zupełnie nowym <a href=\"http://www8.hp.com/us/en/products/laptops/product-detail.html?oid=17047142\" target=\"_blank\" rel=\"nofollow noopener\"> HP ProBook 450 G5 </a> laptopa, gdy użytkownik próbuje wyświetlić zawartość podłączonego dysku USB (pendrive, dysk USB itp.). </p> <p> Po zbadaniu problemu odkryłem, że przyczyną problemu są uprawnienia bezpieczeństwa, które zostały zastosowane w <a href=\"http://www8.hp.com/us/en/solutions/computer-security.html\" target=\"_blank\" rel=\"nofollow noopener\"> HP Client Security Manager </a> program. HP Client Security Manager to program opracowany przez firmę Hewlett-Packard, który umożliwia ochronę danych, urządzenia i tożsamości poprzez zwiększenie bezpieczeństwa komputera. </p> <h2> Rozwiązanie problemu: Brak uprawnień do dostępu do dysku USB na laptopie HP (Windows 10/8/7). </h2> <p> 1. Otwórz <strong> Menedżer ds. bezpieczeństwa klienta HP </strong> . </p> <p><img src=\"images/image_thumb-13-716.png\" alt=\"HP Client Security manager\" loading=\"lazy\"></p> <p> </p> <p> 2. Następnie kliknij <strong> Bezpieczeństwo urządzenia. </strong></p> <p><img src=\"images/image_thumb-14-712.png\" alt=\"fix You Don't have permission to access this folder windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. W <strong> Administratorzy </strong> ustaw zabezpieczenie „Usuwanie magazynu” na <strong> Zezwól – pełny dostęp </strong> i kliknij <strong> Zatwierdź. </strong></p> <p><img src=\"images/image_thumb-15-364.png\" alt=\"fix You Don't have permission o access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Dodatkowo (jeśli chcesz) daj <strong> Pełny dostęp </strong> na wymienny nośnik pamięci, aby <strong> Użytkownicy standardowi </strong> . </p> <p><img src=\"images/image_thumb-19-269.png\" alt=\"no permission to access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Na koniec, jeśli nie chcesz, aby HP Device Access Manger kontrolował dostęp do dysku, przejdź do <strong> Ustawienia Dysku </strong> i ustaw odpowiedni przełącznik w pozycji OFF. </p> <p><img src=\"images/image_thumb-20-822.png\" alt=\"You don't have permission to access USB drive\" loading=\"lazy\"></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym problemie. </p>"}