{"title":"NAPRAW: To urządzenie nie może używać modułu Trusted Platform w funkcji BitLocker. (Rozwiązany)","content":"<p> Na komputerze z systemem Windows 10 Pro lub Enterprise podczas próby: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> włączyć szyfrowanie dysków funkcją BitLocker na dysku systemu operacyjnego </a> : „To urządzenie nie może korzystać z modułu Trusted Platform Module. Twój administrator musi ustawić opcję „Zezwalaj na funkcję BitLocker bez zgodnego modułu TPM” w zasadach „Wymagaj dodatkowego uwierzytelniania podczas uruchamiania” dla woluminów systemu operacyjnego”. </p> <p><img src=\"images/image_thumb-30-150.png\" alt=\"This device can't use a Trusted Platform Module in BitLocker\" loading=\"lazy\"></p> <p> Ten samouczek zawiera instrukcje dotyczące rozwiązania następującego błędu funkcji BitLocker: „To urządzenie nie może korzystać z modułu Trusted Platform Module…” w systemie Windows 10 Pro i Enterprise Edition. </p> <h4> Jak naprawić: Błąd „To urządzenie nie może korzystać z modułu Trusted Platform Module” w programie Bit Locker. </h4> <p> Funkcja BitLocker zapewnia najlepszą ochronę, gdy jest używana z modułem Trusted Platform Module (TPM) w wersji 1.2 lub nowszej. Jeśli posiadasz komputer, który nie ma modułu TPM, musisz wyłączyć wymaganie TPM dla funkcji BitLocker w zasadach grupy. Aby to zrobić: </p> <p> 1. Naciśnij jednocześnie Windows <img src=\"images/image_thumb36-579.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. Typ <strong> gpedit.msc </strong> &amp; Naciśnij <strong> Wchodzić. </strong></p> <p><img src=\"images/image_thumb-78-692.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. W lewym okienku przejdź do: </p> <ul> <li><strong> Konfiguracja komputera\\Szablony administracyjne\\Składniki systemu Windows\\Szyfrowanie dysków funkcją BitLocker\\Dyski systemu operacyjnego </strong></li> </ul> <p> 4. Następnie kliknij na <strong> Wymagaj dodatkowego uwierzytelnienia przy starcie </strong> w prawym okienku. </p> <p><img src=\"images/image_thumb-31-186.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Kliknij <strong> Włączone </strong> a następnie sprawdź <strong> Zezwalaj na funkcję BitLocker bez zgodnego modułu TPM </strong> pole wyboru. <strong><br> </strong> 6. Kliknij <strong> dobrze </strong> i <strong> blisko </strong> Edytor zasad grupy. </p> <p><img src=\"images/image_thumb-32-380.png\" alt=\"Allow BitLocker without compatible Trusted Platform Module\" loading=\"lazy\"></p> <p> </p> <p> 7. Gotowe! Kontynuuj, aby bez problemu włączyć ochronę BitLocker na dysku systemu operacyjnego. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}