{"title":"NAPRAW: Relacja zaufania między tą stacją roboczą a domeną podstawową nie powiodła się (rozwiązana)","content":"<p> Jeśli podczas próby zalogowania się w domenie lub podczas próby uzyskania dostępu do folderu współdzielonego na innym komputerze w domenie zostanie wyświetlony komunikat o błędzie „Relacja zaufania między tą stacją roboczą a domeną podstawową nie powiodła się”, kontynuuj czytanie poniżej, aby rozwiązać problem. </p> <p> Błąd „Relacja zaufania między stacją roboczą a domeną podstawową nie powiodła się” może pojawić się z następujących powodów: </p> <ul> <li> Komputer ma taką samą nazwę jak inny komputer w Domenie. </li> <li> Poświadczenia domeny (nazwa użytkownika lub hasło) są nieprawidłowe. </li> <li> Konto komputera wygasło. * </li> </ul> <p> * Uwaga: niektóre organizacje przygotowują komputery (lub klony komputerów) do późniejszego wykorzystania. Jeśli konto komputera wygasło, nie będzie już mógł uwierzytelniać się w domenie. W takich przypadkach komputery, które nie mogą uwierzytelnić się w domenie, należy usunąć z domeny i ponownie do niej dołączyć. (krok 4) </p> <p><img src=\"images/image_thumb-32-740.png\" alt=\"FIX: Trust Relationship Between this Workstation and the Primary Domain Failed \" loading=\"lazy\"></p> <h4> Jak naprawić: Niepowodzenie relacji zaufania między stacją roboczą a domeną. </h4> <h6> Metoda 1. Sprawdź, czy poświadczenia domeny są poprawne. </h6> <p> Przede wszystkim upewnij się, że poświadczenia są poprawne, a zwłaszcza hasło. jeśli sklonowałeś maszynę z obrazu komputerowego wykonanego w przeszłości i od tego czasu kod się zmienił. </p> <h6> Metoda 2. Sprawdź zduplikowane nazwy komputerów. </h6> <p> Upewnij się, że nazwa komputera jest unikatowa i że w sieci nie ma innego komputera o tej samej nazwie. </p> <h6> Metoda 3. Sprawdź zduplikowane adresy IP. </h6> <p> Upewnij się, że adres IP komputera jest unikalny i nie powoduje konfliktu z innym adresem IP w sieci. </p> <h6> Metoda 4. Usuń i ponownie dołącz do komputera w domenie. </h6> <p> Typową metodą korygowania relacji zaufania między komputerem a domeną jest usunięcie i ponowne dodanie komputera, którego dotyczy problem, do domeny. </p> <h5> Krok 1. Usuń konto komputera z domeny. </h5> <p> 1. Zaloguj się do serwera Active Directory. <br> 2. Otwórz <strong> Użytkownicy i komputery usługi Active Directory. <br> </strong> 3. Rozwiń <strong> Komputery </strong> pojemnik. <br> 4. Kliknij prawym przyciskiem myszy komputer, którego dotyczy problem i wybierz <strong> Kasować. </strong></p> <p><img src=\"images/image_thumb-39-366.png\" alt=\"Delete Computer Account from Domain\" loading=\"lazy\"></p> <h5> Krok 1. Usuń i ponownie dołącz do komputera w domenie. </h5> <p> 1. Zaloguj się do komputera, którego dotyczy problem, przy użyciu konta administratora LOKALNEGO (Nazwa komputera\\Administrator). </p> <p> 2. Naciśnij Windows <img src=\"images/image_thumb8_thumb-480.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. </p> <p> 2a. Rodzaj <strong> sysdm.cpl </strong> &amp; Kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb7_thumb-169.png\" alt=\"system properties\" loading=\"lazy\"></p> <p> 3. W zakładce „Nazwa komputera” kliknij <strong> Zmiana </strong> . </p> <p><img src=\"images/image_thumb-37-924.png\" alt=\"Remove Computer from Domain\" loading=\"lazy\"></p> <p> 4. W sekcji Członek wybierz <strong> Grupa robocza </strong> , wpisz nazwę grupy roboczej (np. WORKGROUP) i kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-34-169.png\" alt=\"Change Computer Name - Membership\" loading=\"lazy\"></p> <p> 5. Wpisz poświadczenia administratora i kliknij <strong> dobrze </strong> . <br> 6. <strong> Uruchom ponownie </strong> komputer. </p> <p> 7. Ponownie wykonaj kroki 1-4, ale tym razem w kroku 4 wybierz <strong> Domena, </strong> wpisz nazwę domeny i kliknij <strong> DOBRZE. </strong></p> <p><img src=\"images/image_thumb-38-928.png\" alt=\"Add computer to domain\" loading=\"lazy\"></p> <p> 8. Wpisz poświadczenia administratora domeny i kliknij <strong> dobrze </strong> . <br> 9. <strong> Uruchom ponownie </strong> Twój komputer i zaloguj się do domeny przy użyciu konta użytkownika domeny. </p> <h6> Metoda 5. Zresetuj konto komputera w domenie. </h6> <p> 1. Zaloguj się do serwera Active Directory. <br> 2. Otwórz <strong> Użytkownicy i komputery usługi Active Directory. <br> </strong> 3. Rozwiń <strong> Komputery </strong> pojemnik. <br> 4. Kliknij prawym przyciskiem myszy komputer, którego dotyczy problem i wybierz <strong> Zresetuj konto. </strong></p> <p><img src=\"images/image_thumb-36-935.png\" alt=\"Reset Computer Account in Domain\" loading=\"lazy\"></p> <p> 5. Wreszcie <strong> uruchom ponownie </strong> <strong> dotknięta maszyna </strong> i zaloguj się w domenie. </p> <p> To wszystko ludzie! Która metoda zadziałała dla Ciebie? Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}