{"title":"NAPRAW: VeraCrypt nie odpowiada (zamrażanie) przy demontażu w systemie Windows 10 (rozwiązany)","content":"<p> Ten przewodnik zawiera instrukcje rozwiązania następującego problemu z VeraCrypt na komputerze z systemem Windows 10: VeraCrypt nie odpowiada i zawiesza się (zawiesza się) podczas odłączania zaszyfrowanego woluminu. </p> <p> VeraCrypt Not Responding (Freezing) — szczegóły: Kiedy próbujesz odmontować wolumen (ze wszystkimi plikami zamkniętymi z zamontowanego wolumenu), VeraCrypt zawiesza się i wyświetla komunikat &quot;Nie odpowiada&quot;. Gdy pojawi się ten problem, jedynym sposobem na przywrócenie systemu Windows do normalnego stanu jest zakończenie procesu VeraCrypt z Menedżera zadań. </p> <p> Według <a href=\"https://www.veracrypt.fr/en/Issues%20and%20Limitations.html\" target=\"_blank\" rel=\"nofollow noopener\"> VeraCrypt </a> problem z zawieszaniem się jest spowodowany konfliktem pomiędzy oknem oczekiwania VeraCrypt wyświetlanym podczas operacji montowania/odmontowywania a innym oprogramowaniem zainstalowanym na komputerze (np. Antywirusem lub Firewallem). </p> <h4> Jak naprawić: VeraCrypt nie odpowiada na demontaż/montaż wolumenu. </h4> <p> Ten problem jest spowodowany konfliktem pomiędzy dialogiem oczekiwania VeraCrypt wyświetlanym podczas operacji montowania/odmontowywania a innym oprogramowaniem zainstalowanym na komputerze (np. Outpost Firewall Pro). </p> <p> 1. Z VeraCrypt <strong> Ustawienia </strong> menu, wybierz <strong> Preferencje </strong> . </p> <p><img src=\"images/image_thumb-63-122.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Czek </strong> <strong> Nie pokazuj okna dialogowego oczekiwania podczas wykonywania operacji </strong> kliknij opcję <strong> DOBRZE. </strong></p> <p><img src=\"images/image_thumb-64-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Teraz przystąp do montowania/demontowania wolumenów bez zamrażania! </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}