{"title":"NAPRAW: Opcja Zainstaluj VMware Tools jest wyszarzona. (Rozwiązany)","content":"<p> Jeśli nie możesz zainstalować narzędzi VMware na komputerze gościa, ponieważ opcja „Zainstaluj narzędzia VMware” jest wyszarzona, kontynuuj czytanie poniżej. VMware Tools to bezpłatny zestaw usług i modułów, które umożliwiają korzystanie z kilku funkcji wirtualnej maszyny gościa, takich jak szybsza wydajność grafiki, lepsza wydajność myszy i najważniejsze: możliwość kopiowania i wklejania między hostem a maszyną gościa. Tak więc, chociaż system operacyjny gościa może działać bez narzędzi VMware, narzędzia VMware muszą być zainstalowane, jeśli chcesz włączyć dodatkowe funkcje VMware. </p> <p> Zwykłym sposobem instalacji narzędzi VMware jest uruchomienie komputera gościa, a następnie wybranie z menu „Odtwarzacz” <strong> Zarządzać </strong> &gt; <strong> Zainstaluj narzędzia VMware </strong> . Ale jeśli podłączyłeś wirtualny napęd CD / DVD maszyny wirtualnej do pliku obrazu ISO podczas instalowania systemu operacyjnego, opcja &quot;Zainstaluj narzędzia VMware&quot; jest wyszarzona. </p> <p><img src=\"images/image_thumb-45-164.png\" alt=\"FIX VMware Tools option is Grayed Out\" loading=\"lazy\"></p> <p> </p> <p> Ten samouczek zawiera instrukcje dotyczące rozwiązania następującego problemu w programie VMware Workstation Player. Opcja „Zainstaluj narzędzia VMware” jest wyszarzona na komputerze gościa. </p> <h4> Jak zainstalować narzędzia VMware, jeśli opcja „Zainstaluj narzędzia VMware” jest wyszarzona. </h4> <p> </p> <p> 1. Zamknij maszynę wirtualną. <br> 2. Kliknij prawym przyciskiem na maszynę wirtualną i wybierz <strong> Ustawienia </strong> . </p> <p><img src=\"images/image_thumb-39-377.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Wybierz <strong> CD/DVD </strong> jedź, a następnie kliknij <strong> Usunąć </strong> . </p> <p><img src=\"images/image_thumb-43-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Następnie wybierz <strong> Miękki </strong> jedź, kliknij <strong> Usunąć </strong> a następnie kliknij <strong> dobrze </strong> aby zamknąć opcje ustawień. </p> <p><img src=\"images/image_thumb-44-469.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Początek </strong> Maszyna wirtualna. <br> 6. Z menu „Gracz” wybierz <strong> Zarządzać </strong> i kliknij <strong> Zainstaluj narzędzia VMware. </strong></p> <p><img src=\"images/image_thumb-42-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> To wszystko! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}