{"title":"NAPRAW: Aktualizacja systemu Windows 10 nie mogła odinstalować Avira AntiVir (rozwiązana)","content":"<p> Na komputerze z systemem Windows 10 podczas próby aktualizacji systemu Windows 10 do wersji 1803 lub 1809 pojawia się następujący komunikat: „Niektóre aplikacje wymagają odinstalowania: te programy należy odinstalować, ponieważ nie są zgodne z aktualizacją: Avira Antivirus” oraz po naciśnięciu przycisku „Odinstaluj i kontynuuj” pojawia się następujący błąd: „Nie można odinstalować tych aplikacji: Avira AntiVir”. Zabawną rzeczą z tym problemem jest to, że Avira Antivir (Antivirus) nie jest zainstalowany na komputerze (nie jest wymieniony w zainstalowanych programach). </p> <p><img src=\"images/image_thumb-10-929.png\" alt=\"Windows 10 Update Couldn't uninstall Avira AntiVir\" loading=\"lazy\"></p> <p> Problem „Nie można odinstalować programu Avira AntiVir” podczas uaktualniania systemu Windows 10 v1803 występuje, ponieważ program aktualizacyjny znajduje na komputerze pewne pliki skojarzone z programem Avira Antivirus i nie zostały one usunięte podczas dezinstalacji programu Avira. * </p> <p> * Uwaga: Jeśli naprawdę masz zainstalowany program &quot;Avira Antivirus&quot; na swoim komputerze, odinstaluj go za pomocą opcji &quot;Programy i funkcje&quot; w panelu sterowania, a następnie przejdź do aktualizacji systemu do Windows 10 v1803 (lub 1809). Po aktualizacji pobierz i zainstaluj najnowszą wersję Avira Antivirus w swoim systemie. </p> <h4> Jak naprawić błąd aktualizacji systemu Windows 10: nie można odinstalować Avira AntiVir. </h4> <p> </p> <p> 1. Uruchom Windows w <strong> Tryb bezpieczeństwa </strong> . Aby to zrobić: </p> <ul> <li> <ul> <li> Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-432.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. </li> <li> Rodzaj <strong> msconfig </strong> i naciśnij <strong> Wchodzić </strong> . </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-47-667.png\" alt=\"msconfig\" loading=\"lazy\"></p> <ul> <li> <ul> <li> W <strong> Bagażnik </strong> zakładka wybierz <strong> Bezpieczny rozruch </strong> opcję, a następnie kliknij <strong> dobrze </strong> i uruchom ponownie komputer. </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-48-342.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Po ponownym uruchomieniu otwórz eksplorator plików i usuń <strong> avipbb.sys </strong> plik z następujących lokalizacji: </p> <ul> <li> C:\\Windows\\System32\\sterowniki </li> <li> C:\\Windows\\SysWOW64\\sterowniki </li> </ul> <p> </p> <p> 3. Przejdź do usuwania z powyższych lokalizacji każdego innego pliku o nazwie <strong> avipbb </strong> pomimo jego rozszerzenia. </p> <p> 4. Następnie usuń <strong> Avira </strong> folder z następującej lokalizacji: </p> <ul> <li> (Windows 64-bitowy): C:\\Pliki programów (x86)\\ <strong> Avira\\Antywirus </strong></li> <li> (Windows 32-bitowy): C:\\Pliki programów\\ <strong> Avira\\Antywirus </strong></li> </ul> <p> 5. Biegnij <strong> msconfig </strong> jeszcze raz. <br> 6. Na karcie Ogólne kliknij Normalne uruchamianie i kliknij <strong> dobrze </strong> , aby normalnie ponownie uruchomić komputer. </p> <p><img src=\"images/image_thumb-11-949.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Sprawdź i zainstaluj aktualizacje. * </p> <p> * Uwaga: Jeśli nadal napotykasz błąd „Nie można odinstalować Avira AntiVir” podczas aktualizacji, pobierz i uruchom <a href=\"https://www.avira.com/en/support-download-avira-registrycleaner/1//\" target=\"_blank\" rel=\"nofollow noopener\"> Avira do czyszczenia rejestru </a> . </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}