{"title":"NAPRAW: Viber, Yahoo i inne aplikacje ulegają awarii na urządzeniach z Androidem – marzec 2021 r. (rozwiązany).","content":"<p> Kilku użytkowników w ciągu ostatnich kilku godzin zgłosiło, że wiele aplikacji na Androida ulega awarii (22 marca 2021 r.). W szczególności Gmail, Viber, Google Chrome i inne ważne aplikacje nie otwierają się i nie zamykają natychmiast po otwarciu. Problem dotyczy wielu urządzeń z Androidem, a zwłaszcza urządzeń Samsunga. Jeśli napotkasz podobny problem, czytaj dalej, aby dowiedzieć się, jak go naprawić. </p> <p> Aktualizacja (23 marca 2021 r.): Google szybko zidentyfikował problem i stwierdził, że <strong> Android WebView </strong> winowajcą była aplikacja i naprawiono ją, przesyłając aktualizacje dla niej i innych aplikacji Chrome. </p> <h4> Jak naprawić: Android Google Apps, Viber itp. Problem z awarią (22 marca 2021 r.). </h4> <p> 1. Otwórz Androida <strong> Ustawienia. </strong></p> <p> 2. Dotknij <strong> Zarządzać aplikacjami </strong> (lub <strong> Aplikacje i powiadomienia </strong> lub <strong> Aplikacje </strong> na niektórych urządzeniach z Androidem). </p> <p><img src=\"images/image_thumb-27-815.png\" alt=\"FIX: Android Apps are Crashing on Samsung or other Devices.\" loading=\"lazy\"></p> <p> </p> <p> 3. Kliknij menu za pomocą <strong> trzy kropki </strong><img src=\"images/image_thumb-28-382.png\" alt=\"image\" loading=\"lazy\"> w prawym górnym rogu i wybierz <strong> Pokaż wszystkie aplikacje </strong> (lub <strong> Pokaż aplikacje systemowe </strong> ). </p> <p><img src=\"images/image_thumb-29-272.png\" alt=\"FIX Android GMAIL or Viber Crash \" loading=\"lazy\"></p> <p> </p> <p> 3. Znajdź <strong> Widok sieciowy systemu Android </strong> aplikacja (lub <strong> Android WebView </strong> ) na liście i otwórz ją. </p> <p><img src=\"images/image_thumb-30-842.png\" alt=\"FIX GMAIL Chrome or Viber Crash on Android - March 2021\" loading=\"lazy\"></p> <p> </p> <p> 4. Kliknij <strong> Odinstaluj aktualizacje. </strong></p> <p><img src=\"images/image_thumb-31-471.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Dotknij <strong> dobrze </strong> przy komunikacie ostrzegawczym. </p> <p> 6. <strong> Uruchom ponownie </strong> Twoje urządzenie i problem powinien zniknąć. </p> <p> To wszystko ludzie! Która metoda zadziałała dla Ciebie? Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}