{"title":"NAPRAW Usługa zagrożeń systemu Windows 10 została zatrzymana i nie można jej uruchomić (rozwiązano)","content":"<p> W tym przewodniku znajdziesz instrukcje krok po kroku dotyczące rozwiązania problemu „Nieoczekiwany błąd, przepraszamy, napotkaliśmy problem” po naciśnięciu przycisku „Uruchom ponownie teraz”, aby uruchomić usługę Zagrożeń w celu rozwiązania problemu „Usługa Zagrożeń została zatrzymana Uruchom ponownie teraz” w systemie Windows 10. </p> <p><img src=\"images/image_thumb-689.png\" alt=\"Threat Service has Stopped and Cannot Start\" loading=\"lazy\"></p> <p> </p> <p> Szczegóły problemów: Funkcja Wirus i zagrożenie w programie antywirusowym Windows Defender wyświetla komunikat „Nieznane” i ponieważ usługa Zagrożenia została zatrzymana i nie może się uruchomić z błędami: </p> <ul> <li><em> Nieoczekiwany błąd, przepraszamy, napotkaliśmy problem. Proszę spróbuj ponownie. </em></li> <li><em> Strona niedostępna. Twój administrator IT ma ograniczony dostęp do niektórych obszarów tej aplikacji, a element, do którego próbujesz uzyskać dostęp, jest niedostępny. Skontaktuj się z działem pomocy IT, aby uzyskać więcej informacji. </em></li> </ul> <p><img src=\"images/image_thumb-1-155.png\" alt=\"Unable to Start Threat Service. Page not available.\" loading=\"lazy\"></p> <p> </p> <h4> Rozwiązanie problemu: Usługa zagrożeń została zatrzymana i nie można jej uruchomić w programie Windows 10 Defender. </h4> <h6> Krok 1. Usuń wszelkie inne programy antywirusowe. </h6> <p> Pierwszym krokiem do naprawienia błędu „Usługa zagrożeń została zatrzymana” jest odinstalowanie innego programu antywirusowego z komputera. </p> <p> </p> <h6> Krok 2. Włącz zasady Windows Defender. </h6> <p> 1. Otwórz <strong> Edytor rejestru </strong> : Aby to zrobić: </p> <ul> <li> Naciśnij jednocześnie Windows <img src=\"images/image_thumb36-454.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. </li> <li> Rodzaj <strong> regedit </strong> &amp; Naciśnij <strong> Wchodzić. </strong></li> </ul> <p><img src=\"images/image_thumb7-613.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Przejdź do następującego klawisza w lewym okienku: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Windows Defender </li> </ul> <p> 4. W prawym okienku zmień wartość „DisableAntiSpyware” z 1 na <strong> 0 * </strong></p> <p> * Uwaga: jeśli nie znajdziesz wartości „DisableAntiSpyware”, kliknij prawym przyciskiem myszy puste miejsce i wybierz <strong> Nowy </strong> -&gt; <strong> Wartość DWORD (32-bitowa) </strong> a następnie nadaj wartości nazwę &quot; <strong> Wyłącz oprogramowanie antyszpiegowskie </strong> &quot; </p> <p><img src=\"images/image_thumb-2-284.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Zamknij Edytor rejestru i <strong> uruchom ponownie </strong> Twój komputer. <br> 6. Teraz sprawdź, czy Ochrona przed zagrożeniami jest OK i jeśli problem nadal występuje, przejdź do następnego kroku. </p> <p> </p> <h6> Krok 3. Włącz usługę antywirusową Windows Defender w rejestrze. </h6> <p> 1. Otwórz Edytor rejestru. <br> 2. Przejdź do następującego klawisza w lewym okienku: </p> <ul> <li> HKEY_LOCAL_MACHINE SYSTEM CurrentControlSet Usługi WinDefend </li> </ul> <p> 3. W prawym okienku zmodyfikuj <strong> Początek </strong> wartość od 4 do <strong> 2 </strong> . * </p> <p> * Uwaga: jeśli nie możesz zmodyfikować wartości rejestru, uruchom system Windows 10 w trybie awaryjnym i spróbuj ponownie. </p> <p><img src=\"images/image_thumb-3-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Zamknij Edytor rejestru i <strong> uruchom ponownie </strong> Twój komputer. <br> 6. Teraz sprawdź, czy Ochrona przed zagrożeniami jest OK i jeśli problem nadal występuje, przejdź do następnego kroku. </p> <p> </p> <h6> Krok 4. NAPRAW problemy z programem Windows Defender za pomocą DISM. </h6> <p> Następną metodą rozwiązania błędu Centrum zabezpieczeń systemu Windows 10 Defender „Usługa zagrożeń została zatrzymana i nie można jej uruchomić” jest naprawa systemu Windows za pomocą narzędzia gotowości aktualizacji systemu (DISM). </p> <p> 1. Otwórz <strong> Wiersz polecenia jako administrator </strong> . Aby to zrobić: </p> <ul> <li> W polu wyszukiwania wpisz: <strong> wiersz polecenia </strong> lub <strong> cmd </strong></li> <li> Kliknij prawym przyciskiem na <strong> Wiersz polecenia </strong> wynik i wybierz <strong> Uruchom jako administrator. </strong></li> </ul> <p><img src=\"images/image_thumb-10-227.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. W wierszu poleceń wydaj następujące polecenie dism i naciśnij <strong> Wchodzić: </strong></p> <ul> <li><strong> DISM.exe /Online /Cleanup-image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-140.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> </p> <p> 3. Po zakończeniu operacji DISM wpisz następujące polecenie i naciśnij <strong> Wchodzić </strong> : </p> <ul> <li><strong> sfc /skanuj </strong></li> </ul> <p><img src=\"images/image_thumb31-197.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Teraz poczekaj, aż Kontroler plików systemowych naprawi pliki systemowe Windows. <br> 5. Kiedy to zrobisz, <strong> uruchom ponownie </strong> Twój komputer. </p> <p> </p> <h6> Krok 5. Napraw system Windows 10 za pomocą aktualizacji na miejscu. </h6> <p> Ostatnią metodą rozwiązania problemów z instalacją Windows 10 Update jest: <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> napraw system Windows 10 za pomocą uaktualnienia na miejscu. </a></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}