{"title":"NAPRAW: Serwer jest niedostępny. Możesz nie mieć uprawnień do korzystania z tego zasobu sieciowego. Uchwyt jest nieprawidłowy. (Rozwiązany)","content":"<p> Ten samouczek zawiera instrukcje naprawienia następującego błędu podczas próby uzyskania dostępu do folderu udostępnionego w sieci: „Serwer jest niedostępny. Możesz nie mieć uprawnień do korzystania z tego zasobu sieciowego. Skontaktuj się z administratorem tego serwera, aby dowiedzieć się, czy masz dostęp uprawnienia. Dojście jest nieprawidłowe.&quot; </p> <p><img src=\"images/image_thumb-5-437.png\" alt=\"You might not have permission to use this network resource\" loading=\"lazy\"></p> <p> </p> <h2> Jak FIX: Nie można uzyskać dostępu do folderu współdzielonego. Możesz nie mieć uprawnień do korzystania z tego zasobu sieciowego. Uchwyt jest nieprawidłowy. </h2> <p> Zwykle problem z połączeniem udostępniania plików „Możesz nie mieć uprawnień do korzystania z tego zasobu sieciowego” pojawia się, gdy użytkownik próbuje uzyskać dostęp do udostępnionego folderu sieciowego bez wymaganych uprawnień. W takim przypadku, aby rozwiązać problem, musisz upewnić się, że użytkownik ma odpowiednie uprawnienia dostępu do folderu współdzielonego. </p> <p> Jeśli jednak wiesz, że uprawnienia użytkownika do folderu współdzielonego są prawidłowe, a problem z połączeniem „Możesz nie mieć uprawnień do korzystania z tego zasobu sieciowego” pojawił się nagle i bez oczywistego powodu, problem prawdopodobnie wynika z instalacji systemu Windows Aktualizacja. W takim przypadku kontynuuj czytanie poniżej, aby rozwiązać problem. </p> <p> * Uwaga: jeśli napotkasz błąd udostępniania w połowie stycznia 2019 r., przyczyną jest następująca aktualizacja zabezpieczeń systemu Windows: <a href=\"https://support.microsoft.com/el-gr/help/4480970/windows-7-update-kb4480970\" target=\"_blank\" rel=\"nofollow noopener\"> 8 stycznia 2019 r. — KB4480970 (comiesięczny pakiet zbiorczy aktualizacji) </a> . </p> <h6> Metoda 1. Odinstaluj najnowszą aktualizację systemu Windows. </h6> <p> Na komputerze z udostępnionym folderem: </p> <p> 1. Kliknij prawym przyciskiem myszy ikonę „Mój komputer” i wybierz <strong> Nieruchomości </strong> . <br> 2. Kliknij <strong> Aktualizacja systemu Windows </strong> . </p> <p><img src=\"images/image_thumb-6-686.png\" alt=\"fix Network Shared Folder is Not Accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. Kliknij <strong> Zainstalowane aktualizacje </strong> . </p> <p><img src=\"images/image_thumb-7-999.png\" alt=\"fix cannot access shared folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Posortuj aktualizacje według daty instalacji, klikając <strong> Zainstalowany na. </strong></p> <p><img src=\"images/image_thumb-8-158.png\" alt=\"uninstall windows update\" loading=\"lazy\"></p> <p> </p> <p> 5. Zaznacz najnowszą zainstalowaną aktualizację dla Windows i kliknij <strong> Odinstaluj. </strong> * </p> <p> * np. Jeśli napotkasz błąd udostępniania w połowie stycznia 2019 r., kontynuuj i odinstaluj „Aktualizację zabezpieczeń dla systemu Microsoft Windows KB4480970”. </p> <p><img src=\"images/image_thumb-9-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Po zakończeniu instalacji <strong> uruchom ponownie </strong> komputer. <br> 7. Po ponownym uruchomieniu spróbuj ponownie uzyskać dostęp do folderu współdzielonego z komputera klienckiego. Następnie zastosuj sugerowane działania zgodnie z Twoim przypadkiem: </p> <ul> <li><strong> Przypadek A: </strong> Jeśli problem będzie się powtarzał, przejdź do odinstalowania wszystkich najnowszych zainstalowanych aktualizacji lub przejdź do <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> metoda 2 </a> poniżej. </li> <li><strong> Przypadek B: </strong> Jeśli problem zostanie rozwiązany, należy zapobiec instalowaniu usuniętej aktualizacji w przyszłości. Aby to zrobić: </li> </ul> <blockquote><p> 1. Przejdź do Windows Update i <strong> Sprawdź aktualizacje </strong> . <br> 2. Kliknij <strong> Ważne aktualizacje </strong> . </p></blockquote> <p><img src=\"images/image_thumb-22-393.png\" alt=\"view important updates\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 3. Kliknij prawym przyciskiem myszy problematyczną aktualizację i kliknij <strong> Ukryj aktualizację </strong> . <br> 4. Na koniec kliknij <strong> dobrze </strong> a następnie zamknij Windows Update. </p></blockquote> <p><img src=\"images/image_thumb-23-795.png\" alt=\"hide update windows 7\" loading=\"lazy\"></p> <h6> Metoda 2. Przywróć komputer do poprzedniego stanu roboczego. </h6> <p> Na komputerze z udostępnionym folderem: </p> <p> 1. Naciśnij Windows <img src=\"images/image_thumb8_thumb-632.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. Typ <strong> rstrui </strong> &amp; Kliknij <strong> dobrze </strong> aby uruchomić Przywracanie systemu. </p> <p><img src=\"images/rstui-1-300x148-611.png\" alt=\"rstui\" loading=\"lazy\"></p> <p> </p> <p> 3. Kliknij <strong> Kolejny </strong> na pierwszym ekranie. <br> 4. Wybierz wcześniejszy stan pracy (data/godzina) i kliknij <strong> Kolejny </strong> aby rozpocząć proces przywracania. </p> <p><img src=\"images/image_thumb-50-355.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Po przywróceniu systemu spróbuj ponownie uzyskać dostęp do folderu współdzielonego z komputera klienckiego. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym problemie. </p>"}