{"title":"NAPRAW: Problem z wysokim wykorzystaniem procesora Chrome (rozwiązany)","content":"<p> Jeśli Twój system działa z wysokim obciążeniem procesora po otwarciu Chrome, prawdopodobnie przyczyną jest zainstalowane rozszerzenie Chrome lub złośliwe oprogramowanie. Aby łatwo rozwiązać problemy z wysokim zużyciem procesora w przeglądarce Google Chrome, wykonaj poniższe czynności. </p> <p><img src=\"images/image_thumb-46-593.png\" alt=\"FIX Chrome High CPU Usage\" loading=\"lazy\"></p> <p> </p> <h4> Jak NAPRAWIĆ wysokie użycie procesora w Google Chrome. </h4> <h6> Krok 1. Przeskanuj komputer w poszukiwaniu złośliwego oprogramowania i wirusów. </h6> <p> Pierwszym krokiem przed rozwiązaniem błędu „ERR_CONNECTION_CLOSED” w Chrome jest upewnienie się, że Twój system jest wolny od wirusów/złośliwego oprogramowania. W tym celu postępuj zgodnie z instrukcjami w tym przewodniku: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak skanować komputer w poszukiwaniu wirusów i innych złośliwych programów. </a></p> <p> </p> <h6> Krok 2. Wyłącz niechciane rozszerzenia Chrome. </h6> <p> 1. Z menu Chrome <img src=\"images/image_thumb-47-125.png\" alt=\"image\" loading=\"lazy\"> , iść do <strong> Więcej narzędzi </strong> -&gt; <strong> Rozszerzenia </strong></p> <p><img src=\"images/image_thumb-51-680.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Usuń (lub wyłącz) każde rozszerzenie, którego nie potrzebujesz lub którego nie rozpoznajesz. </p> <p><img src=\"images/image_thumb-49-396.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Uruchom ponownie </strong> Google Chrome i sprawdź, czy problem z wysokim zużyciem procesora podczas uruchamiania Chrome został rozwiązany. Jeśli problem będzie się powtarzał, wyłącz lub – lepiej – usuń wszystkie zainstalowane rozszerzenia i ponownie uruchom Chrome. </p> <p> </p> <h6> Krok 3. Utwórz nowy profil Chrome. </h6> <p> 1. <strong> Blisko </strong> Chrom. <br> 2. Przejdź do poniższej lokalizacji (zgodnie z systemem operacyjnym). </p> <blockquote><p> A. Jeśli używasz <strong> Okna 10, 8, 7 </strong> lub <strong> Widok </strong> nawigować do: </p> <ul> <li><strong> C:\\Użytkownicy\\%Nazwa użytkownika%\\AppData\\Local\\Google\\Chrome\\ </strong></li> </ul> <p> </p> <p> * np. Jeśli Twoja nazwa użytkownika to „Użytkownik1”, folder profilu Chrome „ <strong> Dane użytkownika </strong> ”, jest przechowywany w „C:\\Użytkownicy\\Użytkownik1\\AppData\\Local\\Google\\Chrome\\ <strong> Dane użytkownika </strong> &quot; </p> <p> B. Jeśli używasz <strong> Windows XP </strong> nawigować do <strong> : </strong></p> <ul> <li><strong> C:\\Documents and Settings\\\\%Nazwa użytkownika%\\Ustawienia lokalne\\Dane aplikacji\\Google\\Chrome\\ </strong></li> </ul> <p> * np. „Jeśli Twoja nazwa użytkownika to „User1”, to folder profilu Chrome „ <strong> Dane użytkownika </strong> &quot; jest przechowywany w &quot;C:\\Documents and Settings\\Użytkownik1\\Ustawienia lokalne\\Dane aplikacji\\Google\\Chrome\\ <strong> Dane użytkownika&quot; </strong></p></blockquote> <p> 3. <strong> Przemianować </strong> „ <strong> Dane użytkownika </strong> &quot; folder do &quot; <strong> Dane użytkownika.STARY </strong> &quot;. </p> <p><img src=\"images/image_thumb-50-745.png\" alt=\"create new chrome profile\" loading=\"lazy\"></p> <p> 4. Otwórz Google Chrome i sprawdź, czy problem nadal występuje. Jeśli Chrome działa poprawnie* i nie powoduje, że procesor działa na wysokich poziomach, zamknij Chrome i skopiuj plik „Zakładki” z folderu „User Data.OLD\\Default” do „ <strong> Dane użytkownika\\Domyślne </strong> \\&quot;, aby przywrócić zakładki. </p> <p> * Uwaga: jeśli Google Chrome nadal powoduje, że procesor działa w 100%, to <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> całkowicie odinstaluj i ponownie zainstaluj Chrome. </a></p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}