{"title":"NAPRAW: Laptop Lenovo utknął na ekranie LOGO. (Rozwiązany)","content":"<p> Jeśli twój laptop Lenovo utknął na ekranie z logo, kontynuuj czytanie. Ten samouczek zawiera instrukcje krok po kroku, jak rozwiązać następujący problem na laptopach Lenovo: Po włączeniu laptop nie uruchamia się i zawiesza się na ekranie powitalnym z logo Lenovo. (Problem utrzymuje się nawet podczas próby rozruchu z urządzenia rozruchowego USB). </p> <p><img src=\"images/image_thumb-17-276.png\" alt=\"FIX: Lenovo laptop is stuck at LOGO screen.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Jak naprawić: Laptop utknął na ekranie LENOVO LOGO. * </h4> <p> * Ważne: Przed przystąpieniem do rozwiązywania problemów z komputerem odłącz wszystkie urządzenia peryferyjne, aby upewnić się, że problem nie jest spowodowany podłączonym urządzeniem. </p> <p> </p> <h6> Krok 1. Zresetuj BIOS do ustawień domyślnych. </h6> <p> Pierwszym krokiem do rozwiązania problemu zawieszania się laptopa w logo Lenovo jest zresetowanie systemu BIOS do ustawień domyślnych. Aby to zrobić: </p> <p> 1. <strong> Wyłączyć </strong> Laptop przez ciągłe naciskanie przycisku zasilania przez 5-7 sekund. <br> 2. Teraz postępuj zgodnie z poniższymi instrukcjami w zależności od modelu, aby wejść do BIOS-u: </p> <ul> <li> Jeśli twój system jest <strong> ThinkPad </strong> , naciśnij przycisk zasilania, a następnie natychmiast naciśnij szybko i wielokrotnie klawisz (Fn+) F2 lub (Fn+) F1. </li> <li> Jeśli twój system jest <strong> pomysłodawca </strong> laptop, zlokalizuj i <strong> naciśnij </strong> <a href=\"https://support.lenovo.com/us/en/solutions/HT104038\" target=\"_blank\" rel=\"nofollow noopener\"> NOVO </a> przycisk, który zwykle znajduje się obok przycisku zasilania, a następnie wybierz <strong> Wejdź do menu BIOS </strong> . </li> </ul> <p> 3. W <strong> Wyjście </strong> wybierz zakładkę <strong> Załaduj domyślne ustawienia </strong> lub „Załaduj zoptymalizowane ustawienia”. <br> 4. <strong> Zapisz i wyjdź z BIOS-u </strong> ustawienia i sprawdź, czy możesz uruchomić system Windows. <br> 5. Jeśli laptop nadal zawiesza się na ekranie z logo Lenovo, przejdź do następnego kroku. </p> <p> </p> <h6> Krok 2. Wyłącz silnik serwisowy Lenovo. </h6> <p> W niektórych laptopach Lenovo (i komputerach stacjonarnych) system zawiesza się na „Logo Lenovo” podczas uruchamiania, gdy włączony jest „Silnik Lenovo Service Engine”. Aby wyłączyć usługę: </p> <p> 1. Wejdź do menu BIOS. <br> 2. W <strong> Bezpieczeństwo </strong> zaznacz i wyłącz „Lenovo Service Engine”. </p> <p><img src=\"images/image_thumb-19-834.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Zapisz i wyjdź </strong> z menu BIOS. <br> 4. Jeśli laptop nadal utknął na ekranie powitalnym z logo Lenovo, przejdź do następnego kroku. </p> <p> </p> <h6> Krok 3: Wykonaj reset zasilania. </h6> <p> Następną metodą rozwiązania problemu „Lenovo Logo zablokowane” jest zresetowanie zasilania. Aby to zrobić: </p> <p> 1. <strong> Rozłączyć się </strong> wszystkie podłączone urządzenia peryferyjne. <br> 2. <strong> Usunąć </strong> <strong> Zasilacz sieciowy </strong> . <br> 3. <strong> Usunąć </strong> <strong> Bateria </strong> . * </p> <p> * Uwaga: Jeśli nie możesz wyjąć baterii, pozostaw laptopa otwartego do czasu rozładowania baterii. </p> <p> 4. <strong> naciśnij </strong> i <strong> przytrzymaj </strong> <strong> Moc </strong> przez co najmniej 50-60 sekund, a następnie zwolnij przycisk zasilania. <br> 5. Podłącz tylko zasilacz sieciowy i włącz laptopa. <br> 6. Jeśli system Windows uruchamia się normalnie, wyłącz laptopa i ponownie podłącz baterię i urządzenia peryferyjne. </p> <h6> Krok 4. Wyjmij baterię CMOS. </h6> <p> 1. <strong> Usunąć </strong> <strong> Bateria </strong> i <strong> Zasilacz sieciowy </strong> . <br> 2. Odwróć laptopa do góry nogami i <strong> usunąć </strong> <strong> tylna pokrywa </strong> . * </p> <p> * Uwaga: Sposób zdejmowania tylnej obudowy różni się w zależności od modelu laptopa. Przeprowadź więc wyszukiwanie w Google, aby dowiedzieć się, jak zdemontować własny model laptopa Lenovo. </p> <p> 3. Zlokalizuj i <strong> usunąć </strong> <strong> Bateria CMOS </strong> . * </p> <p> * Uwaga: bateria CMOS ma kształt koła i można ją wyjąć, delikatnie podważając ją małym, płaskim śrubokrętem. </p> <p> 4. <strong> naciśnij </strong> i <strong> przytrzymaj </strong> <strong> Moc </strong> przez co najmniej 50-60 sekund, a następnie zwolnij go. </p> <p> 5. Podłącz najpierw zasilacz sieciowy, a następnie ponownie włóż baterię CMOS. <br> 5. Włącz laptopa. * </p> <p> * Uwaga: Jeśli problem będzie się powtarzał, wyjmij i pozostaw baterię CMOS odłączoną przez co najmniej 30 minut. Następnie włóż baterię CMOS z powrotem, podłącz zasilacz i włącz laptopa. </p> <p> </p> <h6> Krok 5. Wyjmij jednostkę DVD. * </h6> <p><strong> * Ważne: </strong> Wyłącz komputer i odłącz zasilacz przed dodaniem lub wyjęciem części. </p> <p> Jeśli posiadasz laptopa z napędem DVD, wyjmij go i ponownie włącz laptopa. (Brzmi to dziwnie, ale w niektórych przypadkach działa.) </p> <p> </p> <h6> Krok 6. Usuń i ponownie zainstaluj pamięć RAM i dysk twardy. </h6> <p> Gdy komputer (komputer stacjonarny lub laptop) zawiesza się na ekranie LOGO (POST), zwykle oznacza to problem z dyskiem twardym (HDD) lub pamięcią (RAM). Postępuj więc w następujący sposób: </p> <p><strong> * Ważne: </strong> Wyłącz komputer i wyjmij zasilacz przed dodaniem lub wyjęciem jego części. </p> <p> 1. Wyjmij i włóż ponownie moduł(y) pamięci RAM. <br> 2. Włącz laptopa i sprawdź, czy problem nadal występuje. Jeśli tak, to… <br> 3. Wyłącz laptopa i wyjmij (odłącz) dysk twardy (HDD). <br> 4. Po wyjęciu dysku twardego włącz ponownie laptopa. <br> 5. Jeśli dysk twardy jest przyczyną problemu, ekran powitalny Lenovo LOGO zniknie i pojawi się komunikat „Nie znaleziono urządzenia rozruchowego” lub coś w tym rodzaju. Jeśli tak się stanie:* </p> <blockquote><p> za. Wyłącz laptopa. <br> b. Oczyść styki na dysku twardym i gnieździe dysku twardego sprayem do czyszczenia styków. <br> do. Podłącz ponownie dysk twardy i kontynuuj czytanie poniżej (6). </p></blockquote> <p> * Uwaga: Jeśli tak się nie stanie, oznacza to problem z systemem BIOS lub problem z płytą główną, który może naprawić tylko wyspecjalizowany technik komputerowy. </p> <p> 6. Włącz laptopa i sprawdź, czy problem został rozwiązany. Jeśli nie, wykonaj kopię zapasową plików, a następnie wykonaj czystą instalację systemu Windows, wykonując poniższe czynności: </p> <blockquote><p> za. Wyjmij i podłącz dysk twardy do innego działającego komputera (np. za pomocą adaptera dysku twardego USB do SATA). <br> b. Jeśli możesz odczytać zawartość dysku, kontynuuj i <strong> Zrób kopię zapasową swoich plików </strong> . * </p> <p> * Uwaga: Jeśli dysk twardy nie jest rozpoznawany przez komputer pomocniczy, oznacza to, że dysk twardy jest uszkodzony i trzeba go wymienić. </p> <p> do. Po utworzeniu kopii zapasowej plików kontynuuj i <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> zdiagnozować dysk twardy pod kątem problemów </a> i zgodnie z wynikami wymień dysk twardy (jeśli jest uszkodzony) lub (jeśli jest OK) kontynuuj i <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> usuń wszystkie partycje na dysku twardym </a> . </p></blockquote> <p> 7. Po wyczyszczeniu partycji włóż dysk twardy z powrotem do laptopa i przejdź do <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> czysta instalacja systemu Windows </a> . </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}