{"title":"NAPRAW: Błąd 0x80248007 w aktualizacji systemu Windows 10 (rozwiązany)","content":"<p> Na komputerze z systemem Windows 10 podczas próby zainstalowania aktualizacji może pojawić się następujący komunikat o błędzie: „Wystąpiły pewne problemy z instalacją aktualizacji, ale spróbujemy ponownie później. Jeśli nadal to widzisz i chcesz przeszukać sieć lub skontaktować się z pomocą techniczną w celu uzyskania informacji, może to pomóc: (0x80248007)&quot;. Błąd aktualizacji systemu Windows 10 0x80248007 często pojawia się, jeśli pliki Windows Update są uszkodzone lub jeśli system Windows nie może otrzymywać aktualizacji z powodu sieci problemy. </p> <p><img src=\"images/image_thumb-14-418.png\" alt=\"FIX Error 0x80248007 in Windows 10 Update \" loading=\"lazy\"></p> <p> </p> <p> Ten samouczek zawiera instrukcje rozwiązywania problemów z błędem 0x80248007 podczas instalowania aktualizacji w systemie Windows 10. </p> <h4> Jak rozwiązać błąd 0x80248007 w aktualizacji systemu Windows 10. </h4> <h6> Krok 1. Przeskanuj komputer w poszukiwaniu wirusów. </h6> <p><strong> Ważny: </strong> Wiele wirusów lub złośliwych programów może powodować problemy z aktualizacją systemu Windows. Więc zanim przejdziesz do poniższych kroków rozwiązywania problemów, użyj tego <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Przewodnik skanowania i usuwania złośliwego oprogramowania </a> aby sprawdzić i usunąć wirusy i/lub złośliwe programy, które mogą być uruchomione na Twoim komputerze. </p> <p> </p> <h6> Krok 2. Uruchom narzędzie do rozwiązywania problemów z Windows Update. </h6> <p> 1. Przejdź do Windows <strong> Panel sterowania </strong> , ustaw „Wyświetl według” na <strong> Małe ikony </strong> i otwarte <strong> Rozwiązywanie problemów. </strong></p> <p><img src=\"images/image_thumb-5-564.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. W opcjach rozwiązywania problemów kliknij <strong> Napraw problemy z Windows Update. </strong></p> <p><img src=\"images/image_thumb-9-777.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Kliknij <strong> Kolejny </strong> do rozwiązywania problemów z aktualizacją systemu Windows. </p> <p><img src=\"images/image_thumb-8-840.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Po zakończeniu procesu rozwiązywania problemów <strong> blisko </strong> narzędzie do rozwiązywania problemów i <strong> uruchom ponownie </strong> Twój komputer. <br> 6. Sprawdź aktualizacje. </p> <h6> Krok 3. „Odbuduj” folder SoftwareDistribution. </h6> <p> „ <strong> Dystrybucja oprogramowania </strong> ” folder (C:WindowsSoftwareDistribution) to lokalizacja, w której system Windows przechowuje aktualizacje systemu Windows. Czasami ten folder jest uszkodzony i trzeba go ponownie utworzyć, aby pobrać i zainstalować aktualizacje od zera. Aby odbudować (odtworzyć) w folderze „SoftwareDistribution” wykonaj następujące czynności: </p> <p> 1. Otwórz panel sterowania Windows Services: Aby to zrobić: </p> <ul> <li> Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-939.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno polecenia Uruchom. </li> <li> W polu wyszukiwania wpisz: <strong> services.msc </strong> &amp; Kliknij <strong> dobrze </strong> . </li> <li> (Zaakceptuj ostrzeżenie UAC, jeśli się pojawi). </li> </ul> <p><img src=\"images/image_thumb14_thumb_thumb-709.png\" alt=\"image_thumb[14]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 2. W panelu sterowania Usługi zlokalizuj <strong> Aktualizacja systemu Windows </strong> usługa. <br> 3. Kliknij prawym przyciskiem myszy <strong> Aktualizacja systemu Windows </strong> obsługa i wybór <strong> Zatrzymać </strong> . </p> <p><img src=\"images/image_thumb7_thumb_thumb-509.png\" alt=\"image_thumb[7]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> </strong> Otwórz Eksploratora Windows i przejdź do: <strong> C: Okna </strong> teczka. <br> 5. Znajdź i <strong> Kasować </strong> <strong> Dystrybucja oprogramowania </strong> teczka. </p> <p> </p> <p><img src=\"images/image_thumb9_thumb_thumb-248.png\" alt=\"image_thumb[9]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Uruchom ponownie </strong> komputera i sprawdź dostępność aktualizacji. </p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}