{"title":"NAPRAW: Błąd przywracania systemu 0x8100010B (rozwiązany)","content":"<p> Ten samouczek zawiera instrukcje dotyczące rozwiązania błędu przywracania systemu 0x8100010B w systemie Windows 10. Błąd 0x8100010B może pojawić się podczas próby zwiększenia maksymalnego wykorzystania miejsca na ochronę systemu lub podczas próby usunięcia wszystkich poprzednich punktów przywracania. </p> <p><img src=\"images/image_thumb-19-393.png\" alt=\"FIX System Restore Error 0x8100010B\" loading=\"lazy\"></p> <p> Dokładniej, ten artykuł zawiera instrukcje rozwiązania następującego problemu w Przywracaniu systemu: </p> <p><strong> 1. Nie można zwiększyć maksymalnej przestrzeni dyskowej dla ochrony systemu system </strong> z błędem: „Było <strong> nieoczekiwany błąd na stronie właściwości </strong> : Nazwa pliku, nazwa katalogu lub składnia etykiety woluminu jest nieprawidłowa. (0x8007007B)). </p> <p><strong> 2. Nie można usunąć punktów przywracania </strong> w systemie Windows 10 z błędem: „Nie można usunąć punktów przywracania z następującego powodu: system Windows nie mógł usunąć wszystkich migawek. Spróbuj ponownie lub przejrzyj dziennik zdarzeń, aby uzyskać więcej informacji. (0x8100010B).” </p> <h2> Jak naprawić: Błąd 0x8100010B w Ochronie przywracania systemu. </h2> <p> 1. <strong> Uruchom ponownie </strong> Twój komputer. </p> <p> 2. Przejdź do <strong> Ochrona systemu </strong> ustawienia: </p> <ul> <li><b> Panel sterowania &gt; System &gt; Zaawansowane ustawienia systemu &gt; Właściwości systemu &gt; Ochrona systemu </b></li> </ul> <p> 3. Zaznacz <strong> Dysk lokalny C: (system) </strong> i kliknij <strong> Konfiguruj. </strong></p> <p><img src=\"images/image_thumb-22-902.png\" alt=\"0x8100010B System Protection\" loading=\"lazy\"></p> <p> </p> <p> 4. Wybierz <strong> Wyłącz ochronę systemu </strong> i kliknij <strong> Zastosuj &gt; OK. </strong> * </p> <p> * Uwaga: ta akcja spowoduje trwałe usunięcie wszystkich poprzednich punktów przywracania. Jeśli chcesz zwiększyć maksymalne wykorzystanie miejsca na ochronę systemu bez utraty punktów przywracania, wprowadź poniższe polecenie w wierszu polecenia z podwyższonym poziomem uprawnień, a następnie sprawdź, czy problem został rozwiązany. </p> <ul> <li> vssadmin resize shadowstorage /For=C: /On=C: /MaxSize=15% </li> </ul> <p><img src=\"images/image_thumb-23-863.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Blisko </strong> i <strong> otworzyć na nowo </strong> ustawienia ochrony systemu. </p> <p> 6. Teraz wybierz <strong> Włącz ochronę systemu </strong> , skonfiguruj maksymalne wykorzystanie i kliknij <strong> dobrze </strong> . </p> <p> 7. W opcjach ochrony systemu wybierz <strong> Włącz ochronę systemu </strong> i kliknij <strong> DOBRZE. </strong></p> <p><img src=\"images/image_thumb-73-430.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> To wszystko! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}