{"title":"NAPRAW: W systemie Windows 10 nie są dostępne żadne poprzednie wersje (rozwiązane)","content":"<p> Na komputerze z systemem Windows 10 z <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Ochrona systemu </a> włączone, podczas próby przywrócenia pliku/folderu za pomocą funkcji „Przywróć poprzednie wersje” pojawia się następujący problem: „Nie ma dostępnych poprzednich wersji”. </p> <p> <img src=\"images/image_thumb-39-628.png\" alt=\"There No Previous Versions Available in Windows 10 \" loading=\"lazy\"></p> <p> </p> <p> Błąd „Nie ma dostępnych poprzednich wersji”, ponieważ w systemie Windows 10 funkcja „Przywróć poprzednie wersje” działa tylko wtedy, gdy skonfigurowano „ <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Historia pliku </a> &#39;, aby wykonać kopię zapasową plików. Oznacza to, że funkcja „Przywróć poprzednie wersje” w systemie Windows 10 sprawdza lokalizację kopii zapasowej narzędzia „Kopia zapasowa historii plików”, aby znaleźć poprzednią wersję pliku/folderu, a nie w punktach przywracania systemu, jak to ma miejsce w systemie Windows 7. Aby włączyć historię plików w systemie Windows 10, postępuj zgodnie z instrukcjami w następujących artykułach: </p> <ul> <li><strong> Powiązane artykuły: </strong></li> <li> <ul> <li><a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak wykonać kopię zapasową plików osobistych z historią plików w systemie Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak tworzyć kopie w tle swoich plików za pomocą Harmonogramu zadań w systemie Windows 10? </a></li> </ul> </li> </ul> <h4> Jak naprawić: Brak wcześniejszych wersji plików dostępnych w systemie Windows 10. </h4> <p> Gdyby &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Historia pliku </a> &#39; jest już włączone* na komputerze z systemem Windows 10, ale podczas próby przywrócenia poprzedniej wersji pliku lub folderu wyświetlany jest komunikat „Nie ma dostępnych poprzednich wersji”, postępuj zgodnie z poniższymi instrukcjami: </p> <p> * Uwaga: poniższe instrukcje <strong> nie działa, jeśli <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Historia plików nie jest JUŻ włączona </a></strong> na komputerze z systemem Windows 10. </p> <p> 1. Pobierz i zainstaluj <a href=\"http://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> Eksplorator Cieni </a> narzędzie na twoim komputerze. <br> 2. Otwórz „ShadowExplorer” i wybierz datę, z której chcesz przywrócić plik. * </p> <p> * Uwaga: Jeśli nie widzisz poprzedniej daty, oznacza to, że Historia plików jest wyłączona. Pamiętaj, że nawet jeśli włączysz teraz Historię plików, wynik będzie taki sam, ponieważ Historia plików tworzy migawki plików od momentu aktywacji, a potem. </p> <p><img src=\"images/image_thumb-40-348.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Przejdź do lokalizacji przechowywania pliku/folderu, który chcesz przywrócić do poprzedniej wersji. <br> 4. Po zlokalizowaniu pliku, który chcesz przywrócić, kliknij go prawym przyciskiem myszy i wybierz <strong> Eksport </strong> . </p> <p><img src=\"images/image_thumb-41-653.png\" alt=\"restore previous versions shadow explorer\" loading=\"lazy\"></p> <p> </p> <p> 5. Wybierz inny dysk (lokalizację), aby zapisać przywrócony plik i kliknij <strong> dobrze </strong> . * </p> <p><strong> Ważny: </strong> Zapisz przywrócone pliki na inny dysk (np. pendrive) i dopiero po upewnieniu się, że masz prawidłowe pliki, skopiuj je do oryginalnej lokalizacji, aby uniknąć nadpisania oryginalnych plików. </p> <p><img src=\"images/image_thumb-38-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym problemie. </p>"}