{"title":"NAPRAW: Okres limitu czasu semafora wygasł podczas kopiowania plików (rozwiązany)","content":"<p> Błąd „Upłynął limit czasu semafora” może zostać wyświetlony podczas próby kopiowania dużych plików przez sieć lub podczas przesyłania plików z zewnętrznego dysku USB na komputer. W innych przypadkach podczas próby kopiowania plików z urządzenia podłączonego przez USB (np. z aparatu fotograficznego, telefonu komórkowego itp.) pojawia się komunikat „Błąd 0x80070079: Upłynął limit czasu semafora”. </p> <p><img src=\"images/image_thumb-4-812.png\" alt=\"Semaphore Timeout Period has Expired\" loading=\"lazy\"></p> <p> </p> <p> W tym przewodniku znajdziesz kilka sposobów rozwiązania problemu „upłynął limit czasu semafora. Błąd 0x80070079” podczas kopiowania plików z/do sieci lub USB w systemie Windows 10, 8, 8.1, 7 lub Vista. </p> <h4> Jak naprawić: Błąd podczas kopiowania pliku lub folderu. Upłynął okres semaforów. </h4> <p><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> CZĘŚĆ 1. NAPRAW „Okres semaforowy wygasł” podczas kopiowania plików z USB. </a></p> <p><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> CZĘŚĆ 2. NAPRAW „Okres semaforów wygasł” podczas kopiowania plików z sieci. </a></p> <p> </p> <h6> CZĘŚĆ 1. NAPRAW „Okres semaforowy wygasł” podczas kopiowania plików z USB. </h6> <p> Jeśli podczas kopiowania plików z urządzenia USB (np. z zewnętrznego dysku USB lub aparatu cyfrowego) pojawia się błąd „Okres semaforowy wygasł”, spróbuj wykonać następujące czynności, aby rozwiązać problem: </p> <p><strong> 1. </strong> Zamknij wszystkie otwarte programy i <strong> uruchom ponownie </strong> Twój komputer. <br> <strong> 2. </strong> Podłącz urządzenie USB do <strong> inny port USB </strong> . Jeśli komputer posiada port USB 2.0, podłącz urządzenie USB do tego portu. <br> <strong> 3. </strong> Użyć <strong> inny kabel USB </strong> aby podłączyć urządzenie USB do komputera. <br> <strong> 4. </strong> Jeśli chcesz skopiować pliki z urządzenia USB (np. telefonu komórkowego lub aparatu cyfrowego), które posiada kartę SD, to <strong> usunąć </strong> i <strong> włóż ponownie </strong> <strong> karta SD </strong> . Dodatkowo wyjmij kartę SD z urządzenia USB i podłącz ją do <strong> czytnik kart </strong> (jeśli posiadasz). <br> <strong> 5. </strong> <strong> Czek </strong> i <strong> napraw błędy </strong> na dysku USB za pomocą „ <strong> chkdsk </strong> &#39; Komenda. Aby to zrobić: </p> <blockquote><p> 1. Uruchom <strong> Wiersz polecenia jako administrator </strong> . </p></blockquote> <p><img src=\"images/image_thumb-30-765.png\" alt=\"command prompt administrator\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 2. W oknie wiersza poleceń wpisz następujące polecenie i naciśnij <strong> Wchodzić </strong> : * </p></blockquote> <ul> <li> <ul> <li> <ul> <li><strong> chkdsk X: /F /R </strong></li> </ul> </li> </ul> </li> </ul> <p><strong> * Uwaga: </strong> Zamień literę dysku X na literę dysku USB. </p> <p> </p> <p> </p> <h6> CZĘŚĆ 2. NAPRAW „Okres semaforów wygasł” podczas kopiowania plików przez sieć. </h6> <p> Jeśli otrzymasz błąd „Okres semaforowy wygasł” podczas próby kopiowania plików przez sieć, spróbuj wykonać następujące czynności: </p> <h2> Metoda 1. Użyj statycznego adresu IP. </h2> <p> Jeśli używasz DHCP, wyłącz go i określ statyczny adres IP na obu komputerach w sieci. </p> <p> </p> <h2> Metoda 2. Zaktualizuj sterowniki sieciowe na obu komputerach. </h2> <ul> <li> Jeśli masz laptopa, wypróbuj następujące rozwiązania: <ul> <li> Jeśli masz połączenie przez Wi-Fi, spróbuj skopiować pliki za pomocą połączenia Ethernet (LAN) lub… </li> <li> Przejdź do witryny pomocy technicznej producenta laptopa, aby pobrać i zainstalować najnowsze sterowniki sieciowe. </li> </ul> </li> <li> Jeśli posiadasz komputer stacjonarny, pobierz najnowsze sterowniki karty sieciowej z witryny pomocy technicznej producenta płyty głównej. </li> </ul> <p><strong> WSKAZÓWKA: </strong> Jeśli nie możesz znaleźć modelu laptopa lub płyty głównej, wykonaj następujące czynności: </p> <blockquote><p> 1.  Naciśnij przycisk <strong> Okna </strong> <img src=\"images/image_thumb8_thumb_thumb-904.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. Wpisz: <strong> devmgmt.msc </strong> &amp; Kliknij <strong> dobrze </strong> aby otworzyć „Menedżera urządzeń” <strong> . </strong></p></blockquote> <p><img src=\"images/image_thumb-1-166.png\" alt=\"device manager\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> </p> <p> 3. W Menedżerze urządzeń rozwiń <strong> Karty sieciowe. <br> </strong> 4. Kliknij prawym przyciskiem myszy kartę sieciową i kliknij <strong> Uaktualnij sterownik </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-946.png\" alt=\"update driver\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Pozwól, aby system Windows automatycznie wyszukał sterownik aktualizacji dla karty sieciowej. * </p></blockquote> <p><strong> *Uwaga: </strong> Jeśli system Windows nie może znaleźć zaktualizowanego sterownika, użyj nazwy karty (np. „Karta sieciowa Broadcom 802.11g”) i wyszukaj zaktualizowany sterownik ręcznie. </p> <p><img src=\"images/image_thumb-6-471.png\" alt=\"search for drivers\" loading=\"lazy\"></p> <p> </p> <p> </p> <h2> Metoda 3. Tymczasowo wyłącz program antywirusowy lub zaporę. </h2> <p> Następną metodą rozwiązania problemu „Okres semaforowy wygasł&quot; jest tymczasowe wyłączenie Zapory systemu Windows i programu antywirusowego. Aby wyłączyć Zaporę systemu Windows: </p> <p> 1.  Naciśnij przycisk <strong> Okna </strong> <img src=\"images/image_thumb8_thumb_thumb-462.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. Wpisz: <strong> kontrola </strong> &amp; Kliknij <strong> dobrze </strong><strong> . </strong></p> <p><img src=\"images/image_thumb7-807.png\" alt=\"control panel command\" loading=\"lazy\"></p> <p> </p> <p> 3. Ustaw opcję „Wyświetl według:” na <strong> Małe ikony </strong> aby wyświetlić wszystkie elementy panelu sterowania. </p> <p> </p> <p><img src=\"images/image_thumb8-567.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Otwórz <strong> zapora systemu Windows </strong> (lub „Zapora Windows Defender” w systemie Windows 10). </p> <p><img src=\"images/image_thumb-7-921.png\" alt=\"disable firewall wiindows\" loading=\"lazy\"></p> <p> </p> <p> 5. Kliknij na <strong> Włącz lub wyłącz Zaporę systemu Windows </strong> . </p> <p><img src=\"images/image_thumb-8-655.png\" alt=\"turn off windows defender firewall\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Czek </strong> „ <strong> Wyłącz Zaporę systemu Windows (niezalecane) </strong> &quot; i kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-9-907.png\" alt=\"turn off windows firewall\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Uruchom ponownie </strong> komputera, a następnie skopiuj pliki. * </p> <p> * Uwaga:  po skopiowaniu plików wykonaj powyższe kroki, aby ponownie włączyć Zaporę systemu Windows. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}