{"title":"NAPRAW: Ochrona przed wirusami i zagrożeniami jest zarządzana przez Twoją organizację w systemie Windows 10. (rozwiązany)","content":"<p> Ten samouczek zawiera instrukcje dotyczące rozwiązania następującego problemu w programie Windows Defender Security Center: „Twoja ochrona przed wirusami i zagrożeniami jest zarządzana przez Twoją organizację” w systemie Windows 10. </p> <p> Komunikaty Windows Defender (błędy): „Twoja ochrona przed wirusami i zagrożeniami jest zarządzana przez Twoją organizację”, „Niektóre ustawienia są zarządzane przez Twoją organizację” i <br> „Ochrona w czasie rzeczywistym jest zarządzana przez administratora” często pojawia się na komputerach firmowych, na których ochroną antywirusową zarządza administrator domeny. Jeśli komputer nie należy do domeny, powyższe błędy pojawiają się po zainstalowaniu programu antywirusowego innej firmy lub po ataku wirusa. </p> <p><img src=\"images/image_thumb-25-853.png\" alt=\"FIX: Virus & Threat Protection is Managed by your Organization - Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Jak naprawić: Twoja ochrona przed wirusami i zagrożeniami jest zarządzana przez Twoją organizację w systemie Windows 10. </h4> <h6> Krok 1. Odinstaluj wszelkie inne programy antywirusowe firm innych niż Microsoft. </h6> <p> Pierwszym krokiem do rozwiązania błędu programu Windows Defender „Ochrona przed wirusami i zagrożeniami zarządza Twoja organizacja” jest odinstalowanie z systemu wszelkich innych programów antywirusowych innych firm (np. Avast, MacAfee, MalwareBytes itp.). </p> <p> </p> <h6> Krok 2. Przeskanuj system w poszukiwaniu wirusów i złośliwego oprogramowania. </h6> <p> Drugim krokiem do rozwiązania błędu programu Windows Defender „Niektóre ustawienia są zarządzane przez Twoją organizację” jest upewnienie się, że Twój system jest wolny od wirusów/złośliwego oprogramowania. W tym celu postępuj zgodnie z instrukcjami w tym przewodniku: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak skanować komputer w poszukiwaniu wirusów i innych złośliwych programów. </a></p> <p> </p> <h6> Krok 3. Przywróć ustawienia Windows Defender do wartości domyślnych. </h6> <p> Kontynuuj i włącz Ochronę w czasie rzeczywistym w programie Windows Defender, korzystając z jednej z poniższych metod: </p> <h4> Metoda 1. Włącz ochronę antywirusową Defender w rejestrze. </h4> <p> 1. Otwórz <strong> Edytor rejestru </strong> : Aby to zrobić: </p> <ul> <li> Naciśnij jednocześnie Windows <img src=\"images/image_thumb36-979.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. </li> <li> Rodzaj <strong> regedit </strong> &amp; naciśnij <strong> Wchodzić. </strong></li> </ul> <p><img src=\"images/image_thumb7-229.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2. Przejdź do następującego klawisza w lewym okienku: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE OPROGRAMOWANIE Zasady Microsoft Microsoft Windows Defender </strong></li> </ul> <p> 3. W prawym okienku kliknij dwukrotnie na <strong> Wyłącz oprogramowanie antyszpiegowskie </strong> Wartość REG_DWORD i zmień dane wartości z 1 na <strong> 0. </strong></p> <p><img src=\"images/image_thumb-26-852.png\" alt=\"enable defender antivirus protection - registry\" loading=\"lazy\"></p> <p> </p> <p> 4. Kliknij <strong> dobrze </strong> i <strong> blisko </strong> Edytor rejestru. <br> 5. <strong> Uruchom ponownie </strong> Twój komputer. Zwykle po ponownym uruchomieniu program Windows Defender powinien być włączony. * </p> <p> * Uwaga: jeśli po ponownym uruchomieniu komputera program Windows Defender jest nadal wyłączony, ze statusem „Twoja ochrona przed wirusami i zagrożeniami jest zarządzana przez Twoją organizację”, kontynuuj i zmodyfikuj <br> <strong> Początek </strong> Wartość REG_DWORD od 4 do <strong> 2 </strong> w następujących kluczach rejestru: </p> <ul> <li> HKEY_LOCAL_MACHINE SYSTEM CurrentControlSet Usługi SecurityHealthService </li> <li> HKEY_LOCAL_MACHINE SYSTEM CurrentControlSet Usługi WinDefend </li> <li> HKEY_LOCAL_MACHINE SYSTEM CurrentControlSet Usługi WdNisSvc </li> <li> HKEY_LOCAL_MACHINE SYSTEM CurrentControlSet Usługi MpsSvc </li> </ul> <p> </p> <h5> Metoda 2. Usuń <strong> Wyłącz oprogramowanie antyszpiegowskie </strong> Wartość rejestru z wiersza polecenia. </h5> <p> 1. Otwórz <strong> Wiersz polecenia jako administrator </strong> . Aby to zrobić: </p> <ul> <li> W polu wyszukiwania wpisz: <strong> wiersz polecenia </strong> lub <strong> cmd </strong></li> <li> Kliknij prawym przyciskiem na <strong> cmd </strong> lub <strong> Wiersz polecenia </strong> wynik i wybierz <strong> Uruchom jako administrator. </strong></li> </ul> <p><img src=\"images/image_thumb-10-243.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. W wierszu polecenia wpisz (Kopiuj/Wklej) następujące polecenie i naciśnij <strong> Wchodzić: </strong></p> <ul> <li> REG DELETE &quot;HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows Defender&quot; /v DisableAntiSpyware </li> </ul> <p> 3. Następnie naciśnij <strong> Tak </strong> aby potwierdzić twoją decyzję. </p> <p><img src=\"images/image_thumb-28-288.png\" alt=\"enable defender antivirus protection command\" loading=\"lazy\"></p> <p> </p> <p> 4. Zamknij wiersz polecenia i <strong> uruchom ponownie </strong> Twój komputer. </p> <p> </p> <h5> Metoda 3. Włącz ochronę w czasie rzeczywistym Windows Defender w zasadach grupy. </h5> <p> Jeśli posiadasz wersję Windows 10 Professional, Enterprise lub Education, kontynuuj i włącz ochronę antywirusową Windows Defender w zasadach grupy. Aby to zrobić: </p> <p> 1. Naciśnij jednocześnie Windows <img src=\"images/image_thumb36-102.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. Typ <strong> gpedit.msc </strong> &amp; Naciśnij <strong> Wchodzić. </strong></p> <p><img src=\"images/image_thumb-78-343.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. W lewym okienku przejdź do: </p> <ul> <li><strong> Konfiguracja komputera\\Szablony administracyjne\\Składniki systemu Windows\\Program antywirusowy Windows Defender </strong></li> </ul> <p> 4. W prawym okienku otwórz <strong> Wyłącz program antywirusowy Windows Defender </strong> oprawa. </p> <p><img src=\"images/image14_thumb-207.png\" alt=\"turn on defender antivirus protection- group policy\" loading=\"lazy\"></p> <p> </p> <p> 5. Ustaw ustawienie zasad na <strong> Nie skonfigurowane </strong> lub <strong> Niepełnosprawny </strong> aby włączyć ochronę w czasie rzeczywistym i kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-29-337.png\" alt=\"enable defender antivirus protection group policy\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Uruchom ponownie </strong> komputer. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym problemie. </p>"}