{"title":"NAPRAW: nie można uzyskać dostępu do tej witryny w Chrome (rozwiązane)","content":"<p> Ten samouczek zawiera instrukcje naprawy błędu Chrome: „Nie można uzyskać dostępu do tej witryny”. Błąd „Nie można uzyskać dostępu do tej witryny” w Chrome oznacza, że ​​Twoja przeglądarka nie może nawiązać połączenia z witryną, do której próbujesz uzyskać dostęp, ponieważ połączenie internetowe zostało utracone lub witryna, do której chcesz uzyskać dostęp, nie istnieje. </p> <p> </p> <p><img src=\"images/image_thumb-14-568.png\" alt=\"FIX: This site can't be reached in Chrome \" loading=\"lazy\"></p> <p> Aby rozwiązać błąd Chrome „Nie można uzyskać dostępu do tej witryny”, postępuj zgodnie z poniższymi instrukcjami: </p> <h4> Jak naprawić błąd Google Chrome: Nie można uzyskać dostępu do tej witryny. </h4> <p><strong> Rada: </strong> Zanim przejdziesz do poniższych metod, zastosuj następujące kroki: <br> 1. Upewnij się, że poprawnie wpisujesz adres strony. <br> 2. Uruchom ponownie router internetowy. <br> 3. Spróbuj odwiedzić inne strony internetowe, aby upewnić się, że połączenie internetowe działa. <br> 4. Jeśli posiadasz inny komputer/urządzenie na swoim miejscu, spróbuj odwiedzić witrynę, na której pojawia się błąd „Ta witryna jest nieosiągalna”, aby upewnić się, że witryna, którą próbujesz odwiedzić, nie jest zablokowana od dostawcy usług internetowych. <br> 5. Jeśli masz skonfigurowane połączenie VPN, odłącz się od niego. </p> <p> </p> <h6> Metoda 1. Zmień ustawienia DNS. </h6> <p> Następną metodą rozwiązania błędu przeglądarki Google Chrome „Nie można uzyskać dostępu do tej witryny” jest zmiana ustawień DNS i użycie publicznych serwerów DNS Google. Aby to zrobić: </p> <p> 1. <strong> Kliknij prawym przyciskiem myszy </strong> na aktywnej ikonie sieci na pasku zadań (lub przejdź do Panelu sterowania Windows) i kliknij <strong> Centrum sieci i udostępniania </strong></p> <p><img src=\"images/image_thumb14_thumb-1-913.png\" alt=\"image_thumb[14]\" loading=\"lazy\"></p> <p> </p> <p> 2. Wybierz aktywną kartę sieciową, a następnie kliknij <strong> Zmień opcje adaptera. </strong></p> <p><img src=\"images/image_thumb17_thumb-1-994.png\" alt=\"FIX CHROME ERR_CONNECTION_CLOSED\" loading=\"lazy\"></p> <p> 3. Kliknij prawym przyciskiem myszy aktywną kartę sieciową i wybierz <strong> Nieruchomości </strong> . <br> 4. Wybierz <strong> „Protokół internetowy w wersji 4 (TCP/IPv4) </strong> &#39; i kliknij <strong> Nieruchomości </strong></p> <p><img src=\"images/image_thumb18_thumb-1-801.png\" alt=\"image_thumb[18]\" loading=\"lazy\"></p> <p> 5a. Sprawdź &quot; <strong> Użyj następujących adresów serwerów DNS: </strong> &quot; Przycisk radiowy. <br> 5b. Wpisz następujące adresy serwerów DNS (publiczne serwery DNS firmy Google) i kliknij <strong> DOBRZE. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> <p><img src=\"images/image_thumb20_thumb-1-963.png\" alt=\"image_thumb[20]\" loading=\"lazy\"></p> <p> 6. <strong> Uruchom ponownie </strong> Twój komputer. </p> <p> </p> <h6> Metoda 2. Zresetuj ustawienia TCP/IP i WINSOCK. </h6> <p> 1. Otwórz wiersz polecenia w trybie administracyjnym. Aby to zrobić: </p> <blockquote><p> 1. W polu wyszukiwania wpisz <strong> cmd </strong> lub <strong> wiersz polecenia </strong></p> <p> 2. Kliknij prawym przyciskiem na <strong> Wiersz polecenia </strong> wynik i wybierz <strong> Uruchom jako administrator. </strong></p></blockquote> <p><img src=\"images/image_thumb-38-528.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. W wierszu poleceń wpisz następujące polecenie i naciśnij <strong> Wchodzić </strong> . </p> <ul> <li> ipconfig /release </li> </ul> <p><img src=\"images/image_thumb11_thumb-364.png\" alt=\"image_thumb[11]\" loading=\"lazy\"></p> <p> </p> <p> 3. Teraz wpisz następujące polecenia w kolejności (naciśnij <strong> Wchodzić </strong> po każdym poleceniu).: </p> <ul> <li> ipconfig /flushdns </li> <li> ipconfig /renew </li> <li> reset netsh winsockock </li> </ul> <p><img src=\"images/image_thumb12_thumb-449.png\" alt=\"image_thumb[12]\" loading=\"lazy\"></p> <p> 3. <strong> Uruchom ponownie </strong> Twój komputer. </p> <p> </p> <h6> Metoda 3. Zresetuj ustawienia Chrome. </h6> <p> Aby zresetować Chrome do domyślnych zainstalowanych ustawień: </p> <p> 1. Kliknij menu Chrome <img src=\"images/image_thumb_thumb_thumb_thumb-979.png\" alt=\"image_thumb_thumb_thumb\" loading=\"lazy\"> w prawym górnym rogu) i wybierz <strong> Ustawienia </strong> . </p> <p><img src=\"images/image_thumb31-186.png\" alt=\"chrome-options\" loading=\"lazy\"></p> <p> 2. W <strong> Ustawienia </strong> stronę, przewiń w dół i kliknij, aby <strong> Pokaż ustawienia zaawansowane. </strong></p> <p><img src=\"images/image_thumb2_thumb-809.png\" alt=\"FIX ERR_CONNECTION_CLOSED CHROME\" loading=\"lazy\"></p> <p> </p> <p> 3. Na końcu strony kliknij <strong> Przywróć ustawienia do ich oryginalnych wartości domyślnych </strong> . </p> <p><img src=\"images/image_thumb5_thumb-192.png\" alt=\"image_thumb[5]\" loading=\"lazy\"></p> <p> 4. Na koniec kliknij <strong> Resetowanie ustawień </strong> . </p> <p><img src=\"images/image_thumb6_thumb-812.png\" alt=\"CHROME ERR_CONNECTION_CLOSED - FIX\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Uruchom ponownie </strong> Chrom. </p> <p> </p> <h6> Metoda 4. Przeskanuj komputer w poszukiwaniu złośliwego oprogramowania i wirusów. </h6> <p> Ostatnią metodą naprawienia błędu „Nie można uzyskać dostępu do tej witryny” w Chrome jest upewnienie się, że system jest wolny od wirusów/złośliwego oprogramowania. W tym celu postępuj zgodnie z instrukcjami w tym przewodniku: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak skanować komputer w poszukiwaniu wirusów i innych złośliwych programów. </a></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}