{"title":"NAPRAW: Rozładowanie baterii w systemie Windows 10 (rozwiązane)","content":"<p> W systemie Windows 10 wielu użytkowników skarży się, że bateria ich laptopa szybko się wyczerpuje, nawet przy niskim zużyciu lub nawet przy pełnym wyłączeniu. Ten problem „rozładowania baterii” w systemie Windows 10 ma miejsce z dwóch podstawowych powodów. Pierwszym powodem jest to, że system Windows 10 ładuje zbyt wiele aplikacji działających w tle, które zużywają energię baterii, nawet jeśli nie są używane. </p> <p> Kolejnym powodem, który powoduje rozładowanie baterii, nawet przy całkowitym wyłączeniu, jest funkcja „Szybkiego uruchamiania”. Windows 10 (i Windows 8/8.1) ma domyślnie włączoną funkcję „Szybkiego uruchamiania”, która umożliwia szybsze uruchamianie i uruchamianie systemu. W rzeczywistości, gdy włączone jest „Szybkie uruchamianie”, system Windows 10 nie wykonuje pełnego zamknięcia systemu i wznawia działanie ze stanu hibernacji. </p> <p> W tym samouczku znajdziesz instrukcje, aby zapobiec wyczerpaniu baterii przez system Windows 10. </p> <h4> Jak naprawić problem rozładowania baterii w systemie Windows 10. </h4> <p> </p> <h6> Krok 1. Zapobiegaj uruchamianiu aplikacji w tle. </h6> <p> Pierwszym krokiem, aby rozwiązać problem rozładowania baterii w systemie Windows 10, jest unikanie uruchamiania aplikacji w tle. Aby wyłączyć aplikacje działające w tle: </p> <p> 1. Przejdź do <strong> Początek </strong> -&gt; <strong> Ustawienia </strong> -&gt; <strong> Prywatność </strong> . <br> 2. Wybierz <strong> Aplikacje w tle </strong> po lewej, a następnie po prawej stronie, umieść „ <strong> Pozwól aplikacjom działać w tle&quot; </strong> Przełącz na <strong> Poza, </strong> lub indywidualnie wybierz aplikacje, których nie chcesz uruchamiać w tle i wyłącz je. </p> <p><img src=\"images/image_thumb-8-676.png\" alt=\"Prevent Apps from Running in the Background - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Krok 2. Włącz oszczędzanie baterii. </h6> <p> Następnym krokiem jest włączenie oszczędzania baterii w celu przedłużenia żywotności baterii poprzez ograniczenie aktywności w tle. </p> <p> 1. Przejdź do <strong> Początek </strong> -&gt; <strong> Ustawienia </strong> -&gt; <strong> System </strong> . <br> 2. W <strong> Bateria </strong> opcje: </p> <blockquote> <p> za. Kliknij „Sprawdź, które aplikacje wpływają na żywotność baterii”, aby sprawdzić zużycie baterii w otwartych aplikacjach. <br> b. <strong> Czek </strong> „ <strong> Automatycznie włącz oszczędzanie baterii, jeśli moja bateria ulegnie awarii poniżej” </strong> pole wyboru i przesuń suwak do odpowiedniej pozycji. <br> do. Dodatkowo wybierz „Obniż jasność ekranu w trybie oszczędzania baterii. </p> </blockquote> <p><img src=\"images/image_thumb-9-289.png\" alt=\"turn on battery saver Windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Krok 3. Wyłącz szybkie uruchamianie. </h6> <p> Następnym krokiem jest wymuszenie pełnego wyłączenia systemu Windows 10 poprzez wyłączenie funkcji szybkiego uruchamiania. </p> <p> 1. Przejdź do <strong> Początek </strong> -&gt; <strong> Ustawienia </strong> -&gt; <strong> System </strong> . <br> 2. W <strong> Moc </strong> opcje kliknij <strong> Dodatkowe ustawienia mocy. </strong></p> <p><img src=\"images/image_thumb-10-405.png\" alt=\"FIX Battery Drain in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Wybierz <strong> Wybierz, co robią przyciski zasilania </strong> po lewej. </p> <p><img src=\"images/image_thumb-11-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Następnie kliknij <strong> Zmień ustawienia, które są obecnie niedostępne </strong> . </p> <p><img src=\"images/image_thumb-12-235.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> Odznacz </strong> <strong> Włącz szybkie uruchamianie (zalecane) </strong> opcję i kliknij <strong> Zapisz zmiany. * </strong></p> <p> * Uwaga: Jeśli opcja szybkiego uruchamiania była już odznaczona, zaznacz ją i uruchom ponownie komputer. Po ponownym uruchomieniu usuń zaznaczenie i ponownie uruchom komputer. </p> <p><img src=\"images/image_thumb-13-410.png\" alt=\"Turn Off Fast Startup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Uruchom ponownie </strong> Twój komputer. </p> <h6></h6> <h6> Krok 4. Wyłącz hibernację. </h6> <p> „Hibernacja” to funkcja zasilania, która zużywa mniej energii niż uśpienie, a po ponownym uruchomieniu komputera wracasz do miejsca, w którym przerwałeś. W niektórych przypadkach funkcja hibernacji powoduje, że komputer z systemem Windows 10 nie wyłącza się całkowicie. Aby wyłączyć hibernację: </p> <p> </p> <p> 1. W polu wyszukiwania wpisz: <strong> wiersz polecenia </strong> lub <strong> cmd <br> </strong> 2.  Kliknij prawym przyciskiem myszy na <strong> Wiersz polecenia i wybierz Uruchom jako administrator </strong></p> <p><img src=\"images/image_thumb-14-379.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. W wierszu poleceń wydaj następujące polecenie i naciśnij <strong> Wchodzić. </strong></p> <ul> <li><strong> powercfg -h wyłączone </strong></li> </ul> <p><img src=\"images/image_thumb-15-234.png\" alt=\"Disable Hibernate Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. <strong> Uruchom ponownie </strong> Twój komputer. * </p> <p> * Uwaga: jeśli chcesz ponownie włączyć funkcję „Hibernacja”, po prostu wpisz to polecenie w administracyjnym wierszu polecenia: </p> <ul> <li> <ul> <li> powercfg -h wyłączone </li> </ul> </li> </ul> <p> </p> <h6> Krok 5. Zmodyfikuj ustawienia zasilania na karcie sieciowej. </h6> <p> Następną metodą rozwiązania problemu rozładowania baterii w systemie Windows 10 jest modyfikacja ustawień zasilania na kartach sieciowych. </p> <p> 1. Otwórz <strong> Menadżer urządzeń </strong> . <br> 2. Rozwiń <strong> Karty sieciowe </strong> . <br> 3. Kliknij prawym przyciskiem na zainstalowaną kartę sieciową i wybierz <strong> Nieruchomości </strong> . <br> 3. Wybierz <strong> Zarządzanie energią </strong> patka. <br> 4. <strong> Odznacz </strong> <strong> „Zezwól temu urządzeniu na wybudzanie komputera” </strong> &#39; pole wyboru i kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-7-574.png\" alt=\"modify power settings\" loading=\"lazy\"></p> <h6></h6> <h6> Krok 6. Wycofaj sterownik interfejsu Intel Management Engine. </h6> <p> Jeśli problem rozładowania baterii pojawia się po zainstalowaniu aktualizacji systemu Windows 10, kontynuuj i wycofaj sterownik interfejsu Intel Management Engine. Aby to zrobić: </p> <p> 1.  Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-592.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. Wpisz: <strong> devmgmt.msc </strong> &amp; Kliknij <strong> dobrze </strong> . <br> 3. Rozwiń <strong> Urządzenia systemowe </strong> . <br> 4. Kliknij prawym przyciskiem myszy <strong> Interfejs Intel Management Engine </strong> i wybierz <strong> Nieruchomości </strong> . </p> <p><img src=\"images/image_thumb-5-532.png\" alt=\"device properties\" loading=\"lazy\"></p> <p> </p> <p> 5. Wybierz kartę Sterownik i kliknij <strong> Przywróć sterownik </strong> . * </p> <p> </p> <p> * Jeśli <strong> Przywróć sterownik </strong> jest wyszarzony, a następnie przejdź do witryny pomocy technicznej producenta laptopa lub płyty głównej, aby pobrać i zainstalować starszą wersję sterownika dla interfejsu Intel Management Engine. </p> <p><img src=\"images/image_thumb-6-551.png\" alt=\"roll back driver\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Uruchom ponownie </strong> Twój komputer. </p> <h6> Krok 7. Inne sugestie dotyczące rozwiązania problemu rozładowania baterii. </h6> <p> 1. Wymień ładowarkę laptopa i zawsze używaj markowej ładowarki, aby przedłużyć żywotność baterii. <br> 2. Jeśli bateria twojego laptopa jest stara, prawdopodobnie jej pojemność spadła i należy ją wymienić. Aby zdiagnozować stan baterii, użyj <a href=\"http://www.nirsoft.net/utils/battery_information_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> Widok informacji o baterii </a> użyteczność. </p> <p><img src=\"images/image_thumb-16-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym problemie. </p>"}