{"title":"NAPRAW: Uruchamianie skryptów jest wyłączone w tym systemie w systemie Windows 10 (rozwiązany)","content":"<p> Jeśli próbujesz uruchomić skrypt w Windows 10 PowerShell i pojawia się komunikat o błędzie „Nie można załadować, ponieważ uruchamianie skryptów jest wyłączone w tym systemie”, kontynuuj czytanie poniżej, aby rozwiązać problem. </p> <p><img src=\"images/image_thumb-8-134.png\" alt=\"FIX: script cannot be loaded because is disabled on Windows 10\" loading=\"lazy\"></p> <p> </p> <h2> Jak naprawić: Nie można uruchomić skryptu PowerShell, ponieważ zasady bezpieczeństwa uniemożliwiają uruchamianie skryptów w systemie Windows 10. </h2> <p> Błąd programu PowerShell „Nie można załadować %ScriptName%.ps1, ponieważ jest wyłączony w tym systemie”, pojawia się z powodu zasad zabezpieczeń, które uniemożliwiają uruchamianie skryptów. Aby usunąć ograniczenie i umożliwić uruchamianie skryptów w systemie Windows 10, wykonaj następujące czynności: </p> <p> 1. Otwórz <strong> PowerShell jako administrator </strong> . Aby to zrobić: </p> <blockquote><p> 1. Naciśnij <strong> Okna <img src=\"images/image_thumb-97-958.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> klawisze, aby otworzyć okno poleceń „Uruchom” <strong><br> </strong> 2. Typ <strong> powershell </strong> a następnie naciśnij <strong> CTRL </strong> + <strong> ZMIANA </strong> + <strong> WCHODZIĆ. </strong></p></blockquote> <p><img src=\"images/image_thumb-41-395.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. W PowerShell skopiuj/wklej poniższe polecenie i naciśnij <strong> Wchodzić </strong> : </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Unrestricted </li> </ul> <p> 3. Naciśnij <strong> Tak </strong> i uderzył <strong> Wchodzić </strong> komunikat ostrzegawczy dotyczący zasad wykonywania, aby zaakceptować zmianę. </p> <p><img src=\"images/image_thumb-9-581.png\" alt=\"Enable Running Scripts on Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Po zakończeniu zmiany polityki, <strong> blisko </strong> okno PowerShell. </p> <p> 5. Teraz uruchom skrypt, który spowodował błąd „Skrypty są wyłączone” za pomocą <strong> Administrator </strong> przywileje. Błąd powinien teraz zniknąć. * </p> <blockquote><p> * Uwaga: jeśli nadal pojawia się błąd „Skrypty są wyłączone w tym systemie”, wydaj jedno z następujących poleceń i spróbuj ponownie uruchomić skrypt: </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy RemoteSigned </li> <li> set-executionpolicy zdalna podpisana </li> </ul> </blockquote> <p> 6. Na koniec powróć do poprzedniego ustawienia zasad wykonywania PowerShell (ograniczenie), uruchamiając to polecenie w PowerShell (Admin): * </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Restricted </li> </ul> <p> * Uwaga: po uruchomieniu powyższego polecenia otrzymasz komunikat ostrzegawczy wyjaśniający zagrożenia bezpieczeństwa związane ze zmianą zasad wykonywania. naciśnij <strong> Tak </strong> , a następnie naciśnij <strong> Wchodzić </strong> aby zaakceptować zmianę i powrócić do poprzedniego ustawienia zasad. </p> <p><img src=\"images/image_thumb-10-246.png\" alt=\"Disable running scripts windows 10\" loading=\"lazy\"></p> <p> 7. Zamknij okno PowerShell i gotowe! </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}