{"title":"NAPRAW: Komputer nie mógł połączyć się z inną sesją konsoli, ponieważ trwa już sesja konsoli. (Rozwiązany)","content":"<p> Na komputerze z systemem Windows w programie Podłączanie pulpitu zdalnego pojawia się następujący błąd: „Twój komputer nie może połączyć się z sesją konsoli na komputerze zdalnym, ponieważ trwa już sesja konsoli”. </p> <p> </p> <p><img src=\"images/image_thumb-3-627.png\" alt=\"Your computer could no connect to console session on the remote computer because you already have a console session in progress.\" loading=\"lazy\"></p> <p> </p> <p> Ten samouczek zawiera instrukcje dotyczące rozwiązania następującego błędu Podłączania pulpitu zdalnego: „Twój komputer nie może połączyć się z sesją konsoli na komputerze zdalnym, ponieważ masz już sesję konsoli w toku”. </p> <h4> Jak naprawić: Podłączanie pulpitu zdalnego nie może się połączyć, ponieważ masz już sesję konsoli w toku. </h4> <p> Błąd „Twój komputer nie mógł połączyć się z sesją konsoli na komputerze zdalnym, ponieważ masz już sesję konsoli w toku”, jest spowodowany tym, że jedna z kart sieciowych na komputerze (z RDP) ma ten sam adres IP co komputer z którym próbujesz się połączyć za pośrednictwem zdalnego pulpitu. </p> <p> Na przykład: jeśli zdalny komputer ma adres IP: „192.168.1.157”, wykonaj następujące czynności: </p> <p> 1. Otwórz <strong> Wiersz polecenia jako administrator </strong> na komputerze (z RDP). <br> 2. Wydaj następujące polecenie, aby wyświetlić przypisane adresy IPv4 na swoim komputerze. </p> <ul> <li><strong> ipconfig </strong></li> </ul> <p> </p> <p> 3. Teraz zlokalizuj, która karta sieciowa na komputerze lokalnym (z RDP) ma ten sam adres IP co komputer zdalny (z RDP). <br> 4. Gdy znajdziesz, która karta LAN na komputerze lokalnym ma ten sam adres IP co komputer zdalny, kontynuuj i zmień adres IP tej karty na inny. * </p> <p> na przykład W tym przykładzie adres IP komputera zdalnego to: „192.168.1.157”, więc musimy zmienić adres IP karty Ethernet (na komputerze lokalnym) na inny: np. na: „192.168.1.160”. </p> <p><img src=\"images/image_thumb-5-946.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> * Uwaga: Jeśli adres IP w sieci lokalnej jest przypisany przez serwer DHCP, masz następujące możliwości ominięcia problemu: </p> <blockquote><p> za. Aby ręcznie określić inny statyczny adres IP. <br> b. Aby zrestartować router (serwer DHCP), aby „pobrać” inny adres IP z serwera DHCP. <br> do. Aby skonfigurować serwer DHCP (np. na routerze), aby nadać adresy IP zakresowi, który nie obejmuje adresu IP zdalnego komputera. (np. „192.168.1.200-192.168.1.250” </p></blockquote> <p> </p> <p> 5. Po zmianie adresu IP na komputerze lokalnym (z RDP), otwórz połączenie Pulpit zdalny i spróbuj połączyć się z komputerem zdalnym. Błąd „Twój komputer nie mógł połączyć się z inną sesją konsoli, ponieważ masz już sesję konsoli w toku” powinien zostać rozwiązany. </p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? </p> <p> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}