{"title":"NAPRAW: Szybki dostęp nie działa i nie można pisać w polu wyszukiwania w systemie Windows 10 (rozwiązany)","content":"<p> Gdyby <strong> Szybki dostęp </strong> s menu nie działa w systemie Windows 10, a następnie przeczytaj ten samouczek, aby rozwiązać problem. Opcja Szybki dostęp w Eksploratorze plików umożliwia użytkownikowi łatwe nawigowanie do ostatnio otwieranych plików i folderów. Ale czasami, zwłaszcza gdy wcześniej otworzyłeś plik / folder z zewnętrznego dysku (np. Dysku USB), który jest teraz offline, Szybki dostęp nie pokazuje ostatnich plików lub nie możesz wpisać w pasku „Szukaj”. </p> <p><img src=\"images/image_thumb-2-490.png\" alt=\"FIX: Quick Access Not Working in Windows 10 (Solved)\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Jak naprawić: Funkcja szybkiego dostępu i funkcja wyszukiwania nie działają w systemie Windows 10. </h4> <p> </p> <h6> Metoda 1. Uruchom ponownie Eksploratora Windows. </h6> <p> Pierwszą metodą rozwiązania problemu szybkiego dostępu jest ponowne uruchomienie procesu Eksploratora Windows z Menedżera zadań. Aby to zrobić: </p> <p> 1. Naciśnij <strong> Ctrl </strong> + <strong> Alt </strong> + <strong> Del </strong> otworzyć <strong> Menadżer zadań </strong> . <br> 2. W <strong> Procesy </strong> * zakładka, zaznacz <strong> Eksplorator Windows </strong> proces i kliknij <strong> Uruchom ponownie </strong> . </p> <p> * Uwaga: jeśli nie widzisz zakładki „Proces”, kliknij <strong> Więcej szczegółów. </strong></p> <p><img src=\"images/image_thumb-951.png\" alt=\"restart windows explorer\" loading=\"lazy\"></p> <p><strong> </strong></p> <h6> Metoda 2. Włącz Szybki dostęp do ostatnich elementów i Wyczyść historię Eksploratora plików. </h6> <p> 1. Otwórz <strong> Opcje folderu. </strong> Aby to zrobić, otwórz Eksploratora Windows i z menu przejdź do <strong> Widok </strong> &gt; <strong> Opcje </strong> . </p> <p><img src=\"images/image_thumb-3-949.png\" alt=\"enable quick access windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. W <strong> Generał </strong> upewnij się, że zaznaczone są następujące pola wyboru. </p> <ul> <li><strong> Pokaż ostatnio używane pliki w Szybkim dostępie </strong></li> <li><strong> Pokaż często używane foldery w Szybkim dostępie. </strong></li> </ul> <p> 3. Następnie kliknij <strong> Jasny </strong> przycisk, aby wyczyścić historię Eksploratora plików. </p> <p><img src=\"images/image_thumb-4-329.png\" alt=\"clear quick access history\" loading=\"lazy\"></p> <p> </p> <p> 3. Kliknij <strong> dobrze </strong> i sprawdź, czy działa szybki dostęp i funkcja wyszukiwania. Jeśli nie, uruchom ponownie „Eksplorator plików” za pomocą Menedżera zadań (patrz metoda-1 powyżej) i sprawdź ponownie. Jeśli problem będzie się powtarzał, przejdź do następnej metody. </p> <h6> Metoda 3. Wyczyść historię ostatnich elementów ręcznie. </h6> <p> Kolejną metodą rozwiązywania problemów z ostatnimi elementami szybkiego dostępu lub funkcją „Wyszukaj” w systemie Windows 10 jest ręczne usunięcie historii ostatnich elementów. Aby to zrobić: </p> <p> 1. Otwórz Eksploratora Windows. <br> 2. Skopiuj i wklej następujący adres w pasku adresu i naciśnij <strong> Wchodzić </strong> : </p> <p> %AppData%\\Microsoft\\Windows\\Recent\\AutomaticDestinations </p> <p><img src=\"images/image_thumb-1-410.png\" alt=\"clear recent items windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3.  Naciśnij <strong> Ctrl </strong> + <strong> ZA </strong> (aby zaznaczyć wszystkie elementy) i naciśnij <strong> Kasować </strong> (lub kliknij prawym przyciskiem myszy &gt; <strong> Kasować </strong> ). </p> <p><img src=\"images/image_thumb-5-834.png\" alt=\"Delete Quick Access History\" loading=\"lazy\"></p> <p> </p> <p> 4. Następnie skopiuj/wklej następujący adres w pasku adresu i naciśnij <strong> Wchodzić </strong> . </p> <p> %AppData%\\Microsoft\\Windows\\Recent\\CustomDestinations </p> <p><img src=\"images/image_thumb-6-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Naciśnij <strong> Ctrl </strong> + <strong> ZA </strong> ponownie (aby zaznaczyć wszystkie elementy) i naciśnij <strong> Kasować. <br> </strong> 6. Teraz naciśnij <strong> Ctrl + Alt + Del </strong> otworzyć <strong> Menadżer zadań </strong> . <br> 7. W <strong> Procesy </strong> zaznacz kartę, <strong> Eksplorator Windows </strong> proces i kliknij <strong> Uruchom ponownie </strong> . <br> 8. Zwykle problemy z funkcją „Szybki dostęp” lub funkcją „Szukaj” muszą zostać rozwiązane. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}