{"title":"NAPRAW: Nie ma wystarczającej ilości miejsca do przetworzenia tego polecenia — nie można uzyskać dostępu do folderów współdzielonych lub użyć pulpitu zdalnego (rozwiązane)","content":"<p> Podczas próby uzyskania dostępu do folderów współdzielonych na innej stacji roboczej z systemem Windows lub na serwerze 2003, 2008, 2012 lub 2016 może pojawić się błąd „Za mało miejsca do przetworzenia tego polecenia” lub podczas korzystania z usługi Podłączanie pulpitu zdalnego (RDP ), aby połączyć się z innym komputerem z systemem Windows (stacja robocza lub serwer). </p> <p><img src=\"images/image_thumb-127.png\" alt=\"Not enough storage is available to process this command\" loading=\"lazy\"></p> <p> </p> <p> Ten samouczek zawiera instrukcje rozwiązywania następujących problemów, które mogą pojawić się we wszystkich wersjach systemu Windows (Windows 10, 8/8.1, 7, Vista, XP i Windows Server 2003, 2008, 2012 lub 2016): </p> <p> 1. Podczas próby uzyskania dostępu do folderów udostępnionych na komputerze serwera pojawia się komunikat o błędzie: „ <em> Udostępniony folder </em> nie jest dostępne. Możesz nie mieć uprawnień do korzystania z tego zasobu sieciowego. Skontaktuj się z administratorem tego serwera, aby dowiedzieć się, czy masz uprawnienia dostępu. Za mało dostępnej pamięci serwera, aby przetworzyć to polecenie”. </p> <p> 2. Podczas próby zdalnego połączenia (przy użyciu protokołu RDP) z innym komputerem z systemem Windows pojawia się komunikat o błędzie: „System nie może Cię zalogować z następującego powodu. Brak wystarczającej ilości pamięci do przetworzenia tego polecenia”. </p> <h4> JAK NAPRAWIĆ: Komunikat o błędzie „Za mało miejsca do przetworzenia tego polecenia” na pulpicie zdalnym (RDP) lub podczas próby uzyskania dostępu do folderów współdzielonych. </h4> <p> Na komputerze „serwer” z systemem Windows, do którego chcesz uzyskać dostęp do jego plików lub połączyć się zdalnie: </p> <p><strong> 1. </strong> Naciśnij &quot; <strong> Okna </strong> ” + “ <strong> R </strong> ” klawisze do otwierania <em> BIEGAĆ </em> okno. <br> <strong> 2. </strong> Rodzaj <strong> regedit </strong> i naciśnij <strong> Wchodzić </strong> aby otworzyć Edytor rejestru. </p> <p><img src=\"images/image_thumb7-649.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Następnie przejdź do tego klucza: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE SYSTEM CurrentControlSet Usługi LanmanServer Parametry </strong></li> </ul> <p><img src=\"images/image_thumb-1-198.png\" alt=\"fix Not enough storage - cannot access shared items\" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> W prawym okienku kliknij dwukrotnie, aby otworzyć <strong> Rozmiar stosu IRP </strong> wartość <strong> . * </strong></p> <p><strong> * Uwaga: </strong> Jeśli nie widzisz <strong> Rozmiar stosu IRP </strong> wartość, to: </p> <p> </p> <blockquote><p> 1. Kliknij prawym przyciskiem myszy puste miejsce (w prawym okienku), a następnie wybierz <strong> Nowy </strong> –&gt; <strong> Wartość DWORD (32-bitowa) </strong></p> <p><img src=\"images/image_thumb-2-236.png\" alt=\"fix Not enough storage using RDP (Remote Desktop)\" loading=\"lazy\"></p> </blockquote> <blockquote><p> 2. Nazwij nową wartość <strong> Rozmiar stosu IRP </strong> i uderzył <strong> Wchodzić. </strong></p></blockquote> <p><strong> 5. </strong> Wybierz <strong> Dziesiętny </strong> , zmień dane wartości na <strong> 50 </strong> i kliknij <strong> dobrze </strong> . * </p> <p> * Uwaga: Zakres (w postaci dziesiętnej) parametru wynosi od 1 do 50. </p> <p><img src=\"images/image_thumb-3-255.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 6. </strong> <strong> Blisko </strong> edytor rejestru i <strong> uruchom ponownie </strong> serwer. * </p> <p> * Ważna uwaga: Jeśli po ponownym uruchomieniu pojawi się ten sam komunikat o błędzie, podczas korzystania z Podłączania pulpitu zdalnego lub podczas próby uzyskania dostępu do udostępnionych plików na innym komputerze, zastosuj powyższą modyfikację rejestru również na swoim komputerze. </p> <p> To wszystko! Czy to zadziałało dla Ciebie? </p> <p> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}