{"title":"NAPRAW: Chrome zawsze otwieraj Przeglądaj jako gość - Przełącz opcje osoby podczas uruchamiania.","content":"<p> Samouczek zawiera instrukcje, jak uniemożliwić przeglądarce Chrome wyświetlanie okna „Przełącz osobę – Przeglądaj jako gość” podczas uruchamiania. Problem w szczegółach: Na komputerze z systemem Windows przeglądarka Google Chrome zawsze otwiera opcje „Przeglądaj jako gość” i „Dodaj osobę” przy starcie, a użytkownik musi zawsze wybrać swój profil, aby korzystać z przeglądarki Chrome. </p> <p><img src=\"images/image_thumb-26-805.png\" alt=\"FIX Remove Chrome Browse as Guest\" loading=\"lazy\"></p> <p> </p> <h4> Jak usunąć okno opcji „Przeglądarka jako gość – Dodaj osobę” podczas uruchamiania Chrome. </h4> <h6> Metoda 1. Sprawdź, czy Chrome jest ustawiony na Zawsze uruchamiaj się w trybie gościa. </h6> <p> Jedną z najbardziej przydatnych funkcji przeglądarki Google Chrome jest tworzenie wielu profili użytkowników, zwłaszcza jeśli udostępniasz swój komputer innym osobom lub chcesz oddzielić zakładki i ustawienia między wieloma kontami. W takim przypadku zawsze możesz uruchomić Chrome za pomocą okna „Przełącz osobę”, dodając jeden z następujących przełączników (wpisów tekstowych) w skrócie Chrome: </p> <ul> <li><strong> –profile-directory=&quot;Profil gościa&quot; </strong></li> <li><strong> –bwsi </strong></li> </ul> <p> </p> <p> Przede wszystkim sprawdź, czy Chrome jest ustawiony tak, aby zawsze otwierał okno „Przełącz osobę / Przeglądaj jako gość”. Aby to zrobić: </p> <p> 1. Zamknij Google Chrome. <br> 2. Kliknij prawym przyciskiem myszy skrót Chrome na pulpicie i wybierz <strong> Nieruchomości </strong> . <br> 3. W <strong> Skrót </strong> zakładka, spójrz na <strong> Cel </strong> pole tekstowe i (jeśli jest) <strong> usunąć </strong> powyższe wpisy tekstowe na końcu, a następnie kliknij <strong> dobrze </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-27-916.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Uruchom Chrome i w oknie „Przełącz osobę” kliknij ikonę/zdjęcie profilu („Ty”). <br> 5. <strong> Uruchom ponownie </strong> Chrom. </p> <p> </p> <h6> Metoda 2. Utwórz nowy czysty profil Google Chrome. </h6> <p> Domyślnie Chrome przechowuje wszystkie ustawienia profilu (zakładki, hasła, rozszerzenia itp.) w folderze „Dane użytkownika” w następującej lokalizacji na komputerze: </p> <ul> <li><strong> C:\\Użytkownicy\\%Nazwa użytkownika%\\AppData\\Local\\Google\\Chrome\\Dane użytkownika </strong></li> </ul> <p> Jeśli z jakiegoś powodu folder profilu Chrome zostanie uszkodzony lub niewłaściwie zmodyfikowany przez złośliwe oprogramowanie, najlepszą opcją jest zmuszenie Chrome do ponownego utworzenia nowego (pustego*) folderu profilu Chrome. Aby to zrobić: </p> <p><strong> * Uwaga: </strong> Pamiętaj, że usuwając folder przechowywania profilu Chrome, usuwasz wszystkie zapisane dane (zakładki, ustawienia, rozszerzenia, historię itp.) . Dlatego przed usunięciem profilu Chrome weź <a href=\"https://www.repairwin.com/backup-restore-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> kopia zapasowa zakładek Chrome </a> w przypadku, gdy chcesz ponownie zainstalować Chrome. </p> <h5> Krok 1: Włącz widok Ukryte pliki i foldery. </h5> <p> 1. Otwórz <strong> Opcje folderu </strong> . <br> 2. W <strong> Widok </strong> patka, <strong> czek </strong> <strong> Pokaż ukryte pliki, foldery i dyski </strong> zaznacz pole i kliknij <strong> DOBRZE. </strong></p> <p><img src=\"images/image_thumb-6-189.png\" alt=\"enable hidden files folders\" loading=\"lazy\"></p> <h6></h6> <h5> Krok 2. Wymuś Chrome, aby utworzył nowy (czysty) folder profilu. </h5> <p> 1. <strong> Blisko </strong> Google Chrome. <br> 2. <strong> otwarty </strong> Eksplorator Windows i przejdź do tej lokalizacji: </p> <ul> <li><strong> C:\\Użytkownicy\\%USERNAME%\\AppData\\Local\\Google\\Chrome\\ </strong></li> </ul> <p> * Gdzie %USERNAME% = Twoja nazwa użytkownika. (np. jeśli Twoja nazwa użytkownika to „Admin”, musisz przejść do tej ścieżki: „C:\\Users\\Admin\\AppData\\Local\\Google\\Chrome”) </p> <p> 3. <strong> Przemianować </strong> folder „Dane użytkownika” do „Dane użytkownika.BAK”. </p> <p><img src=\"images/image_thumb-28-373.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Teraz otwórz Google Chrome. (Podczas uruchamiania Chrome automatycznie utworzy nowy, czysty folder „Dane użytkownika” do przechowywania zakładek i ustawień). </p> <p> </p> <h6> Dodatkowe metody rozwiązywania problemów z Chrome. </h6> <p><strong> 1. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Sprawdź komputer pod kątem wirusów, złośliwego oprogramowania itp. </a></p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Całkowicie odinstaluj i ponownie zainstaluj Chrome. </a></p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}