{"title":"NAPRAW: Nie można zmienić motywu - motywy Aero są wyszarzone w systemie Windows 7 (rozwiązane)","content":"<p> Na komputerze z systemem Windows 7 wystąpił następujący problem: System Windows został zmieniony na motyw podstawowy i użytkownik nie może zmienić motywu, ponieważ po otwarciu ustawień personalizacji wszystkie motywy aero są wyszarzone. Zamiast tego wszystkie inne ustawienia w panelu personalizacji są włączone (Tło pulpitu, Kolor systemu Windows, Wygaszacz ekranu itp.), Oczekuj, że wybierzesz inny motyw. </p> <p><img src=\"images/image_thumb-28-129.png\" alt=\"Cannot Change Theme – Themes Greyed Out\" loading=\"lazy\"></p> <p> </p> <p> Ten samouczek zawiera instrukcje dotyczące rozwiązania następującego problemu w systemie Windows 7: Nie można zmienić motywu — motywy są wyszarzone. </p> <h4> Jak naprawić: Nie można zmienić motywu — motywy Aero są wyszarzone. </h4> <h6> Metoda 1. Przeskanuj system w poszukiwaniu wirusów i złośliwego oprogramowania. </h6> <p> Pierwszym krokiem do rozwiązania problemu „nie można zmienić podstawowego motywu” jest upewnienie się, że system jest wolny od wirusów/złośliwego oprogramowania. W tym celu postępuj zgodnie z instrukcjami w tym przewodniku: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak skanować komputer w poszukiwaniu wirusów i innych złośliwych programów. </a></p> <h6> Metoda 2. Uruchom ponownie usługę motywu. </h6> <p> 1. Otwórz panel sterowania Windows Services: Aby to zrobić: </p> <ul> <li> Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-720.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. </li> <li> W polu wyszukiwania wpisz: <strong><em> services.msc </em></strong> &amp; Kliknij <strong> dobrze </strong> . </li> <li> (Zaakceptuj ostrzeżenie UAC, jeśli się pojawi). </li> </ul> <p><img src=\"images/image_thumb-12-580.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. W panelu sterowania Usługi kliknij prawym przyciskiem myszy na <strong> Motywy </strong> obsługa i wybór <strong> Uruchom ponownie </strong> . * </p> <p> * Uwaga: Jeśli usługa jest zatrzymana, kliknij <strong> Początek </strong> . </p> <p><img src=\"images/image_thumb-29-242.png\" alt=\"Themes Greyed Out - restart theme service\" loading=\"lazy\"></p> <p> </p> <h6> Metoda 3. Włącz style wizualne w oknach i przyciskach. </h6> <p> 1. Kliknij <strong> Początek </strong> przycisk, kliknij prawym przyciskiem myszy <strong> Komputer a </strong> i wybierz <strong> Nieruchomości </strong> . </p> <p><img src=\"images/image_thumb-30-382.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2.  Kliknij <strong> Zaawansowane ustawienia systemu </strong> po lewej. </p> <p><img src=\"images/image_thumb-31-876.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. W zakładce „Zaawansowane” kliknij <strong> Ustawienia </strong> w sekcji „Wydajność”. </p> <p><img src=\"images/image_thumb-15-696.png\" alt=\"fix High CPU and DISK Usage Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. W <strong> Efekty wizualne </strong> zaznacz opcję „Użyj stylów wizualnych w oknach i przyciskach” i kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-32-631.png\" alt=\"fix Theme cannot be changed - themes greyed out\" loading=\"lazy\"></p> <p> </p> <h6> Metoda 4. Zainstaluj najnowsze sterowniki ekranu. </h6> <p><strong> 1. </strong> Nawigować do <strong> Panel sterowania </strong> &gt; <strong> Programy i funkcje </strong> i <strong> odinstaluj </strong> aktualnie zainstalowany sterownik VGA. </p> <p><strong> 2. </strong> Po zakończeniu operacji dezinstalacji <strong> uruchom ponownie </strong> Twój komputer. </p> <p><strong> 3. </strong> Po ponownym uruchomieniu przejdź do witryny pomocy technicznej producenta komputera, aby pobrać i zainstalować najnowsze sterowniki karty graficznej. Jeśli posiadasz komputer stacjonarny lub laptop* z kartą AMD/ATI lub NVIDIA VGA, wykonaj poniższe czynności, aby znaleźć, pobrać i zainstalować najnowszą wersję sterownika dla swojej karty graficznej. </p> <p><strong> * Uwaga: </strong> Jeśli nie możesz znaleźć sterowników z poniższych łączy, przejdź do witryny pomocy technicznej producenta komputera. </p> <p> </p> <p><strong> Dla procesorów graficznych opartych na NVIDIA. </strong></p> <ol> <li> <ol> <li> Iść do <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Strona zaawansowanego wyszukiwania sterowników NVIDIA </a> i wyszukaj odpowiedni sterownik karty graficznej. </li> <li> Na stronie wyników wyszukiwania pobierz poprzednią wersję sterownika. </li> <li> Zainstaluj pobrany sterownik i uruchom ponownie komputer. </li> </ol> </li> </ol> <p> </p> <p><strong> Dla procesorów graficznych AMD. </strong></p> <ul> <li> <ol> <li> Iść do <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Pobieranie sterowników AMD (ATI) </a> i wyszukaj odpowiedni sterownik karty graficznej. </li> <li> Na stronie wyników wyszukiwania naciśnij <strong> Poprzednie sterowniki i oprogramowanie </strong> link po prawej stronie. </li> <li> Zainstaluj pobrany sterownik i uruchom ponownie komputer. </li> </ol> </li> </ul> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}