{"title":"NAPRAW: Ten tryb systemu Windows uruchamia tylko zweryfikowane aplikacje ze Sklepu w systemie Windows 10.","content":"<p> Błąd „Ze względu na bezpieczeństwo i wydajność ten tryb systemu Windows uruchamia tylko zweryfikowane aplikacje ze Sklepu” pojawia się, gdy system Windows 10 działa w trybie S lub z powodu ustawienia na komputerze, które uniemożliwia instalowanie aplikacji i oprogramowania innych firm . </p> <p><img src=\"images/image_thumb-19-156.png\" alt=\"FIX: For security and performance, this mode of Windows only runs verified apps from the Store in Windows 10.\" loading=\"lazy\"></p> <p> Ten samouczek zawiera instrukcje dotyczące rozwiązania błędu „Ze względu na bezpieczeństwo i wydajność ten tryb systemu Windows uruchamia tylko zweryfikowane aplikacje ze Sklepu” podczas próby zainstalowania aplikacji innej firmy w systemie Windows 10. </p> <h2> Jak zezwolić na instalację aplikacji innych firm w systemie Windows 10. </h2> <h5> Krok 1. Znajdź zainstalowaną wersję systemu Windows 10. </h5> <p> 1. Naciśnij Windows <img src=\"images/image_thumb8_thumb-1-482.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. Wpisz następujące polecenie i naciśnij <strong> Wchodzić: </strong></p> <ul> <li><strong> zwycięzca </strong></li> </ul> <p><img src=\"images/image_thumb-13-360.png\" alt=\"See Windows 10 Installed Version\" loading=\"lazy\"></p> <p> 3. Teraz, jeśli widzisz w Windows Edition, że używasz systemu Windows 10 Home lub Pro, postępuj zgodnie z instrukcjami w <a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda-1 </a> , w przeciwnym razie, jeśli masz <strong> Windows 10 Home S </strong> , postępuj zgodnie z instrukcjami w <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda-2 </a> . </p> <p><img src=\"images/image_thumb-14-709.png\" alt=\"See Installed Windows 10 Edition\" loading=\"lazy\"></p> <p><strong> </strong></p> <p><strong> </strong></p> <h3> Metoda 1. Zezwól systemowi Windows 10 na instalowanie aplikacji z dowolnego miejsca. </h3> <p> 1. Z menu Start <img src=\"images/image_thumb2_thumb_thumb-909.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> kliknij Ustawienia <img src=\"images/image_thumb-66-797.png\" alt=\"image\" loading=\"lazy\"> a następnie otwórz <strong> Aplikacje </strong> . </p> <p><img src=\"images/image_thumb-15-604.png\" alt=\"Windows Settings - Apps\" loading=\"lazy\"></p> <p> </p> <p> 2. W Ustawieniach aplikacji i funkcji wybierz, aby zainstalować aplikacje z <strong> Gdziekolwiek </strong> . </p> <p><img src=\"images/image_thumb-16-670.png\" alt=\"Install Apps from Anywhere - Windows 10\" loading=\"lazy\"></p> <h3> Metoda 2. Przełącz się z trybu Windows 10 S. </h3> <p> Windows 10 w trybie S mode został zaprojektowany z myślą o bezpieczeństwie i wydajności, dlatego nie pozwala na uruchamianie aplikacji poza Microsoft Store. Aby obejść to ograniczenie, musisz wyjść z trybu S mode, co jest bardzo łatwym sposobem, ale pamiętaj, że po wyjściu z trybu S mode nie będzie można wrócić do systemu Windows 10 w trybie S mode.. </p> <p> Aby wylogować się z trybu Windows 10 S do Windows 10 Home: </p> <p> 1. Z menu Start <img src=\"images/image_thumb2_thumb_thumb-829.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> kliknij Ustawienia <img src=\"images/image_thumb-66-853.png\" alt=\"image\" loading=\"lazy\"> a następnie otwórz <strong> Aktualizacja i bezpieczeństwo. </strong></p> <p> 2. Wybierz <strong> Aktywacja </strong> po lewej stronie, a następnie kliknij <a href=\"//switchwindows\" target=\"_blank\" rel=\"nofollow noopener\"> Iść do sklepu </a><strong> . </strong></p> <p><img src=\"images/image_thumb-17-920.png\" alt=\"Switch Out S Mode Windows 10\" loading=\"lazy\"></p> <p> 3. Na stronie Wyłącz tryb S kliknij S <strong> Otrzymać </strong> a następnie kliknij <strong> Zainstalować. </strong> * <br> 4. Na koniec kliknij <strong> Tak, chodźmy </strong> aby wyjść z trybu S. </p> <p> * Uwaga: Jeśli po kliknięciu przycisku „Zainstaluj” pojawi się błąd „Coś się stało i nie mogliśmy rozpocząć aktualizacji”, kontynuuj i <strong> zainstaluj wszystkie dostępne aktualizacje systemu Windows 10 </strong> , <strong> uruchom ponownie komputer </strong> i spróbuj ponownie. </p> <p><img src=\"images/image_thumb-18-502.png\" alt=\"Switch Out S Mode\" loading=\"lazy\"></p> <p> </p> <p> 4. Po zakończeniu instalacji zostaniesz poinformowany, że będziesz mógł instalować aplikacje spoza Microsoft Store. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}