{"title":"NAPRAW: Outlook Odbieranie zgłoszony błąd 0x80042108 (rozwiązany)","content":"<p> Ten samouczek zawiera instrukcje krok po kroku, jak naprawić zgłoszony błąd odbierania programu Outlook 0x80042108. Błąd Outlook 0x80042108 zwykle występuje, gdy nieprawidłowo wpisałeś nazwę serwera poczty e-mail POP3 lub ponieważ nie masz dostępu do Internetu. </p> <p> Problemem są szczegóły. Program Outlook 2003, 2007, 2010 lub Outlook 2013 wyświetla następujący błąd podczas procedury wysyłania i odbierania: „Zgłoszono błąd odbierania (0x80042108): program Outlook nie może połączyć się z serwerem poczty przychodzącej (POP3). Jeśli nadal otrzymujesz ten komunikat skontaktuj się z administratorem serwera lub dostawcą usług internetowych (ISP)&quot;. </p> <p><img src=\"images/outlookerror_0x80042108-505.png\" alt=\"Outlook Error 0x80042108\" loading=\"lazy\"></p> <p> Błąd programu Outlook „0x80042108” może wystąpić w dowolnej wersji programu Outlook (2016, 2013, 2010 lub 2007) i pojawia się, gdy program klienta poczty e-mail programu Outlook nie może połączyć się z serwerem poczty e-mail. </p> <h4> Jak naprawić błąd 0x80042108 w programach Outlook 2007, 2010, 2013 lub 2016. </h4> <h6> Krok 1. Sprawdź swoje połączenie internetowe. </h6> <p> Pierwszym krokiem do rozwiązania błędu odbierania programu Outlook 80042108 jest sprawdzenie połączenia internetowego. Otwórz więc przeglądarkę internetową i odwiedź dowolną witrynę, aby upewnić się, że połączenie internetowe działa. </p> <h6> Krok 2. Sprawdź ustawienia serwera poczty POP3. </h6> <p> Drugim krokiem do naprawienia błędu odbierania programu Outlook 0x80042108 jest sprawdzenie, czy określono prawidłowe ustawienia serwera poczty e-mail. Skontaktuj się więc ze swoim dostawcą poczty e-mail i sprawdź, czy wpisałeś poprawnie nazwę serwera poczty przychodzącej i numer portu. Aby wyświetlić i zmodyfikować ustawienia serwera poczty e-mail: </p> <p> 1. Otwórz Outlooka. <br> 2. Idź do <strong> Plik </strong> –&gt; <strong> Ustawienia konta </strong> . </p> <p><img src=\"images/image_thumb-7-811.png\" alt=\"switch Account Mail Merge \" loading=\"lazy\"></p> <p> </p> <p> 3. W <strong> E-mail </strong> kliknij dwukrotnie swoje konto e-mail, aby zmodyfikować/przejrzeć jego ustawienia. <br> 4. Sprawdź, czy w odpowiednim polu została ustawiona poprawna nazwa serwera poczty przychodzącej. <br> 5. Po zakończeniu kliknij <strong> Więcej ustawień </strong> . </p> <p><img src=\"images/image_thumb-31-256.png\" alt=\"FIX: Outlook Receiving reported error 0x80042108\" loading=\"lazy\"></p> <blockquote><p> </p></blockquote> <p> 6. Kliknij <strong> zaawansowane </strong> i sprawdź, czy określono poprawny port i ustawienie SSL dla serwera poczty przychodzącej (POP3). </p> <p> </p> <p><img src=\"images/image_thumb-33-400.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Po zakończeniu kliknij <strong> dobrze </strong> a następnie zamknij wszystkie otwarte okna. <br> 7. Ponownie przetestuj Outlooka. </p> <h6></h6> <h6> Krok 3. Sprawdź ustawienia antywirusa i zapory. </h6> <p> Jeśli używasz programu antywirusowego z funkcjami skanowania poczty, to <a href=\"https://www.repairwin.com/how-to-disable-add-ins-in-word-outlook-or-excel-2016-2013-2010-2007-or-2003/\" target=\"_blank\" rel=\"nofollow noopener\"> wyłącz dodatek antywirusowy w Outlooku </a> lub tymczasowo wyłącz ochronę antywirusową lub odinstaluj program antywirusowy. Ponadto sprawdź ustawienia zapory i upewnij się, że używane porty serwera poczty e-mail nie są blokowane przez program zapory. Dokładniej, w ustawieniach zapory: </p> <p> A. Włącz następujące pliki, aby uzyskać dostęp do Internetu: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Włącz następujące porty, aby uzyskać dostęp do Internetu: </p> <ul> <li><strong> Port 110 </strong> (Jeśli używasz serwera poczty przychodzącej POP3 bez szyfrowanego połączenia) * </li> <li><strong> Port 995 </strong> (Jeśli używasz serwera poczty przychodzącej POP3 z szyfrowanym połączeniem (włączony protokół SSL) </li> </ul> <ul> <li><strong> Port 143 </strong> (jeśli używasz serwera poczty przychodzącej IMAP bez zaszyfrowanego połączenia) </li> <li><strong> Port 993 </strong> (jeśli używasz serwera poczty przychodzącej IMAP z szyfrowanym połączeniem (włączony protokół SSL) </li> </ul> <ul> <li><strong> Port 25 </strong> Jeśli serwer poczty wychodzącej SMTP nie korzysta z protokołu SSL. * </li> <li><strong> Port 465 </strong> lub <strong> 587 </strong> jeśli serwer poczty wychodzącej SMTP używa protokołu SSL </li> </ul> <p> * Uwaga: Domyślnie port 25 służy do dostępu wychodzącego, a port 110 do dostępu przychodzącego. Jeśli nie masz pewności co do portów, skontaktuj się z usługodawcą internetowym lub administratorem systemu. </p> <p> </p> <p><strong> Dodatkowa pomoc: </strong> Jeśli powyższe metody ci nie pomogą, spróbuj wykonać następujące czynności: </p> <p><strong> ZA. </strong> Usuń i ponownie dodaj swoje konto e-mail. <br> <strong> B. </strong><a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Napraw plik danych PST programu Outlook </a> . <br> <strong> DO. </strong> Rozłącz się z połączeniem VPN (jeśli masz połączenie) <br> <strong> RE. </strong> Naprawa instalacji biurowej. Aby to zrobić: </p> <blockquote><p> 1. Przejdź do Windows <strong> Panel sterowania </strong> &gt; <strong> Programy i funkcje </strong> . <br> 2. Znajdź i wybierz aplikację MS Office, a następnie kliknij <strong> Zmiana </strong> . <br> 3. Następnie wybierz <strong> Naprawic </strong> opcja. </p></blockquote> <p> </p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? </p> <p> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}