{"title":"NAPRAW: Problem z tylną tapetą w systemie Windows 7 (rozwiązany)","content":"<p> Ten samouczek zawiera instrukcje rozwiązywania problemu z czarną tapetą, gdy obraz tła jest ustawiony na „Rozciąganie” w systemie operacyjnym Windows 7. Problem z czarną tapetą może pojawić się na komputerach z systemem Windows 7 po zainstalowaniu aktualizacji KB4534310 z 14 stycznia 2020 r. </p> <p><img src=\"images/image_thumb-16-423.png\" alt=\"FIX: Back Wallpaper issue in Windows 7\" loading=\"lazy\"></p> <p> Problem z czarnym tłem w systemie Windows 7 jest znanym błędem występującym po zainstalowaniu <a href=\"http://www.catalog.update.microsoft.com/Search.aspx?q=KB4534310\" target=\"_blank\" rel=\"nofollow noopener\"> aktualizacja KB4534310 </a> i jako Microsoft <a href=\"https://support.microsoft.com/en-us/help/4534310/windows-7-update-kb4534310\" target=\"_blank\" rel=\"nofollow noopener\"> mówi </a> : „Pracujemy nad rozwiązaniem i udostępnimy aktualizację w nadchodzącej wersji, która zostanie udostępniona wszystkim klientom korzystającym z systemu Windows 7 i Windows Server 2008 R2 SP1”. </p> <p> Jeśli chcesz rozwiązać problem „czarnej tapety”, dopóki firma Microsoft nie wyda aktualizacji, która go naprawi, postępuj zgodnie z poniższymi instrukcjami. </p> <h4> Jak naprawić problem z czarną tapetą w systemie Windows 7. </h4> <h6> Metoda 1. Odinstaluj aktualizację KB4534310. </h6> <p> Pierwszą metodą rozwiązania problemów z czarną tapetą w systemie Windows 7 jest usunięcie aktualizacji KB4534310.* </p> <p> * Uwaga: Ponieważ aktualizacja KB4534310 zawiera ulepszenia zabezpieczeń i poprawki dla systemu Windows 7, nie zaleca się jej odinstalowywania. Sugerujemy więc, aby rozwiązać problem, postępując zgodnie z instrukcjami na <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda-2 </a> poniżej. </p> <p> Aby odinstalować aktualizację KB4534310: </p> <p> 1. Kliknij prawym przyciskiem myszy na <strong> Początek </strong> menu <img src=\"images/image_thumb-38-451.png\" alt=\"image\" loading=\"lazy\"> i wybierz <strong> Panel sterowania </strong> . <br> 2. Ustaw <strong> Wyświetl według: do małych ikon </strong> i kliknij <strong> Program i funkcje. </strong></p> <p><img src=\"images/image_thumb-51-750.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 3. Kliknij <strong> Pokaż zainstalowane aktualizacje </strong> w lewym okienku. </p> <p> </p> <p><img src=\"images/image_thumb-52-942.png\" alt=\"uninstall updates windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. W polu wyszukiwania wpisz „ <strong> KB4534310 </strong> ” i naciśnij Enter. <br> 5. Zaznacz opcję „Aktualizacja zabezpieczeń dla systemu Microsoft Windows (KB4534310)” i kliknij <strong> Odinstaluj </strong> . </p> <p><img src=\"images/image_thumb-12-776.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Metoda 2. Zmień pozycję obrazu inną niż „Rozciąganie”. </h6> <p> Problem z czarną tapetą w systemie Windows 7 pojawia się tylko wtedy, gdy wybrany obraz tła jest rozciągnięty. Tak więc następną metodą rozwiązania problemu jest ustawienie innej pozycji obrazu dla obrazu tła. Aby to zrobić: </p> <p> 1. Kliknij prawym przyciskiem na pulpicie i kliknij <strong> Nadać cechy osobiste </strong> . </p> <p><img src=\"images/image_thumb-17-501.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Kliknij <strong> Tło pulpitu </strong></p> <p><img src=\"images/image_thumb-14-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Teraz wykonaj następujące czynności: </p> <p> za. W lokalizacji obrazu wybierz <strong> Biblioteka obrazów. </strong><br> b. Wybierz obraz, który chcesz umieścić w tle, lub dowolny inny niestandardowy obraz/zdjęcie pasujące do rozdzielczości ekranu. * </p> <blockquote> <p> * Wskazówka: aby sprawdzić aktualną rozdzielczość ekranu, kliknij prawym przyciskiem myszy na pulpicie i kliknij <strong> Rozdzielczość ekranu </strong> . </p> </blockquote> <p> do. W <strong> Pozycja obrazu </strong> wybierz dowolną inną opcję z wyjątkiem „ <strong> Rozciągać </strong> ”, na przykład „Wypełnij”, „Dopasuj”, „Płytka” lub „Wyśrodkuj”. <br> re. Po zakończeniu kliknij Zapisz <strong> zmiany </strong> . </p> <p><img src=\"images/image_thumb-15-519.png\" alt=\"image\" loading=\"lazy\"></p> <p> To wszystko! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}