{"title":"NAPRAW: Czarny ekran aparatu Skype i inne problemy z kamerą internetową w systemie Windows 10.","content":"<p> Problem z czarnym / pustym ekranem aparatu Skype jest jednym z najczęstszych problemów w systemie Windows 10 i może być spowodowany wieloma przyczynami, więc oto przewodnik krok po kroku, jak to naprawić. </p> <p> W systemie Windows 10 nowa aktualizacja może powodować wiele problemów ze zintegrowaną kamerą internetową, a aparat może nie działać lub aparat może nie być rozpoznawany w niektórych aplikacjach, podczas gdy w innych działa poprawnie. Na przykład widziałem przypadek, w którym podczas gdy kamera działała bez problemu w aplikacjach Webex i Zoom, wyświetlała czarny ekran w Skype. </p> <p> Ten przewodnik zawiera instrukcje krok po kroku, jak rozwiązać kilka problemów ze zintegrowaną kamerą na laptopach z systemem Windows 10: * </p> <ul> <li><em> Kamera internetowa/kamera nie działa w systemie Windows 10 </em></li> <li><em><em> Kamera internetowa/kamera </em> Przestał działać po aktualizacji w systemie Windows 10. </em></li> <li><em> Kamera internetowa nie działa w niektórych aplikacjach (Skype, Windows Hello WebEx itp.). </em></li> <li><em> Kamera internetowa wyświetla czarny (lub pusty) ekran podczas korzystania ze Skype&#39;a. </em></li> <li><em> Kamera internetowa działa na Skype, ale wyświetla czarny ekran w oknie podglądu kamery camera </em> . </li> <li> Aplikacje nie rozpoznają lub nie znajdują kamery/kamery internetowej </li> </ul> <p><strong> * Uwaga dla właścicieli Lenovo ThinkPad: </strong> Jeśli posiadasz jeden z modeli ThinkPad wymienionych w poniższej tabeli, przejdź do pobrania i zainstalowania tego <a href=\"/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/DC8297800EA7/Integrated%20Camera%20Driver%20Registry%20Patch%20for%20Windows%2010%20(Version%201709%20or%20later)%20-%20ThinkPad\" target=\"_blank\" rel=\"nofollow noopener\"> poprawka rejestru od Lenovo. </a> Poprawka rozwiązuje problem polegający na tym, że zintegrowany sterownik aparatu może nie działać poprawnie po aktualizacji do systemu Windows 10 w wersji 1709 lub nowszej. </p> <p><img src=\"images/image_thumb-30-725.png\" alt=\"THinkpad Registry Fix for Integrated Camera\" loading=\"lazy\"></p> <h2> Jak naprawić: problemy z kamerą internetową w systemie Windows 10. </h2> <p> </p> <h3> Krok 1. Zezwól na dostęp do aplikacji z aparatu. </h3> <p> W systemie Windows 10 aparat i mikrofon mogą być niedostępne dla aplikacji ze względu na zastosowane ustawienia prywatności. Więc kontynuuj i zezwól aplikacji z problemem z aparatem na dostęp do aparatu. Na przykład, jeśli napotkasz problem z kamerą w Skypie, wykonaj następujące czynności: </p> <p> 1. Nawiguj, aby przejść do <strong> Początek </strong> menu <img src=\"images/image_thumb-12-696.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Ustawienia </strong> -&gt; <strong> Prywatność </strong> . <br> 2. Wybierz <strong> Aparat fotograficzny </strong> po lewej i po prawej stronie: </p> <blockquote><p> za. Upewnij się, że <strong> Dostęp do aparatu na tym urządzeniu </strong> jest <strong> na. </strong> Jeśli nie, kliknij <strong> Zmiana </strong> i ustawić na <strong> NA. </strong><br> b. Następnie ustaw na <strong> Na </strong> <strong> Zezwalaj aplikacjom na dostęp do przełącznika aparatu </strong> . </p> <p><img src=\"images/image_thumb-20-105.png\" alt=\"Allow Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Teraz przewiń w dół i… </p> <p> do. Jeśli masz problem z włączonym czarnym ekranem aparatu <strong> Skype </strong> sklep, przewiń w dół i w <strong> Wybierz, które aplikacje ze sklepu Microsoft Store mogą uzyskiwać dostęp do aparatu </strong> sekcja, zestaw <strong> Skype </strong> do <strong> Na. </strong></p> <p><img src=\"images/image_thumb-21-826.png\" alt=\"Allow Store Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> re. Jeśli widzisz czarne okno aparatu podczas korzystania z <strong> Skype dla Windows </strong> (aplikacja komputerowa), a następnie upewnij się, że <strong> Zezwalaj aplikacjom komputerowym na dostęp do aparatu </strong> przełącznik jest <strong> Na </strong> . </p> <p><img src=\"images/image_thumb-22-558.png\" alt=\"Allow Applications to Access Camera Windows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h3> Krok 2. Sprawdź, czy Twoja kamera działa poprawnie. </h3> <p> Jednym z pierwszych kroków w rozwiązywaniu problemów z kamerą internetową jest sprawdzenie, czy działa ona w aplikacji Aparat systemu Windows 10. </p> <p> 1. W polu wyszukiwania wpisz <strong> aparat fotograficzny </strong> aby otworzyć aplikację Aparat. <br> 2. Kliknij Lupę i wyszukaj „ <strong> aparat fotograficzny </strong> &quot;. <br> 3. Otwórz <strong> Aparat fotograficzny </strong> podanie </p> <p><img src=\"images/image_thumb-23-730.png\" alt=\"Open Camera app Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Teraz, zgodnie z wynikiem, wykonaj następujące czynności: </p> <blockquote><p> A. Jeśli twój aparat działa, powinieneś zobaczyć swój obraz na ekranie. W takim przypadku przejdź dalej i sprawdź kamerę na Skypie lub w dowolnej innej aplikacji, z której jej korzystasz. Jeśli kamera internetowa nie działa lub wyświetla czarny ekran, wykonaj poniższe czynności w podanej kolejności: </p> <ol> <li> Spróbuj <strong> odinstaluj </strong> i <strong> zainstaluj ponownie </strong> aplikacja z problemem z kamerą (np. Skype). </li> <li> Przejdź do włączania lub wyłączania trybu serwera ramek w rejestrze, postępując zgodnie z instrukcjami na <a href=\"#step-3\" target=\"_blank\" rel=\"nofollow noopener\"> krok 3 </a> . </li> </ol> <p> B. Jeśli Twój aparat nie działa w aplikacji Aparat, może się zdarzyć jedna z następujących rzeczy: </p> <ol> <li> Sterownik urządzenia aparatu jest nieprawidłowy lub uszkodzony. W takim przypadku przejdź do rozwiązywania problemów ze sterownikami aparatu, postępując zgodnie z instrukcjami na <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> krok 4 </a> . </li> <li> Kamera jest uszkodzona iw ogóle nie działa. W takim przypadku udaj się do warsztatu komputerowego, aby naprawić kamerę internetową lub użyj zewnętrznej kamery USB. </li> </ol> </blockquote> <h3></h3> <h3> Krok 3. Napraw problem z czarnym ekranem kamery internetowej w rejestrze systemu Windows 10. </h3> <p> Jeśli kamera jest rozpoznawana i działa bez problemu w niektórych aplikacjach, ale nie działa w innych lub wyświetla czarny ekran na Skype, spróbuj wyłączyć lub włączyć &quot;Tryb serwera ramek&quot; w rejestrze. </p> <p> 1. Otwórz Edytor rejestru: w tym celu: </p> <blockquote><p> 1. Naciśnij Windows <img src=\"images/image_thumb41-284.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. Typ <strong> regedit </strong> i naciśnij <strong> Wchodzić </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-845.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> 3. W Edytorze rejestru przejdź do następującego klucza w lewym okienku: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows Media Foundation\\Platform </li> </ul> <p> 4. <strong> Kliknij prawym przyciskiem myszy </strong> w pustym miejscu w prawym okienku i wybierz <strong> Nowy -&gt; Wartość DWORD (32-bitowa). </strong></p> <p><img src=\"images/image_thumb-24-839.png\" alt=\"Fix Webcam black Screen Windows 10\" loading=\"lazy\"></p> <p> 5. Podaj imię <strong> Włącz tryb serwera ramek </strong> do nowej wartości. <br> 6. Kliknij dwukrotnie nowo utworzoną wartość i upewnij się, że dane wartości są <strong>0</strong> . (Zero). Kliknij <strong> DOBRZE. </strong></p> <p><img src=\"images/image_thumb-25-764.png\" alt=\"Fix Webcam issues Windows 10\" loading=\"lazy\"></p> <p> 7. Teraz wykonaj te same kroki powyżej (4,5 i 6) i wprowadź te same zmiany w tym klawiszu: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows Media Foundation\\Platform </li> </ul> <p> 8. Kiedy skończysz, <strong> blisko </strong> Edytor rejestru i <strong> uruchom ponownie </strong> Twój komputer. <br> 9. Po ponownym uruchomieniu uruchom Skype i sprawdź, czy problem z kamerą internetową został rozwiązany. Jeśli nie, wykonaj te same kroki, ale tym razem <strong> włączyć </strong> <strong> Włącz tryb serwera ramek </strong> zmieniając jego wartość z <strong>0 </strong> do <strong> 1 </strong> i <strong> uruchom ponownie </strong> Twój komputer ponownie. </p> <p> </p> <h3> Krok 4. Rozwiąż problem ze sterownikiem kamery internetowej. </h3> <p> Następnym krokiem, aby rozwiązać problemy z aparatem w systemie Windows 10, jest wycofanie lub odinstalowanie/ponowne zainstalowanie sterowników aparatu. 1. Otwórz <strong> Menadżer urządzeń </strong> . Aby to zrobić: </p> <blockquote><p> 1. Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-696.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. W polu „Otwórz” wpisz: <strong> devmgmt.msc </strong> &amp; Kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-5-837.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Rozwiń <strong> Wyobraź sobie urządzenia </strong> (lub <strong> Kamery </strong> ) <br> 3. <strong> Kliknij prawym przyciskiem myszy </strong> na Twoim <strong> Aparat fotograficzny </strong> i wybierz <strong> Nieruchomości. </strong></p> <p><img src=\"images/image_thumb-26-673.png\" alt=\"Camera Properties\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 4. Wybierz <strong> Kierowca </strong> i postępuj w następujący sposób, w zależności od przypadku: </p> <blockquote><p> A. Jeśli Twoja kamera internetowa działała wcześniej, <strong> Przywróć sterownik </strong> i <strong> restar </strong> Twój komputer. Następnie sprawdź, czy Twój aparat działa. </p> <p><img src=\"images/image_thumb-27-454.png\" alt=\"Roll Back Driver - Camera\" loading=\"lazy\"></p> <p> </p> <p> B. Jeśli Twój aparat nigdy wcześniej nie działał lub jeśli jest to pierwszy raz, gdy próbujesz aparatu (np. po nowej instalacji systemu Windows), spróbuj wykonać następujące czynności w podanej kolejności: </p> <ol> <li> Kliknij <strong> Uaktualnij sterownik </strong> opcję, aby sprawdzić dostępność zaktualizowanego sterownika aparatu. Jeśli system Windows znajdzie nowy sterownik, zainstaluj go, a następnie sprawdź kamerę internetową. Inaczej… </li> <li> Kliknij <strong> Odinstaluj urządzenie </strong> aby odinstalować kamerę internetową, a następnie <strong> uruchom ponownie </strong> Twój komputer. Po ponownym uruchomieniu sprawdź, czy kamera działa. Jeśli nie… </li> <li> Przejdź do witryny pomocy technicznej producenta laptopa i sprawdź, czy jest dostępny nowy sterownik dla kamery internetowej i zainstaluj go. </li> </ol> </blockquote> <h3> Dodatkowa pomoc w rozwiązywaniu problemów z aparatem w systemie Windows 10. </h3> <p> Jeśli po wykonaniu powyższych czynności nadal masz problemy z kamerą internetową, spróbuj wykonać następujące czynności: </p> <ol> <li> <p> Zainstaluj wszystkie dostępne aktualizacje systemu Windows 10 ( <strong> Początek </strong> -&gt; <strong> Ustawienia </strong> -&gt; <strong> Aktualizacja i bezpieczeństwo </strong> i kliknij <strong> Sprawdź aktualizacje). </strong></p> </li> <li> <p> Zaktualizuj system Windows 10 do najnowszej wersji, używając <strong> Asystent aktualizacji. </strong> (Aby to zrobić, przejdź do tego <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"noopener\"><strong> połączyć </strong></a> i kliknij <strong> Aktualizuj teraz </strong> przycisk). </p> </li> <li> <p><a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"noopener\"><strong> Odśwież Windows 10 </strong> . </a></p> </li> </ol> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}