{"title":"NAPRAW: Wygląda na to, że rozpoczęto aktualizację i uruchomiono z nośnika instalacyjnego (rozwiązane)","content":"<p> Przy próbie wykonania czystej instalacji lub naprawy uaktualnienia systemu Windows 10 z nośnika instalacyjnego może pojawić się następujący problem: „Wygląda na to, że rozpoczęto uaktualnianie i uruchomiono komputer z nośnika instalacyjnego. Jeśli chcesz kontynuować uaktualnianie, usuń nośnika z komputera i kliknij Tak. Jeśli chcesz zamiast tego przeprowadzić czystą instalację, kliknij Nie&quot;. </p> <p><img src=\"images/image_thumb-36-818.png\" alt=\"FIX: It looks like you started an upgrade and booted from installation media \" loading=\"lazy\"></p> <p> </p> <p> Powyższy komunikat o błędzie oznacza, że ​​przerwałeś aktualizację systemu Windows 10 po jej uruchomieniu. Jak wskazuje komunikat, jeśli chcesz wykonać czystą instalację systemu Windows 10, musisz wybrać „Nie”, aby kontynuować, w przeciwnym razie usuń nośnik instalacyjny i kliknij „Tak”, aby kontynuować aktualizację systemu Windows 10. </p> <p> Ogólnie rzecz biorąc, powyższy komunikat nie stanowi problemu, ale staje się dużym problemem, jeśli aktualizacja systemu Windows nie zostanie zainstalowana lub system Windows 10 utknął w pętli po próbie zainstalowania aktualizacji i chcesz naprawić system Windows 10 przez uruchomienie z instalacji głoska bezdźwięczna. </p> <p> W tym samouczku znajdziesz szczegółowe instrukcje, jak ominąć komunikat „Wygląda na to, że rozpocząłeś aktualizację i uruchomiłeś komputer z nośnika instalacyjnego”, anulując aktualnie uruchomiony proces aktualizacji systemu Windows 10, w celu wykonania naprawy systemu Windows 10 aktualizacja z nośnika instalacyjnego. </p> <h4> Jak anulować trwającą aktualizację systemu Windows 10, jeśli system Windows nie może się uruchomić * </h4> <p><strong> * Ważne: </strong> Jeśli możesz uruchomić system Windows 10, ale nie możesz zainstalować aktualizacji ze środowiska Windows, najpierw wykonaj następujące czynności: </p> <blockquote><p> 1. Przejdź do <strong> Początek </strong> &gt; <strong> Ustawienia </strong> &gt; <strong> Aktualizacja i bezpieczeństwo </strong> i kliknij „Uruchom ponownie teraz”, aby rozpocząć proces aktualizacji. <br> 2. Po pierwszym ponownym uruchomieniu pozostaw postęp &quot;Praca nad aktualizacjami&quot; do 1-2%. <br> 3. Gdy to zrobisz, naciśnij <strong> Moc </strong> przez 10-15 sekund, aby całkowicie wyłączyć komputer. <br> 4. Podłącz nośnik instalacyjny systemu Windows i włącz komputer. <br> 5. Wykonaj pozostałe kroki poniżej, aby anulować trwającą aktualizację. </p></blockquote> <p> </p> <h6> Krok 1. Anuluj oczekujące akcje Windows Update. </h6> <p> 1. Uruchom system z nośnika instalacyjnego Windows. <br> 2. Gdy pojawi się komunikat „Wygląda na to, że rozpocząłeś aktualizację i uruchomiłeś komputer z nośnika instalacyjnego…”, naciśnij przycisk <strong> ZMIANA </strong> + <strong> F10 </strong> klawisze, aby uruchomić wiersz polecenia. </p> <p><img src=\"images/image_thumb-37-729.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. W wierszu poleceń uzyskaj listę wszystkich dysków w systemie za pomocą tego polecenia: </p> <ul> <li><strong> wmic Logicdisk zdobądź nazwę </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-991.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> </p> <p> 4. Następnie dowiedz się, który dysk zawiera folder „Windows”, wpisując to polecenie: * </p> <p> </p> <ul> <li><strong> dir DriveList: </strong></li> </ul> <p> * np. Aby zobaczyć zawartość dysku C:, wpisz: „ <strong> reż. C: </strong> ” (bez cudzysłowów). Jeśli nie widzisz folderu „Windows” na dysku C:, przejdź do następnej litery dysku (np. „dir D:”, „dir E:” itp.), aż zobaczysz Folder „Windows” na jednym z wymienionych dysków (z powyższego polecenia). </p> <p> np.: Jak widać na poniższym zrzucie ekranu, folder Windows (w tym przykładzie) znajduje się na <strong> re </strong> : napęd.] </p> <p><img src=\"images/image_thumb-69-578.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Po znalezieniu, na którym dysku znajduje się dysk „Windows” (np. w tym przykładzie, na dysku „D:”), przejdź do tego dysku, wpisując DriveLetter <strong> : </strong> + <strong> Wchodzić </strong> . </p> <p> 6. Następnie utwórz folder scratch na dysku Windows, wpisując to polecenie: </p> <p> </p> <ul> <li><strong> mkdir D:\\Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-229.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Następnie wydaj poniższe polecenie, aby cofnąć oczekujące działania aktualizacji w toku: </p> <ul> <li><strong> DISM /Image:D:\\ /ScratchDir:D:\\Scratch /Cleanup-Image /RevertPendingActions </strong></li> </ul> <p> * Uwaga: zmień literę dysku <strong> re </strong> zgodnie z twoim przypadkiem. </p> <p> 8. Po wykonaniu powyższego polecenia DISM na ekranie powinien pojawić się następujący komunikat: </p> <p> &quot; <em> Cofanie oczekujących działań z obrazu…. <br> Operacja zakończona. Po ponownym uruchomieniu zostanie podjęta próba cofnięcia oczekujących działań. <br> Operacja zakończona sukcesem.&quot; </em></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"DISM - RevertPendingActions\" loading=\"lazy\"></p> <p> </p> <p> 9. Zamknij okno wiersza poleceń, wyjmij nośnik instalacyjny i pozwól systemowi Windows uruchomić się normalnie. </p> <p> 10. Po ponownym uruchomieniu na ekranie powinien pojawić się następujący komunikat: „Cofanie zmian wprowadzonych na komputerze”. Po zakończeniu tego procesu system Windows powinien uruchomić się normalnie. </p> <p><img src=\"images/image_thumb-39-836.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Krok 2. Usuń pliki aktualizacji za pomocą funkcji Oczyszczanie dysku. </h6> <p> Po uruchomieniu systemu Windows 10 należy przygotować system Windows 10 do naprawy/uaktualnienia USB, usuwając już pobrane aktualizacje za pomocą narzędzia Oczyszczanie dysku. Aby to zrobić: </p> <p> 1. Otwórz Eksplorator plików, kliknij prawym przyciskiem myszy dysk C: i wybierz <strong> Nieruchomości </strong> . <br> 2. Kliknij <strong> Czyszczenie dysku </strong> przycisk. </p> <p><img src=\"images/image_thumb_thumb-190.png\" alt=\"Disk cleanup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Następnie kliknij <strong> Wyczyść pliki systemowe </strong> . </p> <p><img src=\"images/image_thumb-40-950.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Teraz sprawdź, czy usunąć następujące pliki i kliknij <strong> dobrze </strong> : </p> <ul> <li> <ul> <li> <ul> <li> Oczyszczanie Windows Update. </li> <li> Program antywirusowy Windows Defender. </li> <li> Pobrane pliki programu. </li> <li> Tymczasowe pliki internetowe. </li> <li> Poprzednie instalacje systemu Windows. </li> <li> Kosz. </li> <li> Pliki tymczasowe. </li> <li> Tymczasowe pliki instalacyjne systemu Windows </li> </ul> </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-41-458.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Na pytanie, <strong> Usuń pliki </strong> . </p> <p><img src=\"images/image_thumb-42-931.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Po zakończeniu czyszczenia zamknij właściwości dysku i przejdź do następnego kroku. </p> <p> </p> <h6> Krok 3. Usuń folder „SoftwareDistribution”. </h6> <p> „C:\\Windows\\ <strong> Dystrybucja oprogramowania </strong> „, to lokalizacja, w której system Windows przechowuje aktualizacje systemu Windows. Wiele razy ten folder ulega uszkodzeniu i należy go ponownie utworzyć, aby ponownie pobrać aktualizacje od zera. Wykonaj następujące czynności: </p> <p><strong> 1. Zatrzymaj usługę Windows Update: </strong> Aby to zrobić: </p> <blockquote><p> za. Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> b. W polu wyszukiwania wpisz: <strong><em> services.msc </em></strong> &amp; Kliknij <strong> dobrze </strong> . </p></blockquote> <p><img src=\"images/image_thumb-12-264.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> do. W panelu sterowania Usługi zlokalizuj „ <strong> Aktualizacja systemu Windows&quot; </strong> usługa. <br> re. Kliknij prawym przyciskiem myszy <strong> Aktualizacja systemu Windows </strong> serwis i wybierz &quot; <strong> Zatrzymać </strong> &quot;. </p></blockquote> <p><img src=\"images/image_thumb-9-434.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. Usuń folder SoftwareDistribution. </strong></p> <blockquote><p> za. Otwórz Eksploratora Windows i przejdź do: <strong> C:\\Windows </strong> teczka. <br> b. Znajdź i <strong> Kasować </strong> „ <strong><em> Dystrybucja oprogramowania </em></strong> ” (lub zmień jego nazwę, np. na „SoftwareDistributionOLD”) . </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-10-140.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Zrestartuj swój komputer </strong> zastosować zmiany. </p> <p> </p> <h6> Krok 4. Zaktualizuj system Windows 10 z nośnika instalacyjnego. </h6> <p> Teraz możesz przystąpić do naprawy i uaktualnienia systemu Windows 10 z nośnika instalacyjnego. Aby to zrobić: </p> <p> 1. <strong> Restart </strong> twój komputer i <strong> bagażnik </strong> z Windows USB (lub DVD) <strong> nośnik instalacyjny </strong> . <br> 2. W kreatorze instalacji systemu Windows naciśnij <strong> Kolejny </strong> a następnie kliknij <strong> Zainstaluj teraz </strong> . <br> 3. <strong> Zaakceptować </strong> „Umowa licencyjna”. <br> 4. Gdy zostaniesz o to poproszony, wybierz Uaktualnij <strong> : Zainstaluj system Windows i zachowaj pliki, ustawienia i aplikacje </strong> . </p> <blockquote><p><img src=\"images/image_thumb8_thumb-241.png\" alt=\"image_thumb8\" loading=\"lazy\"></p></blockquote> <p> 5. Następnie postępuj zgodnie z instrukcjami wyświetlanymi na ekranie, aby zaktualizować system Windows 10. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}