{"title":"NAPRAW: Zduplikowane nazwy użytkowników na ekranie logowania po aktualizacji systemu Windows 10.","content":"<p> Ten samouczek zawiera kilka metod rozwiązania problemu zduplikowanych nazw użytkowników na ekranie logowania po aktualizacji systemu Windows 10. Problem „zduplikowanych nazw użytkowników na ekranie logowania” jest zgłaszany przez wielu użytkowników i jest powodowany po zainstalowaniu aktualizacji w systemie Windows 10. </p> <p><img src=\"images/image_thumb-44-494.png\" alt=\"FIX: Duplicate User Names in Sign-in Screen Windows 10\" loading=\"lazy\"></p> <p> Problem w szczegółach: Po zmianie nazwy komputera lub po zainstalowaniu aktualizacji w systemie Windows 10 system nie loguje się automatycznie do konta użytkownika z błędem „nazwa użytkownika lub hasło jest niepoprawne. Spróbuj ponownie” i jednocześnie pojawia się Twoja nazwa użytkownika dwukrotnie na ekranie logowania. </p> <h4> Jak naprawić: Ekran logowania Windows 10 pokazuje tego samego użytkownika dwa razy. </h4> <h6> Metoda 1. Usuń zduplikowane konto z opcji konta użytkownika. </h6> <p> Pierwszą metodą usunięcia zduplikowanych nazw użytkownika z ekranu logowania jest usunięcie zduplikowanego konta z komputera. </p> <p> 1. Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-923.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. W polu „Otwórz” wpisz: <strong> kontroluj hasła użytkowników2 </strong> &amp; Kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-29-663.png\" alt=\"control userpasswords2 \" loading=\"lazy\"></p> <p> 3. W opcjach Konta Użytkownika wykonaj w zależności od przypadku następujące czynności: </p> <ul> <li><strong> Przypadek A. </strong> Jeśli widzisz dwa konta o tej samej nazwie użytkownika: </li> </ul> <blockquote><p> za. Wybierz konto dodatkowe i kliknij <strong> Usunąć </strong> . <br> b. Kliknij <strong> dobrze </strong> i <strong> uruchom ponownie </strong> Twój komputer. <br> do. Jeśli po ponownym uruchomieniu nadal widzisz swoją nazwę użytkownika dwukrotnie na ekranie logowania, przejdź do metody 2. </p></blockquote> <p><img src=\"images/image_thumb-37-605.png\" alt=\"User Accounts Options\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Przypadek B. </strong> Jeśli widzisz tylko jedno konto: </li> </ul> <blockquote><p> za. Wybierz konto i kliknij <strong> Nieruchomości </strong> . <br> b. Skopiuj pełną nazwę i wklej ją w polu Nazwa użytkownika, aby dopasować. * <br> do. Kliknij <strong> dobrze </strong> i <strong> uruchom ponownie </strong> Twój komputer. </p></blockquote> <p> * Uwaga: Jeśli nazwa użytkownika i pełna nazwa są już zgodne, przejdź do metody 2. </p> <p><img src=\"images/image_thumb-38-262.png\" alt=\"Remove Duplicate User Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Metoda 2. Wyłącz wymaganie hasła podczas logowania. </h6> <p> 1. Wykonaj kroki 1 i 2 z poprzedniej metody, aby otworzyć opcje „Konta użytkowników”. <br> 2. <strong> Odznacz </strong> <strong> Użytkownik musi wprowadzić nazwę użytkownika i hasło, aby korzystać z tego komputera </strong> i kliknij <strong> Zastosować </strong></p> <p><img src=\"images/image_thumb-42-373.png\" alt=\"User must enter a user name and password to use this computer \" loading=\"lazy\"></p> <p> </p> <p> 3. Wpisz swoje hasło (dwa razy) i kliknij <strong> dobrze </strong> dwukrotnie, aby zamknąć wszystkie okna. </p> <p><img src=\"images/image_thumb-43-970.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. <strong> Restart </strong> Twój komputer. Jeśli nazwa użytkownika pojawi się ponownie dwukrotnie, przejdź do następnej metody. </p> <h6></h6> <h6> Metoda 3. Zmodyfikuj opcje logowania. </h6> <p> </p> <p> 1. Od początku <img src=\"images/image_thumb-39-183.png\" alt=\"image\" loading=\"lazy\"> menu, otwórz <strong> Ustawienia </strong> <img src=\"images/image_thumb-50-520.png\" alt=\"image\" loading=\"lazy\"> a następnie kliknij <strong> Konta </strong> . </p> <p><img src=\"images/image_thumb-43-892.png\" alt=\"How to Add a New User in Windows 10, 8.1.\" loading=\"lazy\"></p> <p> </p> <p> 2. Wybierz <strong> Opcje logowania </strong> w lewym okienku i <strong> wyłączyć </strong> <strong> Użyj moich danych logowania, aby automatycznie zakończyć konfigurację urządzenia i ponownie otworzyć moje aplikacje po aktualizacji lub ponownym uruchomieniu </strong> . </p> <p><img src=\"images/image_thumb-40-207.png\" alt=\"Modify Sign in Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Uruchom ponownie </strong> Twój komputer. </p> <p> </p> <h6> Metoda 4. Zmień na konto lokalne. </h6> <p> Ostatnią metodą rozwiązania problemu „zduplikowanych nazw użytkowników” jest użycie konta lokalnego do zalogowania się w systemie Windows 10. Aby to zrobić: </p> <p> 1. Od początku <img src=\"images/image_thumb-41-454.png\" alt=\"image\" loading=\"lazy\"> menu, otwórz <strong> Ustawienia </strong> <img src=\"images/image_thumb-50-790.png\" alt=\"image\" loading=\"lazy\"> a następnie kliknij <strong> Konta </strong> . <br> 2. Kliknij <strong> E-mail i konta </strong> w lewym okienku. <br> 3. Następnie kliknij <strong> Zamiast tego zaloguj się na konto lokalne. </strong></p> <p> </p> <p><img src=\"images/image_thumb-37-653.png\" alt=\"sign-in with a local account instead windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Wprowadź hasło do konta Microsoft i kliknij <strong> Kolejny </strong> . <br> 5. Następnie wpisz nazwę użytkownika, hasło (opcjonalnie) do nowego konta lokalnego i kliknij <strong> Kolejny </strong> . <br> 6. Po ponownym uruchomieniu wpisz hasło, aby zalogować się na nowe konto lokalne. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}