{"title":"NAPRAW: Windows 10 działa bardzo wolno po zainstalowaniu v2004 lub Edge Chromιum (rozwiązany)","content":"<p> Wielu użytkowników zgłosiło, że ich komputer działa bardzo wolno po zainstalowaniu aktualizacji systemu Windows 10 2004 lub po zainstalowaniu nowej wersji przeglądarki Microsoft Edge opartej na Chromium. Jeśli napotykasz jeden z wyżej wymienionych problemów, postępuj zgodnie z instrukcjami w tym artykule, aby je rozwiązać. </p> <p> Problem w szczegółach: Po uaktualnieniu systemu Windows 10 do wersji 2004 lub po zainstalowaniu <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> aktualizacja, która automatycznie instaluje nową przeglądarkę Edge (wersja Chromium), system Windows trwa długo podczas uruchamiania lub działa bardzo wolno. </p> <h4> Jak naprawić: Problemy z powolnym rozruchem i niską wydajnością w systemie Windows 10 2004. </h4> <h6> Metoda 1. Zainstaluj dostępne aktualizacje systemu Windows i zaktualizuj sterowniki urządzeń. </h6> <p> Pierwszą metodą rozwiązania problemów z niską wydajnością w systemie Windows 10 jest wykonanie następujących kroków: </p> <ul> <li><strong> Krok 1. </strong> Pobierz i zainstaluj wszystkie dostępne aktualizacje systemu Windows. </li> <li><strong> Krok 2. </strong> Pobierz i zainstaluj najnowsze sterowniki systemu Windows 10 dla karty graficznej. </li> <li><strong> Krok 3. </strong> Jeśli używasz programu antywirusowego innej firmy, odinstaluj go i sprawdź, czy problem z niską wydajnością nadal występuje. Jeśli nie, zainstaluj najnowszą wersję programu AV. </li> </ul> <p> </p> <h6> Metoda 2. Odinstaluj wersję Microsoft Edge Chromium. </h6> <p> Drugą metodą naprawienia problemów z niską wydajnością w systemie Windows 10 jest odinstalowanie wersji Microsoft Edge Chromium (jeśli jest zainstalowana). </p> <h5> Krok 1. Sprawdź, czy jest zainstalowana nowa wersja przeglądarki Microsoft Edge oparta na Chromium. </h5> <p> 1. Z menu Start <img src=\"images/image_thumb2_thumb_thumb-381.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> Kliknij <strong> Ustawienia </strong><img src=\"images/image_thumb-66-515.png\" alt=\"image\" loading=\"lazy\"> i kliknij <strong> Aplikacje. <br> </strong> 2. Jeśli <strong> Aplikacje i funkcje </strong> zlokalizuj aplikację Microsoft Edge i zgodnie z jej ikoną wykonaj następujące czynności: </p> <ul> <li> Jeśli widzisz ten obraz ikony <img src=\"images/image_thumb-32-976.png\" alt=\"image\" loading=\"lazy\"> , oznacza to, że na Twoim komputerze jest już zainstalowana nowa wersja Microsoft Edge oparta na Chromium. W takim przypadku przejdź do <strong> <a href=\"#step-2\" target=\"_blank\" rel=\"nofollow noopener\"> krok 2 </a></strong> aby odinstalować Edge Chromium z komputera. </li> <li> Jeśli widzisz ten obraz ikony <img src=\"images/image_thumb-33-372.png\" alt=\"image\" loading=\"lazy\"> , oznacza to, że nowa wersja oparta na Chromium nie jest jeszcze zainstalowana na Twoim komputerze. W takim przypadku przejdź do <a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"><strong> metoda-3 </strong></a> . </li> </ul> <p><img src=\"images/image_thumb-71-268.png\" alt=\"FIX: Windows 10 Running Extremely Slow after 2004 Update\" loading=\"lazy\"></p> <p> </p> <h5> Krok 2. Usuń Edge Chromium z komputera. </h5> <p> Aby odinstalować nowy Edge oparty na Chromium w systemie Windows 10: </p> <p> 1. Przejdź do następującego folderu na swoim komputerze: * </p> <ul> <li> C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\85.0.564.41\\Installer </li> </ul> <p> * Uwaga: nazwa folderu „85.0.564.41” wskazuje zainstalowaną wersję nowej wersji Chromium i może się różnić na Twoim komputerze. </p> <p> 2. Wybierz ścieżkę folderu w pasku adresu i kliknij prawym przyciskiem myszy &gt; <strong> Kopiuj. </strong></p> <p><img src=\"images/image_thumb-35-379.png\" alt=\"Uninstall Edge Chromiun\" loading=\"lazy\"></p> <p> </p> <p> 3. Otwórz <strong> Wiersz Poleceń jako Administrator, </strong> rodzaj <strong> Płyta CD </strong> a następnie naciśnij <strong> CTRL+V </strong> do wklejenia do skopiowanej ścieżki folderu. Po zakończeniu naciśnij <strong> Wchodzić </strong> . * </p> <p> * np.: W obecnym przykładzie poleceniem będzie: </p> <p><em> cd C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\85.0.564.41\\Installer </em></p> <p><img src=\"images/image_thumb-36-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Teraz podaj poniższe polecenie (Kopiuj / Wklej) w wierszu polecenia, aby usunąć wersję Chromium przeglądarki Microsoft Edge z komputera. </p> <ul> <li> setup.exe –odinstaluj –poziom systemu –pełne rejestrowanie –force-uninstall </li> </ul> <p><img src=\"images/image_thumb-37-229.png\" alt=\"Remove Edge Chromiun\" loading=\"lazy\"></p> <p> 5. Po wykonaniu powyższego polecenia, stara wersja EDGE zostanie ponownie aktywowana. Uruchom ponownie komputer, aby zastosować zmiany. <br> 6. Po ponownym uruchomieniu przejdź do ręcznej instalacji <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> nowa przeglądarka Edge oparta na Chromium </a> na komputerze, aby uniknąć ponownej instalacji problematycznej aktualizacji KB4559309. </p> <p> </p> <h6> Metoda 3. Przywróć system Windows 10 do poprzedniej wersji. </h6> <p> 1. Od <strong> Początek </strong> menu <img src=\"images/image_thumb2_thumb_thumb-872.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> otwarty <strong> Ustawienia </strong> <img src=\"images/image_thumb-66-969.png\" alt=\"image\" loading=\"lazy\"> a następnie kliknij <strong> Aktualizacja i bezpieczeństwo. </strong></p> <p> 2. Wybierz <strong> Poprawa </strong> po lewej stronie, a następnie w sekcji „Wróć do poprzedniej wersji systemu Windows 10” kliknij przycisk <strong> Zaczynaj </strong> przycisk. </p> <p><img src=\"images/image_thumb-4-708.png\" alt=\"Restore Windows to earlier version\" loading=\"lazy\"></p> <p> 3. Postępuj zgodnie z instrukcjami wyświetlanymi na ekranie, aby przywrócić system Windows 10 do poprzedniej wersji. <br> 4. Po powrocie do poprzedniej wersji systemu Windows 10 komputer powinien znów działać normalnie i bez opóźnień. </p> <p> </p> <h6> Metoda 4. Napraw system Windows 10. </h6> <p> Następną metodą rozwiązania problemów z niską wydajnością w systemie Windows 10 jest naprawa systemu Windows za pomocą poleceń SFC i DISM: </p> <p> 1. Otwórz <strong> Wiersz polecenia jako administrator </strong> . <br> 2. W wierszu poleceń wydaj następujące polecenie dism i naciśnij <strong> Wchodzić: </strong></p> <ul> <li><strong> DISM.exe /Online /Cleanup-image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-175.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> </p> <p> 3. Po zakończeniu operacji DISM wpisz następujące polecenie i naciśnij <strong> Wchodzić </strong> : </p> <ul> <li><strong> sfc /skanuj </strong></li> </ul> <p><img src=\"images/image_thumb31-316.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Teraz poczekaj, aż Kontroler plików systemowych naprawi pliki systemowe Windows. <br> 5. Kiedy to zrobisz, <strong> uruchom ponownie </strong> komputer i sprawdź, czy problem został rozwiązany. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}