{"title":"NAPRAW: Nie można zakończyć procesu. Nie można ukończyć operacji, odmowa dostępu.","content":"<p> Jeśli nie możesz zakończyć procesu lub usługi w systemie Windows, ponieważ pojawia się błąd „Nie można zakończyć procesu. Operacja nie może zostać zakończona, odmowa dostępu”, kontynuuj czytanie poniżej, aby dowiedzieć się, jak rozwiązać problem. </p> <p><img src=\"images/image_thumb-10-874.png\" alt=\"Unable to terminate process. Access is denied\" loading=\"lazy\"></p> <p> Zwykłym sposobem zatrzymania uruchomionego procesu w systemie Windows jest otwarcie Menedżera zadań, kliknięcie prawym przyciskiem myszy nazwy procesu i wybranie „Zakończ zadanie”. Ale, jak być może wiesz, czasami niemożliwe jest zatrzymanie procesu, ponieważ pojawia się komunikat „Nie można zakończyć procesu. Odmowa dostępu”. </p> <p> Podobnie może wystąpić podobny problem, jeśli chcesz zatrzymać usługę, a nie możesz, ponieważ opcja „Zatrzymaj” jest wyszarzona lub pojawia się błąd „Nie można zatrzymać usługi. Odmowa dostępu” podczas próby zatrzymania usługa. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"Unable to Terminate Service\" loading=\"lazy\"></p> <p> W tym samouczku dowiesz się, jak zakończyć usługi lub procesy, których nie można zakończyć zwykłymi sposobami. </p> <h4> Jak wymusić zatrzymanie dowolnej usługi lub programu z PowerShell w systemie Windows 10/8/7 OS. </h4> <ul> <li><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> Jak wymusić zamknięcie dowolnej aplikacji z PowerShell. </a></li> <li><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> Jak wymusić zamknięcie dowolnej usługi z PowerShell. </a></li> </ul> <h6></h6> <h6> Część 1. Jak zakończyć aplikację z PowerShell. </h6> <p> 1. Otwórz PowerShell jako Administrator. </p> <p> 2. W PowerShell wpisz następujące polecenie, aby uzyskać identyfikator procesu (PID). </p> <ul> <li><strong> Lista zadań </strong></li> </ul> <p><img src=\"images/image_thumb-12-275.png\" alt=\"Terminate process from powershell\" loading=\"lazy\"></p> <p> </p> <p> 3. Zanotuj nazwę aplikacji, którą chcesz usunąć, a następnie wpisz następujące polecenie, aby zamknąć wszystkie instancje aplikacji. * </p> <ul> <li> Zatrzymaj proces — nazwa „Nazwa_aplikacji” </li> </ul> <p> * Uwaga: W Application_Name wpisz nazwę aplikacji bez rozszerzenia .exe. Na przykład, jeśli chcesz wymusić zamknięcie aplikacji „chrome.exe”, wpisz: </p> <ul> <li><em> Zatrzymaj proces -Nazwa &quot;chrome&quot; </em></li> </ul> <p><img src=\"images/image_thumb-16-974.png\" alt=\"Stop Program PowerShell\" loading=\"lazy\"></p> <p> </p> <p><strong> WSKAZÓWKA: </strong> Jeśli chcesz zakończyć pojedyncze wystąpienie programu, wpisz następujące polecenie: </p> <ul> <li> Zatrzymaj proces -ID PID </li> </ul> <p> * Uwaga: w PID wpisz unikalny numer instancji programu. </p> <p> </p> <h6> Część 2. Jak zakończyć usługę z PowerShell. </h6> <p> 1. Otwórz menedżera zadań i z <strong> Usługi </strong> karta, zwróć uwagę na <strong> PID </strong> usługi, którą chcesz zatrzymać. </p> <p><em> na przykład W tym przykładzie wymusimy zatrzymanie usługi „AdobeARMservice” za pomocą PID <strong> 1640 </strong> . </em></p> <p><img src=\"images/image_thumb-14-150.png\" alt=\"Force Stop Service PowerShell\" loading=\"lazy\"></p> <p> </p> <p> 2. Następnie uruchom <strong> PowerShell jako administrator </strong> i wpisz to polecenie: </p> <ul> <li> kill -id PID </li> </ul> <p> * Uwaga: Jako PID wpisz PID, który zauważyłeś w Menedżerze zadań. W tym przykładzie polecenie będzie wyglądało następująco: </p> <ul> <li><em> zabić -id 1640 </em></li> </ul> <p><img src=\"images/image_thumb-15-147.png\" alt=\"Kill Running Service from PowerShell\" loading=\"lazy\"></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}