{"title":"POPRAWKA: Błąd aplikacji aparatu 0xA00F424F (0x8004005) w systemie Windows 10. (rozwiązany)","content":"<p> Błąd aplikacji Aparat 0xA00F424F w systemie Windows 10 podczas próby robienia zdjęć lub filmów oznacza, że ​​aplikacja Aparat nie może zapisać zdjęć lub plików wideo w określonej lokalizacji przechowywania na komputerze. Błąd 0xA00F424F (0x8004005) może pojawić się z wielu powodów, więc postępuj zgodnie z poniższymi metodami, aby go naprawić. </p> <p><img src=\"images/image_thumb-9-592.png\" alt=\"FIX: Camera App Error 0xA00F424F in Windows 10\" loading=\"lazy\"></p> <p> Ten samouczek zawiera instrukcje krok po kroku dotyczące rozwiązania błędu „Coś poszło nie tak. Przepraszamy, nie udało się zapisać zdjęć” z błędem: „0xA00F424F (0x80004005)” lub „PhotoCaptureFileCreationFailed (0x80131500)” </p> <h4> Jak naprawić: Aplikacja aparatu – Zapisz błąd 0xA00F424F (0x8004005) w systemie Windows 10. </h4> <h6> Metoda 1. Zezwól aplikacji Aparat na dostęp do aparatu. </h6> <p> Pierwszą metodą naprawienia błędu aparatu 0xA00F424F jest upewnienie się, że aplikacja Aparat ma dostęp do aparatu. Aby to zrobić: </p> <p> 1. Przejdź do <strong> Ustawienia </strong> &gt; <strong> Prywatność. <br> </strong> 2. Wybierz <strong> Aparat fotograficzny </strong> aplikacji w lewym i prawym okienku dokonaj następujących ustawień: </p> <p> za. Przełącz <strong> Zezwalaj aplikacjom na dostęp do aparatu </strong> Przełącz na <strong> NA </strong> . <br> b. Przewiń w dół i pod <strong> „Wybierz, które aplikacje ze sklepu Microsoft Store mogą uzyskiwać dostęp do aparatu” </strong> sekcji, przełącz <strong> Aparat fotograficzny </strong> zmiana aplikacji na <strong> NA </strong> . * </p> <p><img src=\"images/image_thumb-4-435.png\" alt=\"Allow apps to access your camera in Windows 10\" loading=\"lazy\"></p> <h6> Metoda 2. Zresetuj ustawienia aplikacji aparatu. </h6> <p> 1. Przejdź do <strong> Ustawienia </strong> &gt; <strong> Aplikacje </strong> . <br> 2. Na liście „Aplikacje i funkcje” wybierz aplikację Aparat, a następnie kliknij <strong> Zaawansowane opcje </strong> . </p> <p><img src=\"images/image_thumb-5-262.png\" alt=\"Reset Camera App Settings - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Przewiń w dół i kliknij <strong> Resetowanie. </strong></p> <p><img src=\"images/image_thumb-6-318.png\" alt=\"Reset app settings Windows 10\" loading=\"lazy\"></p> <h6></h6> <h6> Metoda 3. Usuń i ponownie utwórz folder „Camera Roll”. </h6> <p> Następną metodą naprawienia kodu błędu 0xA00F424F (0x80004005) w aplikacji Aparat jest upewnienie się, że folder „Rolka z aparatu” (C:\\Użytkownicy\\%Nazwa użytkownika%\\Pictures\\Rolka z aparatu), który jest domyślną lokalizacją zapisywania zdjęć i filmów, istnieje i ma odpowiednie uprawnienia do zapisywania zdjęć i filmów. Aby to zrobić: </p> <p> 1. Otwórz Eksploratora Windows i w pasku adresu wpisz następujący adres i naciśnij <strong> Wchodzić </strong> : </p> <ul> <li> %APPDATA%\\Microsoft\\Windows\\Biblioteki\\Zdjęcia </li> </ul> <p><img src=\"images/image_thumb-10-952.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Otwórz folder „Camera Roll”* i upewnij się, że nie ma w nim żadnych plików. (W przeciwnym razie przenieś wszystkie jego pliki do innej lokalizacji na dysku.). </p> <p> * Uwaga: jeśli folder Camera Roll nie istnieje, przejdź do kroku 4. </p> <p> 3. Teraz <strong> kasować </strong> <strong> Rolka aparatu </strong> teczka. </p> <p><img src=\"images/image_thumb-11-440.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Na koniec utwórz nowy folder i nazwij go ” <strong> Rolka aparatu </strong> &quot; <br> 5. Po zakończeniu otwórz aplikację Aparat i spróbuj zrobić zdjęcie lub nagrać wideo, aby sprawdzić, czy problem został rozwiązany. </p> <p> </p> <h6> Metoda 4. Dodaj folder Rolka z aparatu do biblioteki obrazów. </h6> <p> Ostatnią metodą naprawienia błędu aplikacji aparatu 0xA00F424F jest określenie innej lokalizacji do przechowywania zdjęć/filmów. Aby to zrobić: </p> <p> 1. Otwórz Eksploratora Windows i w pasku adresu wpisz następujący adres i naciśnij <strong> Wchodzić </strong> : </p> <ul> <li> %APPDATA%\\Microsoft\\Windows\\Biblioteki </li> </ul> <p> 2. Kliknij prawym przyciskiem myszy na <strong> Rolka aparatu </strong> folder i wybierz <strong> Nieruchomości </strong> . </p> <p><img src=\"images/image_thumb-8-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Teraz wykonaj jedną z następujących czynności: </p> <p> za. Jeśli „Rolka z aparatu” nie znajduje się na liście „Lokalizacja bibliotek”, kliknij przycisk <strong> Dodaj </strong> przycisk, otwórz <strong> Kino </strong> folder, a następnie wybierz <strong> Rolka aparatu </strong> jako domyślną lokalizację zapisywania zdjęć i filmów. </p> <p> b. Jeśli folder „Rolka z aparatu” znajduje się na liście „Lokalizacja bibliotek”, kliknij <strong> Dodaj </strong> i określ nowy folder przechowywania dla aplikacji Aparat. Po zakończeniu kliknij <strong> Ustaw lokalizację zapisu </strong> i kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-12-180.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Na koniec otwórz aplikację Aparat i spróbuj zrobić zdjęcie lub nagrać film. </p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}