{"title":"POPRAWKA: Mikrofon nie został wykryty lub nie działa w systemie Windows 10 (rozwiązany)","content":"<p> Ten przewodnik zawiera instrukcje rozwiązywania problemów „nie wykryto mikrofonu” lub „mikrofon nie działa” w systemie Windows 10. Jeśli masz problemy z mikrofonem w systemie Windows 10, może to być spowodowane kilkoma przyczynami. Problem „mikrofon nie działa” jest problemem dla wielu użytkowników systemu Windows 10 i zwykle pojawia się po aktualizacji systemu Windows. </p> <p> Ten samouczek zawiera kilka rozwiązań, aby rozwiązać problemy z mikrofonem w systemie Windows 10. </p> <h4> Jak naprawić: Mikrofon systemu Windows 10 nie działa lub nie został wykryty. * </h4> <p> * Uwaga: jeśli masz problem z mikrofonem w określonej aplikacji, wypróbuj następujące rozwiązania: </p> <blockquote><p> 1. Upewnij się, że konkretna aplikacja może korzystać z mikrofonu, korzystając z instrukcji w metodzie-1 poniżej. <br> 2. Upewnij się, że mikrofon jest wybrany jako domyślne urządzenie wejściowe w ustawieniach aplikacji. (np. w Skypie przejdź do <strong> Ustawienia </strong> i upewnij się, że wybrany jest mikrofon lub zestaw słuchawkowy). <br> 3. Zamknij wszelkie inne aplikacje, które mogą korzystać z mikrofonu. <br> 4. Uruchom ponownie komputer i ponownie przetestuj mikrofon. </p></blockquote> <h6> Rozwiązanie 1. Zezwól aplikacjom na dostęp do mikrofonu. </h6> <p> Pierwszą metodą rozwiązywania problemów z mikrofonem w systemie Windows 10 jest upewnienie się, że wszystkie aplikacje mają dostęp do mikrofonu. Aby to zrobić: </p> <p> 1. . Z menu Start <img src=\"images/image_thumb2_thumb_thumb-856.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> Kliknij <strong> Ustawienia </strong><img src=\"images/image_thumb-66-804.png\" alt=\"image\" loading=\"lazy\"> a następnie otwórz <strong> Prywatność </strong> . <br> 2. Wybierz <strong> Mikrofon </strong> w lewym okienku, a następnie <strong> Włączyć </strong> <strong> Zezwalaj aplikacjom na dostęp do mikrofonu. </strong></p> <p><img src=\"images/image_thumb-34-268.png\" alt=\"How to FIX: Windows 10 Microphone Not Detected or Not Working\" loading=\"lazy\"></p> <p> 3. Następnie przewiń w dół i upewnij się, że aplikacja, której chcesz używać mikrofonu, ma do niego dostęp. * </p> <p> * Sugestia: Aby zachować prywatność, wyłącz dostęp do mikrofonu każdej aplikacji, której nie chcesz używać. </p> <p><img src=\"images/image_thumb-35-517.png\" alt=\" FIX Windows 10 Microphone Not Working\" loading=\"lazy\"></p> <p> 4. Po zakończeniu przetestuj swój mikrofon. </p> <h6> Rozwiązanie 2. Sprawdź, czy mikrofon jest domyślnym urządzeniem wejściowym (urządzeniem nagrywającym). </h6> <p> 1. . Z menu Start <img src=\"images/image_thumb2_thumb_thumb-930.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> Kliknij <strong> Ustawienia </strong><img src=\"images/image_thumb-66-142.png\" alt=\"image\" loading=\"lazy\"> a następnie otwórz <strong> System </strong> . <br> 2. Kliknij <strong> Dźwięk </strong> w lewym okienku, a następnie zacznij mówić, aby przetestować mikrofon. Jeśli Twój mikrofon działa, powinieneś zobaczyć przesuwający się suwak poniżej. Jeśli nie, kliknij <strong> Zarządzaj urządzeniami dźwiękowymi. </strong></p> <p><img src=\"images/image_thumb-36-254.png\" alt=\"Test Microphone Windows 10\" loading=\"lazy\"></p> <p> 3. W sekcji „Zarządzaj opcjami urządzeń dźwiękowych” upewnij się, że Twój mikrofon jest wymieniony w sekcji „Urządzenia wejściowe” jako domyślne urządzenie wejściowe, a jego <strong> Włączone </strong> . Jeśli nie, kliknij swój mikrofon i kliknij <strong> Włączyć. </strong></p> <p><img src=\"images/image_thumb-37-753.png\" alt=\"Enable Microphone Windows 10\" loading=\"lazy\"></p> <h6> Rozwiązanie 3. Sprawdź Ustawienia mikrofonu w Panelu sterowania. </h6> <p> 1. Przejdź do Windows <strong> Panel sterowania </strong> i otwarte <strong> Dźwięk. </strong></p> <p><img src=\"images/image_thumb-14-511.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Na <strong> Nagranie </strong> wybierz swój mikrofon i kliknij <strong> Nieruchomości. </strong></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"Microphone Properties\" loading=\"lazy\"></p> <p> 3. Na <strong> Poziom </strong> patka, <strong> opór </strong> suwak do <strong> dobrze </strong> , aby zwiększyć głośność mikrofonu i upewnić się, że mikrofon nie jest wyciszony (jeśli mikrofon jest wyciszony, jego ikona <img src=\"images/image_thumb-39-434.png\" alt=\"image\" loading=\"lazy\"> , zostanie wyświetlony z czerwonym symbolem <img src=\"images/image_thumb-40-819.png\" alt=\"image\" loading=\"lazy\"> ). Po zakończeniu kliknij <strong> dobrze </strong> i <strong> dobrze </strong> aby zamknąć Właściwości dźwięku. </p> <p><img src=\"images/image_thumb-41-896.png\" alt=\"Microphone Levels\" loading=\"lazy\"></p> <h6> Rozwiązanie 4. Zmień sterownik karty dźwiękowej. </h6> <p> Ostatnią metodą rozwiązania problemów z mikrofonem w systemie Windows 10 jest zmiana sterownika dźwięku, zwłaszcza jeśli posiadasz urządzenie Realtek Audio. Aby to zrobić: </p> <p> 1. Otwórz <strong> Menadżer urządzeń </strong> . Aby to zrobić: </p> <blockquote><p> 1. Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-918.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. W polu „Otwórz” wpisz: <strong> devmgmt.msc </strong> &amp; Kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-5-732.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Rozszerzać </strong> <strong> Kontrolery dźwięku, wideo i gier. </strong></p> <p> 3. <strong> Kliknij prawym przyciskiem myszy </strong> na <strong> Dźwięk wysokiej rozdzielczości Realtek </strong> urządzenie i wybierz <strong> Uaktualnij sterownik. <br> </strong></p> <p><img src=\"images/image_thumb-6-629.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Wybierz <strong> Przeglądaj mój komputer w poszukiwaniu sterowników. </strong></p> <p><img src=\"images/image_thumb-7-637.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Wybierz <strong> Pozwól mi wybrać z listy dostępnych sterowników na moim komputerze </strong> . </p> <p><img src=\"images/image_thumb-8-118.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. Na następnym ekranie wybierz <strong> Urządzenie audio wysokiej rozdzielczości </strong> i kliknij <strong> Kolejny. </strong></p> <p><img src=\"images/image_thumb-20-989.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p> 8. W oknie „Ostrzeżenie o aktualizacji sterownika” kliknij „Tak”, aby zainstalować nowy sterownik. <br> 9. Po zakończeniu instalacji sterownika, <strong> uruchom ponownie </strong> Twój komputer. <br> 10. Po ponownym uruchomieniu kontynuuj i przetestuj swój mikrofon. </p> <h6></h6> <h6> Rozwiązanie 5. Odinstaluj i ponownie zainstaluj sterowniki karty dźwiękowej. </h6> <p> Ostatecznym rozwiązaniem problemu niedziałającego mikrofonu w systemie Windows 10 jest całkowite odinstalowanie i ponowna instalacja sterowników karty dźwiękowej. </p> <p> 1. Przejdź do <strong> Panel sterowania </strong> &gt; <strong> Program i funkcje </strong> i <strong> odinstaluj </strong> wszelkie oprogramowanie związane z kartą dźwiękową. <br> 2. Otwórz <strong> Menadżer urządzeń </strong> i <strong> rozszerzać </strong> <strong> Kontrolery dźwięku, wideo i gier. <br> </strong> 3. <strong> Kliknij prawym przyciskiem myszy </strong> na zainstalowanym <strong> Urządzenie audio </strong> i kliknij <strong> Odinstaluj urządzenie. </strong></p> <p><img src=\"images/image_thumb-42-701.png\" alt=\"Uninstall Sound Card Device\" loading=\"lazy\"></p> <p> </p> <p> 4. Po zakończeniu przejdź do witryny pomocy technicznej producenta komputera lub laptopa i pobierz i zainstaluj najnowszy sterownik karty dźwiękowej. <br> 5. Po instalacji <strong> uruchom ponownie </strong> Twój komputer i sprawdź, czy Twój mikrofon działa. </p> <p><strong> Dodatkowa pomoc: </strong> Jeśli po zastosowaniu powyższych rozwiązań Twój mikrofon nadal nie działa, prawdopodobnie jest uszkodzony. Aby się upewnić, jeśli posiadasz laptopa, podłącz zewnętrzny mikrofon lub użyj innego mikrofonu, jeśli posiadasz komputer stacjonarny. </p> <p> To wszystko ludzie! Która metoda zadziałała dla Ciebie? Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}