{"title":"POPRAWKA: W okienku nawigacji w programie Outlook 2013, 2010 lub 2007 nie ma folderu programu Outlook DRAFTS. (rozwiązany)","content":"<p> U jednego z moich klientów wystąpił następujący problem: Nagle i bez oczywistego powodu w okienku nawigacji w programie Outlook 2013 brakuje folderu Wersje robocze. Pierwszą akcją przywracania brakującego folderu Wersje robocze jest przeszukanie wszystkich innych folderów upewnij się, że folder nie został przeniesiony lub usunięty przez pomyłkę. Jeśli nadal nie możesz znaleźć brakującego folderu, przejdź poniżej, aby rozwiązać problem. </p> <p><img src=\"images/image_thumb-37-460.png\" alt=\"Drafts folder Missing Outlook\" loading=\"lazy\"></p> <p> </p> <p> Ten samouczek zawiera instrukcje dotyczące przywracania brakującego folderu w programie Outlook 2007, 2010, 2013, 2016 lub 365. </p> <h4> Jak przywrócić brakujący folder z okienka nawigacji programu Outlook. </h4> <h6> Metoda 1. Przeskanuj system w poszukiwaniu wirusów i złośliwego oprogramowania. </h6> <p> Pierwszym krokiem do rozwiązania problemu „brakujących folderów” w programie Outlook jest upewnienie się, że system jest wolny od wirusów/złośliwego oprogramowania. W tym celu postępuj zgodnie z instrukcjami w tym przewodniku: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak skanować komputer w poszukiwaniu wirusów i innych złośliwych programów. </a></p> <p> </p> <h6> Metoda 2. ZRESETUJ foldery programu Outlook. </h6> <p> Po zakończeniu skanowania antywirusowego kontynuuj i zresetuj foldery programu Outlook do domyślnych, korzystając z poniższego procesu: </p> <p> 1. Zamknij aplikację Outlook. <br> 2. Naciśnij <strong> Okna </strong> <img src=\"images/image_thumb8_thumb_thumb-622.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 3. W polu Wyszukaj wpisz: <strong> Outlook/reset folderów </strong> &amp; Kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-36-732.png\" alt=\"outlook reset folders\" loading=\"lazy\"></p> <p> </p> <p> 4. Outlook otworzy się i wszystkie brakujące foldery zostaną zwrócone. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? </p> <p> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym. </p>"}