{"title":"POPRAWKA: Zresetuj 120-dniowy okres prolongaty na serwerze RDS 2016/2012.","content":"<p> Jeśli zainstalowałeś serwer RDS Server 2016 do celów testowych, a okres prolongaty licencjonowania usług RDS wygasł, kontynuuj czytanie poniżej, aby dowiedzieć się, jak zresetować 120-dniowy okres prolongaty. Jak być może wiesz, po zainstalowaniu serwera RDS Server 2016 masz 120 dni na zainstalowanie licencji dostępu klienta usług pulpitu zdalnego (RD CAL), w przeciwnym razie użytkownicy nie będą już mogli nawiązywać sesji RDP na serwerze hosta sesji usług pulpitu zdalnego z powodu błędu „Zdalny sesja pulpitu została rozłączona, ponieważ nie ma dostępnych serwerów licencji pulpitu zdalnego, które mogłyby udostępnić licencję”. </p> <p><img src=\"images/image_thumb-32-368.png\" alt=\"Reset 120 Days Grace Period on RDS Server 2012/2016\" loading=\"lazy\"></p> <p> </p> <h4> Jak zresetować okres prolongaty licencjonowania RDS na serwerze 2012 lub 2016. * </h4> <p><strong> * Ważne: </strong> Zastosuj poniższe instrukcje tylko wtedy, gdy używasz serwera RDS 2016 w środowisku testowym. Jeśli chcesz używać serwera RDS Server w środowisku produkcyjnym, kontynuuj i kup licencje RD CAL. </p> <p> Aby przedłużyć 120-dniowy okres prolongaty na serwerze licencjonowania RDS: </p> <p> 1. Otwórz Edytor rejestru i przejdź do następującego klucza: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\\RCM\\GracePeriod </li> </ul> <p> 2. Kliknij prawym przyciskiem na klawisz &#39;GracePeriod&#39; i wybierz <strong> Uprawnienia. </strong></p> <p><img src=\"images/image_thumb-33-473.png\" alt=\"Reset Grace Period RDS 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Następnie kliknij <strong> zaawansowane </strong> . </p> <p><img src=\"images/image_thumb-34-585.png\" alt=\"Reset RDS Grace Period\" loading=\"lazy\"></p> <p> </p> <p> 4. Wybierz <strong> Administratorzy </strong> obiekt i kliknij <strong> Edytować </strong> . </p> <p><img src=\"images/image_thumb-18-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Zmień uprawnienia na <strong> Pełna kontrola </strong> i kliknij <strong> DOBRZE. </strong></p> <p><img src=\"images/image_thumb-19-737.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Kliknij prawym przyciskiem myszy wartość „L$RTMTIMEBOMB…” i wybierz <strong> Kasować </strong> . </p> <p><img src=\"images/image_thumb-35-208.png\" alt=\"Reset RDS Licensing Grace Pariod\" loading=\"lazy\"></p> <p> </p> <p> 7. Zamknij Edytor rejestru i uruchom ponownie serwer RDS. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}