{"title":"POPRAWKA: Nie można zainstalować przeglądarki XPS w systemie Windows 10 (rozwiązany)","content":"<p> W poprzednim samouczku wspomniałem o krokach wymaganych do <a href=\"https://www.repairwin.com/how-to-install-xps-viewer-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> zainstaluj przeglądarkę XPS w systemie Windows 10 </a> . Jednak niektórzy użytkownicy skarżą się, że nie mogą zainstalować przeglądarki XPS, ponieważ przeglądarka XPS nie jest wyświetlana po naciśnięciu przycisku „Dodaj funkcję” (Aplikacje &gt; Zarządzaj funkcjami opcjonalnymi &gt; Dodaj funkcję) lub nie można jej zainstalować. </p> <p> Ten samouczek zawiera instrukcje dotyczące rozwiązywania problemów z instalacją przeglądarki XPS w wersjach systemu Windows 10 1803 i 1809. </p> <h4> Jak rozwiązać problemy z instalacją przeglądarki XPS Viewer w systemie Windows 10. </h4> <h6> Metoda 1. Odinstaluj i ponownie zainstaluj program Microsoft XPS Document Writer. </h6> <p> 1. Otwórz <strong> Programy i funkcje </strong> a następnie kliknij <strong> Włącz lub wyłącz funkcje systemu Windows </strong> . </p> <p><img src=\"images/image_thumb-61-948.png\" alt=\"FIX: Cannot Install XPS Viewer - Windows 10\" loading=\"lazy\"></p> <p> 2. <strong> Odznacz </strong> <strong> Pole do zapisywania dokumentów Microsoft XPS </strong> i uderzył <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-62-338.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Teraz kliknij <strong> Włącz lub wyłącz funkcje systemu Windows </strong> ponownie i <strong> czek </strong> <strong> Program do zapisywania dokumentów Microsoft XPS </strong> pole i kliknij <strong> DOBRZE. <br> </strong> 4. <strong> Uruchom ponownie </strong> Twój komputer. <br> 5. Spróbuj zainstalować przeglądarkę XPS. </p> <p> </p> <h6> Metoda 2. Zainstaluj przeglądarkę XPS Viewer za pomocą polecenia DISM. </h6> <p> 1. Otwórz <strong> Wiersz polecenia jako administrator </strong> . <br> 2. W wierszu poleceń wydaj następujące polecenie i naciśnij <strong> Wchodzić </strong> . </p> <ul> <li><strong> dism /Online /Add-Capability /CapabilityName:XPS.Viewer~~~~0.0.1.0 </strong></li> </ul> <p><img src=\"images/image_thumb-65-661.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Metoda 3. Pobierz przeglądarkę XPS z witryny Windows Update zamiast WSUS. (Windows 10 Pro i Enterprise). </h6> <p> Jeśli używasz systemu Windows 10 Pro lub Enterprise, wykonaj następujące kroki w Edytorze zasad grupy. * </p> <p> * Uwaga: jeśli komputer należy do domeny, przed zainstalowaniem przeglądarki XPS Viewer należy zmodyfikować ustawienia zasad grupy domeny (GPO), a następnie uruchomić polecenie „gpupdate /force”. </p> <p> 1. Otwórz Edytor zasad grupy. Aby to zrobić: </p> <blockquote><p> 1. Naciśnij jednocześnie Windows <img src=\"images/image_thumb36-656.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. Typ <strong> gpedit.msc </strong> &amp; Naciśnij <strong> Wchodzić. </strong></p></blockquote> <p><img src=\"images/image_thumb-78-514.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. W lewym okienku przejdź do: </p> <ul> <li><strong> konfiguracja komputera </strong> -&gt; <strong> Szablony administracyjne </strong> -&gt; <strong> System </strong></li> </ul> <p> 3. W prawym okienku kliknij dwukrotnie na <strong> Określ ustawienia dla opcjonalnej instalacji komponentów i naprawy komponentów </strong></p> <p><img src=\"images/image_thumb-63-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Ustaw politykę na <strong> Włączone </strong> a następnie sprawdź <strong> Pobierz zawartość naprawczą i opcjonalne funkcje bezpośrednio z witryny Windows Update zamiast z usług Windows Server Update Services (WSUS) </strong> pudełko. </p> <p> 5. Po zakończeniu kliknij <strong> Zastosować </strong> i <strong> dobrze </strong> i <strong> uruchom ponownie </strong> Twój komputer. </p> <p><img src=\"images/image_thumb-64-264.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Po ponownym uruchomieniu spróbuj <a href=\"#install-xps-viewer-dism\" target=\"_blank\" rel=\"nofollow noopener\"> zainstaluj przeglądarkę XPS za pomocą metody DISM </a> powyżej. <br> 7. Po zainstalowaniu przeglądarki XPS otwórz Edytor zasad grupy i cofnij zmiany. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}