{"title":"POPRAWKA: BŁĄD KRYTYCZNY DXGKRNL WIDEO w systemie Windows 10 (rozwiązany)","content":"<p> Jeśli napotkasz błąd na niebieskim ekranie „WIDEO DXGKRNL FATAL ERROR” w systemie Windows 10, postępuj zgodnie z poniższymi instrukcjami, aby rozwiązać problem. </p> <p> Błąd BSOD systemu Windows 10 ” <em> Twój komputer napotkał problem i musi zostać ponownie uruchomiony. Zbieramy tylko informacje o błędach, a następnie uruchomimy ponownie. Jeśli chcesz dowiedzieć się więcej, możesz później wyszukać ten błąd w Internecie: VIDEO DXGKRNL FATAL ERROR&quot;, </em> zwykle wskazuje na problem ze sterownikami wideo. </p> <p><img src=\"images/image_thumb-7-129.png\" alt=\"FIX: VIDEO DXGKRNL FATAL ERROR in Windows 10\" loading=\"lazy\"></p> <p> Ten samouczek zawiera instrukcje krok po kroku dotyczące rozwiązania błędu niebieskiego ekranu „WIDEO DXGKRNL FATAL ERROR” w systemie Windows 10. </p> <h2> Jak naprawić: BŁĄD KRYTYCZNY WIDEO DXGKRNL w systemie Windows 10. </h2> <h3> Krok 1. Napraw VIDEO DXGKRNL FATAL ERROR, odinstalowując/ponownie instalując sterowniki wideo. </h3> <p> 1. Otwórz <strong> Menadżer urządzeń </strong> . Aby to zrobić: </p> <ol> <li> <ol> <li> Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-153.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. </li> <li> W polu „Otwórz” wpisz: <strong> devmgmt.msc </strong> &amp; Kliknij <strong> dobrze </strong> . </li> </ol> </li> </ol> <blockquote> <p><img src=\"images/image_thumb-5-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p></blockquote> <p> 2. <strong> Rozszerzać </strong> <strong> Karty graficzne. <br> </strong> 3. <strong> Kliknij prawym przyciskiem myszy </strong> na zainstalowanych kartach graficznych i wybierz <strong> Odinstaluj urządzenie. </strong></p> <p><img src=\"images/image_thumb-46-240.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. W następnym oknie, jeśli masz opcję: „ <strong> Usuń oprogramowanie sterownika dla tego urządzenia </strong> &quot;, zaznacz go, a następnie kliknij <strong> dobrze </strong> aby usunąć zainstalowane sterowniki z komputera. </p> <p> 5. Po odinstalowaniu <strong> uruchom ponownie </strong> Twój komputer i przejdź do <strong> Menadżer urządzeń </strong> jeszcze raz. <br> 6. Kliknij prawym przyciskiem myszy nazwę komputera (na górze) i wybierz <strong> Skanuj w poszukiwaniu zmian sprzętu. </strong></p> <p><img src=\"images/image_thumb-8-911.png\" alt=\"Scan for hardware changes\" loading=\"lazy\"></p> <p> </p> <p> 7. Pozwól systemowi Windows wykryć i zainstalować sterowniki ekranu, a następnie display <strong> uruchom ponownie </strong> ponownie w komputerze i sprawdź, czy nadal występuje „BŁĄD KRYTYCZNY DXGKRNL WIDEO”. * </p> <p> * Uwaga: Jeśli system Windows nie może automatycznie zainstalować sterowników ekranu lub nadal występuje błąd niebieskiego ekranu, przejdź do następnego kroku. </p> <p> </p> <h3><br clear=\"all\"> Krok 2. Zainstaluj ponownie sterowniki wideo ze strony producenta. </h3> <p> 1. Przejdź do <strong> Menadżer urządzeń </strong> i <strong> odinstaluj </strong> zainstalowaną kartę graficzną. * </p> <p> * Uwaga: jeśli posiadasz laptopa z dwoma (2) kartami graficznymi, odinstaluj oba. </p> <p> 2. Przejdź do witryny pomocy technicznej producenta komputera (lub karty graficznej) i pobierz najnowsze sterowniki dla posiadanych kart graficznych. </p> <ul> <li> <ul> <li> Dla <strong> NVIDIA </strong> oparte na GPU, przejdź do <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Strona zaawansowanego wyszukiwania sterowników NVIDIA </a> . </li> <li> Dla <strong> AMD </strong> oparte na GPU, przejdź do <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Centrum pobierania sterowników AMD (ATI). </a></li> <li> Dla <strong> Intel </strong> oparte na GPU, przejdź do <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Centrum pobierania grafiki Intel. </a></li> </ul> </li> </ul> <p> 3. Kontynuuj i zainstaluj pobrany sterownik. * </p> <p><strong> * Ważna uwaga: </strong> Jeśli posiadasz laptopa z dwoma (2) kartami graficznymi, najpierw zainstaluj sterowniki dla karty AMD lub NVIDIA i uruchom ponownie laptopa. Po ponownym uruchomieniu kontynuuj i zainstaluj sterowniki karty graficznej INTEL, a następnie ponownie uruchom laptopa. </p> <p> 4. Po instalacji <strong> uruchom ponownie </strong> komputera i sprawdź, czy problem KRYTYCZNY BŁĄD WIDEO DXGKRNL został rozwiązany. Jeśli nie, przejdź do następnego kroku. </p> <p> </p> <h3><br clear=\"all\"> Krok 3. Napraw DirectX, aby naprawić KRYTYCZNY BŁĄD WIDEO DXGKRNL. </h3> <p> BŁĄD KRYTYCZNY VIDEO DXGKRNL wskazuje na problem ze sterownikami Microsoft DirectX. Więc kontynuuj naprawę DirectX. </p> <p> 1. Pobierz <a href=\"https://www.microsoft.com/en-us/download/details.aspx?displaylang=en&id=35\" target=\"_blank\" rel=\"nofollow noopener\"> Instalator sieciowy DirectX End-User Runtime </a> . <br> 2. Uruchom pobrany plik (dxwebsetup.exe) i postępuj zgodnie z instrukcjami wyświetlanymi na ekranie, aby zainstalować opcjonalne składniki DirectX Runtime. </p> <p><img src=\"images/image_thumb-9-847.png\" alt=\"Install DirectX Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Po zakończeniu instalacji <strong> uruchom ponownie </strong> Twój komputer. </p> <p> 4. Po ponownym uruchomieniu przejdź do <strong> Początek <img src=\"images/image_thumb-55-571.png\" alt=\"image\" loading=\"lazy\"> -&gt; Ustawienia </strong> -&gt; <strong> Aktualizacja i zabezpieczenia -&gt; </strong> i kliknij <strong> Sprawdź aktualizacje. </strong></p> <p><img src=\"images/image_thumb-76-281.png\" alt=\"Windows 10 - Check For Updates \" loading=\"lazy\"></p> <p> 5. Po zainstalowaniu aktualizacji uruchom ponownie komputer i sprawdź, czy błąd BSOD został rozwiązany. Jeśli nie, przejdź do następnego kroku. </p> <p> </p> <h3><br clear=\"all\"> Krok 4. Napraw pliki systemowe Windows 10. </h3> <p> 1. Otwórz <strong> Wiersz polecenia jako administrator </strong> . <br> 2. W wierszu poleceń wydaj następujące polecenie i naciśnij <strong> Wchodzić: </strong></p> <ul> <li><strong> DISM.exe /Online /Cleanup-image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-176.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Po zakończeniu operacji DISM wpisz następujące polecenie i naciśnij <strong> Wchodzić </strong> : </p> <ul> <li><strong> sfc /skanuj </strong></li> </ul> <p><img src=\"images/image_thumb-37-464.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Teraz poczekaj, aż Kontroler plików systemowych naprawi pliki systemowe Windows. <br> 5. Kiedy to zrobisz, <strong> uruchom ponownie </strong> komputer i sprawdź, czy błąd nadal występuje. </p> <p> </p> <h3><br clear=\"all\"> Krok 5. Przeanalizuj plik dziennika Minidump (BSOD). </h3> <p> Gdy system Windows ulega awarii z niebieskim ekranem, szczegóły ekranu BSoD są zapisywane w małych plikach, które nazywają się „ <strong> MiniDump </strong> &quot;. Analiza <strong> Minidump </strong> plik(i) mogą pomóc w rozwiązywaniu problemów z niebieskim ekranem VIDEO DXGKRNL FATAL ERROR. Aby wykonać to zadanie, postępuj zgodnie z instrukcjami w tym artykule: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak analizować pliki MiniDump za pomocą BlueScreenView </a> . </p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}