{"title":"POPRAWKA: Plik nie zawiera strumieni audio ani wideo w programie Adobe Premiere.","content":"<p> Jeśli podczas importowania pliku wideo MP4 może pojawić się błąd Adobe Premiere „Niepowodzenie importu pliku” z opisem „Plik nie zawiera par audio lub wideo”, kontynuuj czytanie poniżej. Błąd „Plik nie zawiera par audio lub wideo” w programie Adobe Premiere, może pojawić się, chociaż wideo jest odtwarzane poprawnie w innych odtwarzaczach multimedialnych (VLC, Windows Media Player itp.). </p> <p><img src=\"images/image_thumb-43-349.png\" alt=\"FIX: File has no audio or video streams on Adobe Premiere\" loading=\"lazy\"></p> <p> </p> <p> Błędy Adobe Premiere podczas importowania pliku wideo mogą pojawić się z kilku powodów, dlatego w tym poradniku znajdziesz wszystkie dostępne metody rozwiązania problemu. </p> <h4> Rozwiązanie problemu: „Plik nie zawiera strumieni audio ani wideo” w programie Adobe Premiere. </h4> <h6> Metoda 1. Zainstaluj QuickTime. </h6> <p> Przede wszystkim upewnij się, że zainstalowałeś najnowszą <a href=\"https://support.apple.com/downloads/quicktime\" target=\"_blank\" rel=\"nofollow noopener\"> Szybki czas </a> na komputerze, a następnie spróbuj zaimportować plik mp4 w programie Adobe Premiere. </p> <p> </p> <h6> Metoda 2. Zmień nazwę pliku wideo. </h6> <p> 1. Utwórz kopię pliku wideo MP4 w innej lokalizacji na komputerze. (np. na pulpicie) <br> 2. Zmień nazwę pliku wideo w następujący sposób: </p> <blockquote><p> za. Podaj krótszą nazwę pliku wideo i… <br> b. Usuń wszelkie znaki specjalne z jego nazwy. (podkreślenia, nawiasy itp.). </p></blockquote> <p> 3. Otwórz plik wideo w Adobe Premiere. </p> <p> </p> <h6> Metoda 3. Zmień rozszerzenie nazwy pliku z MP4 na MOV. </h6> <p> Następną metodą ominięcia błędu Adobe Premiere „Plik nie zawiera strumieni audio lub wideo” jest zmiana rozszerzenia pliku wideo z .mp4 na .mov (lub odwrotnie). Aby to zrobić: </p> <p> 1. W Eksploratorze plików kliknij <strong> Widok </strong> -&gt; <strong> Opcje </strong> -&gt; <strong> Zmień folder i opcje wyszukiwania </strong> . </p> <p><img src=\"images/image_thumb-45-776.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. W <strong> Widok </strong> patka, <strong> jasny </strong> pole „Ukryj rozszerzenia znanych typów plików” i kliknij <strong> dobrze </strong> . * </p> <p> * Uwaga: Aby to ustawienie było trwałe, kliknij „Zastosuj do folderów” przed kliknięciem OK. </p> <p><img src=\"images/image_thumb-46-490.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Teraz kontynuuj i zmień nazwę/zmień rozszerzenie pliku wideo w następujący sposób: </p> <ul> <li> Jeśli plik wideo jest w formacie MP4 (.mp4), zmień jego rozszerzenie na .mov </li> <li> Jeśli plik wideo jest w formacie MOV (.mov), zmień jego rozszerzenie na .mp4 </li> </ul> <p><img src=\"images/image_thumb-47-586.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Na koniec otwórz plik wideo w Adobe Premiere. </p> <p> </p> <p> </p> <h6> Metoda 4. Wyczyść bazę danych pamięci podręcznej multimediów i pliki pamięci podręcznej. </h6> <p> Podczas importowania pliku multimedialnego (wideo lub audio) i podczas pracy z tym plikiem w programie Adobe Premiere program tworzy pliki pamięci podręcznej multimediów w celu zwiększenia wydajności. Ponadto program tworzy łącza do tych plików pamięci podręcznej w bazie danych pamięci podręcznej mediów. W tym czasie te pliki pamięci podręcznej multimediów i baza danych pamięci podręcznej multimediów mogą stać się zbyt duże lub uszkodzone i należy je wyczyścić, aby uniknąć problemów. </p> <p> Tak więc następną metodą rozwiązania problemu „Plik nie zawiera strumieni audio ani wideo” w programie Premiere jest wyczyszczenie „Bazy danych pamięci podręcznej multimediów” i usunięcie plików pamięci podręcznej. Aby to zrobić: * </p> <p><strong> A. Jak wyczyścić bazę danych pamięci podręcznej multimediów programu Adobe Premiere. </strong></p> <p> 1. Otwórz Adobe Premiere. <br> 2. Z menu przejdź do <strong> Edytować </strong> -&gt; <strong> Preferencje </strong> -&gt; <strong> Głoska bezdźwięczna. <br> </strong> 3. W bazie danych pamięci podręcznej multimediów kliknij <strong> Czysty </strong> przycisk. </p> <p><img src=\"images/image_thumb-48-167.png\" alt=\"Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> 4. <strong> Uruchom ponownie </strong> Adobe Premiere i spróbuj otworzyć plik wideo. jeśli błąd „Plik nie zawiera strumieni audio lub wideo” nadal występuje, przejdź do czyszczenia plików pamięci podręcznej programu Adobe Premiere, postępując zgodnie z poniższymi instrukcjami: </p> <p><strong> B. Jak wyczyścić pliki pamięci podręcznej multimediów programu Adobe Premiere. </strong></p> <p> 1. <strong> otwarty </strong> Premiera adobe. <br> 2. Z menu przejdź do <strong> Edytować </strong> -&gt; <strong> Preferencje </strong> -&gt; <strong> Głoska bezdźwięczna. <br> </strong> 3. W Media Cache Files kliknij <strong> Przeglądaj </strong> lub zanotuj lokalizację plików pamięci podręcznej multimediów. </p> <p><img src=\"images/image_thumb-49-331.png\" alt=\"FIX: Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Blisko </strong> Premiera adobe. <br> 5. W Eksploratorze plików <strong> kasować </strong> całą zawartość folderu „Pliki pamięci podręcznej multimediów”. <br> 6. Zaimportuj plik wideo w Premiere. </p> <p> </p> <h6> Metoda 5. Ponownie zakoduj plik wideo. </h6> <p> Ostatnią metodą rozwiązania problemu „Plik nie zawiera strumieni audio ani wideo” w procesie importowania Adobe Premiere jest ponowne zakodowanie pliku wideo. Aby to zrobić: </p> <p> 1. Pobierz i zainstaluj <a href=\"https://handbrake.fr/downloads.php\" target=\"_blank\" rel=\"nofollow noopener\"> Hamulec ręczny </a> . <br> 2. Otwórz hamulec ręczny i kliknij <strong> Plik – Otwórz pojedynczy plik wideo </strong> . </p> <p><img src=\"images/image_thumb-50-634.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Wybierz plik wideo, którego nie możesz zaimportować w Adobe Premiere i kliknij <strong> otwarty </strong> . <br> 4. Ustaw format wyjściowy na <strong> MP4, </strong> a następnie kliknij <strong> Przeglądaj </strong> i określ lokalizację przechowywania i nazwę wyjściowego (ponownie zakodowanego) pliku wideo. </p> <p><img src=\"images/image_thumb-51-817.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. W <strong> Wymiary </strong> ustaw te same wymiary, co plik źródłowy. <br> 6. Po zakończeniu kliknij <strong> Rozpocznij kodowanie. </strong></p> <p><img src=\"images/image_thumb-52-713.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Po zakończeniu procesu kodowania zamknij hamulec ręczny. <br> 7. Otwórz ponownie zakodowany plik wideo w Adobe Premiere. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}