{"title":"POPRAWKA: Błąd DISM 1009 Baza danych rejestru konfiguracji jest uszkodzona (rozwiązana).","content":"<p> Ten samouczek zawiera instrukcje dotyczące rozwiązania następującego problemu podczas uruchamiania polecenia DISM w systemie Windows 10: „Błąd 1009: Baza danych rejestru konfiguracji jest uszkodzona”. Błąd DISM 1009 może pojawić się podczas próby naprawy obrazu systemu Windows z uszkodzonym (uszkodzonym) rejestrem za pomocą jednego z następujących poleceń DISM w wierszu polecenia: </p> <ul> <li> Dism /Online /Cleanup-Image /Restorehealth </li> <li> Dism /Online /Cleanup-image /Restorehealth /source:wim:X:\\sources\\install.wim:1 /LimitAccess </li> </ul> <p> …lub podczas korzystania z polecenia DISM w środowisku odzyskiwania systemu Windows (WinRE) </p> <ul> <li> Dism.exe /Image:X:\\ /Cleanup-Image /Restorehealth </li> </ul> <p> </p> <h4> Jak naprawić błąd DISM 1009: Baza danych rejestru jest uszkodzona. </h4> <p><strong> Wymagania </strong> : Aby rozwiązać błąd dism 1009, musisz uruchomić komputer z nośnika instalacyjnego Windows (USB lub DVD). Jeśli nie posiadasz nośnika instalacyjnego Windows, możesz go utworzyć za pomocą <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Narzędzie do tworzenia multimediów firmy Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak utworzyć nośnik instalacyjny USB systemu Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak utworzyć nośnik instalacyjny DVD z systemem Windows 10. </a></li> </ul> <p> </p> <h6> Metoda 1. Przywróć system Windows 10 w takim stanie, w jakim był przed zainstalowaniem aktualizacji. </h6> <p> Błąd DISM 1009 pojawia się zwykle po nieudanej instalacji Windows Update. Przede wszystkim anuluj instalację aktualizacji. Aby to zrobić: </p> <p> 1. Uruchom system z nośnika instalacyjnego Windows. <br> 2. Na poniższym ekranie naciśnij <strong> ZMIANA </strong> + <strong> F10 </strong> klawisze, aby uruchomić wiersz polecenia. (lub kliknij <strong> Kolejny </strong> i idź do <strong> Napraw mój komputer </strong> &gt; <strong> Rozwiązywanie problemów </strong> &gt; <strong> Wiersz polecenia </strong> ). </p> <p><img src=\"images/image_thumb-72-743.png\" alt=\"FIX DISM Error 1009 -The configuration registry database is corrupt\" loading=\"lazy\"></p> <p> </p> <p> 3. W wierszu poleceń uzyskaj listę wszystkich dysków w systemie za pomocą tego polecenia: </p> <ul> <li><strong> wmic Logicdisk zdobądź nazwę </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-491.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> 4. Następnie dowiedz się, który dysk zawiera folder „Windows”, wpisując to polecenie: * </p> <ul> <li><strong> dir DriveList: </strong></li> </ul> <p> * np. Aby zobaczyć zawartość dysku C:, wpisz: „ <strong> reż. C: </strong> ” (bez cudzysłowów). Jeśli nie widzisz folderu „Windows” na dysku C:, przejdź do następnej litery dysku (np. „dir D:”, „dir E:” itp.), aż zobaczysz Folder „Windows” na jednym z wymienionych dysków (z powyższego polecenia). </p> <p> [Jak widać na poniższym zrzucie ekranu, folder Windows (w tym przypadku) znajduje się na dysku D:.] </p> <p> </p> <p><img src=\"images/image_thumb-69-704.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Po znalezieniu, na którym dysku znajduje się dysk „Windows” (np. w tym przykładzie, na dysku „D:”), przejdź do tego dysku, wpisując DriveLetter <strong> : </strong> + <strong> Wchodzić </strong> . </p> <p> 6. Następnie utwórz folder scratch na dysku, wpisując to polecenie: </p> <ul> <li><strong> mkdir D:\\Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-186.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Następnie wydaj poniższe polecenie, aby przywrócić system po nieudanej aktualizacji: </p> <ul> <li><strong> DISM /Image:D:\\ /ScratchDir:D:\\Scratch /Cleanup-Image /RevertPendingActions </strong></li> </ul> <p> * Uwaga: zmień literę dysku <strong> re </strong> zgodnie z twoim przypadkiem. </p> <p> 8. Po wykonaniu powyższego polecenia DISM na ekranie powinien pojawić się następujący komunikat: </p> <p><em> „Cofanie oczekujących działań z obrazu…. <br> Operacja zakończona. Każde cofnięcie oczekujących działań zostanie podjęta po ponownym uruchomieniu <br> Operacja zakończona sukcesem.&quot; </em></p> <p><img src=\"images/image_thumb-71-222.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. <strong> Blisko </strong> wiersz polecenia i <strong> uruchom ponownie </strong> Twój komputer. * </p> <p> 10. Jeśli system Windows uruchamia się normalnie, kontynuuj pracę. Jeśli system Windows nie uruchomi się i spróbuje ponownie zainstalować aktualizacje, to: </p> <blockquote><p> 1. Wyłącz komputer. <br> 2. Uruchom ponownie komputer z nośnika instalacyjnego Windows. <br> 3. Uruchom wiersz polecenia. <br> 4. W wierszu polecenia podaj następujące polecenia w kolejności (nie zapomnij zmienić litery dysku) <strong> re </strong> zgodnie z Twoim przypadkiem): </p></blockquote> <ul> <li> <ul> <li> del D:\\Windows\\SoftwareDistribution </li> <li> del D:\\Windows\\WinSxS\\cleanup.xml </li> <li> del D:\\Windows\\WinSxS\\oczekujący.xml </li> </ul> </li> </ul> <blockquote><p> 5. Po zakończeniu zamknij wiersz polecenia i <strong> uruchom ponownie </strong> Twój komputer. * </p></blockquote> <p> * Uwaga: Jeśli rozruch ponownie się nie powiedzie, uruchom ponownie w wierszu poleceń WinRE i wydaj następujące polecenia (nie zapomnij zmienić litery dysku <strong> re </strong> zgodnie z Twoim przypadkiem): </p> <ul> <li> chkdsk /f D: </li> <li> sfc /scannow /offbootdir=D:\\ /offwindir=D:\\windows </li> <li> dism /image:D:\\ /cleanup-image /restorehealth <ul></ul> </li> </ul> <p> </p> <h6> Metoda 2. Przywróć rejestr systemu Windows z kopii zapasowej. </h6> <p> Następną metodą naprawienia błędu dism 1009 jest przywrócenie rejestru systemu Windows z folderu „RegBack”. * </p> <p> * Informacja: Folder &#39;RegBack&#39; (pełna ścieżka = Windows\\System32\\Config\\RegBack) to lokalizacja, w której system Windows automatycznie przechowuje kopię zapasową plików rejestru podczas uruchamiania komputera. </p> <p> Aby przywrócić rejestr z folderu RegBack: </p> <p> 1. Uruchom system z nośnika instalacyjnego systemu Windows, a następnie wykonaj kroki 1-5 z metody 1 powyżej, aby przejść do dysku systemu Windows. (np. „D:” w tym przykładzie). </p> <p> 2. Przede wszystkim wykonaj kopię zapasową bieżących plików rejestru, wydając kolejno następujące polecenia. (Naciśnij <strong> Wchodzić </strong> po wpisaniu każdego polecenia): </p> <ul> <li><strong> cd \\windows\\system32\\config </strong></li> <li><strong> Kopia zapasowa md </strong></li> <li><strong> kopiuj *.* Kopia zapasowa </strong></li> </ul> <p><img src=\"images/image_thumb-26-678.png\" alt=\"infinite Automatic Repair loop windows 10 fix\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Teraz przejdź do <strong> RegBack </strong> folder, wydając to polecenie: </p> <ul> <li><strong> cd RegBack </strong></li> </ul> <p> 4. Następnie wpisz <strong> DIR </strong> (aby wyświetlić zawartość folderu RegBack). </p> <p> 5. Teraz sprawdź, czy któryś z wymienionych plików ma <strong> 0</strong> (zero) bajtów w ich rozmiarze pliku i postępuj zgodnie z poniższym opisem: </p> <ul> <li><strong> Przypadek A. </strong> Jeśli któryś z wymienionych plików ma rozmiar 0 (zero) bajtów, to <strong> Zatrzymaj się tutaj </strong> , i <strong> przejdź do następnej metody </strong> , ponieważ pliki kopii zapasowej rejestru są bezużyteczne lub uszkodzone. </li> <li><strong> Przypadek B. </strong> Jeśli wszystkie wymienione pliki mają rozmiar inny od zera (jak na poniższym zrzucie ekranu), przejdź do następnego kroku. </li> </ul> <p><img src=\"images/image_thumb-27-525.png\" alt=\"restore registry from backup\" loading=\"lazy\"></p> <p> </p> <p> 6. Skopiuj pliki rejestru z <strong> Windows\\System32\\Config\\RegBack </strong> folder do <strong> Windows\\System32\\Config\\ </strong> folder, wydając to polecenie: </p> <p> </p> <ul> <li><strong> Kopiuj *.* .. </strong></li> </ul> <p> 7. Po wyświetleniu monitu naciśnij <strong> ZA </strong> aby nadpisać pliki w miejscu docelowym po wydaniu polecenia kopiowania. </p> <p><img src=\"images/image_thumb-28-138.png\" alt=\"fix startup repair loop\" loading=\"lazy\"></p> <p> </p> <p> 8. Po zakończeniu kopiowania wpisz <strong> Wyjście </strong> i naciśnij <strong> Wchodzić </strong> aby zamknąć wiersz polecenia. <br> 9. <strong> Uruchom ponownie </strong> komputer i spróbuj uruchomić system Windows. </p> <p> * Uwaga: Jeśli system Windows nie uruchomi się ponownie, uruchom ponownie to wiersz poleceń WinRE i wydaj następujące polecenia (nie zapomnij zmienić litery dysku <strong> re </strong> zgodnie z Twoim przypadkiem): </p> <ul> <li> chkdsk /f D: </li> <li> sfc /scannow /offbootdir=D:\\ /offwindir=D:\\windows </li> <li> dism /image:D:\\ /cleanup-image /restorehealth </li> </ul> <p> </p> <h6> Metoda 3. Przywróć system Windows 10 do poprzedniego stanu roboczego. </h6> <p> Następną metodą rozwiązania błędu dism „1009 – Baza danych rejestru konfiguracji jest uszkodzona”, jest przywrócenie systemu do poprzedniego stanu roboczego. Aby to zrobić: </p> <p> 1. Uruchom system z nośnika instalacyjnego Windows. <br> 2. Na poniższym ekranie kliknij <strong> Kolejny </strong> a następnie kliknij <strong> Napraw swój komputer </strong> &gt; <strong> Rozwiązywanie problemów. </strong></p> <p><img src=\"images/image_thumb-73-301.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. W <strong> Zaawansowane opcje </strong> Kliknij <strong> Przywracanie systemu. * </strong></p> <p> * Uwaga: Jeśli <strong> Wróć do poprzedniej kompilacji </strong> opcja jest dostępna na tym ekranie, a następnie wybierz tę opcję. </p> <p><img src=\"images/image_thumb-76-326.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Na następnym ekranie kliknij swój system operacyjny. </p> <p><img src=\"images/image_thumb-77-265.png\" alt=\"image\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 5. Następnie w Kreatorze przywracania systemu kliknij <strong> Kolejny </strong> a następnie wybierz wcześniejszy stan pracy (Data/Czas) i kliknij <strong> Kolejny </strong> aby rozpocząć proces przywracania. </p> <p><img src=\"images/image_thumb-50-788.png\" alt=\"system restore windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Metoda 4. Napraw system Windows 10. </h6> <p> Ostatnią metodą rozwiązywania błędów dism jest: <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> napraw system Windows 10 za pomocą uaktualnienia na miejscu </a> lub wykonać kopię zapasową plików, a następnie <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> czysta instalacja systemu Windows 10 </a> . </p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}