{"title":"POPRAWKA: 2147219196 Błąd systemu plików w aplikacji Zdjęcia w systemie Windows 10 (rozwiązany)","content":"<p> Na komputerze z systemem Windows 10 z aplikacją „Zdjęcia” jako domyślną aplikacją do otwierania obrazów pojawia się „Błąd systemu plików „-2147219196”, gdy użytkownik próbuje otworzyć obraz .JPG lub .PNG (z opcją „ZDJĘCIA” aplikacja). </p> <p><img src=\"images/image_thumb-73-456.png\" alt=\"FIX: 2147219196 File system error in Photos app \" loading=\"lazy\"></p> <p> </p> <p> Ten samouczek zawiera instrukcje rozwiązywania problemu „Błąd systemu plików 2147219196” podczas otwierania obrazów w aplikacji Zdjęcia w systemie Windows 10. </p> <h4> Jak naprawić: Nie można otworzyć obrazów za pomocą aplikacji „Zdjęcia” w systemie Windows 10 z błędem „Błąd systemu plików 2147219196”. </h4> <p> Uwaga: zanim przejdziesz dalej, upewnij się, że Twój system jest w pełni zaktualizowany. </p> <h6> Krok 1. Uruchom narzędzie do rozwiązywania problemów z aplikacjami Windows Store. </h6> <p> 1. Przejdź do <strong> Początek </strong> -&gt; <strong> Ustawienia </strong> -&gt; <strong> Aktualizacja i bezpieczeństwo </strong> . <br> 2. Wybierz <strong> Rozwiązywanie problemów </strong> od lewej, a następnie kliknij w <strong> Narzędzie do rozwiązywania problemów z aplikacjami Sklepu Windows </strong> po prawej i kliknij <strong> Uruchom narzędzie do rozwiązywania problemów </strong> . </p> <p><img src=\"images/image_thumb-74-400.png\" alt=\"windows store apps troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 3. Postępuj zgodnie z instrukcjami wyświetlanymi na ekranie i pozwól, aby narzędzie do rozwiązywania problemów rozwiązało problemy. <br> 4. Po zakończeniu rozwiązywania problemów zamknij narzędzie do rozwiązywania problemów i spróbuj otworzyć plik obrazu. Jeśli błąd będzie się powtarzał, przejdź do następnego kroku. </p> <p><img src=\"images/image_thumb-75-371.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Krok 2. Napraw lub zresetuj aplikację Zdjęcia. </h6> <p> Jeśli otrzymasz „2147219196”, gdy spróbujesz otworzyć plik .JPG lub .PNG w aplikacji Zdjęcia, spróbuj naprawić aplikację. Aby to zrobić: </p> <p> 1. Przejdź do <strong> Początek </strong> -&gt; <strong> Ustawienia </strong> -&gt; <strong> Aplikacje. <br> </strong> 2. W <strong> Aplikacja i funkcje, </strong> zlokalizuj i wybierz <strong> Zdjęcia Microsoft </strong> i kliknij <strong> Zaawansowane opcje. </strong></p> <p><img src=\"images/image_thumb-76-358.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. W Opcjach zaawansowanych kliknij <strong> Naprawic </strong> przycisk. <br> 4. Po zakończeniu procesu zobaczysz znacznik wyboru <img src=\"images/image_thumb-77-553.png\" alt=\"image\" loading=\"lazy\"> obok przycisku „Napraw”. Kontynuuj i sprawdź, czy „Błąd systemu plików 2147219196” został rozwiązany, otwierając zdjęcie. <br> 5. Jeśli problem będzie się powtarzał, kliknij <strong> Resetowanie </strong> przycisk, aby zresetować ustawienia aplikacji Zdjęcia. </p> <p><img src=\"images/image_thumb-78-665.png\" alt=\"repair - reset photos app\" loading=\"lazy\"></p> <p> </p> <h6> Krok 3. Całkowicie usuń i ponownie zainstaluj aplikację Zdjęcia. </h6> <p> Następnym krokiem, aby naprawić „Błąd systemu plików „-2147219196” w aplikacji Zdjęcia, jest całkowite usunięcie z systemu i ponowne zainstalowanie aplikacji Zdjęcia. </p> <p> 1. Otwórz <strong> PowerShell </strong> tak jak <strong> Administrator </strong> . <br> 2. W PowerShell podaj następujące polecenie i naciśnij <strong> Wchodzić </strong> , aby całkowicie usunąć aplikację Zdjęcia: * </p> <ul> <li><strong> Get-AppxPackage * zdjęcia * | Usuń-AppxPackage -allusers </strong></li> </ul> <p> *Informacje: Powyższe polecenie odinstaluje aplikację Zdjęcia z systemu Windows 10, a także usunie pliki instalacyjne i resztki aplikacji Zdjęcia z katalogu „C: \\ Program Files \\ WindowsApps \\ \\”. </p> <p><img src=\"images/image_thumb-95-600.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Po wykonaniu polecenia, <strong> uruchom ponownie </strong> Twój komputer. <br> 4. Otwórz sklep Microsoft i zainstaluj <a href=\"https://www.microsoft.com/en-us/p/microsoft-photos/9wzdncrfjbh4#activetab=pivot:overviewtab\" target=\"_blank\" rel=\"nofollow noopener\"> Zdjęcia Microsoft </a> . </p> <p><img src=\"images/image_thumb-89-238.png\" alt=\"reinstall photos app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Kliknij <strong> Zainstalować, </strong> aby ponownie zainstalować aplikację Zdjęcia w systemie. </p> <p><img src=\"images/image_thumb-90-948.png\" alt=\"install photos app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Po zainstalowaniu aplikacji Zdjęcia otwórz obraz. Błąd „Błąd systemu plików 2147219196” powinien zostać rozwiązany. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}