{"title":"POPRAWKA: Lexmark Powolne drukowanie wielu stron w systemie Windows 10 (rozwiązany)","content":"<p> Na komputerze z systemem Windows 10 z zainstalowaną drukarką Lexmark drukowanie wielu stron jest powolne. Problem z powolnym drukowaniem Lexmarka w systemie Windows 10 jest zwykle spowodowany nieprawidłowym sterownikiem drukarki lub nieprawidłowymi ustawieniami drukarki (Preferencje). Aby rozwiązać ten problem, czytaj dalej poniżej. </p> <p><img src=\"images/image_thumb-29-115.png\" alt=\"FIX: Lexmark Slow Printing in Multiple Pages on Windows 10 \" loading=\"lazy\"></p> <p> Szczegóły problemu z powolnym drukowaniem Lexmarka: W systemie Windows 10 drukarka Lexmark drukuje szybko podczas drukowania jednej strony, ale gdy chcesz wydrukować wiele stron, drukowanie jest powolne, ponieważ proces drukowania trwa zbyt długo, a następnie drukarka drukuje jedną stronę na raz co 1-2 minuty. </p> <p> Ten samouczek zawiera instrukcje dotyczące rozwiązania problemu z powolnym drukowaniem wielu stron w drukarce Lexmark w systemie Windows 10. </p> <ul> <li><strong> Powiązany artykuł: </strong> <a href=\"https://www.repairwin.com/fix-slow-pdf-printing-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> POPRAWKA: Powolne drukowanie plików PDF w systemie Windows 10 </a></li> </ul> <h4> Jak naprawić: Powolne drukowanie wielu stron w drukarce Lexmark w systemie Windows 10. </h4> <h6> Metoda 1. Zmodyfikuj ustawienia drukarki. </h6> <p> 1. Przejdź do <strong> Panel sterowania </strong> -&gt; <strong> Urządzenia i drukarki. </strong><br> 2. Kliknij prawym przyciskiem myszy drukarkę i wybierz <strong> Nieruchomości. </strong></p> <p><img src=\"images/image_thumb-30-253.png\" alt=\"Printer Properties\" loading=\"lazy\"></p> <p> 3. W zakładce „Ogólne” <strong> kliknij Zmień właściwości. </strong></p> <p><img src=\"images/image_thumb-31-900.png\" alt=\"Change Printer Properties\" loading=\"lazy\"></p> <p> 4. W oknie Preferencje drukowania firmy Lexmark ustaw <strong> Rodzaj papieru </strong> do <strong> Równina </strong> i kliknij <strong> DOBRZE. * </strong></p> <p> * Uwaga: Inne ustawienia, które można zastosować w drukarce w celu poprawy szybkości drukowania: </p> <ul> <li><strong> Rozdzielczość druku </strong><strong> : </strong> 600 dpi spowolni pracę drukarki. </li> <li><strong> Tryb cichy </strong><strong> : </strong> Poza </li> </ul> <p><img src=\"images/image_thumb-32-858.png\" alt=\"FIX Slow Lexmark Printing Lexmark - Windows 10\" loading=\"lazy\"></p> <p> 5. Teraz kliknij <strong> Zastosować </strong> i <strong> dobrze </strong> w oknie „Właściwości drukarki”, aby zastosować zmianę. <br> 6. Otwórz dokument z wieloma stronami i sprawdź, czy problem został rozwiązany. Jeśli nie, przejdź do metody-2 poniżej. </p> <h6> Metoda 2. Zmień sterownik drukarki. </h6> <p> 1. Przejdź do <strong> Panel sterowania </strong> -&gt; <strong> Urządzenia i drukarki. </strong><br> 2. Kliknij prawym przyciskiem myszy drukarkę i wybierz <strong> Odłącz urządzenie. </strong></p> <p><img src=\"images/image_thumb-33-755.png\" alt=\"Uninstall Printer Windows 10\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 2. Po usunięciu drukarki przejdź do <strong> Programy i funkcje </strong> w Panelu sterowania i <strong> odinstaluj </strong> <strong> Oprogramowanie Lexmark </strong> (o żadnym). </p> <p> 3. Przejdź do <a href=\"https://www.lexmark.com/en_us/support/download-search.html\" target=\"_blank\" rel=\"nofollow noopener\"> Lexmark Sterowniki i pliki do pobrania </a> i wyszukaj dostępne sterowniki dla Twojego modelu drukarki i systemu operacyjnego. <br> 4. Z listy dostępnych sterowników pobierz i zainstaluj jeden z następujących sterowników: * </p> <ul> <li> <p> Uniwersalny sterownik druku. </p> </li> <li> <p> Uniwersalny sterownik druku emulacji PCL5e. </p> </li> <li> <p> Uniwersalny sterownik druku emulacji PostScript 3. </p> </li> </ul> <p> * Uwaga: Proponuję wypróbować sterowniki druku w kolejności podanej powyżej. </p> <p> 5. Po zakończeniu instalacji sterownika drukarki, <strong> uruchom ponownie </strong> Twój komputer. <br> 6. Po ponownym uruchomieniu spróbuj wydrukować długi dokument. Problem z powolnym drukowaniem powinien zostać naprawiony. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym problemie. </p>"}