{"title":"POPRAWKA: Podłączanie pulpitu zdalnego w systemie Mac OS nie może zweryfikować tożsamości komputera, z którym chcesz się połączyć. (Rozwiązany)","content":"<p> W tym samouczku znajdziesz instrukcje dotyczące rozwiązania problemu „Połączenie pulpitu zdalnego nie może zweryfikować tożsamości komputera, z którym chcesz się połączyć. Spróbuj ponownie połączyć się z komputerem z systemem Windows lub skontaktuj się z naszym administratorem.”, gdy próbujesz połączyć się przez RDP z komputera z systemem Mac OS do Windows RDSH Server 2016. </p> <p><img src=\"images/image_thumb-32-846.png\" alt=\"FIX: MAC OS Remote Desktop Connection cannot verify the identity of the computer that you want to connect to.\" loading=\"lazy\"></p> <p> </p> <h4> Jak naprawić: Połączenie pulpitu zdalnego MacOSX nie może zweryfikować tożsamości komputera, z którym chcesz się połączyć. </h4> <h6> Metoda 1. Pobierz najnowszego klienta RDP ze sklepu MAC App Store. </h6> <p> 1. Pobierz i zainstaluj oraz najnowsze <a href=\"https://itunes.apple.com/us/app/microsoft-remote-desktop/id715768417?mt=12&ign-mpt=uo%3D4\" target=\"_blank\" rel=\"nofollow noopener\"> Klient pulpitu zdalnego firmy Microsoft </a> na twoim MAC. (Jeśli używasz urządzenia IOS, pobierz klienta RDP z <a href=\"https://itunes.apple.com/us/app/microsoft-remote-desktop/id714464092?mt=8&ign-mpt=uo%3D4\" target=\"_blank\" rel=\"nofollow noopener\"> tutaj </a> .) <br> 2. Po instalacji spróbuj ponownie połączyć się z serwerem Windows RDP Server. Jeśli problem będzie się powtarzał, przejdź do metody-2 poniżej. </p> <p> </p> <h6> Metoda 2. Zmodyfikuj ustawienia zasad grupy na serwerze Windows RDSH. </h6> <p> Na serwerze hosta sesji usług pulpitu zdalnego (RDSH) 2016 zmodyfikuj zasady grupy w następujący sposób: </p> <p> 1. Naciśnij jednocześnie Windows <img src=\"images/image_thumb36-211.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. Typ <strong> gpedit.msc </strong> &amp; Naciśnij <strong> Wchodzić. </strong></p> <p><img src=\"images/image_thumb-78-784.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. W lewym okienku przejdź do: </p> <ul> <li><strong> konfiguracja komputera </strong> &gt; <strong> Szablony administracyjne </strong> &gt; <strong> Komponenty systemu Windows </strong> &gt; <strong> Usługi pulpitu zdalnego </strong> &gt; <strong> Host sesji usług pulpitu zdalnego </strong> &gt; <strong> Bezpieczeństwo </strong></li> </ul> <p> 4. W prawym okienku otwórz <strong> Wymagaj użycia określonej warstwy bezpieczeństwa dla połączeń zdalnych (RDP) </strong> oprawa. </p> <p><img src=\"images/image_thumb-36-865.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4a. Czek <strong> Włączone </strong> , ustaw „Warstwa bezpieczeństwa” na <strong> PROW </strong> i kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-37-183.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Teraz otwórz <strong> Wymagaj uwierzytelniania użytkownika dla połączeń zdalnych przy użyciu uwierzytelniania na poziomie sieci </strong> ustawienie, ustaw go na <strong> Niepełnosprawny </strong> i kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-38-109.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Blisko </strong> Edytor zasad grupy. <br> 7. <strong> Uruchom ponownie </strong> komputer, aby zastosować zmiany lub otworzyć wiersz polecenia z podwyższonym poziomem uprawnień i wydać następujące polecenie: </p> <ul> <li><strong> gpupdate / życie </strong></li> </ul> <p> Otóż ​​to! Która metoda zadziałała dla Ciebie? <br> Daj mi znać, czy ten przewodnik Ci pomógł, zostawiając komentarz na temat swojego doświadczenia. Polub i udostępnij ten przewodnik, aby pomóc innym. </p>"}