{"title":"POPRAWKA: Brak dźwięku z głośników wewnętrznych laptopa HP OMEN (rozwiązany)","content":"<p> Ten samouczek zawiera instrukcje krok po kroku, jak rozwiązać problem „braku dźwięku z wewnętrznych głośników” na <a href=\"https://support.hp.com/ph-en/document/c05576170\" target=\"_blank\" rel=\"nofollow noopener\"> Laptop Omen od HP – 17-an009nv </a> . Problem „braku dźwięku z głośników laptopa” może wystąpić w każdym modelu laptopa HP i zwykle występuje po zainstalowaniu aktualizacji sterownika systemu Windows dla urządzenia Realtek High Definition Audio. </p> <p> Szczegóły problemu: Na laptopie HP z systemem Windows 10 nie słychać dźwięku z głośników wewnętrznych podczas odtwarzania muzyki lub wideo, ale głośniki działają normalnie podczas przeprowadzania testów diagnostycznych HP poza systemem operacyjnym. Ponadto problem „braku dźwięku” występuje tylko w przypadku głośników laptopa, a nie głośników zewnętrznych lub słuchawek. </p> <h4> Jak naprawić: Głośniki laptopa nie mają dźwięku w systemie Windows 10. </h4> <h6> Krok 1. Zwiększ głośność dźwięku </h6> <p> 1. <strong> Kliknij prawym przyciskiem myszy </strong> na <strong> ikona dźwięku </strong><img src=\"images/image_thumb-11-503.png\" alt=\"image\" loading=\"lazy\"> na pasku zadań i wybierz <strong> Otwórz mikser głośności. </strong></p> <p><img src=\"images/image_thumb-12-807.png\" alt=\"Open Volume Mixer\" loading=\"lazy\"></p> <p> 2. Przeciągnij suwak Głośniki do <strong> Top </strong> i sprawdź, czy słyszysz dźwięk. </p> <p><img src=\"images/image_thumb-13-813.png\" alt=\"Adjust Sound Volume\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Krok 2. Ustaw głośniki jako domyślne urządzenie odtwarzające. </h6> <p> 1. Przejdź do Windows <strong> Panel sterowania </strong> i otwarte <strong> Dźwięk. </strong></p> <p><img src=\"images/image_thumb-14-315.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Upewnij się, że <strong> Głośniki </strong> jest <strong> Domyślna </strong> urządzenie odtwarzające, w przeciwnym razie wybierz głośniki i kliknij <strong> Ustaw domyślne </strong> przycisk. Po zakończeniu przetestuj głośniki, a jeśli problem będzie się powtarzał, przejdź do następnego kroku. </p> <p><img src=\"images/image_thumb-15-993.png\" alt=\"Set Speakers as Default Playback Device\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Krok 3. Przetestuj głośniki wewnętrzne poza systemem Windows. </h6> <p> Następnym krokiem do rozwiązania problemu „braku dźwięku w głośnikach wewnętrznych” na laptopie jest sprawdzenie, czy głośniki działają podczas uruchamiania testów diagnostycznych sprzętu HP. Aby to zrobić: </p> <p> 1. <strong> Wyłączyć </strong> Twój laptop. <br> 2. Włącz laptopa i natychmiast naciśnij <strong> WYJŚCIE </strong> klawisz wielokrotnie. <br> 3. Gdy pojawi się menu, naciśnij <strong> F2 </strong> klucz. <br> 4. W menu głównym kliknij <strong> Testy komponentów </strong> a następnie kliknij <strong> AUDIO. <br> </strong> 5. Jeśli podczas testów audio słychać dźwięk z głośników, przejdź do kroku 3 poniżej. * </p> <p><strong> * Uwaga: </strong> Jeśli nie słyszysz dźwięku z głośników, zatrzymaj się tutaj, ponieważ występuje problem sprzętowy, który może naprawić tylko wyspecjalizowany technik laptopa (serwis). </p> <p><img src=\"images/image_thumb-22-211.png\" alt=\"HP Diagnostics - Component Test\" loading=\"lazy\"></p> <p> </p> <h6><br clear=\"all\"> Krok 4. Przywróć sterownik karty dźwiękowej. </h6> <p> 1. Otwórz <strong> Menadżer urządzeń </strong> . Aby to zrobić: </p> <blockquote><p> 1. Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-958.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. W polu „Otwórz” wpisz: <strong> devmgmt.msc </strong> &amp; Kliknij <strong> dobrze </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-5-510.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Rozszerzać </strong> <strong> Kontrolery dźwięku, wideo i gier. </strong></p> <p> 3. <strong> Kliknij prawym przyciskiem myszy </strong> na <strong> Dźwięk wysokiej rozdzielczości Realtek </strong> urządzenie i wybierz <strong> Nieruchomości. </strong></p> <p><img src=\"images/image_thumb-17-678.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. Na karcie Sterownik kliknij <strong> Przywróć sterownik </strong> przycisk. <strong> * </strong></p> <p><strong> * Uwaga: </strong> Jeśli przycisk Przywróć sterownik jest nieaktywny, przejdź do następnego kroku. </p> <p><img src=\"images/image_thumb-18-178.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> </p> <p> 5. Wybierz przyczynę wycofania pakietu sterowników i kliknij <strong> Tak. </strong></p> <p><img src=\"images/image_thumb-19-167.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Po zakończeniu przywracania sterowników <strong> uruchom ponownie </strong> Twój komputer. <br> 5. Po ponownym uruchomieniu przejdź i przetestuj dźwięk z głośników laptopa. Jeśli nadal nie słychać dźwięku z głośników laptopa, przejdź do następnego kroku. </p> <p> </p> <h6><br clear=\"all\"> Krok 5. Zmień sterownik karty dźwiękowej. </h6> <p> 1. Otwórz <strong> Menadżer urządzeń. </strong><br> 2. <strong> Rozszerzać </strong> <strong> Kontrolery dźwięku, wideo i gier. <br> </strong> 3. <strong> Kliknij prawym przyciskiem myszy </strong> w <strong> Dźwięk wysokiej rozdzielczości Realtek </strong> urządzenie {lub w at <strong> „Realtek High Definition Audio (SST) </strong> urządzenie} i wybierz <strong> Uaktualnij sterownik. <br> </strong></p> <p><img src=\"images/image_thumb-6-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Wybierz <strong> Przeglądaj mój komputer w poszukiwaniu sterowników. </strong></p> <p><img src=\"images/image_thumb-7-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Wybierz <strong> Pozwól mi wybrać z listy dostępnych sterowników na moim komputerze </strong> . </p> <p><img src=\"images/image_thumb-8-771.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> </p> <p> 6. Na następnym ekranie wykonaj jedną z następujących czynności, w zależności od przypadku: </p> <p><strong> Przypadek A. </strong> Jeśli w polu „Pokaż zgodny sprzęt” zobaczysz urządzenia „High Definition Audio” i „Realtek High Definition Audio”, a następnie wybierz <strong> Urządzenie audio wysokiej rozdzielczości </strong> i kliknij <strong> Kolejny. </strong></p> <p><img src=\"images/image_thumb-20-130.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p><strong> Przypadek B. </strong> Jeśli w polu „Pokaż zgodny sprzęt” zobaczysz tylko <strong> „Realtek High Definition Audio (SST) </strong> urządzenie, to: </p> <blockquote><p> za. <strong> Odznacz </strong> <strong> Pokaż pole wyboru zgodnego sprzętu. </strong></p></blockquote> <p><img src=\"images/image_thumb-9-565.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Wybierz <strong> Dźwięk wysokiej rozdzielczości Realtek </strong> sterownik i kliknij <strong> Kolejny. </strong></p></blockquote> <p><img src=\"images/image_thumb-10-248.png\" alt=\"FIX No Sound from Internal Speakers on Laptop\" loading=\"lazy\"></p> <p> </p> <p> 8. Po zakończeniu instalacji sterownika, <strong> uruchom ponownie </strong> Twój komputer. <br> 9. Po ponownym uruchomieniu przejdź i przetestuj dźwięk z głośników laptopa. </p> <p> </p> <h6><br clear=\"all\"> Krok 6. Odinstaluj i ponownie zainstaluj sterownik karty dźwiękowej. </h6> <p> 1. Otwórz <strong> Menadżer urządzeń. </strong><br> 2. <strong> Rozszerzać </strong> <strong> Kontrolery dźwięku, wideo i gier. <br> </strong> 3. <strong> Kliknij prawym przyciskiem myszy </strong> w <strong> Dźwięk wysokiej rozdzielczości Realtek </strong> urządzenie i wybierz <strong> Odinstaluj urządzenie. </strong></p> <p><img src=\"images/image_thumb-21-889.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. Po odinstalowaniu <strong> uruchom ponownie </strong> komputera i pozwól systemowi Windows na automatyczną instalację sterowników dźwięku. Jeśli tak się nie stanie, przejdź do <strong> Ustawienia </strong> &gt; <strong> Aktualizacja i bezpieczeństwo </strong> i zmuś system Windows do <strong> Sprawdź aktualizacje, </strong> lub przejdź do kroku 7 poniżej. </p> <p> </p> <h6><br clear=\"all\"> Krok 7. Zaktualizuj sterowniki karty dźwiękowej. </h6> <p> Przejdź do witryny pomocy technicznej producenta laptopa i pobierz i zainstaluj najnowszy sterownik karty dźwiękowej. Jeśli nie możesz znaleźć sterownika karty dźwiękowej na stronie wsparcia producenta lub jeśli po zainstalowaniu nowego sterownika nadal występuje problem „braku dźwięku z głośników wewnętrznych”, spróbuj wykonać następujące czynności, jeśli posiadasz urządzenie Realtek HD Audio. </p> <p> 1. Przeczytaj instrukcje na ten temat <a href=\"https://www.repairwin.com/how-to-download-realtek-audio-manager-realtek-audio-drivers-windows-10-8-1-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> artykuł </strong></a> do <strong> Ściągnij </strong> <strong> Sterownik audio Realtek HD v2.82. <br> </strong> 2. Po pobraniu kontynuuj i <strong> zainstalować </strong> <strong> Sterownik audio Realtek HD. <br> </strong> 3. Po instalacji <strong> uruchom ponownie </strong> komputera i przetestuj dźwięk z głośników. * </p> <p><strong> Uwaga końcowa: </strong> Jeśli problem z dźwiękiem głośników nadal występuje, zajrzyj do Menedżera urządzeń, a jeśli urządzenie dźwiękowe jest wymienione jako „Realtek High Definition Audio (SST)”, postępuj zgodnie z instrukcjami w kroku 5 powyżej i zmień „Realtek High Definition Audio (SST)” &quot; do &quot;Realtek High Definition Audio&quot;. </p> <p> To wszystko ludzie! Która metoda zadziałała dla Ciebie? Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}