{"title":"POPRAWKA: Problem z wysokim użyciem dysku SrTasks.exe (rozwiązany)","content":"<p> Na komputerze z systemem Windows 10 może pojawić się następujący problem. &quot;SrTasks.exe&quot; powoduje, że dysk działa w 100%. Proces „SrTasks.exe” (Microsoft System Protection Background Tasks) jest prawidłowym procesem systemu Windows i służył do uruchamiania usługi kopiowania woluminów w tle oraz usługi dostawcy kopiowania w tle oprogramowania firmy Microsoft. </p> <p> Proces „SrTasks.exe” uruchamia powiązane usługi potrzebne do tworzenia punktów przywracania i zwykle nie powinien stale wpływać na wydajność systemu, zwłaszcza w systemach, w których „Ochrona systemu” jest wyłączona. </p> <p><img src=\"images/image_thumb-58-374.png\" alt=\"FIX SrTasks.exe High Disk Usage - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Ten samouczek zawiera instrukcje dotyczące rozwiązania problemu 100% użycia dysku SrTasks.exe w systemie Windows 10. </p> <h4> Jak naprawić wysokie użycie dysku SrTasks.exe w systemie Windows 10. </h4> <p> </p> <h6> Metoda 1. Przeskanuj komputer w poszukiwaniu złośliwego oprogramowania i wirusów. </h6> <p> Pierwszym krokiem do rozwiązania problemu „wysokiego wykorzystania dysku przez SrTasks.exe” jest upewnienie się, że system jest wolny od wirusów/złośliwego oprogramowania. W tym celu postępuj zgodnie z instrukcjami w tym przewodniku: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Jak skanować komputer w poszukiwaniu wirusów i innych złośliwych programów. </a></p> <p> </p> <h6> Metoda 2. Wyłącz ochronę systemu. </h6> <p> Drugą metodą rozwiązania problemu wysokiego zużycia dysku spowodowanego procesem „SrTasks.exe” jest wyłączenie ochrony przywracania systemu na komputerze. Aby to zrobić: </p> <p> 1. Otwórz Eksploratora Windows, kliknij prawym przyciskiem myszy „Ten komputer” i wybierz <strong> Nieruchomości </strong> . </p> <p><img src=\"images/image_thumb-70-978.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Wybierz <strong> Ochrona systemu </strong> po lewej. </p> <p><img src=\"images/image_thumb-71-135.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Zaznacz <strong> Dysk lokalny C: (system) </strong> i kliknij <strong> Konfiguruj. </strong></p> <p><img src=\"images/image_thumb-59-973.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. W opcjach ochrony systemu wybierz <strong> Wyłącz ochronę systemu </strong> i kliknij <strong> DOBRZE. * </strong></p> <p> </p> <p> * Uwaga: Jeśli &quot;Ochrona systemu&quot; jest już wyłączona, przejdź do następnej metody. </p> <p><img src=\"images/image_thumb-60-732.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Uruchom ponownie </strong> komputera, a następnie sprawdź, czy problem z wysokim użyciem dysku został rozwiązany. Jeśli problem będzie się powtarzał, ponownie włącz ochronę systemu i przejdź do następnej metody. </p> <p> </p> <h6> Metoda 3. Wyłącz usługę Superfetch. </h6> <p> W wielu przypadkach problem 100% wykorzystania dysku zostaje rozwiązany po wyłączeniu usługi Superfetch. Aby wyłączyć usługę „Superfetch”: </p> <p> 1. Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-289.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. W polu Wyszukaj wpisz: <strong><em> services.msc </em></strong> &amp; Kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-12-431.png\" alt=\"services.msc\" loading=\"lazy\"></p> <p> </p> <p> 3. Na liście usług kliknij dwukrotnie usługę Superfetch, aby otworzyć jej właściwości. <br> 4. Ustaw „Typ uruchomienia” na <strong> Niepełnosprawny </strong> i wtedy <strong> DOBRZE. </strong></p> <p><img src=\"images/image_thumb-61-575.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Uruchom ponownie </strong> Twój komputer. Jeśli po ponownym uruchomieniu problem będzie się powtarzał, ponownie włącz usługę „SuperFetch” i przejdź do następnej metody. </p> <p> </p> <h6> Metoda-4. Uruchom Sprawdź dysk, aby znaleźć i naprawić błędy dysku twardego. </h6> <p> 1. Otwórz <strong> Wiersz polecenia jako administrator </strong> . Aby to zrobić: </p> <p> </p> <p> 1. Naciśnij <strong> Okna <img src=\"images/image_thumb-97-652.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> klawisze, aby otworzyć okno poleceń „Uruchom” <strong><br> </strong> 2. Typ <strong> CMD </strong> a następnie naciśnij <strong> CTRL </strong> + <strong> ZMIANA </strong> + <strong> WCHODZIĆ. </strong></p> <p><img src=\"images/image_thumb-35-581.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. W wierszu poleceń wydaj następujące polecenie, aby naprawić dysk i naciśnij <strong> Wchodzić </strong> . </p> <ul> <li><strong> chkdsk C: /F /R </strong></li> </ul> <p> 3. Naciśnij <strong> Tak </strong> aby zaplanować sprawdzanie przy następnym ponownym uruchomieniu. <br> 4. <strong> Uruchom ponownie </strong> Twój komputer. </p> <p><img src=\"images/image_thumb-62-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Teraz poczekaj na zakończenie procesu sprawdzania dysku. (potrwa to kilka godzin). <br> 6. Po zakończeniu procesu sprawdzania dysku sprawdź, czy problem „SrTasks.exe High Disk Usage” został rozwiązany. </p> <p> </p> <p> </p> <h6> Metoda 5. Rozwiąż problemy z systemem Windows, uruchamiając zadania konserwacji. </h6> <p> 1. Przejdź do <strong> Panel sterowania </strong> i otwarte <strong> Rozwiązywanie problemów </strong> . * </p> <p> * Uwaga: jeśli nie widzisz <strong> Rozwiązywanie problemów </strong> ustaw opcję „Wyświetl według” na <strong> Małe ikony. </strong></p> <p><img src=\"images/image_thumb-63-494.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. W sekcji „System i zabezpieczenia” wybierz <strong> Uruchom zadania konserwacyjne </strong> . </p> <p><img src=\"images/image_thumb-27-812.png\" alt=\"run maintenance in windows 10 & Windows 8\" loading=\"lazy\"></p> <p> </p> <p> 3. Naciśnij <strong> Kolejny </strong> a następnie poczekaj, aż narzędzie Konserwacja systemu wykryje problemy. <br> 4. Postępuj zgodnie z instrukcjami wyświetlanymi na ekranie, aby naprawić znalezione problemy. </p> <p> </p> <h6> Metoda 6. Napraw pliki systemowe Windows. </h6> <p> Inną metodą rozwiązania problemu wysokiego użycia dysku SrTasks.exe w systemie Windows 10 jest naprawa systemu Windows za pomocą poleceń DISM i SFC. </p> <p> 1. Otwórz <strong> Wiersz polecenia jako administrator </strong> . <br> 2. W wierszu poleceń wydaj następujące polecenie i naciśnij <strong> Wchodzić: </strong></p> <ul> <li><strong> DISM.exe /Online /Cleanup-image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-583.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Po zakończeniu operacji DISM wpisz następujące polecenie i naciśnij <strong> Wchodzić </strong> : </p> <ul> <li><strong> sfc /skanuj </strong></li> </ul> <p><img src=\"images/image_thumb-37-428.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Teraz poczekaj, aż Kontroler plików systemowych naprawi pliki systemowe Windows. <br> 5. Kiedy to zrobisz, <strong> uruchom ponownie </strong> Twój komputer. </p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}