{"title":"POPRAWKA: Niska prędkość procesora laptopa Dell Inspiron (rozwiązano)","content":"<p> Ten samouczek zawiera instrukcje rozwiązywania problemu z bardzo niską szybkością procesora w laptopie Dell Inspiron 5558. Niedawno mój przyjaciel przyniósł do mojego laboratorium laptopa Dell, ponieważ nagle stał się zbyt wolny. W rzeczywistości laptop działał szybko w przeszłości, ale teraz ładowanie systemu operacyjnego (Windows 10) i aplikacji zajmuje dużo czasu. </p> <p> Po sprawdzeniu laptopa, jak widać na poniższym zrzucie ekranu, stwierdziłem, że procesor działa zawsze z częstotliwością 0,48 GHz zamiast 2,20 GHz. Zacząłem więc rozwiązywanie problemów i wreszcie znalazłem następujące dwie metody rozwiązania problemu z niską szybkością procesora… </p> <p> (Prędkość procesora została zmniejszona o około 85-87% na laptopie Dell) </p> <p><img src=\"images/image_thumb-16-354.png\" alt=\"FIX Dell Laptop Slow CPU Speed\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Jak naprawić problem z niską szybkością procesora w laptopie firmy Dell. </h4> <h6> Metoda 1. Wymień zasilacz sieciowy. </h6> <p> Problem z niską szybkością procesora jest znanym problemem w laptopach firmy Dell, gdy zasilacz nie jest prawidłowo rozpoznawany z komputera. W takich przypadkach, nawet jeśli zasilacz wydaje się działać prawidłowo, po włączeniu laptopa wyświetlany jest następujący komunikat ostrzegawczy „Nie można określić typu zasilacza sieciowego. Uniemożliwi to optymalną wydajność systemu”. </p> <p> Tak więc pierwszą metodą rozwiązania problemu z niską wydajnością laptopa firmy Dell jest wymiana zasilacza na nowy zgodny zasilacz prądu zmiennego firmy Dell. </p> <p> </p> <h6> Metoda 2. ZATRZYMAJ dławienie procesora za pomocą funkcji ThrottleStop. </h6> <p> Jeśli zasilacz działa prawidłowo, a laptop nie przegrzewa się*, inną metodą rozwiązania problemu z niską wydajnością systemu w laptopie firmy Dell jest wyłączenie nieznanego dławienia zasilacza za pomocą <strong><a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"> Zatrzymanie przepustnicy </a></strong> użyteczność. Aby to zrobić: </p> <p> 1. Pobierz <a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Zatrzymanie przepustnicy </strong></a> narzędzie i rozpakuj pobrane archiwum. <br> 2. W wyodrębnionym folderze kliknij dwukrotnie, aby uruchomić aplikację „ThorttleStop.exe”. * <br> 3. <strong> Odznacz </strong> <strong> BD PROCHOT </strong> *** pole wyboru, a następnie kliknij <strong> Zapisać </strong> . </p> <p> * Uwagi: <br> 1. Aby monitorować temperaturę procesora, możesz użyć <a href=\"https://www.alcpu.com/CoreTemp/\" target=\"_blank\" rel=\"nofollow noopener\"> Temperatura rdzenia </a> program. <br> 2. Jeśli po uruchomieniu funkcji ThrottleStop pojawi się błąd „Nie znaleziono pliku MFC120U.dll” lub „Brak pliku MSVCR120.dll”, kontynuuj i zainstaluj <a title=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" href=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Pakiety redystrybucyjne Visual C++ dla Visual Studio 2013 </a> . ( <strong> Ważny: </strong> Jeśli posiadasz 64-bitowy system Windows, musisz zainstalować zarówno 64-bitową, jak i 32-bitową wersję pakietu Visual C++). <br> 3. BD PROCHOT oznacza dwukierunkowy prochot. PROCHOT oznacza procesor gorący, który jest sygnałem aktywowanym w procesorze, gdy osiągnie około 100C do 105C w zależności od numeru modelu. Ten sygnał inicjuje dławienie termiczne, dzięki czemu procesor może zwolnić i uniknąć przegrzania. Wyłączenie PROCHOT umożliwi dalsze działanie procesora z pełną prędkością. (Źródło: <a href=\"http://forum.notebookreview.com/threads/the-throttlestop-guide.531329/\" target=\"_blank\" rel=\"nofollow noopener\"> Przewodnik ThrottleStop </a> ). </p> <p><img src=\"images/image_thumb-20-666.png\" alt=\"FIX Slow CPU Speed with ThrottleStop\" loading=\"lazy\"></p> <p> 4. Zamknij ThrottleStop i gotowe. Teraz procesor będzie działał z pełną prędkością, dopóki nie uruchomisz ponownie lub nie wyłączysz laptopa. * </p> <p> * Uwaga: musisz uruchomić <strong> Zatrzymanie przepustnicy </strong> program przy każdym uruchomieniu komputera, jeśli chcesz pracować z pełną prędkością procesora. Aby ułatwić sobie życie, wykonaj poniższe czynności <a href=\"https://www.repairwin.com/how-to-start-throttlestop-at-windows-startup/\" target=\"_blank\" rel=\"nofollow noopener\"> przewodnik </a> aby automatycznie uruchomić ThrottleStop podczas uruchamiania systemu Windows. </p> <p><img src=\"images/image_thumb-21-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu tego rozwiązania. </p>"}