{"title":"POPRAWKA: Dodatek Outlook jest zainstalowany dla wszystkich użytkowników i nie można go usunąć. (Rozwiązany)","content":"<p> Jeśli nie możesz wyłączyć lub włączyć dodatku programu Outlook z powodu błędu &quot; <em> Dodatek jest instalowany dla wszystkich użytkowników na tym komputerze i może być podłączony lub rozłączony tylko przez administratora </em> ”, kontynuuj czytanie poniżej, aby rozwiązać problem. </p> <p><img src=\"images/image_thumb-76-527.png\" alt=\"The add-is installed for all users on this computer, and can only be connected or disconnected by an administrator\" loading=\"lazy\"></p> <p> Pojawia się błąd „Dodatek może być wyłączony tylko przez administratora”, ponieważ po zainstalowaniu dodatku wybierasz jego instalację dla wszystkich użytkowników komputera. W takim przypadku jedynym rozwiązaniem problemu jest odinstalowanie dodatku przy użyciu uprawnień administratora. </p> <h2> Rozwiązanie problemu: Nie można włączyć lub wyłączyć dodatku, ponieważ jest zainstalowany dla wszystkich użytkowników w programach Outlook, Word lub Excel. </h2> <p> Jeśli nie możesz usunąć lub aktywować dodatku aplikacji pakietu Microsoft Office z powodu błędu „ <em> Dodatek jest instalowany dla wszystkich użytkowników na tym komputerze i może być podłączony lub rozłączony tylko przez administratora&quot;, </em> uruchom odpowiednią aplikację jako Administrator i przystąp do usuwania dodatku bez problemów. Aby to zrobić: </p> <p><strong> 1. </strong> Kliknij prawym przyciskiem myszy aplikację Office, w której napotykasz wspomniany powyżej błąd (np. Outlook) i wybierz <strong> Uruchom jako administrator. * </strong></p> <p> * Uwagi: <strong><br> </strong> 1. Jeśli nie widzisz opcji „Uruchom administratora”, przytrzymaj klawisz <strong> ZMIANA </strong> klucz i <strong> kliknij prawym przyciskiem myszy </strong> w aplikacji pakietu Office napotykasz błąd. <br> 2. Jeśli klikniesz prawym przyciskiem myszy aplikację Office w systemie Windows 10 <strong> Początek </strong> menu <img src=\"images/image_thumb2_thumb_thumb-340.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Programy </strong> , iść do <strong> Jeszcze </strong> &gt; <strong> Uruchom jako administrator. </strong></p> <p><img src=\"images/image_thumb-77-661.png\" alt=\"FIX: Unable to Enable or Disable Add-in \" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Gdy pojawi się prośba o zezwolenie tej aplikacji na wprowadzanie zmian na urządzeniu, wybierz <strong> Tak. </strong></p> <p><img src=\"images/image_thumb-78-120.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Po otwarciu aplikacji Office przejdź do wyłączenia lub włączenia żądanego dodatku. Tym razem dodatek zostanie usunięty bez problemu. </p> <p> Otóż ​​to! Daj mi znać, czy ten przewodnik Ci pomógł, zostawiając komentarz na temat swojego doświadczenia. Polub i udostępnij ten przewodnik, aby pomóc innym. </p>"}