{"title":"POPRAWKA: HDMI Brak dźwięku w telewizorze lub HDMI nie wyświetla się w urządzeniach odtwarzających (rozwiązane).","content":"<p> Jeśli po podłączeniu telewizora do laptopa za pomocą kabla HDMI nie słychać dźwięku podczas odtwarzania wideo lub złącze HDMI nie jest wyświetlane jako urządzenie odtwarzające, kontynuuj czytanie tego samouczka. </p> <p> Szczegóły problemu: Na laptopie z systemem Windows 10 urządzenie wyjścia cyfrowego (HDMI) nie jest wymienione jako urządzenie odtwarzające i nie ma dźwięku po podłączeniu do telewizora za pomocą kabla HDMI. </p> <p> Problem „Brak dźwięku z HDMI” w systemie Windows 10 może pojawić się z kilku powodów, dlatego w tym przewodniku znajdziesz szczegółowe instrukcje rozwiązywania problemu. </p> <h2> Jak naprawić: Brak wyjścia dźwięku z HDMI i HDMI nie są wyświetlane na urządzeniach odtwarzających w systemie Windows 10* </h2> <p> * Sugestie: Zanim przejdziesz do poniższych kroków: </p> <ul> <li><strong> Kliknij prawym przyciskiem myszy </strong> na <strong> ikona dźwięku </strong><img src=\"images/image_thumb-11-109.png\" alt=\"image\" loading=\"lazy\"> na pasku zadań, aby <strong> Otwórz mikser głośności </strong> i upewnij się, że <strong> Cyfrowe urządzenie wyjściowe </strong> nie jest wyciszony. </li> <li> Upewnij się, że kabel HDMI jest prawidłowo podłączony zarówno do laptopa, jak i telewizora. </li> <li> Po podłączeniu kabla HDMI, <strong> uruchom ponownie </strong> Twój komputer. </li> <li> W telewizorze ustaw odpowiedni port HDMI jako urządzenie wejściowe wideo. </li> <li> Jeśli posiadasz laptopa, zamknij pokrywę lub naciśnij raz przycisk zasilania, aby uśpić laptopa. Następnie ponownie naciśnij przycisk zasilania i ponownie sprawdź dźwięk z HDMI. </li> <li> Sprawdź, czy problem nadal występuje, używając innego kabla HDMI. </li> </ul> <p> </p> <h3> Krok 1. Ustaw HDMI jako domyślne urządzenie odtwarzające. </h3> <p> Pierwszym krokiem do rozwiązania problemów z dźwiękiem HDMI w systemie Windows 10 jest ustawienie HDMI jako domyślnego urządzenia audio. </p> <p> 1. Przejdź do Windows <strong> Panel sterowania </strong> i otwarte <strong> Dźwięk. </strong></p> <p><img src=\"images/image_thumb-14-686.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Upewnij się, że <strong> Wyjście cyfrowe </strong> (HDMI) to <strong> Domyślna </strong> urządzenie odtwarzające, w przeciwnym razie wybierz <strong> Wyjście cyfrowe </strong> urządzenie i kliknij <strong> Ustaw domyślne </strong> przycisk. Po zakończeniu odtwórz wideo, aby przetestować dźwięk HDMI, a jeśli problem będzie się powtarzał, przejdź do następnego kroku. * </p> <p><img src=\"images/image_thumb-43-106.png\" alt=\"FIX: HDMI No Sound Output \" loading=\"lazy\"></p> <p> </p> <p> * Uwagi: Wypróbuj następujące rozwiązania, w zależności od przypadku: </p> <p> 1. Jeśli <strong> Wyjście cyfrowe </strong> urządzenie jest <strong> niepełnosprawny </strong> , kliknij prawym przyciskiem myszy i kliknij <strong> Włączyć </strong> . Następnie zaznacz go i naciśnij <strong> Ustaw domyślne </strong> . </p> <p><img src=\"images/image_thumb-44-233.png\" alt=\"FIX: HDMI Not Listed in Playback devices \" loading=\"lazy\"></p> <p> 2. Jeśli cyfrowe urządzenie wyjściowe nie jest wyświetlane jako urządzenie odtwarzające: </p> <blockquote><p> za. Kliknij prawym przyciskiem myszy puste miejsce i upewnij się, że <strong> Pokaż wyłączone urządzenia </strong> i <strong> Pokaż odłączone urządzenia </strong> opcje są zaznaczone (zaznaczone). Jeśli którakolwiek z powyższych opcji nie jest wybrana, kliknij ją, aby ją wybrać. </p></blockquote> <p><img src=\"images/image_thumb-45-410.png\" alt=\"Enable HDMI DIgital Output\" loading=\"lazy\"></p> <blockquote><p> b. Następnie kliknij prawym przyciskiem myszy urządzenie wyjścia cyfrowego i wybierz <strong> Włączyć. <br> do. </strong> Po zakończeniu ustaw jako <strong> domyślna </strong> <strong> Wyjście cyfrowe </strong> urządzenie. </p> </blockquote> <h3><br clear=\"all\"> Krok 2. Przywróć sterownik karty dźwiękowej. </h3> <p> W niektórych przypadkach po automatycznej aktualizacji sterownika może pojawić się problem „Brak dźwięku w telewizorze HDMI”. Więc kontynuuj i wycofaj sterownik audio. </p> <p> 1. Otwórz <strong> Menadżer urządzeń </strong> . Aby to zrobić: </p> <blockquote><p> 1. Naciśnij Windows <img src=\"images/image_thumb8_thumb_thumb-781.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> klawisze, aby otworzyć okno poleceń uruchamiania. <br> 2. W polu „Otwórz” wpisz: <strong> devmgmt.msc </strong> &amp; Kliknij <strong> dobrze </strong> . </p> <p><img src=\"images/image_thumb-5-389.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Rozszerzać </strong> <strong> Kontrolery dźwięku, wideo i gier. <br> 3. Kliknij prawym przyciskiem myszy </strong> na <strong> Urządzenie audio wysokiej rozdzielczości </strong> i wybierz <strong> Nieruchomości. </strong></p> <p><img src=\"images/image_thumb-17-970.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. Na karcie Sterownik kliknij <strong> Przywróć sterownik </strong> przycisk. <strong> * </strong></p> <p> * Uwaga: Jeśli przycisk Przywróć sterownik jest nieaktywny, przejdź do następnego kroku. </p> <p><img src=\"images/image_thumb-18-921.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> 5. Wybierz przyczynę wycofania pakietu sterowników i kliknij <strong> Tak. </strong></p> <p><img src=\"images/image_thumb-19-748.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Po zakończeniu przywracania sterowników <strong> uruchom ponownie </strong> Twój komputer. <br> 5. Po ponownym uruchomieniu kontynuuj i przetestuj dźwięk z HDMI. Jeśli nadal nie słychać dźwięku w telewizorze, przejdź do następnego kroku. </p> <h3> Krok 3. Zmień sterownik karty dźwiękowej. </h3> <p> Brak dźwięku jest często spowodowany niewłaściwym sterownikiem karty dźwiękowej. Aby naprawić ten problem: </p> <p> 1. Otwórz <strong> Menadżer urządzeń. </strong><br> 2. <strong> Rozszerzać </strong> <strong> Kontrolery dźwięku, wideo i gier. <br> </strong> 3. <strong> Kliknij prawym przyciskiem myszy </strong> w <strong> Dźwięk wysokiej rozdzielczości Realtek </strong> urządzenie i wybierz <strong> Uaktualnij sterownik. <br> </strong></p> <p><img src=\"images/image_thumb-6-937.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Wybierz <strong> Przeglądaj mój komputer w poszukiwaniu sterowników. </strong></p> <p><img src=\"images/image_thumb-7-874.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Wybierz <strong> Pozwól mi wybrać z listy dostępnych sterowników na moim komputerze </strong> . </p> <p><img src=\"images/image_thumb-8-498.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. Na następnym ekranie wybierz <strong> Urządzenie audio wysokiej rozdzielczości </strong> i kliknij <strong> Kolejny. </strong></p> <p><img src=\"images/image_thumb-20-756.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/07/image-10.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 8. Po zakończeniu instalacji sterownika, <strong> uruchom ponownie </strong> Twój komputer. <br> 9. Po ponownym uruchomieniu przejdź i przetestuj dźwięk z głośników laptopa. </p> <h3> Krok 4. Odinstaluj i ponownie zainstaluj sterownik karty dźwiękowej. </h3> <p> 1. Otwórz <strong> Menadżer urządzeń. </strong><br> 2. <strong> Rozszerzać </strong> <strong> Kontrolery dźwięku, wideo i gier. <br> </strong> 3. <strong> Kliknij prawym przyciskiem myszy </strong> w <strong> Dźwięk wysokiej jakości </strong> urządzenie i wybierz <strong> Odinstaluj urządzenie. </strong></p> <p><img src=\"images/image_thumb-21-678.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. Po odinstalowaniu <strong> uruchom ponownie </strong> komputera i pozwól systemowi Windows na automatyczną instalację sterowników dźwięku. Jeśli tak się nie stanie, przejdź do <strong> Ustawienia </strong> &gt; <strong> Aktualizacja i bezpieczeństwo </strong> i zmuś system Windows do <strong> Sprawdź aktualizacje. </strong></p> <p> </p> <h3> Krok 5. Odinstaluj i ponownie zainstaluj kartę graficzną. </h3> <p> 1. Otwórz <strong> Menadżer urządzeń. <br> </strong> 2. <strong> Rozszerzać </strong> <strong> Karty graficzne. <br> </strong> 3. <strong> Kliknij prawym przyciskiem myszy </strong> na zainstalowanej karcie graficznej i wybierz <strong> Odinstaluj urządzenie. </strong></p> <p><img src=\"images/image_thumb-46-871.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. Po odinstalowaniu <strong> uruchom ponownie </strong> komputera i pozwól, aby system Windows automatycznie zainstalował sterowniki ekranu. Jeśli tak się nie stanie, lub jeśli nadal masz problem, przejdź do witryny pomocy technicznej producenta laptopa i pobierz najnowsze sterowniki ekranu zgodnie z modelem laptopa. </p> <p> To wszystko ludzie! Która metoda zadziałała dla Ciebie? Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}