{"title":"POPRAWKA: Nie można połączyć się z udziałem plików, ponieważ nie jest to bezpieczne i wymaga przestarzałego protokołu SMB1. (Rozwiązany)","content":"<p> Jeśli spróbujesz połączyć się z folderem udostępnionym w sieci z komputera z systemem Windows 10 i pojawi się błąd „Nie możesz połączyć się z udziałem plików, ponieważ nie jest on bezpieczny. Ten udział wymaga przestarzałego protokołu SMB1, który jest niebezpieczny i może narazić system do ataku. Twój system wymaga protokołu SMB2 lub nowszego. Aby uzyskać więcej informacji na temat rozwiązania tego problemu, zobacz: https://go.microsoft.com/fwlink/?linkid=852747&quot;, a następnie kontynuuj poniżej, aby rozwiązać problem. </p> <p><img src=\"images/image_thumb-30-812.png\" alt=\"You can't connect to the file share because it's not secure. This share requires the obsolete SMB1 protocol, which is unsafe...\" loading=\"lazy\"></p> <p> W systemie Windows 10 v1709 i nowszych wersjach protokół sieciowy Server Message Block w wersji 1 (SMBv1) nie jest instalowany domyślnie i należy go włączyć ręcznie, jeśli chcesz uzyskać dostęp do folderu udostępnionego na stacji roboczej lub serwerze, który używa protokołu SMBv1 do udostępnianie plików. </p> <p> Ten samouczek zawiera instrukcje rozwiązywania następujących błędów podczas próby połączenia z folderem udostępnionym w systemie Windows 10: </p> <ul> <li> <p><em> Nie możesz połączyć się z udziałem plików, ponieważ nie jest to bezpieczne. Ten udział wymaga przestarzałego protokołu SMB1, co jest niebezpieczne… </em></p> </li> <li> <p><em> Określona nazwa sieci nie jest już dostępna </em></p> </li> <li> <p><em> Nieokreślony błąd 0x80004005 </em></p> </li> <li> <p><em> Określony serwer nie może wykonać żądanej operacji. </em></p> </li> </ul> <h4> Jak naprawić: Nie można połączyć się z udziałem plików, ponieważ brakuje protokołu SMBv1 (Windows 10) </h4> <p> 1. Przejdź do <strong> Panel sterowania </strong> -&gt; <strong> Programy i funkcje </strong> . <br> 2. Kliknij <strong> Włącz lub wyłącz funkcje systemu Windows </strong> z lewej. </p> <p> </p> <p><img src=\"images/image_thumb-68-359.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Rozwiń opcję „Obsługa udostępniania plików SMB 1.0/CIFS” i <strong> czek </strong> <strong> Klient SMB 1.0/CIFS </strong> opcja. Kliknij <strong> dobrze </strong> po zakończeniu. </p> <p><img src=\"images/image_thumb-29-360.png\" alt=\"Install SMBv1 Windows 10\" loading=\"lazy\"></p> <p> 4. Po zainstalowaniu SMB 1.0/CIFS kliknij przycisk <strong> Zrestartuj teraz </strong> przycisk, aby ponownie uruchomić komputer. </p> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}