{"title":"POPRAWKA: Nie można przesyłać strumieniowo błędu pakietu Office podczas instalacji lub dezinstalacji pakietu Office. (Rozwiązany)","content":"<p> W tym przewodniku znajdziesz instrukcje krok po kroku, jak rozwiązać błąd „Nie można przesyłać strumieniowo pakietu Office” podczas próby aktualizacji, zainstalowania lub odinstalowania pakietu Office 2013, Office 2016, Office 2019 lub Office 365 na komputerze z systemem Windows. </p> <p> Szczegółowy opis problemu: podczas próby aktualizacji, zainstalowania lub usunięcia pakietu Office 365, 2016 lub 2013 za pomocą „ <em> Program i funkcje </em> &quot; w Panelu sterowania, pojawia się następujący komunikat o błędzie: &quot; <em> Nie można przesyłać strumieniowo pakietu Office. Przepraszamy, wystąpił problem z przesyłaniem strumieniowym pakietu Office. Spróbuj ponownie później. Kody błędów: 30015-25 (1006) lub 30182-1 (2) lub 30183-39 (-2147014790) lub Kod błędu 30179-25). </em></p> <p><img src=\"images/image_thumb-4-575.png\" alt=\"Couldn't Stream Office error \" loading=\"lazy\"></p> <p> </p> <h4> Jak naprawić: Nie można przesyłać strumieniowo pakietu Office 2013, 2016, 2019 lub 365. </h4> <p> * Ważne: komunikat o błędzie „Nie można przesyłać strumieniowo pakietu Office” może pojawić się z następujących powodów: </p> <ol> <li> <ol> <li> Program antywirusowy/zapora może uniemożliwiać połączenie z serwerami Microsoft w celu aktualizacji pakietu Office. </li> <li> Może zabraknąć miejsca na dysku. </li> </ol> </li> </ol> <p> Tak więc, zanim przejdziesz do poniższej metody, spróbuj wykonać następujące czynności przed instalacją, odinstalowaniem lub aktualizacją pakietu Office: </p> <ol> <li> <ol> <li> Wyłącz (lub całkowicie odinstaluj) program antywirusowy/zapora. </li> <li> Zwolnij miejsce na dysku twardym, a następnie spróbuj ponownie zainstalować lub zaktualizować pakiet Office. </li> </ol> </li> </ol> <p> Jeśli po wypróbowaniu powyższego nadal napotykasz błąd „Nie można przesyłać strumieniowo pakietu Office”, kontynuuj i całkowicie usuń i ponownie zainstaluj pakiet Office. Aby to zrobić: </p> <p> 1. Pobierz <a href=\"https://aka.ms/SaRA-officeUninstallFromPC\" target=\"_blank\" rel=\"nofollow noopener\"> Odinstaluj narzędzie pomocy technicznej pakietu Microsoft Office </a> . <br> 2. Po zakończeniu pobierania kliknij dwukrotnie, aby uruchomić &quot;SetupProd_OffScrub.exe&quot;. <br> 3. Kliknij <strong> zainstalować </strong> aby zainstalować &#39;Microsoft Support and Recovery Assistant&#39;. </p> <p><img src=\"images/image_thumb-5-986.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Po zakończeniu instalacji kliknij <strong> Zgodzić się </strong> a następnie kliknij <strong> Tak. </strong></p> <p><img src=\"images/image_thumb-6-745.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Poczekaj, aż „Microsoft Support and Recovery Assistant” rozwiąże problem. <br> 6. Zaznacz pole wyboru po lewej stronie nazwy produktu Office, aby <strong> wybierz wszystkie zainstalowane produkty Office </strong> i kliknij <strong> Kolejny </strong> . </p> <p><img src=\"images/image_thumb-7-956.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Teraz poczekaj, aż proces usuwania pakietu Office zostanie zakończony i kiedy to nastąpi, <strong> uruchom ponownie </strong> Twój komputer. <br> 8. Po ponownym uruchomieniu kontynuuj i ponownie zainstaluj pakiet Office, postępując zgodnie z instrukcjami z tych łączy: </p> <ul> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Biuro 365 </a></li> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Biuro 2019 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Biuro 2016 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Biuro 2013 </a></li> </ul> <p> To wszystko ludzie! Czy to zadziałało dla Ciebie? <br> Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}