{"title":"POPRAWKA: HP Smart Error — Nieznany stan drukarki (rozwiązany)","content":"<p> Ten samouczek zawiera instrukcje, jak rozwiązać problem <a href=\"https://www.hpsmart.com/us/en\" target=\"_blank\" rel=\"nofollow noopener\"> HP Smart </a> błąd aplikacji „Nieznany stan drukarki” w systemie operacyjnym Windows 10. „Nieznany stan drukarki” w aplikacji HP SMART może pojawić się z nieznanych przyczyn i uniemożliwia użytkownikowi korzystanie z funkcji skanowania lub drukowania na drukarce. </p> <p> Problem w szczegółach: Na komputerze z systemem Windows 10 z zainstalowaną drukarką HP błąd „Nieznany stan drukarki” pojawia się w aplikacji HP Smart, mimo że drukarka drukuje bez problemów z Internetu lub innych aplikacji. Głównym problemem związanym z tym błędem jest to, że użytkownik nie może użyć opcji SKANUJ w aplikacji HP Smart do zeskanowania dokumentu. </p> <p> </p> <p> </p> <p><img src=\"images/image_thumb-23-787.png\" alt=\"FIX: HP Smart \" printer status unknown loading=\"lazy\"></p> <h4> POPRAWKA: „Nieznany stan drukarki” w aplikacji HP Smart. (Windows 10). </h4> <p> 1. Z menu Start <img src=\"images/image_thumb2_thumb_thumb-697.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> kliknij Ustawienia <img src=\"images/image_thumb-66-822.png\" alt=\"image\" loading=\"lazy\"> a następnie otwórz <strong> Aplikacje </strong> . </p> <p><img src=\"images/image_thumb-25-257.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Kliknij <strong> Aplikacja HP ​​Smart </strong> a następnie kliknij <strong> Zaawansowane opcje </strong> . </p> <p><img src=\"images/image_thumb-26-912.png\" alt=\"FIX: Printer Status unknown on HP Smart app\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Kliknij <strong> Resetowanie </strong> przycisk. </p> <p><img src=\"images/image_thumb-27-494.png\" alt=\"Fix Printer Status Unknow on HP Smart app\" loading=\"lazy\"></p> <p> 4. Po zakończeniu resetowania zamknij wszystkie okna i otwórz <strong> HP Smart </strong> aplikacja. <br> 5. Zwykle błąd „Nieznany stan drukarki” powinien zostać rozwiązany. Wystarczy kliknąć <strong> Ustawiać </strong> przycisk, aby włączyć wszystkie funkcje HP Smart i gotowe! * </p> <p><img src=\"images/image_thumb-28-849.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Uwaga: Jeśli błąd HP Smart „Nieznany stan drukarki” nadal występuje, spróbuj wykonać następujące czynności: </p> <blockquote><p> 1. <strong> Zamknąć </strong> komputer. <br> 2. <strong> Rozłączyć się </strong> <strong> przewód zasilający z drukarki </strong> przez 1 minutę. <br> 3. Po 1 minucie <strong> zasilanie włączone </strong> Twój <strong> komputer </strong> . <br> 4. Po uruchomieniu systemu Windows 10 <strong> ponownie podłącz przewód zasilający drukarki </strong> i sprawdź, czy błąd „Nieznany stan drukarki” w aplikacji HP Smart został rozwiązany. Jeśli błąd nadal występuje, odinstaluj i ponownie zainstaluj drukarkę oraz oprogramowanie drukarki na komputerze. </p></blockquote> <p> To wszystko ludzie! Zostaw komentarz w sekcji komentarzy poniżej lub jeszcze lepiej: polub i udostępnij ten wpis na blogu w sieciach społecznościowych, aby pomóc w rozpowszechnianiu informacji o tym rozwiązaniu. </p>"}