{"title":"CORREÇÃO: VeraCrypt não está respondendo (congelando) ao desmontar no Windows 10 (resolvido)","content":"<p> Este guia contém instruções para corrigir o seguinte problema com VeraCrypt em um computador com Windows 10: VeraCrypt não está respondendo e congela (trava) ao desmontar o volume criptografado. </p> <p> Problema de VeraCrypt Not Responding (Congelamento) em detalhes: Quando você tenta desmontar um volume (com todos os arquivos fechados do volume montado), o VeraCrypt trava e exibe &quot;Not Responding&quot;. Quando esse problema aparece, a única maneira de restaurar o Windows para um estado normal é encerrar o processo VeraCrypt do Gerenciador de Tarefas. </p> <p> De acordo com <a href=\"https://www.veracrypt.fr/en/Issues%20and%20Limitations.html\" target=\"_blank\" rel=\"nofollow noopener\"> VeraCrypt </a> o problema de congelamento é causado por um conflito entre a caixa de diálogo de espera do VeraCrypt exibida durante as operações de montagem / desmontagem e outro software instalado na máquina (por exemplo, antivírus ou firewall). </p> <h4> Como corrigir: VeraCrypt Not Responding on Dismounting / Mounting Volume. </h4> <p> Este problema é causado por um conflito entre a caixa de diálogo de espera do VeraCrypt exibida durante as operações de montagem / desmontagem e outro software instalado na máquina (por exemplo, Outpost Firewall Pro). </p> <p> 1. De VeraCrypt&#39;s <strong> Definições </strong> menu, selecione <strong> Preferências </strong> . </p> <p><img src=\"images/image_thumb-63-122.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2 <strong> Verificar </strong> a <strong> Não mostrar caixa de diálogo de mensagem de espera ao realizar operações </strong> clique de opção <strong> OK. </strong></p> <p><img src=\"images/image_thumb-64-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Agora prossiga para montar / desmontar volumes sem congelar! </p> <p> Isso é tudo, pessoal! Isso funcionou para você? Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}