{"title":"CORREÇÃO: Problema de papel de parede traseiro no Windows 7 (resolvido)","content":"<p> Este tutorial contém instruções para corrigir o problema do papel de parede preto quando a imagem de fundo é definida como &#39;Stretch &quot;no sistema operacional Windows 7. O problema do papel de parede preto pode aparecer em computadores com Windows 7 após a instalação da atualização de 14 de janeiro de 2020 - KB4534310. </p> <p><img src=\"images/image_thumb-16-423.png\" alt=\"FIX: Back Wallpaper issue in Windows 7\" loading=\"lazy\"></p> <p> O problema de fundo preto do Windows 7 é um bug conhecido após a instalação do <a href=\"http://www.catalog.update.microsoft.com/Search.aspx?q=KB4534310\" target=\"_blank\" rel=\"nofollow noopener\"> atualização KB4534310 </a> e como Microsoft <a href=\"https://support.microsoft.com/en-us/help/4534310/windows-7-update-kb4534310\" target=\"_blank\" rel=\"nofollow noopener\"> diz </a> : &quot;Estamos trabalhando em uma resolução e forneceremos uma atualização em uma versão futura, que será lançada para todos os clientes que executam o Windows 7 e o Windows Server 2008 R2 SP1.&quot; </p> <p> Se você deseja resolver o problema do &quot;papel de parede preto&quot;, até que a Microsoft libere uma atualização para corrigi-lo, siga as instruções abaixo. </p> <h4> Como corrigir o problema do papel de parede preto no Windows 7. </h4> <h6> Método 1. Desinstale a atualização KB4534310. </h6> <p> O primeiro método para corrigir os problemas do papel de parede preto no Windows 7 é remover a atualização KB4534310. * </p> <p> * Observação: como a atualização KB4534310 inclui aprimoramentos de segurança e correções para o Windows 7, não é aconselhável desinstalá-la. Portanto, sugerimos corrigir o problema seguindo as instruções em <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Método-2 </a> abaixo de. </p> <p> Para desinstalar a atualização KB4534310: </p> <p> 1. Clique com o botão direito no <strong> Começar </strong> cardápio <img src=\"images/image_thumb-38-451.png\" alt=\"image\" loading=\"lazy\"> e escolher <strong> Painel de controle </strong> . <br> 2. Defina o <strong> Exibir por: para ícones pequenos </strong> e clique <strong> Programa e recursos. </strong></p> <p><img src=\"images/image_thumb-51-750.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 3. Clique <strong> Ver atualizações instaladas </strong> no painel esquerdo. </p> <p> </p> <p><img src=\"images/image_thumb-52-942.png\" alt=\"uninstall updates windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Na caixa de pesquisa, digite &quot; <strong> KB4534310 </strong> &quot;e pressione Enter. <br> 5. Realce a &quot;Atualização de segurança para Microsoft Windows (KB4534310)&quot; e clique em <strong> Desinstalar </strong> . </p> <p><img src=\"images/image_thumb-12-776.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Método 2. Altere a posição da imagem diferente de &quot;Esticar&quot;. </h6> <p> O problema do papel de parede preto no Windows 7, aparece apenas quando a imagem de fundo selecionada é esticada. Portanto, o próximo método para corrigir o problema é definir outra posição da imagem para a imagem de fundo. Fazer isso: </p> <p> 1. Clique com o botão direito na sua área de trabalho e clique <strong> Personalizar </strong> . </p> <p><img src=\"images/image_thumb-17-501.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Clique <strong> Papel de parede </strong></p> <p><img src=\"images/image_thumb-14-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Agora, aplique as seguintes ações: </p> <p> uma. Na localização da imagem, selecione <strong> Biblioteca de imagens. </strong><br> b. Selecione a imagem que deseja como plano de fundo ou qualquer outra imagem / foto personalizada que corresponda à resolução da tela. * </p> <blockquote> <p> * Dica: para descobrir a resolução atual da tela, clique com o botão direito do mouse na área de trabalho e clique <strong> Resolução da tela </strong> . </p> </blockquote> <p> c. No <strong> Posição da imagem </strong> , selecione qualquer outra opção, exceto &quot; <strong> Alongamento </strong> &quot;, como“ Preencher ”,“ Ajustar ”,“ Lado a lado ”ou“ Centro ”. <br> d. Quando terminar, clique em Salvar <strong> alterar </strong> . </p> <p><img src=\"images/image_thumb-15-519.png\" alt=\"image\" loading=\"lazy\"></p> <p> Isso é tudo! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}