{"title":"CORREÇÃO: a atualização do Windows 10 não pôde desinstalar o Avira AntiVir (resolvido)","content":"<p> Em um computador com Windows 10, a seguinte mensagem aparece ao tentar atualizar o Windows 10 para a versão 1803 ou 1809: &quot;Alguns aplicativos precisam ser desinstalados: esses programas precisam ser desinstalados porque não são compatíveis com a atualização: Avira Antivirus&quot; e ao pressionar o botão &quot;Desinstalar e continuar&quot;, o seguinte erro aparece: &quot;Não foi possível desinstalar estes aplicativos: Avira AntiVir&quot;. O engraçado com este problema, é que o Avira Antivir (Antivírus) não está instalado no PC (não está listado nos programas instalados). </p> <p><img src=\"images/image_thumb-10-929.png\" alt=\"Windows 10 Update Couldn't uninstall Avira AntiVir\" loading=\"lazy\"></p> <p> O problema &quot;Não foi possível desinstalar o Avira AntiVir&quot; durante a atualização do Windows 10 v1803 ocorre porque o programa de atualização encontra alguns arquivos em seu PC que estão associados ao Avira Antivirus e eles não foram removidos durante a desinstalação do Avira. * </p> <p> * Observação: se você realmente tiver o programa &quot;Avira Antivirus&quot; instalado em sua máquina, desinstale-o usando a opção &quot;Programas e recursos&quot; no painel de controle e prossiga para atualizar seu sistema para o Windows 10 v1803 (ou 1809). Após a atualização, baixe e instale a versão mais recente do Avira Antivirus em seu sistema. </p> <h4> Como CORRIGIR o erro de atualização do Windows 10: Não foi possível desinstalar o Avira AntiVir. </h4> <p> </p> <p> 1. Inicie o Windows em <strong> Modo de segurança </strong> . Fazer isso: </p> <ul> <li> <ul> <li> Pressione o Windows <img src=\"images/image_thumb8_thumb_thumb-432.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. </li> <li> Modelo <strong> msconfig </strong> e pressione <strong> Entrar </strong> . </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-47-667.png\" alt=\"msconfig\" loading=\"lazy\"></p> <ul> <li> <ul> <li> No <strong> Bota </strong> guia selecione o <strong> Inicialização segura </strong> opção e clique em <strong> OK </strong> e reinicie o seu computador. </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-48-342.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Após reiniciar, abra o explorador de arquivos e exclua o <strong> avipbb.sys </strong> arquivo dos seguintes locais: </p> <ul> <li> C: \\ Windows \\ System32 \\ drivers </li> <li> C: \\ Windows \\ SysWOW64 \\ drivers </li> </ul> <p> </p> <p> 3. Prossiga para excluir dos locais acima todos os outros arquivos nomeados <strong> avipbb </strong> apesar de sua extensão. </p> <p> 4. Em seguida, exclua o <strong> Avira </strong> pasta do seguinte local: </p> <ul> <li> (Windows 64 bits): C: \\ Arquivos de programas (x86) \\ <strong> Avira \\ Antivirus </strong></li> <li> (Windows de 32 bits): C: \\ Arquivos de programas \\ <strong> Avira \\ Antivirus </strong></li> </ul> <p> 5. Corra <strong> msconfig </strong> novamente. <br> 6. Na guia Geral, clique em Inicialização normal e clique em <strong> OK </strong> , para reiniciar o computador normalmente. </p> <p><img src=\"images/image_thumb-11-949.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Verifique e instale as atualizações. * </p> <p> * Observação: se você ainda encontrar o erro &quot;Não foi possível desinstalar o Avira AntiVir&quot; durante a atualização, baixe e execute o <a href=\"https://www.avira.com/en/support-download-avira-registrycleaner/1//\" target=\"_blank\" rel=\"nofollow noopener\"> Avira Registry Cleaner </a> . </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}