{"title":"CORREÇÃO: Microfone não detectado ou não funciona no Windows 10 (resolvido)","content":"<p> Este guia contém instruções para corrigir os problemas de &quot;microfone não detectado&quot; ou &quot;microfone não funciona&quot; no Windows 10. Se você estiver tendo problemas com o microfone no Windows 10, isso pode ser causado por vários motivos. O problema do &quot;microfone não funciona&quot; é um problema para muitos usuários do Windows 10 e geralmente aparece após uma atualização do Windows. </p> <p> Este tutorial contém várias soluções para resolver problemas de microfone no Windows 10. </p> <h4> Como consertar: Microfone do Windows 10 não funciona ou não foi detectado. * </h4> <p> * Observação: se você tiver problemas com seu microfone, em um aplicativo específico, tente o seguinte: </p> <blockquote><p> 1. Certifique-se de que o aplicativo específico tem permissão para usar o microfone, usando as instruções no método 1 abaixo. <br> 2. Certifique-se de que o microfone esteja selecionado como dispositivo de entrada padrão nas configurações do aplicativo. (por exemplo, no Skype, vá para <strong> Definições </strong> e certifique-se de que seu microfone ou fone de ouvido esteja selecionado). <br> 3. Feche qualquer outro aplicativo que possa usar seu microfone. <br> 4. Reinicie o PC e teste o MIC novamente. </p></blockquote> <h6> Solução 1. Permita que os aplicativos acessem seu microfone. </h6> <p> O primeiro método, para resolver problemas com seu microfone no Windows 10, é garantir que todos os aplicativos tenham acesso a ele. Fazer isso: </p> <p> 1.. No menu Iniciar <img src=\"images/image_thumb2_thumb_thumb-856.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clique <strong> Definições </strong><img src=\"images/image_thumb-66-804.png\" alt=\"image\" loading=\"lazy\"> e então abra <strong> Privacidade </strong> . <br> 2. Selecione <strong> Microfone </strong> no painel esquerdo e então <strong> Ligar </strong> a <strong> Permita que os aplicativos acessem seu microfone. </strong></p> <p><img src=\"images/image_thumb-34-268.png\" alt=\"How to FIX: Windows 10 Microphone Not Detected or Not Working\" loading=\"lazy\"></p> <p> 3. Em seguida, role para baixo e certifique-se de que o aplicativo que deseja usar no microfone possa acessá-lo. * </p> <p> * Sugestão: para sua privacidade, desative o acesso do microfone a qualquer aplicativo que você não deseja que seu microfone use. </p> <p><img src=\"images/image_thumb-35-517.png\" alt=\" FIX Windows 10 Microphone Not Working\" loading=\"lazy\"></p> <p> 4. Quando terminar, teste seu microfone. </p> <h6> Solução 2. Verifique se o seu microfone é o dispositivo de entrada padrão (dispositivo de gravação). </h6> <p> 1.. No menu Iniciar <img src=\"images/image_thumb2_thumb_thumb-930.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clique <strong> Definições </strong><img src=\"images/image_thumb-66-142.png\" alt=\"image\" loading=\"lazy\"> e então abra <strong> Sistema </strong> . <br> 2. Clique <strong> Som </strong> no painel esquerdo e fale para testar o microfone. Se o seu microfone estiver funcionando, você deverá ver a barra deslizante se movendo abaixo. Se não, clique em <strong> Gerenciar dispositivos de som. </strong></p> <p><img src=\"images/image_thumb-36-254.png\" alt=\"Test Microphone Windows 10\" loading=\"lazy\"></p> <p> 3. Em &#39;Gerenciar opções de dispositivos de som, certifique-se de que seu microfone esteja listado em&#39; Dispositivos de entrada &quot;como o dispositivo de entrada padrão, e seu <strong> Habilitado </strong> . Caso contrário, clique no seu microfone e clique em <strong> Habilitar. </strong></p> <p><img src=\"images/image_thumb-37-753.png\" alt=\"Enable Microphone Windows 10\" loading=\"lazy\"></p> <h6> Solução 3. Verifique as configurações do microfone no painel de controle. </h6> <p> 1. Navegue para o Windows <strong> Painel de controle </strong> e aberto <strong> Som. </strong></p> <p><img src=\"images/image_thumb-14-511.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. No <strong> Gravação </strong> guia, selecione seu microfone e clique <strong> Propriedades. </strong></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"Microphone Properties\" loading=\"lazy\"></p> <p> 3. No <strong> Nível </strong> aba, <strong> arrastar </strong> o controle deslizante para o <strong> direito </strong> , para aumentar o volume do microfone e garantir que ele não esteja mudo (caso seu microfone esteja mudo, seu ícone de volume <img src=\"images/image_thumb-39-434.png\" alt=\"image\" loading=\"lazy\"> , será exibido com um símbolo vermelho <img src=\"images/image_thumb-40-819.png\" alt=\"image\" loading=\"lazy\"> ) Quando terminar, clique <strong> OK </strong> e <strong> OK </strong> para fechar as propriedades de som. </p> <p><img src=\"images/image_thumb-41-896.png\" alt=\"Microphone Levels\" loading=\"lazy\"></p> <h6> Solução 4. Altere o driver da placa de som. </h6> <p> O método final para resolver problemas de microfone no Windows 10 é alterar o driver de som, especialmente se você possui um dispositivo de áudio Realtek. Fazer isso: </p> <p> 1. Abra <strong> Gerenciador de Dispositivos </strong> . Fazer isso: </p> <blockquote><p> 1. Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-918.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Na caixa &quot;Abrir&quot;, digite: <strong> devmgmt.msc </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-5-732.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2 <strong> Expandir </strong> a <strong> Controladores de som, vídeo e jogos. </strong></p> <p> 3 <strong> Clique com o botão direito </strong> no <strong> Áudio de alta definição Realtek </strong> dispositivo e selecione <strong> Atualizar driver. <br> </strong></p> <p><img src=\"images/image_thumb-6-629.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Selecione <strong> Procure drivers em meu computador. </strong></p> <p><img src=\"images/image_thumb-7-637.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Selecione <strong> Deixe-me escolher em uma lista de drivers disponíveis no meu computador </strong> . </p> <p><img src=\"images/image_thumb-8-118.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. Na próxima tela, selecione o <strong> Dispositivo de áudio de alta definição </strong> e clique <strong> Próximo. </strong></p> <p><img src=\"images/image_thumb-20-989.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p> 8. Na janela &#39;Aviso de atualização do driver&#39;, clique em &quot;Sim&quot; para instalar o novo driver. <br> 9. Quando a instalação do driver for concluída, <strong> reiniciar </strong> seu computador. <br> 10. Após reiniciar, prossiga e teste seu microfone. </p> <h6></h6> <h6> Solução 5. Desinstale e reinstale os drivers da placa de som. </h6> <p> A solução final para corrigir o problema de microfone que não funciona, no Windows 10 é desinstalar e reinstalar completamente os drivers da placa de som. </p> <p> 1. Navegue para <strong> Painel de controle </strong> &gt; <strong> Programa e recursos </strong> e <strong> Desinstalar </strong> qualquer software relacionado à sua placa de som. <br> 2. Abra <strong> Gerenciador de Dispositivos </strong> e <strong> expandir </strong> a <strong> Controladores de som, vídeo e jogos. <br> </strong> 3 <strong> Clique com o botão direito </strong> no instalado <strong> Dispositivo de áudio </strong> e clique <strong> Desinstalar dispositivo. </strong></p> <p><img src=\"images/image_thumb-42-701.png\" alt=\"Uninstall Sound Card Device\" loading=\"lazy\"></p> <p> </p> <p> 4. Quando terminar, navegue até o site de suporte do fabricante do seu computador ou laptop, baixe e instale o driver mais recente para sua placa de som. <br> 5. Após a instalação, <strong> reiniciar </strong> seu pc e verifique se o microfone está funcionando. </p> <p><strong> Ajuda adicional: </strong> Se depois de aplicar as soluções acima, seu microfone ainda não estiver funcionando, provavelmente está danificado. Para garantir, se você possui um laptop, conecte um microfone externo ou use outro microfone se tiver um desktop. </p> <p> Isso é tudo, pessoal! Qual método funcionou para você? Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}