{"title":"CORREÇÃO: HP Smart Error - Status da impressora desconhecido (resolvido)","content":"<p> Este tutorial contém instruções para resolver o <a href=\"https://www.hpsmart.com/us/en\" target=\"_blank\" rel=\"nofollow noopener\"> HP Smart </a> erro de aplicativo &quot;Status da impressora desconhecido&quot; no sistema operacional Windows 10. O &quot;Status da impressora desconhecido&quot; no aplicativo HP SMART pode aparecer por motivos desconhecidos e impedir que o usuário use a função Digitalizar ou Imprimir na impressora. </p> <p> Problema nos detalhes: Em um computador Windows 10 com uma impressora HP instalada, o erro &quot;Status da impressora desconhecido&quot; aparece no aplicativo HP Smart, apesar de a impressora imprimir sem problemas da Web ou de outros aplicativos. O principal problema com esse erro é que o usuário não pode usar a opção DIGITALIZAR no aplicativo HP Smart para digitalizar um documento. </p> <p> </p> <p> </p> <p><img src=\"images/image_thumb-23-787.png\" alt=\"FIX: HP Smart \" printer status unknown loading=\"lazy\"></p> <h4> CORREÇÃO: &quot;Status da impressora desconhecido&quot; no aplicativo HP Smart. (Windows 10). </h4> <p> 1. No menu Iniciar <img src=\"images/image_thumb2_thumb_thumb-697.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clique em Configurações <img src=\"images/image_thumb-66-822.png\" alt=\"image\" loading=\"lazy\"> e então abra <strong> Apps </strong> . </p> <p><img src=\"images/image_thumb-25-257.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Clique em <strong> Aplicativo HP Smart </strong> e então clique <strong> Opções avançadas </strong> . </p> <p><img src=\"images/image_thumb-26-912.png\" alt=\"FIX: Printer Status unknown on HP Smart app\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Clique no <strong> Redefinir </strong> botão. </p> <p><img src=\"images/image_thumb-27-494.png\" alt=\"Fix Printer Status Unknow on HP Smart app\" loading=\"lazy\"></p> <p> 4. Quando a reinicialização for concluída, feche todas as janelas e abra o <strong> HP Smart </strong> aplicativo. <br> 5. Normalmente, o erro &quot;Status da impressora desconhecido&quot; deve ser resolvido. Basta clicar no <strong> Configurar </strong> para ativar todos os recursos do HP Smart e pronto! * </p> <p><img src=\"images/image_thumb-28-849.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Observação: Se o erro do HP Smart &quot;Status da impressora desconhecido&quot; persistir, tente o seguinte: </p> <blockquote><p> 1 <strong> Desligar </strong> o computador. <br> 2 <strong> desconectar </strong> a <strong> cabo de alimentação da impressora </strong> por 1 minuto. <br> 3. Após 1 minuto, <strong> ligar </strong> sua <strong> computador </strong> . <br> 4. Depois de inicializar no Windows 10, <strong> reconecte o cabo de alimentação da impressora </strong> e verifique se o erro &quot;Status da impressora desconhecido&quot; no aplicativo HP Smart foi resolvido. Se o erro persistir, desinstale e reinstale a impressora e o software da impressora no PC. </p></blockquote> <p> Isso é tudo, pessoal! Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}