{"title":"CORREÇÃO: as configurações de hardware foram alteradas. Reinicialize na inicialização do Windows 10. (Resolvido)","content":"<p> Este guia contém instruções para resolver o seguinte problema a cada inicialização do Windows 10: &quot;Suas configurações de hardware foram alteradas. Reinicie o computador para que essas alterações tenham efeito.&quot; </p> <p> O erro de inicialização do Windows 10 &quot;as configurações de hardware foram alteradas ... reinicie&quot;, pode aparecer mesmo após uma nova instalação do Windows 10, especialmente em computadores (desktops ou laptops) que possuem uma placa de vídeo AMD. </p> <p><img src=\"images/image_thumb-71-941.png\" alt=\"FIX Hardware Settings Have Changed. Please Reboot - Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Como consertar o erro de inicialização do Windows 10: Suas configurações de hardware foram alteradas. Reinicie o seu computador ... </h4> <p> 1. Abra o painel de controle dos Serviços do Windows: Para fazer isso: </p> <ul> <li> Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-332.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. </li> <li> Na caixa de pesquisa, digite: <strong><em> services.msc </em></strong> e clique <strong> OK </strong> . </li> </ul> <p><img src=\"images/image_thumb-12-644.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. No painel de controle de Serviços, clique com o botão direito em <strong> Utilitário de eventos externos AMD </strong> serviço e escolha <strong> Propriedades </strong> . </p> <p><img src=\"images/image_thumb-72-951.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Defina o <strong> Tipo de inicialização </strong> para <strong> Desativado </strong> e então clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-73-548.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4 <strong> Reinício </strong> seu computador. Se após a reinicialização, você ainda receber o erro: &quot;as configurações de hardware foram alteradas ... reinicie&quot;, proceda da seguinte forma: </p> <p> 1. Navegue até o Painel de Controle -&gt; <strong> Programas e características </strong> e <strong> Desinstalar </strong> todos <strong> AMD </strong> Programas. <br> 2. Navegue para <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Página de download do driver AMD </a> para baixar e instalar um driver mais antigo para o adaptador de vídeo. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}