{"title":"CORREÇÃO: no momento, você não tem permissão para acessar esta pasta na unidade USB externa (resolvido)","content":"<p> Este tutorial contém instruções detalhadas para resolver o seguinte problema, ao tentar acessar um disco USB externo em um laptop HP com Windows 10: &quot;No momento, você não tem permissão para acessar esta pasta. Clique em continuar para obter acesso permanente a esta pasta&quot; . O erro persiste, mesmo depois de pressionar o botão &#39;Continuar&#39; para acessar a unidade. </p> <p><img src=\"images/image_thumb-18-636.png\" alt=\"You don't have permission to access this folder\" loading=\"lazy\"></p> <p> O estranho erro &quot;Você não tem permissão para acessar esta pasta&quot; apareceu em um novo <a href=\"http://www8.hp.com/us/en/products/laptops/product-detail.html?oid=17047142\" target=\"_blank\" rel=\"nofollow noopener\"> HP ProBook 450 G5 </a> laptop, quando o usuário tenta visualizar o conteúdo de um disco USB conectado (pen drive, drive USB, etc.). </p> <p> Depois de investigar o problema, descobri que ele é causado pelas permissões de segurança aplicadas no <a href=\"http://www8.hp.com/us/en/solutions/computer-security.html\" target=\"_blank\" rel=\"nofollow noopener\"> HP Client Security Manager </a> programa. O HP Client Security Manager é um programa desenvolvido pela Hewlett-Packard e permite que você proteja seus dados, dispositivo e identidade aumentando a segurança de seu computador. </p> <h2> Como corrigir: Sem permissão para acessar a unidade USB no laptop HP (Windows 10/8/7). </h2> <p> 1. Abra <strong> HP Client Security Manager </strong> . </p> <p><img src=\"images/image_thumb-13-716.png\" alt=\"HP Client Security manager\" loading=\"lazy\"></p> <p> </p> <p> 2. Em seguida, clique em <strong> Segurança do dispositivo. </strong></p> <p><img src=\"images/image_thumb-14-712.png\" alt=\"fix You Don't have permission to access this folder windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Em <strong> Administradores </strong> guia, defina a segurança &#39;Remoção de armazenamento&#39; para <strong> Permitir - Acesso total </strong> e clique <strong> Enviar. </strong></p> <p><img src=\"images/image_thumb-15-364.png\" alt=\"fix You Don't have permission o access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Além disso (se quiser), dê <strong> Acesso total </strong> para a mídia de armazenamento removível para <strong> Usuários Padrão </strong> . </p> <p><img src=\"images/image_thumb-19-269.png\" alt=\"no permission to access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Finalmente, se você não quiser que o HP Device Access Manager controle o acesso à unidade, vá para <strong> Configurações do Drive </strong> e coloque a chave correspondente em OFF. </p> <p><img src=\"images/image_thumb-20-822.png\" alt=\"You don't have permission to access USB drive\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar esse problema. </p>"}