{"title":"CORREÇÃO: Outlook 0x80042112 - Recebimento de erro relatado (resolvido)","content":"<p> Outlook 0x80042112 Erro relatado de recebimento, geralmente ocorre quando o Outlook está tentando receber e-mails de tamanho muito grande (por exemplo, e-mails com anexos grandes). Nesse caso, o Outlook exibe o seguinte erro durante o &#39;Progresso de envio / recebimento&#39;: &quot;Tarefa &#39;% Email-Account% - Receiving&#39; relatou erro (0x80042112): &#39;As seguintes mensagens de email no servidor de email não podem ser baixadas. Contacte o seu fornecedor de serviços de Internet (ISP) ou administrador de correio se continuar a receber este erro. &quot; </p> <p><img src=\"images/image_thumb-7-121.png\" alt=\"FIX: Outlook 0x80042112 Receiving reported error. \" loading=\"lazy\"></p> <p> Este tutorial contém instruções detalhadas para resolver o erro de recebimento do Outlook 0x80042112. </p> <h4> Como corrigir o erro reportado de recebimento do Outlook 0x80042112. </h4> <h6> Etapa 1. Certifique-se de estar conectado à Internet. </h6> <p> Às vezes, o erro de recebimento do Outlook 0x80042112 ocorre porque a conexão com a Internet foi interrompida. Portanto, em primeiro lugar, verifique se sua conexão com a Internet está funcionando. Para fazer isso, abra seu navegador de Internet e visite qualquer site da Web, para verificar sua conexão. </p> <p> </p> <h6> Etapa 2. Excluir mensagens de e-mail da caixa de saída. </h6> <p> O segundo método para resolver o erro 0x80042112 no Outlook é excluir ou mover para rascunhos todas as mensagens de e-mail que ficaram presas na Caixa de saída. Fazer isso: </p> <p> 1. No Outlook, clique no <strong> Enviar receber </strong> guia e clique em <strong> Trabalho offline </strong> . </p> <p><img src=\"images/image_thumb-8-737.png\" alt=\"Move Outbox Emails to Drafts folder\" loading=\"lazy\"></p> <p> 2 <strong> Reiniciar </strong> Panorama. <br> 3. Selecione o <strong> Caixa de fora </strong> pasta (à esquerda) e pressione <strong> CTRL </strong> + <strong> UMA </strong> para selecionar todos os e-mails (à direita). <br> 4. Clique com o botão direito nos e-mails selecionados e mova-os para <strong> Rascunhos </strong> pasta, clicando em <strong> Mover -&gt; Outra Pasta </strong> e, em seguida, selecione o <strong> Rascunhos </strong> pasta da lista. </p> <p><img src=\"images/image_thumb-10-352.png\" alt=\"FIX Outlook error 0x80042112\" loading=\"lazy\"></p> <p> </p> <p> 5. Quando terminar, clique no <strong> Enviar receber </strong> guia e clique em <strong> Trabalhe online. <br> </strong> 6 <strong> Reiniciar </strong> Outlook e execute um Enviar / Receber. </p> <h6></h6> <h6> Etapa 3. Execute o Outlook sem suplementos. </h6> <p> Outro método para corrigir o erro do Outlook 0x80042112 no recebimento é iniciar o aplicativo Outlook no Modo de Segurança e desabilitar quaisquer Suplementos que possam causar o erro. </p> <p> 1. Para iniciar o Outlook no Modo de Segurança, mantenha pressionado o <strong> CTRL </strong> (no teclado) e, em seguida, clique duas vezes no atalho do Microsoft Outlook ou: </p> <blockquote><p> uma. Pressione simultaneamente o Windows <img src=\"images/image_thumb36-371.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> b. Modelo: <strong> Outlook / seguro </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-14-671.png\" alt=\"outlook safe mode\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. No Modo de Segurança do Outlook, navegue até as opções de suplementos e <strong> desabilitar todos os suplementos </strong> . Fazer isso: </p> <ul> <li> Para desativar suplementos em <strong> Outlook 2007 </strong> : </li> </ul> <blockquote><p> 1 <strong> Sobre </strong> a <strong> Ferramentas </strong> menu, clique <strong> Centro de confiança. </strong><br> 2. Selecione <strong> Suplementos </strong> no painel esquerdo. <br> 3. No painel direito, selecione <strong> Suplementos COM </strong> e clique <strong> Vai… <br> </strong> 4 <strong> Desmarque </strong> todas as caixas de seleção, para desativar todos os suplementos e clique em <strong> OK. </strong></p></blockquote> <ul> <li> Para desativar suplementos em <strong> Outlook 2016, 2013 </strong> ou <strong> 2010 </strong> : </li> </ul> <blockquote><p> 1. Clique no <strong> Arquivo </strong> menu e selecione <strong> Opções </strong> . <br> 2. Selecione <strong> Suplementos em </strong> o painel esquerdo. <br> 3. No painel direito, selecione <strong> Suplementos COM </strong> e clique <strong> Vai… </strong></p></blockquote> <p><img src=\"images/image_thumb-20-411.png\" alt=\"disable outlook add-ins\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4 <strong> Desmarque </strong> <strong> tudo </strong> as caixas de seleção e clique em <strong> OK </strong> para desativar todos os suplementos. </p> <p><strong><img src=\"images/image_thumb-21-683.png\" alt=\"turn off outlook add-ins\" loading=\"lazy\"><strong><br> </strong></strong></p> </blockquote> <p> 3 <strong> Reiniciar </strong> Panorama. <br> 4. Tente enviar / receber. Se o progresso de envio / recebimento terminar normalmente e sem exibir o erro 0x80042112, prossiga e reative um por um todos os plug-ins desativados e reinicie o Outlook, até descobrir qual deles está causando o problema. </p> <p> </p> <h6> Etapa 4. Verifique suas configurações de antivírus e firewall. </h6> <p> Se você estiver usando um programa antivírus com recursos de verificação de e-mail, desative o Suplemento Antivírus no Outlook (consulte as instruções na etapa 3 acima) ou desative temporariamente a proteção antivírus ou desinstale o programa Antivírus. Além disso, verifique as configurações do Firewall e certifique-se de que as portas do servidor de e-mail que você está usando não estejam bloqueadas para o programa de Firewall. Mais especificamente, nas configurações do seu Firewall: </p> <p> A. Habilite os seguintes arquivos para acessar a Internet: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Habilite as seguintes portas no Firewall: </p> <ul> <li><strong> Porta 110 </strong> (Se você estiver usando um servidor de email de entrada POP3 sem conexão criptografada) * </li> <li><strong> Porta 995 </strong> (Se você estiver usando um servidor de entrada de email POP3 com conexão criptografada (SSL habilitado) </li> </ul> <ul> <li><strong> Porta 143 </strong> (se você estiver usando um servidor de e-mail de entrada IMAP sem conexão criptografada) </li> <li><strong> Porta 993 </strong> (se você estiver usando um servidor de e-mail de entrada IMAP com conexão criptografada (SSL habilitado) </li> </ul> <ul> <li><strong> Porta 25 </strong> Se o seu servidor SMTP de saída de email não usar SSL. * </li> <li><strong> Porta 465 </strong> ou <strong> 587 </strong> se o seu servidor SMTP de saída de correio usa SSL </li> </ul> <p> * Nota: Por padrão, a porta 25 é para acesso de saída e a porta 110 é para acesso de entrada. Se você não tiver certeza sobre as portas, entre em contato com seu ISP ou administrador do sistema. </p> <p> </p> <h6> Etapa 5. Repare o arquivo de dados PST do Outlook. </h6> <p> A próxima etapa para corrigir o erro relatado de recebimento do Outlook 0x80042112 é executar a ferramenta de reparo da caixa de entrada para reparar o arquivo .pst. As instruções detalhadas para fazer isso podem ser encontradas neste tutorial: <a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Como reparar o arquivo de dados PST do Outlook </a> . </p> <p> </p> <h6> Etapa 6. Verifique o tamanho da (s) mensagem (ns) de e-mail na WEB. </h6> <p> Se você tiver acesso à sua conta de e-mail na web, entre na sua conta de e-mail usando o navegador da web e verifique se o tamanho do e-mail é o problema. Por exemplo, se você encontrar um e-mail grande em sua caixa de entrada, baixe seus anexos e exclua esse e-mail. * </p> <p> * Nota: Se você não tiver acesso à sua conta de e-mail pela web, entre em contato com o provedor de e-mail para relatar o problema. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}