{"title":"CORREÇÃO: DWM.EXE Alto uso de CPU durante a conexão por RDP no Windows 10 (resolvido)","content":"<p> O seguinte problema pode aparecer em um computador baseado no Windows 10, enquanto outros clientes estão conectados a ele, através de RDP (Remote Desktop Connection): O processo &quot;DWM.EXE&quot; causa alta utilização da CPU no host remoto, ou trava e encerra sessão de área de trabalho remota. O problema geralmente aparece se a máquina host da área de trabalho remota executa o Windows 10 v1903 e possui um adaptador de vídeo baseado em Intel (GPU). </p> <p><img src=\"images/image_thumb-35-158.png\" alt=\"FIX: Event 1000, Application error dwm.exe\" loading=\"lazy\"></p> <p> </p> <p> Problema nos detalhes: quando uma máquina cliente é conectada por RDP a uma máquina host Windows 10 (destino), a máquina host desconecta o cliente da área de trabalho remota porque o processo Desktop Windows Manager (dwm.exe) atinge 100% de uso da CPU. Quando o problema ocorre, o seguinte evento é registrado no Visualizador de Eventos: </p> <p><em> &quot;Nome do aplicativo com falha: dwm.exe, versão: 10.0.17134.1, carimbo de data / hora: 0xf5178e97 <br> Nome do módulo com falha: desconhecido, versão: 0.0.0.0, carimbo de data / hora: 0x00000000 <br> Código de exceção: 0x8898009b <br> Compensação de falha: 0x0000000000000000 <br> ID do processo de falha: 0x3a8 <br> Hora de início do aplicativo com falha: 0x01d51ae025b941b3 <br> Caminho do aplicativo com falha: C: \\ WINDOWS \\ system32 \\ dwm.exe <br> Caminho do módulo com falha: desconhecido <br> ID do relatório: fba8573a-ee4e-4430-b40c-3627888dbfd9 &quot; </em></p> <p> </p> <p> Este tutorial contém instruções para resolver o alto uso da CPU do DWM.EXE em uma máquina host remota com Windows 10, após a conexão com a área de trabalho remota (RDP). </p> <h4> Como consertar a alta utilização da CPU do DWM.EXE no host Windows 10 da área de trabalho remota. </h4> <p> Para resolver a alta utilização de CPU do DWM.EXE, aplique as instruções nos seguintes métodos ao computador Windows 10 ao qual você se conecta por meio da conexão de área de trabalho remota (PC Host): </p> <h6> Método 1. Force as conexões de área de trabalho remota a usar o driver de vídeo gráfico XDDM. </h6> <p> 1. Pressione simultaneamente o Windows <img src=\"images/image_thumb36-341.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite <strong> gpedit.msc </strong> &amp; Aperte <strong> Entrar. </strong></p> <p><img src=\"images/image_thumb-78-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. No painel esquerdo, navegue até: </p> <ul> <li><strong> Configuração do Computador </strong> &gt; <strong> Modelos Administrativos </strong> &gt; <strong> Componentes do Windows </strong> &gt; <strong> Serviços de trabalho remoto </strong> &gt; <strong> Host de sessão de área de trabalho remota </strong> &gt; <strong> Ambiente de Sessão Remota </strong></li> </ul> <p> 4. No painel direito, clique duas vezes em <strong> Use o driver de exibição gráfica WDDM para conexões de área de trabalho remota </strong></p> <p><img src=\"images/image_thumb-24-327.png\" alt=\"FIX: DWM.EXE High CPU Usage while using RDP \" loading=\"lazy\"></p> <p> </p> <p> 5. Defina a configuração de política para <strong> Desativado </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-25-498.png\" alt=\"FIX: DWM.EXE High CPU Usage while connecting through RDP in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Feche o editor de política de grupo e <strong> reinício </strong> o computador. </p> <p> </p> <p> </p> <h6> Método 2. Instale o driver de vídeo básico da Microsoft. </h6> <p> 1. Navegue até o Gerenciador de dispositivos. Fazer isso: </p> <blockquote><p> 1. Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-301.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite: <strong> devmgmt.msc </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-26-428.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. Expanda <strong> Adaptadores de vídeo </strong> . <br> 3. Clique com o botão direito no adaptador de vídeo instalado e selecione <strong> Propriedades </strong> . <br> 4. Selecione o <strong> Motorista </strong> guia e clique em <strong> Atualizar driver </strong> . </p> <p><img src=\"images/image_thumb-27-371.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Clique <strong> Procure no meu computador o software de driver </strong> . </p> <p><img src=\"images/image_thumb-28-269.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Escolha <strong> Deixe-me escolher em uma lista de drivers disponíveis no meu computador </strong> . </p> <p><img src=\"images/image_thumb-29-401.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Escolha o <strong> Adaptador de vídeo básico da Microsoft </strong> e clique <strong> Próximo </strong> . </p> <p><img src=\"images/image_thumb-30-520.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Quando a instalação for concluída, feche todas as janelas abertas e pronto. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar esse problema. </p>"}