{"title":"CORREÇÃO: Touchpad não funciona ou congela no Windows 10 (resolvido)","content":"<p> Nos últimos anos, resolvi muitos problemas de touchpad no Windows 10 em vários laptops (por exemplo, o touchpad não está funcionando, o touchpad congela etc.), então decidi escrever um tutorial para solucionar esses problemas. </p> <p> Se você possui um laptop, ocasionalmente pode ter problemas com o dispositivo touchpad. Especialmente se você tiver o Windows 10, o touchpad pode muitas vezes parar de funcionar ou não funcionar corretamente após a instalação de uma atualização. É claro que os problemas do touchpad podem indicar um problema de hardware, mas em muitos casos o mau funcionamento do touchpad é devido a problemas de software. </p> <p> No Windows 10, o touchpad do laptop pode não funcionar por vários motivos, portanto, este tutorial cobrirá todos os métodos para resolver o problema. </p> <h2> Como consertar problemas de touchpad no Windows 10. </h2> <p> Siga estas etapas antes de prosseguir com os métodos a seguir para resolver problemas de tela sensível ao toque. </p> <ol> <li> Certifique-se de que o Windows 10 não esteja travado, pressionando ALT + CTRL + DEL e veja se o Gerenciador de Tarefas abre. </li> <li> Se o seu laptop tiver uma combinação de teclas de função para desativar e ativar o touchpad. (por exemplo, Fn + F3) e, em seguida, pressione a combinação de teclas Fn para ligar o touchpad. (Em alguns laptops, o touchpad pode ser ligado / desligado tocando duas vezes na superfície do touchpad) </li> <li> Reinicie o seu computador. </li> <li> Execute um desligamento completo do Windows 10 e, em seguida, ligue o laptop novamente. (Para realizar um desligamento completo: pressione e segure o <strong> MUDANÇA </strong> chave e clique em <strong> Começar </strong> &gt; <strong> Poder </strong> &gt; <strong> Desligar </strong> ) </li> </ol> <p><strong> </strong></p> <h3> Método 1. Habilite o Touchpad no Windows 10. </h3> <p> O Windows 10 tem a capacidade de desativar ou desligar o touchpad quando um mouse externo é conectado. Portanto, prossiga e certifique-se de que o Touchpad esteja habilitado nas configurações do Touchpad. </p> <p> 1. Navegue para <strong> Começar </strong><img src=\"images/image_thumb2_thumb_thumb-670.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menu -&gt; <strong> Definições </strong> <img src=\"images/image_thumb-66-512.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Dispositivos. <br> </strong> 2. Selecione <strong> Touchpad </strong> no painel esquerdo e, à direita, certifique-se de que o botão do Touchpad esteja definido como <strong> SOBRE </strong> e também <strong> Verifica </strong> a <strong> Deixe o touchpad ligado quando um mouse for conectado </strong> opção. * </p> <p><img src=\"images/image_thumb-38-467.png\" alt=\"Disable Touchpad Windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Observação: se você não conseguir encontrar aqui o botão de alternar / alternar Touchpad ... </p> <p> 1. Abra <strong> Configurações adicionais </strong> debaixo de <strong> Configurações relacionadas </strong> seção. </p> <ul> <li> Artigo relacionado: <a href=\"https://www.repairwin.com/disable-touchpad-option-missing-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Desative a opção de touchpad ausente no Windows 10. </strong></a></li> </ul> <p><img src=\"images/image_thumb-39-742.png\" alt=\"touchpad additional settings\" loading=\"lazy\"></p> <p> 2. Ative o touchpad nas opções de Propriedades do mouse. (Se o touchpad já estiver ativado, tente desativá-lo e ativá-lo novamente.) </p> <p><img src=\"images/image_thumb-31-122.png\" alt=\"enable touchpad windows 10\" loading=\"lazy\"></p> <h3> Método 2. Redefina as configurações do touchpad no Windows 10. </h3> <p> Um método comum para resolver problemas de touchpad no Windows 10 é redefinir as configurações do touchpad para o padrão. </p> <p> 1. Navegue para <strong> Começar </strong><img src=\"images/image_thumb2_thumb_thumb-596.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menu -&gt; <strong> Definições </strong> <img src=\"images/image_thumb-66-851.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Dispositivos. <br> </strong> 2. Em <strong> Touchpad </strong> opções <strong> , </strong> role para baixo e clique <strong> Redefinir </strong> sob <strong> Reinicie seu touchpad. * </strong></p> <p><img src=\"images/image_thumb-40-277.png\" alt=\"reset touchpad windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Nota: Se você não consegue ver o <strong> Redefinir </strong> botão… </p> <p> 1. Abra o <strong> Configurações adicionais </strong> . <br> 2. Clique <strong> Reinicializar dispositivos </strong> nas opções de Propriedades do mouse. </p> <p><img src=\"images/image_thumb-33-928.png\" alt=\"reset touchpad settings windows 10\" loading=\"lazy\"></p> <h3> Método 3. Desinstalar e reinstalar o driver do dispositivo Touchpad. </h3> <p> Outra solução para corrigir os problemas do touchpad no Windows 10 é desinstalar e reinstalar completamente os drivers do touchpad. </p> <p> 1. Abra <strong> Gerenciador de Dispositivos </strong> . Fazer isso: </p> <blockquote><p> 1. Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-140.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Na caixa &quot;Abrir&quot;, digite: <strong> devmgmt.msc </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-5-568.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Expanda os ratos e outros dispositivos apontadores. <br> 3 <strong> Clique com o botão direito </strong> no <strong> TouchPad </strong> dispositivo e clique <strong> Desinstalar. </strong></p> <blockquote> <p><img src=\"images/image_thumb-34-656.png\" alt=\"uninstall touchpad windows 10\" loading=\"lazy\"></p> </blockquote> <p> 4. Após reiniciar, aguarde de 4 a 5 minutos para que o Windows reinstale o driver do touchpad e verifique se o touchpad está funcionando. Se o touchpad não funcionar novamente, tente instalar o driver a partir do site de suporte do fabricante do laptop. </p> <h3> Método 4. Desative e ative o touchpad no BIOS. * </h3> <p> * Nota: Este método não se aplica a todos os modelos de laptop, mas sei que funciona em muitos notebooks ASUS. </p> <p> 1. Desligue completamente o seu laptop pressionando e segurando a tecla SHIFT enquanto clica <strong> Começar </strong> &gt; <strong> Poder </strong> &gt; <strong> Desligar </strong><br> 2. Ligue o laptop e pressione a tecla de função correspondente para entrar nas configurações do BIOS. (por exemplo, F2, F10, etc.), <br> 3. Nas configurações do BIOS, verifique se há uma configuração para o Touchpad ou Dispositivo apontador interno ou dispositivo Trackpad (normalmente esta configuração pode ser encontrada em &#39; <strong> Avançado </strong> &#39; seção). Se for assim, <strong> Desabilitar </strong> a <strong> dispositivo touchpad </strong> e <strong> Salvar e sair </strong> nas configurações do BIOS. <br> 4. Deixe o Windows 10 carregar. <br> 5. Desligue e ligue seu laptop novamente. <br> 6. Entre novamente nas configurações do BIOS e volte a <strong> habilitar touchpad </strong> E <strong> Saída segura </strong> . <br> 7. Após inicializar no Windows 10, o touchpad deve funcionar. </p> <p><strong> Conclusão: </strong> Se, após as etapas acima, o touchpad ainda não funcionar, isso indica um problema de hardware. Neste caso, use um mouse externo ou vá a uma oficina de laptop para consertar o dispositivo touchpad. </p> <p> Isso é tudo, pessoal! Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}