{"title":"CORREÇÃO: O recebimento do Outlook relatou o erro 0x80042108 (resolvido)","content":"<p> Este tutorial contém instruções passo a passo para corrigir o erro reportado de recebimento do Outlook 0x80042108. O erro Outlook 0x80042108 geralmente ocorre quando você digitou incorretamente o nome do servidor de e-mail POP3 ou porque você não tem acesso à Internet. </p> <p> O problema são os detalhes. O Outlook 2003, 2007, 2010 ou Outlook 2013 exibe o seguinte erro durante o procedimento de envio-recebimento: &quot;Recebendo erro reportado (0x80042108): o Outlook não consegue se conectar ao servidor de e-mail de entrada (POP3). Se você continuar a receber esta mensagem , entre em contato com o administrador do servidor ou provedor de serviços de Internet (ISP) &quot;. </p> <p><img src=\"images/outlookerror_0x80042108-505.png\" alt=\"Outlook Error 0x80042108\" loading=\"lazy\"></p> <p> O erro &quot;0x80042108&quot; do Outlook pode ocorrer em qualquer versão do Outlook (2016, 2013, 2010 ou 2007) e aparece quando o programa cliente de e-mail do Outlook não consegue se conectar ao servidor de e-mail. </p> <h4> Como corrigir o erro 0x80042108 no Outlook 2007, 2010, 2013 ou 2016. </h4> <h6> Etapa 1. Verifique sua conexão com a Internet. </h6> <p> A primeira etapa para resolver o erro de recebimento do Outlook 80042108 é verificar a conectividade com a Internet. Portanto, abra o navegador da Internet e visite qualquer site para verificar se a conexão com a Internet está funcionando. </p> <h6> Etapa 2. Verifique as configurações do servidor de correio POP3. </h6> <p> A segunda etapa para corrigir o erro de recebimento do Outlook 0x80042108 é verificar se você especificou as configurações corretas do servidor de e-mail. Portanto, entre em contato com seu provedor de e-mail e verifique com ele se você digitou corretamente o nome do servidor de e-mail de entrada e o número da porta. Para visualizar e modificar as configurações do servidor de e-mail: </p> <p> 1. Abra o Outlook. <br> 2. Vá para <strong> Arquivo </strong> -&gt; <strong> Configurações da conta </strong> . </p> <p><img src=\"images/image_thumb-7-811.png\" alt=\"switch Account Mail Merge \" loading=\"lazy\"></p> <p> </p> <p> 3. Em <strong> E-mail </strong> guia, clique duas vezes em sua conta de e-mail, para modificar / visualizar suas configurações. <br> 4. Verifique se você configurou o nome correto do servidor de e-mail de entrada na caixa correspondente. <br> 5. Quando terminar, clique em <strong> Mais configurações </strong> . </p> <p><img src=\"images/image_thumb-31-256.png\" alt=\"FIX: Outlook Receiving reported error 0x80042108\" loading=\"lazy\"></p> <blockquote><p> </p></blockquote> <p> 6. Clique no <strong> Avançado </strong> e verifique se você especificou a porta correta e a configuração SSL para o servidor de entrada (POP3). </p> <p> </p> <p><img src=\"images/image_thumb-33-400.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Quando terminar, clique em <strong> OK </strong> e feche todas as janelas abertas. <br> 7. Teste o Outlook novamente. </p> <h6></h6> <h6> Etapa 3. Verifique suas configurações de antivírus e firewall. </h6> <p> Se você estiver usando um programa antivírus com recursos de verificação de e-mail, então <a href=\"https://www.repairwin.com/how-to-disable-add-ins-in-word-outlook-or-excel-2016-2013-2010-2007-or-2003/\" target=\"_blank\" rel=\"nofollow noopener\"> desative o Suplemento Antivírus no Outlook </a> ou desative temporariamente a proteção antivírus ou desinstale o programa antivírus. Além disso, verifique as configurações do Firewall e certifique-se de que as portas do servidor de e-mail que você está usando não estejam bloqueadas para o programa Firewall. Mais especificamente, nas configurações do seu Firewall: </p> <p> A. Habilite os seguintes arquivos para acessar a Internet: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Habilite as seguintes portas para acessar a Internet: </p> <ul> <li><strong> Porta 110 </strong> (Se você estiver usando um servidor de email de entrada POP3 sem conexão criptografada) * </li> <li><strong> Porta 995 </strong> (Se você estiver usando um servidor de email de entrada POP3 com conexão criptografada (SSL habilitado) </li> </ul> <ul> <li><strong> Porta 143 </strong> (se você estiver usando um servidor de e-mail de entrada IMAP sem conexão criptografada) </li> <li><strong> Porta 993 </strong> (se você estiver usando um servidor de e-mail de entrada IMAP com conexão criptografada (SSL habilitado) </li> </ul> <ul> <li><strong> Porta 25 </strong> Se o seu servidor SMTP de envio de mensagens não usa SSL. * </li> <li><strong> Porta 465 </strong> ou <strong> 587 </strong> se o seu servidor SMTP de saída de correio usa SSL </li> </ul> <p> * Nota: Por padrão, a porta 25 é para acesso de saída e a porta 110 é para acesso de entrada. Se você não tiver certeza sobre as portas, entre em contato com seu ISP ou administrador do sistema. </p> <p> </p> <p><strong> Ajuda adicional: </strong> Se os métodos acima não ajudarem você, tente o seguinte: </p> <p><strong> UMA. </strong> Remova e adicione sua conta de e-mail novamente. <br> <strong> B. </strong><a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Reparar o arquivo de dados PST do Outlook </a> . <br> <strong> C. </strong> Desconecte-se da conexão VPN (se você estiver conectado a) <br> <strong> D. </strong> Reparar a instalação do Office. Fazer isso: </p> <blockquote><p> 1. Navegue para o Windows <strong> Painel de controle </strong> &gt; <strong> Programas e características </strong> . <br> 2. Localize e selecione o aplicativo MS Office e clique em <strong> Mudar </strong> . <br> 3. Em seguida, selecione o <strong> Reparar </strong> opção. </p></blockquote> <p> </p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? </p> <p> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}