{"title":"CORREÇÃO: Seu computador não pôde se conectar a outra sessão de console porque você já tem uma sessão de console em andamento. (Resolvido)","content":"<p> Em um computador baseado no Windows, aparece o seguinte erro na Conexão de Área de Trabalho Remota: &quot;Seu computador não pôde se conectar à sessão de console no computador remoto porque você já tem uma sessão de console em andamento&quot;. </p> <p> </p> <p><img src=\"images/image_thumb-3-627.png\" alt=\"Your computer could no connect to console session on the remote computer because you already have a console session in progress.\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contém instruções para resolver o seguinte erro de Conexão de Área de Trabalho Remota: &quot;Seu computador não pôde se conectar à sessão de console no computador remoto porque você já tem uma sessão de console em andamento&quot;. </p> <h4> Como consertar: a conexão de área de trabalho remota não pôde ser conectada porque você já tem uma sessão de console em andamento. </h4> <p> O erro &quot;Seu computador não conseguiu se conectar à sessão de console no computador remoto porque você já tem uma sessão de console em andamento&quot; é causado porque um dos adaptadores de rede em seu computador (RDP de) tem o mesmo endereço IP do computador ao qual você está tentando se conectar, por meio da área de trabalho remota. </p> <p> Por exemplo: se o computador remoto possui o endereço IP: &quot;192.168.1.157&quot;, siga os passos abaixo: </p> <p> 1. Abra <strong> Prompt de comando como administrador </strong> no seu computador (RDP de). <br> 2. Dê o seguinte comando para visualizar os endereços IPv4 atribuídos em seu PC. </p> <ul> <li><strong> ipconfig </strong></li> </ul> <p> </p> <p> 3. Agora localize qual adaptador de rede em seu computador local (RDP de) tem o mesmo endereço IP do computador remoto (RDP para). <br> 4. Quando descobrir qual adaptador LAN em seu computador local tem o mesmo endereço IP do computador remoto, prossiga e altere o endereço IP desse adaptador para um diferente. * </p> <p> por exemplo. Neste exemplo, o IP do computador remoto é: &quot;192.168.1.157&quot;, portanto, devemos alterar o endereço IP do adaptador Ethernet (no computador local) para um diferente: por ex. para: &quot;192.168.1.160&quot;. </p> <p><img src=\"images/image_thumb-5-946.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> * Observação: se o endereço IP em sua rede local for atribuído por um servidor DHCP, você terá as seguintes opções para contornar o problema: </p> <blockquote><p> uma. Para especificar manualmente um endereço IP estático diferente. <br> b. Para reiniciar seu roteador (servidor DHCP), a fim de &quot;obter&quot; um endereço IP diferente do servidor DHCP. <br> c. Para configurar o servidor DHCP (por exemplo, no roteador), para fornecer endereços IP a um intervalo que não inclui o endereço IP do computador remoto. (por exemplo, &quot;192.168.1.200-192.168.1.250&quot; </p></blockquote> <p> </p> <p> 5. Depois de alterar o endereço IP em seu computador local (RDP de), abra a conexão de área de trabalho remota e tente conectar-se ao computador remoto. O erro &quot;Seu computador não pôde se conectar a outra sessão de console porque você já tem uma sessão de console em andamento&quot; deve ser resolvido. </p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? </p> <p> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}