{"title":"CORREÇÃO: Não é possível instalar o XPS Viewer no Windows 10 (resolvido)","content":"<p> Em um tutorial anterior, mencionei as etapas necessárias para <a href=\"https://www.repairwin.com/how-to-install-xps-viewer-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> instalar o visualizador XPS no Windows 10 </a> . Porém, alguns usuários reclamam que não podem instalar o visualizador XPS, porque o visualizador XPS não é listado após pressionar o botão &#39;Adicionar um recurso&#39; (Aplicativos&gt; Gerenciar recursos opcionais&gt; Adicionar um recurso) ou não pode ser instalado. </p> <p> Este tutorial contém instruções sobre como solucionar problemas de instalação do visualizador XPS nas versões do Windows 10 1803 e 1809. </p> <h4> Como resolver problemas de instalação do XPS Viewer no Windows 10. </h4> <h6> Método 1. Desinstale e reinstale o Microsoft XPS Document Writer. </h6> <p> 1. Abra <strong> Programas e características </strong> e então clique <strong> Liga ou desliga características das janelas </strong> . </p> <p><img src=\"images/image_thumb-61-948.png\" alt=\"FIX: Cannot Install XPS Viewer - Windows 10\" loading=\"lazy\"></p> <p> 2 <strong> Desmarque </strong> a <strong> Caixa Microsoft XPS Document Writer </strong> e acertar <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-62-338.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Agora clique no <strong> Liga ou desliga características das janelas </strong> denovo e <strong> Verifica </strong> a <strong> Gravador de documentos Microsoft XPS </strong> caixa e clique <strong> OK. <br> </strong> 4 <strong> Reiniciar </strong> seu PC. <br> 5. Tente instalar o XPS Viewer. </p> <p> </p> <h6> Método 2. Instale o XPS Viewer usando o comando DISM. </h6> <p> 1. Abra <strong> Prompt de comando como administrador </strong> . <br> 2. No prompt de comando, dê o seguinte comando e pressione <strong> Entrar </strong> . </p> <ul> <li><strong> dism / Online / Add-Capability /CapabilityName:XPS.Viewer~~~~0.0.1.0 </strong></li> </ul> <p><img src=\"images/image_thumb-65-661.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Método 3. Baixe o XPS Viewer do Windows Update em vez do WSUS. (Windows 10 Pro e Enterprise). </h6> <p> Se você estiver usando o Windows 10 Pro ou Enterprise, aplique as seguintes etapas no Editor de Política de Grupo. * </p> <p> * Nota: Se o computador pertencer a um Domínio, você precisa modificar as configurações de política de grupo de domínio (GPO) e, em seguida, executar o comando &quot;gpupdate / force&quot;, antes de instalar o XPS Viewer. </p> <p> 1. Abra o Editor de Política de Grupo. Fazer isso: </p> <blockquote><p> 1. Pressione simultaneamente o Windows <img src=\"images/image_thumb36-656.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite <strong> gpedit.msc </strong> &amp; Aperte <strong> Entrar. </strong></p></blockquote> <p><img src=\"images/image_thumb-78-514.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. No painel esquerdo, navegue até: </p> <ul> <li><strong> Configuração do Computador </strong> -&gt; <strong> Modelos Administrativos </strong> -&gt; <strong> Sistema </strong></li> </ul> <p> 3. No painel direito, clique duas vezes em <strong> Especifique as configurações para instalação e reparo de componentes opcionais </strong></p> <p><img src=\"images/image_thumb-63-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Defina a política para <strong> Habilitado </strong> e então verifique o <strong> Baixe o conteúdo de reparo e recursos opcionais diretamente do Windows Update em vez do Windows Server Update Services (WSUS) </strong> caixa. </p> <p> 5. Quando terminar, clique em <strong> Aplicar </strong> e <strong> OK </strong> e <strong> reiniciar </strong> seu PC. </p> <p><img src=\"images/image_thumb-64-264.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Após reiniciar, tente <a href=\"#install-xps-viewer-dism\" target=\"_blank\" rel=\"nofollow noopener\"> instalar o XPS Viewer usando o método DISM </a> acima de. <br> 7. Após a instalação do visualizador XPS, abra o Editor de Política de Grupo e reverta as alterações. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}