{"title":"CORREÇÃO: YouTube não funciona no Chrome (resolvido)","content":"<p> Alguns dias antes, encontrei o seguinte problema em um computador Windows: O YouTube não está funcionando no Chrome (os vídeos não reproduzem). Se você não consegue assistir a vídeos no YouTube ou em outros sites com o Google Chrome, porque a janela do vídeo está preta, leia este tutorial para corrigir o problema. </p> <p><img src=\"images/image_thumb-19-778.png\" alt=\"FIX YouTube Not Working on Chrome \" loading=\"lazy\"></p> <h4> Como CORRIGIR: YouTube ou vídeos online não carregam no navegador Chrome. </h4> <p> Quando os vídeos do YouTube não carregam no Chrome, prossiga para resolver o problema seguindo as etapas abaixo. </p> <h6> Etapa 1. Verifique se você pode assistir a vídeos com outro navegador. </h6> <p> A primeira etapa é determinar se o problema &quot;YouTube não funciona&quot; reside apenas no Google Chrome ou em todos os outros navegadores instalados. Portanto, abra qualquer outro navegador da web (por exemplo, o &#39;Internet Explorer&#39;) e verifique se você pode assistir aos vídeos do YouTube. Se você enfrentar o mesmo problema, verifique sua conexão com a Internet e, se estiver OK, atualize os drivers em seu adaptador de vídeo. Se você pode assistir a vídeos do YouTube com outro navegador, vá para a próxima etapa. </p> <p> </p> <h6> Etapa 2. Desative a aceleração de hardware no Chrome. </h6> <p> A próxima etapa para resolver o problema &quot;Os vídeos do YouTube não carregam no Chrome&quot; é desligar a aceleração de hardware no navegador Chrome. Fazer isso: </p> <p> 1. No menu do Chrome <img src=\"images/image_thumb-78-483.png\" alt=\"image\" loading=\"lazy\"> selecionar <strong> Definições </strong> . </p> <p><img src=\"images/image_thumb-79-661.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Em <strong> Definições </strong> página, role para baixo e clique <strong> Avançado </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Arraste o <strong> Use aceleração de hardware quando disponível </strong> troque para <strong> FORA </strong> e então clique <strong> Relançar. </strong></p> <p><img src=\"images/image_thumb-16-156.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Verifique se você pode assistir a vídeos do YouTube agora. Caso contrário, vá para a etapa 3. </p> <p> </p> <h6> Etapa 3. Limpar dados de navegação (cookies, cache, etc.). </h6> <p> A próxima etapa para resolver o problema &quot;O vídeo do YouTube não carrega&quot; no Chrome é excluir os dados de navegação. Para fazer isso: </p> <p> 1. No menu do Chrome <img src=\"images/image_thumb-78-896.png\" alt=\"image\" loading=\"lazy\"> selecionar <strong> Mais ferramentas </strong> &gt; <strong> Limpar dados de navegação </strong> . </p> <p><img src=\"images/image_thumb-17-593.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Em Limpar opções de dados de navegação, selecione <strong> Tempo todo </strong> (em &#39;Intervalo de tempo&#39;) e clique em <strong> Apagar os dados </strong> . </p> <p><img src=\"images/image_thumb-18-321.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Reinicie o Chrome e tente assistir a um vídeo do YouTube. Se o problema persistir, prossiga para a próxima solução. </p> <p> </p> <h6> Etapa 4: Exclua as configurações e dados armazenados do Perfil do Chrome. </h6> <p> Às vezes, o navegador Chrome não funciona normalmente se o perfil do Chrome estiver danificado. Portanto, um método fácil de resolver os problemas do Chrome é recriar a pasta de perfil do Chrome. Fazer isso: </p> <p><strong> 1 </strong> <strong> Simultaneamente </strong> Aperte &quot; <strong> janelas </strong> ”+“ <strong> R </strong> ”Para abrir o <em> CORRE </em> janela. </p> <p><strong> 2 </strong> Dentro <em> CORRE </em> janela copie e cole o seguinte comando de acordo com seu sistema operacional Windows e pressione <strong> OK </strong> : </p> <ul> <li><strong> Windows 10, 8, 7 ou Vista: </strong> <ul> <li><strong> % LOCALAPPDATA% \\ Google \\ Chrome \\ </strong></li> </ul> </li> </ul> <p><img src=\"images/image_thumb4-325.png\" alt=\"chrome profile data\" loading=\"lazy\"></p> <ul> <li><strong> Windows XP: </strong> <ul> <li><strong> % USERPROFILE% \\ Local Settings \\ Application Data \\ Google \\ Chrome \\ </strong></li> </ul> </li> </ul> <p> </p> <p> 3 <strong> Renomear </strong> a pasta &#39;Dados do usuário&#39; para &quot;Dados do usuário.OLD&quot;, ou <strong> excluir* </strong> a pasta &#39;Dados do usuário&#39;. </p> <p><strong> * Nota importante: </strong> Lembre-se de que, ao excluir sua pasta de armazenamento de perfil do Chrome, você exclui todos os dados armazenados (favoritos, senhas, configurações, extensões, histórico, etc.). Portanto, antes de excluir seu perfil, dê uma olhada <a href=\"https://www.repairwin.com/how-to-backup-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> backup de seus favoritos do Chrome </a> e <a href=\"https://www.repairwin.com/how-to-view-and-export-chrome-passwords/\" target=\"_blank\" rel=\"nofollow noopener\"> armazene suas senhas do Chrome. </a></p> <p> </p> <p><img src=\"images/image_thumb11_thumb-690.png\" alt=\"chrome profile storage folder\" loading=\"lazy\"></p> <p> </p> <p> 3 <strong> Abrir </strong> Google Chrome, tente ver um vídeo do YouTube. </p> <h6></h6> <h6> Outras soluções para resolver o problema &quot;Os vídeos do YouTube não abrem no Chrome&quot;. </h6> <blockquote><p><strong> 1 </strong> Atualize o Google Chrome. (Do menu do Chrome <img src=\"images/image_thumb-78-732.png\" alt=\"image\" loading=\"lazy\"> clique <strong> Ajuda </strong> e então selecione <strong> Sobre Google Chrome </strong> .) </p> <p><strong> 2 </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Verifique se há vírus, malware, etc. em seu computador </a></p> <p><strong> 3 </strong> Atualize os drivers do adaptador de vídeo. </p> <p><strong> 4 </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Desinstale e reinstale o Chrome completamente </a> . </p> <p><strong> 5 </strong> Use outro navegador da web. </p></blockquote> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}