{"title":"CORRECÇÃO: o suplemento do Outlook é instalado para todos os usuários e não pode ser removido. (Resolvido)","content":"<p> Se você não puder desativar ou ativar um suplemento do Outlook devido a um erro &quot; <em> O add-é instalado para todos os usuários neste computador e só pode ser conectado ou desconectado por um administrador </em> &quot;, continue lendo abaixo para resolver o problema. </p> <p><img src=\"images/image_thumb-76-527.png\" alt=\"The add-is installed for all users on this computer, and can only be connected or disconnected by an administrator\" loading=\"lazy\"></p> <p> O erro &quot;Add-in só pode ser desabilitado por um administrador&quot; aparece porque quando você instalou o add-in, você optou por instalá-lo para todos os usuários no computador. Nesse caso, a única solução para resolver o erro é desinstalar o add-in usando privilégios administrativos. </p> <h2> Como corrigir: Impossível ativar ou desativar o suplemento porque está instalado para todos os usuários do Outlook, Word ou Excel. </h2> <p> Se você não puder remover ou ativar um Add-in de um aplicativo do Microsoft Office, devido a um erro &quot; <em> O add-é instalado para todos os usuários deste computador e só pode ser conectado ou desconectado por um administrador &quot;, </em> inicie o aplicativo correspondente como Administrador e prossiga para remover o Add-in sem problemas. Fazer isso: </p> <p><strong> 1 </strong> Clique com o botão direito no aplicativo do Office, onde você encontra o erro mencionado acima (por exemplo, Outlook), e selecione <strong> Executar como administrador. * </strong></p> <p> * Notas: <strong><br> </strong> 1. Se você não vir a opção &quot;Executar administrador&quot;, mantenha pressionada a <strong> MUDANÇA </strong> chave e <strong> clique com o botão direito </strong> no aplicativo do Office você enfrenta o erro. <br> 2. Se você clicar com o botão direito no aplicativo do Office no Windows 10 <strong> Começar </strong> cardápio <img src=\"images/image_thumb2_thumb_thumb-340.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Programas </strong> , vamos para <strong> Mais </strong> &gt; <strong> Executar como administrador. </strong></p> <p><img src=\"images/image_thumb-77-661.png\" alt=\"FIX: Unable to Enable or Disable Add-in \" loading=\"lazy\"></p> <p> </p> <p><strong> 2 </strong> Quando solicitado a permitir que este aplicativo faça alterações em seu dispositivo, escolha <strong> sim. </strong></p> <p><img src=\"images/image_thumb-78-120.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Após abrir o aplicativo Office, desative ou ative o Add-in desejado. Desta vez, o add-in será removido sem problemas. </p> <p> É isso! Deixe-me saber se este guia o ajudou, deixando um comentário sobre sua experiência. Por favor, curta e compartilhe este guia para ajudar outras pessoas. </p>"}