{"title":"CORREÇÃO: a execução de scripts está desabilitada neste sistema no Windows 10 (resolvido)","content":"<p> Se você tentar executar um script no Windows 10 PowerShell e receber a mensagem de erro &quot;Não pode ser carregado porque a execução de scripts está desativada neste sistema&quot;, continue lendo a seguir para corrigir o problema. </p> <p><img src=\"images/image_thumb-8-134.png\" alt=\"FIX: script cannot be loaded because is disabled on Windows 10\" loading=\"lazy\"></p> <p> </p> <h2> Como CORRIGIR: Não é possível executar o script do PowerShell porque a política de segurança impede a execução de scripts no Windows 10. </h2> <p> O erro do PowerShell &quot;% ScriptName% .ps1 não pode ser carregado porque está desabilitado neste sistema&quot;, aparece devido a uma política de segurança que impede a execução de scripts. Para remover a restrição e permitir a execução de scripts no Windows 10, proceda da seguinte forma: </p> <p> 1. Abra <strong> PowerShell como administrador </strong> . Fazer isso: </p> <blockquote><p> 1. Pressione o <strong> janelas <img src=\"images/image_thumb-97-958.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> teclas para abrir a caixa de comando &#39;Executar&#39; <strong><br> </strong> 2. Digite <strong> PowerShell </strong> e então pressione <strong> CTRL </strong> + <strong> MUDANÇA </strong> + <strong> ENTRAR. </strong></p></blockquote> <p><img src=\"images/image_thumb-41-395.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. No PowerShell, copie / cole o comando abaixo e pressione <strong> Entrar </strong> : </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Unrestricted </li> </ul> <p> 3. Pressione <strong> Y </strong> e acertar <strong> Entrar </strong> na mensagem de aviso da política de execução para aceitar a mudança. </p> <p><img src=\"images/image_thumb-9-581.png\" alt=\"Enable Running Scripts on Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Depois que a mudança de política for concluída, <strong> perto </strong> a janela do PowerShell. </p> <p> 5. Agora, execute o script que gerou o erro &quot;Scripts está desativado&quot; com <strong> admin </strong> privilégios. O erro deve ter desaparecido agora. * </p> <blockquote><p> * Observação: se você ainda receber o erro &quot;Scripts estão desativados neste sistema&quot;, forneça um dos seguintes comandos e tente executar o script novamente: </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy RemoteSigned </li> <li> set-executionpolicy remotesigned </li> </ul> </blockquote> <p> 6. Por fim, volte à configuração de política de execução do PowerShell anterior (restrição), executando este comando no PowerShell (Admin): * </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Restricted </li> </ul> <p> * Nota: Depois de executar o comando acima, você receberá uma mensagem de aviso que explica os riscos de segurança de uma mudança de política de execução. Aperte <strong> Y </strong> , e então pressione <strong> Entrar </strong> para aceitar a alteração e reverter para a configuração de política anterior. </p> <p><img src=\"images/image_thumb-10-246.png\" alt=\"Disable running scripts windows 10\" loading=\"lazy\"></p> <p> 7. Feche a janela do PowerShell e pronto! </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}