{"title":"CORREÇÃO: Thunderbird não responde ou congela. (Resolvido)","content":"<p> Se o Thunderbird não estiver respondendo, continue abaixo para resolver o problema. Thunderbird é um cliente de e-mail de código aberto popular que está disponível para todas as plataformas. Mas às vezes o Thunderbird para de responder ou congela por 4-5 minutos antes de ser utilizável novamente. </p> <p><img src=\"images/image_thumb-18-762.png\" alt=\"Thunderbird is not responding or freezing - fix\" loading=\"lazy\"></p> <p> O Thunderbird pode não funcionar, pelos seguintes motivos: </p> <ul> <li> O programa antivírus pode impedir o Thunderbird de se conectar à Internet. </li> <li> O recurso de pesquisa do Windows nas mensagens do Thunderbird pode fazer com que o Thunderbird congele. </li> <li> Uma configuração ou complemento problemático do Thunderbird. </li> <li> Os arquivos de indexação do Thunderbird (arquivos MSF) podem estar corrompidos. </li> </ul> <p> Como o Thunderbird pode não responder por diversos motivos, neste tutorial mostraremos todas as maneiras disponíveis para resolver o problema. </p> <h2> Como consertar: Thunderbird não responde ou congela no Windows 10. </h2> <h3> Método 1. Faça uma varredura em seu computador em busca de vírus. </h3> <p><strong> Importante: </strong> Muitos vírus ou programas maliciosos podem causar problemas com a atualização do Windows. Portanto, antes de continuar com as etapas de solução de problemas abaixo, use este <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Guia de verificação e remoção de malware </a> para verificar e remover vírus e / e programas maliciosos que podem estar em execução no seu computador. </p> <h3></h3> <h3> Método 2. Desative o Windows Search nas mensagens do Thunderbird. </h3> <p> 1. No menu do Thunderbird, selecione <strong> Ferramentas </strong> &gt; <strong> Opções </strong> . </p> <p> 2. Nas configurações gerais, <strong> desmarque </strong> a opção <strong> Permitir que o Windows Search pesquise mensagens </strong> . </p> <p><img src=\"images/image_thumb-24-636.png\" alt=\"Disable Windows Search in Thunderbird Messages\" loading=\"lazy\"></p> <p> 3 <strong> Reiniciar </strong> Thunderbird. </p> <p> </p> <h3> Método 3. Adicione o Thunderbird às exceções do Antivirus. </h3> <p> Se você estiver usando um antivírus de terceiros em sua máquina, prossiga e adicione o programa executável &quot;thunderbird.exe&quot; às ​​exceções do programa antivírus. </p> <p> Por exemplo, se você possui o AVG Antivirus: </p> <p> 1. Vá para <strong> Cardápio </strong> &gt; <strong> Definições </strong> . <br> 2. Em <strong> Em geral </strong> guia, clique <strong> Exceções </strong> &gt; <strong> Adicione exceção </strong> . <br> 3. Clique no <strong> Navegar </strong> botão e localize o <strong> thunderbird.exe </strong> arquivo, (ou <strong> cópia de </strong> E <strong> cole a linha abaixo) </strong> e então clique <strong> Adicione exceção. * </strong></p> <ul> <li> C: \\ Arquivos de programas (x86) \\ Mozilla Thunderbird \\ thunderbird.exe </li> </ul> <p><strong> * Observação: </strong> Se depois de adicionar o arquivo &quot;thunderbird.exe em suas exceções AV o problema ainda persistir, <strong> adicionar </strong> tb <strong> para exceções AV </strong> a <strong> pasta onde o Thunderbird foi instalado </strong> e a <strong> Pasta de perfil do Thunderbird </strong> . </p> <p><img src=\"images/image_thumb-19-734.png\" alt=\"add thunderbird to antivirus exceptions\" loading=\"lazy\"></p> <p> </p> <p> </p> <h3> Método 4. Desativar - desinstala seus programas antivírus. </h3> <p> Como o problema de &quot;não responder&quot; no programa Thunderbird, geralmente é devido ao programa Antivírus, sugiro <strong> desabilitar </strong> ou para <strong> desinstalar completamente </strong> seu programa antivírus e para ver se o problema ainda persiste. </p> <h3></h3> <p> </p> <h3> Método 5. Inicie o Thunderbird no modo de segurança. </h3> <p> O Thunderbird pode travar e não responder, se uma extensão instalada causar problemas ou estiver danificada. Para solucionar problemas com os complementos do Thunderbird, proceda da seguinte forma. </p> <p> 1. Pressione e <strong> calma </strong> a <strong> MUDANÇA </strong> tecla no seu teclado e abra <strong> Thunderbird. </strong></p> <p> 2. Na próxima janela, clique em <strong> Continue no modo de segurança. </strong></p> <p><img src=\"images/image_thumb-21-196.png\" alt=\"Strat Thunderbird in Safe Mode\" loading=\"lazy\"></p> <p> </p> <p> 3. Se o Thunderbird não travar no modo de segurança, um complemento instalado pode causar o problema. Neste caso: </p> <ol> <li> Feche o Thunderbird. </li> <li> Pressione a tecla SHIFT e inicie o Thunderbird novamente. </li> <li> Na próxima janela, <strong> Verifica </strong> <strong> Desative todos os complementos </strong> e clique <strong> Faça alterações e reinicie </strong> . </li> </ol> <p><img src=\"images/image_thumb-22-149.png\" alt=\"Disable Thunderbird add-ons\" loading=\"lazy\"></p> <p> 4. Se o Thunderbird não estiver respondendo novamente, vá para o próximo método. </p> <h3> Método 5. Redefinir barras de ferramentas e controles do Thunderbird. </h3> <p> 1. Pressione e <strong> calma </strong> a <strong> MUDANÇA </strong> tecla no seu teclado e abra <strong> Thunderbird. </strong></p> <p> 2. Na próxima janela, escolha <strong> Redefinir barras de ferramentas e controles </strong> e clique <strong> Faça alterações e reinicie. </strong></p> <p><img src=\"images/image_thumb-23-344.png\" alt=\"Reset Thunderbird Toolbars\" loading=\"lazy\"></p> <p> </p> <h3> Método 6. Exclua os arquivos de índice do Thunderbird (.msf). </h3> <p> Em alguns casos, o Thunderbird está travando porque os arquivos de indexação (também conhecidos como arquivos MSF) foram corrompidos. Portanto, o método final para resolver o problema do &quot;Thunderbird não está respondendo&quot; é excluir os arquivos .MSF. * </p> <p><strong> * IMPORTANTE: </strong> Embora os arquivos MSF (Mail Summary Files) possam ser excluídos com segurança porque contêm apenas os cabeçalhos e o status do e-mail (lido, não lido etc.), e não o e-mail real, é recomendado <a href=\"https://www.repairwin.com/how-to-transfer-thunderbird-email-and-settings-to-a-new-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> faça backup da pasta de perfil do Thunderbird </a> antes de excluir os arquivos MSF. </p> <p><strong> Etapa 1. Feche o Thunderbird. </strong></p> <p><strong> Etapa 2. Ative a visualização Arquivos ocultos. </strong></p> <p> 1. Navegue para o Windows <strong> Painel de controle </strong> e abra o <strong> Opções de Pasta </strong> . (ou o <strong> Opções do Explorador de Arquivos </strong> no Windows 10). </p> <p> 2. Selecione o <strong> Visualizar </strong> guia, e sob o <strong> &#39;Arquivos e pastas ocultos&#39; </strong> seção, <strong> Verifica </strong> a <strong> Mostrar arquivos, pastas e unidades ocultas </strong> opção e clique <strong> OK. </strong></p> <p><img src=\"images/image_thumb-34-553.png\" alt=\"Show Hidden files\" loading=\"lazy\"></p> <p> </p> <p><strong> Etapa 3. Exclua os arquivos .MSF </strong></p> <p> 1. Navegue até a pasta de perfil do Thunderbird em seu disco e abra o <strong> Correspondência </strong> pasta: * </p> <ul> <li> C: \\ Users \\ username \\ AppData \\ Roaming \\ Thunderbird \\ Profiles \\ ProfileName <strong> .default \\ Mail </strong></li> </ul> <p> * Onde nome de usuário é o seu nome de usuário do Windows e ProfileName é o nome do perfil do Mozilla no qual os e-mails são armazenados. </p> <p> 2. Agora explore todas as pastas contidas dentro do <strong> Correspondência </strong> pasta, para ver qual contém os arquivos .msf. (em instalações padrão, com apenas uma conta de e-mail, os arquivos MSF estão localizados na pasta &quot;Pastas locais&quot;. </p> <p> 3 <strong> Excluir </strong> tudo <strong> .msf </strong> arquivos, ou -melhor- <strong> mover </strong> para uma (nova) pasta em sua área de trabalho. </p> <p><img src=\"images/image_thumb-25-355.png\" alt=\"Delete Thunderbird MSF files\" loading=\"lazy\"></p> <p> 4. Quando terminar, abra o Thunderbird e espere que o Thunderbird recrie os arquivos de indexação (arquivos MSF). </p> <p> Isso é tudo, pessoal! Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}