{"title":"Como transferir e-mail e configurações do Thunderbird para um novo computador.","content":"<p> Este tutorial contém instruções detalhadas sobre como transferir mensagens de e-mail do Thunderbird, configurações de conta e catálogos de endereços para outro computador. O aplicativo de e-mail Thunderbird armazena todos os dados em uma pasta de perfil que possui a extensão &quot;.default&quot; no final de seu nome. (por exemplo, &quot;wyhsxcvs.default&quot;). Por padrão, esta pasta de perfil é armazenada no seguinte local em seu computador: </p> <ul> <li> C: \\ Users \\\\ AppData \\ Roaming \\ Thunderbird \\ Profiles \\ <strong> .padrão </strong></li> </ul> <p><img src=\"images/image_thumb-14-425.png\" alt=\"How to Transfer Thunderbird Emails & Data to a New Computer.\" loading=\"lazy\"></p> <p> Portanto, se quiser mover seus dados do Thunderbird para um novo computador, você deve transferir a pasta pai &#39;Thunderbird&#39; para o novo computador e apontar o Thunderbird para essa pasta. </p> <h4> Como mover o perfil Thunderbird para outro PC. </h4> <h6> Etapa 1. Copie a pasta Thunderbird Profile do computador antigo. </h6> <p> </p> <p> No computador antigo, navegue até o local de armazenamento dos dados do Thunderbird. Fazer isso: </p> <p> 1. Abra o Thunderbird. <br> 2. Do menu <img src=\"images/image_thumb21_thumb-959.png\" alt=\"image_thumb[21]\" loading=\"lazy\"> , escolher <strong> Ajuda </strong> -&gt; <strong> Informações sobre solução. <br> </strong> 3. Em <strong> Pasta de Perfil </strong> linha, clique <strong> Pasta aberta </strong> . </p> <p><img src=\"images/image_thumb-8-878.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Feche o aplicativo Thunderbird. <br> 5. Na janela do Explorer, clique em <strong> Roaming </strong> . </p> <p><img src=\"images/image_thumb-9-272.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7 <strong> cópia de </strong> e <strong> Colar </strong> a <strong> Thunderbird </strong> pasta para uma mídia de armazenamento com espaço livre suficiente. (por exemplo, uma unidade USB externa). </p> <p><img src=\"images/image_thumb-10-958.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Etapa 2. Transferir o perfil Thunderbird para o novo computador. </h6> <p> 1 <a href=\"https://www.thunderbird.net/en-US/download/\" target=\"_blank\" rel=\"nofollow noopener\"> Download </a> e instale o Thunderbird no novo PC. * </p> <p><strong> * Importante: </strong> No final do processo de instalação, <strong> desmarque </strong> a opção &#39;Iniciar Mozilla Thunderbird agora&#39; e clique em <strong> Terminar </strong> . </p> <p><img src=\"images/image_thumb-11-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Conecte a unidade USB (com a pasta &quot;Thunderbird&quot;) ao novo computador. <br> 3. Clique com o botão direito na pasta &#39;Thunderbird&#39; e clique em <strong> cópia de </strong> . <br> 4. Pressione o botão do Windows <img src=\"images/image_thumb8_thumb-1-464.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 5. Digite o seguinte comando <strong> </strong> e pressione <strong> Entrar: </strong></p> <ul> <li><strong> %dados do aplicativo% </strong></li> </ul> <p><img src=\"images/image_thumb-12-421.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Na janela do Explorer, clique com o botão direito em um espaço vazio e clique <strong> Colar </strong> . </p> <p><img src=\"images/image_thumb-13-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Inicie o Thunderbird e você deverá ver todos os seus e-mails, catálogos de endereços e configurações de conta, como em seu computador antigo. </p> <p> Isso é tudo! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}