{"title":"Como redefinir as configurações do Photoshop para o padrão.","content":"<p> Se o programa do Photoshop funcionar de forma estranha, a maneira mais rápida de corrigir o problema é redefinir as configurações do Photoshop de volta ao padrão. Neste tutorial, você encontrará instruções detalhadas sobre como redefinir as Preferências do Photoshop para seus padrões. </p> <p> No programa Adobe Photoshop, todas as personalizações (opções de exibição, opções de desempenho, opções de transparência, opções de cursor, etc.) são salvas no arquivo &quot;Preferências do Adobe Photoshop&quot; ao sair do aplicativo. Se o arquivo de Preferências for danificado, o programa Photoshop age de forma estranha e a única maneira de corrigir o (s) problema (s) é restaurar as configurações de preferências aos valores padrão. </p> <h4> Como redefinir as preferências do Photoshop para o padrão. * </h4> <p> * Observação: os métodos acima redefinirão todas as configurações de preferências para o padrão. Se você deseja redefinir uma determinada ou todas as ferramentas do Photoshop, aplique as seguintes ações: </p> <blockquote><p> 1. No menu do Photoshop, clique <strong> janelas </strong> e então selecione o <strong> Opções </strong> item. <br> 2. Em seguida, selecione a ferramenta que deseja redefinir na Caixa de ferramentas. <br> 3. Agora clique com o botão direito na ferramenta à esquerda da barra de opções e selecione <strong> Ferramenta de Reinicialização </strong> ou <strong> Redefinir todas as ferramentas. </strong></p></blockquote> <p><img src=\"images/image_thumb-25-673.png\" alt=\"reset tools photoshop\" loading=\"lazy\"></p> <h6></h6> <h6> Método 1. Redefina as preferências na inicialização do Photoshop. </h6> <p> O primeiro método para redefinir as configurações no Photoshop é usar um atalho de teclado após iniciar o Photoshop. Fazer isso: </p> <p> 1 <strong> Desistir </strong> Photoshop. <br> 2 <strong> Duplo click </strong> no ícone do Photoshop e imediatamente <strong> calma </strong> a <strong> Ctrl + Alt + Shift </strong> chaves (no Windows) ou o <strong> Command + Option + Shift </strong> (no Mac OS). <br> 3. Quando solicitado <strong> &quot;Excluir o arquivo de configurações do Adobe Photoshop?&quot; </strong> clique <strong> sim. </strong></p> <p><img src=\"images/image_thumb-24-561.png\" alt=\"delete photoshop settings\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Método 2. Redefina as preferências no menu do Photoshop. </h6> <p> 1. Inicie o Photoshop. <br> 2. Do <strong> Editar </strong> menu, selecione <strong> Preferências </strong> -&gt; <strong> Em geral <br> </strong> 3. Clique <strong> Redefina as preferências ao sair. </strong></p> <p><img src=\"images/image_thumb-21-842.png\" alt=\"Reset Adobe Photoshop Preferences on Quit\" loading=\"lazy\"></p> <p> </p> <p> 4. Clique <strong> OK </strong> quando solicitado a redefinir as preferências ao sair do Photoshop. </p> <p><img src=\"images/image_thumb-22-194.png\" alt=\"Reset Photoshop Settings on Quit\" loading=\"lazy\"></p> <p> </p> <p> 5. Clique <strong> OK </strong> novamente para fechar a caixa de diálogo Preferências. <br> 6. Feche e reinicie o Photoshop. </p> <p> </p> <h6> Método 3. Exclua ou renomeie o arquivo de configurações do Adobe Photoshop. </h6> <p> O método final para redefinir as preferências do Photoshop para seus padrões, é renomear ou excluir o arquivo de configurações do Photoshop (Adobe Photoshop% Version% Prefs.psp), no seguinte local em seu PC: * </p> <ul> <li> C: \\ Usuários \\% Nome de usuário% \\ AppData \\ Roaming \\ Adobe \\ Adobe Photoshop% Versão% \\ Adobe Photoshop% Versão% Configurações \\ <strong> Adobe Photoshop% Version% Prefs.psp </strong></li> </ul> <p> * Nota: No MAC OS, navegue até: </p> <ul> <li> Usuários \\% Nome de usuário% \\ Biblioteca \\ Preferências \\ Adobe Photoshop% Versão% Configurações \\ <strong> Adobe Photoshop% Version% Prefs.psp </strong></li> </ul> <p> Para excluir as Preferências da Adobe no sistema operacional Windows 10, 8, 7: </p> <p> 1 <strong> Desistir </strong> Photoshop. <br> 2. Navegue até a pasta &quot;C: \\ Usuários \\% Nome de usuário% \\ AppData \\ Roaming \\&quot;. Fazer isso: </p> <blockquote><p> 1. Pressione o Windows <img src=\"images/image_thumb8_thumb_thumb-455.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Na caixa Pesquisar, digite: <strong> %dados do aplicativo% </strong> e clique <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-66-926.png\" alt=\"Delete Photoshop Preferences file\" loading=\"lazy\"></p> <p> </p> <p> 4. Em seguida, navegue até a pasta &quot;… \\ Adobe \\ Adobe Photoshop% Versão% \\ Adobe Photoshop% Versão% Configurações \\&quot;. <br> 5 <strong> Excluir </strong> ou <strong> renomear </strong> o arquivo &quot;Adobe Photoshop% Version% Prefs.psp&quot; para Adobe Photoshop% Version% Prefs.OLD &quot;* </p> <p> * Observação: se você possui o Photoshop de 64 bits, renomeie ou exclua também o arquivo &quot;Adobe Photoshop X64% version% Prefs.psp&quot;. </p> <p><img src=\"images/image_thumb-23-438.png\" alt=\"Re-create Photoshop Settings File\" loading=\"lazy\"></p> <p> </p> <p> 6. Inicie o Photoshop. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}