{"title":"Como desativar o Bitlocker no ambiente de recuperação do Windows (WinRE).","content":"<p> Este tutorial contém instruções sobre como desabilitar a proteção do BitLocker e descriptografar uma unidade criptografada do BitLocker no Ambiente de Recuperação do Windows. As instruções podem ser úteis se o seu computador for protegido pelo BitLocker e não aceitar a chave de recuperação do Bitlocker ou a senha do BitLocker na inicialização do sistema e você não conseguir desbloquear a unidade protegida pelo BitLocker. </p> <p><img src=\"images/image_thumb-52-511.png\" alt=\"Remove Bitlocker from Windows Recovery Environment \" loading=\"lazy\"></p> <h4></h4> <h4> Como remover a proteção e descriptografar a unidade criptografada do BitLocker no ambiente de recuperação do Windows (WinRE). </h4> <p><strong> Requisitos: </strong><br> <strong> UMA </strong> . <strong> Uma mídia de instalação do Windows 10 (USB ou DVD). </strong> Se você não possui uma mídia de instalação do Windows, pode criar uma usando <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Ferramenta de criação de mídia da Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Como criar uma mídia de instalação USB do Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Como criar uma mídia de instalação de DVD do Windows 10. </a></li> </ul> <p><strong> B. A chave de recuperação do BitLocker ou a senha do BitLocker: </strong> Para desligar a proteção do Bitlocker, você deve ter a senha do Bitlocker ou a chave de recuperação do Bitlocker para desbloquear a unidade primeiro e, em seguida, descriptografar a unidade. * </p> <p> * Observação: se você não tiver a chave de recuperação do BitLocker, não há como ignorar a proteção do BitLocker. Se um disco for protegido por BitLocker e você não tiver a chave de recuperação do BitLocker ou a senha para desbloquear a unidade, a única opção que você tem (para usar a unidade novamente) é apagar totalmente a unidade usando as instruções neste artigo: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Como remover a proteção do BitLocker de uma unidade sem a chave ou senha de recuperação do BitLocker. </a></p> <p> A chave de recuperação do Bitlocker é um número de 48 dígitos e pode ser encontrada nos seguintes locais: </p> <ul> <li> Em uma impressão que você salvou, quando ativou o Bitlocker. </li> <li> Em uma unidade USB que você usou, durante a ativação do Bitlocker para salvar a chave de recuperação do Bitlocker. </li> <li> No <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Chaves de recuperação de conta da Microsoft </a> , usando a conta do MS que você usou para fazer login no seu dispositivo, ou você adicionou ao dispositivo para baixar aplicativos da Microsoft Store, ou para ativar o MS Office ou para e-mail. </li> <li> Nas suas <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Conta Azure </a> para PCs de trabalho que fazem login com uma conta do Azure Active Directory. </li> </ul> <p> Depois de encontrar a chave de recuperação do BitLocker ou a senha ΒitLocker, prossiga para desbloquear a unidade criptografada do Bitlocker e remover a criptografia do Bitlocker no WinRE, seguindo as instruções abaixo. </p> <p> Para desbloquear e descriptografar a unidade C: do sistema operacional do WinRE: </p> <p> 1. Inicialize seu sistema a partir da mídia de instalação do Windows 10. <br> 2. Na tela abaixo, pressione o <strong> MUDANÇA </strong> + <strong> F10 </strong> teclas para iniciar o prompt de comando. (ou pressione <strong> Próximo </strong> &gt; <strong> Reparar meu computador </strong> &gt; <strong> Resolução de problemas </strong> &gt; <strong> Prompt de comando </strong> ) * </p> <p> * Nota: Se você solicitou a chave de recuperação, clique em <strong> PULAR esta unidade </strong> . </p> <p><img src=\"images/image_thumb15_thumb-548.png\" alt=\"How to disable-unlock bitlocker from Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. No prompt de comando, digite o seguinte comando para visualizar a letra da unidade da unidade criptografada: </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p> </p> <p> 4. Em seguida, proceda ao desbloqueio da unidade criptografada, utilizando o seguinte comando, conforme o seu caso: </p> <p><strong> Caso A. </strong> Se você souber a chave de recuperação do BitLocker, dê este comando: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -rp BitLocker-recovery-key </strong></li> </ul> <p> * ex .: Se você deseja desbloquear a unidade &quot;D:&quot; e a chave de recuperação do bitlocker é: &quot;123456-123456-123456-123456-123456-123456&quot;, digite: </p> <ul> <li> <ul> <li> manage-bde -unlock <strong> D </strong> : -rp <strong> 123456-123456-123456-123456-123456-123456 </strong></li> </ul> </li> </ul> <p> </p> <p><strong> Caso B. </strong> Se você souber a senha do BitLocker para desbloquear a unidade, dê este comando: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -pw BitLocker-Password </strong></li> </ul> <p> * por exemplo: se você deseja desbloquear a unidade &quot;D:&quot; e a senha do BitLocker é: &quot;123qwerty&quot;, digite: * </p> <ul> <li> <ul> <li> manage-bde -unlock <strong> D </strong> : -senha <strong> 123qwerty </strong></li> </ul> </li> </ul> <p> </p> <p> 5. Em seguida, prossiga para descriptografar a unidade e desligar a proteção do BitLocker com este comando: </p> <ul> <li><strong> manage-bde -off drive-letter: </strong></li> </ul> <p> * ex .: se você deseja descriptografar a unidade &quot;D:&quot;, digite: </p> <ul> <li> <ul> <li> manage-bde –off <strong> D </strong> : </li> </ul> </li> </ul> <p> 6. O processo de descriptografia com início. Para verificar o status de descriptografia, digite novamente o seguinte comando e certifique-se de que a unidade está <strong> Totalmente Descriptografado </strong> e <strong> Desbloqueado </strong> : </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p><img src=\"images/image_thumb9_thumb-678.png\" alt=\"decrypt bitlocker encrypted drive windows removery environment\" loading=\"lazy\"></p> <p> </p> <p> 7. Quando terminar, remova a mídia de instalação do Windows e reinicie o computador. * </p> <p> * Nota: Se o Windows não iniciar, conecte a unidade a outro computador e faça backup de seus dados pessoais em outra mídia. Então <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> diagnosticar a unidade quanto a problemas </a> e se estiver OK, coloque o disco de volta no computador e execute um <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> instalação limpa do Windows 10 </a> . </p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar esse problema. </p>"}