{"title":"CORREÇÃO: Não é possível alterar o tema - Temas Aero esmaecidos no Windows 7 (resolvido)","content":"<p> O seguinte problema ocorreu em um computador com Windows 7: O Windows mudou para o tema básico e o usuário não pode alterar o tema porque, quando as configurações de personalização são abertas, todos os temas aerodinâmicos ficam esmaecidos. Em vez disso, todas as outras configurações no painel de personalização são habilitadas (Desktop Background, Windows Color, Screen Saver, etc.), espere selecionar um tema diferente. </p> <p><img src=\"images/image_thumb-28-129.png\" alt=\"Cannot Change Theme – Themes Greyed Out\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contém instruções para corrigir o seguinte problema no Windows 7: O tema não pode ser alterado - Temas esmaecidos. </p> <h4> Como CORRIGIR: Não é possível alterar o tema - Temas Aero estão esmaecidos. </h4> <h6> Método 1. Faça uma varredura em seu sistema em busca de vírus e malware. </h6> <p> O primeiro passo para resolver o problema &quot;não é possível alterar o tema básico&quot; é garantir que seu sistema esteja livre de vírus / malware. Para essa tarefa, siga as instruções neste guia: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Como fazer uma varredura em seu computador em busca de vírus e outros programas maliciosos. </a></p> <h6> Método 2. Reinicie o serviço de tema. </h6> <p> 1. Abra o painel de controle dos Serviços do Windows: Para fazer isso: </p> <ul> <li> Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-720.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. </li> <li> Na caixa de pesquisa, digite: <strong><em> services.msc </em></strong> e clique <strong> OK </strong> . </li> <li> (Aceite o aviso do UAC se ele aparecer). </li> </ul> <p><img src=\"images/image_thumb-12-580.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. No painel de controle de Serviços, clique com o botão direito no <strong> Temas </strong> serviço e escolha <strong> Reiniciar </strong> . * </p> <p> * Observação: se o serviço for interrompido, clique em <strong> Começar </strong> . </p> <p><img src=\"images/image_thumb-29-242.png\" alt=\"Themes Greyed Out - restart theme service\" loading=\"lazy\"></p> <p> </p> <h6> Método 3. Habilite estilos visuais em janelas e botões. </h6> <p> 1. Clique no <strong> Começar </strong> botão, clique com o botão direito em <strong> Computador a </strong> nd select <strong> Propriedades </strong> . </p> <p><img src=\"images/image_thumb-30-382.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Clique <strong> Configurações avançadas do sistema </strong> à esquerda. </p> <p><img src=\"images/image_thumb-31-876.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Na guia &#39;Avançado&#39;, clique em <strong> Definições </strong> na seção &#39;Desempenho&#39;. </p> <p><img src=\"images/image_thumb-15-696.png\" alt=\"fix High CPU and DISK Usage Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Em <strong> Efeitos visuais </strong> guia, marque a opção &quot;Usar estilos visuais em janelas e botões&quot; e clique em <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-32-631.png\" alt=\"fix Theme cannot be changed - themes greyed out\" loading=\"lazy\"></p> <p> </p> <h6> Método 4. Instale os drivers de vídeo mais recentes. </h6> <p><strong> 1 </strong> Navegar para <strong> Painel de controle </strong> &gt; <strong> Programas e características </strong> e <strong> Desinstalar </strong> o driver VGA atualmente instalado. </p> <p><strong> 2 </strong> Quando a operação de desinstalação for concluída <strong> reiniciar </strong> seu computador. </p> <p><strong> 3 </strong> Após reiniciar, navegue até o site de suporte do fabricante do computador para baixar e instalar os drivers mais recentes para sua placa gráfica. Se você possui um computador desktop ou laptop * com uma placa AMD / ATI ou NVIDIA VGA, siga as etapas abaixo para localizar, baixar e instalar a versão mais recente do driver para sua placa de vídeo. </p> <p><strong> * Observação: </strong> Se você não conseguir encontrar os drivers nos links abaixo, navegue até o site de suporte do fabricante do computador. </p> <p> </p> <p><strong> Para GPUs baseadas em NVIDIA. </strong></p> <ol> <li> <ol> <li> Vamos para <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Página de pesquisa avançada de driver NVIDIA </a> e procure o driver correspondente para o seu adaptador de vídeo. </li> <li> Na página de resultados da pesquisa, baixe uma versão anterior do driver. </li> <li> Instale o driver que você baixou e reinicie o computador. </li> </ol> </li> </ol> <p> </p> <p><strong> Para GPUs baseadas em AMD. </strong></p> <ul> <li> <ol> <li> Vamos para <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Download do driver AMD (ATI) </a> e procure o driver correspondente para o seu adaptador de vídeo. </li> <li> Na página de resultados da pesquisa, pressione o botão <strong> Drivers e software anteriores </strong> link à direita. </li> <li> Instale o driver que você baixou e reinicie o computador. </li> </ol> </li> </ul> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}