{"title":"CORREÇÃO: Viber, Yahoo e outros aplicativos estão falhando em dispositivos Android - março de 2021 (resolvido).","content":"<p> Vários usuários nas últimas horas relataram que muitos aplicativos Android estão travando (22 de março de 2021). Em particular, Gmail, Viber, Google Chrome e outros aplicativos importantes não abrem e fecham imediatamente após a abertura. O problema afeta muitos dispositivos Android e especialmente os dispositivos da Samsung. Se você enfrentar um problema semelhante, continue lendo abaixo para saber como corrigi-lo. </p> <p> Atualização (23 de março de 2021): o Google identificou rapidamente o problema e descobriu que o <strong> Android WebView </strong> aplicativo foi o culpado e corrigiu o problema empurrando atualizações para ele e outros aplicativos do Chrome. </p> <h4> Como CORRIGIR: Android Google Apps, Viber, etc. Crash issue (22 de março de 2021). </h4> <p> 1. Abra o Android <strong> Definições. </strong></p> <p> 2. Toque <strong> Gerenciar aplicativos </strong> (ou <strong> Aplicativos e notificações </strong> ou <strong> Formulários </strong> em alguns dispositivos Android). </p> <p><img src=\"images/image_thumb-27-815.png\" alt=\"FIX: Android Apps are Crashing on Samsung or other Devices.\" loading=\"lazy\"></p> <p> </p> <p> 3. Clique no menu com o <strong> três pontos </strong><img src=\"images/image_thumb-28-382.png\" alt=\"image\" loading=\"lazy\"> no canto superior direito e selecione <strong> Mostrar todos os aplicativos </strong> (ou <strong> Mostrar aplicativos do sistema </strong> ) </p> <p><img src=\"images/image_thumb-29-272.png\" alt=\"FIX Android GMAIL or Viber Crash \" loading=\"lazy\"></p> <p> </p> <p> 3. Encontre o <strong> Android System WebView </strong> aplicativo (ou <strong> Android WebView </strong> ) na lista e abri-la. </p> <p><img src=\"images/image_thumb-30-842.png\" alt=\"FIX GMAIL Chrome or Viber Crash on Android - March 2021\" loading=\"lazy\"></p> <p> </p> <p> 4. Clique <strong> Desinstale atualizações. </strong></p> <p><img src=\"images/image_thumb-31-471.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Toque <strong> OK </strong> na mensagem de aviso. </p> <p> 6 <strong> Reiniciar </strong> seu dispositivo e o problema deve ter desaparecido. </p> <p> Isso é tudo, pessoal! Qual método funcionou para você? Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}