{"title":"Como recuperar o arquivo DBX do Outlook Express GRATUITAMENTE.","content":"<p> O Outlook Express é um programa cliente de e-mail que foi visto pela primeira vez no Windows XP. Mas ainda hoje (ano de 2018) alguns clientes ainda o utilizam, como seu principal programa de e-mail. Um dos principais problemas do Outlook Express é o problema do limite de 2 GB. </p> <p> Descrição do problema de limite de tamanho de 2 GB no Outlook Express. <br> Quando uma das pastas principais do Outlook Express (por exemplo, a &quot;Caixa de entrada&quot; ou &quot;Enviado&quot;) excede os 2 GB de tamanho, o arquivo de armazenamento DBX OE correspondente pode ser corrompido e a pasta OE pode parecer vazia. Como resultado do problema, o Outlook Express não pode enviar ou receber e-mails e exibe o erro <a href=\"https://www.repairwin.com/fix-outlook-express-error-0x800c0133-due-to-2gb-size-limit/\" target=\"_blank\" rel=\"nofollow noopener\"> 0x800c0133 </a> durante a operação Enviar / Receber. </p> <p> Neste tutorial, vou mostrar a você como reparar um arquivo DBX corrompido do Outlook Express e receber seus e-mails de volta! </p> <h4> Como consertar um arquivo DBX do Outlook Express corrompido. </h4> <p> Se uma das pastas do Outlook Express (caixa de entrada, envio, etc.) for corrompida, siga as instruções abaixo para reparar a pasta de armazenamento DBX e receber seus e-mails de volta. </p> <h6> Etapa 1. Habilite a exibição de arquivos ocultos. </h6> <p> 1. Abra o Windows Explorer. <br> 2. Do <strong> Ferramentas </strong> escolha do menu <strong> Opções de Pasta </strong> . <br> 3. Na guia Exibir, clique em <strong> Mostrar arquivos e pastas escondidos </strong> e clique <strong> OK. </strong></p> <p><img src=\"images/image_thumb-2-290.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Etapa 2. Localize o arquivo corrompido do Outlook Express DBX em seu disco. </h6> <p> 1. Abra a pasta de armazenamento do Outlook Express. Normalmente, essa pasta está localizada no seguinte caminho em seu disco: </p> <ul> <li> C: \\ Documents and Settings \\\\ Local Settings \\ Application Data \\ Identities \\ {} \\ Microsoft \\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> por exemplo. “C: \\ Documents and Settings \\ User \\ Local Settings \\ Application Data \\ Identities \\ {D8F3C56D-965E-41AE-8A23-A58460ABAE00} \\ Microsoft \\ <strong> Outlook Express </strong> ” </p></blockquote> <p> 3. Do explorador <strong> Visualizar </strong> escolha do menu <strong> Detalhes </strong> . <br> 4. Localize qual arquivo DBX excede o limite de armazenamento de 2 GB ou localize o arquivo DBX corrompido. (o arquivo DBX corrompido é a pasta MAIL que parece vazia no programa Outlook Express). </p> <p><img src=\"images/image_thumb-3-887.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Copie esse arquivo DBX para outro local em seu disco (por exemplo, para uma nova pasta em sua área de trabalho chamada &quot;CorruptedDBX&quot;). </p> <p> </p> <h6> Etapa 3. Baixe UnDBX - Utilitário de recuperação DBX Outlook Express grátis. </h6> <p> UnDBX é uma ferramenta de reparo excelente e gratuita do Outlook Express DBX que pode extrair todos os e-mails do Outlook Express contidos no formato .eml. Além disso, tem a opção de corrigir e reparar um arquivo .DBX do Outlook Express danificado. </p> <p> Você pode baixar UnDBX de <a href=\"https://sourceforge.net/projects/undbx/\" target=\"_blank\" rel=\"nofollow noopener\"> aqui </a> . </p> <p> </p> <h6> Etapa 4. Recupere os e-mails do arquivo DBX do Outlook Express corrompido. </h6> <p> 1. Para recuperar e-mails do arquivo DBX corrompido, clique duas vezes para executar o utilitário UnDBX. <br> 2. No utilitário UnDBX: </p> <blockquote><p> 1. Selecione a pasta que contém os arquivos .dbx do Outlook Express e, em seguida, <strong> Verifica </strong> a &quot; <strong> habilitar o modo de recuperação </strong> &quot;opção abaixo. <br> 2 <strong> Escolha uma pasta de destino </strong> no seu computador, para armazenar (extrair) os arquivos .eml. (por exemplo, para uma pasta em sua área de trabalho chamada &quot;RecoveredInbox&quot;) <br> 3. Por fim, clique em <strong> Recuperar </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-645.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Quando a recuperação UnDBX for concluída, abra o Outlook Express. <br> 4. Navegue até a pasta onde UnDBX salvou os arquivos .eml extraídos. <br> 5. Arraste e solte os e-mails extraídos na pasta correspondente (no Outlook Express). * </p> <p><strong> * Sugestão: </strong> Para evitar que as pastas do Outlook Express sejam corrompidas novamente (ou para contornar o limite de 2 GB), sugiro arrastar e soltar os e-mails em grupos (por exemplo, por ano) e colocá-los em pastas diferentes no OE. Por exemplo, selecione apenas os e-mails do ano atual e arraste e solte-os em uma nova pasta OE com o nome do ano atual (por exemplo, &quot;Caixa de entrada 2018&quot;). Em seguida, repita a (s) mesma (s) etapa (s) de todos os outros e-mails dos anos anteriores. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}