{"title":"CORREÇÃO: Lexmark impressão lenta de várias páginas no Windows 10 (resolvido)","content":"<p> Em um PC com Windows 10, com uma impressora Lexmark instalada, a impressão fica lenta ao imprimir várias páginas. O problema de impressão lenta da Lexmark no Windows 10 geralmente é devido ao driver de impressora incorreto ou a configurações incorretas da impressora (Preferências). Para resolver o problema, continue lendo abaixo. </p> <p><img src=\"images/image_thumb-29-115.png\" alt=\"FIX: Lexmark Slow Printing in Multiple Pages on Windows 10 \" loading=\"lazy\"></p> <p> Problema de impressão lenta da Lexmark em detalhes: No Windows 10, sua impressora Lexmark imprime rapidamente ao imprimir uma única página, mas quando você deseja imprimir várias páginas, a impressão é lenta porque o processo de impressão demora muito para iniciar e a impressora imprime uma página por vez a cada 1-2 minutos. </p> <p> Este tutorial contém instruções para resolver o problema de impressão lenta de várias páginas da Lexmark, no Windows 10. </p> <ul> <li><strong> Artigo relacionado: </strong> <a href=\"https://www.repairwin.com/fix-slow-pdf-printing-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> CORREÇÃO: impressão lenta de PDF no Windows 10 </a></li> </ul> <h4> Como CORRIGIR: Impressão lenta de várias páginas na impressora Lexmark no Windows 10. </h4> <h6> Método 1. Modifique as configurações da impressora. </h6> <p> 1. Navegue para <strong> Painel de controle </strong> -&gt; <strong> Dispositivos e Impressoras. </strong><br> 2. Clique com o botão direito na sua impressora e selecione <strong> Propriedades. </strong></p> <p><img src=\"images/image_thumb-30-253.png\" alt=\"Printer Properties\" loading=\"lazy\"></p> <p> 3. Na guia &#39;Geral&#39;, <strong> clique em Alterar propriedades. </strong></p> <p><img src=\"images/image_thumb-31-900.png\" alt=\"Change Printer Properties\" loading=\"lazy\"></p> <p> 4. Em Preferências de impressão da Lexmark, defina o <strong> Tipo de papel </strong> para <strong> Avião </strong> e clique <strong> OK. * </strong></p> <p> * Observação: Outras configurações que podem ser aplicadas em sua impressora para melhorar a velocidade de impressão: </p> <ul> <li><strong> Resolução de impressão </strong><strong> : </strong> 600 dpi tornará a impressora mais lenta. </li> <li><strong> Modo silencioso </strong><strong> : </strong> Fora </li> </ul> <p><img src=\"images/image_thumb-32-858.png\" alt=\"FIX Slow Lexmark Printing Lexmark - Windows 10\" loading=\"lazy\"></p> <p> 5. Agora, clique <strong> Aplicar </strong> e <strong> OK </strong> na janela &quot;Propriedades da impressora&quot; para aplicar a alteração. <br> 6. Abra um documento com várias páginas e verifique se o problema foi corrigido. Caso contrário, continue com o método 2 abaixo. </p> <h6> Método 2. Altere o driver da impressora. </h6> <p> 1. Navegue para <strong> Painel de controle </strong> -&gt; <strong> Dispositivos e Impressoras. </strong><br> 2. Clique com o botão direito na sua impressora e selecione <strong> Remover dispositivo. </strong></p> <p><img src=\"images/image_thumb-33-755.png\" alt=\"Uninstall Printer Windows 10\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 2. Após a remoção da impressora, navegue até <strong> Programas e características </strong> no painel de controle e <strong> Desinstalar </strong> a <strong> Software Lexmark </strong> (de qualquer). </p> <p> 3. Navegue para <a href=\"https://www.lexmark.com/en_us/support/download-search.html\" target=\"_blank\" rel=\"nofollow noopener\"> Drivers e downloads da Lexmark </a> site e pesquise os drivers disponíveis para o seu modelo de impressora e sistema operacional. <br> 4. A partir da lista de drivers disponíveis, baixe e instale um dos seguintes drivers: * </p> <ul> <li> <p> Driver de impressão universal. </p> </li> <li> <p> Driver de impressão de emulação universal PCL5e. </p> </li> <li> <p> Driver de impressão de emulação PostScript 3 universal. </p> </li> </ul> <p> * Observação: sugiro que você experimente os drivers de impressão na ordem listada acima. </p> <p> 5. Quando a instalação do driver da impressora for concluída, <strong> reiniciar </strong> seu PC. <br> 6. Após reiniciar, tente imprimir um documento longo. O problema de impressão lenta deve ser corrigido. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Por favor, deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar esse problema. </p>"}