{"title":"CORREÇÃO: o período de tempo limite do semáforo expirou ao copiar arquivos (resolvido)","content":"<p> O erro &quot;O tempo limite do semáforo expirou&quot; pode ser exibido ao tentar copiar arquivos grandes pela rede ou ao transferir arquivos de uma unidade USB externa para o computador. Em outros casos, o &quot;Erro 0x80070079: O período de tempo limite do semáforo expirou&quot; aparece quando você tenta copiar arquivos de um dispositivo conectado por USB (por exemplo, de sua câmera fotográfica, telefone celular etc.) </p> <p><img src=\"images/image_thumb-4-812.png\" alt=\"Semaphore Timeout Period has Expired\" loading=\"lazy\"></p> <p> </p> <p> Neste guia, você encontrará várias maneiras de resolver o &quot;período de tempo limite do semáforo expirou. Erro 0x80070079&quot; ao copiar arquivos de / para a rede ou USB, no Windows 10, 8, 8.1, 7 ou Vista. </p> <h4> Como corrigir: Erro ao copiar arquivo ou pasta. O período do semáforo expirou. </h4> <p><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> PARTE 1. CORRIGIR &#39;O período do semáforo expirou&#39; ao copiar arquivos de USB. </a></p> <p><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> PARTE 2. CORRIGIR &#39;O período do semáforo expirou&#39; ao copiar arquivos da rede. </a></p> <p> </p> <h6> PARTE 1. CORRIGIR &#39;O período do semáforo expirou&#39; ao copiar arquivos de USB. </h6> <p> Se você receber o erro &#39;O período do semáforo expirou&#39; ao copiar arquivos de um dispositivo USB (por exemplo, de um disco USB externo ou de sua câmera digital), tente o seguinte para corrigir o problema: </p> <p><strong> 1 </strong> Feche todos os programas abertos e <strong> reiniciar </strong> seu computador. <br> <strong> 2 </strong> Conecte o dispositivo USB a <strong> outra porta USB </strong> . Se o seu computador possuir uma porta USB 2.0, conecte o dispositivo USB nessa porta. <br> <strong> 3 </strong> Use um <strong> cabo USB diferente </strong> para conectar o dispositivo USB ao seu computador. <br> <strong> 4 </strong> Se você deseja copiar arquivos de um dispositivo USB (por exemplo, seu telefone celular ou câmera digital), que possui um cartão SD, então <strong> remover </strong> e <strong> reinserir </strong> a <strong> cartão SD </strong> . Além disso, remova o cartão SD do dispositivo USB e conecte-o a um <strong> leitor de cartão </strong> (se você possui um). <br> <strong> 5 </strong> <strong> Verificar </strong> e <strong> reparar erros </strong> na unidade USB usando o &#39; <strong> chkdsk </strong> &#39;comando. Fazer isso: </p> <blockquote><p> 1. Lançamento <strong> Prompt de comando como administrador </strong> . </p></blockquote> <p><img src=\"images/image_thumb-30-765.png\" alt=\"command prompt administrator\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 2. Na janela do prompt de comando, digite o seguinte comando e pressione <strong> Entrar </strong> : * </p></blockquote> <ul> <li> <ul> <li> <ul> <li><strong> chkdsk X: / F / R </strong></li> </ul> </li> </ul> </li> </ul> <p><strong> * Observação: </strong> Substitua a letra da unidade X de acordo com a letra da unidade USB. </p> <p> </p> <p> </p> <h6> PARTE 2. CORRIGIR &#39;O período do semáforo expirou&#39; ao copiar arquivos pela rede. </h6> <p> Se você receber o erro &#39;O período do semáforo expirou&#39; ao tentar copiar arquivos pela rede, tente o seguinte: </p> <h2> Método 1. Use um endereço IP estático. </h2> <p> Se você estiver usando DHCP, desative-o e especifique um endereço IP estático em ambos os computadores da rede. </p> <p> </p> <h2> Método 2. Atualize os drivers de rede em ambos os computadores. </h2> <ul> <li> Se você possui um laptop, tente o seguinte: <ul> <li> Se você estiver conectado via Wi-Fi, tente copiar os arquivos usando a conexão Ethernet (LAN) ou ... </li> <li> Navegue até o site de suporte do fabricante do seu laptop para baixar e instalar os drivers de rede mais recentes. </li> </ul> </li> <li> Se você possui um computador desktop, baixe os drivers mais recentes para sua placa de rede, no site de suporte do fabricante da placa-mãe. </li> </ul> <p><strong> GORJETA: </strong> Se você não conseguir encontrar o modelo do seu laptop ou placa-mãe, faça o seguinte: </p> <blockquote><p> 1. Pressione o <strong> janelas </strong> <img src=\"images/image_thumb8_thumb_thumb-904.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite: <strong> devmgmt.msc </strong> e clique <strong> OK </strong> para abrir o &#39;Gerenciador de Dispositivos&#39; <strong> . </strong></p></blockquote> <p><img src=\"images/image_thumb-1-166.png\" alt=\"device manager\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> </p> <p> 3. No Gerenciador de Dispositivos, expanda o <strong> Adaptadores de rede. <br> </strong> 4. Clique com o botão direito no adaptador de rede e clique em <strong> Atualizar driver </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-946.png\" alt=\"update driver\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Deixe o Windows procurar automaticamente um driver de atualização para o adaptador de rede. * </p></blockquote> <p><strong> *Observação: </strong> Se o Windows não conseguir encontrar um driver atualizado, use o nome do adaptador (por exemplo, &quot;Adaptador de rede Broadcom 802.11g&quot;) e procure um driver atualizado manualmente. </p> <p><img src=\"images/image_thumb-6-471.png\" alt=\"search for drivers\" loading=\"lazy\"></p> <p> </p> <p> </p> <h2> Método 3. Desative o antivírus ou firewall temporariamente. </h2> <p> O próximo método para corrigir o problema &quot;O período do semáforo expirou&quot; é desativar temporariamente o Firewall do Windows e o programa antivírus. </p> <p> 1. Pressione o <strong> janelas </strong> <img src=\"images/image_thumb8_thumb_thumb-462.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite: <strong> ao controle </strong> e clique <strong> OK </strong><strong> . </strong></p> <p><img src=\"images/image_thumb7-807.png\" alt=\"control panel command\" loading=\"lazy\"></p> <p> </p> <p> 3. Defina &quot;Visualizar por:&quot; para <strong> Ícones pequenos </strong> para exibir todos os itens do painel de controle. </p> <p> </p> <p><img src=\"images/image_thumb8-567.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Abra <strong> Firewall do Windows </strong> (ou &quot;Firewall do Windows Defender&quot; no Windows 10). </p> <p><img src=\"images/image_thumb-7-921.png\" alt=\"disable firewall wiindows\" loading=\"lazy\"></p> <p> </p> <p> 5. Clique em <strong> Ative ou desative o Firewall do Windows </strong> . </p> <p><img src=\"images/image_thumb-8-655.png\" alt=\"turn off windows defender firewall\" loading=\"lazy\"></p> <p> </p> <p> 6 <strong> Verificar </strong> a &quot; <strong> Desative o Firewall do Windows (não recomendado) </strong> &quot;opção e clique em <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-9-907.png\" alt=\"turn off windows firewall\" loading=\"lazy\"></p> <p> </p> <p> 7 <strong> Reiniciar </strong> seu computador e, em seguida, copie os arquivos. * </p> <p> * Nota: Depois de copiar os arquivos, siga as etapas acima para reativar o Firewall do Windows. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}