{"title":"CORREÇÃO: erros 0x800707e7, 0x000007E7 no Windows 10 Update.","content":"<p> O código de erro do Windows 10 Update &quot;0x800707E7 - 0x3000D: A instalação falhou na fase FIRST_BOOT com um erro durante a operação MIGRATE_DATA&quot;, geralmente ocorre quando o Windows não pode migrar um perfil de usuário. </p> <p> O erro 0x800707E7 no Windows 10 Update, comumente encontrado em computadores com placas de vídeo NVIDIA, que usam o NVIDIA Update Service para atualizar drivers ou outro software NVIDIA. Mais especificamente, em sistemas de placa NVIDIA, quando você instala o software NVIDIA, um novo usuário é criado automaticamente no Windows, chamado &quot;UpdatusUser&quot;, que é usado pelo serviço de atualização NVIDIA. </p> <p> Neste guia, você encontrará instruções passo a passo para resolver os seguintes erros no Windows 10 Update: </p> <ul> <li> <ul> <li> 0x800707E7 - 0x3000D: A instalação falhou na fase FIRST_BOOT com um erro durante a operação MIGRATE_DATA </li> <li> 0x000007E7: ERROR_PROFILE_DOES_NOT_MATCH_DEVICE, O perfil especificado se destina a um dispositivo de um tipo diferente do dispositivo especificado. </li> </ul> </li> </ul> <h2> Como resolver erros de atualização do Windows 10 0x800707e7, 0x000007E7. </h2> <h3> Etapa 1. Desinstale o software NVIDIA de sua máquina. </h3> <p> Se você possui uma placa gráfica NVIDIA, navegue até <strong> Painel de controle </strong> -&gt; <strong> Programas e características </strong> e <strong> Desinstalar </strong> tudo <strong> Software NVIDIA </strong> . * </p> <p> * Observação: esta etapa se aplica apenas a sistemas com placas NVIDIA. Se você não possui uma placa gráfica NVIDIA, pule para a etapa 2. </p> <p><strong> Para desinstalar o software NVIDIA. </strong></p> <p> 1. Navegue em <strong> Programas e características </strong> no painel de controle. Fazer isso: </p> <blockquote><p> 1. Pressione simultaneamente o Windows <img src=\"images/image_thumb36-131.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite: <strong> appwiz.cpl </strong> e clique <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-24-479.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 2. Selecione um por um todos os softwares NVIDIA e clique em <strong> Desinstalar. </strong></p> <p><img src=\"images/image_thumb-67-843.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Siga as instruções na tela para remover o software NVIDIA do seu computador. <br> 4. Quando a desinstalação estiver concluída <strong> reiniciar </strong> seu PC e prossiga para a próxima etapa. </p> <h3> Etapa 2. Exclua &quot;UpdatusUser&quot; e qualquer Perfil de usuário desconhecido. </h3> <p> 1. Clique com o botão direito no ícone do seu computador (Este PC) no Explorer e escolha <strong> Propriedades </strong> . <br> 2. Clique <strong> Configurações avançadas do sistema </strong> . <br> 3. Em <strong> Perfis de usuário </strong> , clique <strong> Definições </strong> . </p> <p><img src=\"images/image_thumb-68-812.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Selecione e <strong> excluir </strong> a <strong> Usuário atualizado </strong> perfil, ou qualquer outro perfil que é desconhecido para você ( <strong> exceto </strong> seu perfil e o <strong> Perfil Padrão </strong> ) </p> <p><img src=\"images/image_thumb-69-946.png\" alt=\"Delete User Profile\" loading=\"lazy\"></p> <p> 4. Quando terminar, clique em <strong> OK </strong> e continue para a próxima etapa. </p> <h3></h3> <h3> Etapa 3. Remover Perfis de Usuário Desconhecidos do Registro. </h3> <p> 1. Abra o Editor do Registro: para fazer isso: </p> <blockquote><p> 1. Pressione Windows <img src=\"images/image_thumb41-520.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite <strong> regedit </strong> e pressione <strong> Entrar </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-235.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> </p> <p> 3. No Editor do Registro, navegue até a seguinte chave no painel esquerdo: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows NT \\ CurrentVersion \\ ProfileList </li> </ul> <p> 4a. Agora expanda o <strong> ProfileList </strong> e clique em cada perfil &quot;S-1-5-21-xxxx&quot; e veja se algum deles tem o valor &quot; <strong> C: \\ Users \\ UpdatusUser &quot; </strong> no <strong> ProfileImagePath. </strong></p> <p><img src=\"images/image_thumb-70-754.png\" alt=\"FIX: 0x800707e7 or 0x000007E7 errors in Windows 10 Update.\" loading=\"lazy\"></p> <p> 4b. Se você encontrar o &quot; <strong> C: \\ Users \\ UpdatusUser &quot; </strong> valor <strong> </strong> em um perfil, selecione o perfil no painel esquerdo e <strong> Excluir </strong> isto. </p> <p><img src=\"images/image_thumb-71-506.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Por fim, veja o nome completo de cada chave de perfil &quot;S-1-5-21-xxxx&quot; (na &quot;chave ProfileList&quot;) e <strong> excluir </strong> qualquer chave de perfil que tenha um <strong> .bak </strong> extensão no final de seu nome. </p> <p><img src=\"images/image_thumb-72-738.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Quando terminar, feche o Editor do Registro e <strong> reiniciar </strong> seu PC. <br> 7. Após reiniciar: </p> <blockquote> <p> uma. Navegar para <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Site de download do Windows 10 </a> e clique no <strong> Atualize agora </strong> botão. </p> <p><img src=\"images/image_thumb-65-120.png\" alt=\"Download Windows 10 21H1 \" loading=\"lazy\"></p> <p> b. Salve o arquivo &quot;Windows10Upgrade9252.exe&quot; em sua área de trabalho. <br> c. Clique duas vezes no arquivo baixado para abrir o <strong> Assistente de atualização do Windows </strong> . <br> d. Clique <strong> Atualize agora </strong> para iniciar a atualização. </p></blockquote> <p> 8. O Windows Update agora deve ser concluído sem problemas e sem o erro 0x800707e7 (ou 0x000007E7). <br> 9. Finalmente, depois de atualizar o Windows 10, e se você possui uma placa de vídeo NVIDIA, prossiga e reinstale o software da NVIDIA. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Por favor, deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar esse problema. </p>"}