{"title":"Como PARAR a propagação no uTorrent.","content":"<p> Muitos de nós temos usado o uTorrent para baixar filmes ou outros arquivos ao longo dos anos, pois é o cliente P2P mais popular para baixar ou compartilhar arquivos grandes pela Internet. Mas, às vezes, você precisa parar de semear no uTorrent, porque você precisa de toda a largura de banda disponível da Internet (velocidade) para fazer upload ou download de um arquivo grande (via uTorrent). </p> <p> Neste artigo, você encontrará instruções passo a passo sobre como desativar completamente a propagação no uTorrent e como interromper a propagação após o download. </p> <h2> Como desligar a propagação no uTorrent. </h2> <p> A. Para interromper temporariamente a propagação durante o download ou upload de arquivos no uTorrent: </p> <p> 1. Clique no torrent em seu Torrent Feed e clique no <strong> PARE </strong> botão ou pressione o <strong> Reciclar </strong> ícone para remover o arquivo de propagação da lista. </p> <p><img src=\"images/image_thumb-51-323.png\" alt=\"Stop Seeding uTorrent\" loading=\"lazy\"></p> <p> </p> <p> B. Para desativar completamente a propagação do uTorrent, proceda da seguinte forma: </p> <p> 1. De <strong> Opções </strong> menu, clique <strong> Preferências. </strong></p> <p><img src=\"images/image_thumb-52-513.png\" alt=\"uTorrent Preferences\" loading=\"lazy\"></p> <p> </p> <p> 2. Em <strong> Largura de banda </strong> opções, faça as seguintes alterações e clique em <strong> OK. </strong></p> <ul> <li> Colocou o <strong> Taxa máxima de upload (kB / s) </strong> para <strong> 1 </strong> . </li> <li> Colocou o <strong> Número de slots de upload por torrent </strong> para <strong>0</strong> . </li> </ul> <p><img src=\"images/image_thumb-53-961.png\" alt=\"disable seeding uTorrent\" loading=\"lazy\"></p> <p> </p> <p> C. Para evitar automaticamente a propagação do uTorrent quando um arquivo torrent é baixado. </p> <p> 1. De <strong> Opções </strong> menu, clique <strong> Preferências. <br> </strong> 2 <strong> </strong> Dentro <strong> Enfileiramento </strong> opções, faça as seguintes alterações e clique em <strong> OK. </strong></p> <ul> <li> Colocou o <strong> Proporção mínima (%) </strong> para <strong>0</strong></li> <li> Colocou o <strong> Tempo mínimo de semeadura (minutos) </strong> para <strong>0</strong></li> <li> Colocou o <strong> Número mínimo de sementes disponíveis </strong> para <strong> 0</strong></li> <li><strong> Verificar </strong> a <strong> Limite a taxa de upload </strong> caixa de seleção e tipo <strong>0</strong> na caixa. </li> </ul> <p><img src=\"images/image_thumb-54-589.png\" alt=\"prevent utorrent seeding\" loading=\"lazy\"></p> <p> Isso é tudo, pessoal! Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}