{"title":"CORREÇÃO: Erro de recebimento do Outlook 0x80004005 - Falha na operação (resolvido)","content":"<p> Se você enfrentar o erro de recebimento do Outlook 0x80004005, continue lendo a seguir para saber como corrigir o problema. Este tutorial contém instruções para corrigir o &quot;Recebimento de erro relatado (0x80004005) - A operação falhou&quot;, no Progresso de Envio / Recebimento do Outlook (Outlook 2007, Outlook 2010, Outlook 2013 ou Outlook 2016). </p> <p><img src=\"images/image_thumb-15-598.png\" alt=\"FIX: Outlook Receiving error 0x80004005 - The Operation failed\" loading=\"lazy\"></p> <p> </p> <p> O erro &quot;0x80004005&quot; do Outlook pode ocorrer em qualquer versão do Outlook (2003, 2007, 2010 ou 2013) e geralmente significa que o arquivo de dados PST do Outlook ou o Perfil do Outlook foi corrompido ou danificado devido a uma falha de energia, dano no disco ou outras razões desconhecidas. </p> <h4> Como resolver o erro de recebimento 0x80004005 no Outlook 2003, 2007, 2010 ou 2013. </h4> <h6> Método 1. Desative temporariamente a proteção antivírus. </h6> <p> Se você estiver usando um programa antivírus com recursos de verificação de e-mail, tente desabilitá-lo temporariamente e verifique o Outlook novamente. </p> <p> </p> <h6> Método 2. Desative a notificação de novo email no Outlook. </h6> <p> Em alguns casos, você pode enfrentar o erro 0x80004005 no processo de recebimento do Outlook, se as novas notificações de email estiverem habilitadas. Para desativar os alertas de Novo email no Outlook 2010, 2013 ou 2016: * </p> <p> 1. Do <strong> Arquivo </strong> menu, clique <strong> Opções </strong> . <br> 2. Selecione <strong> Correspondência </strong> no painel esquerdo, e então <strong> desmarcar </strong> todas as caixas de seleção na seção &#39;Chegada de mensagens&#39; (no painel direito). <br> 3. Clique <strong> OK </strong> e <strong> reiniciar </strong> Panorama. * </p> <p> * Nota: Para desligar o novo alerta de notificação por e-mail no Outlook 2007: </p> <blockquote><p> 1.Clique <strong> Ferramentas </strong> -&gt; <strong> Opções </strong> . <br> 2. Clique <strong> Configuração de e-mail </strong> e então clique <strong> Opções avançadas de e-mail </strong> . <br> 3 <strong> Claro </strong> todas as caixas de seleção nas opções &#39;Quando novos itens chegarem à minha caixa de entrada&#39;. <br> 4. Quando terminar, clique em <strong> OK </strong> duas vezes para fechar as opções de e-mail. <br> 5. Feche e reinicie o Outlook. </p></blockquote> <p><img src=\"images/image_thumb-16-303.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Se o Outlook ainda exibir o erro 0x80004005 durante o envio / recebimento, desfaça as alterações feitas e prossiga para o próximo método. </p> <p> </p> <h6> Método 3. Repare o arquivo de dados .PST do Outlook. </h6> <h5> Etapa 1. Localize o arquivo OUTLOOK PST DATA no disco. </h5> <p> 1 <strong> Perto </strong> Panorama. <br> 2. Navegue para <strong> Painel de controle </strong> e aberto <strong> Correspondência </strong> . (Se você não visualizar o item Mail, altere o <strong> Visto por </strong> : para <strong> Ícones pequenos </strong> ) </p> <p> </p> <p><img src=\"images/image_thumb-40-648.png\" alt=\"control panel all items\" loading=\"lazy\"></p> <p> </p> <p> 3. Clique <strong> Arquivos de dados </strong> botão. </p> <p><img src=\"images/image_thumb-35-600.png\" alt=\"How to find Outlook data files location.\" loading=\"lazy\"></p> <p> </p> <p> 4. Observe o local (caminho) onde o arquivo de dados do Outlook (por exemplo, Outlook.pst) está armazenado em seu computador e feche as Opções de email. </p> <p><img src=\"images/image_thumb-36-798.png\" alt=\"outlook data file location\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h5> Etapa 2. Repare o arquivo de dados PST do Outlook com SCANPST </h5> <p> 1. Para reparar os arquivos de dados PST do Outlook, clique duas vezes em &quot; <strong> SCANPST.EXE </strong> &quot;, a partir do seguinte local em seu disco: * </p> <ul> <li><strong> C: \\ Arquivos de programas \\ Microsoft Office \\% OfficeVersion% \\ SCANPST.EXE </strong></li> </ul> <p> * Observação: a localização de &quot;scanpst.exe&quot; é diferente para cada versão do Outlook e do Windows que você instalou. A seguir são mencionadas as localizações do arquivo &quot;SCANPST.EXE&quot;, de acordo com a versão instalada do Windows e Office. </p> <blockquote><p><strong> Outlook 2013 e 2016 </strong><br> Windows de 32 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office15 <br> Windows de 64 bits&gt; C: \\ Arquivos de programas (x86) \\ Microsoft Office \\ Office15 <br> Outlook de 64 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office15 <br> Clique para executar&gt; C: \\ Arquivos de programas \\ Microsoft Office 15 \\ root \\ office15 <br> <strong> Outlook 2010 </strong><br> Windows de 32 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office14 <br> Windows de 64 bits&gt; C: \\ Arquivos de programas (x86) \\ Microsoft Office \\ Office14 <br> Outlook de 64 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office14 <br> <strong> Outlook 2007 </strong><br> Windows de 32 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office12 <br> Windows de 64 bits&gt; C: \\ Arquivos de programas (x86) \\ Microsoft Office \\ Office12 <br> <strong> Outlook 2003 </strong><br> Windows de 32 bits&gt; C: \\ Arquivos de programas \\ Arquivos comuns \\ System \\ MSMAPI \\ <br> Windows de 64 bits&gt; C: \\ Arquivos de programas (x86) \\ Arquivos comuns \\ System \\ MSMAPI \\ </p> <p><img src=\"images/image_thumb-37-648.png\" alt=\"Repair Outlook PST Inbox Repair Tool\" loading=\"lazy\"></p></blockquote> <p> </p> <p> 2. Clique <strong> Navegar </strong> e navegue até o local onde o arquivo de dados do Outlook está armazenado. </p> <p><img src=\"images/image_thumb-42-299.png\" alt=\"How to Repair Outlook PST Data File(s) with Inbox Repair Tool (SCANPST).\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Selecione o arquivo de dados do Outlook que deseja reparar. (por exemplo, Outlook.pst) e clique em <strong> OK </strong> . <br> 4. Finalmente pressione <strong> Começar </strong> para iniciar o reparo. </p> <p><img src=\"images/image_thumb-39-524.png\" alt=\"How to Repair Outlook PST Data Files\" loading=\"lazy\"></p> <p> 5. Aguarde até que o reparo do Outlook PST seja concluído e feche o utilitário Inbox Repair Tool. <br> 6. Abra o Outlook e clique no botão &quot;Enviar e receber&quot; para verificar se o erro 0x80004005 foi resolvido. Se o problema persistir, passe para o próximo método. </p> <p> </p> <h6> Método 4. Exclua e recrie o perfil do Outlook. </h6> <p> 1 <strong> Perto </strong> Panorama. <br> 2. Navegue para <strong> Painel de controle </strong> e aberto <strong> Correspondência </strong> . (Se você não visualizar o item Mail, altere o <strong> Visto por </strong> : para <strong> Ícones pequenos </strong> ) </p> <p> 3. Clique <strong> Mostrar perfis. * </strong></p> <p><strong> * Nota importante: </strong> Se você usar mais de uma conta de e-mail, verifique se o erro aparece em todas as contas de e-mail. Se o erro aparecer apenas em uma conta, tente excluir e adicionar novamente apenas a conta com o problema, usando o seguinte procedimento: </p> <blockquote><p> uma. Clique no <strong> Contas de e-mail </strong> botão e remova a conta de e-mail com o problema. <br> b. Então clique <strong> Arquivos de dados </strong> e remova o arquivo de dados do Outlook, associado à conta removida. <br> c. Finalmente clique <strong> Contas de e-mail </strong> novamente e adicione novamente a conta de e-mail removida. </p></blockquote> <p><img src=\"images/image_thumb-2-659.png\" alt=\"Create Secondary Outlook Profile\" loading=\"lazy\"></p> <p> </p> <p> 4. Selecione o perfil atual e clique em <strong> Remover </strong> . Então clique <strong> sim </strong> para confirmar sua decisão. </p> <p><img src=\"images/image_thumb-53-516.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Em seguida, clique no botão <strong> Adicionar </strong> e dê um nome para o perfil: (por exemplo, &quot;Outlook&quot;). </p> <p><img src=\"images/image_thumb-54-154.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Siga as etapas do assistente &quot;Adicionar conta&quot; e reconfigure sua conta de e-mail. </p> <p> </p> <p><img src=\"images/image_thumb-9-723.png\" alt=\"outlook account setup\" loading=\"lazy\"></p> <p> </p> <p> 7. Depois de adicionar sua conta, abra o Outlook e verifique se o erro &quot;Recebendo relatório de erro (0x80004005): A operação falhou&quot; foi resolvido. * </p> <p> * Observação: se o Outlook funcionar bem e receber e-mails sem problemas, prossiga e restaure seus e-mails do arquivo de dados .PST antigo do Outlook, seguindo as instruções abaixo: </p> <ol> <li> <ol> <li> A partir de <strong> Panorama </strong> de <strong> Arquivo </strong> menu, selecione <strong> Abrir e exportar </strong> &gt; <strong> Importar / Exportar </strong> . </li> <li> Nas opções &#39;Escolha uma ação a ser executada&#39;, selecione <strong> Importar de outro programa ou arquivo </strong> e clique <strong> Próximo. </strong></li> <li> Nas opções &#39;Selecionar tipo de arquivo para importar &quot;, selecione <strong> Arquivo de dados do Outlook (.pst) </strong> e clique <strong> Próximo </strong> . </li> <li> Em &#39;Arquivo para tela de importação&#39;, clique em <strong> Navegar. </strong></li> <li> Selecione o arquivo PST antigo do Outlook do qual deseja importar seus e-mails e clique <strong> Abrir. </strong></li> <li> Clique <strong> Próximo </strong> E <strong> Terminar. </strong></li> </ol> </li> </ol> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}