{"title":"CORREÇÃO: A pasta DRAFTS do Outlook está ausente do painel de navegação no Outlook 2013, 2010 ou 2007. (Resolvido)","content":"<p> O seguinte problema ocorreu em um dos meus clientes: De repente e sem um motivo óbvio, a pasta Rascunhos está ausente do painel de navegação no Outlook 2013. A primeira ação para restaurar a pasta Rascunhos ausente é pesquisar em todas as outras pastas do Outlook para certifique-se de que a pasta não foi movida ou excluída por erro. Se você ainda não conseguir encontrar a pasta ausente, continue a seguir para corrigir o problema. </p> <p><img src=\"images/image_thumb-37-460.png\" alt=\"Drafts folder Missing Outlook\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contém instruções sobre como restaurar uma pasta ausente no Outlook 2007, 2010, 2013, 2016 ou 365. </p> <h4> Como restaurar uma pasta ausente no painel de navegação do Outlook. </h4> <h6> Método 1. Faça uma varredura em seu sistema em busca de vírus e malware. </h6> <p> A primeira etapa para resolver o problema de &quot;pastas ausentes&quot; no Outlook é garantir que seu sistema esteja livre de vírus / malware. Para essa tarefa, siga as instruções neste guia: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Como fazer uma varredura em seu computador em busca de vírus e outros programas maliciosos. </a></p> <p> </p> <h6> Método 2. REINICIALIZE as pastas do Outlook. </h6> <p> Após a verificação de vírus, prossiga e redefina as pastas do Outlook para o padrão usando o processo abaixo: </p> <p> 1. Feche o aplicativo Outlook. <br> 2. Pressione o <strong> janelas </strong> <img src=\"images/image_thumb8_thumb_thumb-622.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 3. Na caixa Pesquisar, digite: <strong> outlook / resetfolders </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-36-732.png\" alt=\"outlook reset folders\" loading=\"lazy\"></p> <p> </p> <p> 4. O Outlook será aberto e todas as pastas ausentes serão recuperadas. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? </p> <p> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe este post do blog nas redes sociais para ajudar a divulgar isso. </p>"}