{"title":"Como abrir o PowerShell como administrador na pasta atual no File Explorer (Windows 10)","content":"<p> Se você deseja abrir o PowerShell ou PowerShell como Administrador, em qualquer local / pasta no Explorador de Arquivos, continue lendo este tutorial. Como você conhece as formas usuais de abrir o PowerShell no Windows 10, é pesquisá-lo usando a pesquisa da Cortana ou (mais rápido) pressionando <strong> Vencer <img src=\"images/image_thumb8_thumb_thumb-479.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"></strong> + <strong> X </strong> para abrir o &quot;menu Power User&quot; e executar o Windows PowerShell a partir daí. </p> <p><img src=\"images/image_thumb-54-350.png\" alt=\"PoweShell Admin (Win + X menu)\" loading=\"lazy\"></p> <p> </p> <p> Embora esses métodos sejam úteis, às vezes é necessário abrir o PowerShell em um local / pasta específico. Para fazer isso, siga as instruções abaixo. </p> <h4> Como abrir o Windows PowerShell em um local específico no Windows 10. </h4> <p> 1. Navegue até a pasta onde deseja abrir o PowerShell. <br> 2 <strong> Calma </strong> a <strong> MUDANÇA </strong> chave e <strong> clique com o botão direito </strong> em qualquer lugar dentro da pasta. <br> 3. No menu do botão direito, selecione <strong> Abra a janela do PowerShell aqui </strong> para <strong> </strong> abra uma nova janela do PowerShell nessa pasta. </p> <p> </p> <p><img src=\"images/image_thumb-55-793.png\" alt=\"Open PoweShell at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Se você deseja abrir &#39;PowerShell As Admin&#39; em qualquer pasta, clique no botão <strong> Arquivo </strong> menu e selecione <strong> Abra o Windows PowerShell como administrador </strong> . * </p> <p> * Observação: como você pode ver no menu &#39;Arquivo&#39;, você também pode abrir uma janela &quot;simples&quot; do PowerShell. </p> <p><img src=\"images/image_thumb-56-830.png\" alt=\"Open PoweShell As Administrator at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p><strong> Ajuda adicional: </strong> Se você é um fã de atalhos de teclado, outra maneira de abrir o PowerShell (Admin) é pressionar o <strong> Alt </strong> + <strong> F </strong> + <strong> S </strong> + <strong> UMA </strong> chaves em ordem. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}