{"title":"Como desinstalar a versão do Edge Chromium no Windows 10.","content":"<p> Muitos usuários relataram que, após instalar a nova versão baseada em Chromium do navegador Microsoft Edge no Windows 10, o sistema ficou muito lento ou congela em momentos aleatórios. Se você estiver enfrentando o mesmo problema, continue lendo abaixo para desinstalar a versão do Edge Chromium do seu PC. * </p> <p> * Observação: se a versão Chromium do Microsoft Edge ainda não estiver instalada em seu sistema, leia as instruções neste <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> artigo </a> para evitar que o Microsoft Edge seja instalado automaticamente. </p> <p><img src=\"images/image_thumb-38-388.png\" alt=\"Remove Edge Chromium in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> A nova versão baseada em Chromium do navegador Microsoft Edge é instalada automaticamente com o <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> atualizar. Quando isso acontece, você não pode remover o Microsoft Edge do <strong> Começar </strong> cardápio <img src=\"images/image_thumb2_thumb_thumb-565.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Definições </strong><img src=\"images/image_thumb-66-219.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Apps </strong> -&gt; <strong> Aplicativos e recursos </strong> opções, porque o <strong> Desinstalar </strong> opção está acinzentada. Para contornar essa restrição, siga as etapas abaixo. </p> <p><img src=\"images/image_thumb-39-654.png\" alt=\"How to Uninstall Edge Chromium version in Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Como remover o Edge Chromium do Windows 10. </h4> <p> Para desinstalar o novo Edge baseado em Chromium no Windows 10: </p> <p> 1. Navegue até a seguinte pasta em seu PC: * </p> <ul> <li> C: \\ Arquivos de programas (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </li> </ul> <p> * Observação: o nome da pasta &quot;85.0.564.41&quot; indica a versão instalada da nova versão do Chromium e pode ser diferente em seu PC. </p> <p> 2. Selecione o caminho da pasta na barra de endereço e clique com o botão direito&gt; <strong> Cópia de. </strong></p> <p><img src=\"images/image_thumb35_thumb-738.png\" alt=\"image_thumb[35]\" loading=\"lazy\"></p> <p> </p> <p> 3. Abra <strong> Prompt de comando como administrador, </strong> modelo <strong> CD </strong> e então pressione <strong> CTRL + V </strong> para colar no caminho da pasta copiada. Quando terminar, pressione <strong> Entrar </strong> . * </p> <p> * ex .: No exemplo atual, o comando será: </p> <p><em> cd C: \\ Arquivos de programas (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </em></p> <p><img src=\"images/image_thumb39_thumb-252.png\" alt=\"Uninstall Edge Chromium\" loading=\"lazy\"></p> <p> </p> <p> 4. Agora, dê o comando abaixo (Copiar / Colar) no prompt de comando para remover a versão Chromium do navegador Microsoft Edge do seu PC. </p> <ul> <li> setup.exe –uninstall –system-level –verbose-logging –force-uninstall </li> </ul> <p><img src=\"images/image_thumb47_thumb-506.png\" alt=\"Uninstall Edge Chromium command\" loading=\"lazy\"></p> <p> 5. Assim que o comando acima for executado, a versão antiga do EDGE será ativada novamente. Reinicie o seu PC para aplicar as alterações. <br> 6. Depois de reiniciar, prossiga para instalar manualmente o <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> novo navegador Edge baseado em Chromium </a> no seu PC, para evitar a entrega automática, ou prevenir a futura instalação do Edge Chromium, seguindo as instruções deste artigo: <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Como evitar que o Edge Chromium seja instalado automaticamente no Windows 10. </a></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}