{"title":"CORREÇÃO: o programa não pode ser iniciado porque está faltando MSVCP100.dll ou MSVCR100.dll (resolvido)","content":"<p> O seguinte erro pode ocorrer na inicialização do Windows ou ao tentar iniciar um programa: &quot;O programa não pode ser iniciado porque MSVCP100.dll está faltando no seu computador. Tente reinstalar o programa para corrigir o problema.&quot;. </p> <p><img src=\"images/image_thumb-14-145.png\" alt=\"MSVCP100.dll is Missing - fix\" loading=\"lazy\"></p> <p> </p> <p> Os problemas &quot;MSVCP100.dll está ausente&quot; ou &quot;MSVCR100.dll está ausente&quot; geralmente ocorrem, após atualizar seu sistema para a versão mais recente do Windows (por exemplo, após migrar seu sistema do Windows 8.1 para o Windows 10) ou após restaurar seu sistema para um ponto de restauração anterior usando o recurso &quot;Restauração do Sistema&quot; do Windows. </p> <p> Neste tutorial, você encontrará instruções para resolver os erros &quot;msvcr100.dll ausente&quot; ou &quot;msvcp100.dll ausente&quot; no sistema operacional Windows 10, 8 / 8.1 ou 7. </p> <h4> Como CORRIGIR: &quot;O programa não pode ser iniciado porque está faltando MSVCP100.DLL ou MSVCR100.DLL&quot;. </h4> <h6> Método 1. Desinstale e reinstale o Adobe Acrobat Reader DC. </h6> <p> O primeiro método para resolver o problema &quot;MSVCP100.dll está ausente&quot; é remover e reinstalar o programa &#39;Acrobat Reader DC&#39; em seu sistema. </p> <p><strong> 1 </strong> Navegue para o Windows <strong> Painel de controle </strong> e aberto <strong> Programas e características </strong> . <br> <strong> 2 </strong> Selecione os <strong> Adobe Acrobat Reader DC </strong> e clique <strong> Desinstalar </strong> para removê-lo. </p> <p><img src=\"images/image_thumb-9-944.png\" alt=\"fix MSVCP100.dll is Missing \" loading=\"lazy\"></p> <p> </p> <p><strong> 3 </strong> Siga as instruções na tela para remover o Acrobat Reader e então <strong> reiniciar </strong> seu computador. <br> <strong> 4 </strong> Após reiniciar, abra seu navegador da Web e navegue até <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> Página de download do Acrobat Reader DC </a> e clique no <strong> Instale agora </strong> , para baixar e instalar a versão mais recente do Acrobat Reader para o seu sistema. </p> <p><img src=\"images/image_thumb-10-958.png\" alt=\"fix MSVCR100.dll is Missing \" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Método 2. Repare todas as versões do Microsoft Visual C ++ Redistributable Package. </h6> <p> O segundo método para corrigir os problemas &quot;MSVCR100.dll - MSVCp100.dll messing&quot; é reparar todas as versões instaladas * do Microsoft Visual C ++ Redistributable Package. ** </p> <p><strong> 1 </strong> Navegue para o Windows <strong> Painel de controle </strong> e aberto <strong> Programas e características </strong> . <br> <strong> 2 </strong> Encontre e repare, uma por uma *, todas as versões instaladas de &quot;Microsoft Visual C ++ Redistributable Package (s)&quot;. </p> <p> * por exemplo. Selecione o &quot;Microsoft Visual C ++ 2013 Redistributable Package (x86)&quot; e clique em <strong> Mudar </strong> e então clique em <strong> Repai </strong> botão r. Quando o processo de reparo for concluído, destaque o &quot;Microsoft Visual C ++ 2013 Redistributable Package (x64)&quot; e execute as mesmas etapas ( <strong> Mudar </strong> &gt; <strong> Reparar </strong> ) </p> <p> ** Nota: Se você não conseguir encontrar (qualquer versão do) &quot;Microsoft Visual C ++ Redistributable Package&quot; nos programas instalados, prossiga para o método 3 abaixo para instalá-lo. </p> <p><img src=\"images/image_thumb-11-929.png\" alt=\"Program Can't Start MSVCr100.dll is Missing \" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> 3 </strong> Quando o reparo for concluído, <strong> reiniciar </strong> seu computador. </p> <p> </p> <h6> Método 3. Desinstale e reinstale o Microsoft Visual C ++ Redistributable Package mais recente. </h6> <p> O próximo método para resolver o problema &quot;O programa não pode ser iniciado porque está faltando MSVCP100.dll&quot; é remover todas as versões instaladas do Microsoft Visual C ++ Redistributable Package e, em seguida, baixar e instalar a versão mais recente. </p> <p><strong> 1 </strong> Navegue para o Windows <strong> Painel de controle </strong> e aberto <strong> Programas e características </strong> . <br> <strong> 2 </strong> Encontre e remova (uma por uma) todas as versões instaladas de &quot;Microsoft Visual C ++ Redistributable Package (s)&quot;. </p> <p><img src=\"images/image_thumb-12-326.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 3 </strong> Após a desinstalação, <strong> reiniciar </strong> seu computador. <br> <strong> 4 </strong> Após reiniciar, abra seu navegador da Web e navegue até <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48145\" target=\"_blank\" rel=\"nofollow noopener\"> Página de download do Visual C ++ redistribuível para Visual Studio 2015 </a> para baixar e instalar a versão mais recente do Microsoft Visual C ++ Redistributable Package. * </p> <p><strong> * Nota importante: </strong> Baixe e instale as duas versões. (&quot;vc_redist.x86.exe&quot; &amp; &quot;vc_redist.x64.exe&quot;) </p> <p> </p> <h6> Método 4. Copie os arquivos ausentes para o local correto. </h6> <p> Em alguns casos, os problemas &quot;MSVCR100.dll está ausente&quot; e &quot;MSVCP100.dll está ausente&quot;, geralmente aparecem após a atualização do Windows (por exemplo, do Windows 8.1 para o Windows 10). Nesses casos, execute as seguintes etapas para resolver seus problemas: </p> <p><strong> 1 </strong> Copie os arquivos &quot; <strong> msvcp100.dll </strong> &quot;&amp;&quot; <strong> msvcr100.dll </strong> &quot; a partir de &quot; <strong> C: \\ Windows.old \\ WINDOWS \\ SysWOW64 </strong> &quot;pasta para&quot; <strong> C: \\ Windows \\ SysWOW64 </strong> &quot; pasta. <br> <strong> 2 </strong> <strong> Reiniciar </strong> seu computador. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}