{"title":"Como proteger seu PC com o BitLocker no Windows 10.","content":"<p> Este tutorial contém instruções passo a passo sobre como proteger seu PC com senha com criptografia BitLocker. O BitLocker é um recurso de criptografia de disco completo incluído nas edições Windows 10 Professional e Enterprise e pode ajudá-lo a proteger seus dados pessoais contra acesso não autorizado. </p> <p> Imagine o seguinte cenário: Seu laptop pessoal é roubado ou perdido e seus dados privados ficam disponíveis a olhos indiscretos. Para evitar que isso aconteça, leia este guia e aprenda como proteger com senha o seu PC e seus valiosos dados com criptografia forte, a fim de se tornar inacessível para qualquer pessoa sem a senha de descriptografia. </p> <ul> <li><strong> Artigo relacionado: <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Como proteger uma pasta com uma senha. </a></strong></li> </ul> <h4> Como usar o BitLocker para criptografar e proteger seu PC com Windows 10. </h4> <p> Para proteger a unidade do sistema operacional, com o BitLocker no Windows 10 Pro ou Enterprise: </p> <p> 1. Do Windows <strong> Painel de controle </strong> , clique <strong> Sistema e Segurança </strong> e então clique <strong> Criptografia de unidade bitlocker </strong> . </p> <p><img src=\"images/image_thumb-33-320.png\" alt=\"How to Protect your PC with BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Ao lado da unidade do sistema operacional C :, clique em <strong> Ativar BitLocker </strong> . * </p> <p> * Observação: se após pressionar &#39;Ativar BitLocker&#39;, você receber o erro &quot;Este dispositivo não pode usar um Módulo de plataforma confiável ...&quot;, leia este artigo para corrigir o problema. </p> <p><img src=\"images/image_thumb-34-100.png\" alt=\"turn on bitlocker operating system drive\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Na próxima tela, escolha como deseja desbloquear a unidade na inicialização. </p> <blockquote><p> 1. Se você deseja desbloquear seu PC usando um dispositivo USB, clique <strong> Insira uma unidade flash USB. <br> </strong> 2. Se você deseja desbloquear seu PC digitando uma senha, clique <strong> insira uma senha </strong> . (como neste exemplo) </p></blockquote> <p><img src=\"images/image_thumb-35-212.png\" alt=\"enable bitlocker protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Agora digite uma senha muito forte e clique em <strong> Próximo </strong> . </p> <p><img src=\"images/image_thumb-36-435.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Agora selecione onde deseja salvar * a chave de recuperação e clique em <strong> Próximo </strong> . * </p> <p> * Por exemplo: se você fizer login no Windows 10 com uma conta da Microsoft, clique em <strong> Salve em sua conta da Microsoft. </strong> Se você fizer login no Windows 10 com uma conta local, escolha uma das outras opções. </p> <p> Notas: <br> 1. Se você salvar a chave de recuperação do BitLocker em sua conta da Microsoft, poderá visualizar a chave após fazer o login em <a title=\"https://onedrive.live.com/recoverykey.\" href=\"https://onedrive.live.com/recoverykey.\" target=\"_blank\" rel=\"nofollow noopener\"> https://onedrive.live.com/recoverykey. </a><br> 2. Sempre prefiro armazenar a chave de recuperação em uma unidade USB, a fim de estar preparado para solucionar problemas do BitLocker. </p> <p> </p> <p><img src=\"images/image_thumb-37-801.png\" alt=\"save bitlocker recovery key\" loading=\"lazy\"></p> <p> </p> <p> 6. Na próxima tela, deixe a configuração padrão se o seu PC e / ou drive for novo e clique em <strong> Próximo </strong> novamente. </p> <p><img src=\"images/image_thumb-38-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Nas opções do modo de criptografia, deixe a configuração padrão e clique em <strong> Próximo </strong> . </p> <p><img src=\"images/image_thumb-39-785.png\" alt=\"bitlocker encryption mode\" loading=\"lazy\"></p> <p> </p> <p> 8. Na última tela, clique <strong> Prosseguir </strong> , para reiniciar e verificar o sistema antes de habilitar a proteção do BitLocker. </p> <p><img src=\"images/image_thumb-40-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Ao reiniciar, você será solicitado a inserir sua senha do BitLocker. Digite sua senha e pressione <strong> Entrar </strong> . * </p> <p> * Observação: se o BitLocker não puder aceitar a senha ou se você enfrentar outros problemas, tente uma das seguintes ações para fazer login no Windows: </p> <blockquote><p> 1. Pressione a tecla ESC na tela Senha do BitLocker para acessar as opções de recuperação. <br> 2. Pressione repetidamente a tecla ESC após ligar seu PC, para ignorar o teste do BitLocker. </p></blockquote> <p> 10. Se os testes do BitLocker forem aprovados, depois de inicializar o Windows 10, o BitLocker começará a criptografar a unidade do sistema operacional. Para visualizar o status do processo de criptografia, clique na notificação do BitLocker na barra de tarefas ou vá para Painel de controle&gt; Criptografia de unidade de disco BitLocker. </p> <p><img src=\"images/image_thumb-41-171.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}