{"title":"CORRECÇÃO: HDMI sem som na TV ou HDMI não exibido em dispositivos de reprodução (resolvido).","content":"<p> Se você conectou sua TV ao laptop usando um cabo HDMI e não há saída de som durante a reprodução de um vídeo, ou o HDMI não é exibido como um dispositivo de reprodução, continue lendo este tutorial. </p> <p> Problema nos detalhes: em um laptop com Windows 10, o dispositivo de saída digital (HDMI) não está listado como um dispositivo de reprodução e não há saída de som quando conectado à TV com um cabo HDMI. </p> <p> O problema &quot;Sem saída de som de HDMI&quot; no Windows 10 pode aparecer por vários motivos, portanto, neste guia, você encontrará instruções passo a passo para solucionar o problema. </p> <h2> Como CORRIGIR: Nenhuma saída de som de HDMI e HDMI não é exibida em dispositivos de reprodução no Windows 10 * </h2> <p> * Sugestões: Antes de prosseguir para as etapas abaixo: </p> <ul> <li><strong> Clique com o botão direito </strong> no <strong> ícone de som </strong><img src=\"images/image_thumb-11-109.png\" alt=\"image\" loading=\"lazy\"> na barra de tarefas para <strong> Mixer de volume aberto </strong> e garantir que o <strong> Dispositivo de saída digital </strong> não está silenciado. </li> <li> Certifique-se de que o cabo HDMI esteja conectado corretamente no laptop e na TV. </li> <li> Depois de conectar o cabo HDMI, <strong> reiniciar </strong> seu computador. </li> <li> Na TV, defina a porta HDMI correta como o dispositivo de entrada de vídeo. </li> <li> Se você possui um laptop, feche a tampa ou pressione o botão Liga / Desliga uma vez para colocá-lo em repouso. Em seguida, pressione novamente o botão liga / desliga e verifique o som do HDMI novamente. </li> <li> Verifique se o problema persiste com outro cabo HDMI. </li> </ul> <p> </p> <h3> Etapa 1. Defina HDMI como o dispositivo de reprodução padrão. </h3> <p> A primeira etapa para resolver os problemas de áudio HDMI no Windows 10 é definir HDMI como o dispositivo de áudio padrão. </p> <p> 1. Navegue para o Windows <strong> Painel de controle </strong> e aberto <strong> Som. </strong></p> <p><img src=\"images/image_thumb-14-686.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Certifique-se de que <strong> Saída digital </strong> (HDMI) é o <strong> Padrão </strong> dispositivo de reprodução, caso contrário, selecione o <strong> Saída digital </strong> dispositivo e clique no <strong> Conjunto padrão </strong> botão. Quando terminar, reproduza um vídeo para testar o som HDMI e, se o problema persistir, passe para a próxima etapa. * </p> <p><img src=\"images/image_thumb-43-106.png\" alt=\"FIX: HDMI No Sound Output \" loading=\"lazy\"></p> <p> </p> <p> * Notas: Experimente o seguinte, de acordo com o seu caso: </p> <p> 1. Se o <strong> Saída digital </strong> dispositivo é <strong> Desativado </strong> , clique com o botão direito e clique <strong> Habilitar </strong> . Em seguida, realce-o e pressione <strong> Conjunto padrão </strong> . </p> <p><img src=\"images/image_thumb-44-233.png\" alt=\"FIX: HDMI Not Listed in Playback devices \" loading=\"lazy\"></p> <p> 2. Se o dispositivo de saída digital não estiver sendo exibido como um dispositivo de reprodução: </p> <blockquote><p> uma. Clique com o botão direito em um espaço em branco e certifique-se de que ambos <strong> Mostrar dispositivos desativados </strong> e a <strong> Mostrar dispositivos desconectados </strong> opções são selecionadas (marcadas). Se alguma das opções acima não estiver selecionada, clique nela para selecioná-la. </p></blockquote> <p><img src=\"images/image_thumb-45-410.png\" alt=\"Enable HDMI DIgital Output\" loading=\"lazy\"></p> <blockquote><p> b. Em seguida, clique com o botão direito no dispositivo de saída digital e escolha <strong> Habilitar. <br> c. </strong> Quando terminar, defina como <strong> padrão </strong> a <strong> Saída digital </strong> dispositivo. </p> </blockquote> <h3><br clear=\"all\"> Etapa 2. Reverter o driver da placa de som. </h3> <p> Em alguns casos, o problema &quot;HDMI sem som na TV&quot; pode aparecer após uma atualização automática do driver. Portanto, prossiga e reverta o driver de áudio. </p> <p> 1. Abra <strong> Gerenciador de Dispositivos </strong> . Fazer isso: </p> <blockquote><p> 1. Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-781.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Na caixa &quot;Abrir&quot;, digite: <strong> devmgmt.msc </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-5-389.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2 <strong> Expandir </strong> a <strong> Controladores de som, vídeo e jogos. <br> 3. Clique com o botão direito </strong> no <strong> Dispositivo de áudio de alta definição </strong> e selecione <strong> Propriedades. </strong></p> <p><img src=\"images/image_thumb-17-970.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. Na guia Driver, clique em <strong> Motorista de reversão </strong> botão. <strong> * </strong></p> <p> * Observação: se o botão Reverter driver estiver inativo, continue na próxima etapa. </p> <p><img src=\"images/image_thumb-18-921.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> 5. Selecione um motivo para a reversão do pacote de driver e clique em <strong> sim. </strong></p> <p><img src=\"images/image_thumb-19-748.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Quando a reversão do driver for concluída, <strong> reiniciar </strong> seu computador. <br> 5. Após reiniciar, prossiga e teste o som do HDMI. Se ainda não conseguir ouvir o som da TV, passe para a próxima etapa. </p> <h3> Etapa 3. Alterar o driver da placa de som. </h3> <p> A ausência de som geralmente se deve ao driver incorreto da placa de som. Para resolver este problema: </p> <p> 1. Abra <strong> Gerenciador de Dispositivos. </strong><br> 2 <strong> Expandir </strong> a <strong> Controladores de som, vídeo e jogos. <br> </strong> 3 <strong> Clique com o botão direito </strong> no <strong> Áudio de alta definição Realtek </strong> dispositivo e selecione <strong> Atualizar driver. <br> </strong></p> <p><img src=\"images/image_thumb-6-937.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Selecione <strong> Procure drivers em meu computador. </strong></p> <p><img src=\"images/image_thumb-7-874.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Selecione <strong> Deixe-me escolher em uma lista de drivers disponíveis no meu computador </strong> . </p> <p><img src=\"images/image_thumb-8-498.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. Na próxima tela, selecione o <strong> Dispositivo de áudio de alta definição </strong> e clique <strong> Próximo. </strong></p> <p><img src=\"images/image_thumb-20-756.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/07/image-10.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 8. Quando a instalação do driver for concluída, <strong> reiniciar </strong> seu computador. <br> 9. Após reiniciar, prossiga e teste o som dos alto-falantes do laptop. </p> <h3> Etapa 4. Desinstale e reinstale o driver da placa de som. </h3> <p> 1. Abra <strong> Gerenciador de Dispositivos. </strong><br> 2 <strong> Expandir </strong> a <strong> Controladores de som, vídeo e jogos. <br> </strong> 3 <strong> Clique com o botão direito </strong> no <strong> Áudio de alta definição </strong> dispositivo e selecione <strong> Desinstale o dispositivo. </strong></p> <p><img src=\"images/image_thumb-21-678.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. Após a desinstalação, <strong> reiniciar </strong> seu computador e deixe o Windows instalar os drivers de som automaticamente. Se isso não acontecer, navegue até <strong> Definições </strong> &gt; <strong> Atualização e segurança </strong> e forçar o Windows a <strong> Verifique se há atualizações. </strong></p> <p> </p> <h3> Etapa 5. Desinstalar e reinstalar o adaptador de vídeo. </h3> <p> 1. Abra <strong> Gerenciador de Dispositivos. <br> </strong> 2 <strong> Expandir </strong> a <strong> Adaptadores de vídeo. <br> </strong> 3 <strong> Clique com o botão direito </strong> no adaptador de vídeo instalado e selecione <strong> Desinstale o dispositivo. </strong></p> <p><img src=\"images/image_thumb-46-871.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. Após a desinstalação, <strong> reiniciar </strong> seu computador e deixe o Windows instalar os drivers de vídeo automaticamente. Se isso não acontecer, ou se você ainda enfrentar o problema, navegue até o site de suporte do fabricante do laptop e baixe os drivers de vídeo mais recentes de acordo com o modelo do laptop. </p> <p> Isso é tudo, pessoal! Qual método funcionou para você? Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}