{"title":"CORREÇÃO: Falha na operação do Outlook. As interfaces de mensagens retornaram um erro desconhecido no Outlook 2016, 2013, 2010 ou 2007 (resolvido)","content":"<p> O erro do Outlook &quot;A operação falhou. As interfaces de mensagens retornaram um erro desconhecido. Se o erro persistir, reinicie o Outlook. Não é possível resolver o destinatário&quot;, pode aparecer na versão do Outlook 2003, 2007, 2010 ou 2013 e pode ser causado por vários motivos. Portanto, neste tutorial, você encontrará vários métodos para resolvê-lo. </p> <p><img src=\"images/image_thumb-59-377.png\" alt=\"The Operation failed. The messaging interfaces has returned an unknown error. If the error persists, restart Outlook\" loading=\"lazy\"></p> <p> O erro &quot;Falha na operação. A interface de mensagens retornou um erro desconhecido&quot; no Outlook, pode aparecer nos seguintes casos: </p> <blockquote><p> 1. Quando você tenta visualizar ou excluir e-mails em uma pasta do Outlook. </p> <p> 2. Ao imprimir um e-mail ou uma tarefa de calendário. </p> <p> 3. Quando você tenta criar um novo Perfil do Outlook. </p></blockquote> <p> </p> <h4> Como corrigir: A interface do Outlook Messaging retornou um erro desconhecido. Não é possível resolver o destinatário. </h4> <h6> Método 1. Restaure a exibição de pastas do Outlook. </h6> <p> Se uma ou mais exibições personalizadas forem interrompidas, isso impede que o Outlook exiba alguns itens / pastas. Portanto, o próximo método para resolver &quot;as interfaces de mensagens retornaram um erro desconhecido&quot; no Outlook é restaurar todas as exibições de pasta do Outlook para suas configurações padrão. Fazer isso: </p> <p> 1. Feche o Outlook. <br> 2. Pressione o <strong> janelas </strong> <img src=\"images/image_thumb8_thumb_thumb-501.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 3. Na caixa &quot;Abrir&quot; digite o seguinte comando e pressione <strong> Entrar </strong> . </p> <ul> <li><strong> outlook / cleanviews </strong></li> </ul> <p><img src=\"images/image_thumb-57-310.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. O Outlook deve iniciar normalmente. Verifique-o e, se o erro persistir, passe para a próxima etapa. </p> <p> </p> <h6> Método 2. Exclua as configurações de estilo de impressão do Outlook. </h6> <p> O Outlook armazena as configurações de estilo de impressão no arquivo &quot;OutlPrnt&quot;. Se este arquivo estiver corrompido, isso pode causar o problema &quot;interfaces de mensagens retornaram um desconhecido&quot; ao imprimir no Outlook. Neste caso: </p> <p> 1. Feche o Outlook. <br> 2. Pressione o <strong> janelas </strong> <img src=\"images/image_thumb8_thumb_thumb-409.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 3. Na caixa &quot;Abrir&quot; digite o seguinte comando e pressione <strong> Entrar </strong> . </p> <ul> <li> C: \\ Usuários \\% nome de usuário% \\ AppData \\ Roaming \\ Microsoft \\ Outlook \\ </li> </ul> <p> 4 <strong> Renomear </strong> a &quot; <strong> OutlPrnt </strong> &quot;arquivo para&quot; <strong> OutlPrnt.old </strong> &quot; </p> <p><img src=\"images/image_thumb-58-286.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Inicie o Outlook e verifique se o erro foi resolvido. (Quando o Outlook for iniciado, ele irá reconstruir o arquivo &quot;Outlprnt&quot;). </p> <h6></h6> <h6> Método 3. Repare o arquivo de dados do Outlook. </h6> <p> De acordo com o seu caso, siga as instruções abaixo, para reparar as corrupções no arquivo de dados do Outlook. </p> <p><strong> Caso 1: para contas Exchange (IMAP) (.OST) <br> </strong> Se você estiver usando uma conta do Exchange (IMAP), force o Outlook a recriar o arquivo .OST do Outlook corrompido, fazendo o seguinte: </p> <p> 1 <strong> Perto </strong> panorama. <br> 2 <strong> Renomear </strong> o OST da conta que está causando o problema. <br> 3. Abra o Outlook. (O Outlook irá recriar o arquivo OST). <br> 4. Se o erro persistir, vá para a etapa 2 abaixo. </p> <p> </p> <p><strong> Caso 2: para contas POP3 (PST) <br> </strong> Se você estiver usando uma conta POP3, repare o arquivo corrompido .PST do Outlook, fazendo o seguinte: </p> <p><strong> 1 </strong> <strong> Perto </strong> Panorama. <br> <strong> 2 </strong> Abra o Windows Explorer e localize o <strong> scanpst.exe </strong> ferramenta de reparo neste local: * </p> <ul> <li> C: \\ Arquivos de programas \\ Microsoft Office \\% OfficeVersion% \\ SCANPST.EXE </li> </ul> <p> * Localização do arquivo &quot;SCANPST.EXE&quot; de acordo com sua versão do Office: * </p> <blockquote><p><strong> Outlook 2013 e Outlook 2016 </strong><br> Windows de 32 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office15 <br> Windows de 64 bits&gt; C: \\ Arquivos de programas (x86) \\ Microsoft Office \\ Office15 <br> Outlook de 64 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office15 <br> Clique para executar&gt; C: \\ Arquivos de programas \\ Microsoft Office 15 \\ root \\ office15 <br> <strong><br> Outlook 2010 </strong><br> Windows de 32 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office14 <br> Windows de 64 bits&gt; C: \\ Arquivos de programas (x86) \\ Microsoft Office \\ Office14 <br> Outlook de 64 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office14 <br> <strong><br> Outlook 2007 </strong><br> Windows de 32 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office12 <br> Windows de 64 bits&gt; C: \\ Arquivos de programas (x86) \\ Microsoft Office \\ Office12 </p></blockquote> <p> </p> <p> * Observação: se você não conseguir encontrar &quot;scanpst.exe&quot; nos locais acima, verifique: </p> <ul> <li> C: \\ Arquivos de programas (x86) \\ Microsoft Office \\ root \\ Office16. </li> </ul> <p><strong> 3 </strong> Clique duas vezes para <strong> abrir </strong> o SCANPST.EXE <br> <strong> 4 </strong> Clique <strong> Navegar </strong> . </p> <p><img src=\"images/image_thumb-55-702.png\" alt=\"scanpst.exe\" loading=\"lazy\"></p> <p> </p> <p><strong> 5 </strong> Localize o arquivo de dados do Outlook corrompido (por exemplo, Outlook.pst) neste local: </p> <p> </p> <p><strong> Windows XP </strong></p> <ul> <li><strong> C: \\ Documents and Settings \\% Nome de usuário% \\ Local Settings \\ Application Data \\ Microsoft \\ Outlook \\ Outlook.pst </strong></li> </ul> <p><strong> Windows 7 ou Vista </strong></p> <ul> <li><strong> C: \\ Usuários \\% Nome de usuário% \\ AppData \\ Local \\ Microsoft \\ Outlook \\ Outlook.pst </strong></li> </ul> <p> * Observação: No Outlook 2016, 2013 e 2010, o arquivo de dados do Outlook é armazenado por padrão em: </p> <ul> <li><strong> C: \\ Usuários \\% Nome de usuário% \\ Documentos \\ Arquivos do Outlook \\ Outlook.pst </strong></li> </ul> <p><strong> 6 </strong> aperte o <strong> Varredura </strong> e seja paciente até que a ferramenta de reparo da caixa de entrada repare o arquivo corrompido. * </p> <p> * Nota: Na fase final de reparo, você será perguntado se deseja criar um backup. Responder &quot; <strong> sim </strong> &quot;para continuar a operação de reparo. </p> <p><img src=\"images/image_thumb-56-936.png\" alt=\"Outlook Inbox Repair Tool\" loading=\"lazy\"></p> <p> </p> <p> 7. Quando o processo de reparo for concluído, abra o Outlook e verifique se o problema &quot;interface de mensagens retornou um erro desconhecido&quot; foi resolvido. </p> <p> </p> <h6> Método 4. Excluir e recriar o perfil do Outlook. </h6> <p> O método final para resolver o problema &quot;A interface de mensagens retornou um erro desconhecido&quot; é excluir e recriar o Perfil do Outlook. </p> <p> 1. Navegue até o Painel de Controle do Windows. Fazer isso: </p> <blockquote><p> uma. Digite &quot;painel de controle&quot; na caixa de pesquisa do Windows <br> b. Clique <strong> Painel de controle </strong> a partir dos resultados. </p></blockquote> <p><img src=\"images/image_thumb-53-981.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Defina o <strong> Visto por </strong> para <strong> Ícones pequenos </strong> para visualizar todos os itens do painel de controle e clique em <strong> Correspondência </strong> . </p> <p><img src=\"images/image_thumb-54-839.png\" alt=\"control panel mail options\" loading=\"lazy\"></p> <p> </p> <p> 3. Clique <strong> Mostrar perfis. * </strong></p> <p><strong> * Nota importante: </strong> Se você usar mais de uma conta de e-mail, verifique se o erro aparece em todas as contas de e-mail. Se o erro aparecer apenas em uma conta, tente excluir e adicionar novamente apenas a conta com o problema, usando o seguinte procedimento: </p> <blockquote><p> uma. Clique no <strong> Contas de e-mail </strong> botão e remova a conta de e-mail com o problema. <br> b. Então clique <strong> Arquivos de dados </strong> e remova o arquivo de dados do Outlook, associado à conta removida. <br> c. Finalmente clique <strong> Contas de e-mail </strong> novamente e adicione novamente a conta de e-mail removida. </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-2-573.png\" alt=\"Create Secondary Outlook Profile\" loading=\"lazy\"></p> <p> </p> <p> 4. Selecione o perfil atual e clique em <strong> Remover </strong> . Então clique <strong> sim </strong> para confirmar sua decisão. </p> <p><img src=\"images/image_thumb-53-706.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Em seguida, clique no botão <strong> Adicionar </strong> e dê um nome para o perfil: (por exemplo, &quot;Outlook&quot;). </p> <p><img src=\"images/image_thumb-54-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Siga as etapas do assistente &quot;Adicionar conta&quot; para reconfigurar sua conta de e-mail. </p> <p> </p> <p><img src=\"images/image_thumb-9-658.png\" alt=\"outlook account setup\" loading=\"lazy\"></p> <p> </p> <p> 7. Depois de adicionar sua conta, abra o Outlook e verifique se &quot;As interfaces de mensagens retornaram um erro desconhecido&quot; foi resolvido. * </p> <p> * Observação: se o Outlook funcionar bem e sem erros e você quiser restaurar os e-mails do arquivo de dados .PST antigo do Outlook, siga as instruções abaixo: </p> <ol> <li> <ol> <li> A partir de <strong> Panorama </strong> de <strong> Arquivo </strong> menu, selecione <strong> Abrir e exportar </strong> &gt; <strong> Importar / Exportar </strong> . </li> <li> Em &quot;Escolha uma ação para executar as opções, selecione <strong> Importar de outro programa ou arquivo </strong> e clique <strong> Próximo. </strong></li> <li> Nas opções &#39;Selecionar tipo de arquivo para importar &quot;, selecione <strong> Arquivo de dados do Outlook (.pst) </strong> e clique <strong> Próximo </strong> . </li> <li> Em &#39;Arquivo para tela de importação&#39;, clique em <strong> Navegar. </strong></li> <li> Selecione o arquivo PST antigo do Outlook do qual deseja importar seus e-mails e clique <strong> Abrir. </strong></li> <li> Clique <strong> Próximo </strong> E <strong> Terminar. </strong></li> </ol> </li> </ol> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}