{"title":"Como verificar se há atualizações no Office 2019, 2016 ou 2013 no Windows 10.","content":"<p> Neste tutorial, você aprenderá como verificar manualmente se há atualizações no Office 2019, 2016 e no Office 2013. Em todas as versões do Office, existem duas maneiras de instalar as atualizações do Office disponíveis: Automaticamente e Manualmente. </p> <h4> Como atualizar o Office 209/2016/2013/2010 manualmente. </h4> <h6> Método 1. Como verificar manualmente se há atualizações do Office no Office 2019, 2016 e no Office 2013. </h6> <p> Para verificar e instalar manualmente as atualizações do Office disponíveis, em todas as versões do Office: </p> <p> 1. Abra qualquer programa do Office (por exemplo, Word). <br> 2. De <strong> Arquivo </strong> menu, escolha <strong> Conta </strong> . * </p> <p> * Nota: No Office 2010, escolha <strong> Ajuda. </strong></p> <p> 3. Expanda o <strong> Opções de atualização </strong> e clique <strong> Atualize agora </strong> . * </p> <p> * Observação: se as &#39;Opções de atualização &quot;não estiverem disponíveis, siga as instruções do Método 2 abaixo. </p> <p><img src=\"images/image_thumb-19-478.png\" alt=\"How to Check for Updates in Office 2019, 2016 or 2013 in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Método 2. Como instalar automaticamente as atualizações do Office para Office 2019, 2016 e Office 2013. </h6> <p> Se você deseja que o Windows baixe e instale as atualizações do Office disponíveis automaticamente, navegue até as configurações de atualização do Windows e verifique a seguinte configuração: </p> <ul> <li> Receba atualizações para outros produtos da Microsoft ao atualizar o Windows (Windows 10) </li> <li> Forneça atualizações para outros produtos da Microsoft quando eu atualizar o Windows (Windows 7) </li> </ul> <h5> Para instalar atualizações do Office automaticamente no Windows 10. </h5> <p><strong> 1 </strong> Vamos para <strong> Definições </strong> -&gt; <strong> Atualização e segurança -&gt; opções avançadas. </strong></p> <p><img src=\"images/image_thumb-20-149.png\" alt=\"Change Update Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 2 </strong> Em Opções de atualização, arraste o controle deslizante &#39;Receber atualizações para outros produtos Microsoft ao atualizar o Windows&#39; para <strong> SOBRE. </strong></p> <p><img src=\"images/image_thumb-21-717.png\" alt=\"automatically install office updates windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 3 </strong> Navegue para a tela anterior e clique no botão <strong> Verifique se há atualizações </strong> botão em que você deseja instalar as atualizações do Office disponíveis imediatamente. </p> <p> </p> <h5> Para instalar atualizações do Office automaticamente no Windows 7. </h5> <p> 1. Navegue para <strong> Painel de controle </strong> -&gt; <strong> atualização do Windows </strong> e clique <strong> Mudar configurações </strong> . </p> <p><img src=\"images/image_thumb-22-108.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Selecione o <strong> Dê-me atualizações para outros produtos da Microsoft quando eu atualizar o Windows </strong> caixa de seleção e clique <strong> Aplicar </strong> . </p> <p> 3. Clique <strong> Verifique se há atualizações </strong> para instalar todas as atualizações disponíveis. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar este guia. </p> <p> </p>"}