{"title":"CORREÇÃO: este dispositivo não pode usar um Módulo de plataforma confiável no BitLocker. (Resolvido)","content":"<p> Em um computador Windows 10 Pro ou Enterprise, o seguinte erro pode aparecer ao tentar <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> ativar a criptografia da unidade BitLocker na unidade do sistema operacional </a> : &quot;Este dispositivo não pode usar um Módulo de plataforma confiável. Seu administrador deve definir a opção&quot; Permitir BitLocker sem um TPM compatível &quot;na política&quot; Exigir autenticação adicional na inicialização &quot;para volumes de SO&quot;. </p> <p><img src=\"images/image_thumb-30-150.png\" alt=\"This device can't use a Trusted Platform Module in BitLocker\" loading=\"lazy\"></p> <p> Este tutorial contém instruções para resolver o seguinte erro do BitLocker: &quot;Este dispositivo não pode usar um Módulo de plataforma confiável ...&quot; no Windows 10 Pro e Enterprise Editions. </p> <h4> Como corrigir: Erro &quot;Este dispositivo não pode usar um Módulo de plataforma confiável&quot; no Bit Locker. </h4> <p> O BitLocker oferece mais proteção quando usado com um Trusted Platform Module (TPM) versão 1.2 ou posterior. Se você possui um computador que não possui um módulo TPM, você deve desabilitar o requisito de TPM para BitLocker na política de grupo. Fazer isso: </p> <p> 1. Pressione simultaneamente o Windows <img src=\"images/image_thumb36-579.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite <strong> gpedit.msc </strong> &amp; Aperte <strong> Entrar. </strong></p> <p><img src=\"images/image_thumb-78-692.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. No painel esquerdo, navegue até: </p> <ul> <li><strong> Configuração do computador \\ Modelos administrativos \\ Componentes do Windows \\ Criptografia de unidade de disco BitLocker \\ Unidades do sistema operacional </strong></li> </ul> <p> 4. Em seguida, clique em <strong> Requer autenticação adicional na inicialização </strong> no painel direito. </p> <p><img src=\"images/image_thumb-31-186.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Clique <strong> Habilitado </strong> e então verifique o <strong> Permitir BitLocker sem um TPM compatível </strong> caixa de seleção. <strong><br> </strong> 6. Clique <strong> OK </strong> e <strong> perto </strong> o Editor de Diretiva de Grupo. </p> <p><img src=\"images/image_thumb-32-380.png\" alt=\"Allow BitLocker without compatible Trusted Platform Module\" loading=\"lazy\"></p> <p> </p> <p> 7. Está feito! Prossiga para habilitar a proteção do BitLocker na unidade do sistema operacional, sem nenhum problema. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}