{"title":"CORREÇÃO: Duplicar nomes de usuário na tela de login após a atualização do Windows 10.","content":"<p> Este tutorial contém vários métodos para corrigir o problema de nomes de usuário duplicados na tela de login após a atualização do Windows 10. O problema de &quot;nomes de usuário duplicados na tela de login&quot; é relatado por muitos usuários e causado após a instalação de atualizações no Windows 10. </p> <p><img src=\"images/image_thumb-44-494.png\" alt=\"FIX: Duplicate User Names in Sign-in Screen Windows 10\" loading=\"lazy\"></p> <p> Problema nos detalhes: depois de renomear seu computador ou após instalar atualizações no Windows 10, o sistema não faz login automaticamente em sua conta de usuário com o erro &quot;o nome de usuário ou senha está incorreto. Tente novamente&quot; e ao mesmo tempo seu nome de usuário aparece duas vezes na tela de login. </p> <h4> Como corrigir: a tela de login do Windows 10 mostra o mesmo usuário duas vezes. </h4> <h6> Método 1. Remova a conta duplicada das opções de conta de usuário. </h6> <p> O primeiro método para remover os nomes de usuário duplicados da tela de login é excluir a conta duplicada do seu PC. </p> <p> 1. Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-923.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Na caixa &quot;Abrir&quot;, digite: <strong> control userpasswords2 </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-29-663.png\" alt=\"control userpasswords2 \" loading=\"lazy\"></p> <p> 3. Nas opções de contas de usuário, execute as seguintes ações de acordo com o seu caso: </p> <ul> <li><strong> Caso A. </strong> Se você vir duas contas com o mesmo nome de usuário: </li> </ul> <blockquote><p> uma. Selecione a conta secundária e clique em <strong> Remover </strong> . <br> b. Clique <strong> OK </strong> e <strong> reiniciar </strong> seu PC. <br> c. Se depois de reiniciar, você ainda vir seu nome de usuário duas vezes na tela de logon, prossiga para o Método 2. </p></blockquote> <p><img src=\"images/image_thumb-37-605.png\" alt=\"User Accounts Options\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Caso B. </strong> Se você vir apenas uma conta: </li> </ul> <blockquote><p> uma. Selecione a conta e clique em <strong> Propriedades </strong> . <br> b. Copie o nome completo e cole-o no campo Nome do usuário, para fazer a correspondência. * <br> c. Clique <strong> OK </strong> e <strong> reiniciar </strong> seu PC. </p></blockquote> <p> * Observação: se o nome de usuário e o nome completo já corresponderem, vá para o método 2. </p> <p><img src=\"images/image_thumb-38-262.png\" alt=\"Remove Duplicate User Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Método 2. Desative o requisito de senha ao entrar. </h6> <p> 1. Siga as etapas 1 e 2 do método anterior para abrir as opções de &#39;Contas de usuário&#39;. <br> 2 <strong> Desmarque </strong> a <strong> O usuário deve inserir um nome de usuário e senha para usar este computador </strong> e clique <strong> Aplicar </strong></p> <p><img src=\"images/image_thumb-42-373.png\" alt=\"User must enter a user name and password to use this computer \" loading=\"lazy\"></p> <p> </p> <p> 3. Digite sua senha (duas vezes) e clique em <strong> OK </strong> duas vezes para fechar todas as janelas. </p> <p><img src=\"images/image_thumb-43-970.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4 <strong> Reinício </strong> seu computador. Se o seu nome de usuário aparecer duas vezes novamente, vá para o próximo método. </p> <h6></h6> <h6> Método 3. Modifique as opções de login. </h6> <p> </p> <p> 1. Desde o início <img src=\"images/image_thumb-39-183.png\" alt=\"image\" loading=\"lazy\"> menu, aberto <strong> Definições </strong> <img src=\"images/image_thumb-50-520.png\" alt=\"image\" loading=\"lazy\"> e então clique <strong> Contas </strong> . </p> <p><img src=\"images/image_thumb-43-892.png\" alt=\"How to Add a New User in Windows 10, 8.1.\" loading=\"lazy\"></p> <p> </p> <p> 2. Selecione <strong> Opções de login </strong> no painel esquerdo, e <strong> desligar </strong> a <strong> Use minhas informações de login para concluir automaticamente a configuração do meu dispositivo e reabrir meus aplicativos após atualizar ou reiniciar </strong> . </p> <p><img src=\"images/image_thumb-40-207.png\" alt=\"Modify Sign in Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3 <strong> Reiniciar </strong> seu PC. </p> <p> </p> <h6> Método 4. Mude para conta local. </h6> <p> O método final para resolver o problema de &quot;nomes de usuário duplicados&quot; é usar uma conta local para fazer login no Windows 10. Para fazer isso: </p> <p> 1. Desde o início <img src=\"images/image_thumb-41-454.png\" alt=\"image\" loading=\"lazy\"> menu, aberto <strong> Definições </strong> <img src=\"images/image_thumb-50-790.png\" alt=\"image\" loading=\"lazy\"> e então clique <strong> Contas </strong> . <br> 2. Clique <strong> Email e contas </strong> no painel esquerdo. <br> 3. Próximo clique <strong> Em vez disso, faça login com uma conta local. </strong></p> <p> </p> <p><img src=\"images/image_thumb-37-653.png\" alt=\"sign-in with a local account instead windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Digite a senha da sua conta da Microsoft e clique em <strong> Próximo </strong> . <br> 5. Em seguida, digite o nome de usuário, a senha (opcional) para a nova conta local e clique <strong> Próximo </strong> . <br> 6. Após reiniciar, digite sua senha para fazer o login com a nova conta local. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}