{"title":"CORREÇÃO: o acesso rápido não funciona e não é possível digitar na caixa de pesquisa do Windows 10 (resolvido)","content":"<p> Se <strong> Acesso rápido </strong> s menu não funciona no Windows 10, então leia este tutorial para corrigir o problema. A opção Acesso rápido no File Explorer permite que o usuário navegue facilmente até os arquivos e pastas abertos recentemente. Mas às vezes, especialmente quando você já abriu um arquivo / pasta de uma unidade externa (por exemplo, seu disco USB), que agora está offline, o Acesso rápido não está mostrando os arquivos recentes ou você não pode digitar na barra &#39;Pesquisar&#39;. </p> <p><img src=\"images/image_thumb-2-490.png\" alt=\"FIX: Quick Access Not Working in Windows 10 (Solved)\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Como corrigir: o recurso de acesso rápido e a função de pesquisa não funcionam no Windows 10. </h4> <p> </p> <h6> Método 1. Reinicie o Windows Explorer. </h6> <p> O primeiro método para corrigir o problema de acesso rápido é reiniciar o processo do Windows Explorer no Gerenciador de tarefas. Fazer isso: </p> <p> 1. Pressione <strong> Ctrl </strong> + <strong> Alt </strong> + <strong> Del </strong> abrir <strong> Gerenciador de tarefas </strong> . <br> 2. Em <strong> Processos </strong> * guia, destaque o <strong> explorador de janelas </strong> processar e clicar <strong> Reiniciar </strong> . </p> <p> * Observação: se você não vir a guia &#39;Processo&#39;, clique em <strong> Mais detalhes. </strong></p> <p><img src=\"images/image_thumb-951.png\" alt=\"restart windows explorer\" loading=\"lazy\"></p> <p><strong> </strong></p> <h6> Método 2. Habilite o Acesso rápido aos itens recentes e limpe o histórico do File Explorer. </h6> <p> 1. Abra <strong> Opções de Pasta. </strong> Para fazer isso, abra o Windows Explorer e, no menu, vá para <strong> Visualizar </strong> &gt; <strong> Opções </strong> . </p> <p><img src=\"images/image_thumb-3-949.png\" alt=\"enable quick access windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Em <strong> Em geral </strong> guia, certifique-se de que as seguintes caixas de seleção estão selecionadas. </p> <ul> <li><strong> Mostrar arquivos usados ​​recentemente em Acesso rápido </strong></li> <li><strong> Mostra as pastas usadas com frequência em Acesso rápido. </strong></li> </ul> <p> 3. Em seguida, clique no <strong> Claro </strong> botão para limpar o histórico do File Explorer. </p> <p><img src=\"images/image_thumb-4-329.png\" alt=\"clear quick access history\" loading=\"lazy\"></p> <p> </p> <p> 3. Clique <strong> OK </strong> e verifique se o Acesso rápido e a função de pesquisa estão funcionando. Caso contrário, reinicie o &#39;Explorador de Arquivos&#39; usando o Gerenciador de Tarefas (consulte o método 1 acima) e verifique novamente. Se o problema persistir, passe para o próximo método. </p> <h6> Método 3. Limpar o histórico de itens recentes manualmente. </h6> <p> O próximo método para resolver problemas com os itens recentes de acesso rápido ou com a função &#39;Pesquisar&#39; no Windows 10 é excluir o histórico de itens recentes manualmente. Fazer isso: </p> <p> 1. Abra o Windows Explorer. <br> 2. Copie e cole o seguinte endereço na barra de endereço e pressione <strong> Entrar </strong> : </p> <p> % AppData% \\ Microsoft \\ Windows \\ Recent \\ AutomaticDestinations </p> <p><img src=\"images/image_thumb-1-410.png\" alt=\"clear recent items windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Pressione <strong> Ctrl </strong> + <strong> UMA </strong> (para selecionar todos os itens) e aperte <strong> Excluir </strong> (ou clique com o botão direito&gt; <strong> Excluir </strong> ) </p> <p><img src=\"images/image_thumb-5-834.png\" alt=\"Delete Quick Access History\" loading=\"lazy\"></p> <p> </p> <p> 4. Em seguida, copie / cole o seguinte endereço na barra de endereço e pressione <strong> Entrar </strong> . </p> <p> % AppData% \\ Microsoft \\ Windows \\ Recent \\ CustomDestinations </p> <p><img src=\"images/image_thumb-6-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Pressione <strong> Ctrl </strong> + <strong> UMA </strong> novamente (para selecionar todos os itens) e aperte <strong> Excluir. <br> </strong> 6. Agora pressione <strong> Ctrl + Alt + Del </strong> abrir <strong> Gerenciador de tarefas </strong> . <br> 7. Em <strong> Processos </strong> guia, destaque o <strong> explorador de janelas </strong> processar e clicar <strong> Reiniciar </strong> . <br> 8. Normalmente, os problemas com o recurso &#39;Acesso rápido&#39; ou com a função &#39;Pesquisar&#39; &quot;devem ter sido resolvidos. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}