{"title":"Como remover a opção CLIQUE AQUI PARA VER MAIS SOBRE O MICROSOFT EXCHANGE no Outlook.","content":"<p> Se você não quiser clicar sempre no hiperlink &quot;Clique aqui para ver mais sobre o Exchange&quot; no Outlook, para ver todos os e-mails armazenados no Exchange, continue lendo abaixo. O hiperlink &quot;Clique aqui para ver mais no Exchange&quot; no Outlook aparece porque as pastas de correio exibem apenas os itens mais recentes (e-mails). Este é um comportamento padrão, porque quando você usa o Microsoft Outlook 2019, Outlook 2016, Outlook 2013 ou Outlook para Office 365 para se conectar à sua caixa de correio do Exchange Server, o Outlook exibe um dos e-mails do ano anterior. </p> <p><img src=\"images/image_thumb-19-421.png\" alt=\"How to Remove the \" click here to view more on exchange option in outlook. loading=\"lazy\"></p> <p> </p> <p> Para remover o hiperlink &quot;Clique aqui para ver mais sobre o Exchange&quot; que apareça, para ver todos os seus itens de e-mail, quando conectado a uma caixa de correio do Exchange, siga as etapas abaixo. </p> <h4> Como forçar o Outlook a exibir todos os seus e-mails de sua caixa de correio do Exchange. </h4> <p> Para exibir todos os seus emails do Exchange no Outlook: </p> <p> 1. Clique no <strong> Arquivo </strong> menu e vá para <strong> Conta </strong> &gt; <strong> Configurações da conta </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-1-139.png\" alt=\"How to Backup Outlook\" loading=\"lazy\"></p> <p> 2. Destaque a conta Exchange e clique em <strong> Mudar </strong> . </p> <p><img src=\"images/image_thumb-20-777.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Na configuração &#39;Baixar e-mail para o passado&#39;, arraste o controle deslizante até o final. </p> <p><img src=\"images/image_thumb-17-833.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Quando terminar, clique em <strong> Próximo </strong> e <strong> Terminar </strong> e feche as configurações da conta. </p> <p><img src=\"images/image_thumb-18-585.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5 <strong> Reiniciar </strong> Panorama. </p> <p> Isso é tudo, pessoal! Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}