{"title":"Como encontrar o Windows Media Player no Windows 10.","content":"<p> Por muitos anos, o Windows Media Player foi o aplicativo padrão para reproduzir músicas e vídeos. No Windows 10, o Windows Player deixou de ser o reprodutor padrão dos arquivos de mídia e foi substituído pelo app &quot;Filmes e TV&quot;. </p> <p> Este artigo foi escrito para todos os usuários que desejam encontrar e usar o clássico Windows Media Player, como o player padrão para reproduzir suas músicas e vídeos. </p> <h4> Como encontrar o Windows Media Player no Windows 10. </h4> <p> A maneira mais rápida de descobrir se o Windows Media Player está instalado no seu computador é pesquisando-o. Fazer isso: </p> <p> 1. Na caixa de pesquisa da Cortana, digite <strong> Windows Media Player </strong> . <br> 2. Se o Windows Media Player estiver listado nos resultados, clique nele para iniciar o programa. (Se não estiver listado, continue abaixo ...) </p> <p><img src=\"images/image_thumb-66-377.png\" alt=\"How to Find Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> GORJETA: </strong> Para definir o Windows Media Player como o player padrão para seus vídeos e músicas: </p> <blockquote><p> 1. Navegue para <strong> Começar </strong> -&gt; <strong> Definições </strong> -&gt; <strong> Apps </strong> e selecione <strong> Aplicativos padrão </strong> à esquerda. <br> 2. Em <strong> Reprodutor de música </strong> opções, clique no <strong> Groove Music </strong> e então selecione o <strong> Windows Media player </strong> . <br> 3 <strong> Nas opções do Video Player </strong> , clique <strong> Filmes e TV </strong> e então selecione o <strong> Windows Media player </strong> . </p> <p><img src=\"images/image_thumb-72-358.png\" alt=\"set windows media player default widnows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h4> Como instalar o Windows Media Player no Windows 10 Home, Pro. </h4> <p> Se o Windows Media Player não estiver listado, você pode instalá-lo acessando: </p> <p> 1 <strong> Painel de controle </strong> -&gt; <strong> Programas e características </strong> . <br> 2. Clique <strong> Liga ou desliga características das janelas </strong> da esquerda. </p> <p><img src=\"images/image_thumb-68-342.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Em <strong> Recursos de mídia </strong> , selecione os <strong> Windows Media Player </strong> e pressione <strong> OK </strong> . * </p> <p> * Nota: Se você possui a versão do Windows 10 N ou KN, ou não pode instalar o Windows Media Player a partir dos &#39;recursos do Windows&#39;, continue lendo abaixo ... </p> <p><img src=\"images/image_thumb-69-565.png\" alt=\"How to Install Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Como baixar e instalar o Windows Media Player nas versões do Windows 10 Home, Pro, N e KN. </h4> <p> Se você não pode instalar o Windows Player usando as instruções acima, ou se você possui o Windows 10 N ou KN, então você pode baixar o Windows Media Player para Windows 10, seguindo as instruções abaixo: </p> <p> 1. Baixe o <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48231\" target=\"_blank\" rel=\"nofollow noopener\"> Pacote de recursos de mídia para versões N e KN do Windows 10 </a> . </p> <p> * Nota: Baixe o <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package.msu </strong> para <strong> SO de 32 bits, </strong> e a <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package_x64.msu </strong> para <strong> SO de 64 bits. </strong></p> <p> 2. Execute o arquivo baixado e clique em <strong> sim </strong> na primeira tela. </p> <p><img src=\"images/image_thumb-70-480.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3 <strong> Aceitar </strong> o Contrato de Licença e aguarde até que a instalação seja concluída. </p> <p><img src=\"images/image_thumb-71-400.png\" alt=\"download windows media player windows 10\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}