{"title":"CORREÇÃO: parece que você iniciou uma atualização e inicializou a partir da mídia de instalação (resolvido)","content":"<p> O seguinte problema pode aparecer se você tentar executar uma instalação limpa ou uma atualização de reparo do Windows 10 a partir de uma mídia de instalação: &quot;Parece que você iniciou uma atualização e inicializou a partir da mídia de instalação. Se quiser continuar com a atualização, remova o mídia do seu PC e clique em Sim. Se você deseja executar uma instalação limpa, clique em Não &quot;. </p> <p><img src=\"images/image_thumb-36-818.png\" alt=\"FIX: It looks like you started an upgrade and booted from installation media \" loading=\"lazy\"></p> <p> </p> <p> A mensagem de erro acima significa que você interrompeu a atualização do Windows 10 assim que ela foi iniciada. Como a mensagem indica, se você deseja realizar uma instalação limpa do Windows 10, você deve selecionar &quot;Não&quot; para continuar, caso contrário, remova a mídia de instalação e clique em &quot;Sim&quot; para continuar a atualização do Windows 10. </p> <p> Em geral, a mensagem acima não é um problema, mas se torna um grande problema se a atualização do Windows falhar ao instalar ou se o Windows 10 travar após tentar instalar as atualizações e você quiser reparar o Windows 10 inicializando a partir de uma instalação meios de comunicação. </p> <p> Neste tutorial, você encontrará instruções detalhadas sobre como ignorar a mensagem &quot;Parece que você iniciou uma atualização e inicializou a partir da mídia de instalação&quot;, cancelando o processo de atualização do Windows 10 atualmente em execução, a fim de executar um reparo do Windows 10 atualizar a partir da mídia de instalação. </p> <h4> Como cancelar a atualização do Windows 10 em andamento se o Windows não puder inicializar * </h4> <p><strong> * Importante: </strong> Se você pode inicializar no Windows 10, mas não pode instalar a atualização do ambiente do Windows, aplique as seguintes ações primeiro: </p> <blockquote><p> 1. Navegue para <strong> Começar </strong> &gt; <strong> Definições </strong> &gt; <strong> Atualização e segurança </strong> e clique em &quot;Reiniciar agora&quot; para iniciar o processo de atualização. <br> 2. Após a primeira reinicialização, deixe o progresso &quot;Trabalhando nas atualizações&quot; para 1-2%. <br> 3. Quando terminar, pressione o <strong> Poder </strong> por 10-15 segundos, para desligar totalmente o PC. <br> 4. Conecte a mídia de instalação do Windows e ligue o PC. <br> 5. Siga as etapas restantes abaixo para cancelar a atualização em andamento. </p></blockquote> <p> </p> <h6> Etapa 1. Cancele as ações pendentes do Windows Update. </h6> <p> 1. Inicialize seu sistema a partir de uma mídia de instalação do Windows. <br> 2. Quando a mensagem &quot;Parece que você iniciou uma atualização e inicializou a partir da mídia de instalação ...&quot; aparecer, pressione o botão <strong> MUDANÇA </strong> + <strong> F10 </strong> teclas para iniciar o prompt de comando. </p> <p><img src=\"images/image_thumb-37-729.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. No prompt de comando, obtenha uma lista de todas as unidades em seu sistema com este comando: </p> <ul> <li><strong> wmic logicaldisk get name </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-991.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> </p> <p> 4. Em seguida, descubra qual unidade contém a pasta &quot;Windows&quot;, digitando este comando: * </p> <p> </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * por exemplo. Para ver o conteúdo da unidade C :, digite: &quot; <strong> dir C: </strong> &quot;(sem aspas). Se você não conseguir ver a pasta&quot; Windows &quot;na unidade C :, prossiga para a próxima letra da unidade (por exemplo,&quot; dir D: &quot;,&quot; dir E: &quot;, etc.), até ver o Pasta &quot;Windows&quot; em uma das unidades listadas (a partir do comando acima). </p> <p> por exemplo: como você pode ver na captura de tela abaixo, a pasta do Windows (neste exemplo) está localizada no <strong> D </strong> : dirigir.] </p> <p><img src=\"images/image_thumb-69-578.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Depois de encontrar em qual unidade a unidade &quot;Windows&quot; está localizada (por exemplo, na unidade &quot;D:&quot; neste exemplo), navegue até essa unidade digitando DriveLetter <strong> : </strong> + <strong> Entrar </strong> . </p> <p> 6. Em seguida, crie uma pasta de trabalho na unidade do Windows digitando este comando: </p> <p> </p> <ul> <li><strong> mkdir D: \\ Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-229.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Em seguida, dê o comando abaixo para reverter as ações pendentes da atualização em andamento: </p> <ul> <li><strong> DISM / Image: D: \\ / ScratchDir: D: \\ Scratch / Cleanup-Image / RevertPendingActions </strong></li> </ul> <p> * Nota: Altere a letra da unidade <strong> D </strong> de acordo com o seu caso. </p> <p> 8. Assim que o comando DISM acima for executado, você deverá receber a seguinte mensagem na tela: </p> <p> &quot; <em> Revertendo ações pendentes da imagem…. <br> A operação foi concluída. A reversão das ações pendentes será tentada após a reinicialização. <br> A operação foi completa com sucesso.&quot; </em></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"DISM - RevertPendingActions\" loading=\"lazy\"></p> <p> </p> <p> 9. Feche a janela do prompt de comando, remova a mídia de instalação e deixe o Windows inicializar normalmente. </p> <p> 10. Após a reinicialização, você deverá ver a seguinte mensagem em sua tela: &quot;Desfazendo alterações feitas em seu computador.&quot; Quando este processo terminar, o Windows deve iniciar normalmente. </p> <p><img src=\"images/image_thumb-39-836.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Etapa 2. Remova os arquivos de atualização com a limpeza de disco. </h6> <p> Após inicializar no Windows 10, você deve preparar o Windows 10 para o reparo / atualização do USB, excluindo as atualizações já baixadas com a ferramenta Limpeza de disco. Fazer isso: </p> <p> 1. Abra o Explorador de arquivos, clique com o botão direito na unidade C: e selecione <strong> Propriedades </strong> . <br> 2. Clique no <strong> Limpeza de disco </strong> botão. </p> <p><img src=\"images/image_thumb_thumb-190.png\" alt=\"Disk cleanup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Em seguida, clique em <strong> Limpe os arquivos do sistema </strong> . </p> <p><img src=\"images/image_thumb-40-950.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Agora verifique para remover os seguintes arquivos e clique em <strong> OK </strong> : </p> <ul> <li> <ul> <li> <ul> <li> Limpeza do Windows Update. </li> <li> Antivírus do Windows Defender. </li> <li> Arquivos de programa baixados. </li> <li> Arquivos temporários de Internet. </li> <li> Instalações anteriores do Windows. </li> <li> Lixeira de reciclagem. </li> <li> Arquivos temporários. </li> <li> Arquivos temporários de instalação do Windows </li> </ul> </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-41-458.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Quando perguntado, <strong> Deletar arquivos </strong> . </p> <p><img src=\"images/image_thumb-42-931.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Quando a limpeza estiver concluída, feche as propriedades do disco e passe para a próxima etapa. </p> <p> </p> <h6> Etapa 3. Exclua a pasta &#39;SoftwareDistribution&#39;. </h6> <p> O &quot;C: \\ Windows \\ <strong> Distribuição de Software </strong> &quot;, é o local onde o Windows armazena as atualizações do Windows. Muitas vezes, esta pasta fica corrompida e você deve recriá-la para baixar novamente as atualizações do zero. Portanto, proceda da seguinte forma: </p> <p><strong> 1. Pare o serviço Windows Update: </strong> Fazer isso: </p> <blockquote><p> uma. Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> b. Na caixa de pesquisa, digite: <strong><em> services.msc </em></strong> e clique <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-12-264.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> c. No painel de controle de Serviços, localize o &quot; <strong> Atualização do Windows&quot; </strong> serviço. <br> d. Clique com o botão direito em <strong> atualização do Windows </strong> serviço e selecione &quot; <strong> Pare </strong> &quot; </p></blockquote> <p><img src=\"images/image_thumb-9-434.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. Exclua a pasta SoftwareDistribution. </strong></p> <blockquote><p> uma. Abra o Windows Explorer e navegue até: <strong> C: \\ Windows </strong> pasta. <br> b. Encontre e <strong> Excluir </strong> a &quot; <strong><em> Distribuição de Software </em></strong> &quot;pasta (ou renomeie-a, por exemplo,&quot; SoftwareDistributionOLD &quot;). </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-10-140.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p> 3 <strong> Reinicie o seu computador </strong> para aplicar as alterações. </p> <p> </p> <h6> Etapa 4. Atualize o Windows 10 da mídia de instalação. </h6> <p> Agora, você está pronto para reparar-atualizar o Windows 10 a partir de uma mídia de instalação. Fazer isso: </p> <p> 1 <strong> Reinício </strong> seu computador e <strong> Bota </strong> do Windows USB (ou DVD) <strong> mídia de instalação </strong> . <br> 2. No assistente de instalação do Windows, pressione <strong> Próximo </strong> e então clique <strong> instale agora </strong> . <br> 3 <strong> Aceitar </strong> o &#39;Contrato de licença&#39;. <br> 4. Quando solicitado, selecione Atualizar <strong> : Instale o Windows e mantenha arquivos, configurações e aplicativos </strong> . </p> <blockquote><p><img src=\"images/image_thumb8_thumb-241.png\" alt=\"image_thumb8\" loading=\"lazy\"></p></blockquote> <p> 5. Em seguida, siga as instruções na tela para atualizar o Windows 10. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}