{"title":"Como criar cópias de sombra de arquivos com o Agendador de tarefas no Windows 10.","content":"<p> Em um tutorial anterior, mencionei a maneira de fazer backup de seus arquivos pessoais com <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Histórico do arquivo </a> no Windows 10. Neste tutorial, mostrarei como criar cópias de sombra automaticamente de seus arquivos pessoais usando o Agendador de tarefas. As Cópias de Sombra de seus arquivos permitirão que você reverta um arquivo ou pasta específica para uma versão anterior (ponto no tempo). </p> <p> O recurso Shadow Copy introduzido pela primeira vez no Windows Server 2003 e, em seguida, adicionado às versões do Windows Vista e 7, como parte do recurso System Restore. O processo de &#39;cópia de sombra&#39; pode fazer cópias de backup e instantâneos do estado atual do sistema e arquivos pessoais, mesmo se em uso. O processo de recuperação de arquivos das cópias de sombra é mais comumente conhecido como &quot;Restaurar versões anteriores&quot;. </p> <h4> Como criar diariamente uma cópia de sombra de seus arquivos no Windows 10. * </h4> <p><strong> * Notas: </strong><br> 1. Usando as instruções abaixo, você será capaz de criar cópias de sombra diárias (instantâneos) de todo o volume &quot;C: \\&quot;. (Arquivos de sistema do Windows e dados pessoais) <br> 2. As cópias de sombra podem ser usadas para restaurar seus arquivos para um ponto anterior no tempo, usando o recurso &#39;Restaurar versão anterior&#39; ou usando um utilitário de terceiros que pode acessar as cópias de sombra, como o <a href=\"https://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowExplorer </a> ou o <a href=\"https://www.nirsoft.net/utils/shadow_copy_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowCopyView </a> . <br> 3. As cópias de sombra <strong> não pode ser usado para restaurar seu sistema </strong> a um ponto anterior no tempo, usando o <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> Restauração do sistema </a> ferramenta. Se você deseja restaurar seu sistema usando a Restauração do Sistema, prossiga e <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Ative a proteção de restauração do sistema. </a> <br> 4. Finalmente, tenha em mente que as Cópias de Sombra criadas não são um backup confiável, porque as &#39;Cópias de Sombra&#39; são armazenadas em sua unidade principal C: \\, e se a unidade falhar você perderá todos os seus dados. Para criar um backup confiável de seus dados, leia as instruções neste artigo: <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Como fazer backup de arquivos pessoais com histórico de arquivos no Windows 10. </a></p> <p> </p> <p><strong> Para criar versões anteriores de seus arquivos pessoais usando cópias de sombra: </strong></p> <p> 1. Abra <strong> Agendador de tarefas </strong> . Se você não sabe fazer isso, então ... </p> <blockquote><p> 1. Na caixa de pesquisa, digite <strong> Tarefa </strong> ou <strong> Agendador de tarefas </strong> . <br> 2. Abra o &#39;Agendador de tarefas&#39; nos resultados da pesquisa. </p></blockquote> <p><img src=\"images/image_thumb-31-630.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. No Agendador de Tarefas, clique em <strong> Criar Tarefa </strong> . </p> <p><img src=\"images/image_thumb-23-462.png\" alt=\"How to Start ThrottleStop at Windows Startup\" loading=\"lazy\"></p> <p> </p> <p> 3. Em <strong> Em geral </strong> aba: </p> <blockquote><p> 1. Digite &quot;Criar cópia de sombra de meus arquivos&quot; como o nome da tarefa. <br> 2 <strong> Verificar </strong> a <strong> Executar com os maiores privilégios </strong> caixa. </p></blockquote> <p> Nota: Se você deseja iniciar a tarefa em segundo plano, coloque um ponto em <strong> Executar esteja o usuário conectado ou não </strong> opção e digite sua senha de login. </p> <p><img src=\"images/image_thumb-62-499.png\" alt=\"create shadow copies task windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Em seguida, selecione o <strong> Gatilhos </strong> guia e clique <strong> Novo </strong> . <br> 4a. Na janela &#39;New Trigger&#39;, especifique a freqüência de criação de um instantâneo de seus arquivos e clique em <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-63-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Em seguida, selecione o <strong> Ações </strong> guia e clique <strong> Novo </strong> . <br> 5a. Na janela &#39;Nova Ação&#39;: </p> <blockquote><p> 1. Selecione <strong> Comece um programa </strong> . <br> 2. Em &#39;Programa / script&#39;, digite: <strong> wmic </strong><br> 3. Em &#39;Adicionar argumentos (opcional)&#39; digite: </p> <ul> <li><strong> shadowcopy call create Volume = C: \\ </strong></li> </ul> <p> 4. Quando terminar, clique em <strong> OK. </strong></p></blockquote> <p><img src=\"images/image_thumb-66-640.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Clique <strong> OK </strong> novamente para fechar as propriedades da tarefa agendada. </p> <p><img src=\"images/image_thumb-67-138.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Para criar seu primeiro backup, clique com o botão direito na tarefa e selecione <strong> Corre </strong> . </p> <p><img src=\"images/image_thumb-68-388.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Está feito! A partir de agora, sempre que desejar restaurar um arquivo / pasta para sua versão anterior, clique com o botão direito sobre ele e selecione <strong> Restaurar versões anteriores </strong> . </p> <p><img src=\"images/image_thumb-69-568.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Informações úteis: <br> </strong> 1. O espaço máximo alocado que pode ser usado para armazenar as cópias de sombra é a quantidade de espaço que a Restauração do sistema pode usar para armazenar os pontos de restauração. <br> 2. Para descobrir o espaço de armazenamento usado e máximo alocado para as cópias de sombra, dê este comando no Prompt de Comando (Admin): </p> <ul> <li><strong> vssadmin list shadowstorage </strong></li> </ul> <p><img src=\"images/image_thumb-76-672.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Para modificar o espaço máximo alocado para as cópias de sombra e os pontos de restauração do sistema, navegue até o <strong> Proteção do sistema </strong> configurações para o <strong> Disco local (C :) </strong><br> 4. Se você deseja excluir todas as cópias de sombra salvas, você deve excluir também os pontos de restauração salvos. Se você quiser fazer isso, clique no botão <strong> Exclua todos os pontos de restauração </strong> botão nas configurações de proteção do sistema. </p> <p><img src=\"images/image_thumb-77-662.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}