{"title":"CORREÇÃO: o laptop Lenovo está preso na tela do LOGO. (Resolvido)","content":"<p> Se o seu laptop Lenovo ficar preso na tela do logotipo, continue lendo. Este tutorial contém instruções passo a passo para corrigir o seguinte problema em laptops Lenovo: Depois de ligar, o laptop não inicializa e trava na tela inicial do logotipo Lenovo. (O problema persiste mesmo quando você tenta inicializar a partir de um dispositivo USB inicializável). </p> <p><img src=\"images/image_thumb-17-276.png\" alt=\"FIX: Lenovo laptop is stuck at LOGO screen.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Como consertar: laptop preso na tela do LENOVO LOGO. * </h4> <p> * Importante: antes de solucionar problemas em um computador, desconecte todos os dispositivos periféricos para se certificar de que o problema não é causado por um dispositivo conectado. </p> <p> </p> <h6> Etapa 1. Redefina o BIOS para as configurações padrão. </h6> <p> O primeiro passo para resolver o congelamento do laptop no logotipo da Lenovo é redefinir o BIOS para as configurações padrão. Fazer isso: </p> <p> 1 <strong> Desligar </strong> o laptop pressionando constantemente o botão liga / desliga por 5 a 7 segundos. <br> 2. Agora siga as instruções abaixo de acordo com o seu modelo, para entrar no BIOS: </p> <ul> <li> Se o seu sistema é <strong> ThinkPad </strong> , pressione o botão Liga / Desliga e imediatamente pressione a tecla (Fn +) F2 ou (Fn +) F1 rápida e repetidamente. </li> <li> Se o seu sistema é <strong> ideapad </strong> laptop, localize e <strong> Aperte </strong> a <a href=\"https://support.lenovo.com/us/en/solutions/HT104038\" target=\"_blank\" rel=\"nofollow noopener\"> NOVO </a> botão, que normalmente está localizado ao lado do botão liga / desliga e, em seguida, selecione <strong> Entrar no menu da BIOS </strong> . </li> </ul> <p> 3. Em <strong> Saída </strong> selecionar guia <strong> Carregar configurações padrão </strong> ou &quot;Carregar configurações otimizadas&quot;. <br> 4 <strong> Salvar e sair do BIOS </strong> configurações e veja se você pode inicializar o Windows. <br> 5. Se o laptop ainda travar na tela do logotipo da Lenovo, continue na próxima etapa. </p> <p> </p> <h6> Etapa 2. Desative o Lenovo Service Engine. </h6> <p> Em alguns laptops Lenovo (e desktops), o sistema trava no &quot;Logotipo da Lenovo&quot; durante a inicialização, quando o &quot;Lenovo Service Engine&quot; está ativado. Para desativar o serviço: </p> <p> 1. Entre no menu BIOS. <br> 2. Em <strong> Segurança </strong> guia, realce e desative o &quot;Lenovo Service Engine&quot;. </p> <p><img src=\"images/image_thumb-19-834.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3 <strong> Salvar e sair </strong> no menu BIOS. <br> 4. Se o laptop ainda travar na tela inicial do logotipo da Lenovo, continue na próxima etapa. </p> <p> </p> <h6> Etapa 3: Reinicializar a energia. </h6> <p> O próximo método para resolver o problema &quot;O logotipo da Lenovo travou&quot; é realizar uma reinicialização. Fazer isso: </p> <p> 1 <strong> desconectar </strong> todos os periféricos conectados. <br> 2 <strong> Remover </strong> a <strong> Adaptador AC </strong> . <br> 3 <strong> Remover </strong> a <strong> Bateria </strong> . * </p> <p> * Nota: Se você não conseguir remover a bateria, deixe o laptop aberto até que a bateria descarregue. </p> <p> 4 <strong> Aperte </strong> e <strong> calma </strong> a <strong> Poder </strong> por pelo menos 50-60 segundos e depois solte o botão Liga / Desliga. <br> 5. Conecte apenas o adaptador CA e ligue o laptop. <br> 6. Se o Windows iniciar normalmente, desligue o laptop e reconecte a bateria e os periféricos. </p> <h6> Etapa 4. Remova a bateria CMOS. </h6> <p> 1 <strong> Remover </strong> a <strong> Bateria </strong> e a <strong> adaptador AC </strong> . <br> 2. Vire o laptop de cabeça para baixo e <strong> remover </strong> a <strong> contracapa </strong> . * </p> <p> * Nota: A maneira de remover a tampa traseira difere de acordo com o modelo do laptop. Então, faça uma pesquisa no Google sobre como desmontar seu próprio modelo de laptop Lenovo. </p> <p> 3. Localize e <strong> remover </strong> a <strong> Bateria CMOS </strong> . * </p> <p> * Observação: a bateria CMOS tem o formato de um círculo e você pode removê-la retirando-a com cuidado com uma pequena chave de fenda. </p> <p> 4 <strong> Aperte </strong> e <strong> calma </strong> a <strong> Poder </strong> botão por pelo menos 50-60 segundos e depois solte-o. </p> <p> 5. Conecte primeiro o adaptador CA e, em seguida, reinsira a bateria CMOS. <br> 5. Ligue o laptop. * </p> <p> * Nota: Se o problema persistir, remova e deixe a bateria CMOS desconectada por pelo menos 30 minutos. Em seguida, coloque a bateria CMOS de volta, conecte o adaptador CA e ligue o laptop. </p> <p> </p> <h6> Etapa 5. Remova a unidade de DVD. * </h6> <p><strong> * Importante: </strong> Desligue o computador e remova o adaptador de alimentação antes de adicionar ou remover peças. </p> <p> Se você possui um laptop com unidade de DVD, remova-o e ligue o laptop novamente. (Isso parece estranho, mas em alguns casos funciona.) </p> <p> </p> <h6> Etapa 6. Remova e recoloque a RAM e o disco rígido. </h6> <p> Quando um computador (desktop ou laptop) congela na tela do LOGO (POST), geralmente significa um problema com o disco rígido (HDD) ou a memória (RAM). Portanto, proceda da seguinte forma: </p> <p><strong> * Importante: </strong> Desligue o computador e remova o adaptador de alimentação antes de adicionar ou remover suas peças. </p> <p> 1. Remova e recoloque o (s) Módulo (s) de RAM. <br> 2. Ligue o laptop e veja se o problema persiste. Se sim, então ... <br> 3. Desligue o laptop e remova (desconecte) o disco rígido (HDD). <br> 4. Depois de remover o HDD, ligue o laptop novamente. <br> 5. Se o HDD for a causa do problema, a tela inicial do Lenovo LOGO desaparecerá e você receberá uma mensagem dizendo &quot;Nenhum dispositivo inicializável encontrado&quot; ou algo parecido. Se isso acontecer: * </p> <blockquote><p> uma. Desligue o laptop. <br> b. Limpe os contatos no disco rígido e no soquete do HDD com um spray limpador de contatos. <br> c. Reconecte o disco rígido e continue lendo a seguir (6). </p></blockquote> <p> * Nota: Se isso não acontecer, isso indica um problema de BIOS ou da placa-mãe, que só pode ser reparado por um técnico de informática especializado. </p> <p> 6. Ligue o laptop e veja se o problema foi resolvido. Caso contrário, faça backup de seus arquivos e execute uma instalação limpa do Windows, seguindo as etapas abaixo: </p> <blockquote><p> uma. Remova e conecte o disco rígido a outro computador que esteja funcionando (por exemplo, usando um adaptador de disco rígido SATA para USB). <br> b. Se você pode ler o conteúdo da unidade, prossiga e <strong> faça back up de seus arquivos </strong> . * </p> <p> * Nota: Se o disco rígido não for reconhecido pelo computador secundário, o HDD está com defeito e você deve substituí-lo. </p> <p> c. Depois de fazer backup de seus arquivos, prossiga e <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> diagnosticar problemas no disco rígido </a> , e de acordo com os resultados, substitua o HDD (se estiver com defeito), ou (se estiver OK) prossiga e <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> exclua todas as partições no HDD </a> . </p></blockquote> <p> 7. Depois de limpar as partições, coloque o HDD de volta no laptop e prossiga para <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> limpar instalar o Windows </a> . </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}