{"title":"CORREÇÃO: CORRUPÇÃO DE MEMÓRIA DETECTADA DE PISCINA ESPECIAL causada por ntoskrnl.exe BSOD 0x000000c1 (resolvido)","content":"<p> Em um computador baseado no Windows 10, o seguinte erro BSOD aparece: &quot;SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION, causado pelo arquivo ntoskrnl.exe com o código de erro 0x000000c1. O erro de verificação de bug&quot; 0x000000c1 - POOL ESPECIAL DETECTADA CORRUPÇÃO DE MEMÓRIA &quot;geralmente é causado por um software instalado ou um dispositivo driver e não é devido a um problema de hardware. </p> <p><strong> CORRUPÇÃO DE MEMÓRIA DETECTADA DE POOL ESPECIAL, Código de verificação de bug 0x000000c1 Erro BSOD em detalhes: </strong><br> &quot; <em> Foi detectado um problema e o Windows foi encerrado para evitar danos <br> para o seu computador. <br> </em><em> O problema parece ser causado pelo seguinte arquivo: ntoskrnl.exe <br> SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION <br> … .. <br> *** STOP: 0x000000c1 (0xfffff30dd554cfc0, 0xfffff30dd554c22c, 0x0000000000034038, <br> 0x0000000000000032) </em></p> <p><em> *** ntoskrnl.exe - Endereço 0xfffff803c544aca0 base em 0xfffff803c52a2000 DateStamp <br> 0x5b63c7b5 &quot; </em></p> <p><img src=\"images/image_thumb-1-562.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contém instruções detalhadas para resolver o erro de tela azul 0x000000c1 - CORRUPÇÃO DE MEMÓRIA DETECTADA DE POOL ESPECIAL causado pelo arquivo &quot;ntoskrnl.exe&quot;. </p> <p> </p> <h2> Como FIX STOP 0x000000C1: CORRUPÇÃO DE MEMÓRIA DETECTADA DE PISCINA ESPECIAL CAUSADA POR NTOSKENL.EXE. </h2> <p> O problema da tela azul &quot;Stop 0x000000C1: SPECIAL POOL DETECTED MEMORY CORRUPTION&quot; pode ser causado por vários motivos, por exemplo, drivers de dispositivos com defeito, arquivos de sistema corrompidos, ataques de vírus ou de um programa em execução em segundo plano. Para corrigir o problema, siga os métodos abaixo: </p> <h6> Método 1. Faça uma varredura em seu sistema em busca de vírus e malware. </h6> <p> O primeiro passo para resolver os problemas de tela azul &quot;SPECIAL POOL DETECTED MEMORY CORRUPTION&quot; é garantir que seu sistema esteja livre de vírus / malware. Para essa tarefa, siga as instruções neste guia: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Como fazer uma varredura em seu computador em busca de vírus e outros programas maliciosos. </a></p> <p> </p> <h6> Método 2. Desinstale seu software antivírus / segurança. </h6> <p> &quot;O problema de tela azul&quot; SPECIAL POOL DETECTED MEMORY CORRUPTION &quot;, pode ser causado após a atualização automática do seu programa antivírus / segurança (especialmente se você estiver usando o AVAST ou AVG). Portanto, prossiga e desinstale completamente o programa antivírus do sistema e reinicie o seu computador. <br> - Se o problema BSOD não ocorrer após a remoção do antivírus, faça o download e reinstale a versão mais recente do software de segurança no sistema. </p> <p> </p> <h6> Método 3. Inicie o Windows no estado de inicialização limpa. </h6> <p> O próximo método, para resolver o problema de BSOD &quot;SPECIAL POOL DETECTED MEMORY CORRUPTION&quot;, é iniciar o Windows em um <a href=\"https://www.repairwin.com/how-to-start-windows-in-clean-boot-state/\" target=\"_blank\" rel=\"nofollow noopener\"> &quot;inicialização limpa </a> &quot;estado, a fim de identificar qual programa faz com que seu sistema trave. </p> <p> Para iniciar o Windows no estado de inicialização limpa: </p> <p> 1. Pressione o Windows <img src=\"images/image_thumb8_thumb_thumb-465.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite <strong> msconfig </strong> e pressione <strong> Entrar </strong> . </p> <p><img src=\"images/image_thumb-47-632.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. Na guia Serviços, <strong> Ocultar todos os serviços Microsoft </strong> caixa de seleção e, em seguida, pressione a <strong> Desativar tudo </strong> botão, para evitar que todos os serviços não Microsoft sejam iniciados na inicialização do Windows. </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-480.png\" alt=\"clean boot state\" loading=\"lazy\"></p> <p> 4. Em seguida, selecione o <strong> Comece </strong> guia e <strong> Desabilitar </strong> todos os outros programas iniciados durante a inicialização do Windows e executados em segundo plano. * </p> <p> * Nota: Ligado <strong> Windows 10 </strong> ou <strong> 8 </strong> , selecione <strong> Abra o gerenciador de tarefas </strong> para desativar os programas de inicialização. </p> <p><img src=\"images/image_thumb-29-570.png\" alt=\"Windows clean boot\" loading=\"lazy\"></p> <p> </p> <p> 5. Quando terminar, clique em <strong> OK </strong> e <strong> Reiniciar </strong> seu computador. <br> 6. Se após reiniciar seu computador estiver funcionando bem e sem problemas de BSOD, inicie o utilitário de Configuração do Sistema novamente e habilite um por um todos os itens desabilitados e reinicie seu sistema, até descobrir qual deles está causando o problema de BSoD. * </p> <p> * Nota: Para <strong> saída </strong> a partir de <strong> Bota Limpa </strong> estado, inicie o utilitário de configuração do sistema e no <strong> Em geral </strong> Escolha da guia <strong> Inicialização normal. </strong></p> <p> </p> <h6> Método 4. Verifique se há problemas na memória (RAM) e no disco rígido (HDD). </h6> <p> Os problemas de tela azul podem ser causados ​​por um módulo de RAM danificado ou um disco rígido com defeito. Para testar e diagnosticar problemas em seus componentes de RAM e HDD, siga as instruções nestes guias: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Como diagnosticar problemas de memória do computador com Memtest86 + </a></li> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Melhores ferramentas de teste e diagnóstico de disco rígido para verificar a saúde do disco rígido </a></li> </ul> <p> </p> <p> </p> <h6> Método 5. Atualizar drivers de dispositivo. </h6> <p> Em alguns casos, o problema BSOD &quot;SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION causado pelo módulo ntoskrnl.exe&quot; ocorre devido a um driver de dispositivo inválido ou corrompido. Portanto, prossiga e atualize os drivers dos seguintes dispositivos em seu computador com este pedido: </p> <p> 1. Adaptador de vídeo (VGA). <br> 2. Chipset. <br> 3. Adaptador Ethernet. <br> 4. Adaptador Wi-Fi (se houver). </p> <p> </p> <h6> Método 6. <strong> Analisar Minidump. </strong></h6> <p> Quando o Windows trava com uma tela azul, armazena os detalhes da tela do BSoD em pequenos arquivos, que chamam &quot; <strong> MiniDump </strong> &quot;. A análise do <strong> Minidump </strong> Os arquivos podem ajudá-lo a solucionar e resolver o problema da tela azul Para realizar esta tarefa, siga as instruções neste artigo: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Como analisar arquivos MiniDump com BlueScreenView </a> . </p> <p> Isso é tudo! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}