{"title":"Como descriptografar arquivos criptografados com EFS e remover a criptografia EFS no Windows 10.","content":"<p> Em um tutorial anterior, descrevi a maneira de <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> criptografar seus arquivos usando a criptografia EFS </a> . Neste tutorial, você descobrirá como remover a criptografia EFS e como descriptografar os arquivos criptografados EFS após transferi-los para outro computador. </p> <h4> Como descriptografar os arquivos criptografados com EFS e desativar a criptografia EFS. </h4> <ul> <li> <p><a href=\"#part-1\"> Parte 1. Como desativar e remover a criptografia EFS no mesmo PC. </a></p> </li> <li> <p><a href=\"#part-2\"> Parte 2. Como descriptografar arquivos EFS em outro PC. </a></p> </li> </ul> <h6> Parte 1. Como desabilitar e remover a criptografia EFS. </h6> <p> Quando você criptografa seus arquivos com EFS, a chave de descriptografia (certificado) é armazenada localmente em seu computador e os arquivos já estão descriptografados. Se você deseja desativar a criptografia EFS para parar de criptografar seus arquivos / pastas: </p> <p> 1. Clique com o botão direito na pasta / arquivo criptografado e altere o <strong> Propriedade do arquivo </strong> para <strong> Pessoal </strong> . </p> <p><img src=\"images/image_thumb-26-500.png\" alt=\"how to disable efs encryption\" loading=\"lazy\"></p> <p> 2. Quando terminar, você verá que a pasta / arquivo está desbloqueado. Apenas execute as mesmas etapas para remover a criptografia em todas as outras pastas e arquivos criptografados. </p> <p> 3. Agora, se você não usa a criptografia EFS para qualquer outro arquivo / pasta e deseja remover completamente a chave de recuperação EFS (também conhecida como &quot;chave de descriptografia - certificado&quot;) do seu PC: </p> <blockquote> <p> 1. Abra o Internet Explorer e do <strong> Ferramentas </strong> seleção do menu <strong> opções de Internet </strong> . (ou, abra <strong> opções de Internet </strong> a partir de <strong> Painel de controle </strong> .) </p> <p> 2. Em <strong> Contente </strong> clique na guia <strong> Certificados </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-27-186.png\" alt=\"how to remove efs certificate-recovery key\" loading=\"lazy\"></p> <blockquote> <p> 3. Na guia Pessoal, selecione o certificado de descriptografia e clique em <strong> Remover </strong> . * </p> <p><strong> * Atenção: </strong> Certifique-se de ter removido (interrompido) a criptografia de todos os arquivos criptografados antes de remover o certificado (chave de descriptografia) </p> </blockquote> <p><img src=\"images/image_thumb-25-639.png\" alt=\"how to remove efs recovery key\" loading=\"lazy\"></p> <blockquote> <p> 4 <strong> Reiniciar </strong> seu computador. </p> </blockquote> <h6></h6> <h6> Parte 2: Como descriptografar os arquivos criptografados EFS em outro computador. </h6> <p> Se você transferiu os arquivos criptografados EFS para outro computador, a única maneira de visualizar (abrir) os arquivos EFS é possuir a chave de descriptografia. A chave de descriptografia é o arquivo .pfx do certificado que você exportou ao criptografar os arquivos. Se você não tiver a chave de descriptografia EFS, não há como descriptografar os arquivos EFS. </p> <p><strong> Para descriptografar arquivos criptografados EFS, usando a chave de descriptografia - certificado: </strong></p> <p> 1. Clique duas vezes na chave de descriptografia (arquivo .pfx do certificado) para instalá-la. <br> 2. Na tela de boas-vindas do Assistente de importação de certificado, clique em <strong> Próximo </strong> . <br> 3. Em seguida, clique em <strong> Próximo </strong> novamente. </p> <p><img src=\"images/image_thumb38_thumb-158.png\" alt=\"How to Decrypt EFS Encrypted files\" loading=\"lazy\"></p> <p> 4. Digite a senha que você usou quando exportou a chave do certificado e clique em <strong> Próximo </strong> . </p> <p><img src=\"images/image_thumb39_thumb-680.png\" alt=\"install efs .pfx certificate\" loading=\"lazy\"></p> <p> 5. Deixe as configurações padrão nas opções de armazenamento de certificados e clique em <strong> Próximo </strong> . </p> <p><img src=\"images/image_thumb40_thumb-629.png\" alt=\"image_thumb[40]\" loading=\"lazy\"></p> <p> 6. Por fim, clique em <strong> Terminar </strong> . </p> <p><img src=\"images/image_thumb41_thumb-225.png\" alt=\"image_thumb[41]\" loading=\"lazy\"></p> <p> </p> <p> 7. Agora você pode abrir os arquivos criptografados. * </p> <p> * Observação: depois de descriptografar os arquivos, siga as instruções em <a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> parte 1 </a> acima, para remover completamente a criptografia, se desejar. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar esta solução </p>"}