{"title":"CORREÇÃO: Não é possível abrir links do e-mail do Windows 10 ou Outlook no Windows 10. (resolvido)","content":"<p> Se você não conseguir abrir links de e-mails nos aplicativos Mail e Outlook do Windows 10, continue lendo a seguir para corrigir o problema. Muitos usuários relataram que, após atualizar o Windows 10, eles não conseguirão abrir links incorporados de e-mails no navegador da web e receber um erro desconhecido. </p> <p> Problema nos detalhes: em um computador com Windows 10, os hiperlinks de e-mails do Outlook ou do aplicativo Windows 10 Mail não abrem no navegador da web, especialmente se você estiver usando como navegador padrão o Chrome ou o Firefox, e não o Microsoft Edge . </p> <h4> Como CORRIGIR: Não é possível abrir links HTML de e-mails após a atualização do Windows 10. </h4> <h6> Método 1. Redefinir aplicativos padrão. </h6> <p> 1. Feche todos os navegadores da web abertos. <br> 2. Feche o aplicativo de e-mail que você está usando (por exemplo, Windows 10 Mail, Outlook) </p> <p> 3. No menu Iniciar <img src=\"images/image_thumb2_thumb_thumb-709.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clique <strong> Definições </strong><img src=\"images/image_thumb-66-594.png\" alt=\"image\" loading=\"lazy\"> e clique <strong> Apps </strong></p> <p><img src=\"images/image_thumb-72-875.png\" alt=\"Windows 10 Apps\" loading=\"lazy\"></p> <p> 4. Escolha <strong> Aplicativos padrão </strong> no painel esquerdo e, em seguida, clique no <strong> Redefinir </strong> para redefinir os aplicativos recomendados pela Microsoft. </p> <p><img src=\"images/image_thumb-73-622.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 5. Agora abra seu programa de e-mail e um hiperlink de um e-mail. Normalmente, o link será aberto no navegador Microsoft Edge sem problemas. </p> <p> 6. Agora, <strong> perto </strong> o aplicativo de e-mail novamente. </p> <p> 7. Abra o navegador da web e defina-o como padrão ou navegue até <strong> Configurações&gt; </strong> <strong> Aplicativos&gt; Aplicativos padrão </strong> e em <strong> Navegador da web </strong> opções, clique em <strong> Microsoft borda </strong> e selecione seu navegador favorito como o navegador da web padrão. </p> <p><img src=\"images/image_thumb-75-384.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 8. Abra o aplicativo Mail novamente e tente abrir um hiperlink. Se o problema persistir, siga as etapas do método-2. </p> <h6> Método 2. Altere as associações HTML no registro. </h6> <p> 1. Pressione simultaneamente o Windows <img src=\"images/image_thumb36-617.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite <strong> regedit </strong> &amp; Aperte <strong> Entrar. </strong></p> <p><img src=\"images/image_thumb7-779.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2. No painel esquerdo, navegue até esta subchave: </p> <ul> <li><strong> HKEY_CURRENT_USER \\ Software \\ Classes \\ .html </strong></li> </ul> <p> 3. agora <em> Duplo click </em> no <strong> (Padrão) </strong> String no painel direito e definir os dados do valor para <strong> arquivo html </strong></p> <p><img src=\"images/image_thumb2-467.png\" alt=\"Cannot Open Links from Windows 10 Email or Outlook in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 4. Execute a mesma operação e modifique o <em><strong> Padrão </strong></em> valor da string para <strong> arquivo html </strong> nestas subchaves: </p> <ul> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .htm </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .shtml </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .xhtml </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .xht <br> </em></li> </ul> <p> 5. Feche o editor de registro e <strong> reiniciar </strong> seu computador. <br> 6. Tente abrir hiperlinks de seu programa de e-mail. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe este post do blog nas redes sociais para ajudar a divulgar isso. </p>"}