{"title":"CORREÇÃO: Erro no aplicativo de câmera 0xA00F424F (0x8004005) no Windows 10. (resolvido)","content":"<p> O erro do aplicativo Câmera 0xA00F424F no Windows 10, ao tentar tirar fotos ou vídeos, significa que o aplicativo Câmera não pode salvar as fotos ou os arquivos de vídeo no local de armazenamento especificado em seu computador. O erro 0xA00F424F (0x8004005) pode ocorrer por vários motivos, portanto, siga os métodos abaixo para corrigi-lo. </p> <p><img src=\"images/image_thumb-9-592.png\" alt=\"FIX: Camera App Error 0xA00F424F in Windows 10\" loading=\"lazy\"></p> <p> Este tutorial contém instruções passo a passo para resolver o erro &quot;Algo deu errado. Não foi possível salvar as fotos&quot; com o erro: &quot;0xA00F424F (0x80004005)&quot; ou &quot;PhotoCaptureFileCreationFailed (0x80131500)&quot; </p> <h4> Como CORRIGIR: aplicativo da câmera - Salvar erro 0xA00F424F (0x8004005) no Windows 10. </h4> <h6> Método 1. Permita que o aplicativo da câmera acesse a câmera. </h6> <p> O primeiro método para corrigir o erro da câmera 0xA00F424F é garantir que o aplicativo Câmera tenha acesso à sua câmera. Fazer isso: </p> <p> 1. Navegue para <strong> Definições </strong> &gt; <strong> Privacidade. <br> </strong> 2. Selecione o <strong> Câmera </strong> aplicativo no painel esquerdo e no painel direito faça as seguintes configurações: </p> <p> uma. Alternar o <strong> Permitir que aplicativos acessem sua câmera </strong> troque para <strong> SOBRE </strong> . <br> b. Role para baixo e sob o <strong> &#39;Escolha quais aplicativos da Microsoft Store podem acessar sua câmera&#39; </strong> seção, alterne o <strong> Câmera </strong> mudança do aplicativo para <strong> SOBRE </strong> . * </p> <p><img src=\"images/image_thumb-4-435.png\" alt=\"Allow apps to access your camera in Windows 10\" loading=\"lazy\"></p> <h6> Método 2. Redefina as configurações do aplicativo da câmera. </h6> <p> 1. Navegue para <strong> Definições </strong> &gt; <strong> Apps </strong> . <br> 2. Na lista &quot;Aplicativos e recursos&quot;, selecione o aplicativo Câmera e clique em <strong> Opções avançadas </strong> . </p> <p><img src=\"images/image_thumb-5-262.png\" alt=\"Reset Camera App Settings - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Role para baixo e clique em <strong> Redefinir. </strong></p> <p><img src=\"images/image_thumb-6-318.png\" alt=\"Reset app settings Windows 10\" loading=\"lazy\"></p> <h6></h6> <h6> Método 3. Exclua e recrie a pasta &#39;Rolo da câmera&#39;. </h6> <p> O próximo método para corrigir o código de erro 0xA00F424F (0x80004005) no aplicativo Câmera é garantir que a pasta &#39;Rolo da Câmera&#39; (C: \\ Usuários \\% Nome de usuário% \\ Imagens \\ Rolo da Câmera), que é o local padrão para salvar fotos e vídeos, existe e tem as permissões corretas para salvar fotos e vídeos. Fazer isso: </p> <p> 1. Abra o Windows Explorer e na barra de endereço digite o seguinte endereço e pressione <strong> Entrar </strong> : </p> <ul> <li> % APPDATA% \\ Microsoft \\ Windows \\ Libraries \\ Pictures </li> </ul> <p><img src=\"images/image_thumb-10-952.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Abra a pasta &quot;Camera Roll&quot; * e certifique-se de que não haja arquivos. (Caso contrário, mova todos os seus arquivos para outro local em seu disco.). </p> <p> * Nota: Se a pasta Camera Roll não existir, pule para a etapa 4. </p> <p> 3. Agora, <strong> excluir </strong> a <strong> Rolo da câmera </strong> pasta. </p> <p><img src=\"images/image_thumb-11-440.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Por fim, crie uma nova pasta com o nome &quot; <strong> Rolo da câmera </strong> &quot; <br> 5. Quando terminar, abra o aplicativo da câmera e tente tirar uma foto ou gravar um vídeo para ver se o problema foi corrigido. </p> <p> </p> <h6> Método 4. Adicione a pasta Rolo da Câmera à Biblioteca de Imagens. </h6> <p> O método final para corrigir o erro do aplicativo da câmera 0xA00F424F é especificar outro local para armazenar as fotos / vídeos. Fazer isso: </p> <p> 1. Abra o Windows Explorer e na barra de endereços digite o seguinte endereço e pressione <strong> Entrar </strong> : </p> <ul> <li> % APPDATA% \\ Microsoft \\ Windows \\ Libraries </li> </ul> <p> 2. Clique com o botão direito no <strong> Rolo da câmera </strong> pasta e selecione <strong> Propriedades </strong> . </p> <p><img src=\"images/image_thumb-8-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Agora, execute um dos seguintes procedimentos: </p> <p> uma. Se o &#39;Rolo da câmera&#39; não estiver listado em &#39;Localização das bibliotecas, clique no <strong> Adicionar </strong> botão, abra o <strong> Fotos </strong> pasta e, em seguida, selecione o <strong> Rolo da câmera </strong> pasta como o local padrão para salvar as fotos e vídeos. </p> <p> b. Se a pasta &#39;Rolo da câmera&#39; estiver listada em &#39;Localização das bibliotecas&#39;, clique em <strong> Adicionar </strong> e especifique uma nova pasta de armazenamento para o aplicativo da câmera. Quando terminar, clique <strong> Definir local para salvar </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-12-180.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Finalmente, abra o aplicativo da câmera e tente tirar uma foto ou gravar um vídeo. </p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}