{"title":"CORRECÇÃO: Falha no relacionamento de confiança entre esta estação de trabalho e o domínio primário (resolvido)","content":"<p> Se você receber o erro &quot;A relação de confiança entre esta estação de trabalho e o domínio primário falhou&quot; ao tentar fazer login em seu domínio ou ao tentar acessar uma pasta compartilhada em outra máquina no domínio, continue lendo a seguir para resolver o problema. </p> <p> O erro &quot;Falha no relacionamento de confiança entre a estação de trabalho e o domínio primário&quot; pode ocorrer pelos seguintes motivos: </p> <ul> <li> O Computador tem o mesmo nome de outro computador do Domínio. </li> <li> As credenciais do domínio (nome de usuário ou senha) são inválidas. </li> <li> A conta do computador expirou. * </li> </ul> <p> * Nota: Algumas organizações pré-constroem computadores (ou clones de computador) para uso posterior. Se a conta do computador tiver expirado, ele não poderá mais se autenticar no domínio. Nesses casos, os computadores que não podem se autenticar no domínio devem ser removidos do domínio e reconectados a ele. (Passo 4) </p> <p><img src=\"images/image_thumb-32-740.png\" alt=\"FIX: Trust Relationship Between this Workstation and the Primary Domain Failed \" loading=\"lazy\"></p> <h4> Como corrigir: Falha no relacionamento de confiança entre a estação de trabalho e o domínio. </h4> <h6> Método 1. Verifique se as credenciais de domínio estão corretas. </h6> <p> Em primeiro lugar, certifique-se de que as credenciais estão corretas e principalmente a senha. se você clonou a máquina de uma imagem de computador tirada no passado e, desde então, o código mudou. </p> <h6> Método 2. Verifique se há nomes de computador duplicados. </h6> <p> Certifique-se de que o nome do computador seja exclusivo e de que não haja outro computador na rede com o mesmo nome. </p> <h6> Método 3. Verifique se há endereços IP duplicados. </h6> <p> Certifique-se de que o endereço IP do computador seja exclusivo e não entre em conflito com outro endereço IP na rede. </p> <h6> Método 4. Remova e reconecte o computador no domínio. </h6> <p> O método usual para corrigir uma relação de confiança entre um computador e um domínio é remover e adicionar novamente o computador afetado ao domínio. </p> <h5> Etapa 1. Excluir conta de computador do domínio. </h5> <p> 1. Faça login no servidor do Active Directory. <br> 2. Abra <strong> Usuários e computadores do Active Directory. <br> </strong> 3. Expanda o <strong> Computadores </strong> recipiente. <br> 4. Clique com o botão direito no computador afetado e selecione <strong> Excluir. </strong></p> <p><img src=\"images/image_thumb-39-366.png\" alt=\"Delete Computer Account from Domain\" loading=\"lazy\"></p> <h5> Etapa 1. Remova e reconecte o computador no domínio. </h5> <p> 1. Faça login no computador afetado com a conta de Administrador LOCAL (Nome do computador \\ Administrador). </p> <p> 2. Pressione Windows <img src=\"images/image_thumb8_thumb-480.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. </p> <p> 2a. Modelo <strong> sysdm.cpl </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb7_thumb-169.png\" alt=\"system properties\" loading=\"lazy\"></p> <p> 3. Na guia &#39;Nome do Computador&#39;, clique em <strong> Mudar </strong> . </p> <p><img src=\"images/image_thumb-37-924.png\" alt=\"Remove Computer from Domain\" loading=\"lazy\"></p> <p> 4. Em Membro de, selecione <strong> Grupo de Trabalho </strong> , digite um nome de grupo de trabalho (por exemplo, &quot;GRUPO DE TRABALHO&quot;) e clique em <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-34-169.png\" alt=\"Change Computer Name - Membership\" loading=\"lazy\"></p> <p> 5. Digite as credenciais do administrador e clique em <strong> OK </strong> . <br> 6 <strong> Reiniciar </strong> o computador. </p> <p> 7. Execute as etapas 1-4 novamente, mas desta vez, na etapa 4, selecione <strong> Domínio, </strong> digite o nome do domínio e clique em <strong> OK. </strong></p> <p><img src=\"images/image_thumb-38-928.png\" alt=\"Add computer to domain\" loading=\"lazy\"></p> <p> 8. Digite as credenciais do administrador de domínio e clique em <strong> OK </strong> . <br> 9 <strong> Reiniciar </strong> seu PC e faça login no domínio usando a conta de usuário do domínio. </p> <h6> Método 5. Redefinir a conta do computador no domínio. </h6> <p> 1. Faça login no servidor do Active Directory. <br> 2. Abra <strong> Usuários e computadores do Active Directory. <br> </strong> 3. Expanda o <strong> Computadores </strong> recipiente. <br> 4. Clique com o botão direito no computador afetado e selecione <strong> Redefinir conta. </strong></p> <p><img src=\"images/image_thumb-36-935.png\" alt=\"Reset Computer Account in Domain\" loading=\"lazy\"></p> <p> 5. Finalmente, <strong> reiniciar </strong> a <strong> máquina afetada </strong> e faça login no domínio. </p> <p> Isso é tudo, pessoal! Qual método funcionou para você? Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}