{"title":"Como bloquear o YouTube no Windows 10.","content":"<p> Como o ensino à distância se tornou parte da vida das crianças nos últimos anos, muitos pais estão procurando uma maneira de bloquear os vídeos do YouTube durante o e-learning ou reduzir a quantidade de tempo que as crianças passam em frente ao computador assistindo a vídeos em vez de fazer outras atividades. </p> <p> Além do vício ao YouTube que preocupa os pais, nos últimos anos têm sido lançados muitos vídeos no YouTube com conteúdo impróprio ou perigoso para crianças e por isso é necessário restringir o acesso ao YouTube, principalmente quando não há supervisão dos pais. </p> <p> Neste guia, você aprenderá como impedir o acesso ao site do YouTube em todos os navegadores. * </p> <p> * Observação: Se você deseja bloquear um site apenas no Chrome ou no Firefox, leia este artigo: <a href=\"https://www.repairwin.com/block-websites-on-chrome-firefox/\" target=\"_blank\" rel=\"nofollow noopener\"> Como bloquear sites no Chrome e Firefox. </a></p> <h2> Como bloquear o YouTube em qualquer navegador no sistema operacional Windows 10, 8 ou 7. </h2> <p> A maneira mais confiável de bloquear qualquer site em qualquer navegador em um PC com Windows é usar o arquivo &quot;hosts&quot;. O <strong> hospedeiros </strong> file é um arquivo do sistema operacional que mapeia nomes de host (nomes de domínio) para endereços IP. Em palavras simples, quando você digita o endereço de um site em seu navegador, o computador olha primeiro para o local <strong> hospedeiros </strong> arquivo para resolver seu endereço IP. Se o nome do site não aparecer no arquivo host, ele está tentando encontrar seu endereço IP no serviço DNS que você está usando no dispositivo. </p> <p> Para bloquear o YouTube em qualquer navegador da web (por exemplo, Chrome, Firefox, Edge, etc.) no Windows por meio do arquivo hosts: </p> <p> 1. Abra <strong> Bloco de anotações </strong> aplicativo <strong> como administrador </strong> . Fazer isso: </p> <blockquote><p> uma. Modelo <strong> bloco de anotações </strong> na caixa de pesquisa </p> <p> b. <strong> Clique com o botão direito </strong> sobre <strong> Bloco de anotações </strong> e selecione <strong> Executar como administrador </strong> . </p> <p><img src=\"images/image_thumb-584.png\" alt=\"run notepad as administrator\" loading=\"lazy\"></p></blockquote> <p> </p> <p> 2. De <strong> Arquivo </strong> menu, selecione <strong> Abrir. <br> </strong> 3. Navegue até este local em seu disco: </p> <ul> <li> C: \\ Windows \\ System32 \\ drivers \\ etc </li> </ul> <p> 4. Altere o &quot;Tipo de arquivo&quot; para <strong> Todos os arquivos </strong> e então abra o <strong> hospedeiros </strong> Arquivo </p> <p><img src=\"images/image_thumb-1-968.png\" alt=\"block sites hosts file\" loading=\"lazy\"></p> <p> </p> <p> 5. No final, adicione as seguintes linhas: * </p> <ul> <li> 127.0.0.1 youtube.com </li> <li> 127.0.0.1 www.youtube.com </li> <li> 127.0.0.1 m.youtube.com </li> </ul> <p> * Observação: pressione TAB após digitar 127.0.0.1 </p> <p><img src=\"images/image_thumb-2-460.png\" alt=\"block youtube hosts\" loading=\"lazy\"></p> <p> </p> <p> 6. Quando terminar, clique em <strong> Arquivo </strong> &gt; <strong> Salve  </strong> e feche o bloco de notas. </p> <p> 7. Finalmente, abra seu navegador e tente visitar o YouTube. Normalmente, você deve receber a mensagem: &quot;Conecte-se à Internet. Você está offline. Verifique sua conexão&quot;. </p> <p><img src=\"images/image_thumb-3-490.png\" alt=\"block youtube.com hosts\" loading=\"lazy\"></p> <p> </p> <p> 8. Você está pronto. Se você gostaria de desbloquear o YouTube no futuro, basta seguir os mesmos passos. mas desta vez remova as três (3) linhas adicionadas no arquivo hosts ou digite o símbolo <strong> # </strong> na frente de cada linha adicionada. </p> <p> Isso é tudo, pessoal! Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}