{"title":"CORREÇÃO: Não foi possível instalar os revisores de texto do Office 2016 (resolvido)","content":"<p> Se você não conseguiu instalar os revisores de texto do Office 2016 com o erro &quot;Ops! Uma versão compatível do Microsoft Office é necessária antes de instalar os revisores de texto adicionais.&quot;, Continue lendo abaixo para resolver o problema. </p> <p> </p> <p><img src=\"images/image_thumb-23-190.png\" alt=\"Couldn't Install Office 2016 Proofing Tools - Oops! A compatible version of Microsoft Office is required \" loading=\"lazy\"></p> <p> </p> <p> O erro de instalação do Microsoft Office Proofing Tools 2016 &quot;Uma versão compatível do Microsoft Office é necessária antes que você possa instalar revisores de texto adicionais&quot; geralmente aparece se você tentar instalar uma versão incompatível dos revisores de texto para a versão e arquitetura do Office instalada, ou se você instalou uma versão de 32 bits do Office 2016 em um sistema operacional Windows de 64 bits. </p> <h4> Como corrigir: Não é possível instalar Revisores de Texto no Office 2016 ou Office 2019. </h4> <p> </p> <h6> Método 1. Baixe as ferramentas de revisão correta. </h6> <p> Em primeiro lugar, certifique-se de que baixou o arquivo do instalador dos revisores de texto correto, de acordo com a versão e arquitetura do Office instalada (32 ou 64 bits). Fazer isso: </p> <p> 1. Abra qualquer aplicativo do Office (por exemplo, Word). <br> 2. Do <strong> Arquivo </strong> clique no menu <strong> Conta </strong> (ou <strong> Ajuda </strong> ) <br> 3. Agora clique no <strong> Sobre o Word </strong> botão no painel direito. <br> 4. Observe a versão do Office instalada (por exemplo, &quot;2016&quot;) e a arquitetura (por exemplo, &quot;64 bits&quot;). </p> <p><img src=\"images/image_thumb-24-106.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Agora de acordo com a versão Office: </p> <ul> <li> Para <strong> Office 2016 </strong> baixe as ferramentas de revisão aqui: <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=52668\" target=\"_blank\" rel=\"nofollow noopener\"> Revisores de texto do Office 2016 </a> . </li> <li> Para <strong> Office 2019 </strong> baixe as ferramentas de revisão aqui: <a href=\"https://support.office.com/en-us/article/language-accessory-pack-for-office-82ee1236-0f9a-45ee-9c72-05b026ee809f?ui=en-US&rs=en-US&ad=US\" target=\"_blank\" rel=\"nofollow noopener\"> Ferramentas de revisão de texto do Office 2019 </a></li> </ul> <p> 6. Em seguida, escolha o idioma desejado para as ferramentas de revisão de texto. <br> 7. Finalmente, de acordo com a arquitetura do Office (32 ou 64 bits): </p> <ul> <li> Para o Office de 32 bits, baixe o arquivo do instalador x86. (por exemplo, &quot;proofingtools2016_en-us-x86.exe) </li> <li> Para o Office de 64 bits, baixe o arquivo do instalador x64. (por exemplo, &quot;proofingtools2016_en-us-x64.exe) </li> </ul> <p> 8. Clique duas vezes no arquivo .exe baixado para instalar as ferramentas de revisão de texto. </p> <p> </p> <h6> Método 2. Reparar a instalação do Office. </h6> <p> 1. Navegue para <strong> Programas e </strong><strong> Características. </strong> Fazer isso: </p> <blockquote><p> 1. Pressione simultaneamente o Windows <img src=\"images/image_thumb36-318.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite: <strong> appwiz.cpl </strong> e clique <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-24-189.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Em Programas e Recursos, selecione o produto Microsoft Office instalado em seu sistema e clique em <strong> Mudar </strong> . </p> <p><img src=\"images/image_thumb-2-328.png\" alt=\"repair office 2016 and office 2019\" loading=\"lazy\"></p> <p> </p> <p> 3. Por fim, clique em <strong> Reparar </strong> e siga as etapas restantes para reparar o Microsoft Office. * </p> <p> * Aviso: Se depois de clicar em Reparar, você receberá a mensagem &quot; <strong> Como você gostaria de consertar seus programas do Office </strong> &quot;tela, selecione o <strong> Reparo Rápido </strong> opção, que verifica e substitui os arquivos ausentes ou corrompidos. Se após o &quot;Reparo Rápido&quot;, o problema não for corrigido, escolha o <strong> Conserto Online </strong> opção de reinstalar seu produto Office. (requer uma conexão com a Internet). </p> <p><img src=\"images/image_thumb-26-143.png\" alt=\"Repair Office\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Quando o reparo for concluído, reinicie o PC. <br> 5. Instale os revisores de texto. </p> <p> </p> <h6> Método 3. Desinstalar e reinstalar o Office 2016 de 64 bits. </h6> <p> O próximo método para resolver os problemas de instalação dos revisores de texto do Office é remover e reinstalar o Office 2016 em seu sistema. Fazer isso: </p> <h2> Etapa 1. Desinstale o Office do seu sistema. </h2> <p> 1. Baixe o <a href=\"http://go.microsoft.com/?linkid=9815935\" target=\"_blank\" rel=\"nofollow noopener\"> Desinstalar o Microsoft Office Fix </a> ferramenta para desinstalar automaticamente o Office 365, Office 2016 ou Office 2013. <br> 2. Execute o &quot;Uninstall Microsoft Office Fix&quot; e pressione <strong> Próximo </strong> na primeira tela. </p> <p><img src=\"images/image_thumb-19-681.png\" alt=\"office uninstall tool\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Deixe o processo resolver problemas com a desinstalação do Office e remova o software do Office do seu computador. </p> <p><img src=\"images/image_thumb-20-361.png\" alt=\"cannot uninstall office\" loading=\"lazy\"></p> <p> </p> <h2> Etapa 2. Baixe e instale o Office 2016. </h2> <p> 1. Navegue para <a href=\"https://www.heidoc.net/joomla/technology-science/microsoft/67-microsoft-windows-iso-download-tool\" target=\"_blank\" rel=\"nofollow noopener\"> HeiDoc.net </a> e baixe o <strong><a href=\"https://www.heidoc.net/php/Windows-ISO-Downloader.exe\" target=\"_blank\" rel=\"nofollow noopener\"> Ferramenta de download de ISO do Windows </a></strong> . <br> 2. Clique duas vezes para executar o arquivo baixado &quot;Windows-ISO-Downloader.exe&quot;. <br> 3. Na ferramenta de download do Windows ISO: </p> <blockquote><p> uma. Escolha o <strong> Escritório </strong> guia no painel direito. <br> b. <strong> Selecione </strong> a <strong> Versão Office </strong> que você deseja baixar. (por exemplo, &quot;Office 2016&quot;). <br> c. Então, à esquerda, escolha o <strong> Edição </strong> do escritório e o desejado <strong> língua </strong> abaixo de. <br> d. Quando terminar, clique <strong> Download </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-595.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Quando o download for concluído, clique duas vezes no arquivo de imagem baixado (ProPlusRetail.img), para montá-lo no Explorer. <br> 5. Explore o conteúdo da imagem montada (unidade) e abra a pasta &quot;Office&quot;. <br> 6. Clique duas vezes em &quot;setup32.exe&quot; para instalar a versão do Office de 32 bits ou em &quot;setup64.exe&quot; para instalar a versão do Office de 64 bits. * </p> <p> * Observação: sugiro que, se você tiver uma versão de 64 bits do Windows, instale a versão de 64 bits do Office (setup64.exe). </p> <p><img src=\"images/image_thumb-25-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Quando a instalação for concluída, use sua chave de licença para ativar o Office. <br> 8. Siga as instruções no método 1 acima para instalar os Revisores de Texto. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}