{"title":"Como ocultar ou mostrar as barras de rolagem no menu Iniciar do Windows 10, configurações ou aplicativos.","content":"<p> Como você deve ter notado, no Windows 10, quando você inicia o menu Iniciar, o aplicativo Configurações ou ao trabalhar em um App Store, a barra de rolagem é invisível por padrão e só aparece quando você move o cursor para o lado direito do aberto janela. Esse comportamento era um pouco irritante e, felizmente, a Microsoft na mais recente atualização de recursos do Windows 10 1803 (abril de 2018) adicionou a opção de sempre exibir a barra de rolagem em todas as janelas abertas (por exemplo, no menu Iniciar no aplicativo Configurações, etc.) . </p> <p><img src=\"images/image_thumb-446.png\" alt=\"Show Scroll Bar in Windows 10 \" loading=\"lazy\"></p> <p> Este tutorial contém instruções sobre como ocultar ou mostrar sempre as barras de rolagem em todas as janelas e aplicativos abertos, no Windows 10 v1803 (ou posterior). </p> <h4> Como mostrar ou ocultar a barra de rolagem no menu Iniciar do Windows 10, configurações ou aplicativos. </h4> <p> 1. Do <strong> Começar </strong> <img src=\"images/image_thumb-38-810.png\" alt=\"image\" loading=\"lazy\"> escolha do menu <strong> Definições </strong> <img src=\"images/image_thumb-44-476.png\" alt=\"image\" loading=\"lazy\"> . </p> <p> 2. Abra <strong> Fácil acesso </strong> definições. </p> <p><img src=\"images/image_thumb-1-268.png\" alt=\"display scroll bar windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Clique em Exibir à esquerda e &quot;arraste&quot; o <strong> Ocultar automaticamente as barras de rolagem no Windows </strong> troque para <strong> Fora. </strong></p> <p><img src=\"images/image_thumb-3-742.png\" alt=\"always show scroll bars windows 10\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}