{"title":"CORRECÇÃO: as guias da planilha do Excel estão faltando na parte inferior de uma pasta de trabalho. (Resolvido)","content":"<p> Há alguns dias, um de meus clientes mencionou que as guias da planilha estão faltando em uma das pastas de trabalho do Excel. Depois de resolver o problema de &quot;guias do Excel ausentes&quot; em seu computador, decidi escrever um tutorial com as etapas detalhadas que segui para restaurar as guias da planilha ausentes do arquivo Excel. </p> <p><img src=\"images/image_thumb-52-600.png\" alt=\"FIX: Excel Sheets are Missing at the bottom of a Workbook\" loading=\"lazy\"></p> <p> Este artigo fornece instruções detalhadas para resolver o problema de &quot;planilhas ausentes&quot; em uma pasta de trabalho do Excel. </p> <h4> Como corrigir: as guias da planilha do Excel não estão visíveis. </h4> <p> Se você não consegue ver as guias em uma pasta de trabalho do Excel, tente o seguinte: </p> <h6> Método 1. Organize todas as janelas da pasta de trabalho ativa. </h6> <p> 1. Vá para o <strong> Visualizar </strong> guia e clique <strong> Organizar todos. </strong></p> <p><img src=\"images/image_thumb-47-872.png\" alt=\"Fix missing excel tabs\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Selecione <strong> Ladrilhado </strong> e <strong> Janelas da pasta de trabalho ativa </strong> e clique <strong> OK. </strong></p> <p><img src=\"images/image_thumb-48-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Se você vir as guias ausentes, clique em <strong> Salve  </strong> para salvar a visualização atual, caso contrário, continue abaixo. </p> <p> </p> <h6> Método 2. Revelar planilhas ocultas do Excel. </h6> <p> 1. Para revelar as planilhas ocultas do Excel, coloque o mouse sobre o <strong> 3 pontos </strong><img src=\"images/image_thumb-41-979.png\" alt=\"image\" loading=\"lazy\"> na barra inferior até que você veja o <strong> flecha dupla </strong><img src=\"images/image_thumb-42-990.png\" alt=\"image\" loading=\"lazy\"> . </p> <p><img src=\"images/image_thumb-49-473.png\" alt=\"reveal hidden sheets excel\" loading=\"lazy\"></p> <p> </p> <p> 2 <strong> Clique </strong> na seta dupla <img src=\"images/image_thumb-44-186.png\" alt=\"image\" loading=\"lazy\"> e <strong> arraste o mouse para a direita </strong> até ver todas as guias de sua pasta de trabalho do Excel. </p> <p><img src=\"images/image_thumb-50-847.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Se as guias ocultas estiverem visíveis novamente, clique em <strong> Salve  </strong> para salvar esta vista, caso contrário continue abaixo. </p> <p> </p> <h6> Método 3. Ative a opção &#39;Mostrar guias da planilha&#39;. </h6> <p> Se as planilhas do Excel não estiverem visíveis após a aplicação do acima, verifique a configuração &quot;Mostrar guias da planilha&quot; nas opções do Excel. Fazer isso: </p> <p> 1. Vá para <strong> Arquivo </strong> menu e selecione <strong> Opções </strong> . </p> <p> 2. Selecione o <strong> Avançado </strong> guia à esquerda e à direita, sob o <b> Exibir opções para esta pasta de trabalho, verifique </b> a <b> Mostrar guias de planilha </b> caixa e clique <strong> OK. </strong></p> <p><img src=\"images/image_thumb-51-664.png\" alt=\"show sheet tabs excel\" loading=\"lazy\"></p> <p> 3. Clique <strong> Salve  </strong> para salvar esta vista. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe este post do blog nas redes sociais para ajudar a divulgar isso. </p>"}