{"title":"CORREÇÃO: Não é possível encerrar o processo. A operação não pôde ser concluída, o acesso foi negado.","content":"<p> Se você não puder encerrar um processo ou serviço no Windows, porque está recebendo o erro &quot;Não foi possível encerrar o processo. A operação não pôde ser concluída, o acesso foi negado&quot;, continue lendo abaixo para saber como corrigir o problema. </p> <p><img src=\"images/image_thumb-10-874.png\" alt=\"Unable to terminate process. Access is denied\" loading=\"lazy\"></p> <p> A maneira usual de interromper um processo em execução no Windows é abrir o Gerenciador de Tarefas, clicar com o botão direito do mouse no nome do processo e selecionar &#39;Finalizar Tarefa&#39;. Mas, como você deve saber, às vezes é impossível interromper um processo porque você recebe a mensagem &quot;Não foi possível encerrar o processo. Acesso negado&quot;. </p> <p> Da mesma forma, você pode enfrentar um problema semelhante se quiser interromper um serviço e não puder, porque a opção &quot;Parar&quot; está esmaecida ou porque você recebeu o erro &quot;Não foi possível interromper o serviço. Acesso negado&quot; ao tentar interromper o serviço. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"Unable to Terminate Service\" loading=\"lazy\"></p> <p> Neste tutorial, você aprenderá como encerrar quaisquer serviços ou processos que você não pode encerrar usando as formas usuais. </p> <h4> Como forçar a interrupção de qualquer serviço ou programa do PowerShell no sistema operacional Windows 10/8/7. </h4> <ul> <li><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> Como forçar o fechamento de qualquer aplicativo do PowerShell. </a></li> <li><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> Como forçar o fechamento de qualquer serviço do PowerShell. </a></li> </ul> <h6></h6> <h6> Parte 1. Como encerrar um aplicativo do PowerShell. </h6> <p> 1. Abra o PowerShell como administrador. </p> <p> 2. No PowerShell, digite o seguinte comando para obter o ID do processo (PID). </p> <ul> <li><strong> lista de tarefas </strong></li> </ul> <p><img src=\"images/image_thumb-12-275.png\" alt=\"Terminate process from powershell\" loading=\"lazy\"></p> <p> </p> <p> 3. Anote o nome do aplicativo que deseja excluir e digite o seguinte comando para fechar todas as instâncias do aplicativo. * </p> <ul> <li> Stop-Process -Name &quot;Application_Name&quot; </li> </ul> <p> * Observação: em Application_Name, digite o nome do aplicativo sem a extensão .exe. Por exemplo, se você deseja forçar o fechamento do aplicativo &quot;chrome.exe&quot;, digite: </p> <ul> <li><em> Stop-Process -Name &quot;chrome&quot; </em></li> </ul> <p><img src=\"images/image_thumb-16-974.png\" alt=\"Stop Program PowerShell\" loading=\"lazy\"></p> <p> </p> <p><strong> GORJETA: </strong> Se você deseja encerrar uma única instância de um programa, digite o seguinte comando: </p> <ul> <li> Stop-Process -ID PID </li> </ul> <p> * Nota: No PID digite o número exclusivo da instância do programa. </p> <p> </p> <h6> Parte 2. Como encerrar um serviço do PowerShell. </h6> <p> 1. Abra o gerenciador de tarefas e do <strong> Serviços </strong> guia, observe o <strong> PID </strong> do serviço que você deseja interromper. </p> <p><em> por exemplo. Neste exemplo, vamos forçar a parada do serviço &quot;AdobeARMservice&quot; com PID <strong> 1640 </strong> . </em></p> <p><img src=\"images/image_thumb-14-150.png\" alt=\"Force Stop Service PowerShell\" loading=\"lazy\"></p> <p> </p> <p> 2. Em seguida, execute <strong> PowerShell como administrador </strong> e digite este comando: </p> <ul> <li> kill -id PID </li> </ul> <p> * Nota: Como PID, digite o PID que você notou no Gerenciador de Tarefas. Neste exemplo, o comando será: </p> <ul> <li><em> kill -id 1640 </em></li> </ul> <p><img src=\"images/image_thumb-15-147.png\" alt=\"Kill Running Service from PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}