{"title":"Como controlar o mouse com o teclado no Windows 10/8/7.","content":"<p> Este tutorial contém instruções sobre como controlar o mouse usando o teclado, usando o recurso &quot;Teclas do mouse&quot; no Windows. O artigo pode ser útil para pessoas que não conseguem operar o mouse ou nos casos em que o mouse para de funcionar (ou não existe) e você deseja usar seu teclado como um mouse para trabalhar com seu computador a fim de terminar um trabalho urgente. </p> <p> O <strong> Teclas do mouse </strong> O recurso é integrado aos sistemas operacionais Windows 10, 7 ou 7 e permite que você use o teclado numérico para mover o ponteiro do mouse na tela e realizar todas as ações usuais de um mouse (clique, clique duplo, clique com o botão direito). </p> <h4> Como usar o teclado como um mouse. </h4> <h6> Método 1. Habilite as teclas do mouse usando o atalho do teclado. * </h6> <p> O primeiro método para mover o cursor do mouse [sem o mouse <img src=\"images/wlemoticon-openmouthedsmile-273.png\" alt=\"Open-mouthed smile\" loading=\"lazy\"> ], é ligar as Teclas do Mouse, da seguinte forma: </p> <p> 1. Pressione <strong> deixou ALT </strong> + <strong> desvio à esquerda </strong> + <strong> Num Lock </strong></p> <p><img src=\"images/image_thumb-10-220.png\" alt=\"How to Control Mouse with Keyboard \" loading=\"lazy\"></p> <p> </p> <p> 2. Quando a janela Teclas do mouse aparecer na tela, pressione <strong> ENTRAR </strong> para ativar as teclas para mouse. </p> <p><img src=\"images/image_thumb-2-595.png\" alt=\"turn on mouse keys\" loading=\"lazy\"></p> <p> 3. Após habilitar as teclas do mouse, você pode usar o teclado (teclado numérico) para realizar todas as ações do mouse (mover, clicar, clicar com o botão direito, clicar duas vezes) conforme mostrado na figura abaixo. * </p> <p> * Nota: Se você deseja aumentar ou diminuir a velocidade do ponteiro, leia as instruções no próximo método. </p> <p><strong> Funções do mouse no teclado numérico </strong></p> <p><img src=\"images/image_thumb-8-332.png\" alt=\"mouse functions numeric keypas\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Método 2. Habilite as teclas do mouse na Central de facilidade de acesso. </h6> <p> O segundo método para poder controlar o ponteiro do mouse com o teclado é ativar e configurar o recurso &#39;Teclas do mouse&#39; no centro de fácil acesso. Fazer isso: </p> <p> 1. Navegue até o Painel de Controle do Windows, defina &#39;Exibir por&#39; para <strong> Ícones pequenos </strong> e então abra o <strong> Centro de facilidade de acesso. </strong></p> <p><img src=\"images/image_thumb-3-309.png\" alt=\"use keyboard as mouse\" loading=\"lazy\"></p> <p> </p> <p> 2. Clique <strong> Torne o mouse mais fácil de usar. </strong></p> <p><img src=\"images/image_thumb-4-518.png\" alt=\"enable mouse keys - ease of access\" loading=\"lazy\"></p> <p> </p> <p> 3. Em seguida, clique em <strong> Configurar as teclas do mouse </strong> . </p> <p><img src=\"images/image_thumb-9-206.png\" alt=\"Configure Pointer Speed \" loading=\"lazy\"></p> <p> </p> <p><strong> 4 </strong> Agora, verifique o <strong> Ligue as teclas do mouse </strong> caixa e clique <strong> Aplicar. </strong><br> <strong> 5 </strong> Agora tente mover o cursor do mouse usando o teclado numérico e configure o <strong> Velocidade do ponteiro </strong> como quiser. (Clique em &#39;Aplicar&#39; a cada alteração e em &#39;OK&#39; para fechar as opções de &#39;Teclas do mouse &quot;.) </p> <p><img src=\"images/image_thumb-7-340.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}