{"title":"CORREÇÃO: tela preta da câmera do Skype e outros problemas da webcam no Windows 10.","content":"<p> O problema com a tela preta / em branco da câmera do Skype é um dos problemas mais comuns no Windows 10 e pode ser causado por vários motivos. Portanto, aqui está um guia passo a passo para como corrigi-lo. </p> <p> No Windows 10, uma nova atualização pode causar muitos problemas com sua webcam integrada, e a câmera pode não funcionar ou pode não ser reconhecida em alguns aplicativos enquanto está funcionando corretamente em outros. Por exemplo, eu vi um caso em que enquanto a câmera funcionava sem problemas nos aplicativos Webex e Zoom, ela exibia uma tela preta no Skype. </p> <p> Este guia contém instruções passo a passo para corrigir vários problemas com a câmera integrada em laptops com Windows 10: * </p> <ul> <li><em> A webcam / câmera não está funcionando no Windows 10 </em></li> <li><em><em> Webcam / câmera </em> Parou de funcionar após a atualização no Windows 10. </em></li> <li><em> A webcam não funciona em alguns aplicativos (Skype, Windows Hello WebEx, etc.). </em></li> <li><em> A webcam exibe uma tela preta (ou em branco) quando usada no Skype. </em></li> <li><em> A webcam está funcionando no Skype, mas exibe uma tela preta na janela de visualização da câmera </em> . </li> <li> Os aplicativos não podem reconhecer ou encontrar a câmera / webcam </li> </ul> <p><strong> * Aviso para proprietários de ThinkPad da Lenovo: </strong> Se você possui um dos modelos de ThinkPad listados na tabela abaixo, faça o download e instale este <a href=\"/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/DC8297800EA7/Integrated%20Camera%20Driver%20Registry%20Patch%20for%20Windows%2010%20(Version%201709%20or%20later)%20-%20ThinkPad\" target=\"_blank\" rel=\"nofollow noopener\"> patch de registro da Lenovo. </a> O patch corrige um problema em que o driver de câmera integrado pode não funcionar corretamente após a atualização para o Windows 10 versão 1709 ou posterior. </p> <p><img src=\"images/image_thumb-30-725.png\" alt=\"THinkpad Registry Fix for Integrated Camera\" loading=\"lazy\"></p> <h2> Como CORRIGIR: Problemas de webcam no Windows 10. </h2> <p> </p> <h3> Etapa 1. Permita o acesso da câmera aos aplicativos. </h3> <p> No Windows 10, a câmera e o microfone podem não estar disponíveis para os aplicativos devido às configurações de privacidade que podem ter sido aplicadas. Portanto, prossiga e permita que o aplicativo com problema de câmera acesse sua câmera. Por exemplo, se você enfrentar o problema da câmera no Skype, proceda da seguinte forma: </p> <p> 1. Navegue para ir para <strong> Começar </strong> cardápio <img src=\"images/image_thumb-12-696.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Definições </strong> -&gt; <strong> Privacidade </strong> . <br> 2. Selecione <strong> Câmera </strong> no painel esquerdo e à direita: </p> <blockquote><p> uma. Garanta que <strong> Acesso à câmera para este dispositivo </strong> é <strong> sobre. </strong> Se não, clique <strong> Mudar </strong> e definido para <strong> SOBRE. </strong><br> b. Em seguida, defina para <strong> Sobre </strong> a <strong> Permitir que os aplicativos acessem o botão da câmera </strong> . </p> <p><img src=\"images/image_thumb-20-105.png\" alt=\"Allow Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Agora, role para baixo e ... </p> <p> c. Se você estiver enfrentando o problema da tela preta da câmera no <strong> Skype </strong> app store, role para baixo e em <strong> Escolha quais aplicativos da Microsoft Store podem acessar sua câmera </strong> seção, conjunto <strong> Skype </strong> para <strong> Sobre. </strong></p> <p><img src=\"images/image_thumb-21-826.png\" alt=\"Allow Store Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> d. Se você vir uma janela de tela preta de sua câmera enquanto usa o <strong> Skype para Windows </strong> (aplicativo de desktop), em seguida, certifique-se de que o <strong> Permitir que aplicativos de desktop acessem sua câmera </strong> mudar é <strong> Sobre </strong> . </p> <p><img src=\"images/image_thumb-22-558.png\" alt=\"Allow Applications to Access Camera Windows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h3> Etapa 2. Verifique se sua câmera está funcionando corretamente. </h3> <p> Uma das primeiras etapas para solucionar problemas com sua webcam é confirmar se ela funciona no aplicativo Câmera do Windows 10. </p> <p> 1. Na caixa de pesquisa, digite <strong> Câmera </strong> para abrir o aplicativo Câmera. <br> 2. Clique na lupa e pesquise por &quot; <strong> Câmera </strong> &quot; <br> 3. Abra o <strong> Câmera </strong> aplicativo </p> <p><img src=\"images/image_thumb-23-730.png\" alt=\"Open Camera app Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Agora, de acordo com o resultado, proceda da seguinte forma: </p> <blockquote><p> R. Se sua câmera estiver funcionando, você deverá ver sua imagem na tela. Nesse caso, prossiga e verifique sua câmera no Skype ou em qualquer outro aplicativo que você use. Se a webcam não funcionar ou exibir uma tela preta, siga as etapas abaixo na ordem: </p> <ol> <li> Tente <strong> Desinstalar </strong> e <strong> reinstalar </strong> o aplicativo com o problema da câmera (por exemplo, Skype). </li> <li> Prossiga para Habilitar ou Desabilitar o Modo Servidor de Quadros no Registro seguindo as instruções em <a href=\"#step-3\" target=\"_blank\" rel=\"nofollow noopener\"> etapa 3 </a> . </li> </ol> <p> B. Se sua câmera também não funcionar no aplicativo Câmera, uma das seguintes coisas pode acontecer: </p> <ol> <li> O driver do dispositivo da câmera está incorreto ou danificado. Neste caso, prossiga para solucionar os problemas dos drivers da câmera, seguindo as instruções em <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> Passo 4 </a> . </li> <li> A câmera está danificada e não está funcionando. Nesse caso, vá a uma oficina de conserto de computador para consertar sua webcam ou use uma câmera USB externa. </li> </ol> </blockquote> <h3></h3> <h3> Etapa 3. Corrigir o problema da tela preta da webcam no Registro do Windows 10. </h3> <p> Se a câmera for reconhecida e funcionar sem problemas em alguns aplicativos, mas não funcionar em outros, ou exibir uma tela preta no Skype, tente desabilitar ou habilitar o &quot;Modo servidor de quadros&quot; no registro. </p> <p> 1. Abra o Editor do Registro: para fazer isso: </p> <blockquote><p> 1. Pressione Windows <img src=\"images/image_thumb41-284.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite <strong> regedit </strong> e pressione <strong> Entrar </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-845.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> 3. No Editor do Registro, navegue até a seguinte chave no painel esquerdo: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows Media Foundation \\ Platform </li> </ul> <p> 4 <strong> Clique com o botão direito </strong> em um espaço vazio no painel direito e selecione <strong> Novo -&gt; Valor DWORD (32 bits). </strong></p> <p><img src=\"images/image_thumb-24-839.png\" alt=\"Fix Webcam black Screen Windows 10\" loading=\"lazy\"></p> <p> 5. Dê o nome <strong> EnableFrameServerMode </strong> para o novo valor. <br> 6. Clique duas vezes no valor recém-criado e certifique-se de que os dados do valor sejam <strong>0</strong> . (Zero). Clique <strong> OK. </strong></p> <p><img src=\"images/image_thumb-25-764.png\" alt=\"Fix Webcam issues Windows 10\" loading=\"lazy\"></p> <p> 7. Agora, siga as mesmas etapas acima (4,5 e 6) e faça as mesmas alterações nesta chave: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ WOW6432Node \\ Microsoft \\ Windows Media Foundation \\ Platform </li> </ul> <p> 8. Quando terminar, <strong> perto </strong> Editor de registro e <strong> reiniciar </strong> seu PC. <br> 9. Após reiniciar, inicie o Skype e verifique se o problema com a WebCam foi resolvido. Caso contrário, siga os mesmos passos, mas desta vez <strong> habilitar </strong> a <strong> EnableFrameServerMode </strong> mudando seu valor de <strong>0 </strong> para <strong> 1 </strong> e <strong> reiniciar </strong> seu PC novamente. </p> <p> </p> <h3> Etapa 4. Solucionar problemas do driver da webcam. </h3> <p> A próxima etapa, para corrigir problemas da câmera no Windows 10, é reverter ou desinstalar / reinstalar os drivers da câmera. 1. Abra <strong> Gerenciador de Dispositivos </strong> . Fazer isso: </p> <blockquote><p> 1. Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-696.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Na caixa &quot;Abrir&quot;, digite: <strong> devmgmt.msc </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-5-837.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Expanda <strong> Dispositivos Imagine </strong> (ou <strong> Máquinas fotográficas </strong> ) <br> 3 <strong> Clique com o botão direito </strong> Nas suas <strong> Câmera </strong> e escolher <strong> Propriedades. </strong></p> <p><img src=\"images/image_thumb-26-673.png\" alt=\"Camera Properties\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 4. Selecione o <strong> Motorista </strong> guia e proceda da seguinte forma de acordo com o seu caso: </p> <blockquote><p> A. Se sua webcam estava funcionando antes, <strong> Motorista de reversão </strong> e <strong> restar </strong> t seu PC. Em seguida, verifique se sua câmera está funcionando. </p> <p><img src=\"images/image_thumb-27-454.png\" alt=\"Roll Back Driver - Camera\" loading=\"lazy\"></p> <p> </p> <p> B. Se sua câmera nunca funcionou antes, ou se é a primeira vez que você experimenta sua câmera (por exemplo, após uma nova instalação do Windows), tente o seguinte nesta ordem: </p> <ol> <li> Clique no <strong> Atualizar driver </strong> opção, para verificar se há um driver atualizado de sua câmera. Se o Windows encontrar um novo driver, instale-o e verifique sua webcam. Por outro lado… </li> <li> Clique <strong> Desinstalar dispositivo </strong> para desinstalar a webcam e então <strong> reiniciar </strong> seu PC. Após reiniciar, verifique se sua câmera está funcionando. Se não… </li> <li> Navegue até o site de suporte do fabricante do laptop e verifique se está disponível um novo driver para a sua webcam e instale-o. </li> </ol> </blockquote> <h3> Ajuda adicional para corrigir problemas de câmera no Windows 10. </h3> <p> Se você ainda tiver problemas com sua webcam após as etapas acima, tente o seguinte: </p> <ol> <li> <p> Instale todas as atualizações disponíveis do Windows 10 ( <strong> Começar </strong> -&gt; <strong> Definições </strong> -&gt; <strong> Atualização e segurança </strong> e clique <strong> Verifique se há atualizações). </strong></p> </li> <li> <p> Atualize o Windows 10 para a versão mais recente usando o <strong> Assistente de atualização. </strong> (Para fazer isso, navegue até este <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"noopener\"><strong> link </strong></a> e clique no <strong> Atualize agora </strong> botão). </p> </li> <li> <p><a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"noopener\"><strong> Atualize o Windows 10 </strong> . </a></p> </li> </ol> <p> Isso é tudo, pessoal! Isso funcionou para você? Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}