{"title":"Como localizar a (s) pasta (s) de inicialização no Windows 10/8/7.","content":"<p> A pasta de inicialização no Windows, é o local onde são armazenados todos os atalhos de aplicativos que iniciam com o Windows. Existem duas pastas de inicialização diferentes no Windows: há uma pasta de inicialização que contém todos os aplicativos executados para todos os usuários, e há uma pasta de inicialização diferente, que contém apenas os aplicativos executados para o usuário atual. </p> <p> Este tutorial contém instruções sobre como localizar as pastas de inicialização no sistema operacional Windows 10, 8 ou 7, a fim de gerenciar (adicionar ou remover) os aplicativos que começam com o Windows. </p> <h4> Como visualizar a (s) pasta (s) de inicialização do Windows - Programas. * </h4> <p> * Nota: Se quiser gerenciar os aplicativos de inicialização (Store Apps) no Windows 10, navegue até: </p> <ul> <li> Vamos para <strong> Começar </strong> cardápio <img src=\"images/image_thumb-98-474.png\" alt=\"image\" loading=\"lazy\"> , clique <strong> Definições </strong> <img src=\"images/image_thumb-150-181.png\" alt=\"image\" loading=\"lazy\"> e então clique <strong> Apps </strong> -&gt; <strong> Comece. </strong></li> </ul> <p><img src=\"images/image_thumb-95-680.png\" alt=\"manage startup apps windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Para navegar até a pasta de inicialização &quot;Todos os usuários&quot;. </h6> <p> Se você deseja localizar a pasta que contém todos os aplicativos que são executados automaticamente na inicialização do Windows, <strong> para todas as contas de usuário </strong> , abra o Windows Explorer e navegue até o seguinte caminho: * </p> <ul> <li><strong> C: \\ ProgramData \\ Microsoft \\ Windows \\ Menu Iniciar \\ Programas \\ Iniciar </strong></li> </ul> <p> * Nota: Para ver o &quot; <strong> Dados do Programa </strong> &quot;pasta no Windows Explorer, você deve <a href=\"https://www.repairwin.com/how-to-view-hidden-files-in-windows-8-7-vista-xp/\" target=\"_blank\" rel=\"nofollow noopener\"> habilitar a visualização de arquivos ocultos </a> . </p> <p><strong> GORJETA: </strong> Para tornar sua vida mais fácil, você pode usar a seguinte maneira de navegar até o local acima: </p> <ol> <li> <ol> <li> Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-770.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. </li> <li> Na caixa de pesquisa, digite: <strong> shell: inicialização comum </strong> e clique <strong> OK </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb-91-505.png\" alt=\"How to Locate the Startup Folder for All Accounts (Users)\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Para navegar até a pasta de inicialização &quot;Conta atual&quot;. </h6> <p> Se você deseja localizar a pasta de inicialização que contém todos os aplicativos que são executados automaticamente na inicialização do Windows, <strong> para a conta de usuário atual </strong> (apenas), abra o Windows Explorer e navegue até o seguinte caminho: * </p> <ul> <li><strong> C: \\ Usuários \\\\ AppData \\ Roaming \\ Microsoft \\ Windows \\ Menu Iniciar \\ Programas \\ Inicializar </strong></li> </ul> <p> * Nota: Para ver o &quot; <strong> Dados do aplicativo </strong> &quot;pasta no Windows Explorer, você deve <a href=\"https://www.repairwin.com/how-to-view-hidden-files-in-windows-8-7-vista-xp/\" target=\"_blank\" rel=\"nofollow noopener\"> habilitar a visualização de arquivos ocultos </a> . </p> <p><strong> GORJETA: </strong> Aqui está outra maneira mais fácil de navegar no local acima: </p> <ol> <li> <ol> <li> Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-671.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. </li> <li> Na caixa de pesquisa, digite: <b> shell: startup </b> e clique <strong> OK </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb-92-234.png\" alt=\" How to Locate the Startup Folder for current Account\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo! Isso funcionou para você? </p> <p> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}