{"title":"CORREÇÃO: Erro de código 32 na CPU Intel - Um driver (serviço) para este dispositivo foi desabilitado. (Resolvido)","content":"<p> Este tutorial contém instruções para corrigir o código de erro 32 do Gerenciador de dispositivos no dispositivo de CPU Intel: &quot;Um driver (serviço) para este dispositivo foi desativado. Um driver alternativo pode estar fornecendo esta funcionalidade. (Código 32)&quot; </p> <p><img src=\"images/image_thumb-21-979.png\" alt=\"FIX Code 32 on Intel CPU - A driver (service) for this device has been disabled\" loading=\"lazy\"></p> <p> </p> <p> O erro &quot;Código 32&quot; no gerenciador de dispositivos, geralmente indica um problema de hardware no dispositivo ou um problema no driver do dispositivo. Para resolver o erro &quot;Um driver (serviço) para este dispositivo foi desativado&quot; no dispositivo de CPU Intel, siga as instruções abaixo. </p> <h4> Como consertar: CÓDIGO DE ERRO DE GERENCIADOR DE DISPOSITIVO 32 no dispositivo de CPU Intel. * </h4> <p> * Notas: <br> 1. Antes de continuar com os métodos abaixo, instale as atualizações mais recentes do Windows e instale os drivers do chipset Intel mais recentes do site de suporte do fabricante do computador. <br> 2. Se você receber o erro &quot;Código 32&quot; em um laptop, tente ligá-lo com um adaptador de alimentação diferente e verifique se o erro persiste. </p> <h6> Método 1. Desinstale e reinstale os processadores Intel CPU. </h6> <p> 1 Pressione &quot; <strong> janelas </strong> &quot;+&quot; <strong> R </strong> &quot;para abrir a janela RUN. <br> 2. Na caixa &quot;Abrir&quot; da janela &quot;EXECUTAR&quot;, digite: <strong> devmgmt.msc </strong> &amp; Aperte <strong> Entrar. </strong></p> <p><img src=\"images/image_thumb-18-504.png\" alt=\"devmgmt.msc\" loading=\"lazy\"></p> <p> </p> <p> 3. No Gerenciador de Dispositivos, expanda <strong> Processadores. </strong><br> 4. Clique com o botão direito em cada dispositivo de CPU Intel e clique <strong> Desinstalar dispositivo </strong> . * </p> <p> * Nota: Quando solicitado a &quot;Reiniciar o computador&quot;, pergunte &quot;Não&quot; e continue a desinstalar todos os processadores Intel listados. </p> <p><img src=\"images/image_thumb-19-511.png\" alt=\"FIX Code 32 on Intel CPU\" loading=\"lazy\"></p> <p> 5. Quando terminar, <strong> reiniciar </strong> o computador e verifique se o código de erro 32 no gerenciador de dispositivos desapareceu. </p> <p> </p> <h6> Método 2. Habilite o serviço Intel Power Management no Registro. </h6> <p> O próximo método para resolver o código de erro 32 nas CPUs da Intel é habilitar o serviço &#39;Intel Power Management&#39; usando o editor de registro. Fazer isso: </p> <p> 1. Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-871.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Na caixa &quot;Abrir&quot;, digite: <strong> regedit </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb7-820.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Navegue até esta chave no painel esquerdo: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ intelppm </strong></li> </ul> <p> 4. À direita, abra o <strong> Começar </strong> valor. <br> 5. Altere os dados do valor de 4 para <strong> 1 </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-20-525.png\" alt=\"Enable Intel Power Management service in Registry\" loading=\"lazy\"></p> <p> </p> <p> 6. Feche o editor de registro e <strong> reiniciar </strong> seu PC. </p> <p> Isso é tudo! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}