{"title":"Como desativar dispositivos de armazenamento USB no sistema operacional Windows 10/8/7.","content":"<p> Em algumas empresas, existe a necessidade de desabilitar os dispositivos de armazenamento USB, a fim de evitar que os funcionários copiem dados confidenciais da empresa, ou para evitar o risco de malware que pode ser executado de um dispositivo de armazenamento USB. </p> <p> Neste tutorial, você encontrará instruções sobre como desativar os dispositivos removíveis USB, como drives USB no sistema operacional Windows 10/8/7 ou no Windows Server 2016/2012. </p> <h2> Como desativar o acesso a drives USB no Windows. </h2> <h3> Método 1. Desative os dispositivos de armazenamento USB do registro. </h3> <p> * Observação: este método funciona em todas as edições do Windows 10, 8 ou 7 (Home e Professional) e nas versões do Windows Server. </p> <p> Para bloquear drives USB no Windows usando o Registro: </p> <p> 1. Pressione simultaneamente o Windows <img src=\"images/image_thumb36-173.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite <strong> regedit </strong> &amp; Aperte <strong> Entrar. </strong></p> <p><img src=\"images/image_thumb7-312.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Navegue até a seguinte chave no painel esquerdo: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ UsbStor </strong></li> </ul> <p> 4. No painel direito, clique duas vezes em <strong> Começar </strong> valor. </p> <p><img src=\"images/image_thumb-47-900.png\" alt=\"How to Disable USB Storage Devices - Registry\" loading=\"lazy\"></p> <p> </p> <p> 5. Altere os dados do valor de 3 para <strong> 4 </strong> e clique <strong> OK. * </strong></p> <p> * Observação: altere esses dados de valor de volta para <strong> 3 </strong> , e os dispositivos de armazenamento USB serão habilitados novamente. </p> <p><img src=\"images/image_thumb-48-559.png\" alt=\"Disable USB Drive \" loading=\"lazy\"></p> <p> </p> <p> 6. Feche o Editor do Registro e <strong> desconectar </strong> quaisquer unidades USB. * </p> <p> * Nota: A restrição não funciona para unidades USB já conectadas. </p> <p> 7 <strong> Reiniciar </strong> seu PC. <br> 8. A partir de agora, todas as unidades USB estão bloqueadas e não estarão acessíveis, com o erro: &quot; <em> Localização não disponível. A unidade não está acessível. Acesso negado </em> &quot;. * </p> <p><img src=\"images/image_thumb-53-502.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h3> Método 2. Desabilite o acesso a discos USB usando a Política de Grupo. * </h3> <p> * Nota: Este método funciona nas versões do Windows 10, 8 ou 7 Professional e nas versões do Windows Server. </p> <p> Para impedir o acesso a todos os dispositivos de armazenamento removíveis no Windows usando a política: </p> <p> 1. Pressione simultaneamente o Windows <img src=\"images/image_thumb36-342.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite <strong> gpedit.msc </strong> &amp; Aperte <strong> Entrar. </strong></p> <p><img src=\"images/image_thumb-78-178.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. No painel esquerdo, navegue até: </p> <ul> <li><strong> Configuração do computador&gt; Modelos administrativos&gt; Sistema&gt; <strong> Acesso de armazenamento removível </strong></strong></li> </ul> <p> 4. No painel direito, abra o <strong> Discos removíveis: negar acesso de leitura </strong> política. </p> <p><img src=\"images/image_thumb-51-107.png\" alt=\"Block USB Storage Devices - Policy\" loading=\"lazy\"></p> <p> </p> <p> 5. Defina a configuração da política para <strong> Habilitado </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-52-585.png\" alt=\"Disable Removable Storage Access\" loading=\"lazy\"></p> <p> </p> <p> 6. Feche o Editor de Política de Grupo e <strong> desconectar </strong> quaisquer unidades USB conectadas. * </p> <p> * Nota: A restrição não funciona para unidades USB já conectadas. </p> <p> 7 <strong> Reiniciar </strong> seu PC. <br> 8. Após reiniciar, se você conectar um dispositivo de armazenamento USB e tentar acessá-lo, receberá o erro: &quot; <em> Localização não disponível. A unidade não está acessível. Acesso negado </em> &quot;. * </p> <p> Isso é tudo, pessoal! Qual método funcionou para você? Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}