{"title":"CORREÇÃO: Menu Iniciar do Windows 10, Configurações, Cortana ou Barra de Tarefas não funcionam. (Resolvido)","content":"<p> Este tutorial contém instruções para corrigir os seguintes problemas no Windows 10: O menu Iniciar não abre, o Cortana Search não funciona, o aplicativo Configurações não é iniciado, os ícones da barra de tarefas não são abertos. </p> <p> Muitos usuários do Windows 10 relataram problemas com o menu Iniciar, Barra de Tarefas, Cortana e Configurações, portanto, neste guia, listo os métodos mais comuns para resolver os problemas acima. </p> <h2> Como CORRIGIR: Barra de Tarefas do Windows 10, Menu Iniciar, Configurações ou Problemas com a Cortana. </h2> <h3> Método 1. Desinstale a última atualização do Windows 10. </h3> <p> Muitos usuários relataram que os problemas mencionados neste artigo foram resolvidos após a desinstalação <strong><a href=\"https://support.microsoft.com/en-us/topic/august-11-2020-kb4566782-os-build-19041-450-ec5cf4b6-86ed-b0d3-539c-5fbe1b17f56a\" target=\"_blank\" rel=\"nofollow noopener\"> KB4566782 </a></strong> Atualizar. </p> <p> Se você não conseguir encontrar a atualização KB4566782 na lista de atualizações instaladas, verifique e instale todas as atualizações disponíveis e, se o problema persistir, tente <strong><a href=\"https://www.repairwin.com/how-to-uninstall-updates-in-windows-10/#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> desinstale a (s) atualização (ões) mais recente (s) instalada (s). </a></strong></p> <h3> Método 2. Reinicie o Windows 10 no Modo de Segurança. </h3> <p> 1. Pressione o Windows <img src=\"images/image_thumb8_thumb_thumb-268.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite <strong> msconfig </strong> e pressione <strong> Entrar </strong> . </p> <p><img src=\"images/image_thumb-47-537.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. Em <strong> Bota </strong> guia selecione o <strong> Inicialização segura </strong> opção e clique em <strong> OK </strong> e reinicie o seu computador. </p> <p><img src=\"images/image_thumb-48-665.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 4. Após reiniciar e no modo de segurança, verifique se os problemas persistem. <br> 5. Em seguida, execute a ferramenta &#39;msconfig&#39; novamente e no <strong> Em geral </strong> guia, verifique o <strong> Inicialização normal </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-859.png\" alt=\"normal startup windows\" loading=\"lazy\"></p> <p> 6 <strong> Reiniciar </strong> seu computador. <br> 7. Após reiniciar, verifique se o problema persiste, caso contrário, passe para o próximo método. </p> <p> </p> <h2> Método 3. Execute uma inicialização limpa. </h2> <p> 1. Execute a ferramenta &#39;msconfig&#39;. <br> 2. Na guia Serviços, <strong> Verifica </strong> a <strong> Ocultar todos os serviços Microsoft </strong> caixa de seleção e pressione <strong> Desativar tudo </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-333.png\" alt=\"clean boot windows\" loading=\"lazy\"></p> <p> </p> <p> 3. Em seguida, selecione o <strong> Comece </strong> guia e clique <strong> Abra o Gerenciador de Tarefas. <br> </strong> 4 <strong> </strong> Selecione um por um todos os programas listados e clique em <strong> Desativar. </strong></p> <p><img src=\"images/image_thumb-1-399.png\" alt=\"clean boot windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Quando terminar, feche a janela e clique em <strong> OK </strong> no utilitário &#39;Configuração do Sistema&#39; para <strong> Reiniciar </strong> seu computador. <br> 6. Após reiniciar, se o seu computador estiver funcionando bem e sem problemas, * abra o utilitário &#39;Configuração do Sistema&#39; (msconfig) novamente e habilite um por um todos os programas desabilitados e reinicie o seu PC, até descobrir qual programa causa o problema. </p> <p> * Observação: se o problema persistir, mesmo no estado de inicialização limpa, passe para o próximo método. </p> <h3> Método 4. Reinstale e registre novamente todos os aplicativos integrados do Windows 10. </h3> <p> O próximo método para resolver problemas com a barra de tarefas, menu Iniciar, Cortana, etc. no Windows 10, é reinstalar e registrar novamente todos os aplicativos integrados. </p> <p> 1. Abra o PowerShell como administrador. Fazer isso: </p> <blockquote><p> 1. Em <strong> Cortana </strong> caixa de pesquisa de, digite <strong> PowerShell <br> </strong> 2. Clique com o botão direito em <strong> Windows PowerShell </strong> resultado e selecione <strong> Executar como administrador. </strong></p></blockquote> <p><img src=\"images/image_thumb-51-691.png\" alt=\"FIX: Windows 10 Start Menu, Settings, Cortana or Taskbar icons Not Working.\" loading=\"lazy\"></p> <p> </p> <p> 3. No PowerShell, digite (copiar e colar) o seguinte comando e pressione <strong> Entrar </strong> : </p> <ul> <li> Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register &quot;$ ($ _. InstallLocation) \\ AppXManifest.xml&quot;} </li> </ul> <p><img src=\"images/image_thumb-2-985.png\" alt=\"register re-install windows 10 apps\" loading=\"lazy\"></p> <p> 4. Aguarde a execução do comando e ignore os erros (em letras vermelhas). <br> 5 <strong> Reiniciar </strong> seu computador e, em seguida, verifique se o problema foi corrigido. </p> <p> </p> <h3> Método 5. Crie uma nova conta. </h3> <p> Outro método para corrigir vários problemas no Windows 10 é criar uma nova conta e transferir seus arquivos pessoais e dados para a nova conta. Fazer isso: </p> <p> 1. Abra <strong> Prompt de comando como administrador </strong> . <br> 2. No prompt de comando, digite o seguinte comando e pressione <strong> Entrar </strong> : </p> <ul> <li><strong> senha da conta do usuário líquido / adicionar </strong></li> </ul> <p> * Nota: No comando acima substitua os campos &quot;conta&quot; e &quot;senha&quot;, com sua escolha. </p> <p> por exemplo. se você deseja criar uma nova conta com o nome de usuário &quot;Admin1&quot; e a senha &quot;Admin123&quot;, digite: <em> net user Admin1 Admin123 / add </em></p> <p><img src=\"images/image_thumb-3-388.png\" alt=\"add user windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Em seguida, prossiga e adicione a nova conta, ao grupo Administradores, com este comando: </p> <ul> <li><strong> net localgroup administrators account / add </strong></li> </ul> <p> por exemplo. Em nosso exemplo, o comando é: <em> administradores de grupo local da rede Admin1 / add </em></p> <p><img src=\"images/image_thumb-4-429.png\" alt=\"fix windows 10 start menu, cortana, settings\" loading=\"lazy\"></p> <p> </p> <p> 4. Feche a janela do prompt de comando e <strong> reiniciar </strong> seu computador. <br> 5. Depois de reiniciar o login com a nova conta. <br> 6. Verifique se o problema persiste. Se o problema for corrigido, transfira seus dados e arquivos para a nova conta e pronto. </p> <p> </p> <h3> Método 6. Reparar o Windows 10. </h3> <p> O método final para resolver os problemas do Windows 10 é <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> reparar o Windows 10 com atualização in-loco </a> . </p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}