{"title":"CORRECÇÃO: A Conexão de Área de Trabalho Remota do Mac OS não pode verificar a identidade do computador ao qual você deseja se conectar. (Resolvido)","content":"<p> Neste tutorial, você encontrará instruções para resolver o problema &quot;A conexão de área de trabalho remota não pode verificar a identidade do computador ao qual deseja se conectar. Tente reconectar ao computador baseado no Windows ou entre em contato com nosso administrador.&quot;, Ao tentar conectar-se por RDP de um computador com Mac OS a um Windows RDSH Server 2016. </p> <p><img src=\"images/image_thumb-32-846.png\" alt=\"FIX: MAC OS Remote Desktop Connection cannot verify the identity of the computer that you want to connect to.\" loading=\"lazy\"></p> <p> </p> <h4> Como CORRIGIR: A conexão MacOSX Remote Desktop não pode verificar a identidade do computador ao qual você deseja se conectar. </h4> <h6> Método 1. Baixe o RDP Client mais recente da MAC App Store. </h6> <p> 1. Baixe e instale o mais recente <a href=\"https://itunes.apple.com/us/app/microsoft-remote-desktop/id715768417?mt=12&ign-mpt=uo%3D4\" target=\"_blank\" rel=\"nofollow noopener\"> Cliente Microsoft Remote Desktop </a> no seu MAC. (Se você estiver usando um dispositivo IOS, baixe o cliente RDP de <a href=\"https://itunes.apple.com/us/app/microsoft-remote-desktop/id714464092?mt=8&ign-mpt=uo%3D4\" target=\"_blank\" rel=\"nofollow noopener\"> aqui </a> .) <br> 2. Após a instalação, tente se conectar novamente ao Windows RDP Server. Se o problema persistir, vá para o método 2 abaixo. </p> <p> </p> <h6> Método 2. Modifique as configurações de política de grupo no servidor RDSH do Windows. </h6> <p> No Remote Desktop Session Host Server (RDSH) 2016, modifique a política de grupo da seguinte forma: </p> <p> 1. Pressione simultaneamente o Windows <img src=\"images/image_thumb36-211.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite <strong> gpedit.msc </strong> &amp; Aperte <strong> Entrar. </strong></p> <p><img src=\"images/image_thumb-78-784.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. No painel esquerdo, navegue até: </p> <ul> <li><strong> Configuração do Computador </strong> &gt; <strong> Modelos Administrativos </strong> &gt; <strong> Componentes do Windows </strong> &gt; <strong> Serviços de trabalho remoto </strong> &gt; <strong> Host de sessão de área de trabalho remota </strong> &gt; <strong> Segurança </strong></li> </ul> <p> 4. No painel direito, abra o <strong> Requer o uso de uma camada de segurança específica para conexões remotas (RDP) </strong> contexto. </p> <p><img src=\"images/image_thumb-36-865.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4a. Verificar <strong> Habilitado </strong> , defina a &#39;Camada de Segurança&#39; para <strong> RDP </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-37-183.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Agora, abra o <strong> Exigir autenticação de usuário para conexões remotas usando autenticação de nível de rede </strong> configuração, defina-o para <strong> Desativado </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-38-109.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6 <strong> Perto </strong> o Editor de política de grupo. <br> 7 <strong> Reiniciar </strong> o computador para aplicar as alterações ou abrir um prompt de comando elevado e dar o seguinte comando: </p> <ul> <li><strong> gpupdate / force </strong></li> </ul> <p> É isso! Qual método funcionou para você? <br> Deixe-me saber se este guia o ajudou, deixando um comentário sobre sua experiência. Por favor, curta e compartilhe este guia para ajudar outras pessoas. </p>"}