{"title":"Como desativar o BitLocker no Windows 10.","content":"<p> Este tutorial contém instruções sobre como desabilitar a proteção do Bitlocker e a criptografia da unidade no Windows 10. Como você deve saber, o recurso de criptografia do BitLocker, disponível nas versões profissional e empresarial do Windows 10, pode ajudá-lo a proteger o conteúdo do PC contra acesso não autorizado. Mas às vezes é necessário desabilitar o Bitlocker no Windows 10, então neste guia você pode descobrir como fazer isso. </p> <p> Se o seu computador estiver protegido com BitLocker, quando você iniciar o sistema, será solicitado que você conecte a unidade USB usada durante a ativação do BitLocker ou insira sua senha do BitLocker para desbloquear a unidade C: a fim de continuar a inicialização. Se você não tiver nenhum desses, pressione <strong> ESC </strong> para inserir sua chave de recuperação do BitLocker. * </p> <blockquote><p> * Notas: <br> 1. Se a chave ou senha de recuperação do Bitlocker não for aceita na inicialização do sistema, tente desbloquear e descriptografar o disco rígido para outro computador Windows 10 ou tente: <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-recovery-environment-winre/\" target=\"_blank\" rel=\"nofollow noopener\"> Desbloqueie e descriptografe a unidade protegida no ambiente de recuperação do Windows (WinRE). </a><br> 2. Se você não consegue desbloquear a unidade (por exemplo, se não possui a chave de recuperação do BitLocker ou porque a chave do BitLocker não é aceita) e deseja remover a criptografia do BitLocker para usar a unidade protegida novamente, leia este tutorial: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Como remover a proteção do BitLocker de uma unidade sem a chave ou senha de recuperação do BitLocker </a> . </p></blockquote> <p><img src=\"images/image_thumb-53-752.png\" alt=\"How to Disable BitLocker in Windows 10 GUI - PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Após inicializar no Windows, siga as instruções abaixo para desativar a proteção do bitlocker e descriptografar a unidade. </p> <h4> Como desativar a proteção do BitLocker e descriptografar uma unidade criptografada do Bitlocker no Windows 10. </h4> <p> Para desligar a proteção do Bitlocker, você deve ter a senha do Bitlocker ou a chave de recuperação do bitlocker para desbloquear a unidade primeiro e, em seguida, descriptografar a unidade. </p> <p> A chave de recuperação do Bitlocker é uma chave numérica de 48 dígitos e pode ser encontrada nos seguintes locais: </p> <ul> <li> Em uma impressão que você salvou, quando ativou o Bitlocker. </li> <li> Em uma unidade USB que você usou, durante a ativação do Bitlocker para salvar a chave de recuperação do Bitlocker. </li> <li> No <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Chaves de recuperação de conta da Microsoft </a> , usando a conta do MS que você usou para fazer login no seu dispositivo, ou você adicionou ao dispositivo para baixar aplicativos da Microsoft Store, ou para ativar o MS Office ou para e-mail. </li> <li> Nas suas <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Conta Azure </a> para PCs de trabalho que fazem login com uma conta do Azure Active Directory. </li> </ul> <p> Depois de encontrar a chave de recuperação do Bitlocker ou a senha do bitlocker, prossiga para desbloquear a unidade criptografada do Bitlocker e remover a criptografia do Bitlocker usando uma das seguintes maneiras: </p> <ul> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Método 1. Desative a proteção do BitLocker na GUI do Windows. </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Método 2. Desative o BitLocker e descriptografe uma unidade criptografada do Bitlocker do PowerShell. </a></li> </ul> <p> </p> <h6> Método 1. Como desativar a proteção do Bitlocker no Windows 10 GUI. </h6> <p> Para desativar a proteção em seu System Drive C: </p> <p> 1. Navegue para o Windows <strong> Painel de controle </strong> -&gt; <strong> Sistema e Segurança </strong> e então clique <strong> Criptografia de unidade bitlocker </strong> . </p> <p><img src=\"images/image_thumb-33-233.png\" alt=\"How to turn off or Turn Onn BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Ao lado da unidade do sistema operacional C :, clique em <strong> Desligue o BitLocker </strong> . * </p> <p> * Notas: <br> 1. Se a opção &quot;Desligar BitLocker&quot; não estiver disponível, abra <strong> prompt de comando como administrador </strong> e dê o seguinte comando: </p> <ul> <li> manage-bde -off C: </li> </ul> <p> 2. Para ver o status de descriptografia (progresso) da unidade C :, dê este comando: </p> <ul> <li> manage-bde -status C: </li> </ul> <p> </p> <p> </p> <p><img src=\"images/image_thumb-43-236.png\" alt=\"turn off bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Após desligar o Bitlocker, clique no ícone do Bitlocker na barra de tarefas para visualizar o processo de descriptografia. </p> <p><img src=\"images/image_thumb-41-694.png\" alt=\"remove bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Para desativar a proteção em qualquer outra unidade protegida por BitLocker da GUI do Windows: </p> <p> 1. Abra o Windows Explorer e clique duas vezes na unidade bloqueada. <br> 2. Digite a senha do Bitlocker ou clique em <strong> Mais opções </strong> para inserir a chave de recuperação do Bitlocker, a fim de desbloquear a unidade. </p> <p><img src=\"images/image_thumb-47-646.png\" alt=\"unlock bitlocker windows 10\" loading=\"lazy\"></p> <p> 2. Depois de desbloquear a unidade, navegue até <strong> Painel de controle </strong> -&gt; <strong> Sistema e Segurança </strong> -&gt; <strong> Criptografia de unidade bitlocker </strong> e depois de selecionar o drive clique <strong> Desligue o BitLocker </strong> para descriptografar a unidade. (veja as imagens acima) </p> <p> </p> <h6> Método 2. Como DESATIVAR a proteção do BitLocker e descriptografar uma unidade criptografada com Bitlocker do PowerShell no Windows 10. </h6> <p> 1. Abra o PowerShell como administrador. Fazer isso: </p> <ol> <li> <ol> <li> No <strong> Cortana </strong> Caixa de pesquisa, digite <strong> PowerShell </strong></li> <li> Clique com o botão direito em <strong> Windows PowerShell </strong> resultado e selecione <strong> Executar como administrador. </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb_thumb-1-316.png\" alt=\"disable bitlocker powershell windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Em seguida, verifique o status de criptografia de cada unidade em seu computador, digitando este comando: </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p> </p> <p> 3. Observe em qual letra da unidade o Status de bloqueio mostra <strong> Trancado </strong> e prossiga para desbloquear essa unidade, digitando este comando: * </p> <ul> <li><strong> manage-bde -unlock drive-letter: -rp BitLocker-recovery-key </strong></li> </ul> <p> * ex .: Se você deseja desbloquear a unidade &quot;D:&quot; e a chave de recuperação do bitlocker é: &quot;123456-123456-123456-123456-123456-123456&quot;, digite: </p> <ul> <li> <ul> <li> manage-bde -unlock D: -rp 123456-123456-123456-123456-123456-123456 </li> </ul> </li> </ul> <p> </p> <p> * Nota: Se você souber a senha do Bitlocker, dê este comando: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -pw BitLocker-Password </strong></li> </ul> <p> * por exemplo: se você deseja desbloquear a unidade &quot;D:&quot; e a senha do BitLocker é: &quot;123qwerty&quot;, digite: * </p> <ul> <li> <ul> <li> manage-bde -unlock D: -password 123qwerty </li> </ul> </li> </ul> <p> </p> <p> 4. Em seguida, desative a criptografia bitlocker e descriptografe a unidade criptografada, usando um dos seguintes comandos: </p> <ul> <li><strong> Disable-BitLocker -MountPoint &quot;letra da unidade:&quot; </strong></li> <li><strong> manage-bde -off drive-letter: </strong></li> </ul> <p> * por exemplo: se você deseja desativar a criptografia bitlocker na unidade &quot;D:&quot;, digite: </p> <ul> <li> <ul> <li> Disable-BitLocker -MountPoint &quot;D:&quot; </li> </ul> </li> </ul> <blockquote> <p> OU digite ... </p> </blockquote> <ul> <li> <ul> <li> manage-bde –off D: </li> </ul> </li> </ul> <p> 5. Quando o processo de descriptografia for concluído, prossiga para verificar novamente o status da criptografia, dando este comando: </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p> 6. Se o &#39;Status de bloqueio&#39; for exibido <strong> Desbloqueado </strong> e o &#39;Status de conversão&#39; mostra <strong> Totalmente descriptografado, </strong> Você Terminou! </p> <p><img src=\"images/image_thumb-50-868.png\" alt=\"view bitlocker status\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar esse problema. </p>"}