{"title":"CORREÇÃO: a opção Instalar VMware Tools está acinzentada. (Resolvido)","content":"<p> Se você não puder instalar o VMware Tools no convidado operando porque a opção &quot;Instalar VMware Tools&quot; está desabilitada, continue lendo a seguir. O VMware Tools é um conjunto gratuito de serviços e módulos que permitem vários recursos na máquina virtual convidada, como desempenho gráfico mais rápido, desempenho aprimorado do mouse e o mais significativo: a capacidade de copiar e colar entre a máquina Host e a convidada. Portanto, embora o sistema operacional convidado possa ser executado sem as ferramentas VMware, as ferramentas VMware devem ser instaladas se você quiser habilitar os recursos extras do VMware. </p> <p> A maneira usual de instalar o VMware Tools é iniciar a máquina convidada e, a partir do menu &quot;Player&quot;, escolher <strong> Gerir </strong> &gt; <strong> Instale o VMware Tools </strong> . Mas, se você conectou a unidade de CD / DVD virtual da máquina virtual a um arquivo de imagem ISO quando instalou o sistema operacional, a opção &quot;Instalar VMware Tools&quot; fica esmaecida. </p> <p><img src=\"images/image_thumb-45-164.png\" alt=\"FIX VMware Tools option is Grayed Out\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contém instruções para corrigir o seguinte problema no VMware Workstation Player. A opção &quot;Instalar ferramentas VMware&quot; está esmaecida na máquina Convidada. </p> <h4> Como instalar o VMware Tools se a opção &#39;Instalar VMware Tools&#39; estiver acinzentada. </h4> <p> </p> <p> 1. Desligue a máquina virtual. <br> 2. Clique com o botão direito na máquina virtual e selecione <strong> Definições </strong> . </p> <p><img src=\"images/image_thumb-39-377.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Selecione o <strong> CD / DVD </strong> dirigir e clicar <strong> Remover </strong> . </p> <p><img src=\"images/image_thumb-43-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Em seguida, selecione o <strong> Mole </strong> dirija, clique <strong> Remover </strong> e então clique <strong> OK </strong> para fechar as opções de configuração. </p> <p><img src=\"images/image_thumb-44-469.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5 <strong> Começar </strong> a Máquina Virtual. <br> 6. No menu &#39;Player&#39;, selecione <strong> Gerir </strong> e clique <strong> Instale o VMware Tools. </strong></p> <p><img src=\"images/image_thumb-42-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> Isso é tudo! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}