{"title":"CORREÇÃO: velocidade lenta da CPU do laptop Dell Inspiron (resolvido)","content":"<p> Este tutorial contém instruções para corrigir o problema de velocidade muito lenta da CPU em um laptop Dell Inspiron 5558. Recentemente, um amigo meu trouxe seu laptop Dell para o meu laboratório porque de repente ele ficou muito lento. Na verdade, o laptop funcionava rápido no passado, mas agora leva muito tempo para carregar o sistema operacional (Windows 10) e os aplicativos. </p> <p> Depois de verificar o laptop, e como você pode ver na imagem abaixo, descobri que a CPU está sempre funcionando a 0,48 GHz em vez de 2,20 GHz. Então, comecei a solução de problemas e finalmente encontrei os dois métodos a seguir para resolver o problema de velocidade lenta da CPU ... </p> <p> (A velocidade da CPU foi reduzida em cerca de 85-87% em um laptop Dell) </p> <p><img src=\"images/image_thumb-16-354.png\" alt=\"FIX Dell Laptop Slow CPU Speed\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Como consertar o problema de velocidade lenta da CPU em um laptop Dell. </h4> <h6> Método 1. Substitua o Adaptador de Tensão AC. </h6> <p> O problema de baixa velocidade da CPU é um problema conhecido em laptops Dell, quando o adaptador de energia CA não é reconhecido corretamente pelo computador. Nesses casos, e mesmo se o adaptador de energia parecer funcionar bem, a seguinte mensagem de aviso é exibida quando você liga o laptop &quot;O tipo de adaptador de energia CA não pode ser determinado. Isso impedirá o desempenho ideal do sistema&quot;. </p> <p> Portanto, o primeiro método para resolver o problema de desempenho lento em seu laptop Dell é substituir o adaptador de energia por um novo adaptador de energia CA Dell compatível. </p> <p> </p> <h6> Método 2. PARE a aceleração da CPU com ThrottleStop. </h6> <p> Se o seu adaptador AC estiver funcionando bem e seu laptop não superaquecer, * então, outro método para corrigir o problema de desempenho lento do sistema em seu laptop Dell, é desabilitar o estrangulamento do adaptador de energia desconhecido, com o <strong><a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"> ThrottleStop </a></strong> Utilitário. Fazer isso: </p> <p> 1. Baixe o <a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> ThrottleStop </strong></a> utilitário e extraia o arquivo que você baixou. <br> 2. Na pasta extraída, clique duas vezes para executar o aplicativo &quot;ThorttleStop.exe&quot;. * <br> 3 <strong> Desmarque </strong> a <strong> BD PROCHOT </strong> *** caixa de seleção e clique em <strong> Salve  </strong> . </p> <p> * Notas: <br> 1. Para monitorar a temperatura da CPU, você pode usar o <a href=\"https://www.alcpu.com/CoreTemp/\" target=\"_blank\" rel=\"nofollow noopener\"> CoreTemp </a> programa. <br> 2. Se você receber o erro &quot;MFC120U.dll não foi encontrado&quot; ou &quot;MSVCR120.dll está ausente&quot;, após executar o ThrottleStop, prossiga e instale o <a title=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" href=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Pacotes redistribuíveis do Visual C ++ para Visual Studio 2013 </a> . ( <strong> Importante: </strong> Se você possui o Windows de 64 bits, precisa instalar as versões de 64 bits e 32 bits do pacote Visual C ++. <br> 3. BD PROCHOT significa prochot bidirecional. PROCHOT significa processador quente que é o sinal que é ativado dentro da CPU quando atinge aproximadamente 100C a 105C dependendo do número do modelo. Este sinal é o que inicia o afogamento térmico para que a CPU possa desacelerar e evitar superaquecimento. Desativar PROCHOT permitirá que sua CPU continue a funcionar em velocidade total. (Fonte: <a href=\"http://forum.notebookreview.com/threads/the-throttlestop-guide.531329/\" target=\"_blank\" rel=\"nofollow noopener\"> O Guia ThrottleStop </a> ) </p> <p><img src=\"images/image_thumb-20-666.png\" alt=\"FIX Slow CPU Speed with ThrottleStop\" loading=\"lazy\"></p> <p> 4. Feche o ThrottleStop e pronto. Agora a CPU funcionará em velocidade máxima, até que você reinicie ou desligue o laptop. * </p> <p> * Nota: Você deve executar o <strong> ThrottleStop </strong> programa toda vez que você inicia seu computador, se você deseja executar em velocidade total da CPU. Para tornar sua vida mais fácil, siga as etapas neste <a href=\"https://www.repairwin.com/how-to-start-throttlestop-at-windows-startup/\" target=\"_blank\" rel=\"nofollow noopener\"> guia </a> para iniciar automaticamente o ThrottleStop na inicialização do Windows. </p> <p><img src=\"images/image_thumb-21-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}