{"title":"CORREÇÃO: Redefinir o período de carência de 120 dias no servidor RDS 2016/2012.","content":"<p> Se você instalou um RDS Server 2016 para fins de teste e o período de cortesia de licenciamento RDS expirou, continue lendo abaixo para saber como redefinir o período de cortesia de 120 dias. Como você deve saber ao instalar o RDS Server 2016, você tem 120 dias para instalar as licenças de acesso de cliente RD (RD CALs), caso contrário os usuários não poderão mais estabelecer sessões RDP no servidor Host de Sessão RD, com o erro &quot;O remoto a sessão da área de trabalho foi desconectada porque não há servidores de licença de área de trabalho remota disponíveis para fornecer uma licença &quot;. </p> <p><img src=\"images/image_thumb-32-368.png\" alt=\"Reset 120 Days Grace Period on RDS Server 2012/2016\" loading=\"lazy\"></p> <p> </p> <h4> Como redefinir o período de carência de licenciamento RDS no Server 2012 ou 2016. * </h4> <p><strong> * Importante: </strong> Aplique as instruções abaixo, apenas se estiver usando o RDS Server 2016 em um ambiente de teste. Se você deseja usar o servidor RDS em um ambiente de produção, prossiga e compre RD CALs. </p> <p> Para estender o período de carência de 120 dias no servidor de licenciamento RDS: </p> <p> 1. Abra o Editor do Registro e navegue na seguinte chave: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Control \\ Terminal Server \\ RCM \\ GracePeriod </li> </ul> <p> 2. Clique com o botão direito na chave &#39;GracePeriod&#39; e selecione <strong> Permissões. </strong></p> <p><img src=\"images/image_thumb-33-473.png\" alt=\"Reset Grace Period RDS 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Em seguida, clique em <strong> Avançado </strong> . </p> <p><img src=\"images/image_thumb-34-585.png\" alt=\"Reset RDS Grace Period\" loading=\"lazy\"></p> <p> </p> <p> 4. Selecione o <strong> Administradores </strong> objeto e clique <strong> Editar </strong> . </p> <p><img src=\"images/image_thumb-18-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Altere as permissões para <strong> Controlo total </strong> e clique <strong> OK. </strong></p> <p><img src=\"images/image_thumb-19-737.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Clique com o botão direito no valor &quot;L $ RTMTIMEBOMB…&quot; e selecione <strong> Excluir </strong> . </p> <p><img src=\"images/image_thumb-35-208.png\" alt=\"Reset RDS Licensing Grace Pariod\" loading=\"lazy\"></p> <p> </p> <p> 7. Feche o Editor do Registro e reinicie o servidor RDS. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}