{"title":"CORREÇÃO: o servidor não está acessível. Você pode não ter permissão para usar este recurso de rede. O identificador é inválido. (Resolvido)","content":"<p> Este tutorial contém instruções para corrigir o seguinte erro ao tentar acessar uma pasta compartilhada na rede: &quot;O servidor não está acessível. Você pode não ter permissão para usar este recurso de rede. Entre em contato com o administrador deste servidor para descobrir se você tem acesso permissões. O identificador é inválido. &quot; </p> <p><img src=\"images/image_thumb-5-437.png\" alt=\"You might not have permission to use this network resource\" loading=\"lazy\"></p> <p> </p> <h2> Como CORRIGIR: Não é possível acessar a pasta compartilhada. Você pode não ter permissão para usar este recurso de rede. O identificador é inválido. </h2> <p> Normalmente, o problema de conexão de compartilhamento de arquivo &quot;Você pode não ter permissão para usar este recurso de rede&quot; aparece quando um usuário tenta acessar uma pasta compartilhada de rede, sem ter as permissões necessárias. Neste caso, e para resolver o problema, você deve garantir que o usuário tenha as permissões de acesso apropriadas na pasta compartilhada. </p> <p> No entanto, se você sabe que as permissões do usuário na pasta compartilhada estão corretas e o problema de conexão &quot;Você pode não ter permissão para usar este recurso de rede&quot; apareceu repentinamente e sem motivo óbvio, então o problema provavelmente se deve à instalação de um Windows Atualizar. Neste caso, continue lendo abaixo para corrigir o problema. </p> <p> * Observação: se você enfrentar o erro de compartilhamento em meados de janeiro de 2019, o culpado será a seguinte atualização de segurança do Windows: <a href=\"https://support.microsoft.com/el-gr/help/4480970/windows-7-update-kb4480970\" target=\"_blank\" rel=\"nofollow noopener\"> 8 de janeiro de 2019 - KB4480970 (conjunto mensal) </a> . </p> <h6> Método 1. Desinstale a última atualização do Windows. </h6> <p> Na máquina com a pasta compartilhada: </p> <p> 1. Clique com o botão direito no ícone &#39;Meu Computador&#39; e selecione <strong> Propriedades </strong> . <br> 2. Clique <strong> atualização do Windows </strong> . </p> <p><img src=\"images/image_thumb-6-686.png\" alt=\"fix Network Shared Folder is Not Accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. Clique <strong> Atualizações instaladas </strong> . </p> <p><img src=\"images/image_thumb-7-999.png\" alt=\"fix cannot access shared folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Classifique as atualizações pela data de instalação, clicando em <strong> Instalado em. </strong></p> <p><img src=\"images/image_thumb-8-158.png\" alt=\"uninstall windows update\" loading=\"lazy\"></p> <p> </p> <p> 5. Realce a atualização mais recente instalada para Windows e clique em <strong> Desinstalar. </strong> * </p> <p> * por exemplo. Se você enfrentar o erro de compartilhamento em meados de janeiro de 2019, prossiga e desinstale a &quot;Atualização de segurança para Microsoft Windows KB4480970&quot;. </p> <p><img src=\"images/image_thumb-9-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Quando a instalação for concluída, <strong> reiniciar </strong> o computador. <br> 7. Após reiniciar, tente novamente acessar a pasta compartilhada na máquina cliente. Em seguida, aplique as ações sugeridas de acordo com o seu caso: </p> <ul> <li><strong> Caso A: </strong> Se o problema persistir, prossiga para desinstalar todas as últimas atualizações instaladas ou continue para <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> método 2 </a> abaixo de. </li> <li><strong> Caso B: </strong> Se o problema for resolvido, evite que a atualização removida seja instalada no futuro. Fazer isso: </li> </ul> <blockquote><p> 1. Navegue até o Windows Update e <strong> Verifique se há atualizações </strong> . <br> 2. Clique em <strong> Atualizações Importantes </strong> . </p></blockquote> <p><img src=\"images/image_thumb-22-393.png\" alt=\"view important updates\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 3. Clique com o botão direito na atualização problemática e clique em <strong> Ocultar atualização </strong> . <br> 4. Finalmente clique <strong> OK </strong> e feche o Windows Update. </p></blockquote> <p><img src=\"images/image_thumb-23-795.png\" alt=\"hide update windows 7\" loading=\"lazy\"></p> <h6> Método 2. Restaure seu PC a um estado de funcionamento anterior. </h6> <p> Na máquina com a pasta compartilhada: </p> <p> 1. Pressione Windows <img src=\"images/image_thumb8_thumb-632.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite <strong> rstrui </strong> e clique <strong> OK </strong> para iniciar a Restauração do sistema. </p> <p><img src=\"images/rstui-1-300x148-611.png\" alt=\"rstui\" loading=\"lazy\"></p> <p> </p> <p> 3. Clique <strong> Próximo </strong> na primeira tela. <br> 4. Escolha um estado de trabalho anterior (Data / Hora) e clique em <strong> Próximo </strong> para iniciar o processo de restauração. </p> <p><img src=\"images/image_thumb-50-355.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Após a restauração do sistema, tente acessar novamente a pasta compartilhada na máquina cliente. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar esse problema. </p>"}