{"title":"Como compartilhar arquivos e pastas no sistema operacional Windows 10, 8.1 ou 7.","content":"<p> O recurso Compartilhamento de Arquivos do Windows oferece a capacidade de compartilhar pastas e arquivos facilmente entre os usuários da rede. Ao compartilhar seus arquivos com outros usuários na mesma rede, você poderá ver e trabalhar com os mesmos arquivos / pastas. </p> <p> Este tutorial contém instruções sobre como compartilhar pastas e / ou arquivos nos sistemas operacionais Windows 10, 8, 8.1 ou 7. </p> <h4> Como ativar o compartilhamento de arquivos no Windows. </h4> <h5> Etapa 1. Adicionar usuários necessários ao seu PC. </h5> <p> Antes de continuar a compartilhar seus arquivos com outras pessoas, adicione os usuários que terão acesso à pasta compartilhada no computador. Para realizar essa tarefa, siga as instruções dos artigos a seguir, de acordo com a sua versão do Windows. </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-create-a-new-user-in-windows-7\" target=\"_blank\" rel=\"nofollow noopener\"> Como adicionar um novo usuário no Windows 7. </a></li> <li><a href=\"https://www.repairwin.com/how-to-add-a-new-user-account-in-windows-10-8/\" target=\"_blank\" rel=\"nofollow noopener\"> Como adicionar um novo usuário no Windows 10 / 8.1 </a></li> </ul> <p> </p> <h5> Etapa 2. Como compartilhar uma pasta ou arquivo com outras pessoas. </h5> <p> 1. Clique com o botão direito na pasta (ou arquivo) que deseja compartilhar e selecione <strong> Dar acesso a </strong> -&gt; <strong> Pessoas especificas. </strong></p> <p><img src=\"images/image_thumb-56-411.png\" alt=\"How to Share Files and Folders in Windows 10, 8.1, 7\" loading=\"lazy\"></p> <p> </p> <p> 2. Usando o menu suspenso, selecione o usuário com quem deseja compartilhar seus arquivos e clique em <strong> Adicionar </strong> . </p> <p><img src=\"images/image_thumb-57-274.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Agora clique na seta para baixo, ao lado do usuário adicionado e especifique suas permissões de acesso (nível de permissão) </p> <p><img src=\"images/image_thumb-58-517.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Quando terminar, pressione o <strong> Compartilhar </strong> botão, </p> <p><img src=\"images/image_thumb-59-431.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Observe o link fornecido para a pasta compartilhada * e clique em <strong> Feito </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-60-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Neste ponto, você ativou o compartilhamento de arquivos em seu computador. Para acessar a pasta compartilhada de outro PC: </p> <blockquote><p> uma. Na barra de endereço do Explorer, digite o link para a pasta compartilhada, conforme mostrado na etapa anterior. (por exemplo, &quot;\\\\ DESKTOP-HMG31RD \\ 2Share&quot; sem aspas) <br> b. Aperte <strong> Entrar </strong> . <br> c. Digite o nome de usuário e a senha do usuário ao qual você concedeu acesso e pressione <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-61-512.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Informação adicional: <br> 1.Para alterar as permissões do usuário, basta seguir novamente o procedimento acima e alterar o nível de permissão do usuário. <br> 2. Se você deseja interromper o compartilhamento de arquivos, clique com o botão direito do mouse na pasta / arquivo compartilhado e vá para <strong> Dar acesso a </strong> -&gt; e selecione <strong> Remover acesso </strong> . </p> <p><img src=\"images/image_thumb-62-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar esse problema. </p>"}