{"title":"CORREÇÃO: Outlook Express Erro 0x800c0133 devido ao limite de tamanho de 2 GB no arquivo DBX (resolvido)","content":"<p> Este tutorial contém instruções para corrigir o erro do Outlook Express 0x800c0133 devido ao limite de tamanho de 2 GB. O erro 0x800c0133 em OE ocorre porque uma das pastas do Outlook excede o limite de 2 GB de tamanho. </p> <p> Descrição do problema de limite de tamanho de .DBX 2 GB no Outlook Express. <br> Quando uma das pastas principais do Outlook Express (por exemplo, &quot;Caixa de entrada&quot; ou &quot;Enviado&quot;) excede os 2 GB de tamanho, o OE retorna o erro 0x800c0133 durante a operação de envio / recebimento e, às vezes, a pasta OE correspondente fica vazia (corrompida). Por exemplo, se a pasta &quot;Caixa de entrada&quot; (Inbox.dbx) exceder o tamanho de 2 GB, o OE não poderá receber os novos e-mails e exibirá o erro 0x800c0133. </p> <p> * Observação: se uma das pastas OE estiver vazia, o arquivo DBX associado está corrompido. Nesse caso, tente recuperar seus e-mails da pasta OE corrompida seguindo as instruções neste artigo: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Como recuperar o arquivo DBX do Outlook Express GRATUITAMENTE </a> . </p> <h4> Como corrigir o problema de limite de 2 GB do Outlook Express (erro de envio / recebimento 0x800c0133). </h4> <h6> Etapa 1. Habilite a exibição de arquivos ocultos. </h6> <p> 1. Abra o Windows Explorer. <br> 2. Do <strong> Ferramentas </strong> escolha do menu <strong> Opções de Pasta </strong> . <br> 3. Na guia Exibir, clique em <strong> Mostrar arquivos e pastas escondidos </strong> e clique <strong> OK. </strong></p> <p><img src=\"images/image_thumb1_thumb-210.png\" alt=\"image_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Etapa 2. Localize o arquivo DBX de 2 GB do Outlook Express em seu disco. </h6> <p> 1. Abra a pasta de armazenamento do Outlook Express. Normalmente, essa pasta está localizada no seguinte caminho em seu disco: </p> <ul> <li> C: \\ Documents and Settings \\\\ Local Settings \\ Application Data \\ Identities \\ {} \\ Microsoft \\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> por exemplo. “C: \\ Documents and Settings \\ Admin \\ Local Settings \\ Application Data \\ Identities \\ {D8F3C56D-965E-41AE-8A23-A58460ABAE00} \\ Microsoft \\ <strong> Outlook Express </strong> ” </p></blockquote> <p> 3. Do explorador <strong> Visualizar </strong> escolha do menu <strong> Detalhes </strong> . <br> 4. Localize qual arquivo DBX excede o limite de armazenamento de 2 GB. * </p> <p> * Neste exemplo, o arquivo &quot;Inbox.dbx&quot; excede o tamanho de 2 GB. </p> <p><img src=\"images/image_thumb2_thumb-339.png\" alt=\"FIX Outlook Express Error 0x800c0133\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Etapa 3. Mova os e-mails da pasta Correio grande para uma pasta Novo correio. </h6> <p> 1. Abra o Outlook Express. <br> 2. Selecione a pasta de e-mail superdimensionada (com mais de 2 GB de tamanho, por exemplo, a pasta &quot;Caixa de entrada&quot; neste exemplo). <br> 3. Se você pode ver seus e-mails nessa pasta (a pasta não está vazia), proceda da seguinte forma: * </p> <p> * Aviso: Se a pasta parecer vazia (você não vê nenhum e-mail nela), a pasta OE (e o arquivo DBX associado) está corrompido. Nesse caso, você deve recuperar seus e-mails da pasta DBX corrompida, seguindo as instruções neste artigo. </p> <p> 4. No painel esquerdo do programa OE, clique com o botão direito na pasta grande e escolha <strong> Nova pasta </strong> (para criar uma nova pasta de e-mail) </p> <p><img src=\"images/image_thumb-6-403.png\" alt=\"outlook express 2gb limit\" loading=\"lazy\"></p> <p> </p> <p> 5. Digite um nome reconhecível para a nova pasta seguido por um ano (por exemplo, &quot;Caixa de entrada-2016&quot;) </p> <p><img src=\"images/image_thumb-7-434.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Em seguida, na pasta grande (por exemplo, da &quot;Caixa de entrada&quot;), selecione um grupo de e-mails (por exemplo, todos os e-mails do ano de 2016) e arraste e solte (mova) para a nova pasta de Correio que você criou antes (por exemplo, para &quot; Inbox-2016 &quot;). </p> <p><img src=\"images/image_thumb-8-450.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Repita os mesmos passos (crie pastas diferentes por ano, por exemplo, e mova os e-mails da pasta grande para as novas pastas). * </p> <p> * Aviso: Se você enfrentar problemas durante a operação de movimentação (por exemplo, se você não puder mover algumas mensagens para a nova pasta), então: </p> <blockquote><p> 1. Feche o Outlook Express. <br> 2. Copie (backup) a pasta &quot;Outlook Express&quot; do local de armazenamento OE para outro destino em seu disco. <br> 3. Em seguida, siga as instruções na etapa 4 para excluir o arquivo .dbx superdimensionado. <br> 4. Abra o Outlook Express. <br> 5. Importe os e-mails da pasta de backup OE (de <strong> Arquivo </strong> menu vá para -&gt; <strong> Importar </strong> <strong> Mensagens </strong> -&gt; <strong> Microsoft Outlook Express 6 </strong> -&gt; <strong> Importar e-mail do diretório da loja OE ... </strong> ) ** </p> <p> ** Se você ainda enfrentar problemas durante a importação, siga as instruções neste artigo para reparar o arquivo DBX corrompido. </p></blockquote> <p> </p> <p> 8. Quando você terminar a transferência de e-mail e a pasta de 2 GB ficar vazia de e-mails (por exemplo, a &quot;Caixa de entrada&quot; neste exemplo), prossiga para a próxima etapa. </p> <p><img src=\"images/image_thumb-10-811.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Etapa 4. Exclua o arquivo Outlook Express DBX de tamanho grande do disco. </h6> <p> 1. Abra a pasta de armazenamento do Outlook Express em seu disco. <br> 2. Exclua o arquivo DBX grande (por exemplo, &quot;Inbox.dbx&quot; neste exemplo). </p> <p><img src=\"images/image_thumb-9-996.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Inicie o Outlook Express. <br> 4. OE criará (automaticamente) uma nova pasta de e-mail limpa e íntegra para armazenar e-mails. * </p> <p> * Observação: se você ainda receber o mesmo erro, tente reparar a pasta OE corrompida seguindo as instruções neste artigo: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Como recuperar o arquivo DBX do Outlook Express GRATUITAMENTE </a> . </p> <p> Isso é tudo, pessoal! Isso funcionou para você? </p> <p> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}