{"title":"CORREÇÃO: Dreno de bateria no Windows 10 (resolvido)","content":"<p> Com o Windows 10, muitos usuários reclamam que a bateria do laptop se esgota rapidamente, mesmo com pouco uso ou mesmo com o desligamento total. Esse problema de &quot;consumo de bateria&quot; no Windows 10 ocorre por dois motivos básicos. O primeiro motivo é que o Windows 10 carrega muitos aplicativos em segundo plano que consomem energia da bateria, mesmo que não estejam sendo usados. </p> <p> O próximo motivo, que causa o esgotamento da bateria, mesmo no desligamento total, é o recurso &quot;Inicialização rápida&quot;. O Windows 10 (e o Windows 8 / 8.1) habilitou por padrão o recurso &quot;Fast Startup&quot;, que permite que o sistema inicialize e inicie mais rápido. Na verdade, quando a &quot;Inicialização rápida&quot; está ativada, o Windows 10 não desliga totalmente o sistema e sai do estado de hibernação. </p> <p> Neste tutorial, você encontrará instruções para evitar que o Windows 10 esgote a bateria. </p> <h4> Como corrigir o problema de drenagem da bateria no Windows 10. </h4> <p> </p> <h6> Etapa 1. Evite que os aplicativos sejam executados em segundo plano. </h6> <p> A primeira etapa, para resolver o problema de drenagem da bateria no Windows 10, é evitar que os aplicativos sejam executados em segundo plano. Para desativar os aplicativos de fundo: </p> <p> 1. Navegue para <strong> Começar </strong> -&gt; <strong> Definições </strong> -&gt; <strong> Privacidade </strong> . <br> 2. Selecione <strong> Apps de fundo </strong> à esquerda e, em seguida, à direita, coloque o &quot; <strong> Deixe os aplicativos rodarem em segundo plano &quot; </strong> troque para <strong> Fora, </strong> ou escolha individualmente os aplicativos que você não deseja executar em segundo plano e desative-os. </p> <p><img src=\"images/image_thumb-8-676.png\" alt=\"Prevent Apps from Running in the Background - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Etapa 2. Ative a Economia de bateria. </h6> <p> A próxima etapa é ativar a economia de bateria para estender a vida útil da bateria, limitando a atividade em segundo plano. </p> <p> 1. Navegue para <strong> Começar </strong> -&gt; <strong> Definições </strong> -&gt; <strong> Sistema </strong> . <br> 2. Em <strong> Bateria </strong> opções: </p> <blockquote> <p> uma. Clique em &quot;Ver quais aplicativos estão afetando a vida útil da bateria&quot; para descobrir o uso da bateria dos aplicativos abertos. <br> b. <strong> Verificar </strong> a &quot; <strong> Ative a economia de bateria automaticamente se minha bateria falhar abaixo de &quot; </strong> caixa de seleção e mova o controle deslizante para uma posição adequada. <br> c. Além disso, selecione &quot;Reduzir o brilho da tela enquanto estiver no modo de economia de bateria. </p> </blockquote> <p><img src=\"images/image_thumb-9-289.png\" alt=\"turn on battery saver Windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Etapa 3. Desative a inicialização rápida. </h6> <p> A próxima etapa é forçar o desligamento total do Windows 10, desativando o recurso de início rápido. </p> <p> 1. Navegue para <strong> Começar </strong> -&gt; <strong> Definições </strong> -&gt; <strong> Sistema </strong> . <br> 2. Em <strong> Poder </strong> clique em opções <strong> Configurações adicionais de energia. </strong></p> <p><img src=\"images/image_thumb-10-405.png\" alt=\"FIX Battery Drain in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Selecione <strong> Escolha o que os botões de energia fazem </strong> à esquerda. </p> <p><img src=\"images/image_thumb-11-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Em seguida, clique em <strong> Alterar configurações que não estão disponíveis no momento </strong> . </p> <p><img src=\"images/image_thumb-12-235.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6 <strong> Desmarque </strong> a <strong> Ativar inicialização rápida (recomendado) </strong> opção e clique <strong> Salve as alterações. * </strong></p> <p> * Nota: Se a opção de inicialização rápida já estava desmarcada, marque-a e reinicie o computador. Depois de reiniciar, desmarque-o e reinicie o computador novamente. </p> <p><img src=\"images/image_thumb-13-410.png\" alt=\"Turn Off Fast Startup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 7 <strong> Reiniciar </strong> seu computador. </p> <h6></h6> <h6> Etapa 4. Desative o modo de hibernação. </h6> <p> O &#39;Hibernate&#39; é um recurso de energia, que usa menos energia do que o modo de suspensão e quando você liga o PC novamente, você está de volta de onde parou. Em alguns casos, o recurso de hibernação faz com que o PC com Windows 10 não desligue completamente. Para desativar a hibernação: </p> <p> </p> <p> 1. Na caixa de pesquisa, digite: <strong> prompt de comando </strong> ou <strong> cmd <br> </strong> 2. Clique com o botão direito em <strong> Prompt de comando e selecione Executar como administrador </strong></p> <p><img src=\"images/image_thumb-14-379.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. No prompt de comando, dê o seguinte comando e pressione <strong> Entrar. </strong></p> <ul> <li><strong> powercfg -h off </strong></li> </ul> <p><img src=\"images/image_thumb-15-234.png\" alt=\"Disable Hibernate Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4 <strong> Reiniciar </strong> seu computador. * </p> <p> * Nota: Se você deseja reativar o recurso &#39;Hibernate&#39;, basta digitar este comando no prompt de comando administrativo: </p> <ul> <li> <ul> <li> powercfg -h off </li> </ul> </li> </ul> <p> </p> <h6> Etapa 5. Modificar as configurações de energia no adaptador de rede. </h6> <p> O próximo método para corrigir o problema de drenagem da bateria no Windows 10 é modificar as configurações de energia nos adaptadores de rede. </p> <p> 1. Abra <strong> Gerenciador de Dispositivos </strong> . <br> 2. Expanda <strong> Adaptadores de rede </strong> . <br> 3. Clique com o botão direito no adaptador de rede instalado e selecione <strong> Propriedades </strong> . <br> 3. Selecione o <strong> Gerenciamento de energia </strong> aba. <br> 4 <strong> Desmarque </strong> a <strong> &#39;Permitir que este dispositivo acorde o computador </strong> &#39;e clique em <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-7-574.png\" alt=\"modify power settings\" loading=\"lazy\"></p> <h6></h6> <h6> Etapa 6. Reverter o driver da interface do Intel Management Engine. </h6> <p> Se o problema de drenagem da bateria aparecer após a instalação de uma atualização do Windows 10, prossiga e reverta o driver da Intel Management Engine Interface. Fazer isso: </p> <p> 1. Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-592.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite: <strong> devmgmt.msc </strong> e clique <strong> OK </strong> . <br> 3. Expanda <strong> Dispositivos de sistema </strong> . <br> 4. Clique com o botão direito em <strong> Interface de Sistema de Gerência Intel </strong> e selecione <strong> Propriedades </strong> . </p> <p><img src=\"images/image_thumb-5-532.png\" alt=\"device properties\" loading=\"lazy\"></p> <p> </p> <p> 5. Selecione a guia Driver e clique em <strong> Motorista de reversão </strong> . * </p> <p> </p> <p> * Se o <strong> Motorista de reversão </strong> o botão está acinzentado e, em seguida, navegue até o site de suporte do fabricante do seu laptop ou placa-mãe para baixar e instalar uma versão mais antiga do driver para a Intel Management Engine Interface. </p> <p><img src=\"images/image_thumb-6-551.png\" alt=\"roll back driver\" loading=\"lazy\"></p> <p> </p> <p> 6 <strong> Reiniciar </strong> seu computador. </p> <h6> Etapa 7. Outras sugestões para resolver o problema de drenagem da bateria. </h6> <p> 1. Substitua o carregador do laptop e sempre use um carregador de marca, para prolongar a vida útil da bateria. <br> 2. Se a bateria do seu laptop estiver velha, provavelmente sua capacidade caiu e deve ser substituída. Para diagnosticar a saúde da bateria, use o <a href=\"http://www.nirsoft.net/utils/battery_information_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> BatteryInfoView </a> Utilitário. </p> <p><img src=\"images/image_thumb-16-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar esse problema. </p>"}