{"title":"CORREÇÃO: VÍDEO DXGKRNL FATAL ERROR no Windows 10 (resolvido)","content":"<p> Se você enfrentar o erro de tela azul &quot;VIDEO DXGKRNL FATAL ERROR&quot; no Windows 10, siga as instruções abaixo para corrigir o problema. </p> <p> O erro BSOD do Windows 10 &quot; <em> Seu PC teve um problema e precisa ser reiniciado. Estamos apenas coletando algumas informações de erro e, em seguida, reiniciaremos para você. Se quiser saber mais, você pode pesquisar online mais tarde por este erro: VIDEO DXGKRNL FATAL ERROR &quot;, </em> geralmente indica um problema com os drivers de vídeo. </p> <p><img src=\"images/image_thumb-7-129.png\" alt=\"FIX: VIDEO DXGKRNL FATAL ERROR in Windows 10\" loading=\"lazy\"></p> <p> Este tutorial contém instruções passo a passo para resolver o erro de tela azul &quot;VIDEO DXGKRNL FATAL ERROR&quot; no Windows 10. </p> <h2> Como consertar: Windows 10 VIDEO DXGKRNL FATAL ERROR. </h2> <h3> Etapa 1. Corrija o VIDEO DXGKRNL FATAL ERROR desinstalando / reinstalando os drivers de vídeo. </h3> <p> 1. Abra <strong> Gerenciador de Dispositivos </strong> . Fazer isso: </p> <ol> <li> <ol> <li> Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-153.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. </li> <li> Na caixa &quot;Abrir&quot;, digite: <strong> devmgmt.msc </strong> e clique <strong> OK </strong> . </li> </ol> </li> </ol> <blockquote> <p><img src=\"images/image_thumb-5-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p></blockquote> <p> 2 <strong> Expandir </strong> a <strong> Adaptadores de vídeo. <br> </strong> 3 <strong> Clique com o botão direito </strong> no (s) adaptador (es) de vídeo instalado (s) e selecione <strong> Desinstale o dispositivo. </strong></p> <p><img src=\"images/image_thumb-46-240.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. Na próxima janela, se você tiver a opção: &quot; <strong> Exclua o software do driver para este dispositivo </strong> &quot;, selecione-o e clique em <strong> OK </strong> para remover os drivers instalados do computador. </p> <p> 5. Após a desinstalação, <strong> reiniciar </strong> seu computador e navegue para <strong> Gerenciador de Dispositivos </strong> novamente. <br> 6. Clique com o botão direito no nome do computador (na parte superior) e selecione <strong> Procure por alterações de hardware. </strong></p> <p><img src=\"images/image_thumb-8-911.png\" alt=\"Scan for hardware changes\" loading=\"lazy\"></p> <p> </p> <p> 7. Deixe o Windows detectar e instalar os drivers de vídeo e então <strong> reiniciar </strong> seu computador novamente e verifique se o &quot;VIDEO DXGKRNL FATAL ERROR&quot; persiste. * </p> <p> * Nota: Se o Windows não puder instalar automaticamente os drivers de vídeo ou se você ainda enfrentar o erro de tela azul, prossiga para a próxima etapa. </p> <p> </p> <h3><br clear=\"all\"> Etapa 2. Reinstale os drivers de vídeo do site do fabricante. </h3> <p> 1. Navegue para <strong> Gerenciador de Dispositivos </strong> e <strong> Desinstalar </strong> o adaptador de vídeo instalado. * </p> <p> * Nota: Se você possui um laptop com dois (2) adaptadores de vídeo, desinstale os dois. </p> <p> 2. Vá para o site de suporte do fabricante do seu computador (ou placa de vídeo) e baixe os drivers mais recentes para sua (s) placa (s) de vídeo. </p> <ul> <li> <ul> <li> Para <strong> NVIDIA </strong> GPUs baseadas, navegue para <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Página de pesquisa avançada de driver NVIDIA </a> . </li> <li> Para <strong> AMD </strong> GPUs baseadas, navegue para <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Centro de download do driver AMD (ATI). </a></li> <li> Para <strong> Intel </strong> GPUs baseadas, navegue para <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Centro de download de gráficos da Intel. </a></li> </ul> </li> </ul> <p> 3. Prossiga e instale o driver baixado. * </p> <p><strong> * Nota importante: </strong> Se você possui um laptop com dois (2) adaptadores de vídeo, instale primeiro os drivers para o adaptador AMD ou NVIDIA e reinicie o laptop. Após reiniciar, prossiga e instale os drivers para o adaptador de vídeo INTEL e reinicie o laptop novamente. </p> <p> 4. Após a instalação, <strong> reiniciar </strong> seu PC e verifique se o VIDEO DXGKRNL FATAL ERROR foi resolvido. Caso contrário, prossiga para a próxima etapa. </p> <p> </p> <h3><br clear=\"all\"> Etapa 3. Repare o DirectX para corrigir o VIDEO DXGKRNL FATAL ERROR. </h3> <p> O VIDEO DXGKRNL FATAL ERROR indica um problema nos drivers DirectX da Microsoft. Então, prossiga com o reparo DirectX. </p> <p> 1. Baixe o <a href=\"https://www.microsoft.com/en-us/download/details.aspx?displaylang=en&id=35\" target=\"_blank\" rel=\"nofollow noopener\"> Instalador da Web em tempo de execução do usuário final DirectX </a> . <br> 2. Execute o arquivo baixado (dxwebsetup.exe) e siga as instruções na tela para instalar os componentes opcionais do DirectX Runtime. </p> <p><img src=\"images/image_thumb-9-847.png\" alt=\"Install DirectX Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Quando a instalação for concluída <strong> reiniciar </strong> seu PC. </p> <p> 4. Após reiniciar, vá para <strong> Começar <img src=\"images/image_thumb-55-571.png\" alt=\"image\" loading=\"lazy\"> -&gt; Configurações </strong> -&gt; <strong> Atualização e segurança -&gt; </strong> e clique <strong> Verifique se há atualizações. </strong></p> <p><img src=\"images/image_thumb-76-281.png\" alt=\"Windows 10 - Check For Updates \" loading=\"lazy\"></p> <p> 5. Após a instalação das atualizações, reinicie o seu PC e verifique se o erro BSOD foi solucionado. Caso contrário, prossiga para a próxima etapa. </p> <p> </p> <h3><br clear=\"all\"> Etapa 4. Reparar os arquivos de sistema do Windows 10. </h3> <p> 1. Abra <strong> Prompt de comando como administrador </strong> . <br> 2. No prompt de comando, dê o seguinte comando e pressione <strong> Entrar: </strong></p> <ul> <li><strong> DISM.exe / Online / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-176.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Quando a operação DISM for concluída, digite o seguinte comando e pressione <strong> Entrar </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-464.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Agora aguarde até que o Verificador de arquivos do sistema repare os arquivos de sistema do Windows. <br> 5. Quando isso for feito, <strong> reiniciar </strong> seu computador e verifique se o erro persiste. </p> <p> </p> <h3><br clear=\"all\"> Etapa 5. Analisar o arquivo de log do Minidump (BSOD). </h3> <p> Quando o Windows trava com uma tela azul, armazena os detalhes da tela do BSoD em pequenos arquivos, que chamam &quot; <strong> MiniDump </strong> &quot;. A análise do <strong> Minidump </strong> arquivo (s) podem ajudá-lo a solucionar e resolver o problema de VIDEO DXGKRNL FATAL ERROR. Para realizar esta tarefa, siga as instruções neste artigo: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Como analisar arquivos MiniDump com BlueScreenView </a> . </p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}