{"title":"Como sempre abrir o Chrome no modo de navegação anônima.","content":"<p> Se você está procurando uma maneira de fazer o Chrome sempre abrir no modo anônimo, continue lendo abaixo. Quando você inicia o Chrome no modo de navegação anônima, a atividade do navegador permanece privada de outros usuários que usam o mesmo dispositivo. No modo anônimo, o Chrome não salva o seu histórico de navegação, cookies e as informações inseridas nos formulários. </p> <p> A maneira manual, para iniciar uma nova sessão do Chrome no modo anônimo, é ir ao menu do Chrome <img src=\"images/image_thumb10_thumb-963.png\" alt=\"image_thumb[10]\" loading=\"lazy\"> e selecionar &quot;Nova janela anônima&quot; ou pressionar CTRL + SHIFT + N. </p> <p><img src=\"images/image_thumb-42-832.png\" alt=\"Chrome New incognito window\" loading=\"lazy\"></p> <p> </p> <p> Neste artigo, você encontrará instruções sobre como sempre iniciar o Google Chrome no modo de navegação anônima. </p> <h4> Como sempre iniciar o Google Chrome no modo de navegação anônima. </h4> <p> Se você deseja sempre iniciar o Chrome no modo de navegação anônima, crie um novo atalho do Chrome e modifique suas propriedades, da seguinte maneira: </p> <p> 1, <strong> Clique com o botão direito </strong> sobre <strong> Google Chrome </strong> atalho e selecione <strong> Propriedades </strong> . <br> 2. Em <strong> Em geral </strong> guia, adicione a chave &quot;–incognito&quot; (sem aspas), no final da linha de destino e clique <strong> OK </strong> : </p> <p> por exemplo. &quot;C: \\ Arquivos de programas \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; –incognito </p> <p><img src=\"images/image_thumb-43-798.png\" alt=\"How to Always Open Chrome in Incognito mode.\" loading=\"lazy\"></p> <p> 3. A partir de agora, quando você iniciar o Chrome a partir do atalho modificado, o Chrome será aberto no modo anônimo. * </p> <p><strong> * GORJETA: </strong> Se você deseja abrir o Chrome no modo anônimo, ao abrir um hiperlink (URL) de seu e-mail ou outro programa, é necessário modificar o registro. Fazer isso: </p> <blockquote> <p> 1. Abra o <strong> Editor de registro </strong> . <br> 2. No registro, navegue até a seguinte chave: </p> <ul> <li> <p> HKEY_CLASSES_ROOT \\ ChromeHTML \\ shell \\ open \\ command </p> </li> </ul> <p> 3. No painel direito, clique duas vezes no <strong> Padrão </strong> Valor da string REG_SZ. </p> </blockquote> <p><img src=\"images/image_thumb-44-612.png\" alt=\"open url in chrome incognito\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. Adicione a chave, adicione a palavra &quot;incógnito&quot; (sem aspas), antes de &quot;% 1&quot; e clique <strong> OK </strong> . </p></blockquote> <blockquote><p> por exemplo. Altere os dados do valor de: </p> <p> &quot;C: \\ Arquivos de programas \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; - &quot;% 1&quot; </p> <p> para: </p> <p> &quot;C: \\ Arquivos de programas \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; –incognito &quot;% 1&quot; </p></blockquote> <p><img src=\"images/image_thumb-45-148.png\" alt=\"open url chrome incognito - registry\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. A partir de agora, ao clicar em um URL (HTML), o Chrome irá abri-lo no modo anônimo. </p></blockquote> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}