{"title":"Como bloquear sites no Chrome ou Firefox.","content":"<p> Se você está procurando uma maneira fácil de bloquear um site no Chrome ou Firefox, continue lendo abaixo. </p> <p> Embora a Internet para a maioria de nós tenha se tornado necessária em nossas vidas diárias para nosso trabalho ou entretenimento, por outro lado, às vezes é útil ser capaz de bloquear alguns sites para evitar distrações. Por exemplo, ninguém quer que seu filho se distraia assistindo a vídeos no YouTube enquanto lêem as aulas. </p> <p> Neste guia, você aprenderá como bloquear sites no Chrome e <a href=\"#firefox\" target=\"_blank\" rel=\"nofollow noopener\"> Raposa de fogo </a> navegadores. </p> <p> * Observação: se você deseja bloquear um site em todos os navegadores, leia este artigo: <a href=\"https://www.repairwin.com/block-youtube-on-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Como bloquear o YouTube no Windows 10. </a></p> <h2> Como bloquear sites no Google Chrome. </h2> <p> A maneira mais fácil de bloquear um site no Chrome é usar a famosa extensão BlockSite. A instalação do complemento BlockSite é semelhante a qualquer outra extensão. </p> <p> 1. Navegue para <a href=\"https://chrome.google.com/webstore/detail/blocksite-stay-focused-co/eiimnmioipafcokbfikbljfdeojpcgbh\" target=\"_blank\" rel=\"nofollow noopener\"> Extensão BlockSite </a> na Chrome Web Store e clique no botão <strong> Adicionar ao Chrome </strong> botão. </p> <p><img src=\"images/image_thumb-4-439.png\" alt=\"how to block websites chrome\" loading=\"lazy\"></p> <p> 2. Quando solicitado, clique em <strong> Adicionar extensão </strong> . </p> <p><img src=\"images/image_thumb-5-782.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Quando a instalação for concluída, vá para o menu do Chrome&gt; Mais ferramentas&gt; Extensões </p> <p><img src=\"images/image_thumb-6-830.png\" alt=\"chrome tools extensions\" loading=\"lazy\"></p> <p> 4. Encontre o <strong> BlockSite </strong> extensão e clique <strong> Detalhes. </strong></p> <p><img src=\"images/image_thumb-7-415.png\" alt=\"Blocksite details\" loading=\"lazy\"></p> <p> 5 <strong> Abrir </strong> a <strong> Opções de extensão </strong> . </p> <p><img src=\"images/image_thumb-8-135.png\" alt=\"How to Block sites chrome\" loading=\"lazy\"></p> <p> 6. Digite o nome do site que deseja bloquear (por exemplo, <a href=\"http://www.youtube.com\" target=\"_blank\" rel=\"nofollow noopener\"> www.youtube.com </a> ) e pressione o símbolo de adição (+) para adicionar o site à lista de sites bloqueados. </p> <p><img src=\"images/image_thumb-9-298.png\" alt=\"blocked sites chrome\" loading=\"lazy\"></p> <p> 7. É isso aí! A partir de agora, ao tentar visitar o site bloqueado, você será informado de que o site está bloqueado com a extensão BlockSite. Para modificar a lista de sites bloqueados, clique em <strong> Edite sua lista </strong> para fazer as alterações desejadas ou para remover o site bloqueado da lista. </p> <p><img src=\"images/image_thumb-10-951.png\" alt=\"image\" loading=\"lazy\"></p> <h3> Como proteger com senha os sites bloqueados na extensão BlockSite. </h3> <p> Se você deseja impedir que os usuários desbloqueiem um site bloqueado: </p> <p> 1. Abra o <strong> BlockSite </strong> opções de extensão. <br> 2. Navegue para <strong> Proteção de senha </strong> definições. <br> 3 <strong> Habilitar </strong> a opção Proteger <strong> suas opções preferidas do BlockSite e a página de extensão do Chrome com uma senha </strong> e então digite seu e-mail e uma senha e clique <strong> Salve . </strong></p> <p><img src=\"images/image_thumb-11-711.png\" alt=\"password protect blocked sites\" loading=\"lazy\"></p> <p> 4. O BlockSite enviará a você um e-mail com um link para verificar o seu endereço de e-mail. Após a verificação do e-mail, a proteção por senha estará ativa. </p> <h2> Como bloquear sites no Mozilla Firefox. </h2> <p> 1. Navegue para <a href=\"https://addons.mozilla.org/en-US/firefox/addon/blocksite/\" target=\"_blank\" rel=\"nofollow noopener\"> Extensão BlockSite </a> nos complementos do Firefox. <br> 2. Clique no <strong> Adicionar ao Firefox </strong> botão. </p> <p><img src=\"images/image_thumb-12-999.png\" alt=\"block websites firefox\" loading=\"lazy\"></p> <p> 2. Quando solicitado a permitir a instalação da extensão, clique em <strong> Adicionar. </strong></p> <p><img src=\"images/image_thumb-13-588.png\" alt=\"Blocksite firefox\" loading=\"lazy\"></p> <p> 3. Quando a instalação for concluída, escolha se deseja bloquear sites em janelas privadas (anônimas) e clique em <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-14-173.png\" alt=\"how to block site\" loading=\"lazy\"></p> <p> 4. Se você deseja impedir que a extensão do BlockSite leia dados nos sites que você visita, clique na letra Talvez. </p> <p><img src=\"images/image_thumb-15-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Agora clique no ícone BlockSite e <strong> Editar lista de bloqueios </strong> para especificar quais sites você deseja bloquear. </p> <p><img src=\"images/image_thumb-16-657.png\" alt=\"block sites firefox\" loading=\"lazy\"></p> <p> 6. Na guia Bloquear sites, digite o nome do site que deseja bloquear (por exemplo, &quot;facebook.com&quot;) e adicione-o à lista de sites bloqueados. </p> <p><img src=\"images/image_thumb-17-817.png\" alt=\"How to block site Firefox\" loading=\"lazy\"></p> <p> 7. Depois de adicionar os sites que deseja bloquear, feche as configurações do BlockSite e pronto. </p> <p> Além de sua função principal, a extensão BlockSite também possui algumas outras funções úteis, como: </p> <ul> <li> <p><strong> Modo de fóco </strong> : Bloquear sites por um período específico (por exemplo, 25 minutos) </p> </li> <li> <p><strong> Proteção de senha: </strong> Proteja suas configurações do BlockSite contra modificações. </p> </li> <li> <p><strong> Bloco por palavras: </strong> Bloqueie URLs contendo palavras específicas. </p> </li> </ul> <p> Isso é tudo, pessoal! Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}