{"title":"CORREÇÃO: versão mais recente do Adobe Acrobat Reader DC já instalada - Erro 1722 (resolvido)","content":"<p> O seguinte problema foi encontrado em um computador com Windows: Falha na instalação do Adobe Acrobat Reader DC porque &quot;a versão mais recente já está instalada&quot;. O estranho desse problema, é que o Adobe Reader DC não está instalado na máquina, pois não existe nenhum vestígio do programa Adobe Reader ou arquivos em Adicionar / Remover programas ou no disco rígido. </p> <p><img src=\"images/image_thumb-19-522.png\" alt=\"Adobe Acrobat Reader DC Newer Version already installed – Error 1722 - fix\" loading=\"lazy\"></p> <p> </p> <p> Além disso, ao solucionar o problema de instalação &quot;uma nova versão já instalada&quot; do programa Adobe Reader DC, a seguinte mensagem de erro ocorreu ao tentar instalar o programa usando o <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Pacote de distribuição do Adobe Acrobat Reader DC </a> : &quot;Erro 1722. Há um problema com este pacote do Windows Installer. Um programa executado como parte da instalação não foi concluído como esperado. Entre em contato com a equipe de suporte ou fornecedor do pacote….&quot; </p> <p><img src=\"images/image_thumb-20-398.png\" alt=\"Acrobat reader Error 1722 There is a problem with this Windows Installer package\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contém etapas e instruções detalhadas para resolver os seguintes erros ao instalar o Adobe Reader DC: &quot;Uma nova versão já instalada&quot; e &quot;Erro 1722. Há um problema com este pacote do Windows Installer&quot; no sistema operacional Windows 10/8/7. </p> <h4> Como corrigir problemas de instalação do Adobe Acrobat Reader DC: Versão mais recente já instalada - Erro 1722 Problema com o pacote de instalação. </h4> <h6> Método 1. Remova os produtos Adobe Acrobat com a ferramenta Acrobat Cleaner. </h6> <p> O primeiro passo para corrigir os problemas de instalação do Adobe Reader DC é remover todas as instalações anteriores do Adobe Acrobat e Adobe Reader, usando <a href=\"https://labs.adobe.com/downloads/acrobatcleaner.html\" target=\"_blank\" rel=\"nofollow noopener\"> Acrobat Reader DC e utilitário Adobe Acrobat DC Cleanup </a> * e depois instalar <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> Adobe Reader DC </a> . </p> <p> * A ferramenta Adobe Reader e Acrobat Cleaner foi projetada para limpar instalações corrompidas do Adobe Acrobat e Adobe Reader, incluindo a remoção ou correção de arquivos corrompidos, remoção ou alteração de entradas de registro de permissões, etc. </p> <p><img src=\"images/image_thumb-21-370.png\" alt=\"Acrobat Reader DC & Adobe Acrobat DC Cleanup tool\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Método 2. Execute o Solucionador de problemas de instalação e desinstalação de programas da Microsoft. </h6> <p> 1. Baixe o <a href=\"https://support.microsoft.com/en-us/help/17588/fix-problems-that-block-programs-from-being-installed-or-removed\" target=\"_blank\" rel=\"nofollow noopener\"> Solucionador de problemas de instalação e desinstalação de programas </a> da Microsoft. <br> 2. Execute o programa baixado e clique em Avançar na primeira tela. <br> 3. Quando solicitado, clique em <strong> Desinstalando </strong></p> <p><img src=\"images/image_thumb-22-965.png\" alt=\"Program Install & Uninstall Troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 4. Selecione o <strong> Adobe Acrobat Reader DC </strong> programar e selecionar <strong> Próximo </strong> . * Em seguida, siga as instruções na tela para corrigir o problema. </p> <p> * Observação: se você não vir o &#39;Adobe Acrobat Reader DC&#39; na lista, clique em <strong> Cancelar </strong> e execute o solucionador de problemas novamente. Mas, desta vez, escolha &quot;Instalando&quot; quando solicitado. </p> <p><img src=\"images/image_thumb-23-917.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Método 3. Instale o Adobe Reader usando o pacote de instalação completo do Acrobat Reader DC. </h6> <p> Tente instalar o Adobe Reader DC usando o <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Pacote de distribuição do Adobe Acrobat Reader DC </a> . </p> <p> </p> <h6> Método 4. Inicie o serviço Windows Installer. </h6> <p> 1. Abra o painel de controle dos Serviços do Windows: Para fazer isso: </p> <ul> <li> Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-698.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. </li> <li> Na caixa de pesquisa, digite: <strong> services.msc </strong> e clique <strong> OK </strong> . </li> <li> (Aceite o aviso do UAC se ele aparecer). </li> </ul> <p><img src=\"images/image_thumb-12-635.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. No painel de controle de Serviços, clique com o botão direito em <strong> Windows Installer s </strong> serviço e clique <strong> Começar </strong> . * </p> <p> * Nota: Se o serviço for iniciado, clique em <strong> Reiniciar </strong> . </p> <p><img src=\"images/image_thumb-24-258.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Método 5. Registre novamente o serviço Windows Installer. </h6> <p> 1. Abra <strong> Prompt de comando como administrador. <br> </strong> 2. Digite os seguintes comandos em ordem (pressione Enter após digitar cada comando) </p> <ul> <li><strong> msiexec / cancelar registro </strong></li> <li><strong> msiexec / regserver </strong></li> </ul> <p><img src=\"images/image_thumb-25-162.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Feche a janela do prompt de comando e <strong> reiniciar </strong> seu computador. <br> 4. Tente instalar o Acrobat Reader DC. </p> <p> </p> <h6> Método 6. Instale as atualizações do Windows e o Visual C ++. </h6> <p> 1. Instale todas as atualizações do Windows disponíveis. <br> 2. Instale as versões x86 e x64 do <a href=\"https://www.microsoft.com/en-in/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Pacotes redistribuíveis do Visual C ++ para Visual Studio 2013 </a><br> 3. Instale as versões x86 e x64 do <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48145\" target=\"_blank\" rel=\"nofollow noopener\"> Pacotes redistribuíveis do Visual C ++ para Visual Studio 2015 </a><br> 4. Tente instalar o Acrobat Reader DC. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}