{"title":"Como reinstalar o Windows 10 se o Windows não inicializar.","content":"<p> Neste tutorial, você encontrará instruções detalhadas sobre como reinstalar o Windows 10, se o Windows falhar ao inicializar. Em um tutorial anterior, mencionei a maneira de <a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"nofollow noopener\"> reinstale o Windows 10 usando o recurso &quot;REINICIAR este PC </a> . Mas, o &quot;RESET this PC&quot; só está disponível se o Windows 10 pode inicializar normalmente, ou se você pode lançar o menu &#39;Advanced Startup &quot;após inicializar no Windows. (A opção&quot; RESET this PC &quot;não está disponível ao inicializar a partir de USB). </p> <p> Este tutorial contém instruções para reinstalar o Windows 10 se o Windows não inicializar, sem perder seus arquivos. </p> <h2> Como reinstalar emparelhar o Windows 10 se o Windows não puder iniciar. </h2> <p><strong> Requisitos </strong> : Para reinstalar o Windows 10 se o Windows não iniciar normalmente, você precisará inicializar o computador a partir de uma mídia de instalação do Windows (USB ou DVD) e ativar o menu de opções avançadas (menu da tecla F8). Se você não possui uma mídia de instalação do Windows, pode criar uma usando <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Ferramenta de criação de mídia da Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Como criar uma mídia de instalação USB do Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Como criar uma mídia de instalação de DVD do Windows 10. </a></li> </ul> <p> 1. Inicialize seu computador a partir da mídia de instalação do Windows. <br> 3. Pressione <strong> Próximo </strong> na tela de opções de idioma. <br> 4. Escolha <strong> Conserte seu computador </strong> . <br> 5. Em seguida, escolha <strong> Solução de problemas -&gt; </strong><strong> Opções avançadas -&gt; Prompt de comando. </strong></p> <p> 6. Na janela do prompt de comando, digite o seguinte comando e pressione <strong> Entrar: </strong></p> <ul> <li><strong> bcdedit / set {default} bootmenupolicy legacy </strong></li> </ul> <p><img src=\"images/image_thumb-33-821.png\" alt=\"advanced boot options\" loading=\"lazy\"></p> <p> 7. Digite <strong> saída </strong> para fechar a janela do prompt de comando. <br> 8. Remova a mídia de instalação do Windows. <br> 9. Feche todas as janelas para reiniciar ou desligar o PC. </p> <p> 10 <strong> Aperte </strong> a <strong> F8 </strong> chave <strong> repetidamente </strong> durante a inicialização do computador. </p> <p> 11. No &quot;Menu de Opções Avançadas &#39;, realce o&quot; <strong> Conserte seu computador </strong> &quot;opção e, em seguida, pressione <strong> ENTRAR </strong> . </p> <p><img src=\"images/image_thumb-13-334.png\" alt=\"Repair your Computer in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 12. Na tela &#39;Escolha uma opção&#39;, selecione <strong> Resolução de problemas </strong> e então clique <strong> Reinicializar este PC -&gt; Manter meus arquivos. </strong> * </p> <p> Notas: <br> 1. O &quot; <strong> Mantenha meus arquivos&quot; </strong> opção, removerá todos os seus aplicativos e configurações, mas manterá seus arquivos pessoais. <br> 2. O <strong> &quot;Remover tudo&quot; </strong> opção, irá remover todos os aplicativos, configurações e arquivos. Ao selecionar esta opção, seu PC será restaurado para um estado limpo. <br> 3. Se você escolher &quot;Remover tudo&quot;, certifique-se de ter um backup recente de seus arquivos pessoais em outra mídia de armazenamento (por exemplo, um disco USB), caso contrário, todos os seus arquivos serão perdidos. </p> <p><img src=\"images/image_thumb-14-296.png\" alt=\"How to Reinstall Windows 10 if Windows Won't Boot.\" loading=\"lazy\"></p> <p> </p> <p> 13. Na próxima tela, escolha uma conta com privilégios de administrador. ) e na próxima tela digite sua senha e clique em <strong> Próximo </strong> . </p> <p><img src=\"images/image_thumb-15-869.png\" alt=\"How to Reinstall Windows 10 if Windows cannot Boot.\" loading=\"lazy\"></p> <p> 14. Digite a senha da conta selecionada e clique em <strong> Prosseguir. </strong></p> <p><img src=\"images/image_thumb-16-692.png\" alt=\"How to Reinstall Windows 10 if Windows fails to boot.\" loading=\"lazy\"></p> <p> </p> <p> 15. Aguarde até que a instalação seja concluída. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar este guia. </p>"}