{"title":"CORREÇÃO: problema de alto uso de memória do Chrome (resolvido)","content":"<p> Como você já deve ter notado, o Google Chrome abre muitos processos em segundo plano, mesmo quando você abre apenas algumas janelas / guias do Chrome. Isso acontece porque o Google Chrome foi desenvolvido de forma a criar um processo individual para cada plugin ou extensão instalada quando você abre uma nova janela ou aba. </p> <p> Embora a abertura de vários processos do Google Chrome seja um comportamento normal, na verdade é um problema, porque esse comportamento causa muito uso de memória e faz com que o computador não responda. </p> <p><img src=\"images/image_thumb-17-610.png\" alt=\"FIX: Multiple Processes in Chrome with High Memory Usage\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contém instruções passo a passo sobre como evitar que o Chrome abra vários processos para cada janela ou guia, a fim de resolver o problema de alto uso de memória do Chrome. </p> <h4> Como desativar vários processos do Chrome no Windows 10. </h4> <h6> Etapa 1. Verifique se há malware e vírus em seu computador. </h6> <p> A primeira etapa antes de solucionar o erro &quot;ERR_CONNECTION_CLOSED&quot; no Chrome é garantir que seu sistema esteja livre de vírus / malware. Para essa tarefa, siga as instruções neste guia: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Como fazer uma varredura em seu computador em busca de vírus e outros programas maliciosos. </a></p> <h6></h6> <h6> Etapa 2. Desative as extensões indesejadas do Chrome. </h6> <p> Em primeiro lugar, verifique se você precisa de todas as extensões do Chrome instaladas e desative aquelas de que não precisa. Fazer isso: </p> <p> 1. No menu do Chrome <img src=\"images/image_thumb-47-380.png\" alt=\"image\" loading=\"lazy\"> , vamos para <strong> Mais ferramentas </strong> -&gt; <strong> Extensões </strong></p> <p><img src=\"images/image_thumb-51-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Remova (ou desative) qualquer extensão de que não precise ou que não reconheça. </p> <p><img src=\"images/image_thumb-49-442.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Etapa 3. Impedir que o Chrome seja executado em segundo plano quando o Chrome estiver fechado. </h6> <p> 1. No menu do Chrome <img src=\"images/image_thumb-78-665.png\" alt=\"image\" loading=\"lazy\"> selecionar <strong> Definições </strong> . </p> <p><img src=\"images/image_thumb-79-868.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> 2. Em <strong> Definições </strong> página, role para baixo e clique <strong> Avançado </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <p> 3. Defina a chave &quot;Continuar executando aplicativos de fundo quando o Google Chrome for fechado&quot; para <strong> FORA </strong> . </p> <p><img src=\"images/image_thumb-18-557.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <p> </p> <h6> Etapa 4. Impedir que o Chrome abra vários processos para o mesmo site. </h6> <p> 1, <strong> Clique com o botão direito </strong> sobre <strong> Google Chrome </strong> atalho e selecione <strong> Propriedades </strong> . <br> 2. Em <strong> Em geral </strong> guia, adicione a opção &quot;–process-per-site&quot; (sem aspas), no final da linha de destino e clique <strong> OK </strong> e <strong> Prosseguir </strong> para aplicar a mudança <strong> . * </strong></p> <p> por exemplo. &quot;C: \\ Arquivos de programas \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; –processo por site </p> <p> Nota: Há um espaço antes de –process-per-site </p> <p><img src=\"images/image_thumb-19-818.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Etapa 5. Desative o isolamento de sites do Google Chrome. </h6> <p> No modo de isolamento de site, o Chrome carregará cada site em seu próprio processo. Este é, na verdade, um recurso de segurança adicional para evitar que um site roube seus dados de outro site que está aberto em outra janela / guia. Porém, o modo &quot;Isolamento de site&quot; aumentará o uso de memória do Chrome em aproximadamente 10%. </p> <p> 1. Na barra de endereço do Chrome, digite <a href=\"//flags/#site-isolation-trial-opt-out\" target=\"_blank\" rel=\"nofollow noopener\"> chrome: // flags / # site-isolation-trial-opt-out </a> e clique em entrar. </p> <p> 2. Defina o <strong> Desative o isolamento do site </strong> modo para <strong> Desativado </strong> e então clique <strong> Reiniciar agora </strong> . * </p> <p> * Observação: </p> <p><img src=\"images/image_thumb-20-397.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? </p> <p> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}