{"title":"CORREÇÃO: o arquivo não tem fluxos de áudio ou vídeo no Adobe Premiere.","content":"<p> Se você receber o erro Adobe Premiere &#39;Falha na importação de arquivo&#39; com a descrição &quot;O arquivo não tem áudio ou vídeo&quot; pode aparecer durante a importação de um arquivo de vídeo MP4, continue lendo abaixo. O erro &quot;O arquivo não tem fluxo de áudio ou vídeo&quot; no Adobe Premiere, pode aparecer, embora o vídeo seja reproduzido corretamente em qualquer outro reprodutor de mídia (VLC, Windows Media Player etc.). </p> <p><img src=\"images/image_thumb-43-349.png\" alt=\"FIX: File has no audio or video streams on Adobe Premiere\" loading=\"lazy\"></p> <p> </p> <p> Os erros do Adobe Premiere durante a importação de um arquivo de vídeo podem aparecer por diversos motivos, portanto, neste tutorial você encontrará todos os métodos disponíveis para corrigir o problema. </p> <h4> Como corrigir: &quot;O arquivo não contém fluxos de áudio ou vídeo&quot; no Adobe Premiere. </h4> <h6> Método 1. Instale o QuickTime. </h6> <p> Em primeiro lugar, certifique-se de que instalou o mais recente <a href=\"https://support.apple.com/downloads/quicktime\" target=\"_blank\" rel=\"nofollow noopener\"> Tempo rápido </a> versão no seu PC e tente importar o arquivo mp4 no Adobe Premiere. </p> <p> </p> <h6> Método 2. Renomeie o arquivo de vídeo. </h6> <p> 1. Crie uma cópia do arquivo de vídeo mp4 em outro local do seu PC. (por exemplo, na sua área de trabalho) <br> 2. Renomeie o arquivo de vídeo da seguinte maneira: </p> <blockquote><p> uma. Dê um nome de arquivo mais curto no arquivo de vídeo e ... <br> b. Remova quaisquer caracteres especiais de seu nome. (sublinhados, parênteses, etc.). </p></blockquote> <p> 3. Abra o arquivo de vídeo no Adobe Premiere. </p> <p> </p> <h6> Método 3. Altere a extensão do nome do arquivo de MP4 para MOV. </h6> <p> O próximo método para contornar o erro do Adobe Premiere &quot;O arquivo não tem fluxos de áudio ou vídeo&quot; é alterar a extensão do arquivo de vídeo de .mp4 para .mov (ou vice-versa). Fazer isso: </p> <p> 1. No Explorador de Arquivos, clique em <strong> Visualizar </strong> -&gt; <strong> Opções </strong> -&gt; <strong> Alterar as opções de pasta e pesquisa </strong> . </p> <p><img src=\"images/image_thumb-45-776.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Em <strong> Visualizar </strong> aba, <strong> Claro </strong> a caixa &quot;Ocultar as extensões dos tipos de arquivo conhecidos&quot; e clique em <strong> OK </strong> . * </p> <p> * Observação: para tornar esta configuração permanente, clique em &#39;Aplicar às pastas&#39; antes de clicar em OK. </p> <p><img src=\"images/image_thumb-46-490.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Agora, prossiga e renomeie / altere a extensão do arquivo de vídeo, da seguinte forma: </p> <ul> <li> Se o arquivo de vídeo estiver no formato MP4 (.mp4), altere sua extensão para .mov </li> <li> Se o arquivo de vídeo estiver no formato MOV (.mov), altere sua extensão para .mp4 </li> </ul> <p><img src=\"images/image_thumb-47-586.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Finalmente, abra o arquivo de vídeo no Adobe Premiere. </p> <p> </p> <p> </p> <h6> Método 4. Limpe o banco de dados do cache de mídia e os arquivos de cache. </h6> <p> Ao importar um arquivo de mídia (vídeo ou áudio) e ao trabalhar com esse arquivo no Adobe Premiere, o programa cria os arquivos de cache de mídia para um desempenho mais rápido. Além disso, o programa cria links para esses arquivos de cache no banco de dados do cache de mídia. Com o passar do tempo, esses arquivos de cache de mídia e o banco de dados do cache de mídia podem se tornar muito grandes ou corrompidos e precisam ser limpos para evitar problemas. </p> <p> Portanto, o próximo método para resolver o &quot;Arquivo sem fluxos de áudio ou vídeo&quot; no Premiere é limpar o &quot;Banco de dados do cache de mídia&quot; e excluir os arquivos de cache. Fazer isso: * </p> <p><strong> A. Como limpar o banco de dados do cache de mídia do Adobe Premiere. </strong></p> <p> 1. Abra o Adobe Premiere. <br> 2. No menu, vá para <strong> Editar </strong> -&gt; <strong> Preferências </strong> -&gt; <strong> Meios de comunicação. <br> </strong> 3. Em Banco de dados de cache de mídia, clique no botão <strong> Limpar </strong> botão. </p> <p><img src=\"images/image_thumb-48-167.png\" alt=\"Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> 4 <strong> Reiniciar </strong> Adobe Premiere e tente abrir o arquivo de vídeo. se o erro &quot;O arquivo não tem fluxos de áudio ou vídeo&quot; persistir, prossiga para limpar os arquivos de cache do Adobe Premiere seguindo as instruções abaixo: </p> <p><strong> B. Como limpar os arquivos de cache de mídia do Adobe Premiere. </strong></p> <p> 1 <strong> Abrir </strong> Adobe Premiere. <br> 2. No menu, vá para <strong> Editar </strong> -&gt; <strong> Preferências </strong> -&gt; <strong> Meios de comunicação. <br> </strong> 3. Em Arquivos de cache de mídia, clique no botão <strong> Navegar </strong> botão ou observe a localização dos arquivos de cache de mídia. </p> <p><img src=\"images/image_thumb-49-331.png\" alt=\"FIX: Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> </p> <p> 4 <strong> Perto </strong> Adobe Premiere. <br> 5. No Explorador de Arquivos, <strong> excluir </strong> todo o conteúdo da pasta &quot;Arquivos de cache de mídia&quot;. <br> 6. Importe o arquivo de vídeo no Premiere. </p> <p> </p> <h6> Método 5. Recodifique o arquivo de vídeo. </h6> <p> O método final para resolver o &quot;Arquivo sem fluxos de áudio ou vídeo&quot; no processo de importação do Adobe Premiere é recodificar o arquivo de vídeo. Fazer isso: </p> <p> 1. Baixe e instale <a href=\"https://handbrake.fr/downloads.php\" target=\"_blank\" rel=\"nofollow noopener\"> Travão de mão </a> . <br> 2. Abra o travão de mão e clique <strong> Arquivo - abre um único arquivo de vídeo </strong> . </p> <p><img src=\"images/image_thumb-50-634.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Selecione o arquivo de vídeo que você não pode importar no Adobe Premiere e clique em <strong> Abrir </strong> . <br> 4. Defina o formato de saída para <strong> MP4, </strong> e então clique <strong> Navegar </strong> e especifique o local de armazenamento e o nome do arquivo do arquivo de vídeo de saída (recodificado). </p> <p><img src=\"images/image_thumb-51-817.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Em <strong> Dimensões </strong> guia, defina as mesmas dimensões do arquivo de origem. <br> 6. Quando terminar, clique em <strong> Inicie a codificação. </strong></p> <p><img src=\"images/image_thumb-52-713.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Quando o processo de codificação estiver concluído, feche o Handbrake. <br> 7. Abra o arquivo de vídeo recodificado no Adobe Premiere. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}