{"title":"Como impedir que o Windows 10 instale impressoras de rede automaticamente.","content":"<p> Como você já deve ter notado, o Windows 10 instala automaticamente os drivers para qualquer impressora ou outro dispositivo conectado à rede. Mas, embora seja um recurso muito útil, também é muito irritante, especialmente em ambientes comerciais, onde você pode não querer que todas as impressoras sejam usadas por todos os usuários da rede. </p> <p> Claro, se você não quiser um dispositivo de rede e os aplicativos de seu fabricante, você pode removê-lo do seu sistema. Mas, o Windows 10 irá instalá-lo automaticamente novamente. Para evitar isso, você deve impedir que o Windows instale automaticamente os dispositivos conectados à rede (impressoras, scanners, câmeras, etc.) e seus aplicativos e ícones personalizados do fabricante. </p> <h3> Como PARAR o Windows 10 para instalar dispositivos e aplicativos de rede automaticamente. </h3> <p> 1. Navegue para <strong> Painel de controle </strong> . Fazer isso: </p> <blockquote><p> uma. Digite &quot;painel de controle&quot; na caixa de pesquisa do Windows <br> b. Clique <strong> Painel de controle </strong> a partir dos resultados. </p></blockquote> <p><img src=\"images/image_thumb-53-862.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Defina o <strong> Visto por </strong> para <strong> Ícones pequenos </strong> para ver todos os itens do painel de controle e clique em <strong> Centro de Rede e Compartilhamento. </strong></p> <p><img src=\"images/image_thumb-37-625.png\" alt=\"control panel network and sharing center\" loading=\"lazy\"></p> <p> </p> <p> 3. Escolha <strong> Configurações de compartilhamento avançadas </strong> à esquerda <strong> . </strong></p> <p><img src=\"images/image_thumb-38-656.png\" alt=\"Prevent Windows 10 to Install Network Printers Automatically\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Limpe o &quot; <strong> Ative a configuração automática de dispositivos conectados à rede &quot; </strong> e clique <strong> Salve as alterações. </strong></p> <p><img src=\"images/image_thumb-39-992.png\" alt=\"Turn Off automatic setup of network connected devices \" loading=\"lazy\"></p> <p> </p> <p><strong> Opcional: </strong> Se você deseja impedir que o Windows 10 baixe e instale automaticamente os aplicativos do fabricante e os ícones personalizados, para qualquer dispositivo conectado ao seu PC, então: </p> <blockquote><p> 1. Navegue para <strong> Painel de controle </strong> -&gt; <strong> Sistema </strong> . <br> 2. Clique <strong> Proteção do sistema </strong> à esquerda. <br> 3. Na guia Hardware, clique em <strong> Configurações de instalação do dispositivo </strong> . </p></blockquote> <p><img src=\"images/image_thumb-40-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. Em &#39;Configurações de instalação do dispositivo&#39;, escolha &quot; <strong> Não (seu dispositivo pode não funcionar como esperado) &quot; </strong> e clique <strong> Salvar alterações </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-728.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar este guia. </p>"}