{"title":"CORREÇÃO: Erro 0x80248007 na atualização do Windows 10 (resolvido)","content":"<p> Em um computador baseado no Windows 10, você pode receber a seguinte mensagem de erro ao tentar instalar as atualizações: &quot;Houve alguns problemas na instalação das atualizações, mas tentaremos novamente mais tarde. Se você continuar vendo isso e quiser pesquisar na web ou entrar em contato com o suporte para obter informações, isso pode ajudar: (0x80248007) &quot;. O erro de atualização do Windows 10 0x80248007 normalmente aparece se os arquivos do Windows Update estiverem corrompidos ou se o Windows não puder receber atualizações devido à rede questões. </p> <p><img src=\"images/image_thumb-14-418.png\" alt=\"FIX Error 0x80248007 in Windows 10 Update \" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contém instruções para solucionar o erro 0x80248007 ao instalar atualizações no Windows 10. </p> <h4> Como resolver o erro 0x80248007 no Windows 10 Update. </h4> <h6> Etapa 1. Faça uma varredura em seu computador em busca de vírus. </h6> <p><strong> Importante: </strong> Muitos vírus ou programas maliciosos podem causar problemas com a atualização do Windows. Portanto, antes de continuar com as etapas de solução de problemas abaixo, use este <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Guia de verificação e remoção de malware </a> para verificar e remover vírus e / e programas maliciosos que podem estar em execução no seu computador. </p> <p> </p> <h6> Etapa 2. Execute o Windows Update Troubleshooter. </h6> <p> 1. Navegue para o Windows <strong> Painel de controle </strong> , defina &#39;Exibir por&#39; para <strong> Ícones pequenos </strong> e aberto <strong> Solução de problemas. </strong></p> <p><img src=\"images/image_thumb-5-564.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Em Opções de solução de problemas, clique em <strong> Corrija problemas com o Windows Update. </strong></p> <p><img src=\"images/image_thumb-9-777.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Clique <strong> Próximo </strong> para solucionar problemas de atualização do Windows. </p> <p><img src=\"images/image_thumb-8-840.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Quando o processo de solução de problemas for concluído, <strong> perto </strong> o solucionador de problemas e <strong> reiniciar </strong> seu PC. <br> 6. Verifique se há atualizações. </p> <h6> Etapa 3. &quot;Reconstrua&quot; a pasta SoftwareDistribution. </h6> <p> O &quot; <strong> Distribuição de Software </strong> &quot;pasta (C: WindowsSoftwareDistribution), é o local onde o Windows armazena as atualizações do Windows. Algumas vezes esta pasta está corrompida e você deve recriá-la, a fim de baixar e instalar as atualizações do zero. Para reconstruir (recriar) a pasta &quot;SoftwareDistribution&quot; siga as etapas abaixo: </p> <p> 1. Abra o painel de controle dos Serviços do Windows: Para fazer isso: </p> <ul> <li> Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-939.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando Executar. </li> <li> Na caixa de pesquisa, digite: <strong> services.msc </strong> e clique <strong> OK </strong> . </li> <li> (Aceite o aviso do UAC se ele aparecer). </li> </ul> <p><img src=\"images/image_thumb14_thumb_thumb-709.png\" alt=\"image_thumb[14]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 2. No painel de controle de Serviços, localize o <strong> atualização do Windows </strong> serviço. <br> 3. Clique com o botão direito em <strong> atualização do Windows </strong> serviço e selecione <strong> Pare </strong> . </p> <p><img src=\"images/image_thumb7_thumb_thumb-509.png\" alt=\"image_thumb[7]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 4 <strong> </strong> Abra o Windows Explorer e navegue até: <strong> C: Windows </strong> pasta. <br> 5. Encontre e <strong> Excluir </strong> a <strong> Distribuição de Software </strong> pasta. </p> <p> </p> <p><img src=\"images/image_thumb9_thumb_thumb-248.png\" alt=\"image_thumb[9]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 6 <strong> Reiniciar </strong> seu computador e verifique se há atualizações. </p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}