{"title":"CORREÇÃO: o vídeo do YouTube não carrega no Firefox (resolvido)","content":"<p> Se você não consegue reproduzir vídeos do YouTube com o navegador Mozilla Firefox, leia este tutorial para saber como resolver o problema. (Vídeo do YouTube não carrega / não é reproduzido no Firefox). </p> <p><img src=\"images/image_thumb-26-287.png\" alt=\"FIX YouTube Video Not Loading on Firefox \" loading=\"lazy\"></p> <h4></h4> <h4> Como CORRIGIR: Vídeos do YouTube não funcionam no Mozilla Firefox. </h4> <p> Quando os vídeos do YouTube não carregam no Firefox, prossiga para resolver o problema seguindo as etapas abaixo. </p> <h6> Etapa 1. Verifique se você pode assistir a vídeos com outro navegador. </h6> <p> A primeira etapa é determinar se o problema &quot;YouTube não funciona&quot; é encontrado apenas no Mozilla Firefox ou em outros navegadores instalados. Fazer isso. abra qualquer outro navegador da web (por exemplo, o &#39;Internet Explorer&#39;) e verifique se você pode assistir a vídeos do YouTube. Se você enfrentar o mesmo problema, verifique sua conexão com a Internet e, se estiver OK, atualize os drivers em seu adaptador de vídeo. Se você pode assistir a vídeos do YouTube com outro navegador, vá para a próxima etapa. </p> <p> </p> <h6> Etapa 2. Desative a aceleração de hardware no Firefox. </h6> <p> A próxima etapa para resolver o problema &quot;Os vídeos do YouTube não carregam no Firefox&quot; é desligar a aceleração de hardware no navegador Firefox. Fazer isso: </p> <p> 1. No menu do Firefox <img src=\"images/image_thumb-99-998.png\" alt=\"image\" loading=\"lazy\"> escolher <strong> Opções </strong> . </p> <p><img src=\"images/image_thumb-20-408.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Role para baixo e sob a configuração de desempenho <strong> desmarque </strong> a &quot; <strong> Use as configurações de desempenho recomendadas </strong> &quot;caixa e então <strong> desmarque </strong> a &#39; <strong> Use aceleração de hardware quando disponível </strong> &quot; caixa. </p> <p><img src=\"images/image_thumb-21-429.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Feche e reinicie o Firefox e tente reproduzir um vídeo no YouTube. Se o problema persistir, vá para a próxima etapa. </p> <p> </p> <h6> Etapa 3. Limpar dados de navegação (cookies, cache, etc.). </h6> <p> A próxima etapa para resolver o problema &quot;O vídeo do YouTube não carrega&quot; no Firefox é excluir os dados de navegação. Para fazer isso: </p> <p> 1. Abra o Firefox e pressione simultaneamente <strong> Ctrl </strong> + <strong> Mudança </strong> + <strong> Excluir. <br> </strong> 2. Escolha Tudo na parte superior e clique em <strong> Limpe Agora. </strong></p> <p><img src=\"images/image_thumb-22-346.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3 <strong> Reiniciar </strong> Firefox e tente assistir a vídeos do YouTube. </p> <p> </p> <h6> Etapa 4. Redefina o Firefox para as configurações padrão. </h6> <p> Às vezes, os vídeos do YouTube não carregam no Mozilla Firefox, devido a uma extensão do Firefox danificada. Para contornar o problema, prossiga e redefina o Firefox para as configurações padrão. Fazer isso: </p> <p> 1. No menu do Firefox <img src=\"images/image_thumb-99-692.png\" alt=\"image\" loading=\"lazy\"> escolher <strong> Ajuda </strong> &gt; <strong> Informações sobre solução </strong> . </p> <p><img src=\"images/image_thumb-23-384.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Clique <strong> Reinicie com complementos desabilitados. </strong></p> <p><img src=\"images/image_thumb-24-987.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Após reiniciar o Firefox, tente reproduzir um vídeo no YouTube e, dependendo do efeito, execute a ação sugerida: </p> <ul> <li><strong> Caso A. </strong> Se o problema for resolvido e você puder assistir a vídeos, prossiga e desabilite um por um os Add-ons (Extensões) instalados até descobrir qual deles está causando o problema. </li> <li><strong> Caso B. </strong> Se você ainda não consegue reproduzir vídeos no YouTube, navegue novamente para a tela &quot;Informações de solução de problemas&quot; e clique em <strong> Atualize o Firefox </strong> para redefinir o navegador para as configurações padrão. </li> </ul> <p><img src=\"images/image_thumb-25-312.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Outras soluções para resolver o problema &quot;Os vídeos do YouTube não abrem no Firefox&quot;. </h6> <blockquote><p><strong> 1 </strong> Atualize o Mozilla Firefox acessando: Menu do Firefox <img src=\"images/image_thumb-99-394.png\" alt=\"image\" loading=\"lazy\"> &gt; <strong> Ajuda </strong> &gt; <strong> Sobre o Firefox. </strong></p> <p><strong> 2 </strong><a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Verifique se há vírus, malware, etc. em seu computador </a></p> <p><strong> 3 </strong> Atualize os drivers do adaptador de vídeo. </p> <p><strong> 4 </strong> <a href=\"https://www.repairwin.com/how-to-completely-uninstall-firefox-remove-user-data/\" target=\"_blank\" rel=\"nofollow noopener\"> Desinstale e reinstale completamente o Firefox </a> . </p> <p><strong> 5 </strong> Use outro navegador da web. </p></blockquote> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}