{"title":"CORREÇÃO: problema de alto uso do disco SrTasks.exe (resolvido)","content":"<p> O seguinte problema pode aparecer em um computador com Windows 10. O &quot;SrTasks.exe&quot; faz com que o disco funcione a 100%. O processo &quot;SrTasks.exe&quot; (Tarefas em segundo plano de proteção do sistema da Microsoft) é um processo legítimo do Windows e usado para iniciar o Serviço de cópias de sombra de volume e o serviço Provedor de cópias de sombra de software da Microsoft. </p> <p> O processo &quot;SrTasks.exe&quot; inicia os serviços relacionados necessários para criar pontos de restauração e normalmente não deve afetar o desempenho do sistema continuamente, especialmente em sistemas onde a &quot;Proteção do Sistema&quot; está desativada. </p> <p><img src=\"images/image_thumb-58-374.png\" alt=\"FIX SrTasks.exe High Disk Usage - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contém instruções para resolver o problema de uso do disco 100% SrTasks.exe no Windows 10. </p> <h4> Como corrigir o alto uso do disco SrTasks.exe no Windows 10. </h4> <p> </p> <h6> Método 1. Faça uma varredura em seu computador em busca de malware e vírus. </h6> <p> A primeira etapa para solucionar o problema de &quot;alto uso do disco SrTasks.exe&quot; é garantir que seu sistema esteja livre de vírus / malware. Para essa tarefa, siga as instruções neste guia: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Como fazer uma varredura em seu computador em busca de vírus e outros programas maliciosos. </a></p> <p> </p> <h6> Método 2. Desative a proteção do sistema. </h6> <p> O segundo método para resolver o problema de alto uso do disco causado pelo processo &quot;SrTasks.exe&quot; é desabilitar a Proteção de Restauração do Sistema em seu PC. Fazer isso: </p> <p> 1. Abra o Windows explorer, clique com o botão direito em &quot;Este PC&quot; e escolha <strong> Propriedades </strong> . </p> <p><img src=\"images/image_thumb-70-978.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Escolha <strong> Proteção do sistema </strong> à esquerda. </p> <p><img src=\"images/image_thumb-71-135.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Destaque o <strong> Disco local C: (sistema) </strong> e clique <strong> Configure. </strong></p> <p><img src=\"images/image_thumb-59-973.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Nas opções de proteção do sistema, selecione <strong> Desativar proteção do sistema </strong> e clique <strong> OK. * </strong></p> <p> </p> <p> * Observação: se a &quot;Proteção do sistema&quot; já estiver desativada, passe para o próximo método. </p> <p><img src=\"images/image_thumb-60-732.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5 <strong> Reiniciar </strong> seu PC e depois verifique se o problema de alto uso do disco foi resolvido. Se o problema persistir, reative a proteção do sistema e passe para o próximo método. </p> <p> </p> <h6> Método 3. Desative o serviço Superfetch. </h6> <p> Em muitos casos, o problema de 100% de uso do disco é resolvido após a desativação do serviço Superfetch. Para desativar o serviço &quot;Superfetch&quot;: </p> <p> 1. Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-289.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Na caixa Pesquisar, digite: <strong><em> services.msc </em></strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-12-431.png\" alt=\"services.msc\" loading=\"lazy\"></p> <p> </p> <p> 3. Na lista de serviços, clique duas vezes no serviço Superfetch para abrir suas propriedades. <br> 4. Defina o &#39;Tipo de inicialização&#39; para <strong> Desativado </strong> e depois <strong> OK. </strong></p> <p><img src=\"images/image_thumb-61-575.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5 <strong> Reiniciar </strong> seu computador. Se após reiniciar o problema persistir, reative o serviço &quot;SuperFetch&quot; e prossiga para o próximo método. </p> <p> </p> <h6> Método-4. Execute Verificar disco para localizar e corrigir erros do disco rígido. </h6> <p> 1. Abra <strong> Prompt de comando como administrador </strong> . Fazer isso: </p> <p> </p> <p> 1. Pressione o <strong> janelas <img src=\"images/image_thumb-97-652.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> teclas para abrir a caixa de comando &#39;Executar&#39; <strong><br> </strong> 2. Digite <strong> CMD </strong> e então pressione <strong> CTRL </strong> + <strong> MUDANÇA </strong> + <strong> ENTRAR. </strong></p> <p><img src=\"images/image_thumb-35-581.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. No prompt de comando, dê o seguinte comando para reparar seu disco e pressione <strong> Entrar </strong> . </p> <ul> <li><strong> chkdsk C: / F / R </strong></li> </ul> <p> 3. Pressione o <strong> Y </strong> para agendar a verificação na próxima reinicialização. <br> 4 <strong> Reiniciar </strong> seu computador. </p> <p><img src=\"images/image_thumb-62-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Agora aguarde o término do processo de verificação do disco. (levará várias horas). <br> 6. Quando o processo de verificação do disco for concluído, verifique se a &quot;Alta utilização do disco SrTasks.exe&quot; foi resolvida. </p> <p> </p> <p> </p> <h6> Método 5. Solucionar problemas do Windows executando as tarefas de manutenção. </h6> <p> 1. Navegue para <strong> Painel de controle </strong> e aberto <strong> Solução de problemas </strong> . * </p> <p> * Observação: se você não vir o <strong> Solução de problemas </strong> opção, defina &#39;Exibir por&#39; para <strong> Ícones pequenos. </strong></p> <p><img src=\"images/image_thumb-63-494.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Em &#39;Sistema e Segurança&#39;, selecione <strong> Executar tarefas de manutenção </strong> . </p> <p><img src=\"images/image_thumb-27-812.png\" alt=\"run maintenance in windows 10 & Windows 8\" loading=\"lazy\"></p> <p> </p> <p> 3. Pressione <strong> Próximo </strong> e aguarde até que o utilitário de manutenção do sistema detecte problemas. <br> 4. Siga as instruções na tela para corrigir os problemas encontrados. </p> <p> </p> <h6> Método 6. Reparar arquivos de sistema do Windows. </h6> <p> Outro método para resolver o problema de alto uso do disco SrTasks.exe no Windows 10 é reparar o Windows usando os comandos DISM e SFC. </p> <p> 1. Abra <strong> Prompt de comando como administrador </strong> . <br> 2. No prompt de comando, dê o seguinte comando e pressione <strong> Entrar: </strong></p> <ul> <li><strong> DISM.exe / Online / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-583.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Quando a operação DISM for concluída, digite o seguinte comando e pressione <strong> Entrar </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-428.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Agora aguarde até que o Verificador de arquivos do sistema repare os arquivos de sistema do Windows. <br> 5. Quando isso for feito, <strong> reiniciar </strong> seu computador. </p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}