{"title":"CORREÇÃO: Conjunto de pastas do Outlook não pode ser aberto. (RESOLVIDO)","content":"<p> Este tutorial contém instruções para resolver o seguinte erro no Microsoft Outlook: &quot;Não é possível iniciar o Microsoft Outlook. Não é possível abrir a janela do Outlook. O conjunto de pastas não pode ser aberto. O servidor não está disponível. Entre em contato com o administrador se esta condição persistir&quot;. </p> <p><img src=\"images/image_thumb-404.png\" alt=\"FIX: Cannot start Outlook. The set of folders cannot be opened\" loading=\"lazy\"></p> <p> O erro &quot;Não é possível abrir o conjunto de pastas&quot; do Outlook pode aparecer em todas as versões do Outlook e ocorre quando o arquivo de dados PST do Outlook está corrompido. Para corrigir o problema, prossiga e repare o arquivo de dados do Outlook, com as instruções abaixo. </p> <h4> Como CORRIGIR: o conjunto de pastas não pode ser aberto no Microsoft Outlook 2013, 2019, 2019. </h4> <p> 1. Navegue até o Painel de Controle do Windows. Fazer isso: </p> <blockquote><p> uma. Digite &quot;painel de controle&quot; na caixa de pesquisa do Windows <br> b. Clique <strong> Painel de controle </strong> a partir dos resultados. </p></blockquote> <p><img src=\"images/image_thumb-53-338.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> 2. Defina o <strong> Visto por </strong> para <strong> Ícones pequenos </strong> para visualizar todos os itens do painel de controle e clique em <strong> Correspondência </strong> . </p> <p><img src=\"images/image_thumb-54-403.png\" alt=\"control panel mail options\" loading=\"lazy\"></p> <p> 3. Clique no <strong> Arquivos de dados </strong> botão. </p> <p><img src=\"images/image_thumb-1-310.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Observe o nome e a localização do arquivo de dados &quot;Outlook.pst&quot; e feche todas as janelas abertas. * </p> <p> * Observação: se você tiver uma conta do Exchange (conta IMAP), verá um arquivo de dados .OST (por exemplo, &quot;Outlook.ost&quot;). Nesse caso, force o Outlook a recriar o arquivo &quot;.OST do Outlook corrompido, fazendo o seguinte: </p> <blockquote><p> 1. Clique <strong> Abrir local do Ficheiro </strong> . <br> 2 <strong> Renomear </strong> os dados OST da conta que está causando o problema (se você tiver mais de uma conta IMAP). <br> 3. Abra o Outlook para recriar o arquivo OST ... </p> <p><img src=\"images/image_thumb-2-778.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 5. Abra o Windows Explorer e localize o <strong> scanpst.exe </strong> ferramenta de reparo neste local: * </p> <ul> <li> C: \\ Arquivos de programas \\ Microsoft Office \\% OfficeVersion% \\ SCANPST.EXE </li> </ul> <p> * Nota: Abaixo são mencionados os locais do arquivo &quot;SCANPST.EXE&quot; de acordo com a versão do Office instalada. Se você não conseguir encontrar &quot;scanpst.exe&quot; nos locais acima, verifique: </p> <ul> <li> <ul> <li> C: \\ Arquivos de programas (x86) \\ Microsoft Office \\ root \\ Office16. </li> </ul> </li> </ul> <blockquote><p><strong> Outlook 2013 </strong><br> Windows de 32 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office15 <br> Windows de 64 bits&gt; C: \\ Arquivos de programas (x86) \\ Microsoft Office \\ Office15 <br> Outlook de 64 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office15 <br> Clique para executar&gt; C: \\ Arquivos de programas \\ Microsoft Office 15 \\ root \\ office15 <br> <strong><br> Outlook 2010 </strong><br> Windows de 32 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office14 <br> Windows de 64 bits&gt; C: \\ Arquivos de programas (x86) \\ Microsoft Office \\ Office14 <br> Outlook de 64 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office14 <br> <strong><br> Outlook 2007 </strong><br> Windows de 32 bits&gt; C: \\ Arquivos de programas \\ Microsoft Office \\ Office12 <br> Windows de 64 bits&gt; C: \\ Arquivos de programas (x86) \\ Microsoft Office \\ Office12 </p></blockquote> <p> 6. Clique duas vezes para <strong> abrir </strong> o SCANPST.EXE <br> 7. Clique <strong> Navegar </strong> . </p> <p><img src=\"images/image_thumb-55-538.png\" alt=\"scanpst.exe\" loading=\"lazy\"></p> <p> </p> <p> 8. Localize e selecione o arquivo de dados do Outlook corrompido (por exemplo, Outlook.pst) e clique em <strong> OK. </strong></p> <p> 9. Pressione o <strong> Varredura </strong> e seja paciente até que a ferramenta de reparo da caixa de entrada repare o arquivo corrompido. * </p> <p> * Nota: Na fase final de reparo, você será perguntado se deseja criar um backup. Responder &quot; <strong> sim </strong> &quot;para continuar a operação de reparo. </p> <p><img src=\"images/image_thumb-56-257.png\" alt=\"Outlook Inbox Repair Tool\" loading=\"lazy\"></p> <p> </p> <p> 10. Quando o processo de reparo for concluído, abra o Outlook. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}