{"title":"CORREÇÃO: o Windows não consegue instalar os arquivos necessários - Código de erro 0x80070570 (resolvido)","content":"<p> Este tutorial contém instruções para corrigir o erro de instalação do Windows 0x80070570: &quot;O Windows não pode instalar os arquivos necessários. O arquivo pode estar corrompido ou ausente. Certifique-se de que todos os arquivos necessários para a instalação estejam disponíveis e reinicie a instalação&quot;. O erro de instalação do Windows 0x80070570 geralmente aparece ao instalar o sistema operacional Windows 10, 8 ou 7 a partir de uma mídia de instalação USB 3.0. </p> <p><img src=\"images/image_thumb-17-309.png\" alt=\"FIX: Windows Cannot Install Required Files 0x80070570\" loading=\"lazy\"></p> <p> </p> <h4> Como consertar o Windows não consegue instalar os arquivos necessários - Código de erro 0x80070570 (Windows 10/8/7) </h4> <h6> Etapa 1. Desconecte qualquer dispositivo conectado. </h6> <p> A primeira etapa para resolver o erro 0x80070570 &quot;O Windows não pode instalar os arquivos necessários&quot; é desconectar qualquer outro dispositivo (por exemplo, unidades de disco rígido, disco rígido USB, placa USB sem fio) que não seja necessário para instalar o Windows. </p> <p> </p> <h6> Etapa 2. Desative o <strong> Dispositivo de segurança embutido </strong> . </h6> <p> O erro de instalação do Windows 10 &quot;O Windows não consegue instalar os arquivos necessários&quot; geralmente aparece em PCs HP onde o &#39;Dispositivo de segurança incorporada&#39; está habilitado por padrão. Para contornar o erro, prossiga e desabilite o dispositivo de segurança nas configurações do BIOS. Fazer isso: </p> <p> 1 <strong> Ligar </strong> o PC e <strong> Aperte </strong> a <strong> F10 </strong> para entrar nas configurações do BIOS. <br> 2. Usando as teclas de setas, navegue até <strong> Segurança </strong> -&gt; <strong> Segurança do dispositivo </strong> e pressione <strong> Entrar. <br> </strong> 3. Defina o <strong> Dispositivo de segurança embutido </strong> de &#39;Dispositivo disponível&#39; para <strong> Dispositivo oculto. </strong></p> <p><img src=\"images/image_thumb-23-480.png\" alt=\"FIX: HP SLOW RESTART\" loading=\"lazy\"></p> <p> </p> <p> 4. Pressione o <strong> F10 </strong> chave para aplicar a mudança. <br> 5 <b> Salvar alterações e sair f </b> configurações de bios rom. <br> 6. Instale o Windows 10. </p> <h6> Etapa 3. Use outra porta USB ou mídia de instalação. </h6> <p> O erro &quot;O Windows não consegue instalar os arquivos necessários&quot; geralmente ocorre se você configurar o Windows 10 a partir de uma mídia USB conectada a uma porta USB 3.0. Então, tente o seguinte: </p> <ol> <li> Verifique se você pode desativar o suporte USB 3.0 nas configurações do BIOS. </li> <li> Conecte a unidade USB a uma porta USB 2.0 (ou a outra porta USB). </li> <li> Se o seu PC não tiver uma porta USB 2.0, instale o Windows 10 a partir de uma unidade flash USB 2.0 ou de um DVD. </li> <li> Se você deseja instalar o Windows 10 em um sistema baseado em UEFI, use o utilitário RUFUS e crie uma mídia de instalação USB para &quot;UEFI&quot;. Se o seu sistema não suportar UEFI, crie uma mídia de instalação USB para um sistema baseado em &quot;Legado&quot;. (As instruções detalhadas para fazer isso podem ser encontradas aqui: <a href=\"https://www.repairwin.com/create-windows-usb-with-rufus-iso-to-usb/\" target=\"_blank\" rel=\"nofollow noopener\"> Como criar uma unidade de inicialização USB do Windows com o utilitário Rufus. </a></li> <li> Ré- <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> baixe o arquivo ISO do Windows </a> e crie uma nova mídia de instalação USB do Windows, usando RUFUS. </li> </ol> <p> </p> <h6> Etapa 4. Instale o Windows 10 de um dispositivo USB herdado. </h6> <p> Se você receber o erro &quot;O Windows não consegue instalar os arquivos necessários&quot;, ao configurar o Windows 10 a partir de uma mídia USB criada para o sistema UEFI, crie uma nova mídia USB para um sistema legado e inicialize a partir do dispositivo USB legado para instalar o Windows 10. </p> <p> </p> <h6> Etapa 5. Diagnosticar problemas de memória. </h6> <p> A terceira etapa para resolver o erro de configuração do Windows 0x80070570 é diagnosticar a existência de problemas na RAM. Para realizar essa tarefa, siga as instruções do seguinte artigo: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Como diagnosticar problemas de memória do computador com Memtest86 + </a></li> </ul> <p> </p> <h6> Etapa 6. Verifique se há problemas no disco rígido. </h6> <p> O erro de instalação do Windows 0x80070570 pode ocorrer se o disco rígido estiver danificado. Portanto, prossiga e diagnostique erros no HDD e substitua o disco rígido se necessário, seguindo as instruções neste guia: </p> <ul> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Melhores ferramentas de teste e diagnóstico de disco rígido para verificar a saúde do disco rígido </a></li> </ul> <h5></h5> <h6> Etapa 7. Verifique as conexões de cabo e hardware. </h6> <p> Se depois de executar as etapas acima, o erro de instalação do Windows 0x80070570 ainda aparecer, então: </p> <p> 1. Verifique todas as conexões de cabo e certifique-se de que o disco rígido esteja conectado corretamente. Além disso, se você possui um PC de mesa, substitua o cabo de dados do HDD. <br> 2. Tente instalar o Windows usando uma placa de vídeo (VGA) diferente, se possível. <br> 3. Atualize seu BIOS. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Por favor, deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar esse problema. </p>"}