{"title":"CORREÇÃO: o Windows 10 está extremamente lento após a instalação da v2004 ou Edge Chromιum (resolvido)","content":"<p> Muitos usuários relataram que seu PC está extremamente lento depois de instalar a atualização do Windows 10 2004 ou depois de instalar a nova versão baseada em Chromium do navegador Microsoft Edge. Se você estiver enfrentando um dos problemas mencionados acima, siga as instruções neste artigo para resolvê-los. </p> <p> Problema nos detalhes: depois de atualizar o Windows 10 para a versão 2004 ou após instalar <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> atualização, que instala automaticamente o novo navegador Edge (versão Chromium), o Windows demora muito para inicializar ou está muito lento. </p> <h4> Como corrigir: Problemas de inicialização lenta e desempenho lento no Windows 10 2004. </h4> <h6> Método 1. Instale as atualizações disponíveis do Windows e os drivers de dispositivo de atualização. </h6> <p> O primeiro método para resolver os problemas de desempenho lento no Windows 10 é realizar as seguintes etapas: </p> <ul> <li><strong> Passo 1. </strong> Baixe e instale todas as atualizações do Windows disponíveis. </li> <li><strong> Passo 2. </strong> Baixe e instale os drivers mais recentes do Windows 10 para o adaptador de vídeo. </li> <li><strong> Etapa 3. </strong> Se você estiver usando um programa antivírus de terceiros, desinstale-o e verifique se as persiste problema de desempenho lento. Caso contrário, instale a versão mais recente do programa AV. </li> </ul> <p> </p> <h6> Método 2. Desinstale a versão do Microsoft Edge Chromium. </h6> <p> O segundo método para corrigir os problemas de desempenho lento no Windows 10 é desinstalar a versão do Microsoft Edge Chromium (se estiver instalada). </p> <h5> Etapa 1. Verifique se a nova versão baseada em Chromium do Microsoft Edge está instalada. </h5> <p> 1. No menu Iniciar <img src=\"images/image_thumb2_thumb_thumb-381.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clique <strong> Definições </strong><img src=\"images/image_thumb-66-515.png\" alt=\"image\" loading=\"lazy\"> e clique <strong> Apps. <br> </strong> 2. Se o <strong> Aplicativos e recursos </strong> localize o aplicativo Microsoft Edge e de acordo com seu ícone proceda da seguinte forma: </p> <ul> <li> Se você vir esta imagem de ícone <img src=\"images/image_thumb-32-976.png\" alt=\"image\" loading=\"lazy\"> , significa que a nova versão do Microsoft Edge baseada no Chromium já está instalada no seu computador. Neste caso, vá para <strong> <a href=\"#step-2\" target=\"_blank\" rel=\"nofollow noopener\"> passo 2 </a></strong> para desinstalar o Edge Chromium do seu PC. </li> <li> Se você vir esta imagem de ícone <img src=\"images/image_thumb-33-372.png\" alt=\"image\" loading=\"lazy\"> , significa que a nova versão baseada no Chromium ainda não está instalada no seu computador. Neste caso, pule para <a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"><strong> método-3 </strong></a> . </li> </ul> <p><img src=\"images/image_thumb-71-268.png\" alt=\"FIX: Windows 10 Running Extremely Slow after 2004 Update\" loading=\"lazy\"></p> <p> </p> <h5> Etapa 2. Remova o Edge Chromium do PC. </h5> <p> Para desinstalar o novo Edge baseado em Chromium no Windows 10: </p> <p> 1. Navegue até a seguinte pasta em seu PC: * </p> <ul> <li> C: \\ Arquivos de programas (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </li> </ul> <p> * Observação: o nome da pasta &quot;85.0.564.41&quot; indica a versão instalada da nova versão do Chromium e pode ser diferente em seu PC. </p> <p> 2. Selecione o caminho da pasta na barra de endereço e clique com o botão direito&gt; <strong> Cópia de. </strong></p> <p><img src=\"images/image_thumb-35-379.png\" alt=\"Uninstall Edge Chromiun\" loading=\"lazy\"></p> <p> </p> <p> 3. Abra <strong> Prompt de comando como administrador, </strong> modelo <strong> CD </strong> e então pressione <strong> CTRL + V </strong> para colar no caminho da pasta copiada. Quando terminar, pressione <strong> Entrar </strong> . * </p> <p> * ex .: No exemplo atual, o comando será: </p> <p><em> cd C: \\ Arquivos de programas (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </em></p> <p><img src=\"images/image_thumb-36-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Agora, dê o comando abaixo (Copiar / Colar) no prompt de comando para remover a versão Chromium do navegador Microsoft Edge do seu PC. </p> <ul> <li> setup.exe –uninstall –system-level –verbose-logging –force-uninstall </li> </ul> <p><img src=\"images/image_thumb-37-229.png\" alt=\"Remove Edge Chromiun\" loading=\"lazy\"></p> <p> 5. Assim que o comando acima for executado, a versão antiga do EDGE será ativada novamente. Reinicie o seu PC para aplicar as alterações. <br> 6. Após reiniciar, prossiga para instalar manualmente o <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> novo navegador Edge baseado em Chromium </a> no seu PC, para evitar instalar novamente a problemática atualização KB4559309. </p> <p> </p> <h6> Método 3. Restaure o Windows 10 para sua versão anterior. </h6> <p> 1. Do <strong> Começar </strong> cardápio <img src=\"images/image_thumb2_thumb_thumb-872.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> abrir <strong> Definições </strong> <img src=\"images/image_thumb-66-969.png\" alt=\"image\" loading=\"lazy\"> e então clique <strong> Atualização e segurança. </strong></p> <p> 2. Escolha <strong> Recuperação </strong> à esquerda e, na seção &quot;Voltar para a versão anterior do Windows 10&quot;, clique no botão <strong> iniciar </strong> botão. </p> <p><img src=\"images/image_thumb-4-708.png\" alt=\"Restore Windows to earlier version\" loading=\"lazy\"></p> <p> 3. Siga as instruções na tela para restaurar o Windows 10 para sua versão anterior. <br> 4. Depois de retornar à versão anterior do Windows 10, o computador deverá funcionar normalmente novamente e sem atrasos. </p> <p> </p> <h6> Método 4. Repare o Windows 10. </h6> <p> O próximo método para resolver os problemas de desempenho lento no Windows 10 é reparar o Windows usando os comandos SFC e DISM: </p> <p> 1. Abra <strong> Prompt de comando como administrador </strong> . <br> 2. No prompt de comando, dê o seguinte comando dism e pressione <strong> Entrar: </strong></p> <ul> <li><strong> DISM.exe / Online / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-175.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> </p> <p> 3. Quando a operação DISM for concluída, digite o seguinte comando e pressione <strong> Entrar </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb31-316.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Agora aguarde até que o Verificador de arquivos do sistema repare os arquivos de sistema do Windows. <br> 5. Quando isso for feito, <strong> reiniciar </strong> seu computador e veja se o problema foi resolvido. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}