{"title":"Como reiniciar um servidor HP a partir da interface iLO.","content":"<p> Neste tutorial, encontraremos instruções passo a passo sobre como reiniciar um servidor HP remotamente, usando a interface iLO da HP. HP Integrated Lights-Out (iLO) é um componente de hardware nos servidores HP, que geralmente é integrado na placa de sistema. O componente iLO tem sua própria conexão de rede, endereço IP e interface da web e pode ajudar o usuário a acessar e gerenciar remotamente o servidor. </p> <h4> Como reinicializar um servidor HP usando a interface da web do iLO 5. </h4> <p> Para reiniciar um servidor se ele travar, na interface do iLO: </p> <p> 1. Em outro computador, abra um navegador da web e, na barra de endereço, digite o endereço IP da interface do iLO no servidor que deseja reinicializar. <br> 2. Digite o nome de usuário do iLO e a senha e clique em <strong> Conecte-se </strong> . </p> <p><img src=\"images/image_thumb-8-790.png\" alt=\"restart hp proliant server from ilo\" loading=\"lazy\"></p> <p> </p> <p> 3. Escolha <strong> Energia e Térmica </strong> à esquerda. <br> 4. Na seção do Botão Liga / Desliga Virtual, clique no botão <strong> Redefinir </strong> botão para reiniciar o servidor HP. * </p> <p> * Informação: </p> <ul> <li> O virtual <strong> Redefinir </strong> botão tem a mesma função que o <strong> Reiniciar </strong> comando no sistema operacional (inicialização a quente). </li> <li> O virtual <strong> Bota fria </strong> botão tem a mesma ação que o <strong> Desligar </strong> comando no sistema operacional. Se você pressionar o botão &#39;Cold Boot&#39;, o servidor será encerrado e reiniciado após aproximadamente 8 segundos. </li> </ul> <p> <img src=\"images/image_thumb-9-784.png\" alt=\"How to Reboot an HP Server using iLO 5 web interface.\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}