{"title":"CORREÇÃO: Adobe Reader DC - Salvar como está em branco (resolvido)","content":"<p> Após uma atualização automática do Adobe Reader DC, ocorreu o seguinte problema: O recurso &quot;Salvar como&quot; exibe uma janela em branco (vazia) (em branco) que não permite ao usuário salvar o documento PDF. </p> <p><img src=\"images/image_thumb-38-290.png\" alt=\"Adobe Reader DC - Save As is blank - fix\" loading=\"lazy\"></p> <p> Este tutorial contém instruções para resolver o seguinte problema: O recurso &quot;Salvar como&quot; não funciona no Adobe Reader DC no Windows ou no MAC OS. </p> <h4> Como CORRIGIR: Salvar como está em branco no Adobe Reader DC. </h4> <h6> Método 1. Faça uma varredura em seu sistema em busca de vírus e malware. </h6> <p> A primeira etapa para resolver o problema de &quot;pastas ausentes&quot; no Outlook é garantir que seu sistema esteja livre de vírus / malware. Para essa tarefa, siga as instruções neste guia: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Como fazer uma varredura em seu computador em busca de vírus e outros programas maliciosos. </a></p> <p> </p> <h6> Método 2. Desative o armazenamento online ao salvar arquivos. </h6> <p> 1. Do Adobe Reader DC <strong> Editar </strong> clique no menu <strong> Preferências </strong> . </p> <p><img src=\"images/image_thumb-39-749.png\" alt=\"save as not working fix in Adobe Reader DC\" loading=\"lazy\"></p> <p> </p> <p> 2 <strong> Desmarque </strong> a <strong> Mostrar armazenamento online ao salvar arquivos </strong> e clique <strong> OK. * </strong></p> <p> * Nota: Opcionalmente, desmarque também o recurso &quot;Mostrar armazenamento online ao abrir arquivos&quot;. </p> <p><img src=\"images/image_thumb-40-312.png\" alt=\"save as blank - abobe reader DC - fix\" loading=\"lazy\"></p> <p> </p> <p> 3. Agora tente usar o recurso Salvar como no Adobe DC. O problema deve ser resolvido. </p> <p> </p> <h6> Método 3. Desinstale e reinstale o Adobe Reader DC. </h6> <p> O método final para resolver as janelas em branco no recurso &quot;Salvar como&quot; no Adobe DC é desinstalar completamente o Adobe Reader DC e, em seguida, baixar e reinstalar a versão mais recente do programa em <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> aqui </a> . </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe este post do blog nas redes sociais para ajudar a divulgar isso. </p>"}