{"title":"COMO: Excluir histórico da Internet, senhas e cookies de seu navegador da Web (Chrome, Firefox, IE)","content":"<p> Quando você visita um site com seu navegador, o site envia algumas informações para o navegador e o navegador armazena essas informações em pequenos arquivos de texto chamados <strong> biscoito </strong> s. Os cookies armazenam as preferências do usuário nesse site, por exemplo, as informações de login, para que o usuário não precise inserir novamente os detalhes de login (nome de usuário e / ou senha) quando voltar ao mesmo site. Os cookies também podem manter um histórico de quais páginas do site o usuário visitou, para que o usuário não precise se lembrar delas, ou navegar por todas as páginas do site, até encontrar o que deseja. </p> <p> Ao mesmo tempo, quando você visita um site, o navegador armazena uma cópia local de todas as páginas da web que você visitou, a fim de economizar a largura de banda da conexão e diminuir o tempo de carregamento das páginas da web na próxima vez que você as visitar. Esta &#39;cópia local de páginas da web &quot;é conhecida como&quot; <strong> Arquivos temporários de Internet </strong> &quot; de <strong> Cache </strong> . </p> <p> Cookies e Cache, depois de algum tempo, podem conter uma quantidade significativa de espaço em disco e é necessário limpá-los. Em outros casos, pode ser necessário excluir o cache do navegador e os cookies para recarregar totalmente o conteúdo do site ou por razões de segurança e privacidade: por exemplo, se você não quiser, uma terceira pessoa descubra quais páginas da web você visitou (também conhecido como: &quot; <strong> Histórico de navegação </strong> &quot;) ou quais são seus detalhes de login em um site (por exemplo, GMAIL). </p> <p> Neste tutorial, você encontrará duas (2) maneiras fáceis de excluir o Histórico de Navegação, Arquivos Temporários da Internet (Cache) e Cookies do Internet Explorer, Chrome e Firefox. </p> <h4> Como limpar o histórico de navegação na web, senhas salvas e cookies no Chrome, Firefox e Internet Explorer. </h4> <h5><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Método 1. Limpar dados de navegação de um navegador específico. </a></h5> <h5><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Método 2. Excluir dados de navegação de todos os navegadores da Web com um clique! </a></h5> <p> </p> <h5> Método 1. Excluir histórico, cache e cookies de um navegador específico. </h5> <p> Em geral, cada navegador da web tem opções para remover os dados de navegação armazenados por meio do menu Configurações / Opções, mas se você quiser acessar facilmente essas opções (sem ter que navegar com o mouse no menu do navegador), pressione <strong> Ctrl </strong> + <strong> Mudança </strong> + <strong> Excluir </strong> juntas na janela do navegador aberta. Então… </p> <p><strong> Para excluir o histórico de navegação, cache e cookies do Internet Explorer: </strong></p> <p> 1. Abra o Internet Explorer e pressione <strong> Ctrl </strong> + <strong> Mudança </strong> + <strong> Excluir. <br> </strong> 2. Selecione o tipo de informação que deseja excluir e clique no botão <strong> Excluir </strong> botão. </p> <p><img src=\"images/image_thumb-18-750.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> Para excluir o histórico de navegação, cache e cookies do Chrome: </strong></p> <p> 1. Inicie o Chrome e pressione <strong> Ctrl </strong> + <strong> Mudança </strong> + <strong> Excluir. <br> </strong> 2. Escolha o tipo de informação que deseja limpar e pressione <strong> APAGAR OS DADOS </strong> . </p> <p><img src=\"images/image_thumb-19-667.png\" alt=\"clear chrome history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p><strong> Para excluir o histórico de navegação, cache e cookies do Firefox: </strong></p> <p> 1. Abra o Firefox e pressione simultaneamente <strong> Ctrl </strong> + <strong> Mudança </strong> + <strong> Excluir. <br> </strong> 2. Selecione os dados que deseja remover do Firefox e clique em <strong> Limpe Agora. </strong></p> <p> </p> <p><img src=\"images/image_thumb-20-864.png\" alt=\"clear firefox history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> Método 2.Excluir histórico do navegador, cache e cookies de todos os navegadores da Web de uma vez. </h5> <p> Se você quiser tornar sua vida mais fácil, você pode usar o <a href=\"https://www.ccleaner.com/\" target=\"_blank\" rel=\"nofollow noopener\"> CCleaner </a> utilitário para excluir facilmente os arquivos temporários da Internet, histórico e cookies de todos os navegadores da Web que você usa, com um clique. </p> <p> 1 <a href=\"https://www.ccleaner.com/ccleaner/download\" target=\"_blank\" rel=\"nofollow noopener\"> Download </a> e instale a versão gratuita do utilitário CCleaner. </p> <p> 2. Lançamento <strong> CCleaner </strong> e navegue até o <strong> janelas </strong> e a <strong> Formulários </strong> opções da guia, para selecionar quais informações você deseja excluir dos navegadores da web. </p> <p> 3. Quando terminar, clique em <strong> Run Cleaner </strong> . </p> <p><img src=\"images/image_thumb-21-173.png\" alt=\"clear internet history cache cookies - ccleaner\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Isso é tudo! Isso funcionou para você? </p> <p> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}