{"title":"Como visualizar e exportar senhas do Firefox.","content":"<p> Neste tutorial, mostrarei como visualizar e gerenciar as senhas salvas no navegador Mozilla Firefox. Como você já sabe, o navegador Firefox oferece a opção de salvar seu nome de usuário e senha de login na primeira vez que visitar um site. Se você optar por salvar suas credenciais, o Firefox irá se lembrar delas e, da próxima vez que você entrar no site, não precisará digitá-las novamente. </p> <p><img src=\"images/image_thumb-98-507.png\" alt=\"How to View and Export Firefox Passwords.\" loading=\"lazy\"></p> <p> Se, com o tempo, você esquecer suas credenciais de login, leia este tutorial para aprender como visualizar e exportar senhas armazenadas do Firefox. </p> <h4> Como gerenciar, mostrar e exportar as senhas salvas no Mozilla Firefox. </h4> <p><strong> Como visualizar senhas do Firefox </strong></p> <p> 1. No menu do Firefox <img src=\"images/image_thumb-99-587.png\" alt=\"image\" loading=\"lazy\"> escolher <strong> Login e senhas </strong> . </p> <p><img src=\"images/image_thumb-100-999.png\" alt=\"View Saved Passwords Firefox\" loading=\"lazy\"></p> <p> </p> <p> 2. Clique no <strong> Mostrar senhas </strong> botão para visualizar as senhas salvas em sites. Além disso, nesta janela, use o <strong> Remover </strong> botão para remover as senhas salvas do Firefox. </p> <p><img src=\"images/image_thumb-101-863.png\" alt=\"Manage Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p><strong> Como salvar todas as senhas do Firefox em um arquivo. </strong></p> <p> Para visualizar e exportar todas as senhas armazenadas no Firefox: </p> <p> 1. Baixe <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> PasswordFox </a> Utilitário ( <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> http://www.nirsoft.net/utils/passwordfox.html </a> ) <br> 2. Extraia o arquivo zip baixado. <br> 3. Na pasta extraída, clique duas vezes para executar o aplicativo &quot;PasswordFox.exe&quot;. <br> 4. Pressione <strong> Ctrl </strong> + <strong> UMA </strong> para selecionar todos os sites listados e, em seguida, a partir do <strong> Arquivo </strong> escolha do menu <strong> Salvar itens selecionados. </strong></p> <p><img src=\"images/image_thumb-102-438.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Digite um nome para o arquivo .txt e clique em <strong> Salve  </strong> . </p> <p><img src=\"images/image_thumb-103-923.png\" alt=\"How to Save Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p> 6. Abra o arquivo criado no bloco de notas, para visualizar todas as senhas armazenadas no navegador Mozilla Firefox. </p> <p> Isso é tudo! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}