{"title":"Como fazer o login automático no Windows 10/8/7 (sem digitar uma senha).","content":"<p> Este tutorial contém instruções sobre como fazer o login automático no Windows 10. Na verdade, você aprenderá como fazer o login automaticamente na sua conta de usuário (conta da Microsoft, local ou de domínio), sem ter que inserir suas credenciais em Sign-in ou na tela de bloqueio . As instruções se aplicam ao sistema operacional Windows 10/8/7. </p> <p> Ao executar uma nova instalação do Windows 10, você será solicitado a especificar uma conta de usuário e uma senha para usar o computador. Nesta etapa, você pode usar sua conta da Microsoft (com a senha de sua conta do MS) ou para criar uma nova conta local e uma nova senha para entrar no Windows. Em ambos os casos (a menos que você crie uma conta local com uma senha em branco), será solicitado que você digite sua senha sempre que iniciar o Windows. </p> <p> Proteger seu próprio computador com uma senha é uma boa medida de segurança, especialmente se você compartilha seu computador com outras pessoas, ou quando viaja com seu laptop, ou quando seu PC pertence a um ambiente comercial. Mas, se você for o único usuário em seu computador desktop autônomo ou se estiver usando seu laptop apenas em casa, não há necessidade de digitar suas credenciais toda vez que quiser usá-lo. * </p> <p><strong> Aviso: </strong> NÃO ATIVE O LOGON AUTOMÁTICO no Windows se você compartilha seu computador com outras pessoas, ou se estiver viajando com seu laptop ou tablet, porque todos que encontrarem seu computador terão fácil acesso aos seus arquivos. </p> <h4> Como fazer login automaticamente em sua conta de usuário no Windows 10/8/7 / Vista. (Habilitar Login Automático) </h4> <h6> Método 1. Ative o Login automático usando o utilitário AUTOLOGON. </h6> <p> A Microsoft desenvolveu uma ferramenta para automatizar o processo de login no Windows. A ferramenta é chamada de &quot;Autologon&quot; e permite que você configure facilmente o Windows para login automático, sem ter que digitar suas credenciais a cada inicialização. A vantagem desta ferramenta, é que a senha é armazenada criptografada no registro. </p> <p> 1. Baixe <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/autologon\" target=\"_blank\" rel=\"nofollow noopener\"> Autologon </a> Utilitário. <br> 2. Extraia o arquivo baixado. <br> 3. Execute &quot;autologon.exe&quot; <br> 4. Digite sua senha e clique em <strong> Habilitar </strong> . </p> <p><img src=\"images/image_thumb-44-251.png\" alt=\"windows auto login\" loading=\"lazy\"></p> <p> * Nota: Se você deseja desativar o logon automático, execute o utilitário novamente e clique em <strong> Desabilitar </strong> . </p> <p> </p> <h6> Método 2. Habilite o login automático no painel de controle das contas do usuário. </h6> <p> O segundo método para habilitar o Login automático no Windows 10/8/7 é desabilitar a configuração &quot;Os usuários devem inserir um nome de usuário e senha para usar este computador&quot; no painel de controle das Contas do Usuário. Fazer isso: </p> <p> Nota: Se você estiver usando uma conta local, há outra maneira mais simples de forçar o Windows a entrar automaticamente: Basta especificar uma nova senha em branco (vazia) em Configurações&gt; Contas&gt; Opções de login&gt; Alterar senha. Em seguida, digite sua senha uma vez, clique em Avançar duas vezes e em Concluir. </p> <p> 1. Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-738.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Na caixa &quot;Abrir&quot;, digite: <strong> control userpasswords2 </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-29-873.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Nas opções de Contas de usuário (guia &#39;Usuários&#39;), <strong> desmarque </strong> a <strong> Os usuários devem inserir um nome de usuário e uma senha para usar a caixa de seleção deste computador </strong> e então clique <strong> Aplicar. * </strong></p> <p> * Observação: se desejar desativar o login automático no futuro, basta marcar esta caixa. </p> <p><img src=\"images/image_thumb-32-315.png\" alt=\"auto login windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Digite (duas vezes) a senha da sua conta e clique em <strong> OK </strong> duas vezes para fechar as propriedades da conta do usuário. </p> <p><img src=\"images/image_thumb-31-509.png\" alt=\"Auto Login to Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Método 3. Habilite o login automático no registro (Windows 10/8/7 / Vista). </h6> <p> O método final para desabilitar o login por senha, nos sistemas operacionais Windows 10, 8 ou 7, é habilitar o registro de login automático. Fazer isso: </p> <p> 1. Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-512.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Na caixa &quot;Abrir&quot;, digite: <strong> regedit </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb7-114.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Navegue até esta chave no painel esquerdo: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows NT \\ CurrentVersion \\ Winlogon </li> </ul> <p> 4. No painel direito: </p> <blockquote><p> uma. Clique com o botão direito em um espaço vazio e selecione <strong> Novo </strong> &gt; <strong> Valor da string. </strong></p> <p><img src=\"images/image_thumb-38-930.png\" alt=\"image\" loading=\"lazy\"></p> <p> b. Renomeie o novo valor para <strong> DefaultUserName </strong> e pressione <strong> Entrar </strong> . <br> c. Abra o valor REG_SZ &#39;DefaultUserName&#39;. <br> d. Digite o nome da sua conta de usuário local ou conta da Microsoft e clique em <strong> OK </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-42-933.png\" alt=\"enable auto login registry\" loading=\"lazy\"></p> <p> </p> <p> 5a. Execute as mesmas etapas e crie um novo valor REG_SZ (String) e nomeie-o <strong> Senha padrão </strong> . <br> 5b. Clique duas vezes em &#39;DefaultPassword <strong> &#39; </strong> Valor REG_SZ, digite sua senha na caixa Dados do valor e clique em <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-43-192.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7a. Finalmente, crie um novo valor REG_SZ e nomeie-o <b> AutoAdminLogon </b> . <br> 7b. Clique duas vezes no valor &#39;AutoAdminLogon&#39;, digite <strong> 1 </strong> na caixa Dados do valor e clique em <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-41-705.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Feche o Editor do Registro e reinicie o PC. * </p> <p> * Notas: <br> 1. Se o seu computador fizer parte de um Domínio, você deverá criar outro valor REG_SZ com o nome <strong> DefaultDomainName </strong> e, em seguida, digite na caixa de dados do valor o nome do seu domínio. <br> 2. Para desativar o login automático no futuro, apenas exclua os valores de string recém-criados mencionados acima. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}