{"title":"CORREÇÃO: este modo do Windows só executa aplicativos verificados da Loja no Windows 10.","content":"<p> O erro &quot;Por segurança e desempenho, este modo do Windows só executa aplicativos verificados da Loja&quot; aparece quando o Windows 10 está sendo executado no Modo S ou devido a uma configuração em seu computador, que restringe a instalação de aplicativos e softwares de terceiros . </p> <p><img src=\"images/image_thumb-19-156.png\" alt=\"FIX: For security and performance, this mode of Windows only runs verified apps from the Store in Windows 10.\" loading=\"lazy\"></p> <p> Este tutorial contém instruções para resolver o erro &quot;Por segurança e desempenho, este modo do Windows só executa aplicativos verificados da Loja&quot;, ao tentar instalar um aplicativo de terceiros no Windows 10. </p> <h2> Como permitir a instalação de aplicativos de terceiros no Windows 10. </h2> <h5> Etapa 1. Descubra a versão do Windows 10 instalada. </h5> <p> 1. Pressione o Windows <img src=\"images/image_thumb8_thumb-1-482.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite o seguinte comando e pressione <strong> Entrar: </strong></p> <ul> <li><strong> Winver </strong></li> </ul> <p><img src=\"images/image_thumb-13-360.png\" alt=\"See Windows 10 Installed Version\" loading=\"lazy\"></p> <p> 3. Agora, se você vir no Windows Edition que está executando o Windows 10 Home ou Pro, siga as instruções em <a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Método 1 </a> , caso contrário, se você tiver <strong> Windows 10 Home S </strong> , siga as instruções em <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Método-2 </a> . </p> <p><img src=\"images/image_thumb-14-709.png\" alt=\"See Installed Windows 10 Edition\" loading=\"lazy\"></p> <p><strong> </strong></p> <p><strong> </strong></p> <h3> Método 1. Permita que o Windows 10 instale aplicativos de qualquer lugar. </h3> <p> 1. No menu Iniciar <img src=\"images/image_thumb2_thumb_thumb-909.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clique em Configurações <img src=\"images/image_thumb-66-797.png\" alt=\"image\" loading=\"lazy\"> e então abra <strong> Apps </strong> . </p> <p><img src=\"images/image_thumb-15-604.png\" alt=\"Windows Settings - Apps\" loading=\"lazy\"></p> <p> </p> <p> 2. Em Configurações de aplicativos e recursos, selecione para instalar aplicativos de <strong> Em qualquer lugar </strong> . </p> <p><img src=\"images/image_thumb-16-670.png\" alt=\"Install Apps from Anywhere - Windows 10\" loading=\"lazy\"></p> <h3> Método 2. Saia do Modo Windows 10 S. </h3> <p> O Windows 10 no modo S foi projetado para segurança e desempenho e, por esse motivo, não permite a execução de aplicativos fora da Microsoft Store. Para contornar essa limitação, você precisa sair do modo S, que é uma maneira muito fácil, mas lembre-se de que depois de sair do modo S, você não poderá retornar ao Windows 10 no modo S </p> <p> Para sair do modo Windows 10 S para o Windows 10 Home: </p> <p> 1. No menu Iniciar <img src=\"images/image_thumb2_thumb_thumb-829.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clique em Configurações <img src=\"images/image_thumb-66-853.png\" alt=\"image\" loading=\"lazy\"> e então abra <strong> Atualização e segurança. </strong></p> <p> 2. Selecione <strong> Ativação </strong> à esquerda e depois clique <a href=\"//switchwindows\" target=\"_blank\" rel=\"nofollow noopener\"> Vá para a loja </a><strong> . </strong></p> <p><img src=\"images/image_thumb-17-920.png\" alt=\"Switch Out S Mode Windows 10\" loading=\"lazy\"></p> <p> 3. Na página Switch out of S Mode, clique <strong> Obter </strong> e então clique <strong> Instalar. </strong> * <br> 4. Finalmente clique <strong> Sim, vamos lá </strong> para sair do modo S. </p> <p> * Observação: se após clicar no botão &#39;Instalar&#39; você receber o erro &quot;Algo aconteceu e não foi possível iniciar a atualização&quot;, prossiga e <strong> instale todas as atualizações disponíveis do Windows 10 </strong> , <strong> reinicie o seu PC </strong> e tente novamente. </p> <p><img src=\"images/image_thumb-18-502.png\" alt=\"Switch Out S Mode\" loading=\"lazy\"></p> <p> </p> <p> 4. Quando a instalação for concluída, você será informado de que poderá instalar aplicativos de fora da Microsoft Store. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}