{"title":"CORREÇÃO: o Chrome sempre abre as opções Navegar como visitante - Alternar pessoa na inicialização.","content":"<p> O tutorial contém instruções sobre como evitar que o Chrome exiba a janela &quot;Alternar pessoa - Navegar como visitante&quot; na inicialização. Problema nos detalhes: Em um computador baseado em Windows, o navegador Google Chrome sempre abre as opções &quot;Navegar como visitante&quot; e &quot;Adicionar pessoa&quot; na inicialização e o usuário deve sempre selecionar seu perfil para usar o navegador Chrome. </p> <p><img src=\"images/image_thumb-26-805.png\" alt=\"FIX Remove Chrome Browse as Guest\" loading=\"lazy\"></p> <p> </p> <h4> Como remover a janela de opções &quot;Navegador como convidado - Adicionar pessoa&quot; na inicialização do Chrome. </h4> <h6> Método 1. Verifique se o Chrome está configurado para sempre iniciar no modo de navegação como visitante. </h6> <p> Um dos recursos mais úteis do navegador Google Chrome é criar vários perfis de usuário, especialmente se você compartilha seu computador com outras pessoas ou se deseja separar seus favoritos e configurações entre suas várias contas. Nesse caso, você sempre pode iniciar o Chrome com a janela &quot;Alternar pessoa&quot;, adicionando uma das seguintes opções (entradas de texto) no atalho do Chrome: </p> <ul> <li><strong> –Profile-directory = &quot;Perfil de Convidado&quot; </strong></li> <li><strong> –Bwsi </strong></li> </ul> <p> </p> <p> Portanto, antes de mais nada, verifique se o Chrome está configurado para sempre abrir a janela &quot;Trocar de pessoa / Navegar como visitante&quot;. Fazer isso: </p> <p> 1. Feche o Google Chrome. <br> 2. Clique com o botão direito no atalho do Chrome em sua área de trabalho e selecione <strong> Propriedades </strong> . <br> 3. Em <strong> Atalho </strong> guia, olhe para o <strong> Alvo </strong> caixa de texto e (se houver) <strong> remover </strong> as entradas de texto acima no final e clique em <strong> OK </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-27-916.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Inicie o Chrome e na janela &quot;Mudar de pessoa&quot;, clique no ícone / imagem do seu perfil (&quot;Você&quot;). <br> 5 <strong> Reiniciar </strong> Cromada. </p> <p> </p> <h6> Método 2. Crie um novo perfil limpo do Google Chrome. </h6> <p> Por padrão, o Chrome armazena todas as configurações de Perfil (favoritos, senhas, extensões, etc.) dentro da pasta &quot;Dados do Usuário&quot; no seguinte local em seu computador: </p> <ul> <li><strong> C: \\ Users \\% Username% \\ AppData \\ Local \\ Google \\ Chrome \\ User Data </strong></li> </ul> <p> Se, por algum motivo, a pasta de perfil do Chrome for corrompida ou modificada indevidamente por malware, a melhor opção que você tem é forçar o Chrome a recriar uma nova pasta de perfil do Chrome (vazia *). Fazer isso: </p> <p><strong> * Atenção: </strong> Lembre-se de que, ao excluir a pasta de armazenamento do perfil do Chrome, você exclui todos os dados armazenados (favoritos, configurações, extensões, histórico, etc.). Portanto, antes de excluir seu perfil do Chrome, dê uma olhada <a href=\"https://www.repairwin.com/backup-restore-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> backup de seus favoritos do Chrome </a> caso você queira reinstalar o Chrome novamente. </p> <h5> Etapa 1: ative a visualização Arquivos e pastas ocultos. </h5> <p> 1. Abra <strong> Opções de Pasta </strong> . <br> 2. Em <strong> Visualizar </strong> aba, <strong> Verifica </strong> a <strong> Mostrar arquivos, pastas e unidades ocultas </strong> caixa de seleção e clique <strong> OK. </strong></p> <p><img src=\"images/image_thumb-6-189.png\" alt=\"enable hidden files folders\" loading=\"lazy\"></p> <h6></h6> <h5> Etapa 2. Forçar o Chrome a criar uma nova pasta de perfil (limpar). </h5> <p> 1 <strong> Perto </strong> Google Chrome. <br> 2 <strong> Abrir </strong> Windows Explorer e navegue até este local: </p> <ul> <li><strong> C: \\ Users \\% USERNAME% \\ AppData \\ Local \\ Google \\ Chrome \\ </strong></li> </ul> <p> * Onde% USERNAME% = Seu nome de usuário. (por exemplo, se seu nome de usuário for &quot;Admin&quot;, você deverá navegar até este caminho: &quot;C: \\ Usuários \\ Admin \\ AppData \\ Local \\ Google \\ Chrome&quot;) </p> <p> 3 <strong> Renomear </strong> a pasta &quot;Dados do usuário&quot; para &quot;Dados do usuário.BAK&quot;. </p> <p><img src=\"images/image_thumb-28-373.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Agora abra o Google Chrome. (Durante a inicialização, o Chrome criará automaticamente uma nova pasta &quot;Dados do usuário&quot; limpa para armazenar seus favoritos e configurações). </p> <p> </p> <h6> Métodos adicionais para resolver problemas do Chrome. </h6> <p><strong> 1 </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Verifique se há vírus, malware, etc. em seu computador </a></p> <p><strong> 2 </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Desinstale e reinstale completamente o Chrome. </a></p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}