{"title":"Como proteger uma pasta com senha no Windows 10 (Bloquear pasta com senha).","content":"<p> Este tutorial contém dois métodos diferentes, gratuitos e seguros para proteger uma pasta com senha no sistema operacional Windows 10/8/7. Se você bloquear uma pasta com uma senha, ela não ficará acessível a ninguém além de você. Proteger uma pasta com uma senha é útil nos casos em que você compartilha seu computador com outras pessoas e não deseja que outra pessoa acesse e leia seus arquivos privados. </p> <ul> <li><strong> Artigo relacionado: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Como proteger com senha o seu PC com Windows 10 com BitLocker </a> . </strong></li> </ul> <h4> Como bloquear uma pasta com uma senha no Windows 10. </h4> <h6> Método 1. Como bloquear e criptografar arquivos com 7-zip (todas as versões do Windows). </h6> <p> O método mais fácil e seguro, para proteger uma pasta com uma senha no Windows, é usando o utilitário 7-Zip archiver, que também suporta criptografia. Para criptografar e proteger com senha uma pasta / arquivo com 7-zip: </p> <p> 1. Baixe e instale o <a href=\"https://www.7-zip.org/\" target=\"_blank\" rel=\"nofollow noopener\"> 7-Zip </a> programa de arquivador. <br> 2. Clique com o botão direito na pasta (ou arquivo) que deseja proteger com uma senha e escolha: <strong> 7-Zip </strong> &gt; <strong> Adicionar ao arquivo </strong> . </p> <p><img src=\"images/image_thumb-28-978.png\" alt=\"How to Password Protect a Folder\" loading=\"lazy\"></p> <p> </p> <p> 3. Nas opções &#39;Adicionar ao arquivo&#39;, especifique uma senha forte e clique em <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-29-728.png\" alt=\"set password to archive with 7-zip\" loading=\"lazy\"></p> <p> </p> <p> 4. Em seguida, exclua a pasta descompactada (ou arquivo) e pronto! </p> <h6> Método 2. Como criptografar uma pasta com proteção EFS (Windows Pro e Enterprise). </h6> <p> A Proteção EFS é uma ferramenta de criptografia integrada, nas edições Windows 10 Professional e Enterprise. Se você protege uma pasta ou um arquivo com criptografia EFS fica muito difícil para outras pessoas acessarem os arquivos criptografados, sem ter a chave de descriptografia (chave PFX do certificado). </p> <p> A única desvantagem da criptografia EFS é que a criptografia será removida se você copiar os arquivos criptografados em outro computador da rede ou se enviar os arquivos criptografados por e-mail. </p> <p> Além disso, quando você criptografa seus arquivos EFS, a chave de descriptografia (certificado) é armazenada localmente em seu computador. Isso significa que qualquer pessoa com sua senha também terá acesso aos seus arquivos criptografados. Por esse motivo, se você criptografar seus arquivos com a criptografia EFS, especifique uma senha de login forte e não a compartilhe com outras pessoas. </p> <ul> <li><strong> Artigo relacionado: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> Como descriptografar arquivos criptografados com EFS e remover a criptografia EFS. </a></strong></li> </ul> <p><strong> Para criptografar uma pasta ou arquivo com EFS: </strong><br> 1. Clique com o botão direito na pasta (ou arquivo) que deseja proteger e selecione <strong> Propriedades </strong> . <br> 2. Na guia Geral, clique em <strong> Avançado </strong> . </p> <p><img src=\"images/image_thumb-13-582.png\" alt=\"enable efs protection\" loading=\"lazy\"></p> <p> </p> <p> 3. Selecione <strong> Criptografar arquivos para proteger os dados </strong> e então clique <strong> OK. </strong></p> <p><img src=\"images/image_thumb-14-983.png\" alt=\"How to Lock Folder with Password - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Em seguida, clique em <strong> Aplicar </strong> e <strong> OK </strong> novamente para salvar as alterações e sair. <br> 5. Neste ponto, o Windows solicitará que você faça backup da chave de recuperação. Clique <strong> Faça backup de sua chave de criptografia de arquivo. </strong></p> <p><img src=\"images/image_thumb-2-823.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Em seguida, clique em <strong> Faça backup agora (recomendado) </strong> e salve a chave do certificado de descriptografia em uma unidade USB. </p> <p><img src=\"images/image_thumb-15-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. No assistente de Exportação de Certificado, clique em <strong> Próximo </strong> na tela de boas-vindas. <br> 8. Em seguida, clique em <strong> Próximo </strong> novamente na tela Exportar formato de arquivo. </p> <p><img src=\"images/image_thumb-4-842.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. Nas opções de segurança: </p> <blockquote> <p> 1 <strong> Verificar </strong> a <strong> Senha </strong> caixa. <br> 2. Digite uma senha para a chave do certificado exportado. <br> 3. Selecione <strong> AES256-SHA256 </strong> criptografia <br> 4. Clique <strong> Próximo </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-16-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. Clique <strong> Navegar </strong> e <strong> Salve  </strong> o arquivo de certificado (.pfx) em seu computador. <br> 11. Quando terminar, clique em <strong> Próximo </strong> continuar. </p> <p><img src=\"images/image_thumb-17-804.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. Finalmente clique <strong> Terminar </strong> . </p> <p><img src=\"images/image_thumb-18-449.png\" alt=\"image\" loading=\"lazy\"></p> <p> 13. Quando a exportação for concluída, salve a chave do certificado exportado (arquivo .pfx) para outro local seguro (por exemplo, para um disco USB). </p> <p><strong> GORJETA: </strong> Quando você criptografa uma pasta (ou arquivos) com EFS, a chave de descriptografia (certificado) é armazenada em sua pasta de perfil de usuário. Portanto, se outro usuário tiver sua senha de login do Windows, ele poderá abrir e ler os arquivos criptografados. Para evitar que isso aconteça, não compartilhe sua senha de login ou remova (desinstale) o certificado de descriptografia de seu perfil ao sair do PC e reinstale-o quando voltar. * </p> <p> * Observação: para remover e reimportar a chave de recuperação (certificado), vá para: </p> <blockquote> <p> uma. <strong> Painel de controle </strong> &gt; <strong> Opções de Internet. <br> </strong> b. Em &#39;Opções da Internet&#39;, clique no <strong> Contente </strong> guia e clique em <strong> Certificado </strong> s. <br> c. Na guia &#39;Pessoal&#39;, clique no <strong> Remover </strong> botão, para remover a chave de descriptografia (certificado), ou clique no <strong> Importar </strong> botão para reinstalar o certificado de descriptografia da unidade USB. </p> </blockquote> <ul> <li> <p><strong> Artigo relacionado: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"noopener noreferrer\"> Como descriptografar arquivos criptografados com EFS e remover a criptografia EFS. </a></strong></p> </li> </ul> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar esta solução </p>"}