{"title":"CORREÇÃO: o programa não pode ser iniciado porque VCRUNTIME140.DLL está ausente (resolvido)","content":"<p> Este tutorial contém instruções para corrigir o seguinte erro na inicialização do Windows 10 ou quando você tenta executar ou instalar um programa: “O programa não pode iniciar porque VCRUNTIME140.dll está faltando em seu computador. Tente reinstalar o programa para resolver este problema&quot;. </p> <p><img src=\"images/image_thumb-31-814.png\" alt=\"FIX Program can’t start because VCRUNTIME140.DLL is missing\" loading=\"lazy\"></p> <p> </p> <p> O arquivo &quot;VCRUNTIME140.dll&quot; faz parte do Microsoft Visual C ++ 2015 e é exigido por aplicativos desenvolvidos com o Visual Studio 2015. Se o arquivo &quot;VCRUNTIME140.dll&quot; estiver ausente ou corrompido, o sistema exibirá a mensagem &quot;VCRUNTIME140.DLL está faltando &quot;erro sempre que o arquivo&quot; VCRUNTIME140.DLL &quot;é necessário para executar um aplicativo. </p> <h4> Como consertar: VCRUNTIME140.DLL está faltando. </h4> <p> 1. Baixe o <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=52685\" target=\"_blank\" rel=\"nofollow noopener\"> Pacote redistribuível do Microsoft Visual C ++ 2015 </a> . </p> <p><img src=\"images/image_thumb-32-401.png\" alt=\"fix VCRUNTIME140.DLL is missing\" loading=\"lazy\"></p> <p> </p> <p> 2. Na próxima tela, selecione de acordo com sua arquitetura do Windows (32 ou 64 bits), o arquivo &quot;vc_redist.exe&quot; correspondente para baixar (ou baixe os dois arquivos se não tiver certeza). </p> <p><img src=\"images/image_thumb-33-787.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Quando o download for concluído, clique duas vezes em &quot;vc_redist.exe&quot; que você baixou. <br> 4 <strong> Aceitar </strong> os termos da licença e clique em <strong> Instalar </strong> . </p> <p><img src=\"images/image_thumb-34-802.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar esse problema. </p>"}