{"title":"CORREÇÃO: problema de alto uso da CPU do Chrome (resolvido)","content":"<p> Se o seu sistema funciona com alto uso da CPU quando você abre o Chrome, então provavelmente uma extensão do Chrome instalada ou um programa de malware é o culpado. Para corrigir facilmente os problemas de alto uso da CPU no Google Chrome, siga as etapas abaixo. </p> <p><img src=\"images/image_thumb-46-593.png\" alt=\"FIX Chrome High CPU Usage\" loading=\"lazy\"></p> <p> </p> <h4> Como consertar o alto uso da CPU no Google Chrome. </h4> <h6> Etapa 1. Verifique se há malware e vírus em seu computador. </h6> <p> A primeira etapa antes de solucionar o erro &quot;ERR_CONNECTION_CLOSED&quot; no Chrome é garantir que seu sistema esteja livre de vírus / malware. Para essa tarefa, siga as instruções neste guia: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Como fazer uma varredura em seu computador em busca de vírus e outros programas maliciosos. </a></p> <p> </p> <h6> Etapa 2. Desative as extensões indesejadas do Chrome. </h6> <p> 1. No menu do Chrome <img src=\"images/image_thumb-47-125.png\" alt=\"image\" loading=\"lazy\"> , vamos para <strong> Mais ferramentas </strong> -&gt; <strong> Extensões </strong></p> <p><img src=\"images/image_thumb-51-680.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Remova (ou desative) qualquer extensão de que não precise ou que não reconheça. </p> <p><img src=\"images/image_thumb-49-396.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> 3 <strong> Reiniciar </strong> Google Chrome e veja se o problema de alto uso da CPU, ao executar o Chrome, foi resolvido. Se o problema persistir, desative ou - melhor - remova todas as extensões instaladas e reinicie o Chrome novamente. </p> <p> </p> <h6> Etapa 3. Crie um novo perfil do Chrome. </h6> <p> 1 <strong> Perto </strong> Cromada. <br> 2. Navegue até o local abaixo (de acordo com seu sistema operacional). </p> <blockquote><p> A. Se você usar <strong> Windows 10, 8, 7 </strong> ou <strong> Vista </strong> navegar para: </p> <ul> <li><strong> C: \\ Users \\% Username% \\ AppData \\ Local \\ Google \\ Chrome \\ </strong></li> </ul> <p> </p> <p> * por exemplo. Se o seu nome de usuário for “Usuário1”, a pasta de perfil do Chrome &quot; <strong> Dados do usuário </strong> &quot;, está armazenado em&quot; C: \\ Users \\ User1 \\ AppData \\ Local \\ Google \\ Chrome \\ <strong> Dados do usuário </strong> &quot; </p> <p> B. Se você usar <strong> Windows XP </strong> navegar para <strong> : </strong></p> <ul> <li><strong> C: \\ Documents and Settings \\\\% Username% \\ Local Settings \\ Application Data \\ Google \\ Chrome \\ </strong></li> </ul> <p> * por exemplo. ‘Se o seu nome de usuário for“ Usuário1 ”, a pasta de perfil do Chrome&quot; <strong> Dados do usuário </strong> &quot;está armazenado em&quot; C: \\ Documents and Settings \\ User1 \\ Local Settings \\ Application Data \\ Google \\ Chrome \\ <strong> Dados do usuário&quot; </strong></p></blockquote> <p> 3 <strong> Renomear </strong> a &quot; <strong> Dados do usuário </strong> &quot;pasta para&quot; <strong> User Data.OLD </strong> &quot; </p> <p><img src=\"images/image_thumb-50-745.png\" alt=\"create new chrome profile\" loading=\"lazy\"></p> <p> 4. Abra o Google Chrome e verifique se o problema persiste. Se o Chrome estiver funcionando corretamente * e não fizer com que a CPU funcione em níveis elevados, feche o Chrome e copie o arquivo &quot;Bookmarks&quot; da pasta &quot;User Data.OLD \\ Default&quot; para a pasta &quot; <strong> Dados do usuário \\ Padrão </strong> pasta \\ &quot;, para restaurar seus favoritos. </p> <p> * Observação: se o Google Chrome ainda fizer com que a CPU funcione a 100%, então <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> desinstalar completamente e reinstalar o Chrome. </a></p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}