{"title":"CORREÇÃO: 2147219196 Erro de sistema de arquivos no aplicativo Fotos do Windows 10 (resolvido)","content":"<p> Em um computador baseado no Windows 10 com o aplicativo &#39;Fotos&#39; como o aplicativo padrão para abrir imagens, aparece o &quot;Erro do sistema de arquivos&quot; -2147219196 &quot;quando o usuário tenta abrir uma imagem .JPG ou .PNG (com &#39;FOTOS&#39; aplicativo). </p> <p><img src=\"images/image_thumb-73-456.png\" alt=\"FIX: 2147219196 File system error in Photos app \" loading=\"lazy\"></p> <p> </p> <p> Este tutorial contém instruções para resolver o &quot;Erro do sistema de arquivos 2147219196&quot; ao abrir imagens no aplicativo Fotos do Windows 10. </p> <h4> Como CORRIGIR: Não é possível abrir imagens com o aplicativo &#39;Fotos&#39; no Windows 10 com o erro &quot;Erro de sistema de arquivos 2147219196&quot;. </h4> <p> Observação: antes de continuar a seguir, certifique-se de que seu sistema esteja totalmente atualizado. </p> <h6> Etapa 1. Execute o Solucionador de problemas de aplicativos da Windows Store. </h6> <p> 1. Navegue para <strong> Começar </strong> -&gt; <strong> Definições </strong> -&gt; <strong> Atualização e segurança </strong> . <br> 2. Escolha <strong> Resolução de problemas </strong> da esquerda e clique em <strong> Solucionador de problemas de aplicativos da Windows Store </strong> à direita e clique <strong> Execute o solucionador de problemas </strong> . </p> <p><img src=\"images/image_thumb-74-400.png\" alt=\"windows store apps troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 3. Siga as instruções na tela e deixe o solucionador de problemas corrigir os problemas. <br> 4. Quando a solução de problemas for concluída, feche a solução de problemas e tente abrir um arquivo de imagem. Se o erro persistir, prossiga para a próxima etapa. </p> <p><img src=\"images/image_thumb-75-371.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Etapa 2. Repare ou redefina o aplicativo Fotos. </h6> <p> Se você receber o &quot;2147219196&quot;, ao tentar abrir um arquivo .JPG ou .PNG com o aplicativo Fotos, tente reparar o aplicativo. Fazer isso: </p> <p> 1. Navegue para <strong> Começar </strong> -&gt; <strong> Definições </strong> -&gt; <strong> Apps. <br> </strong> 2. Em <strong> App e recursos, </strong> localize e selecione o <strong> Microsoft Photos </strong> e clique <strong> Opções avançadas. </strong></p> <p><img src=\"images/image_thumb-76-358.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Em Opções avançadas, clique no botão <strong> Reparar </strong> botão. <br> 4. Quando o processo for concluído, você verá uma marca de seleção <img src=\"images/image_thumb-77-553.png\" alt=\"image\" loading=\"lazy\"> próximo ao botão &#39;Reparar&#39;. Prossiga e verifique se o &quot;Erro de sistema de arquivos 2147219196&quot; foi resolvido abrindo uma foto. <br> 5. Se o problema persistir, clique no botão <strong> Redefinir </strong> para redefinir as configurações do aplicativo Fotos. </p> <p><img src=\"images/image_thumb-78-665.png\" alt=\"repair - reset photos app\" loading=\"lazy\"></p> <p> </p> <h6> Etapa 3. Remova e reinstale completamente o aplicativo Photos. </h6> <p> A próxima etapa para corrigir o &quot;Erro do sistema de arquivos&quot; -2147219196 &quot;no aplicativo Fotos é concluir a remoção do seu sistema e reinstalar o aplicativo Fotos. Para fazer isso: </p> <p> 1. Abra <strong> PowerShell </strong> como <strong> Administrador </strong> . <br> 2. No PowerShell, dê o seguinte comando e pressione <strong> Entrar </strong> , para remover completamente o aplicativo Fotos: * </p> <ul> <li><strong> Get-AppxPackage * photos * | Remove-AppxPackage -allusers </strong></li> </ul> <p> * Informação: O comando acima desinstalará o aplicativo Fotos do Windows 10 e removerá também os arquivos de instalação e as sobras do aplicativo Fotos, do diretório &quot;C: \\ Arquivos de Programas \\ WindowsApps \\&quot;. </p> <p><img src=\"images/image_thumb-95-600.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Quando o comando for concluído, <strong> reiniciar </strong> seu computador. <br> 4. Abra a Microsoft Store e instale <a href=\"https://www.microsoft.com/en-us/p/microsoft-photos/9wzdncrfjbh4#activetab=pivot:overviewtab\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Photos </a> . </p> <p><img src=\"images/image_thumb-89-238.png\" alt=\"reinstall photos app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Clique <strong> Instalar, </strong> para reinstalar o aplicativo Fotos em seu sistema. </p> <p><img src=\"images/image_thumb-90-948.png\" alt=\"install photos app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Quando o aplicativo Fotos for instalado, abra uma imagem. O erro &quot;Erro do sistema de arquivos 2147219196&quot; deveria ter sido resolvido. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}