{"title":"CORREÇÃO: Não é possível conectar ao compartilhamento de arquivos porque não é seguro e requer o protocolo SMB1 obsoleto. (Resolvido)","content":"<p> Se você tentar se conectar a uma pasta compartilhada de rede de um PC com Windows 10 e receber o erro &quot;Você não pode se conectar ao compartilhamento de arquivos porque não é seguro. Este compartilhamento requer o protocolo SMB1 obsoleto, que não é seguro e pode expor seu sistema para atacar. Seu sistema requer SMB2 ou superior. Para obter mais informações sobre como resolver esse problema, consulte: https://go.microsoft.com/fwlink/?linkid=852747 &quot;e continue abaixo para corrigir o problema. </p> <p><img src=\"images/image_thumb-30-812.png\" alt=\"You can't connect to the file share because it's not secure. This share requires the obsolete SMB1 protocol, which is unsafe...\" loading=\"lazy\"></p> <p> No Windows 10 v1709 e versões posteriores, o protocolo de rede Server Message Block versão 1 (SMBv1) não é instalado por padrão e deve ser habilitado manualmente se você quiser acessar uma pasta compartilhada em uma estação de trabalho ou servidor, que usa o protocolo SMBv1 para compartilhamento de arquivos. </p> <p> Este tutorial contém instruções para resolver os seguintes erros ao tentar se conectar a uma pasta compartilhada no Windows 10: </p> <ul> <li> <p><em> Você não pode se conectar ao compartilhamento de arquivos porque não é seguro. Este compartilhamento requer o protocolo SMB1 obsoleto, que não é seguro… </em></p> </li> <li> <p><em> O nome de rede especificado não está mais disponível </em></p> </li> <li> <p><em> Erro não especificado 0x80004005 </em></p> </li> <li> <p><em> O servidor especificado não pode executar a operação solicitada. </em></p> </li> </ul> <h4> Como corrigir: não é possível conectar ao compartilhamento de arquivos porque o protocolo SMBv1 está ausente (Windows 10) </h4> <p> 1. Navegue para <strong> Painel de controle </strong> -&gt; <strong> Programas e características </strong> . <br> 2. Clique <strong> Liga ou desliga características das janelas </strong> da esquerda. </p> <p> </p> <p><img src=\"images/image_thumb-68-359.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Expanda a opção &#39;SMB 1.0 / CIFS File Sharing Support&#39; e <strong> Verifica </strong> a <strong> Cliente SMB 1.0 / CIFS </strong> opção. Clique <strong> OK </strong> quando terminar. </p> <p><img src=\"images/image_thumb-29-360.png\" alt=\"Install SMBv1 Windows 10\" loading=\"lazy\"></p> <p> 4. Quando o SMB 1.0 / CIFS estiver instalado, clique no botão <strong> Reinicie agora </strong> botão para reiniciar o seu PC. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}