{"title":"CORREÇÃO: Não há versões anteriores disponíveis no Windows 10 (resolvido)","content":"<p> Em um computador baseado no Windows 10 com o <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Proteção do sistema </a> ativado, o seguinte problema aparece ao tentar restaurar um arquivo / pasta usando o recurso &#39;Restaurar versões anteriores&#39;: &quot;Não há versões anteriores disponíveis&quot;. </p> <p> <img src=\"images/image_thumb-39-628.png\" alt=\"There No Previous Versions Available in Windows 10 \" loading=\"lazy\"></p> <p> </p> <p> O erro &quot;Não há versões anteriores disponíveis&quot; ocorre porque no Windows 10 o recurso &quot;Restaurar versões anteriores&quot; funciona apenas se você tiver configurado o &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Histórico do arquivo </a> &#39;para fazer backup de seus arquivos. Isso significa que o recurso &#39;Restaurar Versões Anteriores&#39; no Windows 10, olha o local do backup da &quot;ferramenta Backup do Histórico de Arquivos&quot; para encontrar uma versão anterior de um arquivo / pasta, e não nos Pontos de Restauração do Sistema, como acontece no Windows 7. Para habilitar o Histórico de Arquivos no Windows 10, siga as instruções nos seguintes artigos: </p> <ul> <li><strong> Artigos relacionados: </strong></li> <li> <ul> <li><a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Como fazer backup de arquivos pessoais com histórico de arquivos no Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Como criar cópias de sombra de seus arquivos com o Agendador de tarefas no Windows 10 </a></li> </ul> </li> </ul> <h4> Como CORRIGIR: Não há versões anteriores de arquivos disponíveis no Windows 10. </h4> <p> Se &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Histórico do arquivo </a> &#39;já está habilitado * no seu PC com Windows 10, mas você recebe a mensagem &quot;Não há versões anteriores disponíveis&quot;, ao tentar restaurar a versão anterior de um arquivo ou pasta, siga as instruções abaixo: </p> <p> * Observação: as instruções abaixo <strong> não funciona se o <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> O histórico de arquivos JÁ não está habilitado </a></strong> no seu PC com Windows 10. </p> <p> 1. Baixe e instale o <a href=\"http://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowExplorer </a> utilitário em seu PC. <br> 2. Abra &#39;ShadowExplorer&#39; e selecione a data de onde você deseja restaurar o arquivo. * </p> <p> * Nota: Se você não vir uma data anterior, isso significa que o Histórico do arquivo está desativado. Lembre-se de que, mesmo se você ativar o histórico de arquivos agora, o resultado será o mesmo, porque o histórico de arquivos cria instantâneos de seus arquivos a partir do momento em que é ativado e então. </p> <p><img src=\"images/image_thumb-40-348.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Navegue até o local de armazenamento do arquivo / pasta que deseja restaurar para sua versão anterior. <br> 4. Ao localizar o arquivo que deseja restaurar, clique com o botão direito sobre ele e selecione <strong> Exportar </strong> . </p> <p><img src=\"images/image_thumb-41-653.png\" alt=\"restore previous versions shadow explorer\" loading=\"lazy\"></p> <p> </p> <p> 5. Selecione um disco diferente (local) para salvar o arquivo restaurado e clique <strong> OK </strong> . * </p> <p><strong> Importante: </strong> Salve o (s) arquivo (s) restaurado (s) em outro disco (por exemplo, uma unidade flash) e, somente depois de garantir que você tenha os arquivos corretos, copie-os para o local original para evitar sobrescrever os arquivos originais. </p> <p><img src=\"images/image_thumb-38-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar esse problema. </p>"}