{"title":"Como fazer backup de arquivos pessoais com histórico de arquivos no Windows 10.","content":"<p> Neste tutorial vou mostrar como configurar o Windows 10 para criar automaticamente cópias e instantâneos de seus arquivos usando a ferramenta de backup Histórico de arquivos, a fim de poder restaurá-los (se necessário), usando o &quot;Restaurar versões anteriores&quot; característica. </p> <p> Como você já deve ter notado, por padrão, o Windows 10 não guarda versões anteriores de seus arquivos ou pastas, como no Windows 7. Isso está acontecendo, porque o Windows 10 não usa mais o serviço &#39;Volume Shadow Copy&#39; para tire instantâneos de seus arquivos, mas em vez disso, usa apenas a ferramenta de backup &#39;Histórico do arquivo&#39;. </p> <p> O &quot;Histórico de arquivos&quot; é uma excelente ferramenta de backup integrada no Windows 10, que pode ser configurada para fazer cópias e instantâneos de seus arquivos em um local de armazenamento alternativo que não seja a unidade principal (por exemplo, em uma unidade USB, rede, etc.) . * </p> <p> * Observação: a única limitação da ferramenta &quot;Histórico de arquivos&quot; é que não permite que você escolha a unidade C: como destino alternativo de backup. se você não possui uma unidade secundária disponível para o backup, continue lendo este tutorial para descobrir como contornar essa limitação ... </p> <ul> <li><strong> Artigo relacionado: </strong> <a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Como criar cópias de sombra de seus arquivos com o Agendador de tarefas no Windows 10. </a></li> </ul> <h4> Como fazer backup de seus arquivos pessoais com a ferramenta de backup do histórico de arquivos no Windows 10. </h4> <p> 1. Como mencionei acima, para fazer backup de seus arquivos com a ferramenta de backup de histórico de arquivos, você precisa ter uma unidade de armazenamento disponível conectada ao seu PC (por exemplo, uma unidade USB) ou um local de rede (por exemplo, outro computador em sua rede ou um dispositivo de armazenamento NAS). * </p> <p> * Observação: se você não possui um dispositivo de armazenamento alternativo, tem as seguintes opções: </p> <blockquote><p> A. Para <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> diminua o tamanho da sua unidade principal C: \\ </a> e com o espaço livre disponível para criar uma nova unidade para armazenar o backup, ou ... </p> <p> B. Para armazenar o backup na unidade principal C: \\. Neste caso, crie uma nova pasta na unidade C: e nomeie-a &quot;FileHistory &#39;(ou o que você quiser) e continue abaixo ... </p></blockquote> <p> 2. Navegue para o Windows <strong> Painel de controle </strong> e abaixo <strong> Sistema e Segurança, </strong> clique <strong> Salvar backup </strong><strong> cópias de seus arquivos com o histórico de arquivos. </strong></p> <p><img src=\"images/image_thumb-42-924.png\" alt=\"How to Backup & Keep Previous Versions of Files in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 3. Agora, de acordo com o seu caso, faça o seguinte: </p> <ul> <li><strong> Caso A. </strong> Se você possui uma unidade disponível para o backup, então: </li> </ul> <blockquote><p> uma. Clique no <strong> Ligar </strong> botão na tela para habilitar o &#39;Histórico do arquivo&#39;. <br> b. Continua a <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> Passo 4 </a> abaixo para definir as configurações de backup do &#39;Histórico do arquivo&#39;. </p></blockquote> <p><img src=\"images/image_thumb-44-788.png\" alt=\"Turn On File History Windows 10\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Caso B: </strong> Se você não possui uma unidade disponível para o backup do histórico de arquivos ou se deseja armazenar o backup na rede: </li> </ul> <blockquote><p> uma. Clique <strong> Selecione um local de rede. </strong></p></blockquote> <p><img src=\"images/image_thumb-56-796.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Na próxima tela: </p> <p> 1. Se você deseja salvar o backup na rede, digite o caminho de rede completo do local de armazenamento do backup e clique em <strong> Selecione a pasta </strong> . </p> <p> 2. Se você deseja salvar o backup em sua unidade principal C: \\, digite o caminho de rede completo para a pasta de backup local na unidade C: \\, neste formato: * </p> <ul> <li> <strong> \\\\ Computer-Name \\ C $ \\ FileHistory </strong></li> </ul> <p> * Notas: <br> 1. Substitua o valor &quot;Computer-Name&quot; pelo nome do seu PC. (Para encontrar o nome do seu computador, clique com o botão direito no ícone &quot;Este PC&quot; no Windows Explorer). <br> 2. Lembre-se de que salvar o backup de seus arquivos pessoais na mesma unidade onde eles já estão armazenados <strong> não é uma solução confiável </strong> . Por segurança, sempre armazene o backup em outro dispositivo de armazenamento. </p></blockquote> <p> por exemplo: se o nome do computador for &quot;Pegasus&quot;, digite: &quot;\\\\ Pegasus \\ C $ \\ FileHistory&quot; </p> <p><img src=\"images/image_thumb-53-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> c. Na próxima tela, clique em <strong> OK </strong> . </p></blockquote> <p><img src=\"images/image_thumb-54-349.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> d. Agora clique no <strong> Ligar </strong> para habilitar a ferramenta de backup do histórico de arquivos e, a seguir, continue a seguir para definir as configurações de backup. </p></blockquote> <p><img src=\"images/image_thumb-48-620.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Para configurar as opções de backup do &#39;Histórico de arquivos&#39;, clique em <strong> Configurações avançadas </strong> à esquerda. </p> <p><img src=\"images/image_thumb-49-919.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4a. Então em <strong> Configurações avançadas </strong> opções, defina com que freqüência fazer backup de seus arquivos e por quanto tempo manter as versões salvas. Quando terminar, clique <strong> Salvar alterações </strong> . </p> <p><img src=\"images/image_thumb-61-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Por fim, clique em <strong> Corra agora </strong> para fazer seu primeiro backup. * </p> <p><img src=\"images/image_thumb-55-463.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Ajuda Adicional - Notas: <br> 1. Por padrão, o &#39;Histórico do Arquivo&#39; faz um backup das pastas &#39;Bibliotecas&#39; (Área de Trabalho, Documentos, Favoritos, Música, OneDrive, Imagens e Vídeos). Se você deseja excluir uma dessas pastas do backup, incluir outras pastas ou revisar todas as opções de backup do histórico de arquivos, navegue até: </p> <ul> <li> <p><strong> Definições <img src=\"images/image_thumb-58-467.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Atualização e segurança </strong> &gt; <strong> Cópia de segurança </strong> &gt; <strong> Mais opções. </strong></p> </li> </ul> <p><img src=\"images/image_thumb-57-938.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Para restaurar seus arquivos do backup do &#39;Histórico de arquivos&#39;, navegue até um dos seguintes locais: </p> <ul> <li><strong> Painel de controle </strong> &gt; <strong> Histórico do arquivo </strong> &gt; <strong> Restaure arquivos pessoais. </strong></li> <li><strong> Definições <img src=\"images/image_thumb-59-275.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Atualização e segurança </strong> &gt; <strong> Cópia de segurança </strong> &gt; <strong> Mais opções </strong> &gt; <strong> Restaure arquivos de um backup atual. </strong></li> </ul> <p> 3. Para restaurar seletivamente um arquivo ou pasta para sua versão anterior, clique com o botão direito no arquivo (ou pasta) e selecione <strong> Restaurar versões anteriores </strong> . </p> <p><img src=\"images/image_thumb-60-867.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}