{"title":"CORRECÇÃO: Erro 1009 do DISM O banco de dados do registro de configuração está corrompido (resolvido).","content":"<p> Este tutorial contém instruções para resolver o seguinte problema ao executar o comando DISM no Windows 10: &quot;Erro 1009: O banco de dados do registro de configuração está corrompido&quot;. O erro 1009 do DISM pode aparecer quando você tenta reparar uma imagem do Windows com um registro danificado (corrompido), usando um dos seguintes comandos DISM no prompt de comando: </p> <ul> <li> Dism / Online / Cleanup-Image / Restorehealth </li> <li> Dism / Online / Cleanup-image / Restorehealth /source:wim:X:\\sources\\install.wim:1 / LimitAccess </li> </ul> <p> … Ou ao usar o comando DISM no Ambiente de Recuperação do Windows (WinRE) </p> <ul> <li> Dism.exe / Image: X: \\ / Cleanup-Image / Restorehealth </li> </ul> <p> </p> <h4> Como corrigir o erro 1009 do DISM: o banco de dados do Registro está corrompido. </h4> <p><strong> Requisitos </strong> : Para resolver o erro dism 1009, você precisará inicializar o computador a partir de uma mídia de instalação do Windows (USB ou DVD). Se você não possui uma mídia de instalação do Windows, pode criar uma usando <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Ferramenta de criação de mídia da Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Como criar uma mídia de instalação USB do Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Como criar uma mídia de instalação de DVD do Windows 10. </a></li> </ul> <p> </p> <h6> Método 1. Restaure o Windows 10 como estava antes de instalar as atualizações. </h6> <p> O erro 1009 do DISM geralmente aparece após uma instalação malsucedida do Windows Update. Portanto, antes de mais nada, cancele a instalação das atualizações. Fazer isso: </p> <p> 1. Inicialize seu sistema a partir de uma mídia de instalação do Windows. <br> 2. Na tela abaixo, pressione o <strong> MUDANÇA </strong> + <strong> F10 </strong> teclas para iniciar o prompt de comando. (ou clique <strong> Próximo </strong> e vai para <strong> Reparar meu computador </strong> &gt; <strong> Resolução de problemas </strong> &gt; <strong> Prompt de comando </strong> ) </p> <p><img src=\"images/image_thumb-72-743.png\" alt=\"FIX DISM Error 1009 -The configuration registry database is corrupt\" loading=\"lazy\"></p> <p> </p> <p> 3. No prompt de comando, obtenha uma lista de todas as unidades em seu sistema com este comando: </p> <ul> <li><strong> wmic logicaldisk get name </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-491.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> 4. Em seguida, descubra qual unidade contém a pasta &quot;Windows&quot;, digitando este comando: * </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * por exemplo. Para ver o conteúdo da unidade C :, digite: &quot; <strong> dir C: </strong> &quot;(sem aspas). Se você não conseguir ver a pasta&quot; Windows &quot;na unidade C :, prossiga para a próxima letra da unidade (por exemplo,&quot; dir D: &quot;,&quot; dir E: &quot;, etc.), até ver o Pasta &quot;Windows&quot; em uma das unidades listadas (a partir do comando acima). </p> <p> [Como você pode ver na captura de tela abaixo, a pasta do Windows (neste caso) está localizada na unidade D:] </p> <p> </p> <p><img src=\"images/image_thumb-69-704.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Depois de encontrar em qual unidade a unidade &quot;Windows&quot; está localizada (por exemplo, na unidade &quot;D:&quot; neste exemplo), navegue até essa unidade digitando DriveLetter <strong> : </strong> + <strong> Entrar </strong> . </p> <p> 6. Em seguida, crie uma pasta de trabalho na unidade digitando este comando: </p> <ul> <li><strong> mkdir D: \\ Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-186.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Em seguida, dê o comando abaixo para reverter seu sistema, após a atualização malsucedida: </p> <ul> <li><strong> DISM / Image: D: \\ / ScratchDir: D: \\ Scratch / Cleanup-Image / RevertPendingActions </strong></li> </ul> <p> * Nota: Altere a letra da unidade <strong> D </strong> de acordo com o seu caso. </p> <p> 8. Assim que o comando DISM acima for executado, você deverá receber a seguinte mensagem na tela: </p> <p><em> &quot;Revertendo ações pendentes da imagem…. <br> A operação foi concluída. Qualquer reversão de ações pendentes será tentada após a reinicialização <br> A operação foi completa com sucesso.&quot; </em></p> <p><img src=\"images/image_thumb-71-222.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9 <strong> Perto </strong> prompt de comando e <strong> reiniciar </strong> seu computador. * </p> <p> 10. Se o Windows inicializar normalmente, continue seu trabalho. Se o Windows não inicializar e tentar instalar as atualizações novamente: </p> <blockquote><p> 1. Desligue seu PC. <br> 2. Inicie novamente o seu computador a partir da mídia de instalação do Windows. <br> 3. Inicie o prompt de comando. <br> 4. No prompt de comando, dê os seguintes comandos em ordem (não se esqueça de alterar a letra da unidade <strong> D </strong> de acordo com o seu caso): </p></blockquote> <ul> <li> <ul> <li> del D: \\ Windows \\ SoftwareDistribution </li> <li> del D: \\ Windows \\ WinSxS \\ cleanup.xml </li> <li> del D: \\ Windows \\ WinSxS \\ pending.xml </li> </ul> </li> </ul> <blockquote><p> 5. Quando terminar, feche o prompt de comando e <strong> reiniciar </strong> seu PC. * </p></blockquote> <p> * Nota: Se a inicialização falhar novamente, inicialize novamente no prompt de comando do WinRE e forneça os seguintes comandos (não se esqueça de alterar a letra da unidade <strong> D </strong> de acordo com o seu caso): </p> <ul> <li> chkdsk / f D: </li> <li> sfc / scannow / offbootdir = D: \\ / offwindir = D: \\ windows </li> <li> dism / image: D: \\ / cleanup-image / restorehealth <ul></ul> </li> </ul> <p> </p> <h6> Método 2. Restaure o registro do Windows a partir do backup. </h6> <p> O próximo método para corrigir o erro 1009 do dism é restaurar o registro do Windows da pasta &#39;RegBack&#39;. * </p> <p> * Info: A pasta &#39;RegBack&#39;, (caminho completo = Windows \\ System32 \\ Config \\ RegBack), é o local onde o Windows armazena automaticamente um backup dos arquivos de registro sempre que a máquina está inicializando. </p> <p> Para restaurar o registro da pasta RegBack: </p> <p> 1. Inicialize seu sistema a partir de uma mídia de instalação do Windows e siga as etapas 1 a 5 do método 1 acima para navegar até a unidade do Windows. (por exemplo, o &quot;D:&quot; neste exemplo). </p> <p> 2. Em primeiro lugar, faça um backup dos arquivos de registro atuais, dando os seguintes comandos na ordem. (Aperte <strong> Entrar </strong> depois de digitar cada comando): </p> <ul> <li><strong> cd \\ windows \\ system32 \\ config </strong></li> <li><strong> backup md </strong></li> <li><strong> copiar *. * Backup </strong></li> </ul> <p><img src=\"images/image_thumb-26-678.png\" alt=\"infinite Automatic Repair loop windows 10 fix\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Agora navegue para <strong> RegBack </strong> pasta dando este comando: </p> <ul> <li><strong> cd RegBack </strong></li> </ul> <p> 4. Em seguida, digite <strong> DIR </strong> (para ver o conteúdo da pasta RegBack). </p> <p> 5. Agora veja se algum dos arquivos listados tem <strong> 0</strong> (zero) bytes em seu tamanho de arquivo e proceda abaixo de acordo com o seu caso: </p> <ul> <li><strong> Caso A. </strong> Se algum dos arquivos listados tiver 0 (zero) bytes em seu tamanho, então <strong> Pare aqui </strong> , e <strong> continue para o próximo método </strong> , porque os arquivos de backup do registro são inúteis ou corrompidos. </li> <li><strong> Caso B. </strong> Se todos os arquivos listados tiverem um tamanho diferente de zero (como na imagem abaixo), prossiga para a próxima etapa. </li> </ul> <p><img src=\"images/image_thumb-27-525.png\" alt=\"restore registry from backup\" loading=\"lazy\"></p> <p> </p> <p> 6. Copie os arquivos de registro do <strong> Windows \\ System32 \\ Config \\ RegBack </strong> pasta para <strong> Windows \\ System32 \\ Config \\ </strong> pasta, dando este comando: </p> <p> </p> <ul> <li><strong> cópia de *.* .. </strong></li> </ul> <p> 7. Quando solicitado, pressione <strong> UMA </strong> para sobrescrever os arquivos no destino após dar o comando de cópia. </p> <p><img src=\"images/image_thumb-28-138.png\" alt=\"fix startup repair loop\" loading=\"lazy\"></p> <p> </p> <p> 8. Quando a cópia for concluída, digite <strong> saída </strong> e pressione <strong> Entrar </strong> para fechar o prompt de comando. <br> 9 <strong> Reiniciar </strong> seu computador e tente inicializar no Windows. </p> <p> * Observação: se o Windows não inicializar novamente, inicialize novamente no prompt de comando do WinRE e forneça os seguintes comandos (não se esqueça de alterar a letra da unidade <strong> D </strong> de acordo com o seu caso): </p> <ul> <li> chkdsk / f D: </li> <li> sfc / scannow / offbootdir = D: \\ / offwindir = D: \\ windows </li> <li> dism / image: D: \\ / cleanup-image / restorehealth </li> </ul> <p> </p> <h6> Método 3. Restaure o Windows 10 para um estado de funcionamento anterior. </h6> <p> O próximo método para resolver o erro de dism &quot;1009 - O banco de dados do registro de configuração está corrompido&quot; é restaurar o sistema a um estado de funcionamento anterior. Fazer isso: </p> <p> 1. Inicialize seu sistema a partir da mídia de instalação do Windows. <br> 2. Na tela abaixo, clique em <strong> Próximo </strong> e então clique <strong> Conserte seu computador </strong> &gt; <strong> Solução de problemas. </strong></p> <p><img src=\"images/image_thumb-73-301.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Em <strong> Opções avançadas </strong> clique <strong> Restauração do sistema. * </strong></p> <p> * Nota: Se o <strong> Voltar para uma versão anterior </strong> opção, está disponível nesta tela, escolha essa opção. </p> <p><img src=\"images/image_thumb-76-326.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Na próxima tela, clique em seu Sistema operacional. </p> <p><img src=\"images/image_thumb-77-265.png\" alt=\"image\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 5. Em seguida, no Assistente de restauração do sistema, clique em <strong> Próximo </strong> e, em seguida, escolha um estado de trabalho anterior (data / hora) e clique em <strong> Próximo </strong> para iniciar o processo de restauração. </p> <p><img src=\"images/image_thumb-50-788.png\" alt=\"system restore windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Método 4. Repare o Windows 10. </h6> <p> O método final para resolver erros de dism é <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> reparar o Windows 10 com atualização in-loco </a> ou para fazer backup de seus arquivos e depois para <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> limpar instalar o Windows 10 </a> . </p> <p> </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}