{"title":"CORREÇÃO: não podemos instalar o Office por causa do Office 16 Click to Run Extensibility Component Registration. (Resolvido)","content":"<p> Se você não conseguir instalar o Office por causa do &quot;Office 16 Click to Run Extensibility Component Registration&quot;, continue lendo este tutorial, que contém instruções detalhadas para resolver os seguintes problemas de instalação do Office: </p> <p><strong> Problema No1: </strong> Ao tentar instalar uma versão de 32 bits do Microsoft Office, você recebe o erro: <br> <em> &quot;Não podemos instalar a versão de 32 bits do Office porque encontramos os seguintes programas de 64 bits no seu PC: <br> Registro de 64 bits do componente de extensibilidade clique para executar do Office 16 <br> Desinstale todos os programas do Office de 64 bits e tente instalar novamente o Office de 32 bits. Se você deseja instalar o Office de 64 bits em vez disso, execute a instalação de 64 bits. &quot; </em></p> <p><img src=\"images/image_thumb-6-215.png\" alt=\"FIX: We can't Install Office because of Office 16 Click to Run Extensibility Component Registration\" loading=\"lazy\"></p> <p> </p> <p><strong> Problema No2 </strong> : Ao tentar instalar uma versão de 64 bits do Microsoft Office, você recebe o erro: <br> <em> &quot;Não podemos instalar a versão de 64 bits do Office porque encontramos os seguintes programas de 32 bits no seu PC: <br> <em> Registro de 32 bits do componente de extensibilidade clique para executar do Office 16 <br> <em> Desinstale todos os programas do Office de 32 bits e tente instalar novamente o Office de 64 bits. Se você deseja instalar o Office de 32 bits em vez disso, execute a instalação de 32 bits. &quot; </em></em></em></p> <p> </p> <h2> Como CORRIGIR: Não podemos instalar esta versão do Office porque encontramos os seguintes programas em seu PC: Office 16 Click-to-Run Extensibility Component 32-bit Registration. </h2> <p> 1. Pressione <strong> janelas </strong> <img src=\"images/image_thumb41-277.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. <br> 2. Digite <strong> instalador </strong> e pressione <strong> Entrar </strong> para navegar até a pasta &quot;C: \\ Windows \\ Installer&quot;. </p> <p><img src=\"images/image_thumb-7-594.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Do <strong> Visualizar </strong> menu, clique <strong> Adicionar colunas </strong> e então clique <strong> Escolha as colunas </strong></p> <p><img src=\"images/image_thumb-8-367.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4 <strong> Verificar </strong> a <strong> Sujeito </strong> e clique <strong> OK </strong> . </p> <p><img src=\"images/image_thumb-9-532.png\" alt=\"image\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-43.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 5. Classifique os resultados por Assunto e role para baixo até localizar o &quot; <em> Componente de extensibilidade clique para executar do Office 16 &quot; </em> que é mencionado na mensagem de erro de configuração do Office. </p> <p><img src=\"images/image_thumb-10-106.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Ao encontrá-lo, clique com o botão direito sobre ele e escolha <strong> Desinstalar </strong> . </p> <p><img src=\"images/image_thumb-11-389.png\" alt=\"Remove office Click to Run installer\" loading=\"lazy\"></p> <p> 7. Quando a desinstalação for concluída, prossiga para instalar o Microsoft Office novamente. * </p> <p> * Observação: se você ainda receber o mesmo erro, então ... </p> <p> 1. Prossiga e desinstale todos os &quot;Componentes Click-to-Run do Office 16&quot; e, se a configuração falhar novamente ... <br> 2. Desinstale completamente o Microsoft Office do seu PC, usando as instruções neste <a href=\"https://www.repairwin.com/fix-couldnt-uninstall-office-365-2016-2013-2010-or-2007/\" target=\"_blank\" rel=\"nofollow noopener\"> tutorial </a> e prossiga para reinstalar o Office. </p> <ul> <li> <p> Artigo relacionado:: <a href=\"https://www.repairwin.com/fix-couldnt-uninstall-office-365-2016-2013-2010-or-2007/\" target=\"_blank\" rel=\"noopener noreferrer\"> CORREÇÃO: Não é possível desinstalar o Office 365, 2016, 2013, 2010 ou 2007. </a></p> </li> </ul> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe este post do blog nas redes sociais para ajudar a divulgar isso. </p>"}