{"title":"CORREÇÃO: Erro de restauração do sistema 0x8100010B (resolvido)","content":"<p> Este tutorial contém instruções para resolver o erro de restauração do sistema 0x8100010B no Windows 10. O erro 0x8100010B pode aparecer ao tentar aumentar o uso máximo de espaço para a proteção do sistema ou ao tentar excluir todos os pontos de restauração anteriores. </p> <p><img src=\"images/image_thumb-19-393.png\" alt=\"FIX System Restore Error 0x8100010B\" loading=\"lazy\"></p> <p> Mais especificamente, este artigo contém instruções para resolver o seguinte problema na Restauração do sistema: </p> <p><strong> 1. Incapaz de aumentar o espaço máximo em disco para a proteção do sistema </strong> com o erro: &quot;Houve um <strong> erro inesperado na página de propriedades </strong> : O nome do arquivo, nome do diretório ou sintaxe do rótulo do volume está incorreto. (0x8007007B)). </p> <p><strong> 2. Incapaz de excluir pontos de restauração </strong> no Windows 10 com o erro: &quot;Os pontos de restauração não puderam ser excluídos pelo seguinte motivo: o Windows não conseguiu excluir todos os instantâneos. Tente novamente ou visualize o log de eventos para obter mais informações. (0x8100010B).&quot; </p> <h2> Como corrigir: Erro 0x8100010B na proteção de restauração do sistema. </h2> <p> 1 <strong> Reiniciar </strong> seu PC. </p> <p> 2. Navegue para <strong> Proteção do sistema </strong> definições: </p> <ul> <li><b> Painel de controle&gt; Sistema&gt; Configurações avançadas do sistema&gt; Propriedades do sistema&gt; Proteção do sistema </b></li> </ul> <p> 3. Destaque o <strong> Disco local C: (sistema) </strong> e clique <strong> Configure. </strong></p> <p><img src=\"images/image_thumb-22-902.png\" alt=\"0x8100010B System Protection\" loading=\"lazy\"></p> <p> </p> <p> 4. Selecione <strong> Desativar proteção do sistema </strong> e clique <strong> Aplicar&gt; OK. </strong> * </p> <p> * Nota: Esta ação excluirá permanentemente todos os pontos de restauração anteriores. Se você deseja aumentar o uso máximo de espaço para a proteção do sistema, sem perder os pontos de restauração, dê o comando abaixo em um prompt de comando elevado e veja se o problema foi corrigido. </p> <ul> <li> vssadmin resize shadowstorage / For = C: / On = C: / MaxSize = 15% </li> </ul> <p><img src=\"images/image_thumb-23-863.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5 <strong> Perto </strong> e <strong> reabrir </strong> as configurações de proteção do sistema. </p> <p> 6. Agora selecione <strong> Ative a proteção do sistema </strong> , configure o uso máximo e clique em <strong> OK </strong> . </p> <p> 7. Nas opções de proteção do sistema, selecione <strong> Ative a proteção do sistema </strong> e clique <strong> OK. </strong></p> <p><img src=\"images/image_thumb-73-430.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> Isso é tudo! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}