{"title":"CORREÇÃO: não foi possível transmitir o erro do Office durante a instalação ou desinstalação do Office. (Resolvido)","content":"<p> Neste guia, você encontrará instruções passo a passo para resolver o erro &quot;Não foi possível transmitir o Office&quot; ao tentar atualizar, instalar ou desinstalar o Office 2013, Office 2016, Office 2019 ou Office 365 em um PC com Windows. </p> <p> Problema nos detalhes: quando você tenta atualizar, instalar ou remover o Office 365, 2016 ou 2013, usando o &quot; <em> Programa e recursos </em> &quot;opção no Painel de controle, você receberá a seguinte mensagem de erro:&quot; <em> Não foi possível transmitir o Office. Desculpe, encontramos um problema de streaming do Office. Por favor, tente novamente mais tarde. Código (s) de erro: 30015-25 (1006), ou 30182–1 (2), ou 30183-39 (-2147014790), ou código de erro 30179-25). </em></p> <p><img src=\"images/image_thumb-4-575.png\" alt=\"Couldn't Stream Office error \" loading=\"lazy\"></p> <p> </p> <h4> Como CORRIGIR: não foi possível transmitir o Office 2013, 2016, 2019 ou 365. </h4> <p> * Importante: a mensagem de erro &quot;Não foi possível transmitir o Office&quot; pode aparecer pelos seguintes motivos: </p> <ol> <li> <ol> <li> Seu programa antivírus / firewall pode impedir a conexão com os servidores Microsoft para atualizar o Office. </li> <li> Você pode ficar sem espaço em disco. </li> </ol> </li> </ol> <p> Portanto, antes de continuar com o método abaixo, tente o seguinte antes de instalar, desinstalar ou atualizar o Office: </p> <ol> <li> <ol> <li> Desative (ou desinstale completamente) seu programa antivírus / firewall. </li> <li> Libere espaço no disco rígido e tente reinstalar ou atualizar o Office. </li> </ol> </li> </ol> <p> Se depois de tentar o procedimento acima, você ainda encontrar o erro &quot;Não foi possível transmitir o Office&quot;, prossiga, remova e reinstale completamente o Office. Fazer isso: </p> <p> 1. Baixe o <a href=\"https://aka.ms/SaRA-officeUninstallFromPC\" target=\"_blank\" rel=\"nofollow noopener\"> Desinstalar ferramenta de suporte do Microsoft Office </a> . <br> 2. Quando o download estiver concluído, clique duas vezes para executar o &quot;SetupProd_OffScrub.exe&quot;. <br> 3. Clique <strong> Instalar </strong> para instalar o &#39;Microsoft Support and Recovery Assistant&#39;. </p> <p><img src=\"images/image_thumb-5-986.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Quando a instalação for concluída, clique em <strong> Concordar </strong> e então clique <strong> sim. </strong></p> <p><img src=\"images/image_thumb-6-745.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Aguarde até que o &#39;Microsoft Support and Recovery Assistant&#39; resolva o problema. <br> 6. Marque a caixa de seleção à esquerda do nome do produto Office para <strong> selecione todos os produtos Office instalados </strong> e clique <strong> Próximo </strong> . </p> <p><img src=\"images/image_thumb-7-956.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Agora aguarde até que o processo de remoção do Office seja concluído e quando isso for feito, <strong> reiniciar </strong> seu computador. <br> 8. Após reiniciar, prossiga e reinstale o Office seguindo as instruções destes links: </p> <ul> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Office 365 </a></li> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Office 2019 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Office 2016 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Office 2013 </a></li> </ul> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}