{"title":"CORRECÇÃO: a conexão de área de trabalho remota não pôde se conectar porque já há uma sessão de console em andamento (resolvido).","content":"<p> A mensagem de erro na Conexão de Área de Trabalho Remota &quot;Seu computador não pôde se conectar a outra sessão de console no computador remoto porque você já tem uma sessão de console em andamento&quot;, aparece porque o computador local e o remoto têm o mesmo endereço IP. O problema geralmente ocorre quando você tenta se conectar remotamente a outro computador por meio de uma conexão VPN e &quot;recebeu&quot; o mesmo endereço IP do roteador local que o computador remoto. Para resolver o problema, siga as instruções abaixo. </p> <p> </p> <p><img src=\"images/image_thumb-7-243.png\" alt=\"Remote Desktop Connection Could Not Connect because already have a console session in progress\" loading=\"lazy\"></p> <h4> Como CORRIGIR o erro RDP: A Área de Trabalho Remota não pôde se conectar a outra sessão de console porque já há uma sessão de console em andamento. </h4> <p> O problema na Conexão de Área de Trabalho Remota &quot;Não foi possível conectar a outra sessão de console porque você já tem uma sessão de console em andamento&quot; geralmente ocorre quando o computador local recebe aleatoriamente (do servidor DHCP) o mesmo endereço IP do endereço IP remoto computador que você deseja conectar por meio de RDP. </p> <p> A única maneira de corrigir o problema acima é desativar a atribuição automática de endereço IP do servidor DHCP no computador local e especificar manualmente um endereço IP. Fazer isso: </p> <p> 1 <strong> Clique com o botão direito </strong> no <strong> Rede </strong> ícone <img src=\"images/image_thumb-42-527.png\" alt=\"image\" loading=\"lazy\"> na barra de tarefas e clique em <strong> Abra o Centro de Rede e Compartilhamento. </strong> * </p> <p><img src=\"images/image_thumb-104-485.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Selecione <strong> Ethernet </strong> (ou Wi-Fi) à esquerda e, na seção &quot;Configurações relacionadas&quot;, clique em <strong> Alterar as opções do adaptador </strong> . </p> <p><img src=\"images/image_thumb-43-117.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3 <strong> Duplo click </strong> no adaptador de rede ativo (Ethernet ou Wi-Fi) e clique <strong> Detalhes </strong> . </p> <p><img src=\"images/image_thumb-8-177.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Anote os detalhes do endereço IP nos campos a seguir e clique em <strong> Perto </strong> : </p> <ul> <li> Endereço IPv4 </li> <li> Máscara de sub-rede IPv4 </li> <li> Gateway padrão IPv4 </li> <li> Servidor DNS IPv4 </li> </ul> <p><img src=\"images/image_thumb-9-793.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Agora, clique <strong> Propriedades </strong> . </p> <p><img src=\"images/image_thumb-10-628.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Selecione o <strong> &#39;Protocolo de Internet versão 4 (TCP / IPv4) </strong> &#39;e clique <strong> Propriedades </strong></p> <p><img src=\"images/image_thumb-106-954.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 7. Nas propriedades do Protocolo da Internet Versão 4 (TCP / IPv4), aplique as seguintes configurações: </p> <p> A. Selecione <strong> Use o seguinte endereço IP: </strong></p> <blockquote><p> 1. No campo Endereço IP, digite um <strong> endereço IP diferente do endereço IP que você notou antes </strong> . (Mude apenas o último número para um valor mais alto). <br> 2. No campo Máscara de sub-rede, digite o mesmo endereço IP de sub-rede que você notou antes. <br> 3. Em Default Gateway, digite o mesmo Default Gateway que você notou antes. </p></blockquote> <p> B. Selecione <strong> Use os seguintes endereços de servidor DNS </strong> : </p> <blockquote><p> 1. Em Servidor DNS preferencial, digite o endereço DNS que você notou antes. </p></blockquote> <p> C. Quando terminar, clique em <strong> OK </strong> duas vezes e <strong> Perto </strong> para fechar as propriedades do adaptador. </p> <blockquote> <p><img src=\"images/image_thumb-11-850.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 8. Agora, tente se conectar ao computador Remote Desktop. O problema deve ser resolvido. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? <br> Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}