{"title":"FIX 0xC1900101 - 0x40017: Falha na instalação na fase SECOND_BOOT no Windows 10 Update. (Resolvido)","content":"<p> Este tutorial contém instruções para corrigir o erro de atualização do Windows 10 0xC1900101 - 0x40017: &quot;A instalação falhou na fase SECOND_BOOT com um erro durante a operação de BOOT&quot;. </p> <p> </p> <p><img src=\"images/image_thumb-63-307.png\" alt=\"FIX 0xC1900101 – 0x40017 Installation failed in SECOND_BOOT phase \" loading=\"lazy\"></p> <p> </p> <p> Problema de atualização do Windows 10 0xC1900101 - 0x40017 em detalhes: Quando você tenta atualizar o Windows 10 para a versão mais recente (compilação) ou quando você tenta atualizar seu sistema do Windows 7 ou 8.1 para o Windows 10, a instalação para com o erro &quot;Não foi possível&quot; t instale o Windows 10 - 0xC1900101 - 0x40017 - A instalação falhou na fase SECOND BOOT com um erro durante a operação de BOOT &quot;e, em seguida, retorna à versão anterior do Windows. </p> <h2> Como consertar o erro de atualização do Windows 10 0xC1900101 - 0x40017 &quot;A instalação falhou na fase SECOND_BOOT com um erro durante a operação de inicialização&quot; </h2> <p> O código de erro 0xC1900101 - 0x40017 durante a atualização do Windows 10 indica um problema com um dispositivo, driver ou programa incompatível no sistema. Portanto, antes de continuar a aplicar os métodos abaixo, aplique o seguinte: </p> <p> </p> <p> 1. Em primeiro lugar, certifique-se de que as configurações de data e hora estejam corretas. <br> 2. Em seguida, verifique se há espaço livre suficiente. O Windows 10 requer pelo menos 32 GB de espaço livre para atualizar. Para liberar espaço em disco, use <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Limpeza de disco </a> . <br> 3. Instale os drivers mais recentes para todos os dispositivos em seu sistema, especialmente para o adaptador Ethernet e sem fio (se houver). * <br> 4. Desconecte todas as unidades USB externas e cartões SD e qualquer outro dispositivo USB que não seja necessário. <br> 5. Se você estiver usando um programa antivírus de terceiros, desative-o temporariamente ou -melhor- desinstale-o. <br> 6. Desative a criptografia do disco rígido (se ativado). <br> 7. Finalmente, antes de reiniciar o computador para instalar a atualização, desconecte-se da rede. (por exemplo, desconecte o cabo Ethernet ou desative o adaptador Wi-Fi). </p> <p><strong> * Observação: </strong> Se após aplicar as instruções neste artigo, a instalação de atualização do Windows 10 ainda falhar, prossiga e atualize também o BIOS (firmware) em seu sistema. </p> <h6> Método 1. Execute o Windows Update Troubleshooter. </h6> <p> O primeiro método para corrigir o erro de atualização do Windows 10 0xC1900101-0x4001E é executar o Windows Update Troubleshooter. </p> <p> 1. Navegue para o Windows <strong> Painel de controle </strong> , defina &#39;Exibir por&#39; para <strong> Ícones pequenos </strong> e aberto <strong> Solução de problemas. </strong></p> <p><img src=\"images/image_thumb-5-978.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Em Opções de solução de problemas, clique em <strong> Corrija problemas com o Windows Update. </strong></p> <p><img src=\"images/image_thumb-9-833.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Clique <strong> Próximo </strong> para solucionar problemas de atualização do Windows. </p> <p><img src=\"images/image_thumb-8-522.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Quando o processo de solução de problemas for concluído, <strong> perto </strong> o solucionador de problemas e <strong> reiniciar </strong> seu PC. <br> 6. Verifique se há atualizações. </p> <p> </p> <h6></h6> <h6></h6> <h6> Método 2. <strong> Exclua a pasta &#39;SoftwareDistribution&#39;. </strong></h6> <p> O “C: \\ Windows \\ <strong> Distribuição de Software </strong> “Pasta, é o local onde o Windows armazena as atualizações do Windows. Muitas vezes, essa pasta fica corrompida e você deve recriá-la para fazer o download das atualizações do zero. Para reconstruir (recriar) a pasta “SoftwareDistribution”, siga as etapas abaixo: </p> <p><strong> Etapa 1: Pare o Windows Update Service. </strong></p> <p> 1. Abra o painel de controle dos Serviços do Windows: Para fazer isso: </p> <ul> <li> Pressione Windows <img src=\"images/image_thumb8_thumb_thumb-650.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> para abrir a caixa de comando de execução. </li> <li> Na caixa de pesquisa, digite: <strong><em> services.msc </em></strong> e clique <strong> OK </strong> . </li> <li> (Aceite o aviso do UAC se ele aparecer). </li> </ul> <p><img src=\"images/image_thumb-12-595.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. No painel de controle de Serviços, localize o &quot; <strong> Atualização do Windows&quot; </strong> serviço. <br> 3. Clique com o botão direito em <strong> atualização do Windows </strong> serviço e selecione “ <strong> Pare </strong> ”. </p> <p><img src=\"images/image_thumb-9-376.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Etapa 2: Exclua a pasta SoftwareDistribution. </strong></p> <p> 1. Abra o Windows Explorer e navegue até: <strong> C: \\ Windows </strong> pasta. <br> 2. Encontre e <strong> Excluir </strong> a &quot; <strong><em> Distribuição de Software </em></strong> &quot;Pasta (ou renomeie-a, por exemplo,&quot; SoftwareDistributionOLD &quot;). </p> <p> </p> <p><img src=\"images/image_thumb-10-350.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p><strong> Etapa 3: Inicie o Windows Update Service. </strong></p> <p> 1. Abra o painel de controle dos Serviços do Windows. <br> 2. Clique com o botão direito em <strong> atualização do Windows </strong> serviço e selecione “ <strong> Começar </strong> ”. </p> <p><img src=\"images/image_thumb-11-613.png\" alt=\"start windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Etapa 4: verifique e instale a atualização do Windows 10. </strong></p> <p> 1. Navegue para <strong> Definições </strong> -&gt; <strong> Atualização e segurança </strong> e clique <strong> Verifique se há atualizações </strong> . </p> <p> </p> <h6> Método 3. Atualize o Windows 10 usando o Assistente de Atualização </h6> <p> 1. Navegue para <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Site de download do Windows 10 </a> e clique no <strong> Atualize agora </strong> botão. </p> <p><img src=\"images/image_thumb-60-575.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Salve o arquivo &quot;Windows10Upgrade9252.exe&quot; em sua área de trabalho. <br> 3. Clique duas vezes no arquivo baixado para abrir o <strong> Assistente de atualização do Windows </strong> . <br> 4. Clique <strong> Atualize agora </strong> para iniciar a atualização. </p> <p><img src=\"images/image_thumb-61-861.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Deixe o Windows terminar o download e a verificação. <br> 6. Quando a verificação chega a 100%, <strong> desligue o seu computador da Internet </strong> ou defina-o como &quot; <strong> Modo avião </strong> &quot; <br> 7. Espere até que o Windows atualize seu sistema. <br> 8. Quando solicitado, reinicie o sistema para instalar a atualização. </p> <h6></h6> <h6> Método 4. Atualize o Windows 10 de ISO / USB. </h6> <p> O próximo método para corrigir o erro de atualização do Windows 10 &quot;Falha na instalação na fase SECOND_BOOT&quot; é atualizar o Windows 10, a partir do arquivo ISO do Windows. Fazer isso: </p> <p><strong> Etapa 1. Baixe o Windows 10 em um arquivo ISO. </strong></p> <p> 1. Navegue para <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Página de download do Windows 10 </a> e baixe o <strong> Ferramenta de criação de mídia </strong> . </p> <p><img src=\"images/image_thumb-62-759.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Execute a &#39;Ferramenta de criação de mídia&#39; e <strong> Aceitar </strong> os Termos de Licença na primeira tela. <br> 3. Selecione <strong> Crie mídia de instalação para outro PC </strong> . </p> <p><img src=\"images/image_thumb1_thumb-893.png\" alt=\"create Windows 10 DVD\" loading=\"lazy\"></p> <p> </p> <p> 4. Na tela &#39;Idioma, arquitetura e edição&#39;, clique <strong> Próximo. <br> </strong> 5. Selecione <strong> Arquivo ISO </strong> e clique <strong> Próximo </strong> . </p> <p><img src=\"images/image_thumb-30-122.png\" alt=\"download windows 10 iso\" loading=\"lazy\"></p> <p> 6 <strong> Salve  </strong> o arquivo &#39;Windows.iso&#39; em sua área de trabalho. <br> 7. A ferramenta de criação de mídia agora começará a baixar o Windows 10 em um formato ISO. <br> 8. Quando o download for concluído, <strong> perto </strong> a ferramenta de criação de mídia. </p> <p> </p> <p><strong> Etapa 2. Atualize o Windows 10 a partir do arquivo ISO. </strong></p> <p> 1 <strong> Desligue o seu computador da Internet </strong> , (ou defina-o para &quot;Modo avião&quot; se você tiver um laptop). <br> 2 <strong> Desabilitar </strong> ou <strong> desinstalar temporariamente </strong> algum <strong> antivírus de terceiros </strong> . <br> 3. Em seguida, clique com o botão direito do mouse no arquivo &quot;Windows.iso&quot; (na área de trabalho) e clique em <strong> Monte </strong> . <br> 4. Clique duas vezes em <strong> Configurar </strong> aplicativo. </p> <p><img src=\"images/image_thumb-36-800.png\" alt=\"windows 10 setup\" loading=\"lazy\"></p> <p> </p> <p> 5. Na tela abaixo, escolha <strong> &#39;Não agora&#39; </strong> e clique <strong> Próximo </strong> . </p> <p><img src=\"images/image_thumb-11-579.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Siga as demais instruções na tela para atualizar seu sistema. </p> <h4></h4> <h6> Método 5. Limpe a instalação do Windows 10. </h6> <p> O último método, para corrigir os problemas de atualização do Windows 10, é realizar uma instalação limpa do Windows 10 em seu sistema. </p> <p><strong> Importante: </strong> A instalação limpa do Windows 10 significa que todos os seus arquivos e configurações serão perdidos durante o processo de instalação. Então, prossiga e <strong> faça backup de todos os seus arquivos e configurações importantes para outra mídia de armazenamento antes de continuar </strong> . (por exemplo, para uma unidade USB externa). </p> <p> Para realizar uma instalação limpa do Windows 10, leia as instruções neste artigo: <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Como limpar a instalação do Windows 10 </a></p> <p> Isso é tudo, pessoal! Isso funcionou para você? Deixe um comentário na seção de comentários abaixo ou melhor ainda: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}