{"title":"Formulário de contato 7 não funciona: Ocorreu um erro ao enviar sua mensagem. Por favor, tente novamente mais tarde. (Resolvido)","content":"<p> Se o formulário de contato 7 em seu site WordPress não estiver funcionando, continue lendo abaixo para corrigir o problema. Contact Form 7, é um dos mais famosos plugins gratuitos de WordPress, que ajuda você a criar, gerenciar e personalizar o formulário de contato em seu site WordPress. Recentemente, descobri que o plug-in &quot;Contact Form 7&quot; em meu site (e em muitos outros) parou de funcionar com o erro &quot;Ocorreu um erro ao enviar sua mensagem. Tente novamente mais tarde&quot;, circundado por um retângulo laranja , depois de enviar o formulário. </p> <p><img src=\"images/image_thumb-14-729.png\" alt=\"Contact Form 7: There was an error to send your message. Please try again later\" loading=\"lazy\"></p> <p> Este tutorial contém instruções para corrigir o erro &quot;Ocorreu um erro ao enviar sua mensagem. Tente novamente mais tarde&quot; dentro de uma caixa laranja, após o envio do formulário de contato. </p> <h4> Como CORRIGIR: Formulário de contato não funciona com o erro &quot;Ocorreu um erro ao enviar sua mensagem&quot;. </h4> <p> Se o seu Formulário de Contato 7 no seu site WordPress não estiver mais funcionando, siga as etapas abaixo: </p> <h6> Etapa 1. Validar o formulário de contato 7. </h6> <p> 1. Navegue até o painel de administração do WordPress e clique em <strong> Contato </strong> &gt; <strong> Formulários de contato. </strong><br> 2. No topo da página, verifique se há uma mensagem de erro dizendo &quot;Configuração incorreta leva a falha na entrega de e-mail ou outros problemas. Valide seus formulários de contato agora&quot;. <br> 3. Se você vir essa mensagem, * então <strong> clique </strong> a <strong> Validar a configuração do formulário de contato 7 </strong> link. </p> <p> * Observação: se você não vir essa mensagem, pule para a etapa 2. </p> <p><img src=\"images/image_thumb-813.png\" alt=\"Validate Contact Form 7 Configuration \" loading=\"lazy\"></p> <p> 4. Na próxima tela, clique no <strong> Valide 2 formulários de contato agora </strong> botão. </p> <p><img src=\"images/image_thumb-1-270.png\" alt=\"Validate Contact Form\" loading=\"lazy\"></p> <p> 5. Quando a validação da configuração for concluída, você deverá receber a mensagem &quot;Nenhum formulário de contato inválido foi encontrado&quot;. </p> <p><img src=\"images/image_thumb-17-318.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Teste seu formulário de contato e, se o erro persistir, prossiga para a etapa 2 abaixo. </p> <h6> Etapa 2. Configure o formulário de contato 7 com as chaves reCAPTCHA V3. </h6> <p> Durante minha pesquisa, descobri que as versões mais recentes do Formulário de contato 7 (v5.1 e posterior) usam a API reCAPTCHA v3 para protegê-lo contra spam e outros tipos de abuso automatizado. Portanto, com base nisso, você tem as duas opções a seguir para resolver o erro do formulário de contato &quot;Ocorreu um erro ao enviar sua mensagem. Tente novamente mais tarde.&quot;: * </p> <ul> <li> <p><strong> Opção 1. </strong> Para configurar o Formulário de contato 7 com chaves reCAPTCHA V3. </p> </li> <li> <p><strong> Opção 2. </strong> Para usar o <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"noopener noreferrer\"> Formulário de contato 7 - reCaptcha v2 </a> plugin para seus formulários de contato. </p> </li> </ul> <p> * Observação: neste artigo, mostrarei como configurar o Formulário de contato 7 com chaves reCAPTCHA V3. Se você não quiser usar a proteção reCAPTCHA V3, desinstale o plug-in &#39;Formulário de contato 7&#39; e instale o <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"nofollow noopener\"> Formulário de contato 7 - reCaptcha v2 </a> plugar. </p> <p><strong> Para configurar o formulário de contato 7 com chaves reCAPTCHA V3: </strong></p> <p> 1. Faça login em sua conta do Google, usada para configurar o reCAPTCHA em seu site e navegue até <a href=\"https://www.google.com/recaptcha/admin\" target=\"_blank\" rel=\"nofollow noopener\"> Console do administrador reCAPTCHA do Google. </a></p> <p> 2. Clique em Configurações <img src=\"images/image_thumb-2-494.png\" alt=\"image\" loading=\"lazy\"> ícone. </p> <p><img src=\"images/image_thumb-3-786.png\" alt=\"Setup Contact Form 7 with recaptcha v3\" loading=\"lazy\"></p> <p> 3. Clique no <strong> Lixeira de reciclagem </strong> ícone <img src=\"images/image_thumb-4-167.png\" alt=\"image\" loading=\"lazy\"> e <strong> excluir </strong> a <strong> Chaves do reCAPTCHA V2. </strong></p> <p><img src=\"images/image_thumb-5-757.png\" alt=\"Recaptcha v3\" loading=\"lazy\"></p> <p> 4. Clique no ícone Mais <img src=\"images/image_thumb-6-851.png\" alt=\"image\" loading=\"lazy\"> para registrar novamente o seu site. </p> <p><img src=\"images/image_thumb-7-337.png\" alt=\"Register Site with Recaptcha\" loading=\"lazy\"></p> <p> 5. Na tela &#39;Registrar um novo site&#39;: </p> <blockquote> <p> uma. <strong> Digite um nome </strong> para identificar seu site no futuro, <br> b. <strong> Escolher </strong> a <strong> reCAPTCHA v3 </strong> modelo. <br> c. <strong> Modelo </strong> a <strong> nome do domínio </strong> do seu site. <br> d. <strong> Aceitar </strong> a <strong> Termos de serviço do reCAPTCHA. </strong><br> e. Clique <strong> ENVIAR. </strong></p> </blockquote> <p><img src=\"images/image_thumb-8-227.png\" alt=\"Register Site with Recaptcha V3\" loading=\"lazy\"></p> <p> 6. Após o registro, você verá uma tela com o <strong> SITE KEY </strong> e a <strong> CHAVE SECRETA </strong> . <br> 7. Clique <strong> COPIAR CHAVE DO SITE </strong> e <strong> NÃO FECHE </strong> esta janela. </p> <p><img src=\"images/image_thumb-9-995.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. Em outra janela do navegador, navegue até o painel de administração do WordPress e clique em <strong> Contato </strong> &gt; <strong> Integração. </strong></p> <p> 9. Clique no <strong> Integração de configuração </strong> botão. </p> <p><img src=\"images/image_thumb-10-834.png\" alt=\"Integrate Recaptcha in Contact Form 7\" loading=\"lazy\"></p> <p> 10. Clique no <strong> Remover chaves </strong> para excluir as chaves do reCAPTCHA V2. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"image\" loading=\"lazy\"></p> <p> 11 <strong> Colar </strong> o novo <strong> Chave do Site </strong> e então copie e cole o novo <strong> Chave secreta </strong> no console de administração reCAPTCHA e clique em <strong> Salve as alterações. </strong></p> <p><img src=\"images/image_thumb-12-147.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12 <strong> Excluir </strong> a <strong> esconderijo </strong> em seu site. <br> 13. Abra uma nova janela do navegador e teste seu formulário de contato. </p> <p> Isso é tudo, pessoal! Isso funcionou para você? Deixe um comentário na seção de comentários abaixo ou ainda melhor: curta e compartilhe esta postagem do blog nas redes sociais para ajudar a divulgar essa solução. </p>"}