{"title":"Cum să deschizi întotdeauna Chrome în modul incognito.","content":"<p> Dacă căutați o modalitate de a face Chrome să se deschidă întotdeauna în modul incognito, continuați să citiți mai jos. Când lansați Chrome în modul incognito, activitatea browserului dvs. rămâne privată de la alți utilizatori care folosesc același dispozitiv. În modul incognito, Chrome nu va salva istoricul de navigare, cookie-urile și informațiile introduse în formulare. </p> <p> Modul manual, de a începe o nouă sesiune Chrome în modul incognito, este să accesați meniul Chrome <img src=\"images/image_thumb10_thumb-963.png\" alt=\"image_thumb[10]\" loading=\"lazy\"> și pentru a selecta „Fereastră incognito nouă” sau pentru a apăsa CTRL + SHIFT + N. </p> <p><img src=\"images/image_thumb-42-832.png\" alt=\"Chrome New incognito window\" loading=\"lazy\"></p> <p> </p> <p> În acest articol veți găsi instrucțiuni despre cum să lansați întotdeauna Google Chrome în modul incognito. </p> <h4> Cum să porniți întotdeauna Google Chrome în modul incognito. </h4> <p> Dacă doriți să porniți întotdeauna Chrome în modul incognito, creați o nouă comandă rapidă Chrome și modificați proprietățile acesteia, după cum urmează: </p> <p> 1, <strong> Click dreapta </strong> pe <strong> Google Chrome </strong> comanda rapidă și selectați <strong> Proprietăți </strong> . <br> 2. La <strong> General </strong> filă, adăugați comutatorul „–incognito” (fără ghilimele), la sfârșitul liniei țintă și faceți clic <strong> O.K </strong> : </p> <p> de exemplu. „C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe” –incognito </p> <p><img src=\"images/image_thumb-43-798.png\" alt=\"How to Always Open Chrome in Incognito mode.\" loading=\"lazy\"></p> <p> 3. De acum înainte, când porniți Chrome din comanda rapidă modificată, Chrome se va deschide în modul incognito. * </p> <p><strong> * BACSIS: </strong> Dacă doriți să deschideți Chrome în modul incognito, atunci când deschideți un hyperlink (URL) din e-mail sau alt program, atunci trebuie să modificați registrul. Pentru a face asta: </p> <blockquote> <p> 1. Deschideți <strong> Editor de registru </strong> . <br> 2. În registru, navigați la următoarea cheie: </p> <ul> <li> <p> Comanda HKEY_CLASSES_ROOT \\ ChromeHTML \\ shell \\ open \\ </p> </li> </ul> <p> 3. În panoul din dreapta, faceți dublu clic pe <strong> Mod implicit </strong> REG_SZ valoare șir. </p> </blockquote> <p><img src=\"images/image_thumb-44-612.png\" alt=\"open url in chrome incognito\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. Adăugați comutatorul adăugați cuvântul „incognito” (fără ghilimele), înainte de „% 1” și faceți clic <strong> O.K </strong> . </p></blockquote> <blockquote><p> de exemplu. Schimbați datele valorice din: </p> <p> „C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe” - „% 1” </p> <p> la: </p> <p> „C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe” –incognito „% 1” </p></blockquote> <p><img src=\"images/image_thumb-45-148.png\" alt=\"open url chrome incognito - registry\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. De acum înainte, când faceți clic pe un URL (HTML), Chrome îl va deschide în modul incognito. </p></blockquote> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}