{"title":"Cum să vă protejați computerul cu BitLocker în Windows 10.","content":"<p> Acest tutorial conține instrucțiuni pas cu pas despre cum să vă protejați prin parolă computerul cu criptare BitLocker. BitLocker este o caracteristică completă de criptare a discului inclusă în edițiile Windows 10 Professional și Enterprise și vă poate ajuta să vă protejați datele personale de accesul neautorizat. </p> <p> Imaginați-vă următorul scenariu: laptopul dvs. personal este furat sau pierdut, iar datele dvs. private sunt disponibile pentru ochi indiscreți. Pentru a evita acest lucru, citiți acest ghid și aflați cum să vă protejați prin parolă computerul și datele valoroase cu o criptare puternică, pentru a deveni inaccesibil oricui fără parola de decriptare. </p> <ul> <li><strong> Articol asociat: <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se protejează un folder cu o parolă. </a></strong></li> </ul> <h4> Cum se utilizează BitLocker pentru a cripta și proteja computerul Windows 10. </h4> <p> Pentru a proteja unitatea sistemului de operare, cu BitLocker în Windows 10 Pro sau Enterprise: </p> <p> 1. Din Windows <strong> Panou de control </strong> , faceți clic pe <strong> Sistem și securitate </strong> și apoi faceți clic pe <strong> Criptare unitate Bit Locker </strong> . </p> <p><img src=\"images/image_thumb-33-320.png\" alt=\"How to Protect your PC with BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Lângă unitatea de sistem de operare C :, faceți clic <strong> Porniți BitLocker </strong> . * </p> <p> * Notă: Dacă după ce apăsați „Activare BitLocker”, primiți eroarea „Acest dispozitiv nu poate utiliza un modul de platformă de încredere ...”, atunci citiți acest articol pentru a remedia problema. </p> <p><img src=\"images/image_thumb-34-100.png\" alt=\"turn on bitlocker operating system drive\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. În ecranul următor, alegeți cum doriți să deblocați unitatea la pornire. </p> <blockquote><p> 1. Dacă doriți să vă deblocați computerul utilizând un dispozitiv USB, faceți clic pe <strong> Introduceți o unitate flash USB. <br> </strong> 2. Dacă doriți să vă deblocați computerul tastând o parolă, faceți clic pe <strong> Scrie o parolă </strong> . (ca în acest exemplu) </p></blockquote> <p><img src=\"images/image_thumb-35-212.png\" alt=\"enable bitlocker protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Acum introduceți o parolă foarte puternică și faceți clic <strong> Următorul </strong> . </p> <p><img src=\"images/image_thumb-36-435.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Acum selectați unde doriți să salvați * cheia de recuperare și faceți clic <strong> Următorul </strong> . * </p> <p> * De exemplu: dacă vă conectați la Windows 10 cu un cont Microsoft, apoi faceți clic pe <strong> Salvați în contul dvs. Microsoft. </strong> Dacă vă conectați la Windows 10 cu un cont local, alegeți una dintre celelalte opțiuni. </p> <p> Note: <br> 1. Dacă salvați cheia de recuperare BitLocker în contul dvs. Microsoft, atunci puteți vizualiza cheia după autentificare la <a title=\"https://onedrive.live.com/recoverykey.\" href=\"https://onedrive.live.com/recoverykey.\" target=\"_blank\" rel=\"nofollow noopener\"> https://onedrive.live.com/recoverykey. </a><br> 2. Prefer întotdeauna să păstrez cheia de recuperare pe o unitate USB, pentru a fi pregătit să rezolv problemele BitLocker. </p> <p> </p> <p><img src=\"images/image_thumb-37-801.png\" alt=\"save bitlocker recovery key\" loading=\"lazy\"></p> <p> </p> <p> 6. La următorul ecran, lăsați setarea implicită dacă computerul și / sau unitatea dvs. sunt noi și apoi faceți clic pe <strong> Următorul </strong> din nou. </p> <p><img src=\"images/image_thumb-38-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. La opțiunile modului de criptare, lăsați setarea implicită și faceți clic <strong> Următorul </strong> . </p> <p><img src=\"images/image_thumb-39-785.png\" alt=\"bitlocker encryption mode\" loading=\"lazy\"></p> <p> </p> <p> 8. La ultimul ecran, faceți clic pe <strong> Continua </strong> , pentru a reporni și verifica sistemul înainte de a activa protecția BitLocker. </p> <p><img src=\"images/image_thumb-40-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. La repornire, vi se va solicita să introduceți parola BitLocker. Tastați parola și apăsați <strong> introduce </strong> . * </p> <p> * Notă: Dacă BitLocker nu poate accepta parola sau dacă vă confruntați cu alte probleme, încercați una dintre următoarele acțiuni pentru a vă conecta la Windows: </p> <blockquote><p> 1. Apăsați tasta ESC pe ecranul Parolă BitLocker pentru a accesa opțiunile de recuperare. <br> 2. Apăsați în mod repetat tasta ESC după pornirea computerului, pentru a trece de testul BitLocker. </p></blockquote> <p> 10. Dacă testele BitLocker au trecut, atunci, după pornirea pe Windows 10, BitLocker va începe să cripteze unitatea sistemului de operare. Pentru a vizualiza starea procesului de criptare, faceți clic pe notificarea BitLocker din bara de activități sau accesați Panoul de control&gt; Criptare unitate BitLocker. </p> <p><img src=\"images/image_thumb-41-171.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}