{"title":"Cum se ascunde sau se afișează barele de derulare în Windows 10 Meniu Start, Setări sau Aplicații.","content":"<p> După cum probabil ați observat, în Windows 10, când porniți meniul Start, aplicația Setări sau când lucrați într-o aplicație Store, bara de defilare este invizibilă în mod implicit și apare doar atunci când mutați cursorul în partea dreaptă a deschiderii fereastră. Acest comportament a fost puțin enervant și, din fericire, Microsoft în cea mai recentă actualizare a funcției Windows 10 1803 (aprilie 2018) a adăugat opțiunea de a afișa întotdeauna bara de derulare în toate ferestrele deschise (de exemplu, în meniul Start din aplicația Setări etc.) . </p> <p><img src=\"images/image_thumb-446.png\" alt=\"Show Scroll Bar in Windows 10 \" loading=\"lazy\"></p> <p> Acest tutorial conține instrucțiuni despre cum să ascundeți sau să afișați întotdeauna barele de derulare în toate ferestrele și aplicațiile deschise, în Windows 10 v1803 (sau o versiune ulterioară). </p> <h4> Cum se afișează sau se ascunde bara de derulare în Windows 10 Meniu Start, Setări sau Aplicații. </h4> <p> 1. Din <strong> start </strong> <img src=\"images/image_thumb-38-810.png\" alt=\"image\" loading=\"lazy\"> meniu alege <strong> Setări </strong> <img src=\"images/image_thumb-44-476.png\" alt=\"image\" loading=\"lazy\"> . </p> <p> 2. Deschideți <strong> Acces ușor </strong> setări. </p> <p><img src=\"images/image_thumb-1-268.png\" alt=\"display scroll bar windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Faceți clic pe Afișare din stânga și apoi „glisați” <strong> Ascundeți automat barele de derulare în Windows </strong> schimba cu <strong> Dezactivat. </strong></p> <p><img src=\"images/image_thumb-3-742.png\" alt=\"always show scroll bars windows 10\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}