{"title":"Cum să vă conectați automat la Windows 10/8/7 (fără a introduce o parolă).","content":"<p> Acest tutorial conține instrucțiuni despre cum să vă autentificați automat la Windows 10. De fapt, veți afla cum să vă autentificați automat la contul dvs. de utilizator (cont Microsoft, local sau de domeniu), fără a fi nevoie să introduceți acreditările la conectare sau la ecranul de blocare . Instrucțiunile se aplică sistemului de operare Windows 10/8/7. </p> <p> Când efectuați o nouă instalare Windows 10, vi se va solicita să specificați un cont de utilizator și o parolă pentru a utiliza computerul. La acest pas, puteți utiliza contul dvs. Microsoft (cu parola contului dvs. MS) sau pentru a crea un nou cont local și o nouă parolă pentru a vă conecta în Windows. În ambele cazuri (cu excepția cazului în care creați un cont local cu o parolă necompletată), vi se va solicita să introduceți parola de fiecare dată când porniți Windows. </p> <p> Protejarea propriului computer cu o parolă este o măsură bună de securitate, mai ales dacă vă împărtășiți computerul cu alții sau când călătoriți cu laptopul sau când computerul aparține unui mediu de afaceri. Dar, dacă sunteți singurul utilizator de pe computerul dvs. desktop autonom sau dacă utilizați laptopul numai acasă, nu este necesar să vă introduceți acreditările de fiecare dată când doriți să îl utilizați. * </p> <p><strong> Avertizare: </strong> NU ACTIVAȚI LOGONUL AUTOMAT pe Windows dacă partajați computerul cu alții sau dacă călătoriți cu laptopul sau tableta, deoarece oricine vă găsește computerul va avea acces ușor la fișierele dvs. </p> <h4> Cum să vă conectați automat la contul dvs. de utilizator în Windows 10/8/7 / Vista. (Activați autentificarea automată) </h4> <h6> Metodă 1. Activați Autentificare automată utilizând utilitarul AUTOLOGON. </h6> <p> Microsoft a proiectat un instrument pentru automatizarea procesului de conectare în Windows. Instrumentul este denumit „Autologon” și vă permite să configurați cu ușurință Windows pentru autentificare automată, fără a fi nevoie să introduceți acreditările dvs. la fiecare pornire. Avantajul acestui instrument este că parola este stocată criptată în registru. </p> <p> 1. Descărcați <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/autologon\" target=\"_blank\" rel=\"nofollow noopener\"> Autologon </a> utilitate. <br> 2. Extrageți fișierul descărcat. <br> 3. Rulați „autologon.exe” <br> 4. Tastați parola și faceți clic <strong> Permite </strong> . </p> <p><img src=\"images/image_thumb-44-251.png\" alt=\"windows auto login\" loading=\"lazy\"></p> <p> * Notă: Dacă doriți să activați autentificarea automată, rulați din nou utilitarul și faceți clic pe <strong> Dezactivează </strong> . </p> <p> </p> <h6> Metoda 2. Activați conectarea automată din panoul de control Conturi utilizator. </h6> <p> A doua metodă de activare a autentificării automate la Windows 10/8/7 este dezactivarea setării „Utilizatorii trebuie să introducă un nume de utilizator și o parolă pentru a utiliza acest computer” în panoul de control Conturi utilizator. Pentru a face asta: </p> <p> Notă: Dacă utilizați un cont local, există un alt mod mai simplu de a forța Windows să se conecteze automat: Trebuie doar să specificați o nouă parolă goală (goală) din Setări&gt; Conturi&gt; Opțiuni de conectare&gt; Modificare parolă. Apoi introduceți parola o dată și apoi faceți clic pe Următorul de două ori și Finalizați. </p> <p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-738.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. În caseta „Deschidere”, tastați: <strong> controlați userpasswords2 </strong> &amp; faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-29-873.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. În opțiunile Conturi utilizator (fila „Utilizatori”), <strong> debifează </strong> <strong> Utilizatorii trebuie să introducă un nume de utilizator și o parolă pentru a utiliza această casetă de selectare a computerului </strong> și apoi faceți clic pe <strong> Aplica. * </strong></p> <p> * Notă: dacă doriți să dezactivați autentificarea automată în viitor, bifați doar această casetă. </p> <p><img src=\"images/image_thumb-32-315.png\" alt=\"auto login windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Tastați (de două ori) parola contului și faceți clic <strong> O.K </strong> de două ori pentru a închide proprietățile contului de utilizator. </p> <p><img src=\"images/image_thumb-31-509.png\" alt=\"Auto Login to Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Metoda 3. Activați autentificarea automată în registru (Windows 10/8/7 / Vista). </h6> <p> Ultima metodă de dezactivare a autentificării parolei, în sistemul de operare Windows 10, 8 sau 7, este activarea registrului de conectare automată. Pentru a face asta: </p> <p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-512.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. În caseta „Deschidere”, tastați: <strong> regedit </strong> &amp; faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb7-114.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Navigați la această cheie din panoul din stânga: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows NT \\ CurrentVersion \\ Winlogon </li> </ul> <p> 4. În panoul din dreapta: </p> <blockquote><p> A. Faceți clic dreapta pe un spațiu gol și selectați <strong> Nou </strong> &gt; <strong> Valoarea șirului. </strong></p> <p><img src=\"images/image_thumb-38-930.png\" alt=\"image\" loading=\"lazy\"></p> <p> b. Redenumiți noua valoare în <strong> DefaultUserName </strong> și apăsați <strong> introduce </strong> . <br> c. Deschideți valoarea REG_SZ „DefaultUserName”. <br> d. Tastați numele contului dvs. de utilizator local sau Contului dvs. Microsoft și faceți clic pe <strong> O.K </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-42-933.png\" alt=\"enable auto login registry\" loading=\"lazy\"></p> <p> </p> <p> 5a. Efectuați aceiași pași și creați o nouă valoare REG_SZ (șir) și denumiți-o <strong> Parolă împlicită </strong> . <br> 5b. Faceți dublu clic pe „DefaultPassword” <strong> &#39; </strong> Valoarea REG_SZ, tastați parola în caseta Value data și faceți clic <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-43-192.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7a. În cele din urmă, creați o nouă valoare REG_SZ și denumiți-o <b> AutoAdminLogon </b> . <br> 7b. Faceți dublu clic pe valoarea „AutoAdminLogon”, tastați <strong> 1 </strong> în caseta Value data și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-41-705.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Închideți Registry Editor și reporniți computerul. * </p> <p> * Note: <br> 1. Dacă computerul dvs. face parte dintr-un domeniu, atunci trebuie să creați o altă valoare REG_SZ cu numele <strong> DefaultDomainName </strong> și apoi pentru a introduce în caseta de date valorice numele domeniului dvs. <br> 2. Pentru a dezactiva autentificarea automată în viitor, trebuie doar să ștergeți valorile șirului create recent menționate mai sus. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}