{"title":"Cum să blochezi YouTube pe Windows 10.","content":"<p> Deoarece învățarea la distanță a devenit o parte a vieții copiilor în ultimii ani, mulți părinți caută o modalitate de a bloca videoclipurile de pe YouTube în timpul e-learning-ului sau de a reduce timpul petrecut de copii în fața unui computer vizionând videoclipuri în loc să facă alte activități. </p> <p> Pe lângă dependența de YouTube care îi îngrijorează pe părinți, în ultimii ani au fost lansate multe videoclipuri YouTube cu conținut inadecvat sau periculos pentru copii și din acest motiv este necesar să se restricționeze accesul la YouTube, mai ales atunci când nu există supraveghere de către părinți. </p> <p> În acest ghid, veți afla cum să împiedicați accesul la site-ul YouTube pe toate browserele. * </p> <p> * Notă: dacă doriți să blocați un site web numai în Chrome sau în Firefox, citiți acest articol: <a href=\"https://www.repairwin.com/block-websites-on-chrome-firefox/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se blochează site-urile web pe Chrome și Firefox. </a></p> <h2> Cum să blochezi YouTube pe orice browser din sistemul de operare Windows 10, 8 sau 7. </h2> <p> Cea mai fiabilă modalitate de a bloca orice site web de pe orice browser de pe un PC Windows este de a utiliza fișierul „hosts”. <strong> gazde </strong> fișier este un fișier al sistemului de operare care mapează numele gazdei (nume de domenii) la adresele IP. Cu cuvinte simple, atunci când introduceți adresa unui site web în browser, computerul se uită mai întâi la local <strong> gazde </strong> fișier pentru a-și rezolva adresa IP. Dacă numele site-ului nu apare în fișierul gazdă, atunci încearcă să-și găsească adresa IP din serviciul DNS pe care îl utilizați pe dispozitiv. </p> <p> Pentru a bloca YouTube pe orice browser web (de ex. Chrome, Firefox, Edge etc.) pe Windows prin fișierul hosts: </p> <p> 1. Deschideți <strong> Notepad </strong> cerere <strong> ca administrator </strong> . Pentru a face asta: </p> <blockquote><p> A. Tip <strong> blocnotes </strong> pe caseta de căutare </p> <p> b. <strong> Click dreapta </strong> pe <strong> Notepad </strong> și selectați <strong> Rulat ca administrator </strong> . </p> <p><img src=\"images/image_thumb-584.png\" alt=\"run notepad as administrator\" loading=\"lazy\"></p></blockquote> <p> </p> <p> 2. Din <strong> Fişier </strong> meniu, selectați <strong> Deschis. <br> </strong> 3. Navigați la această locație de pe disc: </p> <ul> <li> C: \\ Windows \\ System32 \\ drivers \\ etc </li> </ul> <p> 4. Schimbați „Tipul de fișier” în <strong> Toate filele </strong> și apoi deschideți fișierul <strong> gazde </strong> fişier </p> <p><img src=\"images/image_thumb-1-968.png\" alt=\"block sites hosts file\" loading=\"lazy\"></p> <p> </p> <p> 5. La final adăugați următoarele rânduri: * </p> <ul> <li> 127.0.0.1 youtube.com </li> <li> 127.0.0.1 www.youtube.com </li> <li> 127.0.0.1 m.youtube.com </li> </ul> <p> * Notă: Apăsați TAB după ce tastați 127.0.0.1 </p> <p><img src=\"images/image_thumb-2-460.png\" alt=\"block youtube hosts\" loading=\"lazy\"></p> <p> </p> <p> 6. Când ați terminat, faceți clic pe <strong> Fişier </strong> &gt; <strong> Salvați </strong> și închideți blocnotesul. </p> <p> 7. În cele din urmă, deschideți browserul și încercați să vizitați YouTube. În mod normal, ar trebui să primiți mesajul: „Conectați-vă la Internet. Sunteți offline. Verificați conexiunea”. </p> <p><img src=\"images/image_thumb-3-490.png\" alt=\"block youtube.com hosts\" loading=\"lazy\"></p> <p> </p> <p> 8. Ai terminat. Dacă doriți să deblocați YouTube în viitor, urmați aceiași pași. dar de această dată eliminați cele trei (3) linii adăugate în fișierul hosts sau tastați simbolul <strong> # </strong> în fața fiecărei linii adăugate. </p> <p> Asta-i tot oameni buni! Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}