{"title":"Cum să vizualizați și să exportați parole Firefox.","content":"<p> În acest tutorial vă voi arăta cum să vizualizați și să gestionați parolele salvate în browserul web Mozilla Firefox. După cum știți deja, browserul Firefox vă oferă opțiunea de a vă salva numele de utilizator și parola de conectare la prima vizită a unui site web. Dacă alegeți să vă salvați acreditările, Firefox le va aminti, iar data viitoare când vă conectați la site-ul web, nu va mai trebui să le retipați. </p> <p><img src=\"images/image_thumb-98-507.png\" alt=\"How to View and Export Firefox Passwords.\" loading=\"lazy\"></p> <p> Dacă, în timp, uitați datele de conectare, citiți acest tutorial pentru a afla cum să vizualizați și să exportați parolele stocate în Firefox. </p> <h4> Cum să gestionați, să afișați și să exportați parolele salvate în Mozilla Firefox. </h4> <p><strong> Cum să vizualizați parolele Firefox </strong></p> <p> 1. Din meniul Firefox <img src=\"images/image_thumb-99-587.png\" alt=\"image\" loading=\"lazy\"> alege <strong> Autentificare și parole </strong> . </p> <p><img src=\"images/image_thumb-100-999.png\" alt=\"View Saved Passwords Firefox\" loading=\"lazy\"></p> <p> </p> <p> 2. Faceți clic pe <strong> Afișați parolele </strong> pentru a vizualiza parolele salvate pe site-uri web. În plus, în această fereastră, utilizați fișierul <strong> Elimina </strong> pentru a elimina parolele salvate din Firefox. </p> <p><img src=\"images/image_thumb-101-863.png\" alt=\"Manage Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p><strong> Cum se salvează toate parolele Firefox într-un fișier. </strong></p> <p> Pentru a vizualiza și exporta toate parolele stocate în Firefox: </p> <p> 1. Descărcați <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> PasswordFox </a> utilitate ( <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> http://www.nirsoft.net/utils/passwordfox.html </a> ) <br> 2. Extrageți fișierul zip descărcat. <br> 3. Din folderul extras, faceți dublu clic pentru a rula aplicația „PasswordFox.exe”. <br> 4. Apăsați <strong> Ctrl </strong> + <strong> A </strong> pentru a selecta toate site-urile listate, apoi din <strong> Fişier </strong> meniu alege <strong> Salvați articolele selectate. </strong></p> <p><img src=\"images/image_thumb-102-438.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Tastați un nume pentru fișierul .txt și faceți clic <strong> Salvați </strong> . </p> <p><img src=\"images/image_thumb-103-923.png\" alt=\"How to Save Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p> 6. Deschideți fișierul creat în notepad, pentru a vizualiza toate parolele stocate în browserul Mozilla Firefox. </p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}