{"title":"Cum să deschideți PowerShell ca administrator în dosarul curent în File Explorer (Windows 10)","content":"<p> Dacă doriți să deschideți PowerShell sau PowerShell ca administrator, în orice locație / folder din File Explorer, continuați să citiți acest tutorial. După cum știți modalitățile obișnuite de a deschide PowerShell în Windows 10, este să îl căutați folosind căutarea Cortana sau (mai rapid) să apăsați butonul <strong> Victorie <img src=\"images/image_thumb8_thumb_thumb-479.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"></strong> + <strong> X </strong> tastele pentru a deschide „meniul Power User” și pentru a rula Windows PowerShell de acolo. </p> <p><img src=\"images/image_thumb-54-350.png\" alt=\"PoweShell Admin (Win + X menu)\" loading=\"lazy\"></p> <p> </p> <p> Deși aceste metode sunt utile, uneori este nevoie să deschideți PowerShell într-o anumită locație / folder. Pentru aceasta, urmați instrucțiunile de mai jos. </p> <h4> Cum se deschide Windows PowerShell într-o locație specifică din Windows 10. </h4> <p> 1. Navigați la folderul în care doriți să deschideți PowerShell. <br> 2. <strong> Țineți apăsat </strong> <strong> SCHIMB </strong> cheie și <strong> Click dreapta </strong> oriunde în interiorul dosarului. <br> 3. Din meniul cu clic dreapta, selectați <strong> Deschideți fereastra PowerShell aici </strong> la <strong> </strong> deschideți o nouă fereastră PowerShell pe acel folder. </p> <p> </p> <p><img src=\"images/image_thumb-55-793.png\" alt=\"Open PoweShell at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Dacă doriți să deschideți „PowerShell As Admin” pe orice folder, apoi faceți clic pe <strong> Fişier </strong> meniu și selectați <strong> Deschideți Windows PowerShell ca administrator </strong> . * </p> <p> * Notă: După cum puteți vedea din meniul „Fișier”, puteți deschide și o fereastră PowerShell „simplă”. </p> <p><img src=\"images/image_thumb-56-830.png\" alt=\"Open PoweShell As Administrator at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p><strong> Ajutor suplimentar: </strong> Dacă sunteți un fan al comenzilor rapide de la tastatură, o altă modalitate de a deschide PowerShell (Admin) este să apăsați tasta <strong> Alt </strong> + <strong> F </strong> + <strong> S </strong> + <strong> A </strong> tastele în ordine. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}