{"title":"Cum se reinstalează Windows 10 dacă Windows nu va porni.","content":"<p> În acest tutorial veți găsi instrucțiuni detaliate despre cum să reinstalați Windows 10, dacă Windows nu pornește. Într-un tutorial anterior am menționat calea către <a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"nofollow noopener\"> reinstalați Windows 10 utilizând funcția „RESET acest PC </a> . Dar, „RESET acest PC” este disponibil numai dacă Windows 10 poate porni în mod normal sau dacă puteți lansa meniul „Advanced Startup” după ce ați pornit pe Windows. </p> <p> Acest tutorial conține instrucțiuni pentru a reinstala Windows 10 dacă Windows nu va porni, fără a vă pierde fișierele. </p> <h2> Cum se reinstalează perechea Windows 10 dacă Windows nu poate porni. </h2> <p><strong> Cerințe </strong> : Pentru a reinstala Windows 10 dacă Windows nu pornește normal, va trebui să porniți computerul de pe un suport de instalare Windows (USB sau DVD) și să activați meniul Opțiuni avansate (meniul tastelor F8). Dacă nu dețineți un suport de instalare Windows, puteți crea unul utilizând <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Instrumentul Microsoft Creation Media </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se creează un suport de instalare USB Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se creează un suport de instalare DVD Windows 10. </a></li> </ul> <p> 1. Porniți computerul de pe suportul de instalare Windows. <br> 3. Apăsați <strong> Următorul </strong> la ecranul Opțiuni limbă. <br> 4. Alegeți <strong> Reparați computerul </strong> . <br> 5. Apoi alegeți <strong> Depanare -&gt; </strong><strong> Opțiuni avansate -&gt; Prompt de comandă. </strong></p> <p> 6. La fereastra promptului de comandă, tastați următoarea comandă și apăsați <strong> Introduce: </strong></p> <ul> <li><strong> bcdedit / set {default} moștenire bootmenupolicy </strong></li> </ul> <p><img src=\"images/image_thumb-33-821.png\" alt=\"advanced boot options\" loading=\"lazy\"></p> <p> 7. Tastați <strong> Ieșire </strong> pentru a închide fereastra promptului de comandă. <br> 8. Scoateți suportul de instalare Windows. <br> 9. Închideți toate ferestrele pentru a reporni sau opri computerul. </p> <p> 10. <strong> presa </strong> <strong> F8 </strong> cheie <strong> repetat </strong> în timpul pornirii computerului. </p> <p> 11. La „Meniul Opțiuni avansate”, evidențiați „ <strong> Reparați computerul </strong> &quot;și apoi apăsați <strong> INTRODUCE </strong> . </p> <p><img src=\"images/image_thumb-13-334.png\" alt=\"Repair your Computer in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 12. În ecranul „Alegeți o opțiune”, selectați <strong> Depanare </strong> și apoi faceți clic pe <strong> Resetați acest computer -&gt; Păstrați fișierele mele. </strong> * </p> <p> Note: <br> 1. „ <strong> Pastreaza-mi fisierele&quot; </strong> opțiune, vă va elimina toate aplicațiile și setările, dar vă va păstra fișierele personale. <br> 2. <strong> „Eliminați totul” </strong> opțiune, va elimina toate aplicațiile, setările și fișierele. Prin selectarea acestei opțiuni, computerul dvs. va fi readus la o stare curată. <br> 3. Dacă alegeți „Eliminați totul”, asigurați-vă că aveți o copie de rezervă recentă a fișierelor personale pe un alt suport de stocare (de exemplu, un disc USB), în caz contrar toate fișierele dvs. vor fi pierdute. </p> <p><img src=\"images/image_thumb-14-296.png\" alt=\"How to Reinstall Windows 10 if Windows Won't Boot.\" loading=\"lazy\"></p> <p> </p> <p> 13. În ecranul următor, alegeți un cont cu privilegii de administrator. ) și la următorul ecran tastați parola și faceți clic pe <strong> Următorul </strong> . </p> <p><img src=\"images/image_thumb-15-869.png\" alt=\"How to Reinstall Windows 10 if Windows cannot Boot.\" loading=\"lazy\"></p> <p> 14. Tastați parola pentru contul selectat și faceți clic <strong> Continua. </strong></p> <p><img src=\"images/image_thumb-16-692.png\" alt=\"How to Reinstall Windows 10 if Windows fails to boot.\" loading=\"lazy\"></p> <p> </p> <p> 15. Așteptați până la finalizarea instalării. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a ajuta la răspândirea cuvântului despre acest ghid. </p>"}