{"title":"Cum se activează protecția de restaurare a sistemului în sistemul de operare Windows 10/8/7.","content":"<p> Acest tutorial conține instrucțiuni despre cum să activați protecția sistemului pe sistemul de operare Windows 10, 8 și 7. Protecția de restaurare a sistemului (cunoscută în mod obișnuit ca „Protecția sistemului”) este o caracteristică Windows care vă permite <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> restabili </a> sistemul dvs. într-un moment mai devreme, dacă Windows nu funcționează corect după o modificare semnificativă a fișierelor de sistem (de exemplu, după o actualizare Windows sau după un atac de virus). </p> <p> Instrumentul Restaurare sistem utilizează serviciul Volume Shadow Copy pentru a realiza instantanee ale fișierelor de sistem și ale registrului Windows și le salvează ca puncte de restaurare. Aceste „Puncte de restaurare” pot fi folosite pentru a restabili sistemul la o stare de lucru anterioară, dacă Windows nu pornește sau devine instabil, fără a fi nevoie să reinstalați sistemul de operare. </p> <h4> Cum se activează protecția de restaurare a sistemului în Windows 10. </h4> <p> 1. Deschideți Windows Explorer, faceți clic dreapta pe pictograma „Acest computer” și alegeți <strong> Proprietăți </strong> . </p> <p><img src=\"images/image_thumb-70-672.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Alegeți <strong> Protecția sistemului </strong> la stânga. </p> <p><img src=\"images/image_thumb-71-762.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Evidențiați <strong> Disc local C: (sistem) </strong> și faceți clic pe <strong> Configurați. </strong></p> <p><img src=\"images/image_thumb-72-782.png\" alt=\"turn on system restore protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. La opțiunile de protecție a sistemului, selectați <strong> Activați protecția sistemului </strong> și faceți clic pe <strong> O.K. * </strong></p> <p> * Notă: Dacă „Protecția sistemului: este deja activată, atunci sunteți OK. </p> <p><img src=\"images/image_thumb-73-192.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 5. În cele din urmă, la opțiunile de protecție a sistemului, faceți clic pe <strong> Crea </strong> pentru a crea un instantaneu (Restore Point), al stării curente a sistemului. </p> <p><img src=\"images/image_thumb-75-308.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}