{"title":"Cum se schimbă conexiunea imprimantei HP de la USB la wireless.","content":"<p> Dacă dețineți o imprimantă HP compatibilă fără fir, conectată printr-un cablu USB și doriți să schimbați conexiunea la wireless, citiți acest tutorial pentru a realiza această sarcină. Instrucțiunile sunt utile dacă nu aveți un router compatibil WPS sau dacă doriți să reconfigurați setările wireless ale imprimantei, în cazul în care ați schimbat routerul wireless. </p> <h4> Cum se conectează o imprimantă conectată USB la rețeaua fără fir. </h4> <p> 1. Din panoul imprimantei, apăsați butonul Wireless <img src=\"images/image_thumb-55-307.png\" alt=\"image\" loading=\"lazy\"> pentru a porni wireless-ul. * </p> <p> * Notă: Dacă v-ați conectat înainte de imprimantă la o altă rețea fără fir, țineți apăsat butonul <strong> Fără fir </strong> buton <img src=\"images/image_thumb-57-212.png\" alt=\"image\" loading=\"lazy\"> si <strong> Anulare </strong> buton <strong> X </strong> din panoul de control al imprimantei, pentru a restabili setările rețelei wireless la valorile implicite. (Această procedură funcționează pe majoritatea modelelor de imprimantă HP. Vă rugăm să vă asigurați din manualul imprimantei că procesul de resetare este corect.) </p> <p> 2. Conectați-vă imprimanta la computer utilizând un cablu USB. </p> <p> 3. Descărcați și instalați cele mai recente software și drivere complete pentru imprimantă de la <a href=\"https://support.hp.com/us-en/drivers/printers\" target=\"_blank\" rel=\"nofollow noopener\"> Site-ul HP Printer Support </a> . </p> <p> 4. După instalarea software-ului imprimantei, deschideți pictograma cu numele imprimantei pentru a lansa <strong> Asistent imprimantă HP </strong> . </p> <p> 5. Faceți clic pe <strong> Configurare dispozitiv și software </strong> . </p> <p><img src=\"images/image_thumb-48-818.png\" alt=\" Change HP Printer Connection from USB to Wireless\" loading=\"lazy\"></p> <p> </p> <p> 6. Faceți clic pe <strong> Convertiți un dispozitiv conectat USB la wireless </strong> . </p> <p><img src=\"images/image_thumb-49-582.png\" alt=\"Connect HP Pinter to Wireless Network using the USB Connection\" loading=\"lazy\"></p> <p> </p> <p> 7. La setările wireless, verificați dacă numele rețelei wireless (SSID) este corect. Atunci… </p> <blockquote><p> 1. Faceți clic pe <strong> Afișează parola fără fir </strong> . </p> <p> 2. Asigurați-vă că parola fără fir este corectă (altfel introduceți parola fără fir). </p> <p> 3. Selectați <strong> Da, vreau să folosesc această rețea </strong> . </p> <p> 4. Faceți clic pe <strong> Următorul </strong> . </p></blockquote> <p><img src=\"images/image_thumb-50-641.png\" alt=\"Connect HP Pinter to Wireless using USB\" loading=\"lazy\"></p> <p> </p> <p> 8. Așteptați până când configurarea wireless este finalizată. </p> <p><img src=\"images/image_thumb-51-477.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Când vi se solicită, faceți clic pe <strong> da </strong> la Partajarea dispozitivelor. </p> <p><img src=\"images/image_thumb-52-556.png\" alt=\"Connect HP Pinter to Wireless network using USB\" loading=\"lazy\"></p> <p> </p> <p> 10. Când configurarea wireless este finalizată, scoateți cablul USB și faceți clic <strong> Următorul </strong> . </p> <p><img src=\"images/image_thumb-58-143.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 11. Faceți clic pe <strong> O.K </strong> pentru a verifica îndepărtarea cablului USB. </p> <p><img src=\"images/image_thumb-59-549.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 12. Acum sunteți gata să utilizați imprimanta HP fără fir. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}