{"title":"Cum să localizați folderele de pornire în Windows 10/8/7.","content":"<p> Folderul Startup din Windows este locația în care sunt stocate toate comenzile rapide ale aplicațiilor care încep cu Windows. Există două foldere de pornire diferite în Windows: există un folder de pornire care conține toate aplicațiile care rulează pentru toți utilizatorii și există un folder de pornire diferit, care conține doar aplicațiile care rulează pentru utilizatorul curent. </p> <p> Acest tutorial conține instrucțiuni despre cum să localizați folderele de pornire în sistemul de operare Windows 10, 8 sau 7, pentru a gestiona (adăuga sau elimina) aplicațiile care încep cu Windows. </p> <h4> Cum se vizualizează folderul (folderele) de pornire Windows - Programe. * </h4> <p> * Notă: dacă doriți să gestionați aplicațiile de pornire (Store Apps) în Windows 10, navigați la: </p> <ul> <li> Mergi la <strong> start </strong> meniul <img src=\"images/image_thumb-98-474.png\" alt=\"image\" loading=\"lazy\"> , faceți clic pe <strong> Setări </strong> <img src=\"images/image_thumb-150-181.png\" alt=\"image\" loading=\"lazy\"> și apoi faceți clic pe <strong> Aplicații </strong> -&gt; <strong> Lansare. </strong></li> </ul> <p><img src=\"images/image_thumb-95-680.png\" alt=\"manage startup apps windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Pentru a naviga la folderul de pornire „Toți utilizatorii”. </h6> <p> Dacă doriți să localizați folderul care conține toate aplicațiile care rulează automat la pornirea Windows, <strong> pentru toate conturile de utilizator </strong> , deschideți Windows Explorer și navigați la următoarea cale: * </p> <ul> <li><strong> C: \\ ProgramData \\ Microsoft \\ Windows \\ Start Menu \\ Programs \\ StartUp </strong></li> </ul> <p> * Notă: pentru a vizualiza „ <strong> ProgramData </strong> &quot;în Windows Explorer, trebuie <a href=\"https://www.repairwin.com/how-to-view-hidden-files-in-windows-8-7-vista-xp/\" target=\"_blank\" rel=\"nofollow noopener\"> activați vizualizarea fișierelor ascunse </a> . </p> <p><strong> BACSIS: </strong> Pentru a vă face viața mai ușoară, puteți utiliza următorul mod de a naviga la locația de mai sus: </p> <ol> <li> <ol> <li> Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-770.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. </li> <li> În caseta Căutare, tastați: <strong> shell: pornire comună </strong> &amp; faceți clic pe <strong> O.K </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb-91-505.png\" alt=\"How to Locate the Startup Folder for All Accounts (Users)\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Pentru a naviga la dosarul de pornire „Cont curent”. </h6> <p> Dacă doriți să localizați folderul de pornire care conține toate aplicațiile care rulează automat la pornirea Windows, <strong> pentru contul de utilizator curent </strong> (numai), deschideți Windows Explorer și navigați la următoarea cale: * </p> <ul> <li><strong> C: \\ Users \\\\ AppData \\ Roaming \\ Microsoft \\ Windows \\ Start Menu \\ Programs \\ Startup </strong></li> </ul> <p> * Notă: pentru a vizualiza „ <strong> Datele aplicatiei </strong> &quot;în Windows Explorer, trebuie <a href=\"https://www.repairwin.com/how-to-view-hidden-files-in-windows-8-7-vista-xp/\" target=\"_blank\" rel=\"nofollow noopener\"> activați vizualizarea fișierelor ascunse </a> . </p> <p><strong> BACSIS: </strong> Iată o altă modalitate mai ușoară de a naviga în locația de mai sus: </p> <ol> <li> <ol> <li> Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-671.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. </li> <li> În caseta Căutare, tastați: <b> shell: pornire </b> &amp; faceți clic pe <strong> O.K </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb-92-234.png\" alt=\" How to Locate the Startup Folder for current Account\" loading=\"lazy\"></p> <p> </p> <p> Asta e tot! A funcționat pentru tine? </p> <p> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}