{"title":"Cum să OPRIȚI însămânțarea în uTorrent.","content":"<p> Mulți dintre noi am folosit uTorrent pentru a descărca filme sau alte fișiere de-a lungul anilor, deoarece este cel mai popular client P2P pentru descărcarea sau partajarea de fișiere mari pe Internet. Dar, uneori, trebuie să opriți însămânțarea în uTorrent, deoarece aveți nevoie de toată lățimea de bandă Internet (viteză), pentru a încărca sau descărca un fișier mare (prin uTorrent). </p> <p> În acest articol veți găsi instrucțiuni pas cu pas despre cum să dezactivați însămânțarea completă în uTorrent și cum să opriți însămânțarea după descărcare. </p> <h2> Cum se dezactivează însămânțarea în uTorrent. </h2> <p> A. Pentru a opri temporar însămânțarea în timp ce descărcați sau încărcați fișiere în uTorrent: </p> <p> 1. Faceți clic pe torrentul din fluxul dvs. de torrent și faceți clic pe <strong> STOP </strong> sau apăsați butonul <strong> Reciclează </strong> pictogramă pentru a elimina fișierul de însămânțare din listă. </p> <p><img src=\"images/image_thumb-51-323.png\" alt=\"Stop Seeding uTorrent\" loading=\"lazy\"></p> <p> </p> <p> B. Pentru a dezactiva complet însămânțarea uTorrent, procedați după cum urmează: </p> <p> 1. Din <strong> Opțiuni </strong> meniu, faceți clic pe <strong> Preferințe. </strong></p> <p><img src=\"images/image_thumb-52-513.png\" alt=\"uTorrent Preferences\" loading=\"lazy\"></p> <p> </p> <p> 2. În <strong> Lățime de bandă </strong> opțiuni, faceți următoarele modificări și apoi faceți clic pe <strong> O.K. </strong></p> <ul> <li> Seteaza <strong> Rata maximă de încărcare (kB / s) </strong> la <strong> 1 </strong> . </li> <li> Seteaza <strong> Numărul de sloturi de încărcare pe torrent </strong> la <strong>0</strong> . </li> </ul> <p><img src=\"images/image_thumb-53-961.png\" alt=\"disable seeding uTorrent\" loading=\"lazy\"></p> <p> </p> <p> C. Pentru a preveni automat însămânțarea uTorrent atunci când este descărcat un fișier torrent. </p> <p> 1. Din <strong> Opțiuni </strong> meniu, faceți clic pe <strong> Preferințe. <br> </strong> 2. <strong> </strong> În <strong> În așteptare </strong> opțiuni, faceți următoarele modificări și apoi faceți clic pe <strong> O.K. </strong></p> <ul> <li> Seteaza <strong> Raport minim (%) </strong> la <strong>0</strong></li> <li> Seteaza <strong> Timp minim de însămânțare (minute) </strong> la <strong>0</strong></li> <li> Seteaza <strong> Numărul minim de semințe disponibile </strong> la <strong> 0</strong></li> <li><strong> Verifica </strong> <strong> Limitați rata de încărcare </strong> caseta de selectare și tip <strong>0</strong> in cutie. </li> </ul> <p><img src=\"images/image_thumb-54-589.png\" alt=\"prevent utorrent seeding\" loading=\"lazy\"></p> <p> Asta-i tot oameni buni! Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}