{"title":"Cum se creează un utilizator nou în Windows 7 și Vista.","content":"<p> Uneori este nevoie să adăugați utilizatori noi pe un computer Windows, așa că în acest articol vă voi arăta trei (3) moduri diferite de a crea un cont de utilizator nou în Windows 7 și Vista. </p> <p> După cum probabil știți când instalați Windows pentru prima dată, primul utilizator pe care îl creați este contul de administrator. Acest lucru este OK atunci când sunteți singurul utilizator de pe computer, dar dacă partajați computerul cu alții sau dacă doriți să partajați fișierele dvs. în rețea, atunci este mai bine să creați utilizatori noi din motive de siguranță. </p> <h4> Cum să adăugați utilizatori de știri în Windows 7 sau Vista. </h4> <p><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda 1. Creați un cont nou utilizând Panoul de control. </a></p> <p><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda 2. Adăugați un cont utilizând utilitarul „Conturi utilizator”. </a></p> <p><a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda 3. Adăugați un utilizator nou folosind Command Prompt. </a></p> <p> </p> <h6> Metoda 1. Cum se creează un utilizator nou utilizând Panoul de control. </h6> <p> Metoda clasică pentru a adăuga un utilizator nou în Windows, este din opțiunile „Conturi utilizator” din Panoul de control. Pentru a face asta: </p> <p> 1. Conectați-vă la Windows cu un cont de administrator. <br> 2. Navigați la Windows <strong> Panou de control </strong> . <br> 3. Faceți clic pe <strong> Conturi de utilizator </strong></p> <p><img src=\"images/image_thumb-29-471.png\" alt=\"How to Create a New User in Windows 7.\" loading=\"lazy\"></p> <p> </p> <p> 4. Faceți clic pe <strong> Administrează un alt cont </strong></p> <p><img src=\"images/image_thumb-30-451.png\" alt=\"add user windows 7\" loading=\"lazy\"></p> <p> 5. Faceți clic pe <strong> Creați un cont nou </strong></p> <p><img src=\"images/image_thumb-31-477.png\" alt=\"create account windows 7\" loading=\"lazy\"></p> <p> </p> <p> 6. Tastați un nume (de ex. „Utilizator1”) pentru noul utilizator și apoi faceți clic <strong> Creează cont </strong> . * </p> <p> * Notă: Dacă doriți să atribuiți privilegii administrative noului utilizator, verificați și <strong> Administrator </strong> opțiune. </p> <p><img src=\"images/image_thumb-32-542.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. În cele din urmă, dacă doriți să specificați o parolă pentru noul cont, apoi faceți clic pe noul cont și apoi faceți clic pe <strong> Creați o parolă </strong> opțiune pentru a specifica parola. </p> <p><img src=\"images/image_thumb-33-297.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <p> </p> <h6> Metoda 2. Cum se adaugă sau se șterg utilizatori utilizând utilitarul „Conturi utilizator”. </h6> <p> Una dintre metodele mele preferate de a adăuga utilizatori (în toate versiunile Windows) este folosirea utilitarului „Conturi utilizator”, care oferă toate opțiunile necesare pentru a gestiona ușor utilizatorii de pe PC. (Adăugați / eliminați utilizatori, specificați privilegii de utilizator sau pentru a schimba parola de utilizator). </p> <p> 1. Conectați-vă la Windows cu un cont de administrator. <br> 2. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-530.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 3. În caseta „Deschidere”, tastați: <strong> controlați userpasswords2 </strong> &amp; faceți clic pe <strong> O.K </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-29-859.png\" alt=\"add user windows 7\" loading=\"lazy\"></p> <p> </p> <p> 4. În fila Utilizatori, faceți clic pe <strong> Adăuga </strong> pentru a adăuga contul, pe care doriți să-l aveți acces la fișierele dvs. </p> <p><img src=\"images/image_thumb_thumb-1-977.png\" alt=\"image_thumb\" loading=\"lazy\"></p> <p> </p> <p> 5. În ecranul următor tastați un nume de utilizator (de ex. „Utilizator5”) pentru noul utilizator și faceți clic <strong> Următorul </strong> . * </p> <p><img src=\"images/image_thumb1_thumb-1-264.png\" alt=\"create new account windows 7\" loading=\"lazy\"></p> <p> </p> <p> 6. Apoi tastați o parolă pentru noul utilizator și faceți clic <strong> Următorul </strong> din nou. </p> <p><img src=\"images/image_thumb2_thumb-1-923.png\" alt=\"image_thumb2\" loading=\"lazy\"></p> <p> </p> <p> 7. În cele din urmă faceți clic pe <strong> finalizarea </strong> . * </p> <p> * Notă: Dacă doriți să atribuiți privilegii administrative noului utilizator, verificați și <strong> Administrator </strong> opțiune. </p> <p><img src=\"images/image_thumb3_thumb-1-835.png\" alt=\"image_thumb3\" loading=\"lazy\"></p> <p> </p> <h6> Metoda 3. Cum se adaugă sau se elimină un utilizator cu prompt de comandă în sistemul de operare Windows 10/8/7. </h6> <p> Cea mai ușoară metodă de a adăuga sau șterge utilizatori pe Windows 10, 8, 7 sau Vista, este utilizând promptul de comandă. </p> <p> Pentru a adăuga un cont nou din linia de comandă: </p> <p> 1. Deschideți <strong> Promptul de comandă ca administrator </strong> . <br> 2. La promptul de comandă, tastați următoarea comandă și apăsați <strong> introduce </strong> : </p> <ul> <li><strong> nume utilizator utilizator net parolă / adăugare </strong></li> </ul> <p> * Notă: La comanda de mai sus modificați câmpurile „nume de utilizator” și „parolă”, în funcție de alegerea dvs. </p> <blockquote><p> de exemplu. dacă doriți să creați un cont nou cu numele de utilizator „John” și parola „Pas123”, tastați: </p> <ul> <li> utilizator net John Pas123 / adăugare </li> </ul> </blockquote> <p><img src=\"images/image_thumb-35-938.png\" alt=\"add user command prompt windows 7\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <p> 3. În cele din urmă, dacă doriți să adăugați noul utilizator la grupul Administratori, dați această comandă: </p> <ul> <li><strong> nume de utilizator / adăugare administratori de grup local local </strong></li> </ul> <blockquote><p> de exemplu. În exemplul nostru, comanda este: </p> <ul> <li> net localgroup administrators John / add </li> </ul> </blockquote> <p><img src=\"images/image_thumb-36-776.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Pentru a șterge un utilizator din promptul de comandă: </p> <p> 1. Deschideți <strong> Promptul de comandă ca administrator </strong> . <br> 2. La promptul de comandă, tastați următoarea comandă și apăsați <strong> introduce </strong> : </p> <ul> <li><strong> nume de utilizator net / ștergere </strong></li> </ul> <p> de exemplu. dacă doriți să ștergeți utilizatorul „John”, tastați: </p> <ul> <li> utilizator net John / șterge </li> </ul> <p><img src=\"images/image_thumb-37-389.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această problemă. </p>"}