{"title":"Cum se dezactivează BitLocker în Windows 10.","content":"<p> Acest tutorial conține instrucțiuni despre cum să dezactivați criptarea Bitlocker Protection și Drive în Windows 10. După cum știți, funcția de criptare BitLocker, care este disponibilă în versiunile Windows 10 pro și enterprise, vă poate ajuta să vă protejați conținutul computerului de accesul neautorizat. Dar, uneori, este necesar să dezactivați Bitlocker-ul pe Windows 10, astfel încât în ​​acest ghid puteți găsi cum să faceți acest lucru. </p> <p> Dacă computerul dvs. este protejat cu BitLocker, atunci când porniți sistemul, vi se va solicita să conectați unitatea USB pe care ați utilizat-o în timpul activării BitLocker sau să introduceți parola BitLocker pentru a debloca unitatea C: pentru a continua pornirea. Dacă nu aveți niciunul dintre acestea, apăsați <strong> ESC </strong> pentru a introduce cheia de recuperare BitLocker. * </p> <blockquote><p> * Note: <br> 1. Dacă cheia sau parola de recuperare Bitlocker nu sunt acceptate la pornirea sistemului, încercați să deblocați și să decriptați hard diskul pe un alt computer Windows 10 sau încercați să: <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-recovery-environment-winre/\" target=\"_blank\" rel=\"nofollow noopener\"> Deblocați și decriptați unitatea protejată în mediul de recuperare Windows (WinRE). </a><br> 2. Dacă nu puteți debloca unitatea (de exemplu, dacă nu dețineți cheia de recuperare BitLocker sau deoarece nu este acceptată cheia BitLocker) și doriți să eliminați criptarea BitLocker pentru a utiliza din nou unitatea protejată, atunci citiți acest tutorial: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se elimină protecția BitLocker de pe o unitate fără cheia de recuperare BitLocker sau parola </a> . </p></blockquote> <p><img src=\"images/image_thumb-53-752.png\" alt=\"How to Disable BitLocker in Windows 10 GUI - PowerShell\" loading=\"lazy\"></p> <p> </p> <p> După pornirea pe Windows, urmați instrucțiunile de mai jos pentru a dezactiva protecția bitlocker și pentru a decripta unitatea. </p> <h4> Cum să dezactivați protecția BitLocker și să decriptați o unitate criptată Bitlocker în Windows 10. </h4> <p> Pentru a dezactiva protecția Bitlocker, trebuie să aveți parola Bitlocker sau cheia de recuperare Bitlocker pentru a debloca mai întâi unitatea și apoi pentru a decripta unitatea. </p> <p> Cheia de recuperare Bitlocker este o cheie numerică de 48 de cifre și poate fi găsită la următoarele locații: </p> <ul> <li> Pe o imprimare pe care ați salvat-o, când ați activat Bitlocker. </li> <li> Pe o unitate USB pe care ați folosit-o, în timpul activării Bitlocker pentru a salva cheia de recuperare Bitlocker. </li> <li> La <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Chei de recuperare a contului Microsoft </a> , utilizând contul MS pe care îl utilizați pentru a vă conecta la dispozitiv sau ați adăugat dispozitivul pentru a descărca aplicații din Microsoft Store sau pentru a activa MS Office sau pentru e-mail. </li> <li> Pe dumneavoastră <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Cont Azure </a> pentru computerele de lucru care se conectează cu un cont Azure Active Directory. </li> </ul> <p> Odată ce ați găsit cheia de recuperare Bitlocker sau parola bitlocker, continuați să deblocați unitatea criptată Bitlocker și să eliminați criptarea Bitlocker utilizând unul dintre următoarele moduri: </p> <ul> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda 1. Dezactivați Protecția BitLocker din GUI Windows. </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda 2. Dezactivați BitLocker și decriptați o unitate criptată Bitlocker din PowerShell. </a></li> </ul> <p> </p> <h6> Metoda 1. Cum se dezactivează protecția Bitlocker în GUI pentru Windows 10. </h6> <p> Pentru a dezactiva protecția de pe unitatea de sistem C: </p> <p> 1. Navigați la Windows <strong> Panou de control </strong> -&gt; <strong> Sistem și securitate </strong> și apoi faceți clic pe <strong> Criptare unitate Bit Locker </strong> . </p> <p><img src=\"images/image_thumb-33-233.png\" alt=\"How to turn off or Turn Onn BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Lângă unitatea de sistem de operare C :, faceți clic <strong> Dezactivați BitLocker </strong> . * </p> <p> * Note: <br> 1. Dacă opțiunea „Dezactivare BitLocker” nu este disponibilă, deschideți <strong> promptul de comandă ca administrator </strong> și dați următoarea comandă: </p> <ul> <li> manage-bde -off C: </li> </ul> <p> 2. Pentru a vedea starea de decriptare (progres) a unității C :, dați această comandă: </p> <ul> <li> manage-bde -status C: </li> </ul> <p> </p> <p> </p> <p><img src=\"images/image_thumb-43-236.png\" alt=\"turn off bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. După oprirea Bitlocker, faceți clic pe pictograma Bitlocker din bara de activități pentru a vizualiza procesul de decriptare. </p> <p><img src=\"images/image_thumb-41-694.png\" alt=\"remove bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Pentru a dezactiva protecția pe orice altă unitate protejată BitLocker din Windows GUI: </p> <p> 1. Deschideți Windows Explorer și apoi faceți dublu clic pe unitatea blocată. <br> 2. Introduceți parola Bitlocker sau faceți clic <strong> Mai multe opțiuni </strong> pentru a introduce cheia de recuperare Bitlocker, pentru a debloca unitatea. </p> <p><img src=\"images/image_thumb-47-646.png\" alt=\"unlock bitlocker windows 10\" loading=\"lazy\"></p> <p> 2. După deblocarea unității, navigați la <strong> Panou de control </strong> -&gt; <strong> Sistem și securitate </strong> -&gt; <strong> Criptare unitate Bit Locker </strong> și după selectarea unității faceți clic <strong> Dezactivați BitLocker </strong> pentru a decripta unitatea. (vezi capturile de ecran de mai sus) </p> <p> </p> <h6> Metoda 2. Cum să dezactivați protecția BitLocker și să decriptați o unitate criptată Bitlocker din PowerShell în Windows 10. </h6> <p> 1. Deschideți PowerShell ca administrator. Pentru a face asta: </p> <ol> <li> <ol> <li> La <strong> Cortana </strong> Caseta de căutare, tastați <strong> puterea </strong></li> <li> Faceți clic dreapta pe <strong> Windows PowerShell </strong> rezultă și selectează <strong> Rulat ca administrator. </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb_thumb-1-316.png\" alt=\"disable bitlocker powershell windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Apoi verificați starea de criptare a fiecărei unități de pe computer, tastând această comandă: </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p> </p> <p> 3. Rețineți în ce literă de unitate apare Starea blocării <strong> Blocat </strong> , și apoi continuați să deblocați acea unitate, tastând această comandă: * </p> <ul> <li><strong> manage-bde -unlock drive-letter: -rp BitLocker-recovery-key </strong></li> </ul> <p> * de ex .: Dacă doriți să deblocați unitatea &quot;D:&quot; și cheia de recuperare a bitlockerului este: &quot;123456-123456-123456-123456-123456-123456&quot;, apoi tastați: </p> <ul> <li> <ul> <li> manage-bde -unlock D: -rp 123456-123456-123456-123456-123456-123456 </li> </ul> </li> </ul> <p> </p> <p> * Notă: Dacă cunoașteți parola Bitlocker, dați această comandă: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -pw BitLocker-Password </strong></li> </ul> <p> * de ex .: Dacă doriți să deblocați unitatea „D:” și parola BitLocker este: „123qwerty”, tastați: * </p> <ul> <li> <ul> <li> manage-bde -unlock D: -password 123qwerty </li> </ul> </li> </ul> <p> </p> <p> 4. Apoi dezactivați criptarea bitlocker și decriptați unitatea criptată, utilizând una dintre următoarele comenzi: </p> <ul> <li><strong> Disable-BitLocker -MountPoint &quot;drive-letter:&quot; </strong></li> <li><strong> manage-bde -off-letter-drive: </strong></li> </ul> <p> * de ex .: Dacă doriți să dezactivați criptarea bitlocker pe unitatea &quot;D:&quot;, atunci tastați: </p> <ul> <li> <ul> <li> Disable-BitLocker -MountPoint &quot;D:&quot; </li> </ul> </li> </ul> <blockquote> <p> SAU tip ... </p> </blockquote> <ul> <li> <ul> <li> manage-bde –off D: </li> </ul> </li> </ul> <p> 5. Când procesul de decriptare este finalizat, continuați să verificați din nou starea de criptare dând această comandă: </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p> 6. Dacă se afișează „Stare blocare” <strong> Deblocat </strong> și se afișează „Starea conversiei” <strong> Complet decriptat, </strong> ai terminat! </p> <p><img src=\"images/image_thumb-50-868.png\" alt=\"view bitlocker status\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această problemă. </p>"}