{"title":"Cum se dezinstalează versiunea Edge Chromium în Windows 10.","content":"<p> Mulți utilizatori au raportat că, după instalarea noii versiuni bazate pe Chromium a browserului Microsoft Edge în Windows 10, sistemul a devenit prea lent sau se blochează la întâmplări. Dacă vă confruntați cu aceeași problemă, continuați să citiți mai jos pentru a dezinstala versiunea Edge Chromium de pe computer. * </p> <p> * Notă: Dacă versiunea Chromium a Microsoft Edge nu este încă instalată pe sistemul dvs., citiți instrucțiunile de pe aceasta <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> articol </a> pentru a preveni instalarea automată a Microsoft Edge. </p> <p><img src=\"images/image_thumb-38-388.png\" alt=\"Remove Edge Chromium in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Noua versiune bazată pe Chromium a browserului Microsoft Edge este instalată automat cu <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> Actualizați. Când se întâmplă acest lucru, nu puteți elimina Microsoft Edge din <strong> start </strong> meniul <img src=\"images/image_thumb2_thumb_thumb-565.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Setări </strong><img src=\"images/image_thumb-66-219.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Aplicații </strong> -&gt; <strong> Aplicații și caracteristici </strong> opțiuni, deoarece <strong> Dezinstalați </strong> opțiunea este gri. Pentru a ocoli această restricție, aplicați pașii de mai jos. </p> <p><img src=\"images/image_thumb-39-654.png\" alt=\"How to Uninstall Edge Chromium version in Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Cum se elimină Edge Chromium din Windows 10. </h4> <p> Pentru a dezinstala noul Edge bazat pe Chromium în Windows 10: </p> <p> 1. Navigați la următorul folder de pe computer: * </p> <ul> <li> C: \\ Program Files (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </li> </ul> <p> * Notă: numele folderului „85.0.564.41” indică versiunea instalată a noii versiuni Chromium și poate diferi de la computerul dvs. </p> <p> 2. Selectați calea folderului în bara de adrese și faceți clic dreapta pe&gt; <strong> Copie. </strong></p> <p><img src=\"images/image_thumb35_thumb-738.png\" alt=\"image_thumb[35]\" loading=\"lazy\"></p> <p> </p> <p> 3. Deschideți <strong> Prompt comandă ca administrator, </strong> tip <strong> CD </strong> și apoi apăsați <strong> CTRL + V </strong> pentru a lipi în calea folderului copiat. Când ați terminat, apăsați <strong> introduce </strong> . * </p> <p> * de ex .: În exemplul curent, comanda va fi: </p> <p><em> cd C: \\ Program Files (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </em></p> <p><img src=\"images/image_thumb39_thumb-252.png\" alt=\"Uninstall Edge Chromium\" loading=\"lazy\"></p> <p> </p> <p> 4. Acum, dați comanda de mai jos (Copiere / Lipire) în promptul de comandă pentru a elimina versiunea Chromium a browserului Microsoft Edge de pe computer. </p> <ul> <li> setup.exe –uninstall –sistem-level –verbose-logging –force-uninstall </li> </ul> <p><img src=\"images/image_thumb47_thumb-506.png\" alt=\"Uninstall Edge Chromium command\" loading=\"lazy\"></p> <p> 5. Odată ce comanda de mai sus este executată, vechea versiune a EDGE va fi activată din nou. Reporniți computerul pentru a aplica modificări. <br> 6. După repornire, procedați la instalarea manuală a <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> nou browser Edge bazat pe Chromium </a> pe computerul dvs., pentru a evita livrarea automată sau pentru a preveni instalarea viitoare a Edge Chromium, utilizând instrucțiunile din acest articol: <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să preveniți instalarea automată a Edge Chromium în Windows 10. </a></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}