{"title":"Cum reporniți un server HP din interfața iLO.","content":"<p> În acest tutorial, vom găsi instrucțiuni pas cu pas despre cum să reporniți de la distanță un server HP, utilizând interfața iLO a HP. HP Integrated Lights-Out (iLO) este o componentă hardware de pe serverele HP, care este de obicei integrată pe placa de sistem. Componenta iLO are propria conexiune de rețea, adresă IP și interfață web și poate ajuta utilizatorul să acceseze și să gestioneze de la distanță serverul. </p> <h4> Cum reporniți un server HP utilizând interfața web iLO 5. </h4> <p> Pentru a reporni un server dacă acesta se blochează, din interfața iLO: </p> <p> 1. De pe un alt computer, deschideți un browser web și, în bara de adrese, tastați adresa IP a interfeței iLO de pe serverul pe care doriți să îl reporniți. <br> 2. Tastați numele de utilizator iLO și parola și faceți clic <strong> Autentificare </strong> . </p> <p><img src=\"images/image_thumb-8-790.png\" alt=\"restart hp proliant server from ilo\" loading=\"lazy\"></p> <p> </p> <p> 3. Alegeți <strong> Putere și termică </strong> pe stanga. <br> 4. În secțiunea Virtual Power Button, faceți clic pe <strong> Resetați </strong> pentru a reporni serverul HP. * </p> <p> * Informații: </p> <ul> <li> Virtualul <strong> Resetați </strong> butonul are aceeași funcție ca și butonul <strong> Repornire </strong> comandă în sistemul de operare (pornire caldă). </li> <li> Virtualul <strong> Cizmă rece </strong> butonul are aceeași acțiune ca și butonul <strong> Închide </strong> comandă în sistemul de operare. Dacă apăsați butonul „Pornire la rece”, serverul se va opri și va reporni după aproximativ 8 secunde. </li> </ul> <p> <img src=\"images/image_thumb-9-784.png\" alt=\"How to Reboot an HP Server using iLO 5 web interface.\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}