{"title":"Cum se controlează mouse-ul cu tastatura în Windows 10/8/7.","content":"<p> Acest tutorial conține instrucțiuni despre cum să controlați mouse-ul folosind tastatura, utilizând funcția „Taste mouse” din Windows. Articolul poate fi util pentru persoanele care nu pot acționa mouse-ul sau în cazurile în care mouse-ul încetează să funcționeze (sau nu există) și doriți să utilizați tastatura ca mouse.pentru a lucra cu computerul dvs. pentru a termina o lucrare urgentă. </p> <p> <strong> Taste mouse </strong> caracteristica este integrată în sistemele de operare Windows 10, 7 sau 7 și vă permite să utilizați tastatura numerică pentru a muta indicatorul mouse-ului pe ecran și pentru a efectua toate acțiunile obișnuite ale mouse-ului (faceți clic, faceți dublu clic, faceți clic dreapta). </p> <h4> Cum să utilizați tastatura ca mouse. </h4> <h6> Metoda 1. Activați tastele mouse-ului utilizând Comanda rapidă de la tastatură. * </h6> <p> Prima metodă de a muta cursorul mouse-ului [fără mouse <img src=\"images/wlemoticon-openmouthedsmile-273.png\" alt=\"Open-mouthed smile\" loading=\"lazy\"> ], este să activați tastele mouse-ului, utilizând următorul mod: </p> <p> 1. Apăsați <strong> stânga ALT </strong> + <strong> stânga SHIFT </strong> + <strong> Blocarea numerelor </strong></p> <p><img src=\"images/image_thumb-10-220.png\" alt=\"How to Control Mouse with Keyboard \" loading=\"lazy\"></p> <p> </p> <p> 2. Când pe ecran apare fereastra Taste mouse, apăsați <strong> INTRODUCE </strong> pentru a activa MouseKeys. </p> <p><img src=\"images/image_thumb-2-595.png\" alt=\"turn on mouse keys\" loading=\"lazy\"></p> <p> 3. După activarea tastelor mouse-ului, puteți utiliza tastatura (tastatura numerică) pentru a efectua toate acțiunile mouse-ului (mutați, faceți clic, faceți clic dreapta, faceți dublu clic) așa cum se arată în figura de mai jos. * </p> <p> * Notă: Dacă doriți să măriți sau să micșorați viteza indicatorului, citiți instrucțiunile din metoda următoare. </p> <p><strong> Funcțiile mouse-ului de la tastatura numerică </strong></p> <p><img src=\"images/image_thumb-8-332.png\" alt=\"mouse functions numeric keypas\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Metoda 2. Activați tastele mouse-ului din centrul de acces ușor. </h6> <p> A doua metodă pentru a putea controla indicatorul mouse-ului cu tastatura, este să porniți și să configurați caracteristica „Taste mouse” din centrul Ease Access. Pentru a face asta: </p> <p> 1. Navigați la Panoul de control Windows, setați „Vizualizare după” la <strong> Icoane mici </strong> și apoi deschideți fișierul <strong> Centru de acces ușor. </strong></p> <p><img src=\"images/image_thumb-3-309.png\" alt=\"use keyboard as mouse\" loading=\"lazy\"></p> <p> </p> <p> 2. Faceți clic pe <strong> Faceți mouse-ul mai ușor de utilizat. </strong></p> <p><img src=\"images/image_thumb-4-518.png\" alt=\"enable mouse keys - ease of access\" loading=\"lazy\"></p> <p> </p> <p> 3. Apoi faceți clic pe <strong> Configurați tastele mouse-ului </strong> . </p> <p><img src=\"images/image_thumb-9-206.png\" alt=\"Configure Pointer Speed \" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Acum, verificați <strong> Activați tastele mouse-ului </strong> caseta și faceți clic <strong> Aplica. </strong><br> <strong> 5. </strong> Acum încercați să mutați cursorul mouse-ului folosind tastatura numerică și configurați <strong> Viteza indicatorului </strong> cum doriți. (Faceți clic pe „Aplicați” la fiecare modificare și pe „OK” pentru a închide opțiunile „Taste mouse”.) </p> <p><img src=\"images/image_thumb-7-340.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}