{"title":"Cum să verificați actualizările în Office 2019, 2016 sau 2013 în Windows 10.","content":"<p> În acest tutorial veți afla cum să verificați manual actualizările în Office 2019, 2016 și Office 2013. În toate versiunile Office, există două moduri de a instala actualizările Office disponibile: automat și manual. </p> <h4> Cum se actualizează manual Office 209/2016/2013/2010. </h4> <h6> Metoda 1. Cum să verificați manual actualizările Office în Office 2019, 2016 și Office 2013. </h6> <p> Pentru a verifica și instala manual actualizările Office disponibile, în toate versiunile Office: </p> <p> 1. Deschideți orice program Office (de exemplu, Word). <br> 2. Din <strong> Fişier </strong> meniu, alegeți <strong> Cont </strong> . * </p> <p> * Notă: în Office 2010 alegeți <strong> Ajutor. </strong></p> <p> 3. Extindeți <strong> Actualizați opțiunile </strong> și faceți clic pe <strong> Actualizează acum </strong> . * </p> <p> * Notă: Dacă „Opțiuni de actualizare” nu sunt disponibile, urmați instrucțiunile de la Metoda-2 de mai jos. </p> <p><img src=\"images/image_thumb-19-478.png\" alt=\"How to Check for Updates in Office 2019, 2016 or 2013 in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Metoda 2. Cum se instalează automat actualizările Office pentru Office 2019, 2016 și Office 2013. </h6> <p> Dacă doriți ca Windows să descarce și să instaleze automat actualizările Office disponibile, navigați la setările de actualizare Windows și verificați următoarea setare: </p> <ul> <li> Primiți actualizări pentru alte produse Microsoft atunci când actualizați Windows (Windows 10) </li> <li> Oferiți-mi actualizări pentru alte produse Microsoft când actualizez Windows (Windows 7) </li> </ul> <h5> Pentru a instala automat actualizările Office în Windows 10. </h5> <p><strong> 1. </strong> Mergi la <strong> Setări </strong> -&gt; <strong> Actualizare și securitate -&gt; Opțiuni avansate. </strong></p> <p><img src=\"images/image_thumb-20-149.png\" alt=\"Change Update Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> La opțiunile Actualizare, trageți glisorul „Primiți actualizări pentru alte produse Microsoft când actualizați Windows” în <strong> PE. </strong></p> <p><img src=\"images/image_thumb-21-717.png\" alt=\"automatically install office updates windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Navigați la ecranul anterior și faceți clic pe <strong> Verifică pentru actualizări </strong> butonul din care doriți să instalați imediat actualizările Office disponibile. </p> <p> </p> <h5> Pentru a instala automat actualizările Office în Windows 7. </h5> <p> 1. Navigați la <strong> Panou de control </strong> -&gt; <strong> Windows Update </strong> și faceți clic pe <strong> Schimbă setările </strong> . </p> <p><img src=\"images/image_thumb-22-108.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Selectați <strong> Oferiți-mi actualizări pentru alte produse Microsoft când actualizez Windows </strong> bifați și faceți clic pe <strong> aplica </strong> . </p> <p> 3. Faceți clic pe <strong> Verifică pentru actualizări </strong> pentru a instala toate actualizările disponibile. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a ajuta la răspândirea cuvântului despre acest ghid. </p> <p> </p>"}