{"title":"Cum să partajați fișiere și foldere în sistemul de operare Windows 10, 8.1 sau 7.","content":"<p> Funcția Partajare fișiere din Windows vă oferă posibilitatea de a partaja ușor dosare și fișiere între utilizatorii din rețeaua dvs. Partajând fișierele cu alți utilizatori din aceeași rețea, veți putea vizualiza și lucra cu aceleași fișiere / foldere. </p> <p> Acest tutorial conține instrucțiuni despre cum să partajați foldere și / sau fișiere în sistemele de operare Windows 10, 8, 8.1 sau 7. </p> <h4> Cum se activează partajarea fișierelor în Windows. </h4> <h5> Pasul 1. Adăugați utilizatorii necesari pe computer. </h5> <p> Înainte de a continua să partajați fișierele altora, adăugați utilizatorii care vor avea acces la folderul partajat de pe computer. Pentru a efectua această sarcină, urmați instrucțiunile de pe următoarele articole, în funcție de versiunea dvs. Windows. </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-create-a-new-user-in-windows-7\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se adaugă un utilizator nou în Windows 7. </a></li> <li><a href=\"https://www.repairwin.com/how-to-add-a-new-user-account-in-windows-10-8/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se adaugă un utilizator nou în Windows 10 / 8.1 </a></li> </ul> <p> </p> <h5> Pasul 2. Cum să partajați un folder sau un fișier cu alții. </h5> <p> 1. Faceți clic dreapta pe folderul (sau fișierul) pe care doriți să îl partajați și selectați <strong> Acordați acces la </strong> -&gt; <strong> Anumite persoane. </strong></p> <p><img src=\"images/image_thumb-56-411.png\" alt=\"How to Share Files and Folders in Windows 10, 8.1, 7\" loading=\"lazy\"></p> <p> </p> <p> 2. Folosind meniul derulant, selectați utilizatorul cu care doriți să partajați fișierele și apoi faceți clic <strong> Adăuga </strong> . </p> <p><img src=\"images/image_thumb-57-274.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Acum faceți clic pe săgeata în jos, lângă utilizatorul pe care l-ați adăugat și specificați permisiunile sale de acces (Nivel de permisiune) </p> <p><img src=\"images/image_thumb-58-517.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Când ați terminat, apăsați tasta <strong> Acțiune </strong> buton, </p> <p><img src=\"images/image_thumb-59-431.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Notați linkul dat către folderul partajat * și faceți clic <strong> Terminat </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-60-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. În acest moment, ați activat partajarea de fișiere pe computer. Pentru a accesa folderul partajat de pe alt computer: </p> <blockquote><p> A. În bara de adrese a Exploratorului, tastați linkul către folderul partajat, așa cum se arată la pasul anterior. (de exemplu, &quot;\\\\ DESKTOP-HMG31RD \\ 2Share&quot; fără ghilimele) <br> b. presa <strong> introduce </strong> . <br> c. Tastați numele de utilizator și parola utilizatorului căruia i-ați dat acces și apăsați <strong> O.K </strong> . </p></blockquote> <p><img src=\"images/image_thumb-61-512.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Informații suplimentare: <br> 1. Pentru a modifica permisiunile utilizatorului, urmați din nou procedura de mai sus și modificați Nivelul de permisiune al utilizatorului. <br> 2. Dacă doriți să opriți partajarea fișierelor, faceți clic dreapta pe folderul / fișierul partajat și accesați <strong> Acordați acces la </strong> -&gt; și selectați <strong> Eliminați accesul </strong> . </p> <p><img src=\"images/image_thumb-62-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această problemă. </p>"}