{"title":"Cum puteți actualiza Windows 7 la Windows 10 gratuit. (Noiembrie 2020)","content":"<p> Deși Microsoft a încheiat oferta de actualizare gratuită a PC-ului Windows 7 la Windows 10 acum câțiva ani, puteți actualiza computerul Windows 7, 8 sau 8.1 la Windows 10 gratuit, chiar și în noiembrie 2020! Deci, dacă dețineți un computer Windows 7 sau Windows 8 / 8.1, îl puteți actualiza la Windows 10, folosind instrucțiunile de mai jos. * </p> <p> * Notă: După instalare, Windows 10 va fi activat automat cu o licență digitală. </p> <p><img src=\"images/image_thumb-47-781.png\" alt=\"How to Still Upgrade Windows 7 to Windows 10 for Free\" loading=\"lazy\"></p> <h4></h4> <h4> Cum se actualizează gratuit la Windows 10. </h4> <p> Pentru a actualiza gratuit computerul Windows 7, 8 sau 8.1 la Windows 10 aveți următoarele opțiuni: </p> <ul></ul> <h6><strong> Opțiunea 1 </strong> . Curăță Instalați Windows 10 de pe USB. </h6> <p><strong> Cerințe: </strong> O cheie de produs Windows 7 autentică sau Windows 8 / 8.1 instalat și activat. în caz că nu aveți o cheie Windows 7 <strong> sari la </strong><a href=\"#option-2\" target=\"_blank\" rel=\"nofollow noopener\"><strong> opțiunea-2 </strong></a><strong> . </strong></p> <p> Dacă dețineți o cheie de produs autentică Windows 7 sau dețineți o versiune activată de Windows 8 / 8.1 pe computerul dvs., puteți efectua o <strong> instalarea curată a Windows 10 de pe un USB </strong> media, utilizând instrucțiunile din acest tutorial: <a title=\"https://www.repairwin.com/clean-install-windows-10\" href=\"https://www.repairwin.com/clean-install-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se curăță instalarea Windows 10. </a> * </p> <p><strong> Note: </strong><br> 1. „Instalare curată” înseamnă o nouă instalare a sistemului de operare după <strong> ștergând totul de pe disc </strong> . Deci, faceți backup fișierelor pe un dispozitiv de stocare extern înainte de a continua. </p> <p> 2. Pentru a găsi cheia de produs Windows 7, căutați un autocolant (ca cel de mai jos) pe carcasa computerului dvs. sau dacă ați cumpărat o copie fizică a Windows (de exemplu, pe un DVD), cheia de produs ar trebui să fie pe o etichetă sau card în cutia în care a intrat Windows. </p> <p> Cheia produsului este de obicei un autocolant cu un număr de 25 de cifre tastat pe acesta și arată astfel: XXXXX- XXXXX- XXXXX- XXXXX- XXXXX. </p> <p><img src=\"images/image_thumb-34-760.png\" alt=\"Windows 7 Product key\" loading=\"lazy\"></p> <p> </p> <p> 3. Pentru a vă asigura că copia dvs. din Windows este deja activată: </p> <blockquote><p> 1. <strong> Click dreapta </strong> pe <strong> Calculator </strong> pictogramă în Explorer și faceți clic pe <strong> Proprietăți </strong> . <br> 2. La Starea activării, asigurați-vă că <strong> Windows este activat </strong> . </p></blockquote> <blockquote> <p><img src=\"images/image_thumb-35-328.png\" alt=\"Windows Activation Status\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> </p> <p> </p> <h6> Opțiunea 2. Actualizați la Windows 10 utilizând „Fișierul WINDOWS.ISO sau„ Windows 10 Upgrade Assistant ”. </h6> <p><strong> Cerințe: </strong> O versiune activată a Windows 7, 8 sau 8.1. * </p> <p> Dacă nu găsiți cheia de produs Windows 7, dar aveți o versiune autentică și activată de Windows 7, 8 sau 8.1, puteți să vă actualizați computerul în Windows 10 urmând pașii de mai jos: </p> <h2> Pasul 1. Asigurați-vă că Windows este activat. </h2> <p> Urmați instrucțiunile de la <a href=\"#note-3\" target=\"_blank\" rel=\"nofollow noopener\"> nota 3 </a> de mai sus pentru a vă asigura că copia Windows este deja activată. </p> <h5> Pasul 2. Asigurați-vă că Windows este actualizat. </h5> <p> Pentru a vă asigura că sistemul dvs. este actualizat: </p> <p> 1. Navigați la <strong> Windows Update </strong> centru. <br> 2. Faceți clic pe <strong> Verifică pentru actualizări. <br> </strong> 3. <strong> Instalare </strong> toate <strong> actualizări importante </strong> și <strong> repornire </strong> computerul. </p> <p><img src=\"images/image_thumb-29-864.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h5> Pasul 3. Copia de siguranță a fișierelor personale. </h5> <p> Continuați și <strong> de rezervă </strong> toate <strong> fișiere personale pe un dispozitiv de stocare extern </strong> (de ex. un disc USB). </p> <h5> Pasul 4. Dezinstalați software-ul de securitate sau antivirus terță parte. </h5> <h5> Pasul 5. Deconectați dispozitivele externe. </h5> <p> Deconectați orice dispozitiv extern care nu este necesar în timpul instalării (de exemplu, dispozitive de stocare USB, imprimante etc.). </p> <h5> Pasul 6. Descărcați instrumentul Windows 10 Media Creation Tool. </h5> <p> 1. Navigați la <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Site de descărcare Windows 10 </a> și faceți clic pe <strong> Descărcați instrumentul acum </strong> buton. <br> 2. Salvați fișierul „MediaCreationTool.exe” pe desktop. </p> <p><img src=\"images/image_thumb-36-862.png\" alt=\"Media Creation Tool - Download\" loading=\"lazy\"></p> <h4> Pasul 7. Actualizați la Windows 10. </h4> <p> După ce ați efectuat toți pașii de mai sus, sunteți gata să vă actualizați computerul la Windows 10 urmând instrucțiunile uneia dintre metodele de mai jos: </p> <ol> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Actualizați-vă sistemul la Windows 10 și păstrați-vă fișierele și aplicațiile personale (Metoda 1). </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Actualizați-vă sistemul la Windows 10 și păstrați doar fișierele personale (Metoda 2). </a></li> <li><a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"> Actualizați-vă sistemul la Windows 10 și ștergeți toate fișierele și aplicațiile. (Metoda 3). </a></li> </ol> <p> </p> <h6> Metoda 1. Treceți la Windows 10 și păstrați fișiere și aplicații personale. </h6> <p> Folosind această metodă, veți putea să vă actualizați computerul Windows 10 cu toate fișierele și aplicațiile intacte după actualizare, dar rețineți că este posibil ca unele aplicații să fie nevoie să fie actualizate. * </p> <p> * Notă: Din motive de precauție, asigurați-vă că aveți o copie de rezervă a tuturor fișierelor personale pe un alt suport de stocare. </p> <p> 1. Faceți dublu clic pe „MediaCreationTool.exe” pe care l-ați descărcat la pasul 6 de mai sus. <br> 2. <strong> Accept </strong> termenii licenței. <br> 3. În ecranul următor, selectați <strong> Actualizați acest computer acum </strong> . </p> <p><img src=\"images/image_thumb-37-894.png\" alt=\"Upgrade Windows 7 to Windows 10\" loading=\"lazy\"></p> <h6></h6> <p> 4. În ecranul următor, asigurați-vă că opțiunea pentru <strong> Păstrați fișierele și aplicațiile personale </strong> este <strong> verificat </strong> și faceți clic pe <strong> Instalare </strong> . </p> <p><img src=\"images/image_thumb-38-471.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Așteptați instalarea Windows 10 pentru a finaliza. Procesul de actualizare va dura o oră sau mai puțin, în conformitate cu specificațiile sistemului. <br> 6. Când instalarea este finalizată, accesați <strong> Setări </strong> &gt; <strong> Actualizare și securitate </strong> &gt; <strong> Activare </strong> pentru a afla că Windows 10 este deja activat cu o licență digitală. </p> <p><img src=\"images/image_thumb-48-486.png\" alt=\"image\" loading=\"lazy\"></p> <h6> Metoda 2. Actualizați Windows 10 din fișierul ISO și păstrați numai fișierele personale. </h6> <p> Folosind această metodă, veți putea actualiza computerul Windows 10 cu toate fișierele intacte după instalare, dar toate aplicațiile trebuie să fie reinstalate după actualizarea la Windows 10. </p> <p> * Notă: Din motive de precauție, asigurați-vă că aveți o copie de rezervă a tuturor fișierelor personale pe un alt suport de stocare. </p> <p> 1. Faceți dublu clic pe „MediaCreationTool.exe” pe care l-ați descărcat la pasul 6 de mai sus. <br> 2. <strong> Accept </strong> termenii licenței. <br> 3. În ecranul următor, alegeți <strong> Creați suporturi de instalare (USB, DVD sau fișier ISO) pentru alt computer </strong> și faceți clic pe <strong> Următorul. </strong></p> <p><img src=\"images/image_thumb-39-438.png\" alt=\"Create Windows 10 USB Installation Media\" loading=\"lazy\"></p> <p> </p> <p> 4. În ecranul „Selectare limbă, arhitectură și ediție”, examinați setările implicite sau <strong> debifează </strong> caseta de selectare „Utilizați opțiunile recomandate pentru acest computer”, pentru a face propriile alegeri, și faceți clic pe <strong> Următorul. </strong></p> <p><img src=\"images/image_thumb-40-711.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. La opțiunile „Alegeți tipul media”, alegeți <strong> Fișier ISO </strong> și faceți clic pe <strong> Următorul. </strong></p> <p><img src=\"images/image_thumb-41-252.png\" alt=\"Download Windows 10 ISO\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Salvați </strong> <strong> Windows.iso </strong> fișier pe <strong> desktop. </strong></p> <p><img src=\"images/image_thumb-42-193.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Când descărcarea este finalizată, <strong> Click dreapta </strong> pe fișierul „Windows.iso” pentru a-l monta (deschide) în Explorer. * </p> <p> * Notă: Pentru a monta fișierul ISO, aveți nevoie de un program care poate citi / deschide fișiere ISO. Dacă nu aveți un astfel de program, continuați să descărcați și să instalați <a href=\"https://www.elby.ch/products/vcd.html\" target=\"_blank\" rel=\"nofollow noopener\"> Unitate de clonare virtuală </a> . </p> <p><img src=\"images/image_thumb-43-527.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Explorează conținutul fișierului ISO în Explorer și <strong> dublu click </strong> la <strong> setup.exe </strong> cerere. </p> <p><img src=\"images/image_thumb-44-132.png\" alt=\"Upgrade to Windows 10 from ISO file\" loading=\"lazy\"></p> <p> </p> <p> 9. Faceți clic pe <strong> Următorul </strong> la primul ecran și apoi <strong> Accept </strong> termenii licenței. <br> 10. În ecranul următor, <strong> Selectați </strong> la <strong> Păstrează doar fișierele personale </strong> și faceți clic pe <strong> Următorul. </strong></p> <p><img src=\"images/image_thumb-45-982.png\" alt=\"Udate Windows 7 to Windows 10 from ISO file\" loading=\"lazy\"></p> <p> </p> <p> 7. Așteptați instalarea Windows 10 pentru a finaliza. Procesul de actualizare va dura o oră sau mai puțin, în conformitate cu specificațiile sistemului. <br> 8. Când instalarea este finalizată, accesați <strong> Setări </strong> &gt; <strong> Actualizare și securitate </strong> &gt; <strong> Activare </strong> pentru a afla că Windows 10 este deja activat cu o licență digitală. </p> <p> </p> <h6> Metoda 3. Instalați Windows 10 din fișierul ISO. * </h6> <p> Folosind această metodă, veți putea curăța instalarea Windows 10 pe computer, dar <strong> toate fișierele și setările vor fi șterse în timpul instalării </strong> . Deci, asigurați-vă că aveți o copie de rezervă recentă a fișierelor personale pe un dispozitiv de stocare extern. (de ex. un disc USB). </p> <p> 1. Urmați pașii 1-9 din <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> metoda-2 </a> de mai sus. <br> 2. La opțiunile „Alegeți ce să păstrați”, selectați <strong> Nimic </strong> și faceți clic pe <strong> Următorul. * </strong></p> <p><strong> * Prudență: </strong> Efectuând o instalare Windows 10 curată, veți șterge toate fișierele și setările. Deci, continuați și faceți o copie de rezervă a fișierelor dvs. personale pe un dispozitiv de stocare extern înainte de a continua. </p> <p><img src=\"images/image_thumb-46-312.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Așteptați instalarea Windows 10 pentru a finaliza. Procesul de actualizare va dura o oră sau mai puțin, în conformitate cu specificațiile sistemului. <br> 4. Când instalarea este finalizată, accesați <strong> Setări </strong> &gt; <strong> Actualizare și securitate </strong> &gt; <strong> Activare </strong> pentru a afla că Windows 10 este deja activat cu o licență digitală. <br> 5. În cele din urmă, restaurați fișierele din copie de rezervă, instalați aplicațiile de care aveți nevoie și bucurați-vă de actualizarea gratuită la Windows 10. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/11/image-28.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p>"}