{"title":"Cum se elimină protecția BitLocker de pe unitatea de sistem C: Fără cheia de recuperare BitLocker sau parola.","content":"<p> Acest articol conține instrucțiuni pas cu pas despre cum să eliminați BitLocker Protection pe unitatea de sistem C: pentru a putea curăța instalarea Windows 10 pe un computer protejat BitLocker, dacă nu aveți cheia de recuperare BitLocker sau parola BitLocker dacă nu puteți debloca unitatea BitLocker din orice motiv. </p> <p><img src=\"images/image_thumb-51-648.png\" alt=\"Fix Refresh your PC error: Drive where windows is installed is locked\" loading=\"lazy\"></p> <p> </p> <p> Când un dispozitiv Windows 10 (laptop sau PC) este protejat cu BitLocker, atunci singurul mod de a accesa conținutul acestuia sau de a reseta dispozitivul (utilizând funcțiile „Reset This PC”, „Refresh your PC”) sau de a reinstala Windows, este de a debloca unitatea C a sistemului de operare: utilizând cheia de recuperare BitLocker sau parola BitLocker. </p> <p> Dacă nu aveți cheia de recuperare BitLocker sau parola BitLocker pentru a debloca unitatea de sistem C: sau cheia BitLocker nu este acceptată, atunci singura opțiune pe care ați lăsat-o (din păcate) este să ștergeți complet unitatea și curățați instalarea Windows. </p> <p> În acest tutorial veți găsi instrucțiuni despre cum să rezolvați următoarea problemă atunci când încercați să instalați Windows 10 sau să resetați un dispozitiv Windows 10 în starea implicită din fabrică: „Unitatea în care este instalat Windows este blocată. Deblocați unitatea și încercați din nou. &quot;. </p> <h4> Cum se curăță instalarea Windows 10 pe un computer protejat BitLocker (FIX: Nu se poate instala / reîmprospăta Windows 10 - Unitatea este blocată cu BitLocker.) </h4> <p><strong> Cerinţă: </strong> <strong> Un suport de instalare Windows 10 (USB sau DVD). </strong><br> Dacă nu dețineți un suport de instalare Windows, puteți crea unul utilizând <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Instrumentul de creare media Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se creează un suport de instalare USB Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se creează un suport de instalare DVD Windows 10. </a></li> </ul> <p> Pentru a efectua o instalare curată a Windows 10, pe un computer / unitate protejată BitLocker, urmați instrucțiunile de mai jos: * </p> <p><strong> * ATENȚIE: PROCEDURA DE MAI JOS VĂ ȘTERGE TOATE DATELE STOCATE PE DISCUȚIA BLOCATĂ. PROCEDAȚI DOAR DACĂ VOI <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> NU SE POATE DEBLOCA DRIVERUL / COMPUTERUL PROTECTAT BITLOCKER. </a></strong></p> <p> 1. Porniți sistemul de pe suportul de instalare Windows 10. * </p> <p> * Notă: <strong> </strong> Pentru a putea porni de pe Windows Media (USB sau DVD) urmați pașii de mai jos: </p> <ul> <li><strong> Metoda 1: </strong> După pornire, apăsați tasta funcțională corespunzătoare (de obicei este tasta „F12” sau „F8”) pentru a vizualiza opțiunile „Boot Order” sau „Boot Menu”. Apoi selectați dispozitivul USB (sau DVD) care conține instalarea Windows Media (fișiere) și apăsați Enter. </li> <li><strong> Metoda 2: </strong> Introduceți BIOS Setup (Setări) și setați Windows Installation Media ca „Primul dispozitiv de încărcare” în meniul „Boot Order”. Atunci <strong> Salvează și ieși </strong> din setările BIOS-ului. </li> </ul> <p> 2. În ecranul de mai jos apăsați pe <strong> SCHIMB </strong> + <strong> F10 </strong> tastele pentru a lansa promptul de comandă. (sau apăsați <strong> Următorul </strong> &gt; <strong> Reparați computerul </strong> &gt; <strong> Depanare </strong> &gt; <strong> Prompt de comandă </strong> ). * </p> <p> * Notă: dacă ați solicitat cheia de recuperare, faceți clic pe <strong> SALTAȚI această unitate </strong> . </p> <p><img src=\"images/image_thumb15_thumb-290.png\" alt=\"How to Remove Updates from the Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. În promptul de comandă, dați următoarele comenzi în ordine: </p> <ul> <li><strong> discpart </strong></li> <li><strong> listă disc </strong></li> <li><strong> selectați discul 0 </strong></li> <li><strong> volumul listei </strong></li> </ul> <p> 4. Acum găsiți care dintre volumele listate are dimensiunea mai mare în GB. În mod obișnuit, volumul mai mare este locul în care s-a instalat Windows (unitatea blocată). * </p> <p> * de exemplu. În imaginea de mai jos, „Volumul 2” are dimensiunea mai mare. </p> <p> </p> <p><img src=\"images/image_thumb-10-992.png\" alt=\"fix drive is locked Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Apoi selectați volumul mai mare tastând această comandă: * </p> <ul> <li><strong> selectați numărul volumului </strong></li> </ul> <p> * Notă: modificați numărul volumului la comanda de mai sus în funcție de cazul dvs. (de exemplu, „selectați volumul 2”) </p> <p> 5. Ștergeți în final volumul selectat dând această comandă: </p> <p> </p> <ul> <li><strong> ștergeți suprascrierea volumului </strong></li> </ul> <p><img src=\"images/image_thumb-14-714.png\" alt=\"delete volume override\" loading=\"lazy\"></p> <p> </p> <p> 6. Tastați <strong> Ieșire </strong> pentru a închide instrumentul DISKPART și apoi pentru a închide linia de comandă. <br> 7. Opriți și apoi Porniți din nou dispozitivul. <br> 8. Porniți de pe suportul de instalare Windows. <br> 9. Faceți clic pe <strong> Următorul </strong> și apoi <strong> Instaleaza acum </strong> . <br> 10. Alegeți „Nu am o cheie de produs” și apoi acceptați acordul de licență. <br> 11. Selectați „Instalare personalizată” și apoi ștergeți toate resturile partiții / volume de pe disc. </p> <p><img src=\"images/image_thumb-12-362.png\" alt=\"cannot reset windows 10 drive locked with bitlocker\" loading=\"lazy\"></p> <p> </p> <p> 12. Când ați terminat, alegeți „Spațiul nealocat” și faceți clic pe <strong> Următorul. <br> </strong> 13. Urmați instrucțiunile de pe ecran pentru a <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> instalați curat Windows 10 </a> . </p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această problemă. </p>"}