{"title":"CUM: Ștergeți Istoricul Internetului, parolele și modulele cookie din browserul dvs. web (Chrome, Firefox, IE)","content":"<p> Când vizitați un site web cu browserul dvs. web, site-ul web trimite câteva informații browserului și acesta stochează aceste informații în fișiere text mici numite <strong> fursec </strong> s. Cookie-urile stochează preferințele utilizatorului față de acel site web, de ex. informațiile de conectare, astfel încât utilizatorul nu trebuie să reintroducă detaliile de conectare (nume de utilizator și / sau parolă) atunci când revine pe același site web. Cookie-urile pot păstra, de asemenea, un istoric al paginilor site-ului web pe care le-a vizitat utilizatorul, astfel încât utilizatorul nu trebuie să-și amintească de ele sau să navigheze prin toate paginile site-ului web, până când nu găsește ceea ce dorește. </p> <p> În același timp, când vizitați un site web, browserul stochează o copie locală a tuturor paginilor web pe care le-ați vizitat, pentru a salva lățimea de bandă a conexiunii și a reduce timpul de încărcare a paginilor web, data viitoare când le vizitați. Această „copie locală a paginilor web” este cunoscută sub numele de „ <strong> Fișiere temporare de internet </strong> &quot; de <strong> Cache </strong> . </p> <p> Cookie-urile și cache-ul, după un timp, pot deține o cantitate semnificativă de spațiu pe disc și este necesar să le ștergeți. În alte cazuri, poate fi necesar să ștergeți cache-ul browserului și cookie-urile pentru a reîncărca complet conținutul site-ului web sau din motive de securitate și confidențialitate: de ex. dacă nu doriți, o a treia persoană să afle ce pagini web ați vizitat (aka: &quot; <strong> Istoricul de navigare </strong> &quot;) sau care sunt datele dvs. de conectare la un site web (de exemplu, GMAIL). </p> <p> În acest tutorial veți găsi două (2) modalități ușoare de a șterge Istoricul navigării, fișiere temporare de internet (cache) și cookie-uri din Internet Explorer, Chrome și Firefox. </p> <h4> Cum să ștergeți istoricul navigării web, parolele salvate și modulele cookie în Chrome, Firefox și Internet Explorer. </h4> <h5><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda 1. Ștergeți datele de navigare dintr-un browser specific. </a></h5> <h5><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda 2. Ștergeți datele de navigare din toate browserele Web cu un singur clic! </a></h5> <p> </p> <h5> Metoda 1. Ștergeți Istoricul, memoria cache și modulele cookie dintr-un browser specific. </h5> <p> În general, fiecare browser web are opțiuni pentru a elimina datele de navigare stocate prin meniul Setări / Opțiuni, dar dacă doriți să accesați cu ușurință acele opțiuni (fără a fi nevoie să navigați cu mouse-ul prin meniul browserului), apăsați <strong> Ctrl </strong> + <strong> Schimb </strong> + <strong> Șterge </strong> tastele împreună pe fereastra deschisă a browserului. Asa de… </p> <p><strong> Pentru a șterge istoricul de navigare, memoria cache și cookie-urile din Internet Explorer: </strong></p> <p> 1. Deschideți Internet Explorer și apăsați <strong> Ctrl </strong> + <strong> Schimb </strong> + <strong> Șterge. <br> </strong> 2. Selectați ce tip de informații doriți să ștergeți și faceți clic pe <strong> Șterge </strong> buton. </p> <p><img src=\"images/image_thumb-18-750.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> Pentru a șterge istoricul de navigare, memoria cache și cookie-urile din Chrome: </strong></p> <p> 1. Lansați Chrome și apăsați <strong> Ctrl </strong> + <strong> Schimb </strong> + <strong> Șterge. <br> </strong> 2. Alegeți ce tip de informații doriți să fie șterse și apoi apăsați <strong> DATE CLARE </strong> . </p> <p><img src=\"images/image_thumb-19-667.png\" alt=\"clear chrome history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p><strong> Pentru a șterge istoricul de navigare, memoria cache și cookie-urile din Firefox: </strong></p> <p> 1. Deschideți Firefox și apăsați simultan <strong> Ctrl </strong> + <strong> Schimb </strong> + <strong> Șterge. <br> </strong> 2. Selectați datele pe care doriți să le eliminați din Firefox și faceți clic <strong> Curăță acum. </strong></p> <p> </p> <p><img src=\"images/image_thumb-20-864.png\" alt=\"clear firefox history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> Metoda 2. Ștergeți istoricul browserului, memoria cache și cookie-urile de pe toate browserele web simultan. </h5> <p> Dacă doriți să vă ușurați viața, puteți folosi <a href=\"https://www.ccleaner.com/\" target=\"_blank\" rel=\"nofollow noopener\"> CCleaner </a> utilitar pentru a șterge cu ușurință fișierele Internet temporare, istoricul și modulele cookie de pe toate browserele web pe care le utilizați, cu un singur clic. </p> <p> 1. <a href=\"https://www.ccleaner.com/ccleaner/download\" target=\"_blank\" rel=\"nofollow noopener\"> Descarca </a> și instalați versiunea gratuită a utilitarului CCleaner. </p> <p> 2. Lansați <strong> CCleaner </strong> și navigați la <strong> Windows </strong> si <strong> Aplicații </strong> opțiuni filă, pentru a selecta informațiile pe care doriți să le ștergeți din browserele web. </p> <p> 3. Când ați terminat, faceți clic <strong> Rulați Cleaner </strong> . </p> <p><img src=\"images/image_thumb-21-173.png\" alt=\"clear internet history cache cookies - ccleaner\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Asta e tot! A funcționat pentru tine? </p> <p> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}