{"title":"Cum să preveniți Windows 10 pentru a instala automat imprimante de rețea.","content":"<p> După cum probabil ați observat deja, Windows 10 instalează automat driverele pentru orice imprimantă conectată la rețea sau alt dispozitiv. Dar, deși aceasta este o caracteristică foarte utilă, este foarte enervantă, în special în mediile de afaceri, unde este posibil să nu doriți ca toate imprimantele să fie utilizate de toți utilizatorii de rețea. </p> <p> Desigur, dacă nu doriți un dispozitiv de rețea și aplicațiile producătorului său, îl puteți elimina din sistem. Dar, Windows 10 îl va instala automat din nou. Pentru a evita acest lucru, trebuie să împiedicați Windows să instaleze automat dispozitivele conectate la rețea (imprimante, scanere, camere, etc.), precum și aplicațiile și pictogramele vamale ale acestora de la producător. </p> <h3> Cum să OPRIȚI Windows 10 pentru a instala automat dispozitive și aplicații de rețea. </h3> <p> 1. Navigați la <strong> Panou de control </strong> . Pentru a face asta: </p> <blockquote><p> A. Tastați „panoul de control” în caseta de căutare Windows <br> b. Clic <strong> Panou de control </strong> din rezultate. </p></blockquote> <p><img src=\"images/image_thumb-53-862.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Setați <strong> Vazut de </strong> la <strong> Icoane mici </strong> pentru a vizualiza toate elementele panoului de control, apoi faceți clic pe <strong> Centrul de rețea și partajare. </strong></p> <p><img src=\"images/image_thumb-37-625.png\" alt=\"control panel network and sharing center\" loading=\"lazy\"></p> <p> </p> <p> 3. Alegeți <strong> Setări avansate de partajare </strong> pe stanga <strong> . </strong></p> <p><img src=\"images/image_thumb-38-656.png\" alt=\"Prevent Windows 10 to Install Network Printers Automatically\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Ștergeți „ <strong> Activați configurarea automată a dispozitivelor conectate la rețea &quot; </strong> și faceți clic pe <strong> Salvează modificările. </strong></p> <p><img src=\"images/image_thumb-39-992.png\" alt=\"Turn Off automatic setup of network connected devices \" loading=\"lazy\"></p> <p> </p> <p><strong> Opțional: </strong> Dacă doriți să împiedicați Windows 10 să descarce și să instaleze automat aplicațiile producătorului și pictogramele personalizate, pentru orice dispozitiv conectat de pe computer, atunci: </p> <blockquote><p> 1. Navigați la <strong> Panou de control </strong> -&gt; <strong> Sistem </strong> . <br> 2. Faceți clic pe <strong> Protecția sistemului </strong> pe stanga. <br> 3. În fila Hardware, faceți clic pe <strong> Setări de instalare a dispozitivului </strong> . </p></blockquote> <p><img src=\"images/image_thumb-40-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. La „Setări de instalare a dispozitivului”, alegeți „ <strong> Nu (este posibil ca dispozitivul dvs. să nu funcționeze conform așteptărilor) &quot; </strong> și faceți clic pe <strong> Salvează modificările </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-728.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a ajuta la răspândirea cuvântului despre acest ghid. </p>"}