{"title":"Cum se adaugă un cont de utilizator nou în Windows 10/8 / 8.1","content":"<p> Una dintre capabilitățile Windows 10 este să adăugați un cont online Microsoft pe computer (sau dispozitiv) pentru a utiliza toate serviciile Microsoft (e-mail, aplicații moderne, jocuri Xbox, Skype, OneDrive etc.) cu un singur cont. În plus, dacă configurați un cont Microsoft în Windows 10, veți avea posibilitatea de a vă conecta de pe orice alt dispozitiv Windows 10 (conectat la Internet) și veți avea toate aplicațiile, setările și parolele sincronizate pe noul dispozitiv. </p> <p> Dacă nu sunteți interesat să utilizați magazinul Windows sau dacă nu doriți să utilizați avantajele oferite de utilizarea unui cont online Microsoft, atunci este mai bine să configurați un cont local în Windows 10. După părerea mea, un cont local este întotdeauna mai sigur decât un cont online Microsoft și funcționează întotdeauna, indiferent de conectivitatea la Internet. </p> <p> Acest tutorial prezintă arborele (3) diferite metode pentru a adăuga un cont de utilizator nou în Windows 10 și Windows 8.1 în cazul în care aveți nevoie de el. (de exemplu, dacă doriți să partajați computerul sau fișierele cu alte persoane). </p> <h2> Cum se creează un utilizator nou în Windows 10, 8.1. </h2> <p><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda 1. Creați un cont nou din opțiunile de setări. </a></p> <p><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda 2. Adăugați un cont nou utilizând utilitarul „Conturi utilizator” în Windows 10/8. </a></p> <p><a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda 3. Creați un utilizator nou folosind Command Prompt în Windows 10/8. </a></p> <p> </p> <h6> Metoda 1. Cum se creează un cont nou din setări în Windows 10. </h6> <p> 1. Conectați-vă la Windows cu un cont de administrator. </p> <p> 2. Deschideți <strong> Setări </strong> <img src=\"images/image_thumb-50-534.png\" alt=\"image\" loading=\"lazy\"> și apoi faceți clic pe <strong> Conturi </strong> . </p> <p><img src=\"images/image_thumb-43-324.png\" alt=\"How to Add a New User in Windows 10, 8.1.\" loading=\"lazy\"></p> <p> </p> <p> 3. Alegeți <strong> Familia și alți utilizatori </strong> în stânga și apoi faceți clic pe <strong> Adăugați pe altcineva pe acest computer. </strong></p> <p><img src=\"images/image_thumb-49-471.png\" alt=\"create new account windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. În ecranul următor: </p> <blockquote><p> A. dacă doriți să adăugați un nou cont Microsoft pe computer, tastați adresa de e-mail a persoanei noi și faceți clic pe <strong> Următorul </strong> . </p> <p> B. Dacă doriți să adăugați un nou cont local (ca în acest exemplu), faceți clic pe <strong> Nu am informațiile de conectare ale acestei persoane </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-665.png\" alt=\"add local account windows 10\" loading=\"lazy\"></p> <p> 5. Apoi faceți clic pe <strong> Adăugați un utilizator fără un cont Microsoft </strong> . </p> <p><img src=\"images/image_thumb-42-715.png\" alt=\"add a non Microsoft account windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. În ecranul următor tastați un nume de utilizator și o parolă pentru noul cont. Apoi alegeți și răspundeți la întrebările de securitate date * în cazul în care ați uitat parola și, după ce ați terminat, faceți clic <strong> Următorul </strong> . </p> <p> * Notă: Dacă nu vă place să răspundeți la toate aceste întrebări de securitate „stupide”, continuați să adăugați noul utilizator, utilizând metoda-1 sau metoda-2 de mai jos. </p> <p><img src=\"images/image_thumb-46-912.png\" alt=\"add new user account windows 10-8\" loading=\"lazy\"></p> <p> </p> <p> 7. În acest moment, ați încheiat cu crearea unui nou utilizator standard pe Windows 10. Dar, dacă doriți să acordați privilegii administrative noului utilizator: </p> <blockquote><p> A. Selectați utilizatorul și faceți clic <strong> Schimbați tipul de cont. </strong></p></blockquote> <p><img src=\"images/image_thumb-47-574.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. În ecranul următor, schimbați tipul de cont în „Administrator” și faceți clic pe <strong> O.K </strong> . </p></blockquote> <p><img src=\"images/image_thumb-48-850.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Metoda 2. Adăugați un cont nou utilizând utilitarul „Conturi utilizator” în Windows 10/8. </h6> <p> Una dintre metodele mele preferate de a adăuga (sau elimina) utilizatori (în toate versiunile de Windows) este folosirea utilitarului „Conturi utilizator”, care oferă toate opțiunile necesare pentru a gestiona cu ușurință conturile Windows. (Adăugați / eliminați utilizatori, specificați privilegii de utilizator sau pentru a schimba parola de utilizator). </p> <p> 1. Conectați-vă la Windows cu un cont de administrator. </p> <p> 2. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-578.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 3. În caseta „Deschidere”, tastați: <strong> controlați userpasswords2 </strong> &amp; faceți clic pe <strong> O.K </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-29-910.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. În fila Utilizatori, faceți clic pe <strong> Adăuga </strong> pentru a adăuga contul, pe care doriți să-l aveți acces la fișierele dvs. </p> <p><img src=\"images/image_thumb_thumb1_thumb-455.png\" alt=\"image_thumb_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> 5. Alegeți <strong> Conectați-vă fără un cont Microsoft </strong> pentru a crea un cont local, completați adresa de e-mail a utilizatorului dacă doriți să creați un cont Microsoft </p> <p><img src=\"images/image_thumb-51-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Apoi alegeți <strong> Cont local </strong> . </p> <p><img src=\"images/image_thumb-52-375.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Completați câmpurile obligatorii (nume de utilizator, parolă și indiciu pentru parolă) și faceți clic pe <strong> Următorul </strong> . </p> <p><img src=\"images/image_thumb-53-204.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. La ultimul ecran, faceți clic pe <strong> finalizarea </strong> . </p> <p> 9. În cele din urmă, dacă doriți să setați noul utilizator ca administrator pe computer: </p> <blockquote><p> A. Evidențiați utilizatorul și selectați <strong> Proprietăți </strong></p></blockquote> <p><img src=\"images/image_thumb-54-635.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Apoi la <strong> Membru al grupului </strong> filă, plasați glonțul la <strong> Administrator </strong> și faceți clic pe <strong> O.K </strong> . </p></blockquote> <p><img src=\"images/image_thumb-55-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Metoda 3. Cum se creează sau se șterge un utilizator cu prompt de comandă în sistemul de operare Windows 10/8/7. </h6> <p> Cea mai ușoară metodă de a adăuga sau elimina utilizatori pe toate versiunile de Windows este utilizând promptul de comandă. </p> <p> Pentru a adăuga un cont nou din linia de comandă: </p> <p> 1. Deschideți <strong> Promptul de comandă ca administrator </strong> . <br> 2. La promptul de comandă, tastați următoarea comandă și apăsați <strong> introduce </strong> : </p> <ul> <li><strong> nume utilizator utilizator net parolă / adăugare </strong></li> </ul> <p> * Notă: La comanda de mai sus modificați câmpurile „nume de utilizator” și „parolă”, în funcție de alegerea dvs. </p> <blockquote><p> de exemplu. dacă doriți să creați un cont nou cu numele de utilizator „John” și parola „Pas123”, tastați: </p> <ul> <li> utilizator net John Pas123 / adăugare </li> </ul> </blockquote> <p><img src=\"images/image_thumb13_thumb-169.png\" alt=\"add account command prompt windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <p> 3. În cele din urmă, dacă doriți să adăugați noul utilizator la grupul Administratori, dați această comandă: </p> <ul> <li><strong> nume de utilizator / adăugare administratori de grup local local </strong></li> </ul> <blockquote><p> de exemplu. În exemplul nostru, comanda este: </p> <ul> <li> net localgroup administrators John / add </li> </ul> </blockquote> <p><img src=\"images/image_thumb16_thumb-668.png\" alt=\"image_thumb[16]\" loading=\"lazy\"></p> <p> </p> <p> Pentru a șterge un utilizator din promptul de comandă: </p> <p> 1. Deschideți <strong> Promptul de comandă ca administrator </strong> . <br> 2. La promptul de comandă, tastați următoarea comandă și apăsați <strong> introduce </strong> : </p> <ul> <li><strong> nume de utilizator net / ștergere </strong></li> </ul> <p> de exemplu. dacă doriți să ștergeți utilizatorul „John”, tastați: </p> <ul> <li> utilizator net John / șterge </li> </ul> <p><img src=\"images/image_thumb19_thumb-438.png\" alt=\"image_thumb[19]\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această problemă. </p>"}