{"title":"Cum se blochează site-urile web pe Chrome sau Firefox.","content":"<p> Dacă căutați o modalitate ușoară de a bloca un site web pe Chrome sau Firefox, continuați să citiți mai jos. </p> <p> Deși Internetul pentru majoritatea dintre noi a devenit necesar în viața noastră de zi cu zi pentru munca sau divertismentul nostru, pe de altă parte, uneori este util să putem bloca unele site-uri pentru a evita distragerea atenției. De exemplu, nimeni nu vrea ca copilul lor să fie distras vizionând videoclipuri pe YouTube când își citesc lecțiile. </p> <p> În acest ghid, veți afla cum să blocați site-urile web în Chrome și <a href=\"#firefox\" target=\"_blank\" rel=\"nofollow noopener\"> Firefox </a> browsere. </p> <p> * Notă: dacă doriți să blocați un site web în toate browserele, citiți acest articol: <a href=\"https://www.repairwin.com/block-youtube-on-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să blochezi YouTube pe Windows 10. </a></p> <h2> Cum se blochează site-urile web pe Google Chrome. </h2> <p> Cel mai simplu mod de a bloca un site web în Chrome este să folosiți celebra extensie BlockSite. Instalarea programului de completare BlockSite este similară cu orice altă extensie. </p> <p> 1. Navigați la <a href=\"https://chrome.google.com/webstore/detail/blocksite-stay-focused-co/eiimnmioipafcokbfikbljfdeojpcgbh\" target=\"_blank\" rel=\"nofollow noopener\"> Extensie BlockSite </a> în magazinul web Chrome și faceți clic pe <strong> Adăugați la crom </strong> buton. </p> <p><img src=\"images/image_thumb-4-439.png\" alt=\"how to block websites chrome\" loading=\"lazy\"></p> <p> 2. Când vi se solicită, faceți clic pe <strong> Adaugă extensie </strong> . </p> <p><img src=\"images/image_thumb-5-782.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Când instalarea este finalizată, accesați meniul Chrome&gt; Mai multe instrumente&gt; Extensii </p> <p><img src=\"images/image_thumb-6-830.png\" alt=\"chrome tools extensions\" loading=\"lazy\"></p> <p> 4. Găsiți <strong> BlockSite </strong> extensie și faceți clic <strong> Detalii. </strong></p> <p><img src=\"images/image_thumb-7-415.png\" alt=\"Blocksite details\" loading=\"lazy\"></p> <p> 5. <strong> Deschis </strong> <strong> Opțiuni de extensie </strong> . </p> <p><img src=\"images/image_thumb-8-135.png\" alt=\"How to Block sites chrome\" loading=\"lazy\"></p> <p> 6. Tastați numele site-ului pe care doriți să îl blocați (de ex. <a href=\"http://www.youtube.com\" target=\"_blank\" rel=\"nofollow noopener\"> www.youtube.com </a> ) și apăsați simbolul plus (+) pentru a adăuga site-ul web pe lista de site-uri blocate. </p> <p><img src=\"images/image_thumb-9-298.png\" alt=\"blocked sites chrome\" loading=\"lazy\"></p> <p> 7. Gata! De acum înainte, când încercați să vizitați site-ul blocat, veți fi informat că site-ul este blocat cu extensia BlockSite. Pentru a modifica lista de site-uri blocate, faceți clic pe <strong> Editați-vă lista </strong> pentru a face orice modificare doriți sau pentru a elimina site-ul blocat din listă. </p> <p><img src=\"images/image_thumb-10-951.png\" alt=\"image\" loading=\"lazy\"></p> <h3> Cum să protejați prin parolă site-urile blocate în extensia BlockSite. </h3> <p> Dacă doriți să împiedicați utilizatorii să deblocheze un site blocat: </p> <p> 1. Deschideți <strong> BlockSite </strong> opțiuni de extensie. <br> 2. Navigați la <strong> Protecție cu parolă </strong> setări. <br> 3. <strong> Permite </strong> opțiunea Protejați <strong> opțiunile BlockSite preferate și pagina de extensie Chrome cu o parolă </strong> și apoi introduceți adresa de e-mail și parola și faceți clic pe <strong> Salvați. </strong></p> <p><img src=\"images/image_thumb-11-711.png\" alt=\"password protect blocked sites\" loading=\"lazy\"></p> <p> 4. BlockSite vă va trimite un e-mail cu un link pentru a vă confirma adresa de e-mail. După verificarea prin e-mail, protecția prin parolă va fi activă. </p> <h2> Cum se blochează site-urile web în Mozilla Firefox. </h2> <p> 1. Navigați la <a href=\"https://addons.mozilla.org/en-US/firefox/addon/blocksite/\" target=\"_blank\" rel=\"nofollow noopener\"> Extensie BlockSite </a> în programe de completare Firefox. <br> 2. Faceți clic pe <strong> Adăugați la Firefox </strong> buton. </p> <p><img src=\"images/image_thumb-12-999.png\" alt=\"block websites firefox\" loading=\"lazy\"></p> <p> 2. Când vi se solicită să permiteți instalarea extensiei, faceți clic pe <strong> Adăuga. </strong></p> <p><img src=\"images/image_thumb-13-588.png\" alt=\"Blocksite firefox\" loading=\"lazy\"></p> <p> 3. Când instalarea este finalizată, alegeți dacă doriți să blocați site-urile web în ferestrele private (incognito) și faceți clic pe <strong> Bine </strong> . </p> <p><img src=\"images/image_thumb-14-173.png\" alt=\"how to block site\" loading=\"lazy\"></p> <p> 4. Dacă doriți să preveniți extensia BlockSite pentru a citi datele de pe site-urile pe care le vizitați, faceți clic pe Poate scrisoare. </p> <p><img src=\"images/image_thumb-15-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Acum faceți clic pe pictograma BlockSite și <strong> Editați lista de blocuri </strong> pentru a specifica ce site-uri web doriți să blocați. </p> <p><img src=\"images/image_thumb-16-657.png\" alt=\"block sites firefox\" loading=\"lazy\"></p> <p> 6. În fila Blocare site-uri, tastați numele site-ului pe care doriți să îl blocați (de exemplu, „facebook.com”) și apoi adăugați-l la lista de site-uri web blocate. </p> <p><img src=\"images/image_thumb-17-817.png\" alt=\"How to block site Firefox\" loading=\"lazy\"></p> <p> 7. După ce ați adăugat site-urile pe care doriți să le blocați, închideți setările BlockSite și ați terminat. </p> <p> În plus față de funcția sa principală, extensia BlockSite are și alte funcții utile, cum ar fi: </p> <ul> <li> <p><strong> Modul de focalizare </strong> : Blocați site-urile pentru un anumit timp (de exemplu, 25 de minute) </p> </li> <li> <p><strong> Protecție cu parolă: </strong> Protejați-vă setările BlockSite de modificări. </p> </li> <li> <p><strong> Blocare după cuvinte: </strong> Blocați adresele URL care conțin cuvinte specifice. </p> </li> </ul> <p> Asta-i tot oameni buni! Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}