{"title":"Cum se elimină notificarea PROTECTED VIEW în toate documentele Word sau Excel primite sau descărcate.","content":"<p> „Vizualizarea protejată” este o caracteristică adăugată în cele mai recente versiuni Office, pentru a vă proteja computerul de orice viruși care pot fi încorporați în orice fișier descărcat de pe Internet sau primit prin e-mail. Deși alerta „Vizualizare protejată” poate fi eliminată cu ușurință făcând clic pe „Activați editarea”, este enervant atunci când primiți multe documente din surse de încredere. </p> <p><img src=\"images/image_thumb-19-615.png\" alt=\"How to Remove Protected View Notification in Word-Excel\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Articol asociat: </strong> <a href=\"https://www.repairwin.com/fix-file-cannot-be-previewed-in-outlook-word-experienced-an-error-when-opening-attachment/?preview=true\" target=\"_blank\" rel=\"nofollow noopener\"> FIX: Nu se poate previzualiza sau deschide atașamentele de poștă electronică Word sau Excel în Office 2013, 206, 2019 sau 365 </a> . </li> </ul> <h4> Cum se dezactivează alerta de vizualizare protejată în Word sau Excel. </h4> <p> Pentru a elimina alerta PROTECTED VIEW în versiunile Microsoft Word sau Excel 2013, 2016, 2019 sau 365: </p> <p> 1. Din <strong> Fişier </strong> faceți clic pe meniu <strong> Opțiuni </strong> . <br> 2. La <strong> Centrul de încredere </strong> opțiuni, selectați <strong> Setări Centrul de încredere </strong> . </p> <p><img src=\"images/image_thumb-16-270.png\" alt=\"fix Word experienced an error trying to open the file\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Debifează </strong> toate &quot; <strong> Activați vizualizarea protejată .. </strong> &quot;bifați și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-17-740.png\" alt=\"disable protected view option word - excel\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți acest lucru. </p>"}