{"title":"Cum se dezactivează Bitlocker în mediul de recuperare Windows (WinRE).","content":"<p> Acest tutorial conține instrucțiuni despre cum să dezactivați protecția BitLocker și să decriptați o unitate criptată BitLocker în mediul de recuperare Windows. Instrucțiunile pot fi utile, dacă computerul dvs. este protejat de BitLocker și nu acceptă cheia de recuperare Bitlocker sau parola BitLocker la pornirea sistemului și nu puteți debloca unitatea protejată BitLocker. </p> <p><img src=\"images/image_thumb-52-511.png\" alt=\"Remove Bitlocker from Windows Recovery Environment \" loading=\"lazy\"></p> <h4></h4> <h4> Cum se elimină protecția BitLocker și se decriptează unitatea criptată BitLocker în mediul de recuperare Windows (WinRE). </h4> <p><strong> Cerințe: </strong><br> <strong> A </strong> . <strong> Un suport de instalare Windows 10 (USB sau DVD). </strong> Dacă nu dețineți un suport de instalare Windows, puteți crea unul utilizând <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Instrumentul de creare media Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se creează un suport de instalare USB Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se creează un suport de instalare DVD Windows 10. </a></li> </ul> <p><strong> B. Cheia de recuperare BitLocker sau parola BitLocker: </strong> Pentru a dezactiva protecția Bitlocker, trebuie să aveți parola Bitlocker sau cheia de recuperare Bitlocker pentru a debloca mai întâi unitatea și apoi pentru a decripta unitatea. * </p> <p> * Notă: Dacă nu aveți cheia de recuperare BitLocker, nu există nicio modalitate de a ocoli protecția BitLocker. Dacă un disc este protejat de BitLocker și nu aveți cheia de recuperare BitLocker sau parola pentru a debloca unitatea, atunci singura opțiune pe care o aveți (pentru a utiliza din nou unitatea) este să ștergeți complet unitatea folosind instrucțiunile în acest articol: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se elimină protecția BitLocker de pe o unitate fără cheia de recuperare BitLocker sau parola. </a></p> <p> Cheia de recuperare Bitlocker este un număr de 48 de cifre și poate fi găsită la următoarele locații: </p> <ul> <li> Pe o imprimare pe care ați salvat-o, când ați activat Bitlocker. </li> <li> Pe o unitate USB pe care ați folosit-o, în timpul activării Bitlocker pentru a salva cheia de recuperare Bitlocker. </li> <li> La <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Chei de recuperare a contului Microsoft </a> , utilizând contul MS pe care îl utilizați pentru a vă conecta la dispozitiv sau ați adăugat dispozitivul pentru a descărca aplicații din Microsoft Store sau pentru a activa MS Office sau pentru e-mail. </li> <li> Pe dumneavoastră <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Cont Azure </a> pentru computerele de lucru care se conectează cu un cont Azure Active Directory. </li> </ul> <p> Odată ce ați găsit cheia de recuperare BitLocker sau parola ΒitLocker, procedați la deblocarea unității criptate Bitlocker și la eliminarea criptării Bitlocker în WinRE, urmând instrucțiunile de mai jos. </p> <p> Pentru a debloca și decripta unitatea C a sistemului de operare: din WinRE: </p> <p> 1. Porniți sistemul de pe suportul de instalare Windows 10. <br> 2. În ecranul de mai jos apăsați pe <strong> SCHIMB </strong> + <strong> F10 </strong> tastele pentru a lansa promptul de comandă. (sau apăsați <strong> Următorul </strong> &gt; <strong> Reparați computerul </strong> &gt; <strong> Depanare </strong> &gt; <strong> Prompt de comandă </strong> ). * </p> <p> * Notă: dacă ați solicitat cheia de recuperare, faceți clic pe <strong> SALTAȚI această unitate </strong> . </p> <p><img src=\"images/image_thumb15_thumb-548.png\" alt=\"How to disable-unlock bitlocker from Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. La promptul de comandă, tastați următoarea comandă pentru a vizualiza litera de unitate a unității criptate: </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p> </p> <p> 4. Apoi continuați să deblocați unitatea criptată, utilizând următoarea comandă, în funcție de caz: </p> <p><strong> Cazul A. </strong> Dacă cunoașteți cheia de recuperare BitLocker, dați această comandă: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -rp BitLocker-recovery-key </strong></li> </ul> <p> * de ex .: Dacă doriți să deblocați unitatea &quot;D:&quot;, iar cheia de recuperare bitlocker este: &quot;123456-123456-123456-123456-123456-123456&quot;, apoi tastați: </p> <ul> <li> <ul> <li> manage-bde -unlock <strong> D </strong> : -rp <strong> 123456-123456-123456-123456-123456-123456 </strong></li> </ul> </li> </ul> <p> </p> <p><strong> Cazul B. </strong> Dacă știți parola BitLocker pentru a debloca unitatea, dați această comandă: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -pw BitLocker-Password </strong></li> </ul> <p> * de ex .: Dacă doriți să deblocați unitatea „D:” și parola BitLocker este: „123qwerty”, tastați: * </p> <ul> <li> <ul> <li> manage-bde -unlock <strong> D </strong> : -parola <strong> 123qwerty </strong></li> </ul> </li> </ul> <p> </p> <p> 5. Apoi continuați să decriptați unitatea și opriți protecția BitLocker cu această comandă: </p> <ul> <li><strong> manage-bde -off-letter-drive: </strong></li> </ul> <p> * de ex .: Dacă doriți să decriptați unitatea „D:”, tastați: </p> <ul> <li> <ul> <li> manage-bde –off <strong> D </strong> : </li> </ul> </li> </ul> <p> 6. Procesul de decriptare cu start. Pentru a verifica starea de decriptare tastați din nou următoarea comandă și asigurați-vă că unitatea este <strong> Complet decriptat </strong> și <strong> Deblocat </strong> : </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p><img src=\"images/image_thumb9_thumb-678.png\" alt=\"decrypt bitlocker encrypted drive windows removery environment\" loading=\"lazy\"></p> <p> </p> <p> 7. Când ați terminat, eliminați suportul de instalare Windows și reporniți computerul. * </p> <p> * Notă: dacă Windows nu poate porni, atașați unitatea la alt computer și copiați datele personale pe un alt suport media. Atunci <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> diagnosticați unitatea pentru probleme </a> și dacă este OK, puneți discul înapoi pe computer și efectuați un <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> curățați instalarea Windows 10 </a> . </p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această problemă. </p>"}