{"title":"Cum să eliminați elementele Spotlight Windows de pe ecranul de blocare (cum ar fi ceea ce vedeți, fapte distractive, sfaturi etc.) în Windows 10.","content":"<p> În Windows 10, Microsoft a adăugat funcția Windows Spotlight, care este responsabilă pentru toate imaginile de fundal, sfaturile și linkurile pe care le vedeți în ecranul de blocare. În acest tutorial veți găsi instrucțiuni detaliate despre cum să eliminați toate elementele Spotlight (cum ar fi ceea ce vedeți, fapte distractive, sfaturi etc.). din ecranul de blocare din edițiile Windows 10 Home, Pro, Enterprise și Education. </p> <p><img src=\"images/image_thumb-85-983.png\" alt=\"Remove Windows Spotlight items from Windows 10 Lock Screen \" loading=\"lazy\"></p> <p> </p> <h2> Cum să eliminați fapte distractive, sfaturi, trucuri și multe altele ... de pe ecranul de blocare în Windows 10. </h2> <ul> <li><a href=\"#turn-off-spotight-windows-10-home\" target=\"_blank\" rel=\"nofollow noopener\"> Windows 10 Home. </a></li> <li><a href=\"#turn-off-spotight-windows-10-pro\" target=\"_blank\" rel=\"nofollow noopener\"> Windows 10 Professional, Enterprise &amp; Education. </a></li> </ul> <p> </p> <h6> Cum să dezactivați elementele Spotlight Windows în Windows 10 Home. </h6> <p> Pentru a elimina faptele distractive, sfaturile, trucurile de pe ecranul de blocare din Windows 10 Home. </p> <p> 1. Faceți clic dreapta pe un spațiu gol de pe desktop și selectați <strong> Personalizați </strong> . * </p> <p> * Alternativ: Accesați <strong> start </strong> meniul <img src=\"images/image_thumb-98-467.png\" alt=\"image\" loading=\"lazy\"> , faceți clic pe <strong> Setări </strong> <img src=\"images/image_thumb-150-399.png\" alt=\"image\" loading=\"lazy\"> și apoi faceți clic pe <strong> Personalizare. </strong></p> <p><img src=\"images/image_thumb-86-908.png\" alt=\"Turn-Off Windows Spotlight Windows 10 Home\" loading=\"lazy\"></p> <p> </p> <p> 2. În Setări personalizare, selectați <strong> Ecran de blocare </strong> în stânga și apoi în opțiunile de fundal, setați una dintre celelalte opțiuni (de exemplu, imagine sau prezentare) pentru a dezactiva Spotlight-ul Windows. </p> <p><img src=\"images/image_thumb-87-515.png\" alt=\"remove spotlight fun facts tricks windows 10 lock screen\" loading=\"lazy\"></p> <p> </p> <p> 3. Apoi <strong> Opriți </strong> „Obțineți informații distractive, sfaturi și multe altele de pe Windows și Cortana pe ecranul de blocare” </p> <p><img src=\"images/image_thumb-88-136.png\" alt=\"turn off like what you see lock screen windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Cum să dezactivați elementele Spotlight în versiunile Windows 10 Pro, Enterprise și Education. </h6> <p> Pentru a dezactiva elementele Spotlight Windows (cum ar fi ceea ce vedeți, fapte distractive, sfaturi etc.), utilizând editorul de politici de grup: </p> <p> 1. Apăsați simultan Windows <img src=\"images/image_thumb36-436.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați <strong> gpedit.msc </strong> &amp; Presa <strong> Introduce. </strong></p> <p><img src=\"images/image_thumb-78-637.png\" alt=\"turn off spotight group policy\" loading=\"lazy\"></p> <p> 3. În panoul din stânga navigați la: </p> <ul> <li><strong> Configurare computer </strong> &gt; <strong> Șabloane administrative </strong> &gt; <strong> Panou de control </strong> &gt; <strong> Personalizare </strong></li> </ul> <p><strong> 4. </strong> În panoul din dreapta, faceți dublu clic pe <strong> Forțați un anumit ecran de blocare implicit și o imagine de conectare </strong> . </p> <p><img src=\"images/image_thumb-89-681.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Acum, modificați această setare de politică după cum urmează și apoi faceți clic pe <strong> O.K </strong> : </p> <blockquote><p> A. Verifica <strong> Activat </strong> . <br> b. Tastați calea completă a imaginii pe care doriți să o utilizați ca fundal pe ecranul de blocare. * <br> c. <strong> Verifica </strong> „Dezactivează fapte distractive, sfaturi, trucuri și multe altele pe ecranul de blocare” </p></blockquote> <p> </p> <p> * SFAT: Puteți folosi propria imagine pentru fundalul ecranului de blocare sau vă puteți ușura viața și puteți utiliza una dintre imaginile implicite ale ecranului de blocare Windows, care sunt stocate în următorul folder de pe computer: C: \\ Windows \\ Web \\ Ecran\\ </p> <p><img src=\"images/image_thumb-90-124.png\" alt=\"spotlight group policy\" loading=\"lazy\"></p> <p> </p> <p> Asta e tot! A funcționat pentru tine? </p> <p> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}