{"title":"Cum să transferați e-mailurile și setările Thunderbird pe un computer nou.","content":"<p> Acest tutorial conține instrucțiuni detaliate despre cum să transferați mesajele de e-mail Thunderbird, setările contului și agendele pe alt computer. Aplicația de e-mail Thunderbird stochează toate datele într-un folder de profil care are extensia „.default” la sfârșitul numelui său. (de ex. „wyhsxcvs.default”). În mod implicit, acest folder de profil este stocat la următoarea locație de pe computer: </p> <ul> <li> C: \\ Users \\\\ AppData \\ Roaming \\ Thunderbird \\ Profiles \\ <strong> .Mod implicit </strong></li> </ul> <p><img src=\"images/image_thumb-14-425.png\" alt=\"How to Transfer Thunderbird Emails & Data to a New Computer.\" loading=\"lazy\"></p> <p> Deci, dacă doriți să mutați datele Thunderbird pe un computer nou, trebuie să transferați folderul părinte „Thunderbird” pe noul computer și apoi să îndreptați Thunderbird către acel folder. </p> <h4> Cum să mutați profilul Thunderbird pe alt PC. </h4> <h6> Pasul 1. Copiați folderul Profil Thunderbird de pe computerul vechi. </h6> <p> </p> <p> Pe computerul vechi, navigați la locația de stocare a datelor Thunderbird. Pentru a face asta: </p> <p> 1. Deschideți Thunderbird. <br> 2. Din meniu <img src=\"images/image_thumb21_thumb-959.png\" alt=\"image_thumb[21]\" loading=\"lazy\"> , alege <strong> Ajutor </strong> -&gt; <strong> Informatii de depanare. <br> </strong> 3. La <strong> Dosar profil </strong> linie, faceți clic <strong> Deschideți folderul </strong> . </p> <p><img src=\"images/image_thumb-8-878.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Închideți aplicația Thunderbird. <br> 5. În fereastra Explorator, faceți clic pe <strong> Roaming </strong> . </p> <p><img src=\"images/image_thumb-9-272.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Copie </strong> și <strong> Pastă </strong> <strong> Thunderbird </strong> dosar pe un suport de stocare cu suficient spațiu liber. (de exemplu, o unitate USB externă). </p> <p><img src=\"images/image_thumb-10-958.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Pasul 2. Transferați profilul Thunderbird pe computerul nou. </h6> <p> 1. <a href=\"https://www.thunderbird.net/en-US/download/\" target=\"_blank\" rel=\"nofollow noopener\"> Descarca </a> și instalați Thunderbird pe noul computer. * </p> <p><strong> * Important: </strong> La sfârșitul procesului de instalare, <strong> debifează </strong> opțiunea „Lansați Mozilla Thunderbird acum” și faceți clic pe <strong> finalizarea </strong> . </p> <p><img src=\"images/image_thumb-11-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Conectați unitatea USB (cu folderul „Thunderbird”), la noul computer. <br> 3. Faceți clic dreapta pe folderul „Thunderbird” și faceți clic pe <strong> Copie </strong> . <br> 4. Apăsați Windows <img src=\"images/image_thumb8_thumb-1-464.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 5. Tastați următoarea comandă <strong> </strong> și apăsați <strong> Introduce: </strong></p> <ul> <li><strong> %datele aplicatiei% </strong></li> </ul> <p><img src=\"images/image_thumb-12-421.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. În ferestrele Exploratorului, faceți clic dreapta pe un spațiu gol și faceți clic <strong> Pastă </strong> . </p> <p><img src=\"images/image_thumb-13-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Lansați Thunderbird și ar trebui să vedeți toate e-mailurile, agendele și setările contului, ca pe vechiul computer. </p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}