{"title":"Cum se recuperează fișierul Outlook Express DBX GRATUIT.","content":"<p> Outlook Express este un program client de e-mail care a fost văzut pentru prima dată în Windows XP. Dar chiar și astăzi (anul 2018) unii clienți încă îl folosesc, ca principal program de e-mail. Una dintre principalele probleme pe care le are Outlook Express este problema limită de 2 GB. </p> <p> Descrierea problemei limită de dimensiune de 2 GB în Outlook Express. <br> Când unul dintre principalele foldere Outlook Express (de ex. „Mesaje primite” sau „Trimise”) depășește dimensiunea de 2 GB, fișierul corespunzător de stocare OE DBX poate deveni corupt și folderul OE poate părea gol. Ca urmare a problemei, Outlook Express nu poate trimite sau primi e-mailuri și afișează eroarea <a href=\"https://www.repairwin.com/fix-outlook-express-error-0x800c0133-due-to-2gb-size-limit/\" target=\"_blank\" rel=\"nofollow noopener\"> 0x800c0133 </a> în timpul operației Trimitere / Primire. </p> <p> În acest tutorial vă voi arăta cum să reparați un fișier DBX corupt din Outlook Express și să vă primesc e-mailurile! </p> <h4> Cum să remediați un fișier DBX Outlook Express corupt. </h4> <p> Dacă unul dintre folderele Outlook Express (căsuța de e-mail, Trimiterea etc.) se deteriorează, urmați instrucțiunile de mai jos pentru a repara folderul magazin DBX și pentru a vă primi e-mailurile. </p> <h6> Pasul 1. Activați vizualizarea fișierelor ascunse. </h6> <p> 1. Deschideți Windows Explorer. <br> 2. Din <strong> Instrumente </strong> meniu alege <strong> Opțiuni folder </strong> . <br> 3. În fila Vizualizare, faceți clic pe <strong> Afișați fișierele și folderele ascunse </strong> și faceți clic pe <strong> O.K. </strong></p> <p><img src=\"images/image_thumb-2-290.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Pasul 2. Găsiți fișierul DBX Outlook Express corupt pe disc. </h6> <p> 1. Deschideți folderul magazinului Outlook Express. De obicei, acest folder se află la următoarea cale pe disc: </p> <ul> <li> C: \\ Documents and Settings \\\\ Local Settings \\ Application Data \\ Identities \\ {} \\ Microsoft \\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> de exemplu. „C: \\ Documents and Settings \\ User \\ Local Settings \\ Application Data \\ Identities \\ {D8F3C56D-965E-41AE-8A23-A58460ABAE00} \\ Microsoft \\ <strong> Outlook Express </strong> ” </p></blockquote> <p> 3. Din Explorator <strong> Vedere </strong> meniu alege <strong> Detalii </strong> . <br> 4. Găsiți ce fișier DBX, depășește limita de 2 GB sau localizați fișierul DBX corupt. (fișierul DBX corupt, este folderul MAIL care pare gol în programul Outlook Express). </p> <p><img src=\"images/image_thumb-3-887.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Copiați fișierul DBX respectiv, într-o altă locație de pe discul dvs. (de exemplu, într-un folder nou de pe desktop, denumit „CorruptedDBX”). </p> <p> </p> <h6> Pasul 3. Descărcați UnDBX - Utilitar gratuit de recuperare DBX Outlook Express. </h6> <p> UnDBX este un instrument excelent și gratuit Outlook Express DBX Repair Tool care poate extrage toate e-mailurile Outlook Express conținute în format .eml. În plus, are opțiunea de a repara și repara un fișier Outlook Express .DBX deteriorat. </p> <p> Puteți descărca UnDBX de pe <a href=\"https://sourceforge.net/projects/undbx/\" target=\"_blank\" rel=\"nofollow noopener\"> Aici </a> . </p> <p> </p> <h6> Pasul 4. Recuperați e-mailurile din fișierul Outlook Express DBX corupt. </h6> <p> 1. Pentru a recupera e-mailurile din fișierul DBX corupt, faceți dublu clic pentru a rula utilitarul UnDBX. <br> 2. În utilitarul UnDBX: </p> <blockquote><p> 1. Selectați folderul care conține fișierele .dbx Outlook Express și apoi <strong> Verifica </strong> &quot; <strong> activați modul de recuperare </strong> &quot;opțiunea de mai jos. <br> 2. <strong> Alegeți un folder de destinație </strong> pe computer, pentru a stoca (extrage) fișierele .eml. (de exemplu, într-un dosar de pe desktop numit „RecuperatInbox”) <br> 3. În cele din urmă faceți clic pe <strong> Recupera </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-645.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Când se finalizează recuperarea UnDBX, deschideți Outlook Express. <br> 4. Navigați la folderul în care UnDBX a salvat fișierele .eml extrase. <br> 5. Trageți și fixați e-mailurile extrase, în folderul corespunzător (în Outlook Express). * </p> <p><strong> * Sugestie: </strong> Pentru a evita ca folderele Outlook Express să fie corupte din nou (sau pentru a trece de limita de 2 GB), vă sugerez să trageți și să plasați e-mailurile în grupuri (de exemplu, pe an) și să le puneți în diferite foldere în OE. De exemplu, selectați numai e-mailurile din anul curent și glisați-le și plasați-le într-un nou folder OE numit cu anul curent (de exemplu, „Mesaje primite 2018”). Apoi repetați aceiași pași din toate celelalte e-mailuri din anii precedenți. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}