{"title":"Cum se face backup fișierelor personale cu istoricul fișierelor în Windows 10.","content":"<p> În acest tutorial vă voi arăta cum să configurați Windows 10 pentru a crea automat copii și instantanee ale fișierelor dvs. utilizând instrumentul de rezervă Istoric fișiere, pentru a le putea restabili (dacă este necesar), utilizând „Restaurarea versiunilor anterioare” caracteristică. </p> <p> După cum probabil ați observat deja, în mod implicit, Windows 10 nu păstrează versiunile anterioare ale fișierelor sau folderelor dvs., ca în Windows 7. Acest lucru se întâmplă, deoarece Windows 10 nu mai folosește serviciul „Volume Shadow Copy” pentru faceți instantanee din fișierele dvs., dar utilizează în schimb numai instrumentul de rezervă „Istoricul fișierelor”. </p> <p> „Istoricul fișierelor” este un instrument de backup excelent încorporat în Windows 10, care poate fi configurat pentru a lua copii și instantanee ale fișierelor dvs. într-o locație de stocare alternativă decât unitatea principală (de exemplu, pe o unitate USB, rețea etc.) . * </p> <p> * Notă: singura limitare a instrumentului „Istoricul fișierelor” este că nu vă permite să alegeți unitatea C: ca destinație de rezervă alternativă. dacă nu dețineți o unitate secundară disponibilă pentru backup, continuați să citiți acest tutorial pentru a afla cum să ocoliți această limitare ... </p> <ul> <li><strong> Articol asociat: </strong> <a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să creați copii Shadow ale fișierelor dvs. cu Task Scheduler în Windows 10. </a></li> </ul> <h4> Cum să faceți o copie de rezervă a fișierelor dvs. personale cu instrumentul de backup al istoricului fișierelor în Windows 10. </h4> <p> 1. După cum am menționat mai sus, pentru a vă salva fișierele cu instrumentul de backup Istoric fișiere, trebuie să aveți o unitate de stocare disponibilă conectată la computer (de exemplu, o unitate USB) sau o locație de rețea (de exemplu, un alt computer din rețea) , sau un dispozitiv de stocare NAS). * </p> <p> * Notă: dacă nu dețineți un dispozitiv de stocare alternativ, atunci aveți următoarele opțiuni: </p> <blockquote><p> A. Către <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> micșorați dimensiunea unității principale C: \\ </a> și cu spațiul liber disponibil pentru a crea o nouă unitate de stocare a copiei de rezervă sau ... </p> <p> B. Pentru a stoca copia de rezervă pe unitatea principală C: \\. În acest caz, creați un folder nou pe unitatea C: și denumiți-l „FileHistory” (sau orice doriți) și continuați mai jos ... </p></blockquote> <p> 2. Navigați la Windows <strong> Panou de control </strong> și sub <strong> Sistem și securitate, </strong> clic <strong> Salvați copie de rezervă </strong><strong> copii ale fișierelor dvs. cu Istoricul fișierelor. </strong></p> <p><img src=\"images/image_thumb-42-924.png\" alt=\"How to Backup & Keep Previous Versions of Files in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 3. Acum, în funcție de cazul dvs., efectuați următoarele: </p> <ul> <li><strong> Cazul A. </strong> Dacă dețineți o unitate disponibilă pentru backup, atunci: </li> </ul> <blockquote><p> A. Apasă pe <strong> Porniți </strong> butonul de pe ecran pentru a activa „Istoricul fișierelor”. <br> b. Continuă să <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> pasul 4 </a> de mai jos pentru a configura setările de rezervă „Istoricul fișierelor”. </p></blockquote> <p><img src=\"images/image_thumb-44-788.png\" alt=\"Turn On File History Windows 10\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Cazul B: </strong> Dacă nu dețineți o unitate disponibilă pentru backupul Istoric fișiere sau dacă doriți să stocați backupul în rețea, atunci: </li> </ul> <blockquote><p> A. Clic <strong> Selectați o locație de rețea. </strong></p></blockquote> <p><img src=\"images/image_thumb-56-796.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. În ecranul următor: </p> <p> 1. Dacă doriți să salvați copia de rezervă în rețea, tastați calea completă de rețea a locației de stocare de rezervă și faceți clic <strong> Selectați Folder </strong> . </p> <p> 2. Dacă doriți să salvați copia de rezervă pe unitatea principală C: \\, tastați calea completă a rețelei către folderul local de rezervă pe unitatea C: \\, la acest formular: </p> <ul> <li> <strong> \\\\ Computer-Name \\ C $ \\ FileHistory </strong></li> </ul> <p> * Note: <br> 1. Înlocuiți valoarea „Computer-Name” cu numele computerului. (Pentru a găsi numele computerului dvs., faceți clic dreapta pe pictograma „Acest computer” din Windows Explorer). <br> 2. Rețineți că salvarea copiei de siguranță a fișierelor dvs. personale pe aceeași unitate în care au fost deja stocate <strong> nu este o soluție de încredere </strong> . Pentru a fi în siguranță, stocați întotdeauna copia de rezervă pe un alt dispozitiv de stocare. </p></blockquote> <p> de exemplu: dacă numele computerului este „Pegasus”, tastați: „\\\\ Pegasus \\ C $ \\ FileHistory” </p> <p><img src=\"images/image_thumb-53-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> c. În ecranul următor, faceți clic pe <strong> O.K </strong> . </p></blockquote> <p><img src=\"images/image_thumb-54-349.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> d. Acum faceți clic pe <strong> Porniți </strong> pentru a activa instrumentul de backup Istoric fișiere, apoi continuați mai jos pentru a configura setările de rezervă. </p></blockquote> <p><img src=\"images/image_thumb-48-620.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Pentru a configura opțiunile de rezervă „Istoric fișiere”, faceți clic pe <strong> Setari avansate </strong> pe stanga. </p> <p><img src=\"images/image_thumb-49-919.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4a. Apoi la <strong> Setari avansate </strong> opțiuni, setați cât de des să copiați fișierele și cât timp să păstrați versiunile salvate. Când ați terminat, faceți clic pe <strong> Salvează modificările </strong> . </p> <p><img src=\"images/image_thumb-61-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. În cele din urmă faceți clic pe <strong> Aleargă acum </strong> pentru a face prima copie de rezervă. * </p> <p><img src=\"images/image_thumb-55-463.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Ajutor suplimentar - Note: <br> 1. În mod implicit, „Istoricul fișierelor” face o copie de rezervă a folderelor „Biblioteci” (Desktop, Documente, Favorite, Muzică, OneDrive, Imagini și videoclipuri). Dacă doriți să excludeți unul dintre aceste foldere din copie de rezervă, să includeți alte foldere sau să examinați toate opțiunile de copiere de rezervă a istoricului fișierelor, navigați la: </p> <ul> <li> <p><strong> Setări <img src=\"images/image_thumb-58-467.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Actualizare și securitate </strong> &gt; <strong> Backup </strong> &gt; <strong> Mai multe opțiuni. </strong></p> </li> </ul> <p><img src=\"images/image_thumb-57-938.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Pentru a vă restabili fișierele din copia de rezervă „Istoricul fișierelor”, navigați la una dintre următoarele locații: </p> <ul> <li><strong> Panou de control </strong> &gt; <strong> Istoricul fișierelor </strong> &gt; <strong> Restabiliți fișierele personale. </strong></li> <li><strong> Setări <img src=\"images/image_thumb-59-275.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Actualizare și securitate </strong> &gt; <strong> Backup </strong> &gt; <strong> Mai multe opțiuni </strong> &gt; <strong> Restabiliți fișierele dintr-o copie de rezervă curentă. </strong></li> </ul> <p> 3. Pentru a restabili selectiv un fișier sau folder la versiunea sa anterioară, faceți clic dreapta pe fișier (sau folder) și selectați <strong> Restaurează versiunile anterioare </strong> . </p> <p><img src=\"images/image_thumb-60-867.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}