{"title":"Cum se decriptează fișierele criptate EFS și se elimină criptarea EFS în Windows 10.","content":"<p> Într-un tutorial anterior am descris calea către <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> criptați-vă fișierele utilizând criptarea EFS </a> . În acest tutorial veți afla cum să eliminați criptarea EFS și cum să decriptați fișierele criptate EFS după ce le-ați transferat pe alt computer. </p> <h4> Cum se decriptează fișierele criptate EFS și se dezactivează criptarea EFS. </h4> <ul> <li> <p><a href=\"#part-1\"> Partea 1. Cum să dezactivați și să eliminați criptarea EFS pe același PC. </a></p> </li> <li> <p><a href=\"#part-2\"> Partea 2. Cum se decriptează fișiere EFS pe alt computer. </a></p> </li> </ul> <h6> Partea 1. Cum se dezactivează și se elimină criptarea EFS. </h6> <p> Când criptați fișierele cu EFS, atunci cheia de decriptare (certificat) este stocată local pe computer și fișierele sunt deja decriptate. Dacă doriți să dezactivați criptarea EFS pentru a opri criptarea fișierelor / folderelor: </p> <p> 1. Faceți clic dreapta pe folderul / fișierul criptat și modificați <strong> Proprietatea fișierului </strong> la <strong> Personal </strong> . </p> <p><img src=\"images/image_thumb-26-500.png\" alt=\"how to disable efs encryption\" loading=\"lazy\"></p> <p> 2. Când ați terminat, ar trebui să vedeți că folderul / fișierul este deblocat. Efectuați aceiași pași pentru a elimina criptarea de pe orice alt dosar și fișier criptat. </p> <p> 3. Acum, dacă nu utilizați criptarea EFS în niciun alt fișier / folder și doriți să eliminați complet cheia de recuperare EFS (alias „cheie de decriptare - certificat”) de pe computer: </p> <blockquote> <p> 1. Deschideți Internet Explorer și din <strong> Instrumente </strong> selectați meniul <strong> optiuni de internet </strong> . (sau, deschis <strong> optiuni de internet </strong> din <strong> Panou de control </strong> .) </p> <p> 2. La <strong> Conţinut </strong> faceți clic pe fila <strong> Certificate </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-27-186.png\" alt=\"how to remove efs certificate-recovery key\" loading=\"lazy\"></p> <blockquote> <p> 3. În fila Personal, selectați certificatul de decriptare și faceți clic pe <strong> Elimina </strong> . * </p> <p><strong> * Atenție: </strong> Asigurați-vă că ați eliminat (oprit) criptarea pentru toate fișierele criptate înainte de a elimina certificatul (cheie de decriptare) </p> </blockquote> <p><img src=\"images/image_thumb-25-639.png\" alt=\"how to remove efs recovery key\" loading=\"lazy\"></p> <blockquote> <p> 4. <strong> Repornire </strong> computerul tau. </p> </blockquote> <h6></h6> <h6> Partea 2: Cum să decriptați fișierele criptate EFS pe alt computer. </h6> <p> Dacă ați transferat fișierele criptate EFS pe alt computer, atunci singura modalitate de a vizualiza (deschide) fișierele EFS este să dețineți cheia de decriptare. Cheia de decriptare este fișierul .pfx certificat, pe care l-ați exportat când ați criptat fișierele. Dacă nu aveți cheia de decriptare EFS, nu există o modalitate de a decripta fișierele EFS. </p> <p><strong> Pentru a decripta fișierele criptate EFS, utilizând cheia de decriptare - Certificat: </strong></p> <p> 1. Faceți dublu clic pe cheia de decriptare (fișier certificat .pfx) pentru ao instala. <br> 2. În ecranul de întâmpinare al Asistentului de importare a certificatelor faceți clic <strong> Următorul </strong> . <br> 3. Apoi faceți clic pe <strong> Următorul </strong> din nou. </p> <p><img src=\"images/image_thumb38_thumb-158.png\" alt=\"How to Decrypt EFS Encrypted files\" loading=\"lazy\"></p> <p> 4. Tastați parola pe care ați folosit-o când ați exportat cheia certificatului și faceți clic <strong> Următorul </strong> . </p> <p><img src=\"images/image_thumb39_thumb-680.png\" alt=\"install efs .pfx certificate\" loading=\"lazy\"></p> <p> 5. Lăsați setările implicite la opțiunile Certificate Store și faceți clic pe <strong> Următorul </strong> . </p> <p><img src=\"images/image_thumb40_thumb-629.png\" alt=\"image_thumb[40]\" loading=\"lazy\"></p> <p> 6. În cele din urmă faceți clic pe <strong> finalizarea </strong> . </p> <p><img src=\"images/image_thumb41_thumb-225.png\" alt=\"image_thumb[41]\" loading=\"lazy\"></p> <p> </p> <p> 7. Acum puteți deschide fișierele criptate. * </p> <p> * Notă: După decriptarea fișierelor, urmați instrucțiunile de la <a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> partea 1 </a> de mai sus, pentru a elimina complet criptarea, dacă doriți. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție </p>"}