{"title":"Cum se actualizează manual componentele Chrome și Google Chrome.","content":"<p> Ori de câte ori este disponibilă o nouă actualizare Chrome, Google Chrome îi solicită utilizatorului să repornească browserul pentru a instala actualizarea. Dar, uneori, după aplicarea actualizării, Chrome se poate bloca sau bloca. Acest lucru se întâmplă deoarece Chrome include mai multe componente individuale care pot să nu fie încă actualizate și în acest caz trebuie să le actualizați manual. </p> <p> Acest tutorial conține instrucțiuni despre cum să actualizați manual Chrome și componentele individuale Chrome. </p> <h4> Cum se actualizează manual Google Chrome și componentele Chrome. </h4> <h6> Partea 1. Cum se actualizează manual Google Chrome. </h6> <p> Pentru a instala cea mai recentă versiune de Google Chrome: </p> <p> 1. Din meniul Chrome <img src=\"images/image_thumb-4-667.png\" alt=\"image\" loading=\"lazy\"> clic <strong> Ajutor -&gt; Despre Google Chrome </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-39-551.png\" alt=\"How to Update Chrome manually\" loading=\"lazy\"></p> <p> </p> <p> 2. Google Chrome va verifica actualizările și apoi va instala automat ultima actualizare. </p> <p><img src=\"images/image_thumb-40-825.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Când actualizarea este finalizată, faceți clic pe <strong> Relansați </strong> buton. </p> <p><img src=\"images/image_thumb-41-622.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Partea 2. Cum se actualizează componentele individuale Chrome. </h6> <p> 1. În bara de adrese a Chrome, tastați: </p> <ul> <li><strong> chrome: // components </strong></li> </ul> <p> 2. Faceți clic pe <strong> Verifica pentru actualizare </strong> buton la fiecare componentă Chrome pe care doriți să o actualizați. </p> <p><img src=\"images/image_thumb-42-446.png\" alt=\"How to Update Chrome Components\" loading=\"lazy\"></p> <p> </p> <p> 3. Când ați terminat actualizarea, reporniți Chrome. </p> <p> Ajutor suplimentar: dacă, după actualizarea Chrome și a componentelor sale, vă confruntați cu probleme cu browserul dvs., continuați cu <a href=\"https://www.repairwin.com/how-to-uninstall-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> eliminați complet și reinstalați Chrome </a> . </p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}