{"title":"Cum se creează copii umbre ale fișierelor cu programul de activități în Windows 10.","content":"<p> Într-un tutorial anterior am menționat modul de salvare a fișierelor personale cu <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Istoricul fișierelor </a> în Windows 10. În acest tutorial voi arăta cum să creați automat Shadow Copies a fișierelor dvs. personale utilizând Programatorul de activități. Copiile umbre ale fișierelor dvs. vă vor permite să reveniți la un anumit fișier sau folder la o versiune anterioară (moment). </p> <p> Funcția Shadow Copy a fost introdusă pentru prima dată în Windows Server 2003 și apoi adăugată la versiunile Windows Vista și 7, ca parte a caracteristicii Restaurare sistem. Procesul „Copiere umbra” poate face copii de rezervă și instantanee ale stării curente a sistemului și a fișierelor personale, chiar dacă sunt utilizate. Procesul de recuperare a fișierelor din Shadow Copies este mai frecvent cunoscut sub denumirea de „Restaurare versiuni anterioare”. </p> <h4> Cum să creați zilnic o copie instantanee a fișierelor dvs. în Windows 10. * </h4> <p><strong> * Note: </strong><br> 1. Folosind instrucțiunile de mai jos, veți putea crea zilnic Shadow Copies (instantanee) a întregului volum „C: \\”. (Fișiere de sistem Windows și date personale) <br> 2. Copiile Shadow pot fi folosite pentru a vă restabili fișierele într-un moment mai vechi, utilizând caracteristica „Restaurare versiune anterioară” sau utilizând un utilitar terță parte care poate accesa copiile Shadow, cum ar fi <a href=\"https://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowExplorer </a> sau <a href=\"https://www.nirsoft.net/utils/shadow_copy_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowCopyView </a> . <br> 3. Copia Shadow <strong> nu poate fi folosit pentru a vă restabili sistemul </strong> până la un moment anterior, folosind <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> Restaurarea sistemului </a> instrument. Dacă doriți să vă puteți restabili sistemul utilizând Restaurarea sistemului, continuați și <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Activați protecția Restaurare sistem. </a> <br> 4. În cele din urmă, rețineți că copiile Shadow create nu reprezintă o copie de siguranță fiabilă, deoarece „Shadow Copies” sunt stocate pe unitatea principală C: \\, iar dacă unitatea nu reușește, veți pierde toate datele. Pentru a crea o copie de siguranță fiabilă a datelor dvs., citiți instrucțiunile din acest articol: <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se face backup fișierelor personale cu istoricul fișierelor în Windows 10. </a></p> <p> </p> <p><strong> Pentru a crea versiunile anterioare ale fișierelor dvs. personale utilizând copiile umbrite: </strong></p> <p> 1. Deschideți <strong> Planificator de sarcini </strong> . Dacă nu știi cum să faci asta, atunci ... </p> <blockquote><p> 1. În caseta de căutare tastați <strong> Sarcină </strong> sau <strong> Planificator de sarcini </strong> . <br> 2. Deschideți „Task Scheduler” din rezultatele căutării. </p></blockquote> <p><img src=\"images/image_thumb-31-630.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. La Task Scheduler faceți clic <strong> Creați o sarcină </strong> . </p> <p><img src=\"images/image_thumb-23-462.png\" alt=\"How to Start ThrottleStop at Windows Startup\" loading=\"lazy\"></p> <p> </p> <p> 3. La <strong> General </strong> filă: </p> <blockquote><p> 1. Tastați „Creați o copie umbră a fișierelor mele” ca nume al activității. <br> 2. <strong> Verifica </strong> <strong> Aleargă cu cele mai mari privilegii </strong> cutie. </p></blockquote> <p> Notă: Dacă doriți să începeți sarcina în fundal, plasați un punct la <strong> Rulați dacă utilizatorul este conectat sau nu </strong> și apoi introduceți parola de conectare. </p> <p><img src=\"images/image_thumb-62-499.png\" alt=\"create shadow copies task windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Apoi selectați <strong> Declanșatoare </strong> fila și faceți clic pe <strong> Nou </strong> . <br> 4a. În fereastra „Declanșator nou”, specificați cât de des să creați un instantaneu al fișierelor dvs. și faceți clic <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-63-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Apoi selectați <strong> Acțiuni </strong> fila și faceți clic pe <strong> Nou </strong> . <br> 5a. În fereastra „Acțiune nouă”: </p> <blockquote><p> 1. Selectați <strong> Porniți un program </strong> . <br> 2. La „Program / script”, tastați: <strong> wmic </strong><br> 3. La „Adăugați argumente (opțional)” tastați: </p> <ul> <li><strong> shadowcopy call create Volume = C: \\ </strong></li> </ul> <p> 4. Când ați terminat, faceți clic pe <strong> O.K. </strong></p></blockquote> <p><img src=\"images/image_thumb-66-640.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Faceți clic pe <strong> O.K </strong> din nou pentru a închide proprietățile sarcinii programate. </p> <p><img src=\"images/image_thumb-67-138.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Pentru a crea prima copie de rezervă, faceți clic dreapta pe sarcină și selectați <strong> Alerga </strong> . </p> <p><img src=\"images/image_thumb-68-388.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Ai terminat! De acum înainte, ori de câte ori doriți să restaurați un fișier / folder la versiunea sa anterioară, faceți clic dreapta pe acesta și selectați <strong> Restaurează versiunile anterioare </strong> . </p> <p><img src=\"images/image_thumb-69-568.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Informații utile: <br> </strong> 1. Spațiul maxim alocat care poate fi utilizat pentru stocarea copiilor shadow este cantitatea de spațiu pe care System Restore l-ar putea folosi pentru a stoca în Puncte de restaurare. <br> 2. Pentru a afla spațiul de stocare folosit și maxim alocat pentru copiile Shadow, dați această comandă în Command Prompt (Admin): </p> <ul> <li><strong> lista vssadmin shadowstorage </strong></li> </ul> <p><img src=\"images/image_thumb-76-672.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Pentru a modifica spațiul maxim alocat pentru Shadow Copies și Points Restore System, navigați la <strong> Protecția sistemului </strong> setări pentru <strong> Disc local (C :) </strong><br> 4. Dacă doriți să ștergeți toate copiile shadow salvate, trebuie să ștergeți și punctele de restaurare salvate. Dacă doriți să faceți acest lucru, faceți clic pe <strong> Ștergeți toate punctele de restaurare </strong> din setările de protecție a sistemului. </p> <p><img src=\"images/image_thumb-77-662.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}