{"title":"Cum să protejați prin parolă un folder în Windows 10 (Blocați folderul cu parolă).","content":"<p> Acest tutorial conține două metode diferite gratuite și sigure pentru a proteja prin parolă un folder în sistemul de operare Windows 10/8/7. Dacă blocați un folder cu o parolă, acesta nu va fi accesibil altcuiva decât dvs. Protejarea unui folder cu o parolă este utilă în cazurile în care vă partajați computerul cu alte persoane și nu doriți ca altcineva să vă acceseze și să vă citească fișierele private. </p> <ul> <li><strong> Articol asociat: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să vă protejați prin parolă computerul Windows 10 cu BitLocker </a> . </strong></li> </ul> <h4> Cum se blochează un folder cu o parolă în Windows 10. </h4> <h6> Metoda 1. Cum se blochează și se criptează fișiere cu 7-zip (Windows All Versions). </h6> <p> Cea mai ușoară și mai sigură metodă, de a proteja un folder cu o parolă în Windows, este utilizând utilitarul de arhivare 7-Zip, care acceptă și criptarea. Pentru a cripta și a proteja prin parolă un folder / fișier cu 7-zip: </p> <p> 1. Descărcați și instalați <a href=\"https://www.7-zip.org/\" target=\"_blank\" rel=\"nofollow noopener\"> 7-Zip </a> program de arhivare. <br> 2. Faceți clic dreapta pe folderul (sau fișierul) pe care doriți să îl protejați cu o parolă și alegeți: <strong> 7-Zip </strong> &gt; <strong> Adauga la arhiva </strong> . </p> <p><img src=\"images/image_thumb-28-978.png\" alt=\"How to Password Protect a Folder\" loading=\"lazy\"></p> <p> </p> <p> 3. La opțiunile „Adăugați la arhivă”, specificați o parolă puternică și apoi faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-29-728.png\" alt=\"set password to archive with 7-zip\" loading=\"lazy\"></p> <p> </p> <p> 4. Apoi ștergeți folderul (sau fișierul) necomprimat și ați terminat! </p> <h6> Metoda 2. Cum se criptează un folder cu protecție EFS (Windows Pro și Enterprise). </h6> <p> EFS Protection este un instrument de criptare încorporat, în edițiile Windows 10 Professional și Enterprise. Dacă protejați un folder sau un fișier cu criptare EFS, este foarte dificil pentru alții să acceseze fișierele criptate, fără a avea cheia de decriptare (cheie certificat PFX). </p> <p> Singurul dezavantaj al criptării EFS este că criptarea va fi eliminată dacă copiați fișierele criptate pe un alt computer din rețea sau dacă trimiteți prin e-mail fișierele criptate. </p> <p> În plus, atunci când vă criptați fișierele EFS, cheia de decriptare (certificat) este stocată local pe computer. Aceasta înseamnă că oricine are parola dvs. va avea acces și la fișierele dvs. criptate. Din acest motiv, dacă vă criptați fișierele cu criptarea EFS, specificați o parolă de conectare puternică și nu o partajați cu alții. </p> <ul> <li><strong> Articol asociat: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se decriptează fișierele criptate EFS și se elimină criptarea EFS. </a></strong></li> </ul> <p><strong> Pentru a cripta un folder sau un fișier cu EFS: </strong><br> 1. Faceți clic dreapta pe folderul (sau fișierul) pe care doriți să îl protejați și selectați <strong> Proprietăți </strong> . <br> 2. În fila General, faceți clic pe <strong> Avansat </strong> . </p> <p><img src=\"images/image_thumb-13-582.png\" alt=\"enable efs protection\" loading=\"lazy\"></p> <p> </p> <p> 3. Selectați <strong> Criptați fișierele pentru a securiza datele </strong> și apoi faceți clic pe <strong> O.K. </strong></p> <p><img src=\"images/image_thumb-14-983.png\" alt=\"How to Lock Folder with Password - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Apoi faceți clic pe <strong> aplica </strong> și <strong> O.K </strong> din nou pentru a salva modificările și a ieși. <br> 5. În acest moment, Windows vă va solicita să faceți backup cheii de recuperare. Clic <strong> Faceți backup cheii de criptare a fișierului. </strong></p> <p><img src=\"images/image_thumb-2-823.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Apoi faceți clic pe <strong> Faceți backup acum (recomandat) </strong> și salvați cheia certificatului de decriptare pe o unitate USB. </p> <p><img src=\"images/image_thumb-15-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. La expertul Export certificat faceți clic pe <strong> Următorul </strong> în ecranul de întâmpinare. <br> 8. Apoi faceți clic pe <strong> Următorul </strong> din nou la ecranul Export File Format. </p> <p><img src=\"images/image_thumb-4-842.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. La opțiunile de securitate: </p> <blockquote> <p> 1. <strong> Verifica </strong> <strong> Parola </strong> cutie. <br> 2. Tastați o parolă pentru cheia certificatului exportat. <br> 3. Selectați <strong> AES256-SHA256 </strong> criptare <br> 4. Faceți clic pe <strong> Următorul </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-16-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. Faceți clic pe <strong> Naviga </strong> și <strong> Salvați </strong> fișierul certificat (.pfx) de pe computer. <br> 11. Când ați terminat, faceți clic pe <strong> Următorul </strong> a continua. </p> <p><img src=\"images/image_thumb-17-804.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. În cele din urmă faceți clic pe <strong> finalizarea </strong> . </p> <p><img src=\"images/image_thumb-18-449.png\" alt=\"image\" loading=\"lazy\"></p> <p> 13. Când exportul este finalizat, salvați cheia certificatului exportat (fișierul .pfx) într-o altă locație sigură (de ex. Pe un disc USB). </p> <p><strong> BACSIS: </strong> Când criptați un folder (sau fișiere) cu EFS, cheia de decriptare (certificat) este stocată în folderul de profil al utilizatorului. Deci, dacă un alt utilizator are parola dvs. de conectare la Windows, poate deschide și citi fișierele criptate. Pentru a evita acest lucru, nu partajați parola de conectare sau eliminați (dezinstalați) certificatul de decriptare din profilul dvs. când părăsiți computerul și reinstalați-l când reveniți. * </p> <p> * Notă: pentru a elimina și reimporta cheia de recuperare (certificat), accesați: </p> <blockquote> <p> A. <strong> Panou de control </strong> &gt; <strong> Optiuni de internet. <br> </strong> b. La „Opțiuni Internet” faceți clic pe <strong> Conţinut </strong> fila și apoi faceți clic pe <strong> Certificat </strong> s. <br> c. În fila „Personal” faceți clic pe <strong> Elimina </strong> , pentru a elimina cheia de decriptare (certificat) sau faceți clic pe <strong> Import </strong> pentru a reinstala certificatul de decriptare de pe unitatea USB. </p> </blockquote> <ul> <li> <p><strong> Articol asociat: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"noopener noreferrer\"> Cum se decriptează fișierele criptate EFS și se elimină criptarea EFS. </a></strong></p> </li> </ul> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție </p>"}