{"title":"Cum să găsiți Windows Media Player în Windows 10.","content":"<p> De mulți ani, Windows Media Player a fost aplicația implicită pentru redarea de muzică și videoclipuri. În Windows 10, Windows Player nu mai este, playerul implicit pentru fișierele media și a fost înlocuit cu aplicația „Filme și TV”. </p> <p> Acest articol este scris pentru toți utilizatorii care doresc să găsească și să utilizeze Windows Media Player clasic, ca player implicit pentru redarea muzicii și videoclipurilor lor. </p> <h4> Cum să găsiți Windows Media Player în Windows 10. </h4> <p> Cel mai rapid mod de a afla, dacă Windows Media Player este instalat pe computerul dvs., este căutarea acestuia. Pentru a face asta: </p> <p> 1. În caseta de căutare Cortana, tastați <strong> Windows Media Player </strong> . <br> 2. Dacă Windows Media Player este listat pe rezultate, atunci faceți clic pe acesta pentru a lansa programul. (Dacă nu este listat, continuați mai jos ...) </p> <p><img src=\"images/image_thumb-66-377.png\" alt=\"How to Find Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> BACSIS: </strong> Pentru a seta Windows Media Player, ca player implicit pentru videoclipurile și muzica dvs.: </p> <blockquote><p> 1. Navigați la <strong> start </strong> -&gt; <strong> Setări </strong> -&gt; <strong> Aplicații </strong> și selectați <strong> Aplicații implicite </strong> la stânga. <br> 2. La <strong> Music Player </strong> opțiuni, faceți clic pe <strong> Groove Music </strong> și apoi selectați <strong> Windows Media Player </strong> . <br> 3. <strong> La opțiunile Video Player </strong> , faceți clic pe <strong> Filme și TV </strong> și apoi selectați <strong> Windows Media Player </strong> . </p> <p><img src=\"images/image_thumb-72-358.png\" alt=\"set windows media player default widnows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h4> Cum se instalează Windows Media player în Windows 10 Home, Pro. </h4> <p> Dacă Windows Media Player nu este listat, îl puteți instala accesând: </p> <p> 1. <strong> Panou de control </strong> -&gt; <strong> Programe si caracteristici </strong> . <br> 2. Faceți clic pe <strong> Activați sau dezactivați funcțiile Windows </strong> din stânga. </p> <p><img src=\"images/image_thumb-68-342.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. La <strong> Caracteristici media </strong> , selectează <strong> Windows Media Player </strong> și apăsați <strong> O.K </strong> . * </p> <p> * Notă: Dacă dețineți versiunea Windows 10 N sau KN sau nu puteți instala Windows Media Player din „caracteristicile Windows”, continuați să citiți mai jos ... </p> <p><img src=\"images/image_thumb-69-565.png\" alt=\"How to Install Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cum să descărcați și să instalați Windows Media player în versiunile Windows 10 Home, Pro, N și KN. </h4> <p> Dacă nu puteți instala Windows Player utilizând instrucțiunile de mai sus sau dacă dețineți Windows 10 N sau KN, puteți descărca Windows Media Player pentru Windows 10, urmând instrucțiunile de mai jos: </p> <p> 1. Descărcați fișierul <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48231\" target=\"_blank\" rel=\"nofollow noopener\"> Media Feature Pack pentru versiunile N și KN ale Windows 10 </a> . </p> <p> * Notă: Descărcați fișierul <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package.msu </strong> pentru <strong> Sistem de operare pe 32 de biți, </strong> si <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package_x64.msu </strong> pentru <strong> Sistem de operare pe 64 de biți. </strong></p> <p> 2. Rulați fișierul descărcat și faceți clic <strong> da </strong> la primul ecran. </p> <p><img src=\"images/image_thumb-70-480.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Accept </strong> Acordul de licență și apoi așteptați până la finalizarea instalării. </p> <p><img src=\"images/image_thumb-71-400.png\" alt=\"download windows media player windows 10\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}