{"title":"Cum să vizualizați antetele mesajelor fără a deschide mesajul de e-mail în Outlook 2016/2019.","content":"<p> După cum probabil știți, „Anteturi de mesaje” (alias „Sursă mesaj” sau „Anteturi Internet” în Outlook) conține toate detaliile tehnice ale unui mesaj de e-mail primit. Mai precis, „Anteturile mesajului” unui mesaj de poștă electronică conțin, pe lângă informațiile obișnuite (expeditor, timp de trimitere etc.), software-ul folosit pentru a compune mesajul și serverele care au trecut înainte ca acesta să vă fie livrat. . </p> <p> Pentru a vizualiza Sursa / antetele mesajului în aplicația desktop Microsoft Outlook, puteți utiliza unul dintre următoarele moduri: </p> <ol> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să vizualizați antetele mesajului în Outlook 2016/2019 după deschiderea mesajului de e-mail </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să vizualizați antetele mesajului în Outlook 2016/2019 fără a deschide mesajul de e-mail. </a></li> </ol> <p> </p> <h2> Cum să vizualizați antetele mesajelor în Outlook 2016/2019 după deschiderea e-mailului. </h2> <p> Modul obișnuit de a afișa sursa mesajului unui mesaj de e-mail în Microsoft Outlook 2016/2019 este să deschideți e-mailul și să vizualizați proprietățile acestuia: </p> <p> 1. Deschideți mesajul de e-mail (pe propria fereastră) și faceți clic pe <strong> Fişier </strong> meniul. </p> <p><img src=\"images/image_thumb-36-771.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Din <strong> Fişier </strong> meniu, faceți clic pe <strong> Proprietăți </strong> . </p> <p><img src=\"images/image_thumb-37-974.png\" alt=\"View message headers outlook\" loading=\"lazy\"></p> <p> </p> <p> 3. Uită-te la <strong> Anteturi Internet, </strong> pentru a vizualiza sursa mesajului e-mailului (detalii). </p> <p> * Notă: Selectați și copiați textul antetelor Internetului în Notepad, pentru o citire mai ușoară. </p> <p><img src=\"images/image_thumb-38-976.png\" alt=\"View Internet headers in Outlook\" loading=\"lazy\"></p> <p> </p> <h2> Cum să vizualizați antetele mesajului în Outlook 2016/2019 fără a deschide mesajul de e-mail. </h2> <p> Problema vizualizării sursei mesajului (anteturi Internet) după deschiderea mesajului e-mail este că, dacă mesajul conține un malware, puteți expune computerul la risc. Pentru a evita acest lucru, continuați și urmați instrucțiunile de mai jos pentru a putea citi sursa mesajului fără a deschide e-mailul. </p> <p> 1. În fereastra principală Outlook, alegeți <strong> Fişier </strong> -&gt; <strong> Opțiuni </strong> . <br> 2. Selectați <strong> Personalizați panglica </strong> în stânga și în dreapta: </p> <p> A. La <strong> Alegeți comenzi din </strong> lista derulantă, selectați <strong> Comenzile nu sunt în panglică. <br> </strong> b. Asigurați-vă că în fila principală <strong> Acasă (Mail) </strong> este selectat și faceți clic pe <strong> Grup nou </strong> și apoi faceți clic pe <strong> Redenumiți. </strong></p> <p><img src=\"images/image_thumb-39-295.png\" alt=\"How to view the Message Headers in Outlook 2016-2019 \" loading=\"lazy\"></p> <p> c. <strong> Redenumiți </strong> &quot; <strong> Grup nou </strong> &quot; la &quot; <strong> Anteturi Internet </strong> &quot;și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-40-856.png\" alt=\"image\" loading=\"lazy\"></p> <p> d. Acum alegeți <strong> Opțiuni pentru mesaje </strong> din lista de comenzi și faceți clic <strong> Adăuga </strong> . </p> <p><img src=\"images/image_thumb-41-344.png\" alt=\"image\" loading=\"lazy\"></p> <p> e. Acum ar trebui să vedeți „Opțiuni pentru mesaje” sub noul grup pe care l-ați creat („Anteturi Internet”). Clic <strong> O.K </strong> pentru a aplica modificări <strong> . </strong></p> <p><img src=\"images/image_thumb-42-209.png\" alt=\"view message source without opening email outlook\" loading=\"lazy\"></p> <p> 3. Acum pe <strong> Acasă </strong> , ar trebui să vedeți un nou buton numit „Opțiuni pentru mesaje - Anteturi Internet”. <br> 5. De acum înainte, trebuie doar să evidențiați mesajul pe care doriți să-l vizualizați sursa mesajului și să faceți clic pe butonul „Opțiuni mesaj” pentru a vizualiza sursa acestuia fără a fi nevoie să deschideți mesajul pe propria fereastră. </p> <p><img src=\"images/image_thumb-43-460.png\" alt=\"view headers without opening email outlook\" loading=\"lazy\"></p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}