{"title":"FIX: Scurgere baterie în Windows 10 (rezolvat)","content":"<p> Cu Windows 10, mulți utilizatori se plâng că bateria laptopului lor se descarcă rapid chiar și cu o utilizare redusă sau chiar într-o oprire completă. Această problemă de „descărcare a bateriei” din Windows 10 se întâmplă, din două motive de bază. Primul motiv este că Windows 10 încarcă prea multe aplicații de fundal care consumă bateria, chiar dacă nu sunt utilizate. </p> <p> Următorul motiv, care cauzează descărcarea bateriei, chiar și în timpul opririi complete, este caracteristica „Start rapid”. Windows 10 (și Windows 8 / 8.1) a activat în mod implicit funcția „Pornire rapidă”, care permite sistemului să pornească și să pornească mai repede. De fapt, atunci când „Pornirea rapidă” este activată, Windows 10 nu efectuează o oprire completă a sistemului și reia din starea de hibernare. </p> <p> În acest tutorial veți găsi instrucțiuni, pentru a împiedica Windows 10 să descarce energia bateriei. </p> <h4> Cum se remediază problema de scurgere a bateriei în Windows 10. </h4> <p> </p> <h6> Pasul 1. Împiedicați aplicațiile să ruleze în fundal. </h6> <p> Primul pas, pentru a rezolva problema de descărcare a bateriei în Windows 10, este să evite aplicațiile să ruleze în fundal. Pentru a dezactiva aplicațiile de fundal: </p> <p> 1. Navigați la <strong> start </strong> -&gt; <strong> Setări </strong> -&gt; <strong> Confidențialitate </strong> . <br> 2. Selectați <strong> Aplicații de fundal </strong> în stânga și apoi în partea dreaptă, puneți „ <strong> Lăsați aplicațiile să ruleze în fundal &quot; </strong> schimba cu <strong> Off, </strong> sau alegeți individual aplicațiile pe care nu doriți să le rulați pe fundal și dezactivați-le. </p> <p><img src=\"images/image_thumb-8-676.png\" alt=\"Prevent Apps from Running in the Background - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Pasul 2. Porniți economisirea bateriei. </h6> <p> Următorul pas este de a activa economisirea bateriei pentru a prelungi durata de viață a bateriei prin limitarea activității de fundal. </p> <p> 1. Navigați la <strong> start </strong> -&gt; <strong> Setări </strong> -&gt; <strong> Sistem </strong> . <br> 2. La <strong> Baterie </strong> Opțiuni: </p> <blockquote> <p> A. Faceți clic pe „Vedeți ce aplicații vă afectează durata de viață a bateriei”, pentru a afla utilizarea bateriei din aplicațiile deschise. <br> b. <strong> Verifica </strong> &quot; <strong> Activați automat economisirea bateriei dacă bateria mea nu funcționează mai jos &quot; </strong> bifați caseta de selectare și mutați glisorul într-o poziție adecvată. <br> c. În plus, selectați „Reduceți luminozitatea ecranului în timpul economisirii bateriei. </p> </blockquote> <p><img src=\"images/image_thumb-9-289.png\" alt=\"turn on battery saver Windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Pasul 3. Dezactivați pornirea rapidă. </h6> <p> Următorul pas este de a forța Windows 10 să se închidă complet, dezactivând funcția de pornire rapidă. </p> <p> 1. Navigați la <strong> start </strong> -&gt; <strong> Setări </strong> -&gt; <strong> Sistem </strong> . <br> 2. La <strong> Putere </strong> opțiuni faceți clic <strong> Setări suplimentare de alimentare. </strong></p> <p><img src=\"images/image_thumb-10-405.png\" alt=\"FIX Battery Drain in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Selectați <strong> Alegeți ce fac butoanele de pornire </strong> la stânga. </p> <p><img src=\"images/image_thumb-11-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Apoi faceți clic pe <strong> Modificați setările care nu sunt disponibile în prezent </strong> . </p> <p><img src=\"images/image_thumb-12-235.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> Debifează </strong> <strong> Activați pornirea rapidă (recomandat) </strong> și faceți clic pe <strong> Salvează modificările. * </strong></p> <p> * Notă: Dacă opțiunea de pornire rapidă a fost deja debifată, verificați-o și reporniți computerul. După repornire debifați-l și reporniți computerul din nou. </p> <p><img src=\"images/image_thumb-13-410.png\" alt=\"Turn Off Fast Startup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Repornire </strong> computerul tau. </p> <h6></h6> <h6> Pasul 4. Dezactivează Hibernare. </h6> <p> „Hibernare” este o caracteristică de alimentare, care folosește mai puțină energie decât somnul și când porniți din nou computerul, vă întoarceți la locul unde ați oprit. În unele cazuri, funcția de hibernare face ca computerul Windows 10 să nu se oprească complet. Pentru a dezactiva hibernarea: </p> <p> </p> <p> 1. În caseta de căutare tastați: <strong> prompt de comandă </strong> sau <strong> cmd <br> </strong> 2. Faceți clic dreapta la <strong> Prompt Command și selectați Run as Administrator </strong></p> <p><img src=\"images/image_thumb-14-379.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. La promptul de comandă, dați următoarea comandă și apăsați <strong> Introduce. </strong></p> <ul> <li><strong> powercfg -h off </strong></li> </ul> <p><img src=\"images/image_thumb-15-234.png\" alt=\"Disable Hibernate Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. <strong> Repornire </strong> computerul tau. * </p> <p> * Notă: dacă doriți să reactivați caracteristica „Hibernare”, tastați doar această comandă în linia de comandă administrativă: </p> <ul> <li> <ul> <li> powercfg -h off </li> </ul> </li> </ul> <p> </p> <h6> Pasul 5. Modificați setările de alimentare pe adaptorul de rețea. </h6> <p> Următoarea metodă de remediere a problemei de descărcare a bateriei în Windows 10 este modificarea setărilor de alimentare de pe adaptoarele de rețea. </p> <p> 1. Deschideți <strong> Manager de dispozitiv </strong> . <br> 2. Extindeți <strong> Adaptoare de rețea </strong> . <br> 3. Faceți clic dreapta pe adaptorul de rețea instalat și selectați <strong> Proprietăți </strong> . <br> 3. Selectați <strong> Gestionare a energiei </strong> filă. <br> 4. <strong> Debifează </strong> <strong> „Permiteți acestui dispozitiv să trezească computerul </strong> &#39;caseta de selectare și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-7-574.png\" alt=\"modify power settings\" loading=\"lazy\"></p> <h6></h6> <h6> Pasul 6. Reveniți la driverul de interfață al motorului de management Intel. </h6> <p> Dacă problema de descărcare a bateriei apare după instalarea unei actualizări Windows 10, continuați și reveniți la driverul pentru interfața Intel Management Engine. Pentru a face asta: </p> <p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-592.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați: <strong> devmgmt.msc </strong> &amp; faceți clic pe <strong> O.K </strong> . <br> 3. Extindeți <strong> Dispozitive de sistem </strong> . <br> 4. Faceți clic dreapta pe <strong> Managementul interfeței motorului Intel </strong> și selectați <strong> Proprietăți </strong> . </p> <p><img src=\"images/image_thumb-5-532.png\" alt=\"device properties\" loading=\"lazy\"></p> <p> </p> <p> 5. Selectați fila Driver și faceți clic pe <strong> Reduceți driverul </strong> . * </p> <p> </p> <p> * Dacă <strong> Reduceți driverul </strong> butonul este gri, apoi navigați la site-ul de asistență al producătorului laptopului sau plăcii de bază pentru a descărca și instala o versiune mai veche de driver pentru interfața Intel Management Engine. </p> <p><img src=\"images/image_thumb-6-551.png\" alt=\"roll back driver\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Repornire </strong> computerul tau. </p> <h6> Pasul 7. Alte sugestii pentru rezolvarea problemei de scurgere a bateriei. </h6> <p> 1. Înlocuiți încărcătorul laptopului și folosiți întotdeauna un încărcător de marcă, pentru a prelungi durata de viață a bateriei. <br> 2. Dacă bateria laptopului dvs. este veche, probabil că capacitatea acestuia a scăzut și ar trebui înlocuită. Pentru a diagnostica starea de sănătate a bateriei, utilizați <a href=\"http://www.nirsoft.net/utils/battery_information_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> BatteryInfoView </a> utilitate. </p> <p><img src=\"images/image_thumb-16-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această problemă. </p>"}