{"title":"FIX: Eroare 0x80248007 în Windows 10 Update (rezolvată)","content":"<p> Pe un computer bazat pe Windows 10, este posibil să primiți următorul mesaj de eroare atunci când încercați să instalați Actualizări: „Au existat unele probleme la instalarea actualizărilor, dar vom încerca din nou mai târziu. Dacă continuați să vedeți acest lucru și doriți să căutați informații pe web sau să contactați asistența, acest lucru vă poate ajuta: (0x80248007) &quot;. Eroarea de actualizare Windows 10 0x80248007 apare de obicei dacă fișierele Windows Update sunt corupte sau dacă Windows nu poate primi actualizări din cauza rețelei probleme. </p> <p><img src=\"images/image_thumb-14-418.png\" alt=\"FIX Error 0x80248007 in Windows 10 Update \" loading=\"lazy\"></p> <p> </p> <p> Acest tutorial conține instrucțiuni pentru depanarea erorii 0x80248007 în timpul instalării actualizărilor în Windows 10. </p> <h4> Cum se rezolvă eroarea 0x80248007 în Windows 10 Update. </h4> <h6> Pasul 1. Scanați computerul pentru viruși. </h6> <p><strong> Important: </strong> Multe viruși sau programe rău intenționate pot cauza probleme cu actualizarea Windows. Deci, înainte de a continua cu pașii de depanare de mai jos, utilizați acest lucru <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Ghid de scanare și eliminare a programelor malware </a> pentru a verifica și a elimina viruși sau / și programe rău intenționate care pot rula pe computer. </p> <p> </p> <h6> Pasul 2. Rulați instrumentul de depanare Windows Update. </h6> <p> 1. Navigați la Windows <strong> Panou de control </strong> , setați „Vizualizare după” la <strong> Icoane mici </strong> și deschis <strong> Depanare. </strong></p> <p><img src=\"images/image_thumb-5-564.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. În Opțiuni de depanare, faceți clic pe <strong> Remediați problemele cu Windows Update. </strong></p> <p><img src=\"images/image_thumb-9-777.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Faceți clic pe <strong> Următorul </strong> pentru a depana problemele de actualizare Windows. </p> <p><img src=\"images/image_thumb-8-840.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Când procesul de depanare este finalizat, <strong> închide </strong> instrumentul de depanare și <strong> repornire </strong> computerul dvs. <br> 6. Verificați dacă există actualizări. </p> <h6> Pasul 3. „Reconstruiți” folderul SoftwareDistribution. </h6> <p> „ <strong> Distribuirea software-ului </strong> &quot;folder (C: WindowsSoftwareDistribution), este locația în care Windows stochează actualizările Windows. Uneori acest folder este corupt și trebuie să-l recreați, pentru a descărca și instala actualizări de la zero. Pentru a reconstrui (recrea) folderul „SoftwareDistribution” urmează pașii de mai jos: </p> <p> 1. Deschideți panoul de control Servicii Windows: Pentru aceasta: </p> <ul> <li> Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-939.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă Run. </li> <li> În caseta Căutare, tastați: <strong> services.msc </strong> &amp; faceți clic pe <strong> O.K </strong> . </li> <li> (Acceptați avertismentul UAC dacă apare). </li> </ul> <p><img src=\"images/image_thumb14_thumb_thumb-709.png\" alt=\"image_thumb[14]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 2. În panoul de control Servicii localizați <strong> Windows Update </strong> serviciu. <br> 3. Faceți clic dreapta pe <strong> Windows Update </strong> serviciu și selectați <strong> Stop </strong> . </p> <p><img src=\"images/image_thumb7_thumb_thumb-509.png\" alt=\"image_thumb[7]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> </strong> Deschideți Windows Explorer și navigați la: <strong> C: Windows </strong> pliant. <br> 5. Găsiți și <strong> Șterge </strong> <strong> Distribuirea software-ului </strong> pliant. </p> <p> </p> <p><img src=\"images/image_thumb9_thumb_thumb-248.png\" alt=\"image_thumb[9]_thumb\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Repornire </strong> computerul dvs. și verificați dacă există actualizări. </p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}