{"title":"FIX: Problemă de utilizare a memoriei Chrome ridicate (rezolvată)","content":"<p> După cum probabil ați observat deja, Google Chrome deschide multe procese de fundal, chiar și atunci când ați deschis doar câteva ferestre / file Chrome. Acest lucru se întâmplă, deoarece Google Chrome este conceput astfel încât să creeze un proces individual pentru fiecare plugin sau extensie instalat atunci când deschideți o nouă fereastră sau filă. </p> <p> Deși deschiderea mai multor procese de pe Google Chrome este un comportament normal, este de fapt o problemă, deoarece acest comportament cauzează multă utilizare a memoriei și face computerul să nu mai răspundă. </p> <p><img src=\"images/image_thumb-17-610.png\" alt=\"FIX: Multiple Processes in Chrome with High Memory Usage\" loading=\"lazy\"></p> <p> </p> <p> Acest tutorial conține instrucțiuni pas cu pas despre cum să împiedicați Chrome să deschidă mai multe procese pentru fiecare fereastră sau filă, pentru a rezolva problema de utilizare a memoriei Chrome. </p> <h4> Cum să dezactivați mai multe procese Chrome în Windows 10. </h4> <h6> Pasul 1. Scanați computerul pentru a detecta malware și viruși. </h6> <p> Primul pas înainte de depanarea erorii „ERR_CONNECTION_CLOSED” din Chrome este să vă asigurați că sistemul dvs. nu conține viruși / programe malware. Pentru acea sarcină, urmați instrucțiunile din acest ghid: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să vă scanați computerul pentru viruși și alte programe malware. </a></p> <h6></h6> <h6> Pasul 2. Dezactivați extensiile Chrome nedorite. </h6> <p> În primul rând, verificați dacă aveți nevoie de toate extensiile Chrome instalate și dezactivați-le pe cele de care nu aveți nevoie. Pentru a face asta: </p> <p> 1. Din meniul Chrome <img src=\"images/image_thumb-47-380.png\" alt=\"image\" loading=\"lazy\"> , mergi la <strong> Mai multe unelte </strong> -&gt; <strong> Extensii </strong></p> <p><img src=\"images/image_thumb-51-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Eliminați (sau dezactivați) orice extensie de care nu aveți nevoie sau pe care nu o recunoașteți. </p> <p><img src=\"images/image_thumb-49-442.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Pasul 3. Împiedicați Chrome să ruleze în fundal când Chrome este închis. </h6> <p> 1. Din meniul Chrome <img src=\"images/image_thumb-78-665.png\" alt=\"image\" loading=\"lazy\"> Selectați <strong> Setări </strong> . </p> <p><img src=\"images/image_thumb-79-868.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> 2. La <strong> Setări </strong> pagina, derulați în jos și faceți clic <strong> Avansat </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <p> 3. Setați comutatorul „Continuați să rulați aplicații de fundal când Google Chrome este închis” <strong> OPRIT </strong> . </p> <p><img src=\"images/image_thumb-18-557.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <p> </p> <h6> Pasul 4. Împiedicați Chrome să deschidă mai multe procese pentru același site. </h6> <p> 1, <strong> Click dreapta </strong> pe <strong> Google Chrome </strong> comanda rapidă și selectați <strong> Proprietăți </strong> . <br> 2. La <strong> General </strong> fila, adăugați comutatorul „–proces-per-site” (fără ghilimele), la sfârșitul liniei țintă și faceți clic pe <strong> O.K </strong> și <strong> Continua </strong> pentru a aplica modificarea <strong> . * </strong></p> <p> de exemplu. „C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe” - proces pe site </p> <p> Notă: Există un spațiu înainte - proces-pe-site </p> <p><img src=\"images/image_thumb-19-818.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Pasul 5. Dezactivați izolarea site-ului Google Chrome. </h6> <p> În modul de izolare a site-ului, Chrome va încărca fiecare site în propriul proces. Aceasta este de fapt o caracteristică de securitate suplimentară pentru a preveni ca un site web să vă fure datele de pe un alt site web care este deschis către o altă fereastră / filă. Dar, modul „Izolarea site-ului” va crește utilizarea memoriei Chrome cu aproximativ 10%. </p> <p> 1. În bara de adrese Chrome, tastați <a href=\"//flags/#site-isolation-trial-opt-out\" target=\"_blank\" rel=\"nofollow noopener\"> chrome: // flags / # site-isolation-trial-opt-out </a> și faceți clic pe Enter. </p> <p> 2. Setați <strong> Dezactivați izolarea site-ului </strong> modul de a <strong> Dezactivat </strong> și apoi faceți clic pe <strong> Relansați acum </strong> . * </p> <p> * Notă: </p> <p><img src=\"images/image_thumb-20-397.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? </p> <p> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}