{"title":"FIX: EROARE FATALĂ VIDEO DXGKRNL în Windows 10 (rezolvat)","content":"<p> Dacă vă confruntați cu eroarea de ecran albastru „VIDEO DXGKRNL FATAL ERROR” în Windows 10, urmați instrucțiunile de mai jos pentru a remedia problema. </p> <p> Eroarea BSOD Windows 10 &quot; <em> PC-ul dvs. a întâmpinat o problemă și trebuie să repornească. Doar colectăm câteva informații despre erori și apoi vom reporni pentru dvs. Dacă doriți să aflați mai multe, puteți căuta online mai târziu această eroare: VIDEO DXGKRNL EROARE FATALĂ &quot;, </em> indică de obicei o problemă cu driverele video. </p> <p><img src=\"images/image_thumb-7-129.png\" alt=\"FIX: VIDEO DXGKRNL FATAL ERROR in Windows 10\" loading=\"lazy\"></p> <p> Acest tutorial conține instrucțiuni pas cu pas pentru a rezolva eroarea de ecran albastru „VIDEO DXGKRNL FATAL ERROR” din Windows 10. </p> <h2> Cum se remediază: Windows 10 VIDEO DXGKRNL EROARE FATALĂ. </h2> <h3> Pasul 1. Remediați VIDEO DXGKRNL FATAL ERROR prin dezinstalarea / reinstalarea driverelor video. </h3> <p> 1. Deschideți <strong> Manager de dispozitiv </strong> . Pentru a face asta: </p> <ol> <li> <ol> <li> Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-153.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. </li> <li> În caseta „Deschidere”, tastați: <strong> devmgmt.msc </strong> &amp; faceți clic <strong> O.K </strong> . </li> </ol> </li> </ol> <blockquote> <p><img src=\"images/image_thumb-5-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p></blockquote> <p> 2. <strong> Extinde </strong> <strong> Adaptoare de afișaj. <br> </strong> 3. <strong> Click dreapta </strong> pe adaptorul (adaptoarele) de afișaj instalat și selectați <strong> Dezinstalați dispozitivul. </strong></p> <p><img src=\"images/image_thumb-46-240.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. În fereastra următoare, dacă aveți opțiunea: &quot; <strong> Ștergeți software-ul driverului pentru acest dispozitiv </strong> &quot;, selectați-l și apoi faceți clic pe <strong> O.K </strong> pentru a elimina driverele instalate de pe computer. </p> <p> 5. După dezinstalare, <strong> repornire </strong> computerul și navigați la <strong> Manager de dispozitiv </strong> din nou. <br> 6. Faceți clic dreapta pe numele computerului (în partea de sus) și selectați <strong> Căutați modificări hardware. </strong></p> <p><img src=\"images/image_thumb-8-911.png\" alt=\"Scan for hardware changes\" loading=\"lazy\"></p> <p> </p> <p> 7. Lăsați Windows să detecteze și să instaleze driverele de afișare și apoi <strong> repornire </strong> computerul din nou și verificați dacă „VIDEO DXGKRNL FATAL ERROR” persistă. * </p> <p> * Notă: Dacă Windows nu poate instala automat driverele de afișare automat sau dacă încă vă confruntați cu o eroare de ecran albastru, continuați cu pasul următor. </p> <p> </p> <h3><br clear=\"all\"> Pasul 2. Reinstalați driverele video de pe site-ul producătorului. </h3> <p> 1. Navigați la <strong> Manager de dispozitiv </strong> și <strong> dezinstalați </strong> adaptorul de afișaj instalat. * </p> <p> * Notă: dacă dețineți un laptop cu două (2) adaptoare de afișare, dezinstalați-le pe ambele. </p> <p> 2. Accesați site-ul de asistență al producătorului computerului (sau plăcii grafice) și descărcați cele mai recente drivere pentru plăci grafice. </p> <ul> <li> <ul> <li> Pentru <strong> NVIDIA </strong> GPU-uri bazate pe, navigați la <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Pagina Căutare avansată a driverelor NVIDIA </a> . </li> <li> Pentru <strong> AMD </strong> GPU-uri bazate pe, navigați la <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Centrul de descărcare a driverelor AMD (ATI). </a></li> <li> Pentru <strong> Intel </strong> GPU-uri bazate pe, navigați la <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Centrul de descărcare Intel Graphics. </a></li> </ul> </li> </ul> <p> 3. Continuați și instalați driverul descărcat. * </p> <p><strong> * Notă importantă: </strong> Dacă dețineți un laptop cu două (2) adaptoare de afișare, procedați mai întâi la instalarea driverelor pentru adaptorul AMD sau NVIDIA și reporniți laptopul. După repornire, continuați și instalați driverele pentru adaptorul de afișaj INTEL și apoi reporniți din nou laptopul. </p> <p> 4. După instalare, <strong> repornire </strong> computerul și verificați dacă EROAREA FATALĂ VIDEO DXGKRNL este rezolvată. Dacă nu, treceți la pasul următor. </p> <p> </p> <h3><br clear=\"all\"> Pasul 3. Reparați DirectX pentru a remedia VIDEO DXGKRNL EROARE FATALĂ. </h3> <p> EROAREA FATALĂ VIDEO DXGKRNL, indică o problemă la driverele Microsoft DirectX. Deci, continuați repararea DirectX. </p> <p> 1. Descărcați fișierul <a href=\"https://www.microsoft.com/en-us/download/details.aspx?displaylang=en&id=35\" target=\"_blank\" rel=\"nofollow noopener\"> Instalator Web Runtime pentru utilizatorul final DirectX </a> . <br> 2. Rulați fișierul descărcat (dxwebsetup.exe) și urmați instrucțiunile de pe ecran pentru a instala componentele opționale DirectX Runtime. </p> <p><img src=\"images/image_thumb-9-847.png\" alt=\"Install DirectX Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Când instalarea este finalizată <strong> repornire </strong> computerul dvs. </p> <p> 4. După repornire, accesați <strong> start <img src=\"images/image_thumb-55-571.png\" alt=\"image\" loading=\"lazy\"> -&gt; Setări </strong> -&gt; <strong> Actualizare și securitate -&gt; </strong> și faceți clic pe <strong> Verifică pentru actualizări. </strong></p> <p><img src=\"images/image_thumb-76-281.png\" alt=\"Windows 10 - Check For Updates \" loading=\"lazy\"></p> <p> 5. După instalarea actualizărilor, reporniți din nou computerul și verificați dacă eroarea BSOD este rezolvată. Dacă nu, treceți la pasul următor. </p> <p> </p> <h3><br clear=\"all\"> Pasul 4. Reparați fișierele de sistem Windows 10. </h3> <p> 1. Deschideți <strong> Prompt comandă ca administrator </strong> . <br> 2. În promptul de comandă, dați următoarea comandă și apăsați <strong> Introduce: </strong></p> <ul> <li><strong> DISM.exe / Online / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-176.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Când operațiunea DISM este finalizată, tastați următoarea comandă și apăsați <strong> introduce </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-464.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Acum așteptați până când System File Checker repară fișierele de sistem Windows. <br> 5. Când se face acest lucru, <strong> repornire </strong> computerul dvs. și verificați dacă eroarea persistă. </p> <p> </p> <h3><br clear=\"all\"> Pasul 5. Analizați fișierul jurnal Minidump (BSOD). </h3> <p> Când Windows se blochează cu un ecran albastru, stochează detaliile ecranului BSoD în fișierele mici, care se numesc „ <strong> MiniDump </strong> &quot;. Analiza <strong> Minidump </strong> fișierele vă pot ajuta să depanați și să rezolvați problema ecranului albastru VIDEO DXGKRNL FATAL ERROR. Pentru a realiza această sarcină, urmați instrucțiunile din acest articol: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se analizează fișiere MiniDump cu BlueScreenView </a> . </p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}