{"title":"FIX: Nu se poate termina procesul. Operațiunea nu a putut fi finalizată, accesul este refuzat.","content":"<p> Dacă nu puteți termina un proces sau un serviciu în Windows, deoarece primiți eroarea „Imposibil de terminat procesul. Operațiunea nu a putut fi finalizată, accesul este refuzat”, apoi continuați să citiți mai jos, pentru a afla cum să remediați problema. </p> <p><img src=\"images/image_thumb-10-874.png\" alt=\"Unable to terminate process. Access is denied\" loading=\"lazy\"></p> <p> Modul obișnuit de a opri un proces în execuție în Windows este să deschideți Task Manager, să faceți clic dreapta pe numele procesului și să selectați „Terminați sarcina”. Dar, după cum știți, uneori este imposibil să opriți un proces, deoarece primiți mesajul &quot;Imposibil de terminat procesul. Accesul este refuzat&quot;. </p> <p> În mod similar, este posibil să întâmpinați o problemă similară dacă doriți să opriți un serviciu și nu puteți, deoarece opțiunea „Stop” este în gri sau pentru că primiți eroarea „Nu se poate opri serviciul. serviciu. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"Unable to Terminate Service\" loading=\"lazy\"></p> <p> În acest tutorial veți afla cum să încheiați orice servicii sau procese pe care nu le puteți termina utilizând căile obișnuite. </p> <h4> Cum se oprește forțat orice serviciu sau program de la PowerShell în sistemul de operare Windows 10/8/7. </h4> <ul> <li><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să forțați închiderea oricărei aplicații din PowerShell. </a></li> <li><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să forțați închiderea oricărui serviciu din PowerShell. </a></li> </ul> <h6></h6> <h6> Partea 1. Cum se termină o aplicație din PowerShell. </h6> <p> 1. Deschideți PowerShell ca administrator. </p> <p> 2. În PowerShell, tastați următoarea comandă pentru a obține ID-ul procesului (PID). </p> <ul> <li><strong> listă de tasklist </strong></li> </ul> <p><img src=\"images/image_thumb-12-275.png\" alt=\"Terminate process from powershell\" loading=\"lazy\"></p> <p> </p> <p> 3. Notați numele aplicației pe care doriți să o ștergeți și apoi tastați următoarea comandă pentru a închide toate instanțele aplicației. * </p> <ul> <li> Stop-Process -Name &quot;Application_Name&quot; </li> </ul> <p> * Notă: În Application_Name, tastați numele aplicației fără extensia .exe. De exemplu, dacă doriți să închideți forțat aplicația „chrome.exe”, tastați: </p> <ul> <li><em> Stop-Process -Name &quot;chrome&quot; </em></li> </ul> <p><img src=\"images/image_thumb-16-974.png\" alt=\"Stop Program PowerShell\" loading=\"lazy\"></p> <p> </p> <p><strong> BACSIS: </strong> Dacă doriți să încheiați o singură instanță a unui program, tastați următoarea comandă: </p> <ul> <li> Stop-Process -ID PID </li> </ul> <p> * Notă: la PID tastați numărul unic al instanței de program. </p> <p> </p> <h6> Partea 2. Cum să reziliați un serviciu din PowerShell. </h6> <p> 1. Deschideți managerul de activități și din <strong> Servicii </strong> filă, observați <strong> PID </strong> a serviciului pe care doriți să îl opriți. </p> <p><em> de exemplu. În acest exemplu vom forța să oprim serviciul &quot;AdobeARMservice&quot; cu PID <strong> 1640 </strong> . </em></p> <p><img src=\"images/image_thumb-14-150.png\" alt=\"Force Stop Service PowerShell\" loading=\"lazy\"></p> <p> </p> <p> 2. Apoi, fugi <strong> PowerShell ca administrator </strong> și tastați această comandă: </p> <ul> <li> kill -id PID </li> </ul> <p> * Notă: ca PID tastați PID pe care l-ați observat în Task Manager. În acest exemplu comanda va fi: </p> <ul> <li><em> ucide -id 1640 </em></li> </ul> <p><img src=\"images/image_thumb-15-147.png\" alt=\"Kill Running Service from PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}