{"title":"FIX: Duplicați numele de utilizator în ecranul de conectare după actualizarea Windows 10.","content":"<p> Acest tutorial conține mai multe metode de remediere a problemei cu numele de utilizator duplicat în ecranul de conectare după actualizarea Windows 10. Problema „numele de utilizator duplicat în ecranul de conectare” este raportată de mulți utilizatori și cauzată după instalarea actualizărilor pe Windows 10. </p> <p><img src=\"images/image_thumb-44-494.png\" alt=\"FIX: Duplicate User Names in Sign-in Screen Windows 10\" loading=\"lazy\"></p> <p> Problemă în detalii: După ce vă redenumiți computerul sau după ce ați instalat actualizări în Windows 10, sistemul nu se conectează automat în contul dvs. de utilizator cu eroare &quot;numele de utilizator sau parola sunt incorecte. Încercați din nou&quot; și în același timp apare numele dvs. de utilizator de două ori în ecranul de conectare. </p> <h4> Cum se remediază: Ecranul de conectare Windows 10 arată același utilizator de două ori. </h4> <h6> Metoda 1. Eliminați Contul duplicat din opțiunile Contului utilizatorului. </h6> <p> Prima metodă pentru a elimina numele de utilizator duplicat de pe ecranul de autentificare este de a șterge contul duplicat de pe computer. </p> <p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-923.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. În caseta „Deschidere”, tastați: <strong> controlați parolele utilizatorului2 </strong> &amp; faceți clic <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-29-663.png\" alt=\"control userpasswords2 \" loading=\"lazy\"></p> <p> 3. La opțiunile Conturi utilizator, efectuați următoarele acțiuni în funcție de caz: </p> <ul> <li><strong> Cazul A. </strong> Dacă vedeți două conturi cu același nume de utilizator: </li> </ul> <blockquote><p> A. Selectați contul secundar și faceți clic <strong> Elimina </strong> . <br> b. Clic <strong> O.K </strong> și <strong> repornire </strong> computerul dvs. <br> c. Dacă după repornire, vedeți încă numele dvs. de utilizator de două ori pe ecranul de conectare continuați cu Metoda 2. </p></blockquote> <p><img src=\"images/image_thumb-37-605.png\" alt=\"User Accounts Options\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Cazul B. </strong> Dacă vedeți un singur cont: </li> </ul> <blockquote><p> A. Selectați contul și faceți clic <strong> Proprietăți </strong> . <br> b. Copiați numele complet și lipiți-l în câmpul Nume utilizator, pentru a se potrivi. * <br> c. Clic <strong> O.K </strong> și <strong> repornire </strong> computerul dvs. </p></blockquote> <p> * Notă: dacă numele de utilizator și numele complet se potrivesc deja, mergeți la metoda 2. </p> <p><img src=\"images/image_thumb-38-262.png\" alt=\"Remove Duplicate User Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Metoda 2. Dezactivați cerința de parolă la conectare. </h6> <p> 1. Urmați pașii 1 și 2 din metoda anterioară pentru a deschide opțiunile „Conturi utilizator”. <br> 2. <strong> Debifează </strong> <strong> Utilizatorul trebuie să introducă un nume de utilizator și o parolă pentru a utiliza acest computer </strong> și faceți clic pe <strong> aplica </strong></p> <p><img src=\"images/image_thumb-42-373.png\" alt=\"User must enter a user name and password to use this computer \" loading=\"lazy\"></p> <p> </p> <p> 3. Tastați parola (de două ori) și faceți clic <strong> O.K </strong> de două ori pentru a închide toate ferestrele. </p> <p><img src=\"images/image_thumb-43-970.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. <strong> Reporniți </strong> computerul tau. Dacă numele dvs. de utilizator apare din nou de două ori, continuați cu următoarea metodă. </p> <h6></h6> <h6> Metoda 3. Modificați opțiunile de conectare. </h6> <p> </p> <p> 1. Din start <img src=\"images/image_thumb-39-183.png\" alt=\"image\" loading=\"lazy\"> meniu, deschis <strong> Setări </strong> <img src=\"images/image_thumb-50-520.png\" alt=\"image\" loading=\"lazy\"> și apoi faceți clic pe <strong> Conturi </strong> . </p> <p><img src=\"images/image_thumb-43-892.png\" alt=\"How to Add a New User in Windows 10, 8.1.\" loading=\"lazy\"></p> <p> </p> <p> 2. Selectați <strong> Opțiuni de conectare </strong> în panoul din stânga și <strong> opriți </strong> <strong> Folosiți informațiile mele de conectare pentru a finaliza automat configurarea dispozitivului și redeschide aplicațiile după actualizare sau repornire </strong> . </p> <p><img src=\"images/image_thumb-40-207.png\" alt=\"Modify Sign in Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Repornire </strong> computerul dvs. </p> <p> </p> <h6> Metoda 4. Schimbați în cont local. </h6> <p> Metoda finală pentru a rezolva problema „numele de utilizator duplicat” este să folosiți un cont local pentru a vă autentifica în Windows 10. Pentru a face acest lucru: </p> <p> 1. Din start <img src=\"images/image_thumb-41-454.png\" alt=\"image\" loading=\"lazy\"> meniu, deschis <strong> Setări </strong> <img src=\"images/image_thumb-50-790.png\" alt=\"image\" loading=\"lazy\"> și apoi faceți clic pe <strong> Conturi </strong> . <br> 2. Faceți clic pe <strong> E-mail și conturi </strong> pe panoul din stânga. <br> 3. Apoi faceți clic <strong> Conectați-vă cu un cont local. </strong></p> <p> </p> <p><img src=\"images/image_thumb-37-653.png\" alt=\"sign-in with a local account instead windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Introduceți parola contului Microsoft și faceți clic <strong> Următorul </strong> . <br> 5. Apoi tastați numele de utilizator, parola (opțională) pentru noul cont local și faceți clic <strong> Următorul </strong> . <br> 6. După repornire, tastați parola pentru a vă autentifica cu noul cont local. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}