{"title":"FIX: ERR_CONNECTION_CLOSED în Google Chrome (rezolvat)","content":"<p> Acest tutorial conține instrucțiuni pentru remedierea erorii Chrome: „ERR_CONNECTION_CLOSED”. Eroarea „ERR_CONNECTION_CLOSED” din Google Chrome înseamnă că browserul dvs. nu poate stabili o conexiune cu site-ul web la care încercați să accesați, deoarece conexiunea dvs. la internet a fost întreruptă sau deoarece furnizorul dvs. de servicii de internet a blocat accesul la site-ul web. </p> <h4> Cum se remediază: eroare CHROME ERR_CONNECTION_CLOSED. </h4> <p><strong> Sfat: </strong> Înainte de a continua rezolvarea erorii Chrome: „ERR_CONNECTION_CLOSED”, aplicând metodele de mai jos, încercați următoarele: <br> 1. Reporniți routerul de internet. <br> 2. Încercați să vizitați alte site-uri web, pentru a vă asigura că conexiunea la internet funcționează. <br> 3. Dacă dețineți un alt computer / dispozitiv în locul dvs., încercați să vizitați site-ul web unde primiți eroarea „ERR_CONNECTION_CLOSED”, pentru a vă asigura că site-ul pe care încercați să îl vizitați nu este blocat de ISP-ul dvs. <br> 4. Dacă ați configurat o conexiune VPN, deconectați-vă de la aceasta. <br> 5. Dezactivați temporar aplicația Firewall (dacă aveți una). </p> <p> </p> <h6> Metoda 1. Scanați computerul pentru a detecta malware și viruși. </h6> <p> Primul pas înainte de depanarea erorii „ERR_CONNECTION_CLOSED” din Chrome este să vă asigurați că sistemul dvs. nu conține viruși / programe malware. Pentru acea sarcină, urmați instrucțiunile din acest ghid: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să vă scanați computerul pentru viruși și alte programe malware. </a></p> <p> </p> <h6> Metoda 2. Resetați setările Chrome la valorile implicite. </h6> <p> Pentru a reseta Chrome la setările implicite instalate: </p> <p> 1. Faceți clic pe meniul Chrome <img src=\"images/image_thumb_thumb_thumb_thumb-657.png\" alt=\"image_thumb_thumb_thumb\" loading=\"lazy\"> pictogramă din colțul din dreapta sus) și alegeți <strong> Setări </strong> . </p> <p><img src=\"images/image_thumb31-256.png\" alt=\"chrome-options\" loading=\"lazy\"></p> <p> </p> <p> 2. La <strong> Setări </strong> pagina, derulați în jos și faceți clic pe <strong> Arata setarile avansate. </strong></p> <p><img src=\"images/image_thumb2_thumb-894.png\" alt=\"FIX ERR_CONNECTION_CLOSED CHROME\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. La sfârșitul paginii, faceți clic pe <strong> Restabiliți setările la valorile implicite originale </strong> . </p> <p><img src=\"images/image_thumb5_thumb-475.png\" alt=\"image_thumb[5]\" loading=\"lazy\"></p> <p> </p> <p> 4. În cele din urmă faceți clic pe <strong> Reseteaza setarile </strong> . </p> <p><img src=\"images/image_thumb6_thumb-389.png\" alt=\"CHROME ERR_CONNECTION_CLOSED - FIX\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Repornire </strong> Crom. </p> <p> </p> <h6> Metoda 3. Resetați protocolul Winsock. </h6> <p> 1. Deschideți Command Prompt în modul Administrativ. Pentru a face asta: </p> <blockquote><p> 1. În caseta Căutare, tastați <strong> cmd </strong> sau <strong> prompt de comandă </strong></p> <p> </p> <p> 2. Faceți clic dreapta la <strong> Prompt de comandă </strong> rezultă și selectează <strong> Rulat ca administrator. </strong></p></blockquote> <p><img src=\"images/image_thumb-38-412.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. În linia de comandă, tastați următoarea comandă și apăsați <strong> introduce </strong> . </p> <ul> <li><strong> catalogul de resetare netsh winsock </strong></li> </ul> <p><img src=\"images/image_thumb_thumb-865.png\" alt=\"netsh winsock reset catalog\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Repornire </strong> computerul tau. </p> <p> </p> <h6> Metoda 4. Modificați setările DNS. </h6> <p> - Utilizați serverele DNS publice Google pentru a rezolva eroarea „ERR_CONNECTION_CLOSED” din Chrome. </p> <p> </p> <p><strong> Pentru a modifica setările DNS: </strong></p> <p> 1. <strong> Click dreapta </strong> pe pictograma Rețea activă din Bara de activități (sau accesați Panoul de control Windows) și faceți clic pe <strong> Centrul de rețea și partajare </strong></p> <p><img src=\"images/image_thumb14_thumb-1-229.png\" alt=\"image_thumb[14]\" loading=\"lazy\"></p> <p> </p> <p> 2. Selectați placa de rețea activă, apoi faceți clic pe <strong> Schimbați opțiunile adaptorului. </strong></p> <p><img src=\"images/image_thumb17_thumb-1-221.png\" alt=\"FIX CHROME ERR_CONNECTION_CLOSED\" loading=\"lazy\"></p> <p> </p> <p> 3. Faceți clic dreapta pe adaptorul de rețea activ și selectați <strong> Proprietăți </strong> . <br> 4. Selectați <strong> „Internet Protocol versiunea 4 (TCP / IPv4) </strong> Și faceți clic <strong> Proprietăți </strong></p> <p><img src=\"images/image_thumb18_thumb-1-963.png\" alt=\"image_thumb[18]\" loading=\"lazy\"></p> <p> </p> <p> 5a. Verifică &quot; <strong> Utilizați următoarele adrese de server DNS: </strong> &quot; buton de radio. <br> 5b. Tastați următoarele adrese de server DNS (serverele DNS publice Google) și faceți clic <strong> O.K. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> <p><img src=\"images/image_thumb20_thumb-1-904.png\" alt=\"image_thumb[20]\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> Repornire </strong> computerul tau. </p> <p> </p> <h6> Metoda 5. Conectați-vă la Internet prin Opera VPN. </h6> <p> Dacă Furnizorul dvs. de servicii de internet (ISP) a blocat accesul la site-urile pe care încercați să le vizitați, atunci puteți încerca să vă conectați la respectivele site-uri, fie utilizând o rețea privată virtuală gratuită (sau plătită) ( VPN) sau prin simpla utilizare a browserului Opera care are încorporată funcția VPN. * </p> <p> * Notă: Conectarea la Internet utilizând un serviciu VPN vă permite să „mascați” adresa IP reală a dispozitivului dvs. pentru a arăta că sunteți online dintr-o altă țară. </p> <p> Pentru a activa funcția VPN în browserul Opera: </p> <p> 1. Deschideți Opera Menu și apoi alegeți <strong> Setări </strong> . </p> <p><img src=\"images/image_thumb10_thumb-360.png\" alt=\"image_thumb[10]\" loading=\"lazy\"></p> <p> </p> <p> 2. Faceți clic pe <strong> Avansat </strong> în stânga și apoi faceți clic pe <strong> Caracteristici </strong> . <br> 3. Trageți <strong> Activați VPN </strong> schimba cu <strong> PE </strong> . </p> <p><img src=\"images/image_thumb13_thumb-171.png\" alt=\"image_thumb[13]\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Repornire </strong> Operă. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}