{"title":"FIX: Nu aveți în prezent permisiunea de a accesa acest folder pe unitatea USB externă (rezolvată)","content":"<p> Acest tutorial conține instrucțiuni detaliate pentru a rezolva următoarea problemă, atunci când încercați să accesați un disc USB extern pe un laptop HP cu Windows 10: &quot;În prezent nu aveți permisiunea de a accesa acest folder. Faceți clic pe continuare pentru a obține permanent acces la acest folder . Eroarea persistă, chiar și după apăsarea butonului „Continuare” pentru a avea acces la unitate. </p> <p><img src=\"images/image_thumb-18-636.png\" alt=\"You don't have permission to access this folder\" loading=\"lazy\"></p> <p> Eroarea ciudată „Nu aveți permisiunea de a accesa acest dosar” apare pe un brand nou <a href=\"http://www8.hp.com/us/en/products/laptops/product-detail.html?oid=17047142\" target=\"_blank\" rel=\"nofollow noopener\"> HP ProBook 450 G5 </a> laptop, atunci când utilizatorul încearcă să vizualizeze conținutul unui disc USB conectat (Pen drive, USB Drive etc.). </p> <p> După investigarea problemei, am descoperit că problema este cauzată de permisiunile de securitate aplicate pe <a href=\"http://www8.hp.com/us/en/solutions/computer-security.html\" target=\"_blank\" rel=\"nofollow noopener\"> HP Client Security Manager </a> program. HP Client Security Manager, este un program dezvoltat de la Hewlett-Packard și vă permite să vă protejați datele, dispozitivul și identitatea prin creșterea securității computerului. </p> <h2> Cum se remediază: nu aveți permisiunea de a accesa unitatea USB pe laptopul HP (Windows 10/8/7). </h2> <p> 1. Deschideți <strong> Manager de securitate client HP </strong> . </p> <p><img src=\"images/image_thumb-13-716.png\" alt=\"HP Client Security manager\" loading=\"lazy\"></p> <p> </p> <p> 2. Apoi faceți clic pe <strong> Securitatea dispozitivului. </strong></p> <p><img src=\"images/image_thumb-14-712.png\" alt=\"fix You Don't have permission to access this folder windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. La <strong> Administratori </strong> , setați securitatea „Eliminare stocare” la <strong> Permiteți - acces complet </strong> și faceți clic pe <strong> Trimite. </strong></p> <p><img src=\"images/image_thumb-15-364.png\" alt=\"fix You Don't have permission o access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. În plus (dacă doriți), dați <strong> Acces complet </strong> la suportul de stocare detașabil la <strong> Utilizatori standard </strong> . </p> <p><img src=\"images/image_thumb-19-269.png\" alt=\"no permission to access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. În cele din urmă, dacă nu doriți ca dispozitivul HP Device Access Manger să controleze accesul pe unitate, accesați <strong> Setări Drive </strong> și setați comutatorul corespunzător la OFF. </p> <p><img src=\"images/image_thumb-20-822.png\" alt=\"You don't have permission to access USB drive\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această problemă. </p>"}