{"title":"FIX: Eroare de actualizare Windows 10 0xC1900101 - 0x30017 - Instalarea a eșuat în faza FIRST_BOOT. (Rezolvat)","content":"<p> Următoarea problemă a apărut pe un computer bazat pe Windows 10, la încercarea de instalare a actualizării funcției 1903: Instalarea se oprește cu eroare &quot;Nu am putut instala Windows 10, 0xC1900101 - 0x30017. Instalarea a eșuat în faza FIRST BOOT cu o eroare în timpul Operațiunea BOOT &quot;, apoi revine la versiunea / construirea anterioară a Windows 10. </p> <p> </p> <p><img src=\"images/image_thumb-21-154.png\" alt=\"FIX 0xC1900101 – 0x30017: Installation failed in FIRST_BOOT phase in Windows 10 Update. \" loading=\"lazy\"></p> <p> </p> <p> Acest tutorial conține instrucțiuni pentru remedierea erorii de actualizare Windows 10 0xC1900101 - 0x30017: &quot;Instalarea a eșuat în faza FIRST_BOOT cu o eroare în timpul funcționării BOOT&quot;. </p> <h4> Cum se remediază eroarea de actualizare Windows 10 0xC1900101 - 00 × 30017 &quot;Instalarea a eșuat în faza FIRST_BOOT cu o eroare în timpul funcționării BOOT&quot; </h4> <p> Codul de eroare 0xC1900101 - 0x30017 în actualizarea Windows 10, indică o problemă cu un dispozitiv, driver sau program incompatibil din sistem. Deci, înainte de a continua cu metodele de mai jos, aplicați următoarele: </p> <p> </p> <p> 1. Asigurați-vă că <strong> Data și ora </strong> setările sunt corecte. <br> 2. Apoi, asigurați-vă că aveți <strong> suficient spațiu liber </strong> . Windows 10 necesită cel puțin 32 GB spațiu liber pentru a face upgrade. Pentru a elibera utilizarea spațiului pe disc <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Curățarea discului </a> . <br> 3. Instalați cele mai recente drivere pentru toate dispozitivele din sistemul dvs., în special pentru adaptorul Ethernet și wireless (dacă există). * <br> 4. <strong> Deconectați toate unitățile USB externe și cardurile SD </strong> și orice alt dispozitiv USB care nu este necesar. <br> 5. Dacă utilizați o terță parte <strong> program antivirus </strong> , apoi temporar <strong> dezactivați </strong> sau -mai bine- dezinstalați-l. <br> 6. <strong> Dezactivează </strong> <strong> Criptare hard disk </strong> (BitLocker, VeraCrypt etc.). <br> 7. În cele din urmă, înainte de a reporni computerul pentru a instala actualizarea, <strong> deconectați-vă de la rețea </strong> . (de exemplu, deconectați cablul Ethernet sau dezactivați adaptorul Wi-Fi). </p> <p><strong> * Notă: </strong> Dacă după aplicarea instrucțiunilor din acest articol, instalarea Windows 10 Upgrade nu reușește, continuați și <strong> Actualizați </strong> De asemenea <strong> BIOS </strong> (Firmware) pe sistemul dvs. </p> <p> </p> <h6> Metoda 1. <strong> Dezactivați Secure Boot. </strong></h6> <p> Prima metodă de rezolvare a erorii 0xC1900101 - 0x30017, în actualizarea Windows 10, este dezactivarea caracteristicii de boot securizate în BIOS. Pentru a face asta: </p> <p> 1. Porniți sistemul și apăsați imediat tasta corespunzătoare * pentru a intra <strong> CONFIGURAREA BIOS-ULUI. </strong></p> <p> * Notă: De obicei, pentru a intra în BIOS, trebuie să apăsați butonul <strong> DEL </strong> sau <strong> F1 </strong> sau <strong> F2 </strong> sau <strong> F10 </strong> cheie. (depinde de producător) </p> <p> </p> <p> 2. Uită-te la <strong> Securitate </strong> sau la <strong> Opțiuni de pornire, </strong> sau la <strong> Autentificare </strong> setări, * pentru a găsi fișierul <strong> Încărcare sigură </strong> opțiune și <strong> Dezactivează </strong> aceasta <strong> . </strong></p> <p> * Note: <br> 1. Locația setării „Secure Boot” în BIOS depinde de producătorul dispozitivului. <br> 2. Dacă nu găsiți setarea „Secure Boot”, atunci <strong> Dezactivează </strong> <strong> Suport CSM </strong> și apoi <strong> Salvează și ieși </strong> configurarea BIOS-ului. Apoi, intrați din nou în configurarea BIOS-ului pentru a găsi Secure Boot. </p> <p><img src=\"images/image_thumb-23-719.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. <strong> Salvați </strong> setări și <strong> IEȘIRE </strong> Configurarea BIOS-ului. <br> 4. Lăsați Windows să pornească normal și să încerce să instaleze actualizarea. Dacă actualizarea eșuează din nou, reactivați „Secure Boot” și continuați cu următoarea metodă. </p> <p> </p> <h6> Metoda 2. <strong> Ștergeți folderul „SoftwareDistribution”. </strong></h6> <p> „C: \\ Windows \\ <strong> Distribuirea software-ului </strong> „Folder, este locația în care Windows stochează actualizările Windows. De multe ori, acest folder se deteriorează și trebuie să-l recreați pentru a descărca actualizările de la zero. Pentru a reconstrui (recrea) dosarul „SoftwareDistribution”, urmați pașii de mai jos: </p> <p><strong> Pasul 1: Opriți serviciul Windows Update. </strong></p> <p> 1. Deschideți panoul de control Servicii Windows: Pentru aceasta: </p> <ul> <li> Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-239.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. </li> <li> În caseta Căutare, tastați: <strong><em> services.msc </em></strong> &amp; faceți clic pe <strong> O.K </strong> . </li> <li> (Acceptați avertismentul UAC dacă apare). </li> </ul> <p><img src=\"images/image_thumb-12-752.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. În panoul de control Servicii localizați „ <strong> Windows Update&quot; </strong> serviciu. <br> 3. Faceți clic dreapta pe <strong> Windows Update </strong> serviciu și selectați „ <strong> Stop </strong> ”. </p> <p><img src=\"images/image_thumb-9-254.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Pasul 2: Ștergeți folderul SoftwareDistribution. </strong></p> <p> 1. Deschideți Windows Explorer și navigați la: <strong> C: \\ Windows </strong> pliant. <br> 2. Găsiți și <strong> Șterge </strong> „ <strong><em> Distribuirea software-ului </em></strong> ”(Sau redenumiți-l. De ex. În„ SoftwareDistributionOLD ”). </p> <p> </p> <p><img src=\"images/image_thumb-10-311.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p><strong> Pasul 3: Porniți serviciul Windows Update. </strong></p> <p> 1. Deschideți panoul de control Servicii Windows. <br> 2. Faceți clic dreapta pe <strong> Windows Update </strong> serviciu și selectați „ <strong> start </strong> ”. </p> <p><img src=\"images/image_thumb-11-133.png\" alt=\"start windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Pasul 4: Verificați și instalați Windows 10 Update. </strong></p> <p> 1. Navigați la <strong> Setări </strong> -&gt; <strong> Actualizare și securitate </strong> și faceți clic pe <strong> Verifică pentru actualizări </strong> . </p> <p> </p> <h6> Metoda 3. Actualizați Windows 10 utilizând Asistentul de actualizare </h6> <p> 1. Navigați la <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Site de descărcare Windows 10 </a> și faceți clic pe <strong> Actualizează acum </strong> buton. </p> <p><img src=\"images/image_thumb_thumb-625.png\" alt=\"image_thumb\" loading=\"lazy\"></p> <p> 2. Salvați fișierul „Windows10Upgrade9252.exe” pe desktop. <br> 3. Faceți dublu clic pe fișierul descărcat pentru a deschide fișierul <strong> Asistent de upgrade Windows </strong> . <br> 4. Faceți clic pe <strong> Actualizează acum </strong> pentru a începe actualizarea. </p> <p><img src=\"images/image_thumb4_thumb-258.png\" alt=\"image_thumb4\" loading=\"lazy\"></p> <p> </p> <p> 5. Lăsați Windows să termine descărcarea și verificarea. <br> 6. Când verificarea ajunge la 100%, <strong> deconectați computerul de la Internet </strong> , sau setați-l la „ <strong> Modul avion </strong> &quot;. <br> 7. Așteptați până când Windows vă actualizează sistemul. <br> 8. Când vi se solicită, reporniți sistemul pentru a instala actualizarea. </p> <h6></h6> <h6> Metoda 4. Actualizați Windows din fișierul ISO Windows 10. </h6> <p> Următoarea metodă de eroare de actualizare Windows 10 „0xC1900101 - 0x30017: Instalarea a eșuat în faza FIRST_BOOT” este actualizarea Windows 10, din fișierul ISO Windows. Pentru a face asta: </p> <p><strong> Pasul 1. Descărcați Windows 10 într-un fișier ISO. </strong></p> <p> 1. Navigați la <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Pagina de descărcare Windows 10 </a> și descărcați fișierul <strong> Instrument de creare a mass-media </strong> . </p> <p><img src=\"images/image_thumb5_thumb-958.png\" alt=\"image_thumb5\" loading=\"lazy\"></p> <p> </p> <p> 2. Rulați „Instrumentul de creare media” și <strong> Accept </strong> Termenii licenței în primul ecran. <br> 3. Selectați <strong> Creați suporturi de instalare pentru alt computer </strong> . </p> <p><img src=\"images/image_thumb1_thumb-733.png\" alt=\"create Windows 10 DVD\" loading=\"lazy\"></p> <p> </p> <p> 4. În ecranul „Limbă, arhitectură și ediție” faceți clic pe ecran <strong> Următorul. <br> </strong> 5. Selectați <strong> Fișier ISO </strong> și faceți clic pe <strong> Următorul </strong> . </p> <p><img src=\"images/image_thumb-30-348.png\" alt=\"download windows 10 iso\" loading=\"lazy\"></p> <p> 6. <strong> Salvați </strong> fișierul „Windows.iso” de pe desktop. <br> 7. Instrumentul de creare media va începe acum să descarce Windows 10 într-un format ISO. <br> 8. Când descărcarea este finalizată, <strong> închide </strong> Instrumentul de creare a mass-media. </p> <p> </p> <p><strong> Pasul 2. Actualizați Windows 10 din fișierul ISO. </strong></p> <p> 1. <strong> Deconectați computerul de la Internet </strong> , (sau setați-l la „Mod avion” dacă dețineți un laptop). <br> 2. <strong> Dezactivează </strong> sau <strong> dezinstalați temporar </strong> orice <strong> antivirus terță parte </strong> . <br> 3. Apoi, faceți clic dreapta pe fișierul „Windows.iso” (de pe desktop) și faceți clic pe <strong> montură </strong> . <br> 4. Faceți dublu clic pe <strong> Înființat </strong> cerere. </p> <p><img src=\"images/image_thumb-36-323.png\" alt=\"windows 10 setup\" loading=\"lazy\"></p> <p> </p> <p> 5. În ecranul de mai jos alegeți <strong> &#39;Nu acum&#39; </strong> și faceți clic pe <strong> Următorul </strong> . </p> <p><img src=\"images/image_thumb-11-747.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Urmați restul instrucțiunilor de pe ecran pentru a vă actualiza sistemul. </p> <h4></h4> <h6> Metoda 5. Instalați curat Windows 10. </h6> <p> Ultima metodă, pentru a remedia problemele de actualizare Windows 10, este să efectuați o instalare curată a Windows 10 pe sistemul dvs. </p> <p><strong> Important: </strong> Instalarea Windows 10 curată înseamnă că toate fișierele și setările dvs. vor fi pierdute în timpul procesului de instalare. Deci, continuați și <strong> copiați toate fișierele și setările importante pe un alt suport de stocare înainte de a continua </strong> . (de exemplu, pe o unitate USB externă). </p> <p> Pentru a efectua o instalare Windows 10 curată, citiți instrucțiunile din acest articol: <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se curăță instalarea Windows 10 </a></p> <p> Asta-i tot oameni buni! A funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}