{"title":"FIX: Office nu este licențiat corect - Nu se poate verifica licența în Office 2019, 2016.","content":"<p> Dacă ați instalat Microsoft Office 2019 sau Office 2016 cu o licență Office legitimă și primiți eroarea „Office nu este licențiat corect și s-ar putea să fiți victima contrafacerii software-ului. Rămâneți în siguranță cu Office original astăzi”, continuați mai jos pentru a remedia problema . </p> <p> Mesajele / erorile Office „Nu se poate verifica licența” și „Office nu este licențiat corespunzător și este posibil să fiți victima contrafacerii software-ului”, apare de obicei pe computerele fără o licență Office legitimă sau cu o licență Office obținută de la o terță vânzător și nu Microsoft. </p> <p><img src=\"images/image_thumb-31-132.png\" alt=\"FIX: Office isn't licensed properly - Cannot verify license\" loading=\"lazy\"></p> <p> </p> <h2> Cum se remediază: Nu se poate verifica licența - Office nu este licențiat corespunzător în Office 2016/2019. </h2> <p> Dacă aveți o licență Office 2016/2019 validă obținută de la Microsoft, care a fost activată și funcționează bine înainte, dar acum vedeți mesajul „Obțineți un birou autentic” sau „Nu se poate verifica licența pentru acest produs”, în orice aplicație Office (Word, Excel , Outlook etc.), continuați mai jos pentru a remedia problema. </p> <h3> Metoda 1. Rulați aplicațiile Office în modul de compatibilitate. </h3> <p> 1. <strong> Închide </strong> toate aplicațiile Office. <br> 2. Deschideți Explorer și, în funcție de tipul de instalare Office, navigați la folderul corespunzător de mai jos: </p> <p><strong> Tipul de instalare Office MSI: </strong></p> <ul> <li> C: \\ Program Files \\ Microsoft Office \\ Office16 </li> <li> C: \\ Program Files (x86) \\ Microsoft Office \\ Office16 </li> </ul> <p> </p> <p><strong> Tipul de instalare Office Click-to-Run: </strong></p> <ul> <li> C: \\ Program Files \\ Microsoft Office \\ root \\ Office16 </li> <li> C: \\ Program Files (x86) \\ Microsoft Office \\ root \\ Office16 </li> </ul> <p> 3. Localizați și <strong> Click dreapta </strong> în aplicația Office afișează eroarea de licență (de exemplu, Word&gt; „WINWORD.EXE”) și alegeți <strong> Proprietăți </strong> . <br> 4. La <strong> Compatibilitate </strong> filă: </p> <blockquote> <p> A. <strong> Debifează </strong> optiunea <strong> Rulați acest program în modul de compatibilitate pentru <br> </strong> b. Clic <strong> Modificați setările pentru toți utilizatorii. </strong></p> <p><strong><strong><img src=\"images/image_thumb-32-197.png\" alt=\"run program in compatibility mode\" loading=\"lazy\"></strong></strong></p> <p> c. În <strong> Compatibilitate </strong> pentru toate opțiunile utilizatorilor <strong> , debifați </strong> optiunea <strong> Rulați acest program în modul de compatibilitate </strong> și faceți clic pe <strong> O.K </strong> de două ori. </p> <p><img src=\"images/image_thumb-33-697.png\" alt=\"run in compatibility mode\" loading=\"lazy\"></p> </blockquote> <p> 5. Acum deschideți aplicația Office și verificați dacă problema persistă. </p> <h3> Metoda 2. Reparați instalarea Office. </h3> <p> A doua metodă de rezolvare a problemelor legate de licența MS Office este repararea Microsoft Office. Pentru a face asta: </p> <p> 1. <strong> Închide </strong> toate aplicațiile Office. <br> 2. Navigați la <strong> Programe si caracteristici </strong> . Pentru a face asta: </p> <blockquote><p> 1. Apăsați simultan Windows <img src=\"images/image_thumb36-291.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați: <strong> appwiz.cpl </strong> și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-24-317.png\" alt=\"programs and features\" loading=\"lazy\"></p> </blockquote> <p> 3. În Programe și caracteristici, selectați produsul Microsoft Office instalat pe sistemul dvs. și faceți clic <strong> Schimbare. </strong></p> <p><img src=\"images/image_thumb-25-386.png\" alt=\"office repair\" loading=\"lazy\"></p> <p> 4. În cele din urmă faceți clic pe <strong> Reparație </strong> și urmați pașii de rest pentru a repara Microsoft Office. * </p> <p> * Observație: dacă după ce faceți clic pe „Reparare”, primiți „ <strong> Cum ați dori să reparați programele Office </strong> &quot;, selectați <strong> Reparare rapidă </strong> opțiune, care verifică și înlocuiește fișierele lipsă sau corupte. Dacă după „Repararea rapidă”, problemele nu au fost rezolvate, atunci alegeți <strong> Reparații online </strong> opțiune pentru a reinstala produsul Office. (necesită o conexiune la Internet). </p> <p><img src=\"images/image_thumb-26-803.png\" alt=\"Repair Office\" loading=\"lazy\"></p> <p> 5. Când reparația este finalizată, lansați aplicațiile Office și verificați dacă problema a fost rezolvată. </p> <h3> Metoda 3. Restabiliți MS Office la versiunea anterioară. </h3> <p> Dacă problema de licență Office apare după actualizarea MS Office, încercați următoarele: </p> <p> 1. <strong> Închide </strong> toate aplicațiile Office. <br> 2. Deschideți <strong> Prompt comandă ca administrator </strong> . Pentru a face asta: </p> <blockquote> <ol> <li> În caseta de căutare tip: <strong> prompt de comandă </strong> sau <strong> cmd </strong></li> <li> Faceți clic dreapta la <strong> cmd </strong> sau <strong> Prompt de comandă </strong> rezultă și selectează <strong> Rulat ca administrator. </strong></li> </ol> <p><img src=\"images/image_thumb-10-974.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> </blockquote> <p> 3. La promptul de comandă, tastați aceste comenzi în ordine (apăsați <strong> introduce </strong> după ce ați tastat fiecare comandă) </p> <ul> <li> <p> CD\\ </p> </li> <li> <p> cd C: \\ Program Files \\ Common Files \\ microsoft shared \\ ClickToRun </p> </li> <li> <p> officec2rclient.exe / update user updatetoversion = 16.0.13628.20274 </p> </li> </ul> <p><img src=\"images/image_thumb-34-389.png\" alt=\"Office isn't licensed properly - fix\" loading=\"lazy\"></p> <p> 4. Așteptați 4-5 minute până când procesul „Office Setup” instalează fișierele necesare. <br> 5. Când se face acest lucru, deschideți orice aplicație Office și verificați dacă problema licențiată a fost rezolvată. Dacă da, continuați și <strong> opriți </strong> <strong> Actualizări Office </strong> , făcând următoarele: </p> <blockquote> <p> 1. Deschideți orice aplicație Office și accesați <strong> Fişier </strong> meniu -&gt; <strong> Cont. <br> </strong> 2. Faceți clic pe <strong> Opțiuni de actualizare </strong> și <strong> Dezactivați actualizările. </strong></p> <p><img src=\"images/image_thumb-35-367.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <h3> Metoda 4. Eliminați și reinstalați Microsoft Office. </h3> <p> Metoda finală pentru a remedia problemele de licență Office, dezinstalează complet toate versiunile instalate ale MS Office de pe computer și apoi reinstalează MS Office: </p> <p> 1. Descărcați fișierul <a href=\"https://aka.ms/SaRA-officeUninstallFromPC\" target=\"_blank\" rel=\"nofollow noopener\"> Asistență Microsoft pentru asistență și recuperare (SARA) </a> utilitate. <br> 2. Când descărcarea este finalizată <strong> dublu click </strong> pentru a rula <strong> SetupProd_OffScrub.exe </strong> cerere. <br> 3. Faceți clic pe <strong> Instalare </strong> pentru a instala utilitarul SARA. </p> <p><img src=\"images/image_thumb-5-418.png\" alt=\"Microsoft Support and Recovery Assistant\" loading=\"lazy\"></p> <p> 4. Când instalarea este finalizată, faceți clic pe <strong> De acord </strong> și apoi faceți clic pe <strong> Da. </strong></p> <p><img src=\"images/image_thumb-6-584.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Așteptați până când „Asistentul de asistență și recuperare Microsoft” rezolvă problema. <br> 6. Bifați caseta de selectare din partea stângă a numelui produsului Office pentru <strong> selectați toate produsele Office instalate </strong> și faceți clic pe <strong> Următorul </strong> . </p> <p><img src=\"images/image_thumb-7-227.png\" alt=\"Unistall Office Tool\" loading=\"lazy\"></p> <p> </p> <p> 7. Acum așteptați până când procesul de eliminare Office este finalizat și când se termină acest lucru, <strong> repornire </strong> computerul tau. <br> 8. După repornire, continuați și reinstalați Office urmând instrucțiunile din aceste legături: </p> <ul> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Office 365 </a></li> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Office 2019 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Office 2016 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Office 2013 </a></li> </ul> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}