{"title":"FIX: Rularea scripturilor este dezactivată pe acest sistem în Windows 10 (rezolvat)","content":"<p> Dacă încercați să rulați un script în Windows 10 PowerShell și primiți mesajul de eroare „Nu se poate încărca deoarece rularea scripturilor este dezactivată pe acest sistem” continuați să citiți mai jos pentru a remedia problema. </p> <p><img src=\"images/image_thumb-8-134.png\" alt=\"FIX: script cannot be loaded because is disabled on Windows 10\" loading=\"lazy\"></p> <p> </p> <h2> Cum se remediază: Nu se poate rula scriptul PowerShell deoarece politica de securitate împiedică executarea scripturilor în Windows 10. </h2> <p> Eroarea PowerShell „% ScriptName% .ps1 nu poate fi încărcată deoarece este dezactivată pe acest sistem”, apare din cauza unei politici de securitate care împiedică executarea scripturilor. Pentru a elimina restricția și a activa rularea scripturilor în Windows 10, procedați după cum urmează: </p> <p> 1. Deschideți <strong> PowerShell în calitate de administrator </strong> . Pentru a face asta: </p> <blockquote><p> 1. Apăsați tasta <strong> Windows <img src=\"images/image_thumb-97-958.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> tastele pentru a deschide caseta de comandă „Run” <strong><br> </strong> 2. Tastați <strong> puterea </strong> și apoi apăsați <strong> CTRL </strong> + <strong> SCHIMB </strong> + <strong> INTRODUCE. </strong></p></blockquote> <p><img src=\"images/image_thumb-41-395.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. La PowerShell copiați / lipiți comanda de mai jos și apăsați <strong> introduce </strong> : </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Nelimitat </li> </ul> <p> 3. Apăsați <strong> Da </strong> și a lovit <strong> introduce </strong> la mesajul de avertizare privind politica de execuție pentru a accepta modificarea .. </p> <p><img src=\"images/image_thumb-9-581.png\" alt=\"Enable Running Scripts on Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. După finalizarea modificării politicii, <strong> închide </strong> fereastra PowerShell. </p> <p> 5. Acum, rulați scriptul care v-a dat eroarea „Scripturile sunt dezactivate” cu <strong> admin </strong> privilegii. Eroarea ar trebui să dispară acum. * </p> <blockquote><p> * Notă: Dacă totuși primiți eroarea „Scripturile sunt dezactivate pe acest sistem”, dați una dintre următoarele comenzi și încercați din nou să rulați scriptul: </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy RemoteSigned </li> <li> set-executionpolicy remotesigned </li> </ul> </blockquote> <p> 6. În cele din urmă, reveniți la setarea politică de execuție PowerShell (restricție) anterioară, executând această comandă în PowerShell (Admin): * </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Restricted </li> </ul> <p> * Notă: După executarea comenzii de mai sus, veți primi un mesaj de avertizare care explică riscurile de securitate ale unei modificări a politicii de execuție. presa <strong> Da </strong> , apoi apăsați <strong> introduce </strong> pentru a accepta modificarea și a reveni la setarea de politică anterioară. </p> <p><img src=\"images/image_thumb-10-246.png\" alt=\"Disable running scripts windows 10\" loading=\"lazy\"></p> <p> 7. Închideți fereastra PowerShell și gata! </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}