{"title":"FIX: Nu s-a putut instala instrumentele de verificare Office 2016 (rezolvate)","content":"<p> Dacă nu ați putut instala Instrumente de verificare Office 2016 cu eroare „Hopa! Este necesară o versiune compatibilă a Microsoft Office înainte de a putea instala instrumente de verificare suplimentare.”, Continuați să citiți mai jos pentru a rezolva problema. </p> <p> </p> <p><img src=\"images/image_thumb-23-190.png\" alt=\"Couldn't Install Office 2016 Proofing Tools - Oops! A compatible version of Microsoft Office is required \" loading=\"lazy\"></p> <p> </p> <p> Eroarea de instalare Microsoft Office Proofing Tools 2016 „Este necesară o versiune compatibilă a Microsoft Office înainte de a putea instala instrumente de verificare suplimentare”, de obicei apare dacă încercați să instalați o versiune incompatibilă a instrumentelor de verificare pentru versiunea și arhitectura Office instalate sau dacă ați instalat o versiune pe 32 de biți a Office 2016 pe un sistem de operare Windows pe 64 de biți. </p> <h4> Cum se remediază: Nu se pot instala Instrumente de verificare în Office 2016 sau Office 2019. </h4> <p> </p> <h6> Metoda 1. Descărcați instrumentele de verificare corectă. </h6> <p> În primul rând, asigurați-vă că ați descărcat fișierul de instalare corect al instrumentelor de verificare, în conformitate cu versiunea și arhitectura Office instalate (32 sau 64 biți). Pentru a face asta: </p> <p> 1. Deschideți orice aplicație Office (de exemplu, Word). <br> 2. Din <strong> Fişier </strong> faceți clic pe meniu <strong> Cont </strong> (sau <strong> Ajutor </strong> ). <br> 3. Acum faceți clic pe <strong> Despre Word </strong> butonul din panoul din dreapta. <br> 4. Observați versiunea Office instalată (de exemplu, „2016”) și arhitectura (de exemplu, „64 de biți”). </p> <p><img src=\"images/image_thumb-24-106.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Acum, conform versiunii Office: </p> <ul> <li> Pentru <strong> Office 2016 </strong> descărcați instrumentele de verificare de aici: <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=52668\" target=\"_blank\" rel=\"nofollow noopener\"> Instrumente de verificare Office 2016 </a> . </li> <li> Pentru <strong> Office 2019 </strong> descărcați instrumentele de verificare de aici: <a href=\"https://support.office.com/en-us/article/language-accessory-pack-for-office-82ee1236-0f9a-45ee-9c72-05b026ee809f?ui=en-US&rs=en-US&ad=US\" target=\"_blank\" rel=\"nofollow noopener\"> Instrumente de verificare Office 2019 </a></li> </ul> <p> 6. Apoi, alegeți limba dorită pentru instrumentele de verificare. <br> 7. În cele din urmă, conform arhitecturii Office (32 sau 64 biți): </p> <ul> <li> Pentru Office 32 biți, descărcați fișierul de instalare x86. (de exemplu, &quot;proofingtools2016_en-us-x86.exe) </li> <li> Pentru Office 64 biți, descărcați fișierul de instalare x64. (de exemplu, &quot;proofingtools2016_en-us-x64.exe) </li> </ul> <p> 8. Faceți dublu clic pe fișierul descărcat .exe pentru a instala instrumentele de verificare. </p> <p> </p> <h6> Metoda 2. Reparați instalarea Office. </h6> <p> 1. Navigați la <strong> Programe și </strong><strong> Caracteristici. </strong> Pentru a face asta: </p> <blockquote><p> 1. Apăsați simultan Windows <img src=\"images/image_thumb36-318.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați: <strong> appwiz.cpl </strong> și faceți clic pe <strong> O.K </strong> . </p></blockquote> <p><img src=\"images/image_thumb-24-189.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. În Programe și caracteristici, selectați produsul Microsoft Office instalat pe sistemul dvs. și faceți clic <strong> Schimbare </strong> . </p> <p><img src=\"images/image_thumb-2-328.png\" alt=\"repair office 2016 and office 2019\" loading=\"lazy\"></p> <p> </p> <p> 3. În cele din urmă faceți clic pe <strong> Reparație </strong> și urmați pașii de rest pentru a repara Microsoft Office. * </p> <p> * Notificare: dacă după ce faceți clic pe Reparare, primiți „ <strong> Cum ați dori să reparați programele Office </strong> &quot;, selectați ecranul <strong> Reparare rapidă </strong> opțiune, care verifică și înlocuiește fișierele lipsă sau corupte. Dacă după „Repararea rapidă”, problemele nu au fost rezolvate, atunci alegeți <strong> Reparații online </strong> opțiune pentru a reinstala produsul Office. (necesită o conexiune la Internet). </p> <p><img src=\"images/image_thumb-26-143.png\" alt=\"Repair Office\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Când reparația este finalizată, reporniți computerul. <br> 5. Instalați instrumentele de verificare. </p> <p> </p> <h6> Metoda 3. Dezinstalați și reinstalați Office 2016 pe 64 de biți. </h6> <p> Următoarea metodă de rezolvare a problemelor de instalare a instrumentelor de verificare Office este eliminarea și reinstalarea Office 2016 pe sistemul dvs. Pentru a face asta: </p> <h2> Pasul 1. Dezinstalați Office din sistemul dvs. </h2> <p> 1. Descărcați fișierul <a href=\"http://go.microsoft.com/?linkid=9815935\" target=\"_blank\" rel=\"nofollow noopener\"> Dezinstalați Microsoft Office Fix </a> instrument pentru a dezinstala automat Office 365, Office 2016 sau Office 2013. <br> 2. Rulați „Dezinstalați Microsoft Office Fix” și apăsați <strong> Următorul </strong> la primul ecran. </p> <p><img src=\"images/image_thumb-19-681.png\" alt=\"office uninstall tool\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Lăsați procesul de rezolvare a problemelor legate de dezinstalarea Office și eliminați software-ul Office de pe computer. </p> <p><img src=\"images/image_thumb-20-361.png\" alt=\"cannot uninstall office\" loading=\"lazy\"></p> <p> </p> <h2> Pasul 2. Descărcați și instalați Office 2016. </h2> <p> 1. Navigați la <a href=\"https://www.heidoc.net/joomla/technology-science/microsoft/67-microsoft-windows-iso-download-tool\" target=\"_blank\" rel=\"nofollow noopener\"> HeiDoc.net </a> și descărcați fișierul <strong><a href=\"https://www.heidoc.net/php/Windows-ISO-Downloader.exe\" target=\"_blank\" rel=\"nofollow noopener\"> Instrumentul Windows ISO Downloader </a></strong> . <br> 2. Faceți dublu clic pentru a rula fișierul descărcat „Windows-ISO-Downloader.exe”. <br> 3. La instrumentul de descărcare ISO Windows: </p> <blockquote><p> A. Alege <strong> Birou </strong> fila din panoul din dreapta. <br> b. <strong> Selectați </strong> <strong> Versiunea Office </strong> pe care doriți să o descărcați. (de ex. „Office 2016”). <br> c. Apoi în stânga alegeți <strong> Ediție </strong> a Oficiului și a celor dorite <strong> limba </strong> de mai jos. <br> d. Când ați terminat, faceți clic pe <strong> Descarca </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-595.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Când descărcarea este finalizată, faceți dublu clic pe fișierul imagine descărcat (ProPlusRetail.img), pentru al monta în Explorer. <br> 5. Explorează conținutul imaginii montate (unitatea) și deschide folderul „Office”. <br> 6. Faceți dublu clic pe „setup32.exe” pentru a instala versiunea Office pe 32 de biți sau „setup64.exe” pentru a instala versiunea Office pe 64 de biți. * </p> <p> * Notă: vă recomand, dacă aveți o versiune Windows pe 64 de biți, să instalați versiunea pe 64 de biți a Office (setup64.exe). </p> <p><img src=\"images/image_thumb-25-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Când instalarea este finalizată, utilizați cheia de licență pentru a activa Office. <br> 8. Urmați instrucțiunile de la metoda-1 de mai sus pentru a instala Instrumentele de verificare. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}