{"title":"FIX: Actualizarea Windows 10 nu a putut dezinstala Avira AntiVir (rezolvat)","content":"<p> Pe un computer Windows 10, următorul mesaj apare atunci când se încearcă actualizarea Windows 10 la versiunea 1803 sau 1809: „Unele aplicații trebuie dezinstalate: aceste programe trebuie dezinstalate deoarece nu sunt compatibile cu Upgrade: Avira Antivirus” și la apăsarea butonului „Dezinstalare și continuare”, apare următoarea eroare: „Nu am putut dezinstala aceste aplicații: Avira AntiVir”. Lucrul amuzant cu această problemă este că Avira Antivir (Antivirus) nu este instalat pe PC (nu este listat la programele instalate). </p> <p><img src=\"images/image_thumb-10-929.png\" alt=\"Windows 10 Update Couldn't uninstall Avira AntiVir\" loading=\"lazy\"></p> <p> Problema „Nu s-a putut dezinstala Avira AntiVir” în timpul actualizării Windows 10 v1803, a apărut deoarece programul de actualizare găsește unele fișiere de pe computer care sunt asociate cu Avira Antivirus și nu au fost eliminate în timpul dezinstalării Avira. * </p> <p> * Notă: Dacă într-adevăr aveți instalat pe computer programul „Avira Antivirus”, dezinstalați-l folosind opțiunea „Programe și caracteristici” din panoul de control și apoi continuați să actualizați sistemul la Windows 10 v1803 (sau 1809). După actualizare, descărcați și instalați cea mai recentă versiune de Avira Antivirus în sistemul dvs. </p> <h4> Cum se remediază eroarea de actualizare Windows 10: nu s-a putut dezinstala Avira AntiVir. </h4> <p> </p> <p> 1. Porniți Windows în <strong> Mod sigur </strong> . Pentru a face asta: </p> <ul> <li> <ul> <li> Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-432.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. </li> <li> Tip <strong> msconfig </strong> și apăsați <strong> introduce </strong> . </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-47-667.png\" alt=\"msconfig\" loading=\"lazy\"></p> <ul> <li> <ul> <li> La <strong> Cizmă </strong> fila selectați <strong> Boot sigur </strong> , apoi faceți clic pe <strong> O.K </strong> și reporniți computerul. </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-48-342.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 2. După repornire, deschideți fișierul Explorer și ștergeți fișierul <strong> avipbb.sys </strong> fișier din următoarele locații: </p> <ul> <li> C: \\ Windows \\ System32 \\ drivere </li> <li> C: \\ Windows \\ SysWOW64 \\ drivere </li> </ul> <p> </p> <p> 3. Continuați să ștergeți din locațiile de mai sus orice alt fișier numit <strong> avipbb </strong> în ciuda extinderii sale. </p> <p> 4. Apoi ștergeți <strong> Avira </strong> folder din următoarea locație: </p> <ul> <li> (Windows pe 64 de biți): C: \\ Program Files (x86) \\ <strong> Avira \\ Antivirus </strong></li> <li> (Windows pe 32 de biți): C: \\ Program Files \\ <strong> Avira \\ Antivirus </strong></li> </ul> <p> 5. Aleargă <strong> msconfig </strong> din nou. <br> 6. În fila General, faceți clic pe Start normal și faceți clic pe <strong> O.K </strong> , pentru a reporni computerul în mod normal. </p> <p><img src=\"images/image_thumb-11-949.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Verificați și instalați actualizările. * </p> <p> * Notă: Dacă încă vă confruntați cu eroarea „Nu s-a putut dezinstala Avira AntiVir” în timpul actualizării, atunci descărcați și rulați <a href=\"https://www.avira.com/en/support-download-avira-registrycleaner/1//\" target=\"_blank\" rel=\"nofollow noopener\"> Avira Registry Cleaner </a> . </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}