{"title":"FIX: Resetați perioada de grație de 120 de zile pe serverul RDS 2016/2012.","content":"<p> Dacă ați instalat un server RDS 2016 în scopul testării și perioada de grație a licențierii RDS a expirat, continuați să citiți mai jos pentru a afla cum să resetați perioada de grație de 120 de zile. După cum probabil știți când instalați RDS Server 2016 aveți la dispoziție 120 de zile pentru a instala licențele de acces client RD (CAL CAL), în caz contrar, utilizatorii nu vor mai putea stabili sesiuni RDP pe serverul Session Host RD, cu eroarea „Telecomanda sesiunea de desktop a fost deconectată deoarece nu există servere de licență desktop la distanță disponibile pentru a furniza o licență &quot;. </p> <p><img src=\"images/image_thumb-32-368.png\" alt=\"Reset 120 Days Grace Period on RDS Server 2012/2016\" loading=\"lazy\"></p> <p> </p> <h4> Cum se resetează perioada de grație a licențelor RDS pe Server 2012 sau 2016. * </h4> <p><strong> * Important: </strong> Aplicați instrucțiunile de mai jos, numai dacă utilizați RDS Server 2016 într-un mediu de testare. Dacă doriți să doriți să utilizați serverul RDS într-un mediu de producție, continuați și cumpărați CAL-uri RD. </p> <p> Pentru a prelungi perioada de grație de 120 de zile pe serverul de licențiere RDS: </p> <p> 1. Deschideți Editorul de registru și navigați la următoarea cheie: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Control \\ Terminal Server \\ RCM \\ GracePeriod </li> </ul> <p> 2. Faceți clic dreapta pe tasta „GracePeriod” și selectați <strong> Permisiuni. </strong></p> <p><img src=\"images/image_thumb-33-473.png\" alt=\"Reset Grace Period RDS 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Apoi faceți clic pe <strong> Avansat </strong> . </p> <p><img src=\"images/image_thumb-34-585.png\" alt=\"Reset RDS Grace Period\" loading=\"lazy\"></p> <p> </p> <p> 4. Selectați <strong> Administratori </strong> obiect și faceți clic <strong> Editați | × </strong> . </p> <p><img src=\"images/image_thumb-18-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Schimbați permisiunile în <strong> Control total </strong> și faceți clic pe <strong> O.K. </strong></p> <p><img src=\"images/image_thumb-19-737.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Faceți clic dreapta pe valoarea „L $ RTMTIMEBOMB…” și selectați <strong> Șterge </strong> . </p> <p><img src=\"images/image_thumb-35-208.png\" alt=\"Reset RDS Licensing Grace Pariod\" loading=\"lazy\"></p> <p> </p> <p> 7. Închideți Editorul de registry și reporniți serverul RDS. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}