{"title":"FIX: Locația nu este disponibilă - Fișierul sau directorul sunt corupte și ilizibile (rezolvate)","content":"<p> Acest tutorial conține instrucțiuni pentru rezolvarea următoarei erori, atunci când încercați să accesați o unitate sau un folder în sistemul de operare Windows 10/8/7: &quot;Locația nu este disponibilă. Unitatea nu este accesibilă. Fișierul sau directorul este corupt și ilizibil (0x80070570) &quot;. </p> <p><img src=\"images/image_thumb-21-253.png\" alt=\"FIX Locations is not available - File or Directory is Corrupted and Unreadable 0x80070570\" loading=\"lazy\"></p> <p> </p> <p> Eroarea 0x80070570 „Fișierul sau directorul este corupt și ilizibil” se întâmplă de obicei dacă nu ați deconectat corect unitatea USB corect (fără a utiliza opțiunea „Eliminare siguranță”). În alte cazuri, apare eroarea, dacă unitatea este deteriorată. </p> <h4> Cum se remediază: Unitatea nu este accesibilă - Fișierul sau directorul este deteriorat și ilizibil (0x80070570). </h4> <p> </p> <h6> Metoda 1. Deconectați și reconectați unitatea. </h6> <p> Dacă primiți eroarea „Unitatea nu este accesibilă”, atunci când încercați să vizualizați conținutul de pe o unitate USB, încercați mai întâi să deconectați și să reconectați unitatea USB sau încercați să o conectați la un alt port USB sau la un alt computer. </p> <p> </p> <h6> Metoda 2. Utilizați Verificați discul pentru a repara unitatea deteriorată. </h6> <p> A doua metodă pentru a rezolva eroarea „Unitatea nu este accesibilă” sau „Folderul nu este accesibil” este aceea de a încerca să reparăm unitatea deteriorată utilizând comanda „CHKDSK”. </p> <p> 1. Deschideți <strong> Prompt comandă ca administrator </strong> . Pentru a face asta: </p> <ul> <li> În <strong> Windows 7, Vista, XP </strong> : Navigheaza catre <strong> start </strong> -&gt; <strong> Programe </strong> -&gt; <strong> Accesorii. </strong> Apoi, faceți clic dreapta la <strong> Prompt de comandă </strong> și selectați <strong> Rulat ca administrator. </strong></li> </ul> <p><img src=\"images/image_thumb16-914.png\" alt=\"command-prompt-admin-windows-7-vista\" loading=\"lazy\"></p> <ul> <li> În <strong> Windows 10, 8 </strong> : În caseta de căutare tastați: <strong> prompt de comandă </strong> sau <strong> cmd. </strong> Apoi faceți clic dreapta la <strong> Prompt de comandă </strong> rezultă și selectează <strong> Rulat ca administrator. </strong></li> </ul> <p><img src=\"images/image_thumb-10-340.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. În fereastra promptului de comandă tastați următoarea comandă și apăsați <strong> introduce </strong> : * </p> <ul> <li><strong> chkdsk D: / F / R </strong></li> </ul> <p><strong> * Notă: </strong> În acest exemplu, litera driverului discului deteriorat este „D”. Înlocuiți scrisoarea șoferului în funcție de cazul dvs. </p> <p><img src=\"images/image_thumb-22-172.png\" alt=\"fix drive not accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. Tastați <strong> Da </strong> și apăsați <strong> introduce </strong> pentru a demonta volumul (dacă vi se cere) </p> <p><img src=\"images/image_thumb-23-496.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Așteptați până când procesul de verificare a discului remediază unitatea deteriorată. </p> <p><img src=\"images/image_thumb-24-722.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Când discul de verificare este complet, încercați să explorați conținutul unității. <br> 6. Dacă puteți accesa unitatea, copiați tot conținutul acesteia pe computer și apoi diagnosticați unitatea pentru probleme, utilizând instrucțiunile din acest tutorial: <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Cele mai bune instrumente de testare și diagnosticare a hard diskului pentru a verifica starea de sănătate a hard diskului </a> . </p> <p> </p> <h6> Metoda 3. Folosiți PhotoRec pentru a vă recupera fișierele. </h6> <p> Dacă metodele de mai sus nu funcționează, atunci utilizați gratuit <a href=\"http://www.cgsecurity.org/wiki/PhotoRec\" target=\"_blank\" rel=\"nofollow noopener\"> PhotoRec </a> Utilitar de recuperare, pentru a recupera fișierele pierdute de pe unitatea deteriorată. Pentru a face asta: </p> <p><strong> Pasul 1. Descărcați Photorec. </strong></p> <p> </p> <p> 1. Navigați la: <a href=\"http://www.cgsecurity.org/wiki/TestDisk_Download\" target=\"_blank\" rel=\"nofollow noopener\"> http://www.cgsecurity.org/wiki/TestDisk_Download </a> pagină și faceți clic pe <strong> „TestDisk - Descărcare gratuită” </strong> sau faceți clic pe <a href=\"http://www.cgsecurity.org/Download_and_donate.php/testdisk-7.0.win.zip\" target=\"_blank\" rel=\"nofollow noopener\"> Aici </a> pentru a descărca direct TestDisk. </p> <p> 2. Extrageți fișierul „testdisk-7.0.win.zip”. </p> <p> </p> <p><strong> Pasul 2. Recuperează fișierele corupte cu PhotoRec. </strong></p> <p> 1. Explorează folderul „testdisk-7.0” și deschide fișierul <strong> qphotorec_win </strong> cerere. </p> <p> </p> <p><img src=\"images/image_thumb-4-696.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Alegeți discul de pe care să preluați datele. </p> <p><img src=\"images/image_thumb-7-484.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Apoi alegeți întregul disc sau partiția pentru a prelua fișiere. * </p> <p><strong> * Notă: </strong> Dacă vrei să nu ratezi nimic, selectează „ <strong> Fără partiție &quot; </strong> . PhotoRec va scana întreaga unitate. (Scanarea durează mai mult) </p> <p><img src=\"images/image_thumb-8-229.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Selectați: <strong> Întreg: extrageți fișiere din întreaga partiție, </strong> dacă doriți să recuperați datele corupte * </p> <p><strong> * Notă: </strong> Dacă doriți să recuperați fișierele șterse, selectați: &quot; <em> Gratuit: Căutați fișier numai din spațiul nealocat &quot; </em> . </p> <p><img src=\"images/image_thumb-9-232.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Apoi alegeți o destinație de pe discul dvs. * pentru a salva fișierele recuperate. </p> <p><strong> * Notă: </strong> Nu salvați niciodată fișierele recuperate pe discul deteriorat. </p> <p><img src=\"images/image_thumb-10-286.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. (Opțional) Faceți clic pe <strong> Formate de fișiere </strong> și alegeți ce tip de fișiere doriți să recuperați. (de ex. „jpg - JPG Picture”). </p> <p><img src=\"images/image_thumb-11-487.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Apăsați în cele din urmă tasta <strong> Căutare </strong> buton. </p> <p><img src=\"images/image_thumb-12-520.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. Când procesul de scanare și recuperare este finalizat, navigați la folderul selectat (înainte) pentru a vizualiza fișierele recuperate. </p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}