{"title":"FIX: Nu se pot deschide link-uri din e-mail sau Outlook din Windows 10 în Windows 10. (Rezolvat)","content":"<p> Dacă nu puteți deschide linkuri din e-mailuri în aplicațiile Windows 10 Mail &amp; Outlook, continuați să citiți mai jos pentru a remedia problema. Mulți utilizatori au raportat că, după actualizarea Windows 10, nu vor putea deschide linkuri încorporate din e-mailuri în browserul web și vor primi o eroare necunoscută. </p> <p> Problemă în detalii: pe un computer bazat pe Windows 10, hyperlinkurile din e-mailurile din Outlook sau din aplicația Windows 10 Mail nu se deschid în browserul web, mai ales dacă folosiți ca browser implicit Chrome sau Firefox și nu Microsoft Edge . </p> <h4> Cum se remediază: imposibilitatea de a deschide linkuri HTML de la e-mailuri după actualizarea Windows 10. </h4> <h6> Metoda 1. Resetați aplicațiile implicite. </h6> <p> 1. Închideți toate browserele web deschise. <br> 2. Închideți aplicația de e-mail pe care o utilizați (de exemplu, Windows 10 Mail, Outlook) </p> <p> 3. Din meniul Start <img src=\"images/image_thumb2_thumb_thumb-709.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clic <strong> Setări </strong><img src=\"images/image_thumb-66-594.png\" alt=\"image\" loading=\"lazy\"> și faceți clic pe <strong> Aplicații </strong></p> <p><img src=\"images/image_thumb-72-875.png\" alt=\"Windows 10 Apps\" loading=\"lazy\"></p> <p> 4. Alegeți <strong> Aplicații implicite </strong> din panoul din stânga și apoi faceți clic pe <strong> Resetați </strong> pentru a reseta aplicațiile recomandate de Microsoft. </p> <p><img src=\"images/image_thumb-73-622.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 5. Acum deschideți programul de e-mail și deschideți un hyperlink dintr-un e-mail. În mod normal, linkul se va deschide fără probleme în browserul Microsoft Edge. </p> <p> 6. Acum, <strong> închide </strong> aplicația de e-mail din nou. </p> <p> 7. Deschideți browserul web și setați-l ca implicit sau navigați la <strong> Setări&gt; </strong> <strong> Aplicații&gt; Aplicații implicite </strong> și la <strong> Browser web </strong> opțiuni, faceți clic pe <strong> Microsoft Edge </strong> și selectați browserul preferat ca browser web implicit. </p> <p><img src=\"images/image_thumb-75-384.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 8. Deschideți din nou aplicația Mail și încercați să deschideți un hyperlink. Dacă problema persistă, urmați pașii din metoda-2. </p> <h6> Metoda 2. Schimbați asociațiile HTML din registru. </h6> <p> 1. Apăsați simultan Windows <img src=\"images/image_thumb36-617.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați <strong> regedit </strong> &amp; presa <strong> Introduce. </strong></p> <p><img src=\"images/image_thumb7-779.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2. În panoul din stânga, navigați la această subcheie: </p> <ul> <li><strong> HKEY_CURRENT_USER \\ Software \\ Classes \\ .html </strong></li> </ul> <p> 3. Acum <em> dublu click </em> la <strong> (Mod implicit) </strong> Strângeți în panoul din dreapta și setați datele de valoare la <strong> htmlfile </strong></p> <p><img src=\"images/image_thumb2-467.png\" alt=\"Cannot Open Links from Windows 10 Email or Outlook in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 4. Efectuați aceeași operație și modificați <em><strong> Mod implicit </strong></em> valoarea șirului la <strong> htmlfile </strong> în aceste subchei: </p> <ul> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .htm </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .shtml </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .xhtml </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .xht <br> </em></li> </ul> <p> 5. Închideți editorul de registru și <strong> repornire </strong> computerul tau. <br> 6. Încercați să deschideți hyperlinkuri din programul dvs. de e-mail. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți acest lucru. </p>"}