{"title":"FIX: Outlook 0x80042112 - Primirea erorii raportate (rezolvată)","content":"<p> Outlook 0x80042112 Primirea erorii raportate, apare de obicei atunci când Outlook încearcă să primească e-mailuri de dimensiuni foarte mari (de exemplu, e-mailuri cu atașamente mari). În acest caz, Outlook afișează următoarea eroare în timpul „Trimiteți / primiți progresul”: „Task”% Email-Account% - Receiving ”raportat eroare (0x80042112):„ Următoarele mesaje de e-mail de pe serverul de mail nu pot fi descărcate. Contactați furnizorul de servicii de internet (ISP) sau administratorul de e-mail dacă continuați să primiți această eroare. &quot; </p> <p><img src=\"images/image_thumb-7-121.png\" alt=\"FIX: Outlook 0x80042112 Receiving reported error. \" loading=\"lazy\"></p> <p> Acest tutorial conține instrucțiuni detaliate pentru a rezolva eroarea 0x80042112 de primire Outlook. </p> <h4> Cum se remediază Outlook care recepționează eroarea raportată 0x80042112. </h4> <h6> Pasul 1. Asigurați-vă că sunteți conectat la Internet. </h6> <p> Uneori, Outlook primește eroarea 0x80042112, apare deoarece conexiunea la internet este oprită. Deci, în primul rând, verificați dacă conexiunea la internet funcționează. Pentru aceasta, deschideți browserul de internet și vizitați orice site web, pentru a vă verifica conexiunea. </p> <p> </p> <h6> Pasul 2. Ștergeți mesajele de poștă electronică. </h6> <p> A doua metodă pentru a rezolva eroarea 0x80042112 în Outlook, este să ștergeți sau să treceți la schițe, toate mesajele de e-mail care au fost blocate în Cutia de ieșire. Pentru a face asta: </p> <p> 1. În Outlook, faceți clic pe <strong> Trimite primește </strong> , apoi faceți clic pe <strong> Lucrați offline </strong> . </p> <p><img src=\"images/image_thumb-8-737.png\" alt=\"Move Outbox Emails to Drafts folder\" loading=\"lazy\"></p> <p> 2. <strong> Repornire </strong> Outlook. <br> 3. Selectați <strong> Cutie de ieșire </strong> folder (în stânga) și apoi apăsați <strong> CTRL </strong> + <strong> A </strong> pentru a selecta toate e-mailurile (în dreapta). <br> 4. Faceți clic dreapta pe e-mailurile selectate și mutați-le în <strong> Proiecte </strong> dosar, făcând clic pe <strong> Mutare -&gt; Alt folder </strong> , apoi selectați <strong> Proiecte </strong> dosar din listă. </p> <p><img src=\"images/image_thumb-10-352.png\" alt=\"FIX Outlook error 0x80042112\" loading=\"lazy\"></p> <p> </p> <p> 5. Când ați terminat, faceți clic pe <strong> Trimite primește </strong> și faceți clic pe <strong> Lucrați online. <br> </strong> 6. <strong> Repornire </strong> Outlook și efectuați o trimitere / primire. </p> <h6></h6> <h6> Pasul 3. Rulați Outlook fără programe de completare. </h6> <p> O altă metodă de remediere a erorii Outlook 0x80042112 la primire, este pornirea aplicației Outlook în modul sigur și dezactivarea oricăror programe de completare care pot cauza eroarea. </p> <p> 1. Pentru a porni Outlook în modul sigur, țineți apăsat butonul <strong> CTRL </strong> (de pe tastatură) și apoi faceți dublu clic pe comanda rapidă Microsoft Outlook sau: </p> <blockquote><p> A. Apăsați simultan Windows <img src=\"images/image_thumb36-371.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> b. Tip: <strong> perspectivă / siguranță </strong> și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-14-671.png\" alt=\"outlook safe mode\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. În Outlook Safe Mode, navigați la Opțiuni de completare și <strong> dezactivați toate suplimentele </strong> . Pentru a face asta: </p> <ul> <li> Pentru a dezactiva programele de completare <strong> Outlook 2007 </strong> : </li> </ul> <blockquote><p> 1. <strong> Pe </strong> <strong> Instrumente </strong> meniu, faceți clic pe <strong> Centrul de încredere. </strong><br> 2. Selectați <strong> Adăugați ins </strong> pe panoul din stânga. <br> 3. În panoul din dreapta, selectați <strong> Suplimente COM </strong> și faceți clic pe <strong> Merge… <br> </strong> 4. <strong> Debifează </strong> toate casetele de selectare, pentru a dezactiva toate programele de completare și faceți clic <strong> O.K. </strong></p></blockquote> <ul> <li> Pentru a dezactiva programele de completare <strong> Outlook 2016, 2013 </strong> sau <strong> 2010 </strong> : </li> </ul> <blockquote><p> 1. Faceți clic pe <strong> Fişier </strong> meniu și selectați <strong> Opțiuni </strong> . <br> 2. Selectați <strong> Suplimente la </strong> panoul din stânga. <br> 3. În panoul din dreapta, selectați <strong> Suplimente COM </strong> și faceți clic pe <strong> Merge… </strong></p></blockquote> <p><img src=\"images/image_thumb-20-411.png\" alt=\"disable outlook add-ins\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. <strong> Debifează </strong> <strong> toate </strong> casetele de selectare și faceți clic pe <strong> O.K </strong> pentru a dezactiva toate programele de completare. </p> <p><strong><img src=\"images/image_thumb-21-683.png\" alt=\"turn off outlook add-ins\" loading=\"lazy\"><strong><br> </strong></strong></p> </blockquote> <p> 3. <strong> Repornire </strong> Outlook. <br> 4. Încercați să trimiteți / primiți. Dacă progresul de trimitere / primire se termină normal și fără a afișa eroarea 0x80042112, apoi continuați și reactivați unul câte unul toate pluginurile dezactivate și reporniți Outlook, până când veți găsi care dintre acestea cauzează problema. </p> <p> </p> <h6> Pasul 4. Verificați setările Antivirus și Firewall. </h6> <p> Dacă utilizați un program antivirus cu funcții de scanare a e-mailurilor, dezactivați programul de completare antivirus din Outlook (consultați instrucțiunile de la pasul 3 de mai sus) sau dezactivați temporar protecția antivirus sau dezinstalați programul antivirus. În plus, verificați setările firewall-ului și asigurați-vă că porturile serverului de e-mail pe care le utilizați nu sunt blocate din programul Firewall. Mai precis, la setările firewall: </p> <p> A. Activați următoarele fișiere pentru a accesa Internetul: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Activați următoarele porturi în Firewall: </p> <ul> <li><strong> Portul 110 </strong> (Dacă utilizați un server de poștă primită POP3 fără conexiune criptată) * </li> <li><strong> Portul 995 </strong> (Dacă utilizați un server de poștă primită POP3 cu conexiune criptată (SSL activat) </li> </ul> <ul> <li><strong> Portul 143 </strong> (dacă utilizați un server de poștă electronică de intrare IMAP fără conexiune criptată) </li> <li><strong> Portul 993 </strong> (dacă utilizați un server de poștă electronică de intrare IMAP cu conexiune criptată (SSL activat) </li> </ul> <ul> <li><strong> Portul 25 </strong> Dacă serverul dvs. de poștă electronică SMTP nu utilizează SSL. * </li> <li><strong> Portul 465 </strong> sau <strong> 587 </strong> dacă serverul dvs. de poștă electronică SMTP utilizează SSL </li> </ul> <p> * Notă: implicit, portul 25 este pentru accesul de ieșire, iar portul 110 este pentru accesul de intrare. Dacă nu sunteți sigur de porturi, contactați furnizorul de servicii Internet sau administratorul de sistem. </p> <p> </p> <h6> Pasul 5. Reparați fișierul de date Outlook PST. </h6> <p> Următorul pas pentru a remedia eroarea raportată de primire Outlook 0x80042112, este să rulați instrumentul de reparare a căsuței de e-mail pentru a repara fișierul .pst. Instrucțiunile detaliate pentru a face acest lucru pot fi găsite în acest tutorial: <a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se repară fișierul de date Outlook PST </a> . </p> <p> </p> <h6> Pasul 6. Verificați dimensiunea mesajelor de e-mail de pe WEB. </h6> <p> Dacă aveți acces la contul dvs. de e-mail pe web, conectați-vă la contul dvs. de e-mail folosind browserul web și verificați dacă dimensiunea unui e-mail este problema. De exemplu, dacă găsiți un e-mail mare în Mesaje primite, descărcați atașamentele acestuia și apoi ștergeți acel e-mail. * </p> <p> * Notă: Dacă nu aveți acces la contul dvs. de e-mail prin web, contactați furnizorul de e-mail pentru a raporta problema. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}