{"title":"FIX: Ecranul Skype Camera Black și alte probleme legate de camera web pe Windows 10.","content":"<p> Problema ecranului negru / gol al camerei Skype este una dintre cele mai frecvente probleme pe Windows 10 și poate fi cauzată de mai multe motive, așa că iată un ghid pas cu pas pentru a remedia problema. </p> <p> În Windows 10, o nouă actualizare poate provoca multe probleme cu camera web integrată, iar camera foto poate să nu funcționeze sau camera să nu fie recunoscută în unele aplicații în timp ce aceasta funcționează corect în altele. De exemplu, am văzut un caz în care, în timp ce camera funcționa fără nicio problemă în aplicațiile Webex și Zoom, afișa un ecran negru în Skype. </p> <p> Acest ghid conține instrucțiuni pas cu pas pentru a remedia mai multe probleme legate de camera integrată de pe laptopurile cu Windows 10: * </p> <ul> <li><em> Webcam / Camera nu funcționează pe Windows 10 </em></li> <li><em><em> Cameră web / Cameră foto </em> Nu mai funcționează după actualizare în Windows 10. </em></li> <li><em> Camera web nu funcționează în anumite aplicații (Skype, Windows Hello WebEx etc.). </em></li> <li><em> Camera web afișează un ecran negru (sau gol) atunci când este utilizat pe Skype. </em></li> <li><em> Camera web funcționează pe Skype, dar afișează un ecran negru în fereastra de previzualizare a camerei </em> . </li> <li> Aplicațiile nu pot recunoaște sau găsi camera / camera web </li> </ul> <p><strong> * Notificare pentru proprietarii Lenovo ThinkPad: </strong> Dacă dețineți unul dintre modelele ThinkPad enumerate în tabelul de mai jos, continuați să descărcați și să instalați acest lucru <a href=\"/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/DC8297800EA7/Integrated%20Camera%20Driver%20Registry%20Patch%20for%20Windows%2010%20(Version%201709%20or%20later)%20-%20ThinkPad\" target=\"_blank\" rel=\"nofollow noopener\"> patch de registru de la Lenovo. </a> Patch-ul remediază o problemă în care driverul de cameră integrat ar putea să nu funcționeze corect după actualizarea la Windows 10 versiunea 1709 sau o versiune ulterioară. </p> <p><img src=\"images/image_thumb-30-725.png\" alt=\"THinkpad Registry Fix for Integrated Camera\" loading=\"lazy\"></p> <h2> Cum se remediază: probleme cu camera web pe Windows 10. </h2> <p> </p> <h3> Pasul 1. Permiteți accesul camerei la aplicații. </h3> <p> În Windows 10, este posibil ca aparatul foto și microfonul să nu fie disponibile pentru aplicații din cauza setărilor de confidențialitate care s-ar fi putut aplica. Deci, continuați și permiteți aplicației cu problema camerei să vă acceseze camera. De exemplu, dacă vă confruntați cu problema camerei pe Skype, procedați după cum urmează: </p> <p> 1. Navigați pentru a merge la <strong> start </strong> meniul <img src=\"images/image_thumb-12-696.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Setări </strong> -&gt; <strong> Confidențialitate </strong> . <br> 2. Selectați <strong> aparat foto </strong> în panoul din stânga și în dreapta: </p> <blockquote><p> A. Asigura-te ca <strong> Acces la cameră pentru acest dispozitiv </strong> este <strong> pe. </strong> Dacă nu, faceți clic pe <strong> Schimbare </strong> și setat la <strong> PE. </strong><br> b. Apoi setați la <strong> Pe </strong> <strong> Permiteți aplicațiilor să vă acceseze comutatorul de cameră </strong> . </p> <p><img src=\"images/image_thumb-20-105.png\" alt=\"Allow Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Acum, derulați în jos și ... </p> <p> c. Dacă vă confruntați cu problema ecranului negru al camerei pornit <strong> Skype </strong> stocați aplicația, derulați în jos și la <strong> Alegeți ce aplicații Microsoft Store vă pot accesa camera </strong> secțiune, set <strong> Skype </strong> la <strong> Pe. </strong></p> <p><img src=\"images/image_thumb-21-826.png\" alt=\"Allow Store Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> d. Dacă vedeți o fereastră cu ecran negru a camerei în timp ce utilizați <strong> Skype pentru Windows </strong> (aplicație desktop), apoi asigurați-vă că <strong> Permiteți aplicațiilor desktop să vă acceseze camera </strong> comutatorul este <strong> Pe </strong> . </p> <p><img src=\"images/image_thumb-22-558.png\" alt=\"Allow Applications to Access Camera Windows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h3> Pasul 2. Verificați dacă camera dvs. funcționează corect. </h3> <p> Unul dintre primii pași în depanarea camerei dvs. web este să confirmați că funcționează în aplicația Windows 10 Camera. </p> <p> 1. În caseta Căutare, tastați <strong> aparat foto </strong> pentru a deschide aplicația Cameră foto. <br> 2. Faceți clic pe lupă și căutați „ <strong> aparat foto </strong> &quot;. <br> 3. Deschideți <strong> aparat foto </strong> cerere </p> <p><img src=\"images/image_thumb-23-730.png\" alt=\"Open Camera app Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Acum, conform rezultatului, procedați după cum urmează: </p> <blockquote><p> A. Dacă camera dvs. funcționează, ar trebui să vă vedeți imaginea pe ecran. În acest caz, continuați și verificați camera dvs. pe Skype sau în orice altă aplicație pe care o utilizați. Dacă camera web nu funcționează sau afișează un ecran negru, aplicați pașii de mai jos în ordine: </p> <ol> <li> Încearcă <strong> dezinstalați </strong> și <strong> reinstala </strong> aplicația cu problema camerei (de ex. Skype). </li> <li> Continuați cu Activarea sau dezactivarea modului Frame Server în registry urmând instrucțiunile de pe <a href=\"#step-3\" target=\"_blank\" rel=\"nofollow noopener\"> pasul 3 </a> . </li> </ol> <p> B. Dacă camera dvs. nu funcționează nici în aplicația Cameră foto, se poate întâmpla unul dintre următoarele lucruri: </p> <ol> <li> Driverul dispozitivului camerei este incorect sau deteriorat. În acest caz, continuați să depanați driverele camerei urmând instrucțiunile de pe <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> pasul 4 </a> . </li> <li> Camera este deteriorată și nu funcționează deloc. În acest caz, accesați un atelier de reparații pentru computer pentru a vă repara camera web sau utilizați o cameră USB externă. </li> </ol> </blockquote> <h3></h3> <h3> Pasul 3. Remediați problema ecranului negru al camerei web în registrul Windows 10. </h3> <p> Dacă camera este recunoscută și funcționează fără probleme în unele aplicații, dar nu funcționează în altele sau afișează un ecran negru pe Skype, încercați să dezactivați sau să activați „Modul serverului cadru” în registru. </p> <p> 1. Deschideți Registry Editor: pentru a face acest lucru: </p> <blockquote><p> 1. Apăsați Windows <img src=\"images/image_thumb41-284.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați <strong> regedit </strong> și apăsați <strong> introduce </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-845.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> 3. În Registry Editor navigați la următoarea cheie din panoul din stânga: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows Media Foundation \\ Platform </li> </ul> <p> 4. <strong> Click dreapta </strong> într-un spațiu gol din panoul din dreapta și selectați <strong> Nou -&gt; Valoare DWORD (32 de biți). </strong></p> <p><img src=\"images/image_thumb-24-839.png\" alt=\"Fix Webcam black Screen Windows 10\" loading=\"lazy\"></p> <p> 5. Dă numele <strong> EnableFrameServerMode </strong> la noua valoare. <br> 6. Faceți dublu clic pe valoarea nou creată și asigurați-vă că datele despre valoare sunt <strong>0</strong> . (Zero). Clic <strong> O.K. </strong></p> <p><img src=\"images/image_thumb-25-764.png\" alt=\"Fix Webcam issues Windows 10\" loading=\"lazy\"></p> <p> 7. Acum, urmați aceiași pași de mai sus (4,5 și 6) și efectuați aceleași modificări la această cheie: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ WOW6432Node \\ Microsoft \\ Windows Media Foundation \\ Platform </li> </ul> <p> 8. Când ați terminat, <strong> închide </strong> Editor de registru și <strong> repornire </strong> computerul dvs. <br> 9. După repornire, lansați Skype și verificați dacă problema cu WebCam a fost rezolvată. Dacă nu, urmați aceiași pași, dar de data aceasta <strong> permite </strong> <strong> EnableFrameServerMode </strong> prin schimbarea valorii sale din <strong>0 </strong> la <strong> 1 </strong> și <strong> repornire </strong> computerul din nou. </p> <p> </p> <h3> Pasul 4. Depanarea driverului camerei web. </h3> <p> Următorul pas, pentru a remedia problemele camerei în Windows 10, este să reveniți sau să dezinstalați / reinstalați driverele camerei. 1. Deschideți <strong> Manager de dispozitiv </strong> . Pentru a face asta: </p> <blockquote><p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-696.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. În caseta „Deschidere”, tastați: <strong> devmgmt.msc </strong> &amp; faceți clic <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-5-837.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Extindeți <strong> Imaginați-vă dispozitivele </strong> (sau <strong> Camere foto </strong> ) <br> 3. <strong> Click dreapta </strong> pe dumneavoastră <strong> aparat foto </strong> și alegeți <strong> Proprietăți. </strong></p> <p><img src=\"images/image_thumb-26-673.png\" alt=\"Camera Properties\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 4. Selectați <strong> Conducător auto </strong> filă și procedați după cum urmează, în funcție de cazul dvs.: </p> <blockquote><p> A. Dacă camera dvs. web funcționa înainte, <strong> Reveniți pe driver </strong> și <strong> restar </strong> t computerul. Apoi verificați dacă camera dvs. funcționează. </p> <p><img src=\"images/image_thumb-27-454.png\" alt=\"Roll Back Driver - Camera\" loading=\"lazy\"></p> <p> </p> <p> B. Dacă camera dvs. nu a funcționat niciodată înainte sau dacă este prima dată când încercați camera (de exemplu, după o nouă instalare Windows), încercați următoarele în această ordine: </p> <ol> <li> Apasă pe <strong> Actualizați driver-ul </strong> opțiune, pentru a verifica dacă există un driver actualizat al camerei. Dacă Windows găsește un driver nou, instalați-l, apoi verificați camera web. In caz contrar… </li> <li> Clic <strong> Dezinstalați dispozitivul </strong> pentru a dezinstala camera web și apoi <strong> repornire </strong> computerul dvs. După repornire, verificați dacă camera dvs. funcționează. Dacă nu… </li> <li> Navigați la site-ul de asistență al producătorului laptopului și verificați dacă este disponibil un nou driver pentru camera dvs. web și instalați-l. </li> </ol> </blockquote> <h3> Ajutor suplimentar pentru remedierea problemelor aparatului foto pe Windows 10. </h3> <p> Dacă aveți în continuare probleme cu camera web după pașii de mai sus, încercați următoarele: </p> <ol> <li> <p> Instalați toate actualizările disponibile pentru Windows 10 ( <strong> start </strong> -&gt; <strong> Setări </strong> -&gt; <strong> Actualizare și securitate </strong> și faceți clic pe <strong> Verifică pentru actualizări). </strong></p> </li> <li> <p> Actualizați Windows 10 la cea mai recentă versiune utilizând <strong> Asistent de actualizare. </strong> (Pentru a face acest lucru, navigați la acest lucru <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"noopener\"><strong> legătură </strong></a> și faceți clic pe <strong> Actualizează acum </strong> buton). </p> </li> <li> <p><a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"noopener\"><strong> Reîmprospătați Windows 10 </strong> . </a></p> </li> </ol> <p> Asta-i tot oameni buni! A funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}