{"title":"FIX: Se pare că ați început un upgrade și ați pornit de pe suportul de instalare (rezolvat)","content":"<p> Următoarea problemă poate apărea dacă încercați să efectuați o instalare curată sau o actualizare de reparare a Windows 10 de pe un suport de instalare: „Se pare că ați început un upgrade și ați pornit de pe suportul de instalare. Dacă doriți să continuați cu actualizarea, eliminați media de pe computer și faceți clic pe Da. Dacă doriți să efectuați o instalare curată, faceți clic pe Nu &quot;. </p> <p><img src=\"images/image_thumb-36-818.png\" alt=\"FIX: It looks like you started an upgrade and booted from installation media \" loading=\"lazy\"></p> <p> </p> <p> Mesajul de eroare de mai sus înseamnă că ați întrerupt actualizarea Windows 10 odată ce a început. După cum indică mesajul, dacă doriți să efectuați o instalare curată a Windows 10, trebuie să selectați „Nu” pentru a continua, în caz contrar, eliminați suportul de instalare și faceți clic pe „Da” pentru a continua actualizarea Windows 10. </p> <p> În general, mesajul de mai sus nu este o problemă, dar devine o mare problemă dacă actualizarea Windows nu reușește să se instaleze sau dacă Windows 10 s-a blocat pe buclă după ce ați încercat să instalați actualizări și doriți să reparați Windows 10 pornind de la o instalare mass-media. </p> <p> În acest tutorial veți găsi instrucțiuni detaliate despre cum să ocoliți mesajul „Se pare că ați început un upgrade și ați pornit de pe suportul de instalare”, prin anularea procesului de actualizare în curs de desfășurare a Windows 10, pentru a efectua o reparație Windows 10 faceți upgrade de pe suportul de instalare. </p> <h4> Cum se anulează actualizarea Windows 10 în curs dacă Windows nu poate porni * </h4> <p><strong> * Important: </strong> Dacă puteți porni în Windows 10, dar nu puteți instala actualizarea din mediul Windows, aplicați mai întâi următoarele acțiuni: </p> <blockquote><p> 1. Navigați la <strong> start </strong> &gt; <strong> Setări </strong> &gt; <strong> Actualizare și securitate </strong> și faceți clic pe „Reporniți acum”, pentru a începe procesul de actualizare. <br> 2. După prima repornire, lăsați progresul „Lucrul la actualizări” pentru a merge la 1-2%. <br> 3. După ce ați terminat, apăsați tasta <strong> Putere </strong> pentru 10-15 secunde, pentru a opri complet computerul. <br> 4. Conectați suportul de instalare Windows și porniți computerul. <br> 5. Urmați pașii de rest pentru a anula actualizarea în curs. </p></blockquote> <p> </p> <h6> Pasul 1. Anulați acțiunile în așteptare Windows Update. </h6> <p> 1. Porniți sistemul de pe un suport de instalare Windows. <br> 2. Când apare mesajul „Se pare că ați început un upgrade și ați pornit de pe suportul de instalare ...”, apăsați pe <strong> SCHIMB </strong> + <strong> F10 </strong> tastele pentru a lansa promptul de comandă. </p> <p><img src=\"images/image_thumb-37-729.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. La promptul de comandă, obțineți o listă cu toate unitățile, pe sistemul dvs., cu această comandă: </p> <ul> <li><strong> wmic logicdisk obține numele </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-991.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> </p> <p> 4. Apoi aflați care unitate conține folderul „Windows”, tastând această comandă: * </p> <p> </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * de exemplu. Pentru a vedea conținutul unității C: tastați: &quot; <strong> dir C: </strong> &quot;(fără ghilimele). Dacă nu puteți vedea folderul&quot; Windows &quot;de pe unitatea C:, continuați cu următoarea literă a unității (de exemplu,&quot; dir D: &quot;,&quot; dir E: &quot;etc.), până când vedeți Dosarul „Windows” de pe una dintre unitățile enumerate (din comanda de mai sus). </p> <p> De exemplu: După cum puteți vedea la captura de ecran de mai jos, folderul Windows (în acest exemplu) este situat la <strong> D </strong> : conduce.] </p> <p><img src=\"images/image_thumb-69-578.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Odată ce ați găsit pe ce unitate se află unitatea „Windows” (de exemplu la unitatea „D:” în acest exemplu), navigați la acea unitate tastând DriveLetter <strong> : </strong> + <strong> introduce </strong> . </p> <p> 6. Apoi creați un folder zero pe unitatea Windows tastând această comandă: </p> <p> </p> <ul> <li><strong> mkdir D: \\ Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-229.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Apoi dați comanda de mai jos pentru a reveni la acțiunile în așteptare ale actualizării în curs: </p> <ul> <li><strong> DISM / Image: D: \\ / ScratchDir: D: \\ Scratch / Cleanup-Image / RevertPendingActions </strong></li> </ul> <p> * Notă: Schimbați litera unității <strong> D </strong> după caz. </p> <p> 8. După executarea comenzii DISM de mai sus, trebuie să primiți următorul mesaj pe ecran: </p> <p> &quot; <em> Revenirea acțiunilor în așteptare din imagine…. <br> Operațiunea s-a încheiat. Revenirea acțiunilor în așteptare va fi încercată după repornire. <br> Operațiunea a fost încheiată cu succes.&quot; </em></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"DISM - RevertPendingActions\" loading=\"lazy\"></p> <p> </p> <p> 9. Închideți fereastra de comandă, eliminați suportul de instalare și lăsați Windows să pornească normal. </p> <p> 10. După repornire, ar trebui să vedeți următorul mesaj pe ecran: „Anularea modificărilor aduse computerului”. Când acest proces se încheie, Windows ar trebui să înceapă normal. </p> <p><img src=\"images/image_thumb-39-836.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Pasul 2. Eliminați fișierele de actualizare cu Curățarea discului. </h6> <p> După pornirea în Windows 10, trebuie să pregătiți Windows 10 pentru repararea / actualizarea USB, ștergând actualizările deja descărcate cu instrumentul Curățare disc. Pentru a face asta: </p> <p> 1. Deschideți File Explorer, faceți clic dreapta pe unitatea C: și selectați <strong> Proprietăți </strong> . <br> 2. Faceți clic pe <strong> Curățarea discului </strong> buton. </p> <p><img src=\"images/image_thumb_thumb-190.png\" alt=\"Disk cleanup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Apoi faceți clic pe <strong> Curățați fișierele de sistem </strong> . </p> <p><img src=\"images/image_thumb-40-950.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Acum verificați pentru a elimina următoarele fișiere și faceți clic <strong> O.K </strong> : </p> <ul> <li> <ul> <li> <ul> <li> Windows Update Cleanup. </li> <li> Windows Defender Antivirus. </li> <li> Fișiere de program descărcate. </li> <li> Fișiere temporare de internet. </li> <li> Instalări Windows anterioare. </li> <li> Cos de gunoi. </li> <li> Fișiere temporare. </li> <li> Fișiere temporare de instalare Windows </li> </ul> </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-41-458.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Când a fost întrebat, <strong> Sterge fisierele </strong> . </p> <p><img src=\"images/image_thumb-42-931.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Când curățarea este finalizată, închideți proprietățile discului și continuați cu pasul următor. </p> <p> </p> <h6> Pasul 3. Ștergeți folderul „SoftwareDistribution”. </h6> <p> „C: \\ Windows \\ <strong> Distribuirea software-ului </strong> &quot;folder, este locația în care Windows stochează actualizările Windows. De multe ori, acest folder devine deteriorat și trebuie să-l recreați pentru a descărca din nou actualizările de la zero. Deci, procedați după cum urmează: </p> <p><strong> 1. Opriți serviciul Windows Update: </strong> Pentru a face asta: </p> <blockquote><p> A. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> b. În caseta Căutare, tastați: <strong><em> services.msc </em></strong> &amp; faceți clic pe <strong> O.K </strong> . </p></blockquote> <p><img src=\"images/image_thumb-12-264.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> c. În panoul de control Servicii localizați „ <strong> Windows Update&quot; </strong> serviciu. <br> d. Faceți clic dreapta pe <strong> Windows Update </strong> service și selectați „ <strong> Stop </strong> &quot;. </p></blockquote> <p><img src=\"images/image_thumb-9-434.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. Ștergeți folderul SoftwareDistribution. </strong></p> <blockquote><p> A. Deschideți Windows Explorer și navigați la: <strong> C: \\ Windows </strong> pliant. <br> b. Gaseste si <strong> Șterge </strong> &quot; <strong><em> Distribuirea software-ului </em></strong> „folder (sau redenumiți-l. de ex. în„ SoftwareDistributionOLD ”). </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-10-140.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Reporniți computerul </strong> pentru a aplica modificări. </p> <p> </p> <h6> Pasul 4. Actualizați Windows 10 de pe suportul de instalare. </h6> <p> Acum, sunteți gata să reparați-actualizați Windows 10 de pe un suport de instalare. Pentru a face asta: </p> <p> 1. <strong> Reporniți </strong> computerul dvs. și <strong> cizmă </strong> de pe Windows USB (sau DVD) <strong> suport de instalare </strong> . <br> 2. La Expertul de configurare Windows, apăsați <strong> Următorul </strong> și apoi faceți clic pe <strong> Instaleaza acum </strong> . <br> 3. <strong> Accept </strong> „Acordul de licență”. <br> 4. Când vi se solicită, selectați Upgrade <strong> : Instalați Windows și păstrați fișierele, setările și aplicațiile </strong> . </p> <blockquote><p><img src=\"images/image_thumb8_thumb-241.png\" alt=\"image_thumb8\" loading=\"lazy\"></p></blockquote> <p> 5. Apoi urmați instrucțiunile de pe ecran pentru a face upgrade Windows 10. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}