{"title":"FIX: Nu există versiuni anterioare disponibile în Windows 10 (rezolvat)","content":"<p> Pe un computer bazat pe Windows 10 cu <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Protecția sistemului </a> activată, apare următoarea problemă atunci când încercați să restaurați un fișier / dosar utilizând funcția „Restabiliți versiunile anterioare”: „Nu există versiuni anterioare disponibile”. </p> <p> <img src=\"images/image_thumb-39-628.png\" alt=\"There No Previous Versions Available in Windows 10 \" loading=\"lazy\"></p> <p> </p> <p> Eroarea „Nu există versiuni anterioare disponibile” apare deoarece în Windows 10 funcția „Restaurare versiuni anterioare” funcționează numai dacă ați configurat „ <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Istoricul fișierelor </a> &#39;pentru a face copii de rezervă ale fișierelor. Aceasta înseamnă că funcția „Restore Anterior Versions” în Windows 10, analizează locația de rezervă a „Instrumentului de backup al istoricului fișierelor” pentru a găsi o versiune anterioară a unui fișier / folder și nu la punctele de restaurare a sistemului, așa cum se întâmplă în Windows 7. Pentru a activa Istoricul fișierelor în Windows 10, urmați instrucțiunile de pe următoarele articole: </p> <ul> <li><strong> Articole similare: </strong></li> <li> <ul> <li><a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se face backup fișierelor personale cu istoricul fișierelor în Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să creați copii Shadow ale fișierelor dvs. cu Task Scheduler în Windows 10 </a></li> </ul> </li> </ul> <h4> Cum se remediază: nu există versiuni anterioare de fișiere disponibile în Windows 10. </h4> <p> Dacă &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Istoricul fișierelor </a> &#39;este deja activat * pe computerul dvs. Windows 10, dar primiți mesajul „Nu există versiuni anterioare disponibile”, când încercați să restaurați versiunea anterioară a unui fișier sau folder, urmați instrucțiunile de mai jos: </p> <p> * Notă: Instrucțiunile de mai jos <strong> nu funcționează dacă <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Istoricul fișierelor nu este DEJA activat </a></strong> pe computerul dvs. Windows 10. </p> <p> 1. Descărcați și instalați <a href=\"http://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowExplorer </a> utilitar de pe computer. <br> 2. Deschideți „ShadowExplorer” și selectați data de unde doriți să restaurați fișierul. * </p> <p> * Notă: dacă nu vedeți o dată anterioară, înseamnă că Istoricul fișierelor este dezactivat. Rețineți că, chiar dacă activați Istoricul fișierelor acum, rezultatul va fi același, deoarece Istoricul fișierelor creează instantanee ale fișierelor dvs. din momentul în care este activat și apoi. </p> <p><img src=\"images/image_thumb-40-348.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Navigați la locația de stocare a fișierului / folderului pe care doriți să îl restabiliți la versiunea sa anterioară. <br> 4. Când localizați fișierul pe care doriți să îl restaurați, faceți clic dreapta pe el și selectați <strong> Export </strong> . </p> <p><img src=\"images/image_thumb-41-653.png\" alt=\"restore previous versions shadow explorer\" loading=\"lazy\"></p> <p> </p> <p> 5. Selectați un alt disc (locație) pentru a salva fișierul restaurat și faceți clic <strong> O.K </strong> . * </p> <p><strong> Important: </strong> Salvați fișierele restaurate pe alt disc (de exemplu, o unitate flash) și numai după ce vă asigurați că aveți fișierele corecte, copiați-le în locația originală pentru a evita suprascrierea fișierelor originale. </p> <p><img src=\"images/image_thumb-38-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această problemă. </p>"}