{"title":"FIX: Adobe Acrobat Reader DC Versiune mai nouă deja instalată - Eroare 1722 (rezolvată)","content":"<p> Următoarea problemă a fost întâmpinată pe un computer bazat pe Windows: Adobe Acrobat Reader DC nu se instalează deoarece „Versiunea mai nouă este deja instalată”. Ciudat de această problemă este că Adobe Reader DC nu a fost instalat pe aparat, deoarece nu există nicio urmă a programului Adobe Reader sau fișiere, nici pe programele Adăugare / Eliminare, nici pe hard disk. </p> <p><img src=\"images/image_thumb-19-522.png\" alt=\"Adobe Acrobat Reader DC Newer Version already installed – Error 1722 - fix\" loading=\"lazy\"></p> <p> </p> <p> În plus, la depanarea problemei de instalare „o nouă versiune deja instalată” a programului Adobe Reader DC, a apărut următorul mesaj de eroare la încercarea de instalare a programului utilizând <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Pachetul de distribuție Adobe Acrobat Reader DC </a> : &quot;Eroare 1722. Există o problemă cu acest pachet Windows Installer. Un program rulat ca parte a setării nu s-a finalizat așa cum era de așteptat. Contactați personalul de asistență sau furnizorul de pachete ...&quot; </p> <p><img src=\"images/image_thumb-20-398.png\" alt=\"Acrobat reader Error 1722 There is a problem with this Windows Installer package\" loading=\"lazy\"></p> <p> </p> <p> Acest tutorial conține pași detaliați și instrucțiuni pentru a rezolva următoarele erori la instalarea Adobe Reader DC: „O nouă versiune deja instalată” și „Eroarea 1722. Există o problemă cu acest pachet Windows Installer” în sistemul de operare Windows 10/8/7. </p> <h4> Cum se remediază problemele de instalare Adobe Acrobat Reader DC: Versiunea mai nouă este deja instalată - Eroare 1722 Problemă cu pachetul de instalare. </h4> <h6> Metoda 1. Eliminați produsele Adobe Acrobat cu Acrobat Cleaner Tool. </h6> <p> Primul pas pentru a remedia problemele de instalare ale Adobe Reader DC este de a elimina toate instalările anterioare ale Adobe Acrobat și Adobe Reader, utilizând <a href=\"https://labs.adobe.com/downloads/acrobatcleaner.html\" target=\"_blank\" rel=\"nofollow noopener\"> Utilitarul Acrobat Reader DC și Adobe Acrobat DC Cleanup </a> * și apoi pentru a instala <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> Adobe Reader DC </a> . </p> <p> * Instrumentul Adobe Reader și Acrobat Cleaner este conceput pentru a curăța instalațiile corupte Adobe Acrobat și Adobe Reader, inclusiv eliminarea sau remedierea fișierelor corupte, eliminarea sau modificarea permisiunilor intrărilor de registry etc. </p> <p><img src=\"images/image_thumb-21-370.png\" alt=\"Acrobat Reader DC & Adobe Acrobat DC Cleanup tool\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Metoda 2. Rulați Programul de instalare și dezinstalare a programului Microsoft. </h6> <p> 1. Descărcați fișierul <a href=\"https://support.microsoft.com/en-us/help/17588/fix-problems-that-block-programs-from-being-installed-or-removed\" target=\"_blank\" rel=\"nofollow noopener\"> Program de instalare și dezinstalare instrument de depanare </a> de la Microsoft. <br> 2. Rulați programul descărcat și faceți clic pe următorul în primul ecran. <br> 3. Când vi se solicită, faceți clic pe <strong> Dezinstalare </strong></p> <p><img src=\"images/image_thumb-22-965.png\" alt=\"Program Install & Uninstall Troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 4. Selectați <strong> Adobe Acrobat Reader DC </strong> program și selectați <strong> Următorul </strong> . * Apoi urmați instrucțiunile de pe ecran pentru a remedia problema. </p> <p> * Notă: dacă nu vedeți „Adobe Acrobat Reader DC” în listă, faceți clic pe <strong> Anulare </strong> și rulați din nou instrumentul de depanare. Dar, de data aceasta, alegeți „Instalare” când vi se solicită. </p> <p><img src=\"images/image_thumb-23-917.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Metoda 3. Instalați Adobe Reader utilizând pachetul complet de instalare DC Acrobat Reader. </h6> <p> Încercați să instalați Adobe Reader DC folosind <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Pachetul de distribuție Adobe Acrobat Reader DC </a> . </p> <p> </p> <h6> Metoda 4. Porniți serviciul Windows Installer. </h6> <p> 1. Deschideți panoul de control Servicii Windows: Pentru aceasta: </p> <ul> <li> Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-698.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. </li> <li> În caseta Căutare, tastați: <strong> services.msc </strong> &amp; faceți clic pe <strong> O.K </strong> . </li> <li> (Acceptați avertismentul UAC dacă apare). </li> </ul> <p><img src=\"images/image_thumb-12-635.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. În panoul de control Servicii faceți clic dreapta la <strong> Windows Installer s </strong> ervice și faceți clic <strong> start </strong> . * </p> <p> * Notă: Dacă serviciul este pornit, faceți clic pe <strong> Repornire </strong> . </p> <p><img src=\"images/image_thumb-24-258.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Metoda 5. Înregistrați din nou serviciul Windows Installer. </h6> <p> 1. Deschideți <strong> Prompt de comandă ca administrator. <br> </strong> 2. Tastați următoarele comenzi în ordine (apăsați Enter după ce ați tastat fiecare comandă) </p> <ul> <li><strong> msiexec / anulați înregistrarea </strong></li> <li><strong> msiexec / regserver </strong></li> </ul> <p><img src=\"images/image_thumb-25-162.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Închideți fereastra de comandă și <strong> repornire </strong> computerul tau. <br> 4. Încercați să instalați Acrobat Reader DC. </p> <p> </p> <h6> Metoda 6. Instalați Windows Updates și Visual C ++. </h6> <p> 1. Instalați toate actualizările Windows disponibile. <br> 2. Instalați ambele versiuni x86 și x64 ale <a href=\"https://www.microsoft.com/en-in/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Pachete redistribuibile Visual C ++ pentru Visual Studio 2013 </a><br> 3. Instalați ambele versiuni x86 și x64 ale <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48145\" target=\"_blank\" rel=\"nofollow noopener\"> Pachete redistribuibile Visual C ++ pentru Visual Studio 2015 </a><br> 4. Încercați să instalați Acrobat Reader DC. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}