{"title":"FIX: Eroare de corupție a fișierului de date Outlook. (Rezolvat)","content":"<p> Tutorialul conține instrucțiuni detaliate despre cum să reparați corupția fișierului de date Outlook în Outlook 2019, 2016, 2013, 2010 sau 2007. Corupția fișierului de date Outlook poate fi cauzată din mai multe motive. (de exemplu, după o întrerupere a alimentării, unitatea de disc deteriorată, probleme de conectivitate la rețea etc.) și, atunci când se întâmplă, împiedică Outlook să înceapă normal cu erori &quot;Au fost detectate probleme cu unul dintre fișierele de date Outlook utilizate în prezent. Acest proces și toate celelalte utilizarea acestui fișier se va închide în x secunde. Va trebui să relansați Outlook pentru a repara fișierul. &quot; </p> <p><img src=\"images/image_thumb-3-839.png\" alt=\"FIX: Outlook Data File Corruption\" loading=\"lazy\"></p> <p> Pentru a repara fișierul de date Outlook corupt și pentru a rezolva eroarea de corupție a fișierului de date Outlook, urmați pașii de mai jos. </p> <h4> Cum se remediază: corupția fișierului de date Outlook. </h4> <p> 1. Navigați la Panoul de control Windows. Pentru a face asta: </p> <blockquote><p> A. Tastați „panoul de control” în caseta de căutare Windows <br> b. Clic <strong> Panou de control </strong> din rezultate. </p></blockquote> <p><img src=\"images/image_thumb-53-981.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> 2. Setați <strong> Vazut de </strong> la <strong> Icoane mici </strong> pentru a vizualiza toate elementele panoului de control și apoi faceți clic pe <strong> Poștă </strong> . </p> <p><img src=\"images/image_thumb-54-211.png\" alt=\"control panel mail options\" loading=\"lazy\"></p> <p> 3. Faceți clic pe <strong> Fișiere de date </strong> buton. </p> <p><img src=\"images/image_thumb4_thumb-710.png\" alt=\"image_thumb[4]\" loading=\"lazy\"></p> <p> 4. Observați numele și locația fișierului de date „Outlook.pst” și închideți toate ferestrele deschise. * </p> <p> * Notă: dacă aveți un Exchange (cont IMAP), atunci veți vedea un fișier de date .OST (de ex. &quot;Outlook.ost&quot;). În acest caz, forțați Outlook să recreeze fișierul &quot;Outlook .OST corupt, procedând în felul următor: </p> <blockquote><p> 1. Faceți clic pe <strong> Deschide locația fișierului </strong> . <br> 2. <strong> Redenumiți </strong> datele OST pentru contul care cauzează problema (dacă aveți mai multe conturi IMAP). <br> 3. Deschideți Outlook pentru a recrea fișierul OST ... </p> <p><img src=\"images/image_thumb6_thumb-615.png\" alt=\"image_thumb[6]\" loading=\"lazy\"></p> </blockquote> <p> 5. Deschideți Windows Explorer și localizați <strong> scanpst.exe </strong> instrument de reparare la această locație: * </p> <ul> <li> C: \\ Program Files \\ Microsoft Office \\% OfficeVersion% \\ SCANPST.EXE </li> </ul> <p> * Notă: Mai jos sunt menționate locația (locațiile) fișierului „SCANPST.EXE” conform versiunii Office instalate. Dacă nu găsiți „scanpst.exe” în locațiile de mai sus, uitați-vă la: </p> <ul> <li> <ul> <li> C: \\ Program Files (x86) \\ Microsoft Office \\ root \\ Office16. </li> </ul> </li> </ul> <blockquote><p><strong> Outlook 2013 </strong><br> Windows pe 32 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office15 <br> Windows pe 64 de biți&gt; C: \\ Program Files (x86) \\ Microsoft Office \\ Office15 <br> Outlook pe 64 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office15 <br> Faceți clic pentru a rula&gt; C: \\ Program Files \\ Microsoft Office 15 \\ root \\ office15 <br> <strong><br> Outlook 2010 </strong><br> Windows pe 32 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office14 <br> Windows pe 64 de biți&gt; C: \\ Program Files (x86) \\ Microsoft Office \\ Office14 <br> Outlook pe 64 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office14 <br> <strong><br> Outlook 2007 </strong><br> Windows pe 32 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office12 <br> Windows pe 64 de biți&gt; C: \\ Program Files (x86) \\ Microsoft Office \\ Office12 </p></blockquote> <p> 6. Faceți dublu clic pe <strong> deschis </strong> SCANPST.EXE <br> 7. Faceți clic pe <strong> Naviga </strong> . </p> <p><img src=\"images/image_thumb-55-340.png\" alt=\"scanpst.exe\" loading=\"lazy\"></p> <p> </p> <p> 8. Găsiți și selectați fișierul de date Outlook corupt (de exemplu, Outlook.pst) și faceți clic <strong> O.K. </strong></p> <p> 9. Apăsați tasta <strong> Scanează </strong> apăsați butonul și aveți răbdare până când instrumentul de reparare a căsuței de e-mail repară fișierul deteriorat. * </p> <p> * Notă: În faza finală de reparație, veți fi întrebat dacă doriți să creați o copie de rezervă. Răspuns &quot; <strong> da </strong> „pentru a continua operațiunea de reparații. </p> <p><img src=\"images/image_thumb-56-120.png\" alt=\"Outlook Inbox Repair Tool\" loading=\"lazy\"></p> <p> </p> <p> 10. Când procesul de reparare este finalizat, deschideți Outlook. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}