{"title":"FIX: Unitățile afișate de două ori în panoul de navigare din Windows 10 (rezolvat)","content":"<p> În acest tutorial veți primi instrucțiuni pentru a remedia următoarea problemă ciudată în Windows 10: Unitățile afișate de două ori în Panoul de navigare. Aspectul duplicat al unităților în panoul de navigare este o nouă funcție Windows 10, care ajută utilizatorul să exploreze cu ușurință conținutul unitatea atașată, fără a fi nevoie să extindeți meniul „Acest computer”. Dar această caracteristică devine enervantă, deoarece dacă folosiți meniul „Acest computer” deschis, aceeași unitate este afișată de două ori în panoul de navigare. </p> <p><img src=\"images/image_thumb-22-749.png\" alt=\"Drives Displayed Twice in Navigation Pane of Windows 10\" loading=\"lazy\"></p> <p> Dacă vedeți intrări duplicate ale unităților USB atașate sau ale unităților fixe în Windows 10, urmați instrucțiunile de mai jos pentru a rezolva problema. </p> <h4> Cum se elimină literele de unitate duplicate în Windows 10 Explorer (meniul de navigare). </h4> <p> Pentru a preveni Windows 10, pentru a afișa de două ori o unitate atașată sau fixă, aplicați următoarele modificări de registry: </p> <p> 1. Deschideți Registry Editor. pentru a face asta: </p> <blockquote><p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-493.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. În caseta Căutare, tastați <strong> regedit </strong> și apăsați <strong> introduce </strong> pentru a lansa Editorul de registru. </p></blockquote> <p><img src=\"images/image_thumb7-138.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Apoi navigați la această cheie de registry: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows \\ CurrentVersion \\ Explorer \\ Desktop \\ NameSpace \\ DelegateFolders </li> </ul> <p> 3. Apoi faceți clic dreapta și ștergeți <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> cheie. </p> <p><img src=\"images/image_thumb-23-428.png\" alt=\"remove duplicate drive entries windows 10 navigation pane\" loading=\"lazy\"></p> <p> </p> <p> 4. Apoi navigați la această cheie: * </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ WOW6432Node \\ Microsoft \\ Windows \\ CurrentVersion \\ Explorer \\ Desktop \\ NameSpace \\ DelegateFolders </li> </ul> <p> 5. Ștergeți <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> cheie. </p> <p> 6. Închideți Editorul registrului. </p> <p> * Notă: dacă nu puteți vedea cheia „WOW6432Node”, ignorați pașii 4 și 5 de mai sus, deoarece acestea se aplică numai versiunilor Windows 10 pe 64 de biți. </p> <p><strong> BACSIS: </strong> Dacă vă schimbați decizia în viitor, faceți clic dreapta pe „DelegateFolders” în locațiile de registry de mai sus, selectați <strong> Nou </strong> -&gt; <strong> Cheie </strong> și recreați ștersul <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> cheie (chei). </p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}