{"title":"FIX: Relația de încredere între această stație de lucru și domeniul primar nu a reușit (rezolvat)","content":"<p> Dacă primiți eroarea „Relația de încredere între această stație de lucru și domeniul primar nu a reușit” atunci când încercați să vă autentificați în domeniul dvs. sau când încercați să accesați un folder partajat pe o altă mașină din domeniu, continuați să citiți mai jos pentru a rezolva problema. </p> <p> Eroarea „Relația de încredere între stația de lucru și domeniul principal nu a reușit”, poate apărea din următoarele motive: </p> <ul> <li> Computerul are același nume ca un alt computer din domeniu. </li> <li> Acreditările de domeniu (numele de utilizator sau parola) sunt nevalide. </li> <li> Contul computerului a expirat. * </li> </ul> <p> * Notă: Unele organizații pre-construiesc calculatoare (sau clone de computer) pentru utilizare ulterioară. Dacă contul computerului a expirat, acesta nu va mai putea să se autentifice cu domeniul. În astfel de cazuri, computerele care nu se pot autentifica cu domeniul trebuie să fie eliminate din domeniu și să se alăture din nou acestuia. (pasul 4) </p> <p><img src=\"images/image_thumb-32-740.png\" alt=\"FIX: Trust Relationship Between this Workstation and the Primary Domain Failed \" loading=\"lazy\"></p> <h4> Cum se remediază: relația de încredere între stația de lucru și domeniul a eșuat. </h4> <h6> Metoda 1. Verificați dacă acreditările de domeniu sunt corecte. </h6> <p> În primul rând, asigurați-vă că acreditările sunt corecte și mai ales parola. dacă ați clonat aparatul dintr-o imagine a computerului făcută în trecut și de atunci codul s-a schimbat. </p> <h6> Metoda 2. Verificați dacă există nume duplicate ale computerelor. </h6> <p> Asigurați-vă că numele computerului este unic și că nu există niciun alt computer în rețea cu același nume. </p> <h6> Metoda 3. Verificați dacă există adrese IP duplicate. </h6> <p> Asigurați-vă că adresa IP a computerului este unică și nu intră în conflict cu altă adresă IP din rețea. </p> <h6> Metoda 4. Eliminați și reintroduceți computerul în domeniu. </h6> <p> Metoda obișnuită pentru corectarea unei relații de încredere între un computer și un domeniu este eliminarea și re-adăugarea computerului afectat domeniului. </p> <h5> Pasul 1. Ștergeți contul de computer din domeniu. </h5> <p> 1. Conectați-vă la serverul Active Directory. <br> 2. Deschideți <strong> Utilizatori și computere Active Directory. <br> </strong> 3. Extindeți <strong> Calculatoare </strong> container. <br> 4. Faceți clic dreapta pe computerul afectat și selectați <strong> Șterge. </strong></p> <p><img src=\"images/image_thumb-39-366.png\" alt=\"Delete Computer Account from Domain\" loading=\"lazy\"></p> <h5> Pasul 1. Eliminați și reintroduceți computerul în domeniu. </h5> <p> 1. Conectați-vă la computerul afectat cu contul de administrator LOCAL (Nume computer \\ Administrator). </p> <p> 2. Apăsați Windows <img src=\"images/image_thumb8_thumb-480.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. </p> <p> 2a. Tip <strong> sysdm.cpl </strong> &amp; faceți clic <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb7_thumb-169.png\" alt=\"system properties\" loading=\"lazy\"></p> <p> 3. În fila „Computer Name”, faceți clic pe <strong> Schimbare </strong> . </p> <p><img src=\"images/image_thumb-37-924.png\" alt=\"Remove Computer from Domain\" loading=\"lazy\"></p> <p> 4. La Membru de, selectați <strong> Grup de lucru </strong> , tastați un nume de grup de lucru (de ex. „GRUP DE LUCRU”) și faceți clic <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-34-169.png\" alt=\"Change Computer Name - Membership\" loading=\"lazy\"></p> <p> 5. Tastați acreditările administratorului și faceți clic <strong> O.K </strong> . <br> 6. <strong> Repornire </strong> calculatorul. </p> <p> 7. Efectuați din nou pașii 1-4, dar de data aceasta, la pasul 4, selectați <strong> Domeniu, </strong> tastați numele de domeniu și faceți clic <strong> O.K. </strong></p> <p><img src=\"images/image_thumb-38-928.png\" alt=\"Add computer to domain\" loading=\"lazy\"></p> <p> 8. Tastați acreditările administratorului de domeniu și faceți clic <strong> O.K </strong> . <br> 9. <strong> Repornire </strong> computerul dvs. și conectați-vă la domeniu utilizând contul de utilizator al domeniului. </p> <h6> Metoda 5. Resetați contul computerului în domeniu. </h6> <p> 1. Conectați-vă la serverul Active Directory. <br> 2. Deschideți <strong> Utilizatori și computere Active Directory. <br> </strong> 3. Extindeți <strong> Calculatoare </strong> container. <br> 4. Faceți clic dreapta pe computerul afectat și selectați <strong> Resetați contul. </strong></p> <p><img src=\"images/image_thumb-36-935.png\" alt=\"Reset Computer Account in Domain\" loading=\"lazy\"></p> <p> 5. În cele din urmă, <strong> repornire </strong> <strong> mașina afectată </strong> și conectați-vă în domeniu. </p> <p> Asta-i tot oameni buni! Ce metodă a funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}