{"title":"FIX Serviciul de amenințare Windows 10 sa oprit și nu poate porni (rezolvat)","content":"<p> În acest ghid veți găsi instrucțiuni pas cu pas pentru a rezolva „Eroarea neașteptată, Ne pare rău, am întâmpinat o problemă”, după ce ați apăsat butonul „Reporniți acum” pentru a porni serviciul Amenințare pentru a remedia problema „Serviciul Amenințare s-a oprit Reporniți-l acum &quot;în sistemul de operare Windows 10. </p> <p><img src=\"images/image_thumb-689.png\" alt=\"Threat Service has Stopped and Cannot Start\" loading=\"lazy\"></p> <p> </p> <p> Probleme în detalii: caracteristica Virus and Threat din Windows Defender Antivirus afișează „Necunoscut” și deoarece serviciul Threat s-a oprit și nu poate începe cu erori: </p> <ul> <li><em> Eroare neașteptată, Ne pare rău, am întâmpinat o problemă. Vă rugăm să încercați din nou. </em></li> <li><em> Pagina nu este valabila. Administratorul dvs. IT are acces limitat la unele zone ale acestei aplicații, iar elementul pe care ați încercat să îl accesați nu este disponibil. Contactați biroul de asistență IT pentru mai multe informații. </em></li> </ul> <p><img src=\"images/image_thumb-1-155.png\" alt=\"Unable to Start Threat Service. Page not available.\" loading=\"lazy\"></p> <p> </p> <h4> Cum se remediază: Serviciul de amenințare sa oprit și nu poate porni în Windows 10 Defender. </h4> <h6> Pasul 1. Eliminați orice alt antivirus. </h6> <p> Primul pas pentru a remedia eroarea „Serviciul de amenințare sa oprit” este să dezinstalați orice alt antivirus de pe computer. </p> <p> </p> <h6> Pasul 2. Activați politica Windows Defender. </h6> <p> 1. Deschideți <strong> Editor de registru </strong> : Pentru a face asta: </p> <ul> <li> Apăsați simultan Windows <img src=\"images/image_thumb36-454.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. </li> <li> Tip <strong> regedit </strong> &amp; Presa <strong> Introduce. </strong></li> </ul> <p><img src=\"images/image_thumb7-613.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Navigați la următoarea cheie din panoul din stânga: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Policies \\ Microsoft \\ Windows Defender </li> </ul> <p> 4. În panoul din dreapta schimbați valoarea „DisableAntiSpyware” de la 1 la <strong> 0 * </strong></p> <p> * Notă: Dacă nu găsiți valoarea „DisableAntiSpyware”, faceți clic dreapta pe un spațiu gol și selectați <strong> Nou </strong> -&gt; <strong> Valoare DWORD (32 de biți) </strong> și apoi dați valorii numele „ <strong> DisableAntiSpyware </strong> &quot; </p> <p><img src=\"images/image_thumb-2-284.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Închideți Registry Editor și <strong> repornire </strong> computerul dvs. <br> 6. Acum verificați dacă protecția împotriva amenințărilor este OK și dacă problema persistă continuați cu pasul următor. </p> <p> </p> <h6> Pasul 3. Activați serviciul Windows Defender Antivirus în registru. </h6> <p> 1. Deschideți Editorul registrului. <br> 2. Navigați la următoarea cheie din panoul din stânga: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ WinDefend </li> </ul> <p> 3. În panoul din dreapta modificați <strong> start </strong> valoare de la 4 la <strong> 2 </strong> . * </p> <p> * Notă: dacă nu puteți modifica valoarea registry, porniți Windows 10 în modul sigur și încercați din nou. </p> <p><img src=\"images/image_thumb-3-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Închideți Registry Editor și <strong> repornire </strong> computerul dvs. <br> 6. Acum verificați dacă protecția împotriva amenințărilor este OK și dacă problema persistă continuați cu pasul următor. </p> <p> </p> <h6> Pasul 4. REMEDIAȚI Problemele Windows Defender cu DISM. </h6> <p> Următoarea metodă de rezolvare a erorii Windows 10 Defender Security Center „Serviciul de amenințare sa oprit și nu poate porni” este să reparați Windows utilizând instrumentul DISP (System Update Readiness). </p> <p> 1. Deschideți <strong> Prompt comandă ca administrator </strong> . Pentru a face asta: </p> <ul> <li> În caseta de căutare tip: <strong> prompt de comandă </strong> sau <strong> cmd </strong></li> <li> Faceți clic dreapta la <strong> Prompt de comandă </strong> rezultă și selectează <strong> Rulat ca administrator. </strong></li> </ul> <p><img src=\"images/image_thumb-10-227.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. În promptul de comandă, dați următoarea comandă dism și apăsați <strong> Introduce: </strong></p> <ul> <li><strong> DISM.exe / Online / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-140.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> </p> <p> 3. Când operațiunea DISM este finalizată, tastați următoarea comandă și apăsați <strong> introduce </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb31-197.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Acum așteptați până când System File Checker repară fișierele de sistem Windows. <br> 5. Când se face acest lucru, <strong> repornire </strong> computerul tau. </p> <p> </p> <h6> Pasul 5. Reparați Windows 10 cu actualizarea la fața locului. </h6> <p> Metoda finală pentru a rezolva problemele de instalare a actualizării Windows 10 este să <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> reparați Windows 10 cu Up-Place Upgrade. </a></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}