{"title":"FIX: Acest mod de Windows rulează numai aplicații verificate din Magazin pe Windows 10.","content":"<p> Eroarea „Pentru securitate și performanță, acest mod al Windows rulează numai aplicații verificate din Magazin” apare atunci când Windows 10 rulează în modul S sau din cauza unei setări de pe computer, care restricționează instalarea aplicațiilor și software-urilor terțe. . </p> <p><img src=\"images/image_thumb-19-156.png\" alt=\"FIX: For security and performance, this mode of Windows only runs verified apps from the Store in Windows 10.\" loading=\"lazy\"></p> <p> Acest tutorial conține instrucțiuni pentru rezolvarea erorii „Pentru securitate și performanță, acest mod de Windows rulează numai aplicații verificate din Magazin”, atunci când se încearcă instalarea unei aplicații terțe în Windows 10. </p> <h2> Cum se permite instalarea de aplicații terțe în Windows 10. </h2> <h5> Pasul 1. Aflați versiunea instalată de Windows 10. </h5> <p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb-1-482.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați următoarea comandă și apăsați <strong> Introduce: </strong></p> <ul> <li><strong> câștigător </strong></li> </ul> <p><img src=\"images/image_thumb-13-360.png\" alt=\"See Windows 10 Installed Version\" loading=\"lazy\"></p> <p> 3. Acum, dacă vedeți în Windows Edition că rulați Windows 10 Home sau Pro, urmați instrucțiunile din <a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda-1 </a> , altfel, dacă aveți <strong> Windows 10 Home S </strong> , urmați instrucțiunile din <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda-2 </a> . </p> <p><img src=\"images/image_thumb-14-709.png\" alt=\"See Installed Windows 10 Edition\" loading=\"lazy\"></p> <p><strong> </strong></p> <p><strong> </strong></p> <h3> Metodă 1. Permiteți Windows 10 să instaleze aplicații de oriunde. </h3> <p> 1. Din meniul Start <img src=\"images/image_thumb2_thumb_thumb-909.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> faceți clic pe Setări <img src=\"images/image_thumb-66-797.png\" alt=\"image\" loading=\"lazy\"> și apoi deschideți <strong> Aplicații </strong> . </p> <p><img src=\"images/image_thumb-15-604.png\" alt=\"Windows Settings - Apps\" loading=\"lazy\"></p> <p> </p> <p> 2. În Setări aplicații și caracteristici, selectați pentru a instala aplicații din <strong> Oriunde </strong> . </p> <p><img src=\"images/image_thumb-16-670.png\" alt=\"Install Apps from Anywhere - Windows 10\" loading=\"lazy\"></p> <h3> Metoda 2. Comutați din modul Windows 10 S. </h3> <p> Windows 10 în modul S este conceput pentru securitate și performanță și, din acest motiv, nu permite să ruleze aplicații în afara magazinului Microsoft. Pentru a depăși această limitare, trebuie să ieșiți din modul S, care este un mod foarte ușor, dar rețineți că, odată ce ieșiți din modul S, nu veți mai putea reveni la Windows 10 în modul S. </p> <p> Pentru a vă deconecta de la modul Windows 10 S la Windows 10 Home: </p> <p> 1. Din meniul Start <img src=\"images/image_thumb2_thumb_thumb-829.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> faceți clic pe Setări <img src=\"images/image_thumb-66-853.png\" alt=\"image\" loading=\"lazy\"> și apoi deschideți <strong> Actualizare și securitate. </strong></p> <p> 2. Selectați <strong> Activare </strong> în stânga și apoi faceți clic pe <a href=\"//switchwindows\" target=\"_blank\" rel=\"nofollow noopener\"> Merge la magazin </a><strong> . </strong></p> <p><img src=\"images/image_thumb-17-920.png\" alt=\"Switch Out S Mode Windows 10\" loading=\"lazy\"></p> <p> 3. În pagina Închidere din modul S, faceți clic pe <strong> obține </strong> și apoi faceți clic pe <strong> Instalare. </strong> * <br> 4. În cele din urmă faceți clic pe <strong> Da, sa mergem </strong> pentru a comuta din modul S. </p> <p> * Notă: dacă după ce faceți clic pe butonul „Instalare” primiți eroarea „S-a întâmplat ceva și nu am putut începe actualizarea”, continuați și <strong> instalați toate actualizările disponibile pentru Windows 10 </strong> , <strong> reporniți computerul </strong> si incearca din nou. </p> <p><img src=\"images/image_thumb-18-502.png\" alt=\"Switch Out S Mode\" loading=\"lazy\"></p> <p> </p> <p> 4. După finalizarea instalării, veți fi informat că veți putea instala aplicații din afara magazinului Microsoft. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}