{"title":"Formularul de contact 7 nu funcționează: a apărut o eroare la trimiterea mesajului dvs. Vă rugăm să încercați din nou mai târziu. (Rezolvat)","content":"<p> Dacă formularul de contact 7 de pe site-ul dvs. WordPress nu funcționează, continuați să citiți mai jos pentru a remedia problema. Formularul de contact 7, este unul dintre cele mai faimoase pluginuri WordPress gratuite, care vă ajută să creați, să gestionați și să personalizați formularul de contact de pe site-ul dvs. WordPress. Recent, am descoperit că pluginul „Formular de contact 7” de pe site-ul meu (și în multe altele), a încetat să mai funcționeze cu eroare „A apărut o eroare la trimiterea mesajului dvs. Încercați din nou mai târziu”, care este înconjurat de un dreptunghi portocaliu , după trimiterea formularului. </p> <p><img src=\"images/image_thumb-14-729.png\" alt=\"Contact Form 7: There was an error to send your message. Please try again later\" loading=\"lazy\"></p> <p> Acest tutorial conține instrucțiuni pentru remedierea erorii &quot;A apărut o eroare la trimiterea mesajului dvs. Încercați din nou mai târziu&quot; într-o casetă portocalie, după trimiterea formularului de contact. </p> <h4> Cum se remediază: formularul de contact nu funcționează cu eroare &quot;A apărut o eroare la trimiterea mesajului dvs.&quot;. </h4> <p> Dacă Formularul dvs. de contact 7 de pe site-ul dvs. WordPress nu mai funcționează, urmați pașii de mai jos: </p> <h6> Pasul 1. Validați formularul de contact 7. </h6> <p> 1. Navigați la tabloul de bord al administratorului WordPress și faceți clic <strong> a lua legatura </strong> &gt; <strong> Formulare de contact. </strong><br> 2. În partea de sus a paginii, verificați dacă există un mesaj de eroare care spune „Configurarea greșită duce la eșecul livrării e-mailului sau la alte probleme. Validați formularele dvs. de contact acum”. <br> 3. Dacă vedeți acel mesaj, * atunci <strong> clic </strong> <strong> Validați configurația formularului de contact 7 </strong> legătură. </p> <p> * Notă: dacă nu vedeți acel mesaj, treceți la pasul 2. </p> <p><img src=\"images/image_thumb-813.png\" alt=\"Validate Contact Form 7 Configuration \" loading=\"lazy\"></p> <p> 4. În ecranul următor, faceți clic pe <strong> Validați acum 2 formulare de contact </strong> buton. </p> <p><img src=\"images/image_thumb-1-270.png\" alt=\"Validate Contact Form\" loading=\"lazy\"></p> <p> 5. Când se finalizează validarea configurației, trebuie să primiți „Nu a fost găsit niciun formular de contact nevalid”. </p> <p><img src=\"images/image_thumb-17-318.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Testați formularul de contact și, dacă eroarea persistă, continuați cu pasul 2 de mai jos. </p> <h6> Pasul 2. Configurați formularul de contact 7 cu cheile reCAPTCHA V3. </h6> <p> În timpul cercetărilor mele, am descoperit că cele mai recente versiuni ale Formularului de contact 7 (v5.1 și versiuni ulterioare) utilizează reCAPTCHA v3 API pentru a vă proteja împotriva spamului și a altor tipuri de abuz automat. Deci, pe baza acestui fapt, aveți următoarele două opțiuni pentru a rezolva eroarea formularului de contact &quot;A apărut o eroare la trimiterea mesajului dvs. Încercați din nou mai târziu.&quot;: * </p> <ul> <li> <p><strong> Opțiunea 1. </strong> Pentru a configura formularul de contact 7 cu tastele reCAPTCHA V3. </p> </li> <li> <p><strong> Opțiunea 2. </strong> Pentru a utiliza <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"noopener noreferrer\"> Formular de contact 7 - reCaptcha v2 </a> plugin pentru formularele dvs. de contact. </p> </li> </ul> <p> * Notă: În acest articol, vă voi arăta cum să configurați Formularul de contact 7 cu cheile reCAPTCHA V3. Dacă nu doriți să utilizați protecția reCAPTCHA V3, dezinstalați pluginul „Contact Form 7” și instalați <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"nofollow noopener\"> Formular de contact 7 - reCaptcha v2 </a> conecteaza. </p> <p><strong> Pentru a configura formularul de contact 7 cu cheile reCAPTCHA V3: </strong></p> <p> 1. Conectați-vă la Contul dvs. Google, pentru a configura reCAPTCHA pe site-ul dvs. și navigați la <a href=\"https://www.google.com/recaptcha/admin\" target=\"_blank\" rel=\"nofollow noopener\"> Consola de administrare reCAPTCHA de la Google. </a></p> <p> 2. Faceți clic pe Setări <img src=\"images/image_thumb-2-494.png\" alt=\"image\" loading=\"lazy\"> pictogramă. </p> <p><img src=\"images/image_thumb-3-786.png\" alt=\"Setup Contact Form 7 with recaptcha v3\" loading=\"lazy\"></p> <p> 3. Faceți clic pe <strong> Cos de gunoi </strong> pictogramă <img src=\"images/image_thumb-4-167.png\" alt=\"image\" loading=\"lazy\"> și <strong> șterge </strong> <strong> chei reCAPTCHA V2. </strong></p> <p><img src=\"images/image_thumb-5-757.png\" alt=\"Recaptcha v3\" loading=\"lazy\"></p> <p> 4. Faceți clic pe pictograma Plus <img src=\"images/image_thumb-6-851.png\" alt=\"image\" loading=\"lazy\"> pentru a vă înregistra din nou site-ul. </p> <p><img src=\"images/image_thumb-7-337.png\" alt=\"Register Site with Recaptcha\" loading=\"lazy\"></p> <p> 5. În ecranul „Înregistrați un site nou”: </p> <blockquote> <p> A. <strong> Introduceți un nume </strong> pentru a vă identifica site-ul în viitor, <br> b. <strong> Alege </strong> <strong> reCAPTCHA v3 </strong> tip. <br> c. <strong> Tip </strong> <strong> numele domeniului </strong> a site-ului dvs. <br> d. <strong> Accept </strong> <strong> Termenii și condițiile reCAPTCHA. </strong><br> e. Clic <strong> TRIMITE. </strong></p> </blockquote> <p><img src=\"images/image_thumb-8-227.png\" alt=\"Register Site with Recaptcha V3\" loading=\"lazy\"></p> <p> 6. După înregistrare, vedeți un ecran cu <strong> CHEIE SITE </strong> si <strong> CHEIE SECRETA </strong> . <br> 7. Faceți clic pe <strong> COPIAȚI CHEIA SITULUI </strong> și <strong> NU ÎNCHIDE </strong> această fereastră. </p> <p><img src=\"images/image_thumb-9-995.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. Într-o altă fereastră a browserului, navigați la tabloul de bord al administratorului WordPress și faceți clic <strong> a lua legatura </strong> &gt; <strong> Integrare. </strong></p> <p> 9. Faceți clic pe <strong> Integrare configurare </strong> buton. </p> <p><img src=\"images/image_thumb-10-834.png\" alt=\"Integrate Recaptcha in Contact Form 7\" loading=\"lazy\"></p> <p> 10. Faceți clic pe <strong> Scoateți cheile </strong> butonul pentru a șterge tastele reCAPTCHA V2. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"image\" loading=\"lazy\"></p> <p> 11. <strong> Pastă </strong> noul <strong> Cheia site-ului </strong> și apoi Copiați și lipiți noul <strong> Cheie secreta </strong> din consola de administrare reCAPTCHA și faceți clic pe <strong> Salvează modificările. </strong></p> <p><img src=\"images/image_thumb-12-147.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. <strong> Șterge </strong> <strong> Cache </strong> pe site-ul dvs. <br> 13. Deschideți o nouă fereastră de browser și testați formularul de contact. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}