{"title":"FIX: Setările hardware s-au schimbat. Vă rugăm să reporniți în Windows 10 Startup. (Rezolvat)","content":"<p> Acest ghid conține instrucțiuni pentru rezolvarea următoarei probleme la fiecare pornire Windows 10: „Setările hardware s-au modificat. Reporniți computerul pentru ca aceste modificări să aibă efect.”. </p> <p> Eroarea de pornire Windows 10 „setările hardware s-au schimbat… vă rugăm să reporniți”, poate apărea chiar și după o nouă instalare a Windows 10, în special pe computerele (desktopuri sau laptopuri) care dețin o placă grafică AMD. </p> <p><img src=\"images/image_thumb-71-941.png\" alt=\"FIX Hardware Settings Have Changed. Please Reboot - Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Cum se remediază eroarea de pornire Windows 10: setările hardware s-au modificat. Vă rugăm să reporniți computerul ... </h4> <p> 1. Deschideți panoul de control Servicii Windows: Pentru aceasta: </p> <ul> <li> Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-332.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. </li> <li> În caseta Căutare, tastați: <strong><em> services.msc </em></strong> &amp; faceți clic pe <strong> O.K </strong> . </li> </ul> <p><img src=\"images/image_thumb-12-644.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. În panoul de control Servicii, faceți clic dreapta la <strong> Utilitatea evenimentelor externe AMD </strong> serviciu și alegeți <strong> Proprietăți </strong> . </p> <p><img src=\"images/image_thumb-72-951.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Setați <strong> Tipul de pornire </strong> la <strong> Dezactivat </strong> și apoi faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-73-548.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Reporniți </strong> computerul tau. Dacă după repornire, primiți în continuare eroarea: „setările hardware s-au schimbat ... vă rugăm să reporniți”, apoi procedați după cum urmează: </p> <p> 1. Navigați la Panoul de control -&gt; <strong> Programe si caracteristici </strong> și <strong> dezinstalați </strong> toate <strong> AMD </strong> software. <br> 2. Navigați la <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Pagina de descărcare a driverelor AMD </a> pentru a descărca și instala un driver mai vechi pentru adaptorul de afișaj. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}