{"title":"FIX: Eroare de primire Outlook 0x80004005 - Operațiunea a eșuat (rezolvată)","content":"<p> Dacă vă confruntați cu eroarea de primire Outlook 0x80004005, continuați să citiți mai jos pentru a afla cum să remediați problema. Acest tutorial conține instrucțiuni pentru remedierea „Primirii erorii raportate (0x80004005) - Operațiunea a eșuat”, în Progresul trimitere / primire Outlook (Outlook 2007, Outlook 2010, Outlook 2013 sau Outlook 2016). </p> <p><img src=\"images/image_thumb-15-598.png\" alt=\"FIX: Outlook Receiving error 0x80004005 - The Operation failed\" loading=\"lazy\"></p> <p> </p> <p> Eroarea Outlook &quot;0x80004005&quot; poate apărea în orice versiune de Outlook (2003, 2007, 2010 sau 2013) și înseamnă, de obicei, că fișierul de date Outlook PST sau Profilul Outlook a fost corupt sau deteriorat din cauza unei corupții de alimentare, deteriorarea discului sau alte motive necunoscute. </p> <h4> Cum se rezolvă eroarea de primire 0x80004005 în Outlook 2003, 2007, 2010 sau 2013. </h4> <h6> Metoda 1. Dezactivați temporar protecția antivirus. </h6> <p> Dacă utilizați un program antivirus cu funcții de scanare a e-mailurilor, încercați să îl dezactivați temporar și să verificați din nou Outlook. </p> <p> </p> <h6> Metoda 2. Dezactivați notificarea prin poștă nouă în Outlook. </h6> <p> În unele cazuri, este posibil să întâmpinați eroarea 0x80004005 în procesul de primire Outlook, dacă noile notificări de e-mail sunt activate. Pentru a dezactiva alertele New Mail în Outlook 2010, 2013 sau 2016: * </p> <p> 1. Din <strong> Fişier </strong> meniu, faceți clic pe <strong> Opțiuni </strong> . <br> 2. Selectați <strong> Poștă </strong> în panoul din stânga și apoi <strong> deselectați </strong> toate casetele de selectare din secțiunea „Sosire mesaje” (în panoul din dreapta). <br> 3. Faceți clic pe <strong> O.K </strong> și <strong> repornire </strong> Outlook. * </p> <p> * Notă: pentru a dezactiva noua alertă de notificare prin e-mail în Outlook 2007: </p> <blockquote><p> 1. Faceți clic pe <strong> Instrumente </strong> -&gt; <strong> Opțiuni </strong> . <br> 2. Faceți clic pe <strong> Configurare e-mail </strong> și apoi faceți clic pe <strong> Opțiuni avansate de e-mail </strong> . <br> 3. <strong> clar </strong> toate casetele de selectare din opțiunile „Când sosesc elemente noi în căsuța de e-mail”. <br> 4. Când ați terminat, faceți clic pe <strong> O.K </strong> de două ori pentru a închide opțiunile de e-mail. <br> 5. Închideți și relansați Outlook. </p></blockquote> <p><img src=\"images/image_thumb-16-303.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Dacă Outlook afișează în continuare eroarea 0x80004005 în timpul trimiterii / primirii, anulați modificările efectuate și continuați cu următoarea metodă. </p> <p> </p> <h6> Metoda 3. Reparați fișierul de date Outlook .PST. </h6> <h5> Pasul 1. Găsiți fișierul OUTLOOK PST DATA pe disc. </h5> <p> 1. <strong> Închide </strong> Outlook. <br> 2. Navigați la <strong> Panou de control </strong> și deschis <strong> Poștă </strong> . (Dacă nu vizualizați elementul Mail, schimbați <strong> Vazut de </strong> : la <strong> Icoane mici </strong> ) </p> <p> </p> <p><img src=\"images/image_thumb-40-648.png\" alt=\"control panel all items\" loading=\"lazy\"></p> <p> </p> <p> 3. Faceți clic pe <strong> Fișiere de date </strong> buton. </p> <p><img src=\"images/image_thumb-35-600.png\" alt=\"How to find Outlook data files location.\" loading=\"lazy\"></p> <p> </p> <p> 4. Rețineți locația (calea) în care este stocat fișierul de date Outlook (de ex. Outlook.pst) pe computerul dvs. și apoi închideți Opțiuni de e-mail. </p> <p><img src=\"images/image_thumb-36-798.png\" alt=\"outlook data file location\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h5> Pasul 2. Reparați fișierul de date Outlook PST cu SCANPST </h5> <p> 1. Pentru a repara fișierele de date Outlook PST, faceți dublu clic pe „ <strong> SCANPST.EXE </strong> &quot;, din următoarea locație de pe disc: * </p> <ul> <li><strong> C: \\ Program Files \\ Microsoft Office \\% OfficeVersion% \\ SCANPST.EXE </strong></li> </ul> <p> * Notă: Locația „scanpst.exe” este diferită pentru fiecare versiune de Outlook și Windows pe care ați instalat-o. Mai jos sunt menționate locațiile fișierului „SCANPST.EXE”, conform versiunii instalate Windows și Office. </p> <blockquote><p><strong> Outlook 2013 și 2016 </strong><br> Windows pe 32 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office15 <br> Windows pe 64 de biți&gt; C: \\ Program Files (x86) \\ Microsoft Office \\ Office15 <br> Outlook pe 64 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office15 <br> Faceți clic pentru a rula&gt; C: \\ Program Files \\ Microsoft Office 15 \\ root \\ office15 <br> <strong> Outlook 2010 </strong><br> Windows pe 32 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office14 <br> Windows pe 64 de biți&gt; C: \\ Program Files (x86) \\ Microsoft Office \\ Office14 <br> Outlook pe 64 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office14 <br> <strong> Outlook 2007 </strong><br> Windows pe 32 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office12 <br> Windows pe 64 de biți&gt; C: \\ Program Files (x86) \\ Microsoft Office \\ Office12 <br> <strong> Outlook 2003 </strong><br> Windows pe 32 de biți&gt; C: \\ Program Files \\ Common Files \\ System \\ MSMAPI \\ <br> Windows pe 64 de biți&gt; C: \\ Program Files (x86) \\ Common Files \\ System \\ MSMAPI \\ </p> <p><img src=\"images/image_thumb-37-648.png\" alt=\"Repair Outlook PST Inbox Repair Tool\" loading=\"lazy\"></p></blockquote> <p> </p> <p> 2. Faceți clic pe <strong> Naviga </strong> și navigați la locația în care este stocat fișierul de date Outlook. </p> <p><img src=\"images/image_thumb-42-299.png\" alt=\"How to Repair Outlook PST Data File(s) with Inbox Repair Tool (SCANPST).\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Selectați fișierul de date Outlook pe care doriți să îl reparați. (de ex. Outlook.pst) și faceți clic <strong> O.K </strong> . <br> 4. Apăsați în cele din urmă <strong> start </strong> pentru a începe repararea. </p> <p><img src=\"images/image_thumb-39-524.png\" alt=\"How to Repair Outlook PST Data Files\" loading=\"lazy\"></p> <p> 5. Așteptați până când se finalizează Outlook PST Repair și apoi închideți utilitarul Inbox Repair Tool. <br> 6. Deschideți Outlook faceți clic pe butonul „Trimiteți și primiți”, pentru a verifica dacă s-a rezolvat eroarea 0x80004005. Dacă problema persistă, continuați cu următoarea metodă. </p> <p> </p> <h6> Metoda 4. Ștergeți și recreați profilul Outlook. </h6> <p> 1. <strong> Închide </strong> Outlook. <br> 2. Navigați la <strong> Panou de control </strong> și deschis <strong> Poștă </strong> . (Dacă nu vizualizați elementul Mail, schimbați <strong> Vazut de </strong> : la <strong> Icoane mici </strong> ) </p> <p> 3. Faceți clic pe <strong> Afișați profilurile. * </strong></p> <p><strong> * Notă importantă: </strong> Dacă utilizați mai multe conturi de e-mail, verificați dacă eroarea apare în toate conturile de e-mail. Dacă eroarea apare numai într-un singur cont, atunci încercați să ștergeți și să adăugați din nou numai contul cu problema, utilizând următoarea procedură: </p> <blockquote><p> A. Apasă pe <strong> Conturi de e-mail </strong> și eliminați contul de e-mail cu problema. <br> b. Apoi apasa <strong> Fișiere de date </strong> și eliminați fișierul de date Outlook, asociat contului eliminat. <br> c. În cele din urmă faceți clic pe <strong> Conturi de e-mail </strong> din nou și adăugați din nou contul de e-mail eliminat. </p></blockquote> <p><img src=\"images/image_thumb-2-659.png\" alt=\"Create Secondary Outlook Profile\" loading=\"lazy\"></p> <p> </p> <p> 4. Selectați profilul curent și faceți clic <strong> Elimina </strong> . Apoi apasa <strong> da </strong> pentru a vă confirma decizia. </p> <p><img src=\"images/image_thumb-53-516.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Apoi faceți clic pe <strong> Adăuga </strong> butonul și dați un nume pentru profil: (de ex. „Outlook”). </p> <p><img src=\"images/image_thumb-54-154.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Urmați pașii din expertul „Adăugare cont” și reconfigurați-vă contul de e-mail. </p> <p> </p> <p><img src=\"images/image_thumb-9-723.png\" alt=\"outlook account setup\" loading=\"lazy\"></p> <p> </p> <p> 7. După adăugarea contului dvs., deschideți Outlook și verificați dacă „Primirea erorii raportate (0x80004005): Operațiunea a eșuat”, s-a rezolvat. * </p> <p> * Notă: dacă Outlook funcționează bine și primește e-mailuri fără probleme, continuați și restaurați-vă e-mailurile din vechiul fișier de date Outlook .PST, urmând instrucțiunile de mai jos: </p> <ol> <li> <ol> <li> Din <strong> Outlook </strong> &#39;s <strong> Fişier </strong> meniu, selectați <strong> Deschideți și exportați </strong> &gt; <strong> Import Export </strong> . </li> <li> La opțiunile „Alegeți o acțiune de efectuat”, selectați <strong> Importați dintr-un alt program sau fișier </strong> &amp; faceți clic <strong> Următorul. </strong></li> <li> La opțiunile „Selectați tipul de fișier din care să importați”, selectați <strong> Fișier de date Outlook (.pst) </strong> &amp; faceți clic <strong> Următorul </strong> . </li> <li> În ecranul „Fișier de importat”, faceți clic pe <strong> Naviga. </strong></li> <li> Selectați vechiul fișier Outlook PST din care doriți să importați e-mailurile și faceți clic pe <strong> Deschis. </strong></li> <li> Clic <strong> Următorul </strong> &amp; <strong> Finalizarea. </strong></li> </ol> </li> </ol> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}