{"title":"FIX: Nu se poate instala XPS Viewer în Windows 10 (rezolvat)","content":"<p> Într-un tutorial anterior am menționat pașii necesari <a href=\"https://www.repairwin.com/how-to-install-xps-viewer-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> instalați XPS Viewer pe Windows 10 </a> . Dar, unii utilizatori se plâng că nu pot instala XPS Viewer, deoarece vizualizatorul XPS nu este listat după apăsarea butonului „Adăugați o caracteristică” (Aplicații&gt; Gestionați caracteristici opționale&gt; Adăugați o caracteristică) sau nu poate fi instalat. </p> <p> Acest tutorial conține instrucțiuni despre cum să depanați problemele de instalare a vizualizatorului XPS în versiunile Windows 10 1803 și 1809. </p> <h4> Cum se rezolvă problemele de instalare XPS Viewer în Windows 10. </h4> <h6> Metoda 1. Dezinstalați și reinstalați Microsoft XPS Document Writer. </h6> <p> 1. Deschideți <strong> Programe si caracteristici </strong> și apoi faceți clic pe <strong> Activați sau dezactivați funcțiile Windows </strong> . </p> <p><img src=\"images/image_thumb-61-948.png\" alt=\"FIX: Cannot Install XPS Viewer - Windows 10\" loading=\"lazy\"></p> <p> 2. <strong> Debifează </strong> <strong> Caseta Microsoft XPS Document Writer </strong> și a lovit <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-62-338.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Acum faceți clic pe <strong> Activați sau dezactivați funcțiile Windows </strong> din nou și <strong> Verifica </strong> <strong> Microsoft XPS Document Writer </strong> caseta și faceți clic <strong> O.K. <br> </strong> 4. <strong> Repornire </strong> computerul dvs. <br> 5. Încercați să instalați XPS Viewer. </p> <p> </p> <h6> Metoda 2. Instalați XPS Viewer utilizând comanda DISM. </h6> <p> 1. Deschideți <strong> Prompt comandă ca administrator </strong> . <br> 2. În promptul de comandă, dați următoarea comandă și apăsați <strong> introduce </strong> . </p> <ul> <li><strong> dism / Online / Add-Capability /CapabilityName:XPS.Viewer~~~~0.0.1.0 </strong></li> </ul> <p><img src=\"images/image_thumb-65-661.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Metoda 3. Descărcați XPS Viewer din Windows Update în loc de WSUS. (Windows 10 Pro și Enterprise). </h6> <p> Dacă utilizați Windows 10 Pro sau Enterprise, aplicați următorii pași în Editorul de politici de grup. * </p> <p> * Notă: Dacă computerul aparține unui domeniu, trebuie să modificați setările politicii de grup de domenii (GPO) și apoi să rulați comanda „gpupdate / force”, înainte de a instala XPS Viewer. </p> <p> 1. Deschideți Editorul de politici de grup. Pentru a face asta: </p> <blockquote><p> 1. Apăsați simultan Windows <img src=\"images/image_thumb36-656.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați <strong> gpedit.msc </strong> &amp; Presa <strong> Introduce. </strong></p></blockquote> <p><img src=\"images/image_thumb-78-514.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. În panoul din stânga navigați la: </p> <ul> <li><strong> Configurare computer </strong> -&gt; <strong> Șabloane administrative </strong> -&gt; <strong> Sistem </strong></li> </ul> <p> 3. În panoul din dreapta faceți dublu clic pe <strong> Specificați setările pentru instalarea și repararea componentelor opționale </strong></p> <p><img src=\"images/image_thumb-63-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Setați politica la <strong> Activat </strong> și apoi verificați <strong> Descărcați conținutul de reparații și caracteristicile opționale direct din Windows Update în loc de Windows Server Update Services (WSUS) </strong> cutie. </p> <p> 5. Când ați terminat, faceți clic pe <strong> aplica </strong> și <strong> O.K </strong> și <strong> repornire </strong> computerul dvs. </p> <p><img src=\"images/image_thumb-64-264.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. După repornire, încercați să <a href=\"#install-xps-viewer-dism\" target=\"_blank\" rel=\"nofollow noopener\"> instalați XPS Viewer utilizând metoda DISM </a> de mai sus. <br> 7. După instalarea vizualizatorului XPS, deschideți Editorul de politici de grup și reveniți la modificări. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}