{"title":"FIX: 2147219196 Eroare sistem de fișiere în aplicația Fotografii din Windows 10 (rezolvat)","content":"<p> Pe un computer bazat pe Windows 10 cu aplicația „Fotografii” ca aplicație implicită pentru deschiderea imaginilor, apare „Eroare sistem de fișiere” -2147219196 „când utilizatorul încearcă să deschidă o imagine .JPG sau o imagine .PNG (cu„ FOTO ”) aplicație). </p> <p><img src=\"images/image_thumb-73-456.png\" alt=\"FIX: 2147219196 File system error in Photos app \" loading=\"lazy\"></p> <p> </p> <p> Acest tutorial conține instrucțiuni pentru a rezolva „Eroarea sistemului de fișiere 2147219196” la deschiderea imaginilor în aplicația Fotografii în Windows 10. </p> <h4> Cum se remediază: Nu se pot deschide imagini cu aplicația „Fotografii” în Windows 10 cu eroare „Eroare sistem de fișiere 2147219196”. </h4> <p> Notă: Înainte de a continua mai jos, asigurați-vă că sistemul dvs. este complet actualizat. </p> <h6> Pasul 1. Rulați instrumentul de depanare a aplicațiilor Windows Store. </h6> <p> 1. Navigați la <strong> start </strong> -&gt; <strong> Setări </strong> -&gt; <strong> Actualizare și securitate </strong> . <br> 2. Alegeți <strong> Depanare </strong> din stânga, apoi faceți clic pe <strong> Depanare aplicații Windows Store </strong> în dreapta și faceți clic <strong> Rulați instrumentul de depanare </strong> . </p> <p><img src=\"images/image_thumb-74-400.png\" alt=\"windows store apps troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 3. Urmați instrucțiunile de pe ecran și lăsați instrumentul de depanare să remedieze problemele. <br> 4. După depanare, închideți instrumentul de depanare și încercați să deschideți un fișier imagine. Dacă eroarea persistă, treceți la pasul următor. </p> <p><img src=\"images/image_thumb-75-371.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Pasul 2. Reparați sau resetați aplicația Fotografii. </h6> <p> Dacă primiți „2147219196”, atunci când încercați să deschideți un fișier .JPG sau .PNG cu aplicația Photos, atunci încercați să reparați aplicația. Pentru a face asta: </p> <p> 1. Navigați la <strong> start </strong> -&gt; <strong> Setări </strong> -&gt; <strong> Aplicații. <br> </strong> 2. La <strong> Aplicații și caracteristici, </strong> localizați și selectați <strong> Microsoft Photos </strong> și faceți clic pe <strong> Opțiuni avansate. </strong></p> <p><img src=\"images/image_thumb-76-358.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. La Opțiuni avansate, faceți clic pe <strong> Reparație </strong> buton. <br> 4. Când procesul este finalizat, veți vedea o bifă <img src=\"images/image_thumb-77-553.png\" alt=\"image\" loading=\"lazy\"> lângă butonul „Reparare”. Continuați și verificați dacă „Eroarea sistemului de fișiere 2147219196” s-a rezolvat deschizând o fotografie. <br> 5. Dacă problema persistă, faceți clic pe <strong> Resetați </strong> pentru a reseta setările aplicației Foto. </p> <p><img src=\"images/image_thumb-78-665.png\" alt=\"repair - reset photos app\" loading=\"lazy\"></p> <p> </p> <h6> Pasul 3. Eliminați complet și reinstalați aplicația Photos. </h6> <p> Următorul pas pentru a remedia „Eroarea sistemului de fișiere” -2147219196 &quot;în aplicația Photos, este să eliminați complet din sistem și să reinstalați aplicația Photos. Pentru aceasta: </p> <p> 1. Deschideți <strong> PowerShell </strong> la fel de <strong> Administrator </strong> . <br> 2. La PowerShell dați următoarea comandă și apăsați <strong> introduce </strong> , pentru a elimina complet aplicația Fotografii: * </p> <ul> <li><strong> Get-AppxPackage * fotografii * | Remove-AppxPackage -allusers </strong></li> </ul> <p> * Informații: Comanda de mai sus va dezinstala aplicația Photos din Windows 10 și va elimina și fișierele de instalare și resturile aplicației Photos din directorul „C: \\ Program Files \\ WindowsApps \\”. </p> <p><img src=\"images/image_thumb-95-600.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Când comanda este finalizată, <strong> repornire </strong> computerul tau. <br> 4. Deschideți Microsoft Store și instalați <a href=\"https://www.microsoft.com/en-us/p/microsoft-photos/9wzdncrfjbh4#activetab=pivot:overviewtab\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Photos </a> . </p> <p><img src=\"images/image_thumb-89-238.png\" alt=\"reinstall photos app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Faceți clic pe <strong> Instalare, </strong> pentru a reinstala aplicația Poze pe sistemul dvs. </p> <p><img src=\"images/image_thumb-90-948.png\" alt=\"install photos app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Când aplicația Fotografii este instalată, deschideți o imagine. Eroarea „Eroare sistem de fișiere 2147219196” ar fi trebuit rezolvată. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}