{"title":"FIX: Viber, Yahoo și alte aplicații se blochează pe dispozitivele Android - martie 2021 (rezolvat).","content":"<p> Câțiva utilizatori din ultimele ore au raportat că multe aplicații Android se prăbușesc (22 martie 2021). În special, Gmail, Viber, Google Chrome și alte aplicații importante nu se deschid și nu se închid imediat după deschidere. Problema afectează multe dispozitive Android și în special dispozitivele Samsung. Dacă vă confruntați cu o problemă similară, continuați să citiți mai jos pentru a afla cum să o remediați. </p> <p> Actualizare (23 martie 2021): Google a identificat rapid problema și a constatat că <strong> Android WebView </strong> aplicația a fost vinovată și a remediat-o prin apăsarea actualizărilor pentru ea și alte aplicații Chrome. </p> <h4> Cum să remediați: Android Google Apps, Viber etc. Problemă de avarie (22 martie 2021). </h4> <p> 1. Deschideți Android <strong> Setări. </strong></p> <p> 2. Atingeți <strong> Gestionați aplicațiile </strong> (sau <strong> Aplicații și notificări </strong> sau <strong> Aplicații </strong> pe unele dispozitive Android). </p> <p><img src=\"images/image_thumb-27-815.png\" alt=\"FIX: Android Apps are Crashing on Samsung or other Devices.\" loading=\"lazy\"></p> <p> </p> <p> 3. Faceți clic pe meniul cu <strong> trei puncte </strong><img src=\"images/image_thumb-28-382.png\" alt=\"image\" loading=\"lazy\"> în colțul din dreapta sus și selectați <strong> Afișați toate aplicațiile </strong> (sau <strong> Afișați aplicațiile de sistem </strong> ). </p> <p><img src=\"images/image_thumb-29-272.png\" alt=\"FIX Android GMAIL or Viber Crash \" loading=\"lazy\"></p> <p> </p> <p> 3. Găsiți <strong> Android System WebView </strong> aplicație (sau <strong> Android WebView </strong> ) în listă și deschideți-o. </p> <p><img src=\"images/image_thumb-30-842.png\" alt=\"FIX GMAIL Chrome or Viber Crash on Android - March 2021\" loading=\"lazy\"></p> <p> </p> <p> 4. Faceți clic pe <strong> Dezinstalați actualizările. </strong></p> <p><img src=\"images/image_thumb-31-471.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Atingeți <strong> O.K </strong> la mesajul de avertizare. </p> <p> 6. <strong> Repornire </strong> dispozitivul dvs. și problema ar trebui să dispară. </p> <p> Asta-i tot oameni buni! Ce metodă a funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}