{"title":"FIX: Operațiunea Outlook nu a reușit. Interfețele de mesagerie au returnat o eroare necunoscută în Outlook 2016, 2013, 2010 sau 2007 (rezolvat)","content":"<p> Eroarea Outlook &quot;Operațiunea a eșuat. Interfețele de mesagerie au returnat o eroare necunoscută. Dacă eroarea persistă, reporniți Outlook. Nu se poate rezolva destinatarul&quot;, poate apărea în versiunile Outlook 2003, 2007, 2010 sau 2013 și poate fi cauzată din mai multe motive. Deci, în acest tutorial, veți găsi mai multe metode de rezolvare. </p> <p><img src=\"images/image_thumb-59-377.png\" alt=\"The Operation failed. The messaging interfaces has returned an unknown error. If the error persists, restart Outlook\" loading=\"lazy\"></p> <p> Eroarea &quot;Operațiunea nu a reușit. Interfața de mesagerie a returnat o eroare necunoscută&quot; în Outlook, poate apărea în următoarele cazuri: </p> <blockquote><p> 1. Când încercați să vizualizați sau să ștergeți e-mailurile dintr-un folder Outlook. </p> <p> 2. Când imprimați un e-mail sau o activitate de calendar. </p> <p> 3. Când încercați să creați un profil Outlook nou. </p></blockquote> <p> </p> <h4> Cum se remediază: interfața Outlook Messaging a returnat o eroare necunoscută. Nu se poate rezolva destinatarul. </h4> <h6> Metoda 1. Restabiliți Vizualizarea folderului Outlook. </h6> <p> Dacă una sau mai multe vizualizări personalizate sunt rupte, aceasta împiedică Outlook să afișeze unele articole / foldere. Deci, următoarea metodă pentru a rezolva „interfețele de mesagerie a returnat o eroare necunoscută” în Outlook, este să restaurați toate vizualizările folderelor Outlook la setările lor implicite. Pentru a face asta: </p> <p> 1. Închideți Outlook. <br> 2. Apăsați tasta <strong> Windows </strong> <img src=\"images/image_thumb8_thumb_thumb-501.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 3. În caseta „Deschidere” tastați următoarea comandă și apăsați <strong> introduce </strong> . </p> <ul> <li><strong> outlook / cleanviews </strong></li> </ul> <p><img src=\"images/image_thumb-57-310.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Outlook ar trebui să înceapă normal. Verificați-l și dacă eroarea persistă, continuați cu pasul următor. </p> <p> </p> <h6> Metoda 2. Ștergeți setările stilului de imprimare Outlook. </h6> <p> Outlook stochează setările stilului de imprimare în fișierul „OutlPrnt”. Dacă acest fișier este corupt, atunci poate provoca problema „interfețelor de mesagerie a returnat o necunoscută” la imprimarea în Outlook. În acest caz: </p> <p> 1. Închideți Outlook. <br> 2. Apăsați tasta <strong> Windows </strong> <img src=\"images/image_thumb8_thumb_thumb-409.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 3. În caseta „Deschidere” tastați următoarea comandă și apăsați <strong> introduce </strong> . </p> <ul> <li> C: \\ Users \\% username% \\ AppData \\ Roaming \\ Microsoft \\ Outlook \\ </li> </ul> <p> 4. <strong> Redenumiți </strong> &quot; <strong> OutlPrnt </strong> &quot;fișier către&quot; <strong> OutlPrnt.old </strong> &quot;. </p> <p><img src=\"images/image_thumb-58-286.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Porniți Outlook și verificați dacă eroarea a fost rezolvată. (Când Outlook pornește, acesta va reconstrui fișierul „Outlprnt”). </p> <h6></h6> <h6> Metoda 3. Reparați fișierul de date Outlook. </h6> <p> În funcție de cazul dvs., urmați instrucțiunile de mai jos, pentru a repara corupțiile din fișierul de date Outlook. </p> <p><strong> Cazul 1: Pentru conturi de schimb (IMAP) (.OST) <br> </strong> Dacă utilizați un cont Exchange (IMAP), forțați Outlook să recreeze fișierul Outlook .OST corupt, procedând în felul următor: </p> <p> 1. <strong> Închide </strong> perspectivă. <br> 2. <strong> Redenumiți </strong> OST pentru contul care cauzează problema. <br> 3. Deschideți Outlook. (Outlook va recrea fișierul OST). <br> 4. Dacă eroarea persistă, continuați cu pasul-2 de mai jos. </p> <p> </p> <p><strong> Cazul 2: Pentru conturile POP3 (PST) <br> </strong> Dacă utilizați un cont POP3, reparați fișierul Outlook .PST corupt, procedând în felul următor: </p> <p><strong> 1. </strong> <strong> Închide </strong> Outlook. <br> <strong> 2. </strong> Deschideți Windows Explorer și localizați fișierul <strong> scanpst.exe </strong> instrument de reparare la această locație: * </p> <ul> <li> C: \\ Program Files \\ Microsoft Office \\% OfficeVersion% \\ SCANPST.EXE </li> </ul> <p> * Locația fișierului „SCANPST.EXE” conform versiunii Office: * </p> <blockquote><p><strong> Outlook 2013 și Outlook 2016 </strong><br> Windows pe 32 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office15 <br> Windows pe 64 de biți&gt; C: \\ Program Files (x86) \\ Microsoft Office \\ Office15 <br> Outlook pe 64 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office15 <br> Faceți clic pentru a rula&gt; C: \\ Program Files \\ Microsoft Office 15 \\ root \\ office15 <br> <strong><br> Outlook 2010 </strong><br> Windows pe 32 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office14 <br> Windows pe 64 de biți&gt; C: \\ Program Files (x86) \\ Microsoft Office \\ Office14 <br> Outlook pe 64 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office14 <br> <strong><br> Outlook 2007 </strong><br> Windows pe 32 de biți&gt; C: \\ Program Files \\ Microsoft Office \\ Office12 <br> Windows pe 64 de biți&gt; C: \\ Program Files (x86) \\ Microsoft Office \\ Office12 </p></blockquote> <p> </p> <p> * Notă: Dacă nu puteți găsi „scanpst.exe” în locațiile de mai sus, atunci uitați-vă la: </p> <ul> <li> C: \\ Program Files (x86) \\ Microsoft Office \\ root \\ Office16. </li> </ul> <p><strong> 3. </strong> Faceți dublu clic pe <strong> deschis </strong> SCANPST.EXE <br> <strong> 4. </strong> Clic <strong> Naviga </strong> . </p> <p><img src=\"images/image_thumb-55-702.png\" alt=\"scanpst.exe\" loading=\"lazy\"></p> <p> </p> <p><strong> 5. </strong> Găsiți fișierul de date Outlook corupt (de exemplu, Outlook.pst) la această locație: </p> <p> </p> <p><strong> Windows XP </strong></p> <ul> <li><strong> C: \\ Documents and Settings \\% Username% \\ Local Settings \\ Application Data \\ Microsoft \\ Outlook \\ Outlook.pst </strong></li> </ul> <p><strong> Windows 7 sau Vista </strong></p> <ul> <li><strong> C: \\ Users \\% Username% \\ AppData \\ Local \\ Microsoft \\ Outlook \\ Outlook.pst </strong></li> </ul> <p> * Notă: În Outlook 2016, 2013 și 2010, fișierul de date Outlook este stocat în mod implicit la: </p> <ul> <li><strong> C: \\ Users \\% Username% \\ Documents \\ Outlook Files \\ Outlook.pst </strong></li> </ul> <p><strong> 6. </strong> apasă pe <strong> Scanează </strong> apăsați butonul și aveți răbdare până când instrumentul de reparare a căsuței de e-mail repară fișierul deteriorat. * </p> <p> * Notă: În faza finală de reparație, veți fi întrebat dacă doriți să creați o copie de rezervă. Răspuns &quot; <strong> da </strong> „pentru a continua operațiunea de reparații. </p> <p><img src=\"images/image_thumb-56-936.png\" alt=\"Outlook Inbox Repair Tool\" loading=\"lazy\"></p> <p> </p> <p> 7. Când procesul de reparare este finalizat, deschideți Outlook și verificați dacă problema „interfața de mesagerie a returnat o eroare necunoscută” a fost rezolvată. </p> <p> </p> <h6> Metoda 4. Ștergeți și recreați profilul Outlook. </h6> <p> Metoda finală pentru a rezolva problema „Interfața de mesagerie a returnat o eroare necunoscută” este să ștergeți și să recreați profilul Outlook. </p> <p> 1. Navigați la Panoul de control Windows. Pentru a face asta: </p> <blockquote><p> A. Tastați „panoul de control” în caseta de căutare Windows <br> b. Clic <strong> Panou de control </strong> din rezultate. </p></blockquote> <p><img src=\"images/image_thumb-53-981.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Setați <strong> Vazut de </strong> la <strong> Icoane mici </strong> pentru a vizualiza toate elementele panoului de control și apoi faceți clic pe <strong> Poștă </strong> . </p> <p><img src=\"images/image_thumb-54-839.png\" alt=\"control panel mail options\" loading=\"lazy\"></p> <p> </p> <p> 3. Faceți clic pe <strong> Afișați profilurile. * </strong></p> <p><strong> * Notă importantă: </strong> Dacă utilizați mai multe conturi de e-mail, verificați dacă eroarea apare în toate conturile de e-mail. Dacă eroarea apare numai într-un singur cont, atunci încercați să ștergeți și să adăugați din nou numai contul cu problema, utilizând următoarea procedură: </p> <blockquote><p> A. Apasă pe <strong> Conturi de e-mail </strong> și eliminați contul de e-mail cu problema. <br> b. Apoi apasa <strong> Fișiere de date </strong> și eliminați fișierul de date Outlook, asociat contului eliminat. <br> c. În cele din urmă faceți clic pe <strong> Conturi de e-mail </strong> din nou și adăugați din nou contul de e-mail eliminat. </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-2-573.png\" alt=\"Create Secondary Outlook Profile\" loading=\"lazy\"></p> <p> </p> <p> 4. Selectați profilul curent și faceți clic <strong> Elimina </strong> . Apoi apasa <strong> da </strong> pentru a vă confirma decizia. </p> <p><img src=\"images/image_thumb-53-706.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Apoi faceți clic pe <strong> Adăuga </strong> butonul și dați un nume pentru profil: (de ex. „Outlook”). </p> <p><img src=\"images/image_thumb-54-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Urmați pașii din expertul „Adăugare cont”, pentru a vă reconfigura contul de e-mail. </p> <p> </p> <p><img src=\"images/image_thumb-9-658.png\" alt=\"outlook account setup\" loading=\"lazy\"></p> <p> </p> <p> 7. După adăugarea contului dvs., deschideți Outlook și verificați dacă „Interfețele de mesagerie au returnat o eroare necunoscută” s-a rezolvat. * </p> <p> * Notă: dacă Outlook funcționează bine și fără erori și doriți să restaurați e-mailurile din vechiul fișier de date Outlook .PST, urmați instrucțiunile de mai jos: </p> <ol> <li> <ol> <li> Din <strong> Outlook </strong> &#39;s <strong> Fişier </strong> meniu, selectați <strong> Deschideți și exportați </strong> &gt; <strong> Import Export </strong> . </li> <li> La „Alegeți o acțiune pentru a efectua opțiuni, selectați <strong> Importați dintr-un alt program sau fișier </strong> &amp; faceți clic <strong> Următorul. </strong></li> <li> La opțiunile „Selectați tipul de fișier din care să importați”, selectați <strong> Fișier de date Outlook (.pst) </strong> &amp; faceți clic <strong> Următorul </strong> . </li> <li> În ecranul „Fișier de importat”, faceți clic pe <strong> Naviga. </strong></li> <li> Selectați vechiul fișier Outlook PST din care doriți să importați e-mailurile și faceți clic pe <strong> Deschis. </strong></li> <li> Clic <strong> Următorul </strong> &amp; <strong> Finalizarea. </strong></li> </ol> </li> </ol> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}