{"title":"FIX: Perioada de expirare a semaforului a expirat la copierea fișierelor (rezolvat)","content":"<p> Eroarea „Perioada de expirare a semaforului a expirat” poate fi afișată atunci când încercați să copiați fișiere mari pe rețea sau când transferați fișiere de pe o unitate USB externă pe computer. În alte cazuri, „Eroarea 0x80070079: perioada de expirare a semaforului a expirat”, apare atunci când încercați să copiați fișiere de pe un dispozitiv conectat USB (de exemplu, de la camera foto, telefonul mobil etc.) </p> <p><img src=\"images/image_thumb-4-812.png\" alt=\"Semaphore Timeout Period has Expired\" loading=\"lazy\"></p> <p> </p> <p> În acest ghid veți găsi mai multe modalități de a rezolva &quot;perioada de expirare a semaforului a expirat. Eroarea 0x80070079&quot; la copierea fișierelor din / în rețea sau USB, în Windows 10, 8, 8.1, 7 sau Vista. </p> <h4> Cum se remediază: Eroare la copierea fișierului sau a folderului. Perioada semaforului a expirat. </h4> <p><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> PARTEA 1. REPARAȚI „Perioada semaforului a expirat” la copierea fișierelor de pe USB. </a></p> <p><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> PARTEA 2. REPARAȚI „Perioada semaforului a expirat” la copierea fișierelor din rețea. </a></p> <p> </p> <h6> PARTEA 1. REPARAȚI „Perioada semaforului a expirat” la copierea fișierelor de pe USB. </h6> <p> Dacă primiți eroarea „Perioada semaforului a expirat” atunci când copiați fișiere de pe un dispozitiv USB (de exemplu, de pe un disc USB extern sau de pe camera dvs. digitală), încercați următoarele pentru a remedia problema: </p> <p><strong> 1. </strong> Închideți toate programele deschise și <strong> repornire </strong> computerul tau. <br> <strong> 2. </strong> Conectați dispozitivul USB la <strong> un alt port USB </strong> . Dacă computerul dvs. deține un port USB 2.0, conectați dispozitivul USB în acel port. <br> <strong> 3. </strong> Folosește o <strong> cablu USB diferit </strong> pentru a conecta dispozitivul USB la computer. <br> <strong> 4. </strong> Dacă doriți să copiați fișiere de pe un dispozitiv USB (de exemplu, telefonul mobil sau camera dvs. digitală), care deține un card SD, atunci <strong> elimina </strong> și <strong> reintroduceți </strong> <strong> card SD </strong> . În plus, scoateți cardul SD de pe dispozitivul USB și atașați-l la un <strong> cititor de carduri </strong> (dacă dețineți unul). <br> <strong> 5. </strong> <strong> Verifica </strong> și <strong> erori de reparare </strong> pe unitatea USB folosind <strong> chkdsk </strong> &#39;comanda. Pentru a face asta: </p> <blockquote><p> 1. Lansați <strong> Prompt comandă ca administrator </strong> . </p></blockquote> <p><img src=\"images/image_thumb-30-765.png\" alt=\"command prompt administrator\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 2. În fereastra promptului de comandă, tastați următoarea comandă și apăsați <strong> introduce </strong> : * </p></blockquote> <ul> <li> <ul> <li> <ul> <li><strong> chkdsk X: / F / R </strong></li> </ul> </li> </ul> </li> </ul> <p><strong> * Notă: </strong> Înlocuiți litera unității X în conformitate cu litera unității USB. </p> <p> </p> <p> </p> <h6> PARTEA 2. REPARAȚI „Perioada semaforului a expirat” la copierea fișierelor prin rețea. </h6> <p> Dacă primiți eroarea „Perioada semaforului a expirat” atunci când încercați să copiați fișiere în rețea, încercați următoarele: </p> <h2> Metoda 1. Folosiți o adresă IP statică. </h2> <p> Dacă utilizați DHCP, dezactivați-l și specificați o adresă IP statică pe ambele computere din rețea. </p> <p> </p> <h2> Metoda 2. Actualizați driverele de rețea de pe ambele computere. </h2> <ul> <li> Dacă dețineți un laptop, încercați următoarele: <ul> <li> Dacă sunteți conectat prin Wi-Fi, încercați să copiați fișierele folosind conexiunea Ethernet (LAN) sau ... </li> <li> Navigați la site-ul de asistență al producătorului laptopului pentru a descărca și instala cele mai recente drivere de rețea. </li> </ul> </li> <li> Dacă dețineți un computer desktop, descărcați cele mai recente drivere pentru placa de rețea, de pe site-ul de asistență al producătorului plăcii de bază. </li> </ul> <p><strong> BACSIS: </strong> Dacă nu găsiți modelul laptopului sau al plăcii de bază, faceți următoarele: </p> <blockquote><p> 1. Apăsați tasta <strong> Windows </strong> <img src=\"images/image_thumb8_thumb_thumb-904.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați: <strong> devmgmt.msc </strong> &amp; faceți clic pe <strong> O.K </strong> pentru a deschide „Device Manager” <strong> . </strong></p></blockquote> <p><img src=\"images/image_thumb-1-166.png\" alt=\"device manager\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> </p> <p> 3. În Manager dispozitive extindeți <strong> Adaptoare de rețea. <br> </strong> 4. Faceți clic dreapta pe adaptorul de rețea și faceți clic pe <strong> Actualizați driver-ul </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-946.png\" alt=\"update driver\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Lăsați Windows să caute automat un driver de actualizare pentru adaptorul de rețea. * </p></blockquote> <p><strong> *Notă: </strong> Dacă Windows nu găsește un driver actualizat, atunci utilizați numele adaptorului (de ex. „Adaptor de rețea Broadcom 802.11g”) și căutați manual un driver actualizat. </p> <p><img src=\"images/image_thumb-6-471.png\" alt=\"search for drivers\" loading=\"lazy\"></p> <p> </p> <p> </p> <h2> Metoda 3. Dezactivați temporar antivirusul sau paravanul de protecție. </h2> <p> Următoarea metodă de remediere a problemei „Perioada semaforului a expirat” este dezactivarea temporară a Paravanului de protecție Windows și a programului dvs. Antivirus. </p> <p> 1. Apăsați tasta <strong> Windows </strong> <img src=\"images/image_thumb8_thumb_thumb-462.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați: <strong> Control </strong> &amp; faceți clic pe <strong> O.K </strong><strong> . </strong></p> <p><img src=\"images/image_thumb7-807.png\" alt=\"control panel command\" loading=\"lazy\"></p> <p> </p> <p> 3. Setați „Vizualizare după:” la <strong> Icoane mici </strong> pentru a afișa toate elementele panoului de control. </p> <p> </p> <p><img src=\"images/image_thumb8-567.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Deschideți <strong> Paravan de protecție Windows </strong> (sau „Paravan de protecție Windows Defender” în Windows 10). </p> <p><img src=\"images/image_thumb-7-921.png\" alt=\"disable firewall wiindows\" loading=\"lazy\"></p> <p> </p> <p> 5. Faceți clic pe <strong> Activați sau dezactivați Paravanul de protecție Windows </strong> . </p> <p><img src=\"images/image_thumb-8-655.png\" alt=\"turn off windows defender firewall\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Verifica </strong> &quot; <strong> Dezactivați Paravanul de protecție Windows (nu este recomandat) </strong> &quot;și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-9-907.png\" alt=\"turn off windows firewall\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Repornire </strong> computerul și apoi copiați fișierele. * </p> <p> * Notă: După copierea fișierelor, urmați pașii de mai sus pentru a reactiva Paravanul de protecție Windows. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}