{"title":"FIX: Eroare de restaurare sistem 0x8100010B (rezolvată)","content":"<p> Acest tutorial conține instrucțiuni pentru rezolvarea erorii de restaurare a sistemului 0x8100010B în Windows 10. Eroarea 0x8100010B poate apărea atunci când încercați să măriți spațiul maxim utilizat pentru protecția sistemului sau când încercați să ștergeți toate punctele de restaurare anterioare. </p> <p><img src=\"images/image_thumb-19-393.png\" alt=\"FIX System Restore Error 0x8100010B\" loading=\"lazy\"></p> <p> Mai precis, acest articol conține instrucțiuni pentru a rezolva următoarea problemă în Restaurarea sistemului: </p> <p><strong> 1. Nu se poate mări spațiul maxim pe disc pentru protecția sistemului </strong> cu eroare: &quot;A existat un <strong> eroare neașteptată în pagina proprietății </strong> : Numele fișierului, numele directorului sau sintaxa etichetei de volum sunt incorecte. (0x8007007B)). </p> <p><strong> 2. Nu se pot șterge punctele de restaurare </strong> pe Windows 10 cu eroare: &quot;Punctele de restaurare nu au putut fi șterse din următorul motiv: Windows nu a putut șterge toate instantaneele. Încercați din nou sau vizualizați jurnalul de evenimente pentru mai multe informații. (0x8100010B).&quot; </p> <h2> Cum se remediază: Eroarea 0x8100010B în protecția de restaurare a sistemului. </h2> <p> 1. <strong> Repornire </strong> computerul dvs. </p> <p> 2. Navigați la <strong> Protecția sistemului </strong> setări: </p> <ul> <li><b> Panou de control&gt; Sistem&gt; Setări avansate de sistem&gt; Proprietăți sistem&gt; Protecție sistem </b></li> </ul> <p> 3. Evidențiați <strong> Disc local C: (sistem) </strong> și faceți clic pe <strong> Configurați. </strong></p> <p><img src=\"images/image_thumb-22-902.png\" alt=\"0x8100010B System Protection\" loading=\"lazy\"></p> <p> </p> <p> 4. Selectați <strong> Dezactivați protecția sistemului </strong> și faceți clic pe <strong> Aplicați&gt; OK. </strong> * </p> <p> * Notă: Această acțiune va șterge definitiv toate punctele de restaurare anterioare. Dacă doriți să creșteți spațiul maxim utilizat pentru protecția sistemului, fără a pierde punctele de restaurare, dați comanda de mai jos într-un prompt de comandă ridicat și apoi vedeți dacă problema a fost rezolvată. </p> <ul> <li> vssadmin redimensionează shadowstorage / For = C: / On = C: / MaxSize = 15% </li> </ul> <p><img src=\"images/image_thumb-23-863.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Închide </strong> și <strong> redeschide </strong> setările de protecție a sistemului. </p> <p> 6. Acum selectați <strong> Activați protecția sistemului </strong> , configurați Utilizarea maximă și faceți clic pe <strong> O.K </strong> . </p> <p> 7. La opțiunile de protecție a sistemului, selectați <strong> Activați protecția sistemului </strong> și faceți clic pe <strong> O.K. </strong></p> <p><img src=\"images/image_thumb-73-430.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}