{"title":"FIX: Touchpad-ul nu funcționează sau se blochează în Windows 10 (rezolvat)","content":"<p> În ultimii ani, am depanat multe probleme legate de touchpad în Windows 10 pe mai multe laptopuri (de exemplu, touchpad-ul nu funcționează, touchpad-ul se blochează etc.), așa că am decis să scriu un tutorial pentru depanarea acestor probleme. </p> <p> Dacă dețineți un laptop, atunci din când în când este posibil să aveți probleme cu dispozitivul touchpad. Mai ales dacă aveți Windows 10, touchpad-ul poate de multe ori să nu mai funcționeze sau să nu funcționeze corect după ce instalați o actualizare. Desigur, problemele cu touchpad-ul pot indica o problemă hardware, dar, în multe cazuri, defecțiunile touchpad-ului se datorează unor probleme de software. </p> <p> Pe Windows 10, este posibil ca touchpad-ul laptopului să nu funcționeze din diverse motive, astfel încât acest tutorial va acoperi toate metodele de rezolvare a problemei. </p> <h2> Cum se remediază problemele touchpad-ului în Windows 10. </h2> <p> Urmați acești pași înainte de a continua cu următoarele metode pentru a rezolva problemele legate de ecranul tactil. </p> <ol> <li> Asigurați-vă că Windows 10 nu este înghețat, apăsând ALT + CTRL + DEL și vedeți dacă se deschide Managerul de activități. </li> <li> Dacă laptopul dvs. are o combinație de taste funcționale pentru a dezactiva și activa touchpad-ul. (de ex. Fn + F3), apoi apăsați combinația de taste Fn pentru a porni touchpad-ul. (Pe unele laptopuri touchpad-ul poate fi pornit / oprit prin atingerea dublă a suprafeței touchpad-ului) </li> <li> Reporniți computerul. </li> <li> Efectuați o oprire completă a Windows 10 și apoi porniți din nou laptopul. (Pentru a efectua o oprire completă: apăsați și mențineți apăsat butonul <strong> SCHIMB </strong> tasta și apoi faceți clic pe <strong> start </strong> &gt; <strong> Putere </strong> &gt; <strong> Închide </strong> ). </li> </ol> <p><strong> </strong></p> <h3> Metoda 1. Activați touchpad-ul în Windows 10. </h3> <p> Windows 10 are capacitatea de a dezactiva sau de a opri touchpad-ul atunci când este conectat un mouse extern. Deci, continuați și asigurați-vă că touchpad-ul este activat în setările touchpad-ului. </p> <p> 1. Navigați la <strong> start </strong><img src=\"images/image_thumb2_thumb_thumb-670.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> meniu -&gt; <strong> Setări </strong> <img src=\"images/image_thumb-66-512.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Dispozitive. <br> </strong> 2. Selectați <strong> Touchpad </strong> în panoul din stânga și în dreapta asigurați-vă că comutatorul Touchpad este setat la <strong> PE </strong> Si deasemenea <strong> Verifica </strong> <strong> Lăsați touchpadul activ atunci când este conectat un mouse </strong> opțiune. * </p> <p><img src=\"images/image_thumb-38-467.png\" alt=\"Disable Touchpad Windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Notă: Dacă nu găsiți aici comutatorul / comutatorul de pe touchpad ... </p> <p> 1. Deschideți <strong> Setari aditionale </strong> sub <strong> Setări conexe </strong> secțiune. </p> <ul> <li> Articol asociat: <a href=\"https://www.repairwin.com/disable-touchpad-option-missing-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Dezactivează opțiunea Touchpad care lipsește pe Windows 10. </strong></a></li> </ul> <p><img src=\"images/image_thumb-39-742.png\" alt=\"touchpad additional settings\" loading=\"lazy\"></p> <p> 2. Activați touchpadul în opțiunile Proprietăți mouse. (Dacă touchpad-ul este deja activat, încercați să îl dezactivați și să îl activați din nou.) </p> <p><img src=\"images/image_thumb-31-122.png\" alt=\"enable touchpad windows 10\" loading=\"lazy\"></p> <h3> Metoda 2. Resetați setările touchpad-ului în Windows 10. </h3> <p> O metodă obișnuită pentru a rezolva problemele touchpad-ului în Windows 10 este să resetați setările touchpad-ului la valorile implicite. </p> <p> 1. Navigați la <strong> start </strong><img src=\"images/image_thumb2_thumb_thumb-596.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> meniu -&gt; <strong> Setări </strong> <img src=\"images/image_thumb-66-851.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Dispozitive. <br> </strong> 2. La <strong> Touchpad </strong> Opțiuni <strong> , </strong> derulați în jos și faceți clic <strong> Resetați </strong> sub <strong> Resetați touchpadul. * </strong></p> <p><img src=\"images/image_thumb-40-277.png\" alt=\"reset touchpad windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Notă: Dacă nu puteți vedea <strong> Resetați </strong> buton… </p> <p> 1. Deschideți <strong> Setari aditionale </strong> . <br> 2. Faceți clic pe <strong> Resetați dispozitivele </strong> în opțiunile Proprietăți mouse. </p> <p><img src=\"images/image_thumb-33-928.png\" alt=\"reset touchpad settings windows 10\" loading=\"lazy\"></p> <h3> Metoda 3. Dezinstalați și reinstalați driverul de dispozitiv Touchpad. </h3> <p> O altă soluție pentru a remedia problemele touchpad-ului în Windows 10 este dezinstalarea și reinstalarea completă a driverelor touchpad-ului. </p> <p> 1. Deschideți <strong> Manager de dispozitiv </strong> . Pentru a face asta: </p> <blockquote><p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-140.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. În caseta „Deschidere”, tastați: <strong> devmgmt.msc </strong> &amp; faceți clic <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-5-568.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Extindeți mouse-urile și alte dispozitive de indicare. <br> 3. <strong> Click dreapta </strong> pe <strong> TouchPad </strong> dispozitiv și faceți clic <strong> Dezinstalați. </strong></p> <blockquote> <p><img src=\"images/image_thumb-34-656.png\" alt=\"uninstall touchpad windows 10\" loading=\"lazy\"></p> </blockquote> <p> 4. După repornire, așteptați 4-5 minute pentru ca Windows să reinstaleze driverul touchpad-ului și verificați dacă touchpad-ul dvs. funcționează. Dacă touchpad-ul dvs. nu funcționează din nou, încercați să instalați driverul de pe site-ul de asistență al producătorului laptopului. </p> <h3> Metoda 4. Dezactivați și activați touchpad-ul în BIOS. * </h3> <p> * Notă: Această metodă nu se aplică tuturor modelelor de laptopuri, dar știu că funcționează pe multe laptopuri ASUS. </p> <p> 1. Opriți complet laptopul apăsând și menținând apăsată tasta SHIFT în timp ce dați clic <strong> start </strong> &gt; <strong> Putere </strong> &gt; <strong> Închide </strong><br> 2. Porniți laptopul și apăsați tasta funcțională corespunzătoare pentru a intra în setările BIOS-ului. (de exemplu, F2, F10 etc.), <br> 3. În setările BIOS, verificați dacă există o setare pentru Touchpad sau dispozitivul de indicare intern sau dispozitivul Trackpad (de obicei, această setare poate fi găsită în „ <strong> Avansat </strong> &#39; secțiune). Dacă da, <strong> Dezactivează </strong> <strong> dispozitiv touchpad </strong> și <strong> Salvează și ieși </strong> din setările BIOS-ului. <br> 4. Lăsați Windows 10 să se încarce. <br> 5. Opriți și porniți din nou laptopul. <br> 6. Reintroduceți în setările BIOS și <strong> activați touchpad-ul </strong> &amp; <strong> Salvați și ieșiți </strong> . <br> 7. După pornirea pe Windows 10, touchpad-ul ar trebui să funcționeze. </p> <p><strong> Concluzie: </strong> Dacă, după pașii de mai sus, touchpad-ul dvs. încă nu funcționează, aceasta indică o problemă hardware. În acest caz, utilizați un mouse extern sau mergeți la un atelier de reparații pentru laptopuri pentru a repara dispozitivul touchpad. </p> <p> Asta-i tot oameni buni! Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}