{"title":"FIX: Opțiunea Instalați instrumentele VMware este Gri. (Rezolvat)","content":"<p> Dacă nu puteți instala instrumentele VMware pe musafirul care funcționează, deoarece opțiunea „Instalați instrumentele VMware” este gri, apoi continuați să citiți mai jos. Instrumentele VMware sunt un set gratuit de servicii și module care permit mai multe funcții în mașina virtuală invitată, cum ar fi performanțe grafice mai rapide, performanțe îmbunătățite ale mouse-ului și cele mai semnificative: capacitatea de a copia și lipi între gazdă și mașina invitată. Deci, deși sistemul de operare pentru oaspeți poate funcționa fără instrumentele VMware, instrumentele VMware trebuie instalate dacă doriți să activați caracteristicile suplimentare VMware. </p> <p> În mod obișnuit de a instala VMware Tools, este să porniți mașina de oaspeți și apoi să alegeți din meniul „Player” <strong> Administra </strong> &gt; <strong> Instalați VMware Tools </strong> . Dar, dacă ați conectat unitatea CD / DVD virtuală a mașinii virtuale la un fișier de imagine ISO când ați instalat sistemul de operare, opțiunea „Instalați instrumentele VMware” este gri. </p> <p><img src=\"images/image_thumb-45-164.png\" alt=\"FIX VMware Tools option is Grayed Out\" loading=\"lazy\"></p> <p> </p> <p> Acest tutorial conține instrucțiuni pentru rezolvarea următoarei probleme în VMware Workstation Player. Opțiunea „Instalați VMware Tools” este activată în gri pe computerul Guest. </p> <h4> Cum se instalează VMware Tools dacă opțiunea „Install VMware Tools” este oprită. </h4> <p> </p> <p> 1. Opriți mașina virtuală. <br> 2. Faceți clic dreapta pe mașina virtuală și selectați <strong> Setări </strong> . </p> <p><img src=\"images/image_thumb-39-377.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Selectați <strong> CD / DVD </strong> conduceți apoi faceți clic pe <strong> Elimina </strong> . </p> <p><img src=\"images/image_thumb-43-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Apoi selectați <strong> Floppy </strong> unitate, faceți clic <strong> Elimina </strong> și apoi faceți clic pe <strong> O.K </strong> pentru a închide opțiunile de setări. </p> <p><img src=\"images/image_thumb-44-469.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> start </strong> Mașina virtuală. <br> 6. Din meniul „Player”, selectați <strong> Administra </strong> și faceți clic pe <strong> Instalați VMware Tools. </strong></p> <p><img src=\"images/image_thumb-42-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}