{"title":"FIX: Protecția împotriva virușilor și amenințărilor este gestionată de organizația dvs. în Windows 10. (Rezolvat)","content":"<p> Acest tutorial conține instrucțiuni pentru rezolvarea următoarei probleme în Centrul de securitate Windows Defender: „Protecția împotriva virușilor și amenințărilor dvs. este gestionată de organizația dvs.” în sistemul de operare Windows 10. </p> <p> Mesajele Windows Defender (erori): „Protecția împotriva virușilor și amenințărilor dvs. este gestionată de organizația dvs.”, „Unele setări sunt gestionate de organizația dvs.” &amp; <br> „Protecția în timp real este gestionată de administratorul dvs.”, apare de obicei pe computerele comerciale unde Protecția antivirus este gestionată de administratorul domeniului. Dacă computerul nu aparține unui domeniu, atunci erorile de mai sus apar după instalarea unui antivirus terță parte sau după un atac de virus. </p> <p><img src=\"images/image_thumb-25-853.png\" alt=\"FIX: Virus & Threat Protection is Managed by your Organization - Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Cum să remediați: protecția împotriva virușilor și amenințărilor dvs. este gestionată de organizația dvs. în Windows 10. </h4> <h6> Pasul 1. Dezinstalați orice alt antivirus non-Microsoft. </h6> <p> Primul pas pentru a rezolva eroarea Windows Defender „Protecția împotriva virușilor și amenințărilor este gestionată de organizația dvs.” este dezinstalarea oricărui alt antivirus terță parte (de exemplu, Avast, MacAfee, MalwareBytes etc.) din sistemul dvs. </p> <p> </p> <h6> Pasul 2. Scanați-vă sistemul pentru viruși și programe malware. </h6> <p> Al doilea pas pentru rezolvarea erorii Windows Defender „Unele setări sunt gestionate de organizația dvs.” este să vă asigurați că sistemul dvs. nu conține viruși / programe malware. Pentru acea sarcină, urmați instrucțiunile din acest ghid: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să vă scanați computerul pentru viruși și alte programe malware. </a></p> <p> </p> <h6> Pasul 3. Restabiliți setările Windows Defender la valorile implicite. </h6> <p> Continuați și activați protecția în timp real în Windows Defender, utilizând una dintre metodele de mai jos: </p> <h4> Metoda 1. Activați Protecția antivirus Defender în registru. </h4> <p> 1. Deschideți <strong> Editor de registru </strong> : Pentru a face asta: </p> <ul> <li> Apăsați simultan Windows <img src=\"images/image_thumb36-979.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. </li> <li> Tip <strong> regedit </strong> &amp; presa <strong> Introduce. </strong></li> </ul> <p><img src=\"images/image_thumb7-229.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2 .. Navigați la următoarea cheie din panoul din stânga: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Policies \\ Microsoft \\ Windows Defender </strong></li> </ul> <p> 3. În panoul din dreapta, faceți dublu clic pe <strong> DisableAntiSpyware </strong> REG_DWORD valoare și schimbați datele de valoare de la 1 la <strong> 0. </strong></p> <p><img src=\"images/image_thumb-26-852.png\" alt=\"enable defender antivirus protection - registry\" loading=\"lazy\"></p> <p> </p> <p> 4. Faceți clic pe <strong> O.K </strong> și <strong> închide </strong> Editor de registru. <br> 5. <strong> Repornire </strong> computerul dvs. În mod normal, după repornire, Windows Defender ar trebui să fie activat. * </p> <p> * Notă: Dacă după repornirea computerului, Windows Defender este încă dezactivat, cu starea „Protecția împotriva virușilor și amenințărilor dvs. este gestionată de organizația dvs.”, continuați și modificați <br> <strong> start </strong> REG_DWORD valoare de la 4 la <strong> 2 </strong> la următoarele chei de registry: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ SecurityHealthService </li> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ WinDefend </li> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ WdNisSvc </li> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ MpsSvc </li> </ul> <p> </p> <h5> Metoda 2. Ștergeți fișierul <strong> DisableAntiSpyware </strong> Valoare de registru din linia de comandă. </h5> <p> 1. Deschideți <strong> Prompt comandă ca administrator </strong> . Pentru a face asta: </p> <ul> <li> În caseta de căutare tastați: <strong> prompt de comandă </strong> sau <strong> cmd </strong></li> <li> Faceți clic dreapta la <strong> cmd </strong> sau <strong> Prompt de comandă </strong> rezultă și selectează <strong> Rulat ca administrator. </strong></li> </ul> <p><img src=\"images/image_thumb-10-243.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. În linia de comandă tastați (Copiere / Lipire) următoarea comandă și apăsați <strong> Introduce: </strong></p> <ul> <li> Ștergeți REG &quot;HKLM \\ SOFTWARE \\ Policies \\ Microsoft \\ Windows Defender&quot; / v DisableAntiSpyware </li> </ul> <p> 3. Apoi apăsați <strong> Da </strong> pentru a vă confirma decizia. </p> <p><img src=\"images/image_thumb-28-288.png\" alt=\"enable defender antivirus protection command\" loading=\"lazy\"></p> <p> </p> <p> 4. Închideți promptul de comandă și <strong> repornire </strong> computerul tau. </p> <p> </p> <h5> Metoda 3. Activați protecția Windows Defender în timp real în politica de grup. </h5> <p> Dacă dețineți Windows 10 Professional, Enterprise sau Educație, continuați și activați protecțiile Windows Defender Antivirus în Politica de grup. Pentru a face asta: </p> <p> 1. Apăsați simultan Windows <img src=\"images/image_thumb36-102.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați <strong> gpedit.msc </strong> &amp; Presa <strong> Introduce. </strong></p> <p><img src=\"images/image_thumb-78-343.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. În panoul din stânga navigați la: </p> <ul> <li><strong> Configurare computer \\ Șabloane administrative \\ Componente Windows \\ Windows Defender Antivirus </strong></li> </ul> <p> 4. În panoul din dreapta deschideți <strong> Dezactivați Windows Defender Antivirus </strong> setare. </p> <p><img src=\"images/image14_thumb-207.png\" alt=\"turn on defender antivirus protection- group policy\" loading=\"lazy\"></p> <p> </p> <p> 5. Setați setarea politicii la <strong> Neconfigurat </strong> sau <strong> Dezactivat </strong> pentru a activa protecția în timp real și faceți clic <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-29-337.png\" alt=\"enable defender antivirus protection group policy\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Repornire </strong> calculatorul. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această problemă. </p>"}