{"title":"FIX: SrTasks.exe Problemă de utilizare a discului ridicat (rezolvată)","content":"<p> Următoarea problemă poate apărea pe un computer bazat pe Windows 10. „SrTasks.exe” face ca discul să funcționeze la 100%. Procesul &quot;SrTasks.exe&quot; (Microsoft System Protection Background Tasks) este un proces Windows legitim și a fost folosit pentru a porni serviciul Volume Shadow Copy Service și Microsoft Software Shadow Copy Provider. </p> <p> Procesul „SrTasks.exe” pornește serviciile conexe necesare pentru a crea puncte de restaurare și în mod normal nu ar trebui să afecteze continuu performanța sistemului și mai ales în sistemele în care „Protecția sistemului” este dezactivată. </p> <p><img src=\"images/image_thumb-58-374.png\" alt=\"FIX SrTasks.exe High Disk Usage - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Acest tutorial conține instrucțiuni pentru a rezolva problema SrTasks.exe 100% Utilizare disc pe Windows 10. </p> <h4> Cum se remediază utilizarea SrTasks.exe High Disc pe Windows 10. </h4> <p> </p> <h6> Metoda 1. Scanați computerul pentru a detecta malware și viruși. </h6> <p> Primul pas pentru a depana problema „SrTasks.exe high disk usage” este să vă asigurați că sistemul dvs. nu conține viruși / programe malware. Pentru acea sarcină, urmați instrucțiunile din acest ghid: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să vă scanați computerul pentru viruși și alte programe malware. </a></p> <p> </p> <h6> Metoda 2. Dezactivați protecția sistemului. </h6> <p> A doua metodă pentru a rezolva problema de utilizare ridicată a discului cauzată de procesul „SrTasks.exe” este dezactivarea protecției de restaurare a sistemului de pe computer. Pentru a face asta: </p> <p> 1. Deschideți Windows Explorer, faceți clic dreapta pe „Acest computer” și alegeți <strong> Proprietăți </strong> . </p> <p><img src=\"images/image_thumb-70-978.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Alegeți <strong> Protecția sistemului </strong> la stânga. </p> <p><img src=\"images/image_thumb-71-135.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Evidențiați <strong> Disc local C: (sistem) </strong> și faceți clic pe <strong> Configurați. </strong></p> <p><img src=\"images/image_thumb-59-973.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. La opțiunile de protecție a sistemului, selectați <strong> Dezactivați protecția sistemului </strong> și faceți clic pe <strong> O.K. * </strong></p> <p> </p> <p> * Notă: dacă „Protecția sistemului” este deja dezactivată, continuați cu următoarea metodă. </p> <p><img src=\"images/image_thumb-60-732.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Repornire </strong> computerul dvs. și apoi verificați dacă problema de utilizare ridicată a discului a fost rezolvată. Dacă problema persistă, reactivați protecția sistemului și continuați cu metoda următoare. </p> <p> </p> <h6> Metoda 3. Dezactivați serviciul Superfetch. </h6> <p> În multe cazuri, problema de utilizare a discului de 100% este rezolvată după dezactivarea serviciului Superfetch. Pentru a dezactiva serviciul „Superfetch”: </p> <p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-289.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. În caseta Căutare, tastați: <strong><em> services.msc </em></strong> &amp; faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-12-431.png\" alt=\"services.msc\" loading=\"lazy\"></p> <p> </p> <p> 3. În lista de servicii, faceți dublu clic pe serviciul Superfetch pentru a-i deschide proprietățile. <br> 4. Setați „Tip de pornire” la <strong> Dezactivat </strong> și apoi <strong> O.K. </strong></p> <p><img src=\"images/image_thumb-61-575.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Repornire </strong> computerul tau. Dacă după repornire problema persistă, reactivați serviciul „SuperFetch” și continuați cu următoarea metodă. </p> <p> </p> <h6> Metoda-4. Rulați Verificați discul pentru a găsi și remedia erorile de pe hard disk. </h6> <p> 1. Deschideți <strong> Prompt comandă ca administrator </strong> . Pentru a face asta: </p> <p> </p> <p> 1. Apăsați tasta <strong> Windows <img src=\"images/image_thumb-97-652.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> tastele pentru a deschide caseta de comandă „Run” <strong><br> </strong> 2. Tastați <strong> CMD </strong> și apoi apăsați <strong> CTRL </strong> + <strong> SCHIMB </strong> + <strong> INTRODUCE. </strong></p> <p><img src=\"images/image_thumb-35-581.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. La promptul de comandă, dați următoarea comandă pentru a repara discul și apăsați <strong> introduce </strong> . </p> <ul> <li><strong> chkdsk C: / F / R </strong></li> </ul> <p> 3. Apăsați tasta <strong> Da </strong> tasta pentru a programa verificarea la următoarea repornire. <br> 4. <strong> Repornire </strong> computerul tau. </p> <p><img src=\"images/image_thumb-62-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Acum așteptați finalizarea procesului de verificare a discului. (va dura câteva ore). <br> 6. Când procesul de verificare a discului este finalizat, verificați dacă „SrTasks.exe High Disk Usage” s-a rezolvat. </p> <p> </p> <p> </p> <h6> Metoda 5. Depanarea problemelor Windows executând sarcinile de întreținere. </h6> <p> 1. Navigați la <strong> Panou de control </strong> și deschis <strong> Depanare </strong> . * </p> <p> * Notă: dacă nu vedeți <strong> Depanare </strong> , setați opțiunea „Vizualizare după” la <strong> Icoane mici. </strong></p> <p><img src=\"images/image_thumb-63-494.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Sub „Sistem și securitate”, selectați <strong> Rulați Sarcini de întreținere </strong> . </p> <p><img src=\"images/image_thumb-27-812.png\" alt=\"run maintenance in windows 10 & Windows 8\" loading=\"lazy\"></p> <p> </p> <p> 3. Apăsați <strong> Următorul </strong> și apoi așteptați până când utilitarul de întreținere a sistemului detectează probleme. <br> 4. Urmați instrucțiunile de pe ecran pentru a remedia problemele găsite. </p> <p> </p> <h6> Metoda 6. Reparați fișierele de sistem Windows. </h6> <p> O altă metodă pentru a rezolva problema de utilizare a discului SrTasks.exe ridicat în Windows 10 este repararea Windows utilizând comenzile DISM și SFC. </p> <p> 1. Deschideți <strong> Prompt comandă ca administrator </strong> . <br> 2. În promptul de comandă, dați următoarea comandă și apăsați <strong> Introduce: </strong></p> <ul> <li><strong> DISM.exe / Online / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-583.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Când operațiunea DISM este finalizată, tastați următoarea comandă și apăsați <strong> introduce </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-428.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Acum așteptați până când System File Checker repară fișierele de sistem Windows. <br> 5. Când se face acest lucru, <strong> repornire </strong> computerul tau. </p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}