{"title":"FIX: 0x800707e7, 0x000007E7 erori în Windows 10 Update.","content":"<p> Actualizarea codului de eroare Windows 10 „0x800707E7 - 0x3000D: Instalarea a eșuat în faza FIRST_BOOT cu o eroare în timpul operației MIGRATE_DATA”, apare de obicei atunci când Windows nu poate migra un profil de utilizator. </p> <p> Eroarea 0x800707E7 din Windows 10 Update, întâlnită în mod obișnuit pe computerele cu plăci grafice NVIDIA, care utilizează serviciul de actualizare NVIDIA pentru a actualiza drivere sau alte programe NVIDIA. Mai precis, pe sistemele de carduri NVIDIA, atunci când instalați software-ul NVIDIA, un utilizator nou este creat automat în Windows, numit „UpdatusUser” care este utilizat de serviciul de actualizare NVIDIA. </p> <p> În acest ghid veți găsi instrucțiuni pas cu pas pentru a rezolva următoarele erori în Windows 10 Update: </p> <ul> <li> <ul> <li> 0x800707E7 - 0x3000D: Instalarea a eșuat în faza FIRST_BOOT cu o eroare în timpul operației MIGRATE_DATA </li> <li> 0x000007E7: ERROR_PROFILE_DOES_NOT_MATCH_DEVICE, profilul specificat este destinat unui dispozitiv de un tip diferit de cel specificat. </li> </ul> </li> </ul> <h2> Cum se rezolvă erorile de actualizare Windows 10 0x800707e7, 0x000007E7. </h2> <h3> Pasul 1. Dezinstalați software-ul NVIDIA de pe aparat. </h3> <p> Dacă dețineți o placă grafică NVIDIA, navigați la <strong> Panou de control </strong> -&gt; <strong> Programe si caracteristici </strong> și <strong> Dezinstalați </strong> toate <strong> Software NVIDIA </strong> . * </p> <p> * Notă: Acest pas se aplică numai sistemelor cu carduri NVIDIA. Dacă nu dețineți o placă grafică NVIDIA treceți la pasul 2. </p> <p><strong> Pentru a dezinstala software-ul NVIDIA. </strong></p> <p> 1. Navigați în <strong> Programe si caracteristici </strong> în Panoul de control. Pentru a face asta: </p> <blockquote><p> 1. Apăsați simultan Windows <img src=\"images/image_thumb36-131.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați: <strong> appwiz.cpl </strong> și faceți clic pe <strong> O.K </strong> . </p></blockquote> <p><img src=\"images/image_thumb-24-479.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 2. Selectați unul câte unul tot software-ul NVIDIA și faceți clic <strong> Dezinstalați. </strong></p> <p><img src=\"images/image_thumb-67-843.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Urmați instrucțiunile de pe ecran pentru a elimina software-ul NVIDIA de pe computer. <br> 4. Când dezinstalarea este finalizată <strong> repornire </strong> computerul dvs. și continuați cu pasul următor. </p> <h3> Pasul 2. Ștergeți „UpdatusUser” și orice profil de utilizator necunoscut. </h3> <p> 1. Faceți clic dreapta pe pictograma computerului (Acest computer) din Explorer și alegeți <strong> Proprietăți </strong> . <br> 2. Faceți clic pe <strong> Setari de sistem avansate </strong> . <br> 3. La <strong> Profilurile utilizatorilor </strong> , faceți clic pe <strong> Setări </strong> . </p> <p><img src=\"images/image_thumb-68-812.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Selectați și <strong> șterge </strong> <strong> UpdatusUser </strong> sau orice alt profil care nu vă este cunoscut ( <strong> cu exceptia </strong> profilul dvs. și <strong> Profil implicit </strong> ). </p> <p><img src=\"images/image_thumb-69-946.png\" alt=\"Delete User Profile\" loading=\"lazy\"></p> <p> 4. Când ați terminat, faceți clic pe <strong> O.K </strong> și continuați cu pasul următor. </p> <h3></h3> <h3> Pasul 3. Eliminați profilurile de utilizator necunoscute din registru. </h3> <p> 1. Deschideți Registry Editor: pentru a face acest lucru: </p> <blockquote><p> 1. Apăsați Windows <img src=\"images/image_thumb41-520.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați <strong> regedit </strong> și apăsați <strong> introduce </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-235.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> </p> <p> 3. În Registry Editor navigați la următoarea cheie din panoul din stânga: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows NT \\ CurrentVersion \\ ProfileList </li> </ul> <p> 4a. Acum extindeți fișierul <strong> ProfileList </strong> tasta și faceți clic pe fiecare profil &quot;S-1-5-21-xxxx&quot; și vedeți dacă vreuna dintre ele are valoarea &quot; <strong> C: \\ Users \\ UpdatusUser &quot; </strong> la <strong> ProfileImagePath. </strong></p> <p><img src=\"images/image_thumb-70-754.png\" alt=\"FIX: 0x800707e7 or 0x000007E7 errors in Windows 10 Update.\" loading=\"lazy\"></p> <p> 4b. Dacă găsiți „ <strong> C: \\ Users \\ UpdatusUser &quot; </strong> valoare <strong> </strong> pe un profil, apoi selectați profilul din panoul din stânga și <strong> Șterge </strong> aceasta. </p> <p><img src=\"images/image_thumb-71-506.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. În cele din urmă, consultați numele complet al fiecărei chei de profil „S-1-5-21-xxxx” (sub „Cheia listei de profil”) și <strong> șterge </strong> orice cheie de profil care are o <strong> .bak </strong> extensie la sfârșitul numelui său. </p> <p><img src=\"images/image_thumb-72-738.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Când ați terminat, închideți Registry Editor și <strong> repornire </strong> computerul dvs. <br> 7. După repornire: </p> <blockquote> <p> A. Navigheaza catre <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Site de descărcare Windows 10 </a> și faceți clic pe <strong> Actualizează acum </strong> buton. </p> <p><img src=\"images/image_thumb-65-120.png\" alt=\"Download Windows 10 21H1 \" loading=\"lazy\"></p> <p> b. Salvați fișierul „Windows10Upgrade9252.exe” pe desktop. <br> c. Faceți dublu clic pe fișierul descărcat pentru a deschide fișierul <strong> Asistent de upgrade Windows </strong> . <br> d. Clic <strong> Actualizează acum </strong> pentru a începe actualizarea. </p></blockquote> <p> 8. Actualizarea Windows ar trebui să fie finalizată acum fără probleme și fără erori 0x800707e7 (sau 0x000007E7). <br> 9. În cele din urmă, după actualizarea Windows 10 și dacă dețineți o placă grafică NVIDIA, continuați și reinstalați software-ul NVIDIA. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această problemă. </p>"}