{"title":"FIX: Bara de coloane Outlook (bara de antet) dispare în Outlook 2016/2019. (Rezolvat)","content":"<p> Acum câteva zile, unul dintre clienții mei m-a contactat pentru a raporta că bara cu titlurile coloanei (Trimitere, De la, Subiect, Primite, Dimensiune etc.) lipsește în Outlook 2019. Mai precis, rândul cu antetele coloanelor au dispărut după ce utilizatorul a personalizat „Setări vizualizare” și a mărit dimensiunea fontului ROW. </p> <p><img src=\"images/image_thumb-567.png\" alt=\"FIX: Outlook Columns Bar (Header Bar) Disappear in Outlook 2016/2019\" loading=\"lazy\"></p> <p> Acest tutorial conține instrucțiuni despre cum să remediați problema „Bara de antet Outlook (rândul coloanelor) lipsă” în Outlook 2016/2019. </p> <h4> Cum se remediază: lipsesc rândul de titlu al coloanei în Outlook 2016/2019. </h4> <p> 1. În panoul din stânga, cu folderele Outlook, selectați folderul în care nu puteți vedea rândul cu coloanele (anteturi). </p> <p> 2. În bara de meniu, alegeți <strong> Vedere </strong> și apoi faceți clic pe <strong> Vizualizați setările </strong> . </p> <p><img src=\"images/image_thumb-1-535.png\" alt=\"FIX Column Heading Row is Missing Outlook 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. În opțiunile „Advanced View Settings”, faceți clic pe <strong> Alte setari </strong> . </p> <p><img src=\"images/image_thumb-2-711.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. În opțiunile „Alte setări”, <strong> debifează </strong> <strong> Utilizați un aspect compact cu mai puțin de 125 de caractere </strong> bifați și faceți clic pe <strong> O.K </strong> de două ori pentru a aplica setarea și pentru a închide toate ferestrele. </p> <p><img src=\"images/image_thumb-3-736.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Reporniți Outlook (sau navigați la un alt folder și reveniți din nou la folderul pe care ați aplicat modificarea), pentru a vedea bara cu titlurile coloanei înapoi în poziție. </p> <p><img src=\"images/image_thumb-4-249.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-5.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p>"}