{"title":"FIX: Eroare de activare 0x80072EE7 în Windows 10. (Rezolvat)","content":"<p> Dacă primiți eroarea de activare 0x80072EE7 când încercați să activați Windows 10, continuați să citiți acest tutorial pentru a rezolva problema. Eroarea de activare &quot; <em> Nu putem activa Windows pe acest dispozitiv, deoarece serverele noastre de activare nu sunt disponibile în acest moment. Asigurați-vă că sunteți conectat la Internet și vom încerca automat să activați Windows când serviciul devine disponibil &quot;cu cod de eroare: 0x80072EE7, </em> apare de obicei din cauza unor probleme de rețea. </p> <p><img src=\"images/image_thumb-5-942.png\" alt=\"FIX: We can’t activate Windows on this device - Error 0x80072EE7\" loading=\"lazy\"></p> <p> Acest tutorial conține instrucțiuni pentru remedierea erorii de activare Windows 10 0x80072EE7: „Nu putem activa Windows pe acest dispozitiv, deoarece serverele noastre de activare nu sunt disponibile în acest moment”. </p> <h4> Cum se rezolvă eroarea de activare Windows 10 0x80072EE7 </h4> <h6> Pasul 1. Asigurați-vă că sunteți conectat la Internet. </h6> <p> Dacă nu puteți activa Windows 10 din cauza erorii 0x80072EE7, verificați mai întâi conectivitatea la internet. Pentru aceasta, deschideți browserul de internet și vizitați orice site web pentru a vă asigura că conexiunea la internet funcționează. </p> <p> </p> <h6> Pasul 2. Folosiți o cheie de produs validă pentru Windows 10. </h6> <p> Eroarea de activare Windows 10 0x80072EE7, poate apărea dacă cheia de produs instalată este nevalidă. Deci, asigurați-vă că utilizați o cheie de licență validă și legală pentru a activa Windows 10. Cheia de licență trebuie să se refere la versiunea instalată a Windows 10 (de exemplu, Home sau Pro) și trebuie să fie tastată corect. </p> <p> Pentru a schimba cheia de produs Windows 10, accesați <strong> Setări </strong> &gt; <strong> Actualizare și securitate </strong> &gt; <strong> Activare </strong> și faceți clic pe <strong> Schimbați cheia produsului </strong> . </p> <p><img src=\"images/image_thumb-6-424.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Pasul 3. Modificați setările DNS </h6> <p> 1. <strong> Click dreapta </strong> pe <strong> Reţea </strong> pictogramă <img src=\"images/image_thumb-42-792.png\" alt=\"image\" loading=\"lazy\"> în Bara de activități și faceți clic pe <strong> Deschideți Centrul de rețea și partajare. </strong> * </p> <p><img src=\"images/image_thumb-104-479.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Selectați <strong> Ethernet </strong> (sau Wi-Fi) din stânga, apoi în secțiunea „Setări corelate”, faceți clic pe <strong> Schimbați opțiunile adaptorului </strong> . </p> <p><img src=\"images/image_thumb-43-166.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> 3. Faceți clic dreapta pe adaptorul de rețea activ (Ethernet sau Wi-Fi) și selectați <strong> Proprietăți </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-44-500.png\" alt=\"network properties\" loading=\"lazy\"></p> <p> 4. Selectați <strong> „Internet Protocol Versiunea 4 (TCP / IPv4) </strong> &#39;și faceți clic <strong> Proprietăți </strong></p> <p><img src=\"images/image_thumb-106-472.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> 5. La Internet Protocol Versiunea 4 (TCP / IPv4) proprietăți: </p> <blockquote><p> A. <strong> Verifica </strong> <strong> Utilizați următoarele adrese de server DNS: </strong> buton de radio. <br> b. Apoi, tastați următoarele adrese de server DNS (serverele DNS publice Google) și faceți clic <strong> O.K. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> </blockquote> <p><img src=\"images/image_thumb-109-991.png\" alt=\"google dns settings\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Repornire </strong> computerul tau. </p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}