{"title":"FIX: Utilizare ridicată a procesorului DWM.EXE în timp ce vă conectați prin RDP în Windows 10 (rezolvat)","content":"<p> Următoarea problemă poate apărea pe un computer bazat pe Windows 10, în timp ce alți clienți sunt conectați la acesta, prin RDP (conexiune desktop la distanță): Procesul &quot;DWM.EXE&quot;, cauzează o utilizare ridicată a procesorului pe gazda la distanță, sau se blochează și termină sesiune desktop la distanță. Problema apare de obicei dacă mașina gazdă de la distanță, rulează Windows 10 v1903 și deține un adaptor de afișare bazat pe Intel (GPU). </p> <p><img src=\"images/image_thumb-35-158.png\" alt=\"FIX: Event 1000, Application error dwm.exe\" loading=\"lazy\"></p> <p> </p> <p> Problemă în detalii: Când o mașină clientă este conectată prin RDP la o mașină gazdă Windows 10 (țintă), mașina gazdă deconectează clientul desktop la distanță deoarece procesul Windows Desktop Manager (dwm.exe) merge la utilizarea procesorului 100%. Când apare problema, următorul eveniment este înregistrat în Event Viewer: </p> <p><em> „Numele aplicației cu erori: dwm.exe, versiunea: 10.0.17134.1, ștampila de timp: 0xf5178e97 <br> Numele modulului defect: necunoscut, versiunea: 0.0.0.0, marcajul de timp: 0x00000000 <br> Cod de excepție: 0x8898009b <br> Offset de eroare: 0x0000000000000000 <br> ID proces defect: 0x3a8 <br> Ora de pornire a aplicației defecte: 0x01d51ae025b941b3 <br> Calea aplicației defecte: C: \\ WINDOWS \\ system32 \\ dwm.exe <br> Calea modulului defect: necunoscută <br> ID raport: fba8573a-ee4e-4430-b40c-3627888dbfd9 &quot; </em></p> <p> </p> <p> Acest tutorial conține instrucțiuni pentru rezolvarea utilizării ridicate a procesorului DWM.EXE pe o mașină Windows 10 gazdă la distanță, după conectarea cu desktopul la distanță (RDP). </p> <h4> Cum se remediază DWM.EXE High CPU Utilization pe Remote Desktop Windows 10 host. </h4> <p> Pentru a rezolva utilizarea procesorului DWM.EXE ridicat, aplicați instrucțiunile de pe următoarele metode pe computerul Windows 10 la care vă conectați prin conexiunea desktop la distanță (PC gazdă): </p> <h6> Metodă 1. Forțați conexiunile Desktop la distanță să utilizeze driverul de afișare grafică XDDM. </h6> <p> 1. Apăsați simultan Windows <img src=\"images/image_thumb36-341.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați <strong> gpedit.msc </strong> &amp; Presa <strong> Introduce. </strong></p> <p><img src=\"images/image_thumb-78-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. În panoul din stânga navigați la: </p> <ul> <li><strong> Configurare computer </strong> &gt; <strong> Șabloane administrative </strong> &gt; <strong> Componente Windows </strong> &gt; <strong> Servicii desktop la distanță </strong> &gt; <strong> Gazdă sesiune desktop la distanță </strong> &gt; <strong> Mediul sesiunii la distanță </strong></li> </ul> <p> 4. În panoul din dreapta, faceți dublu clic pe <strong> Utilizați driverul de afișare grafică WDDM pentru conexiuni desktop la distanță </strong></p> <p><img src=\"images/image_thumb-24-327.png\" alt=\"FIX: DWM.EXE High CPU Usage while using RDP \" loading=\"lazy\"></p> <p> </p> <p> 5. Setați setarea politicii la <strong> Dezactivat </strong> și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-25-498.png\" alt=\"FIX: DWM.EXE High CPU Usage while connecting through RDP in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Închideți editorul de politici de grup și <strong> reporniți </strong> calculatorul. </p> <p> </p> <p> </p> <h6> Metoda 2. Instalați driverul de afișare Microsoft Basic. </h6> <p> 1. Navigați la Device Manager. Pentru a face asta: </p> <blockquote><p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-301.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați: <strong> devmgmt.msc </strong> &amp; faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-26-428.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. Extindeți <strong> Adaptoare de afișare </strong> . <br> 3. Faceți clic dreapta pe adaptorul de afișaj instalat și selectați <strong> Proprietăți </strong> . <br> 4. Selectați <strong> Conducător auto </strong> fila și apoi faceți clic pe <strong> Actualizați driver-ul </strong> . </p> <p><img src=\"images/image_thumb-27-371.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Faceți clic pe <strong> Răsfoiți computerul pentru software-ul driverului </strong> . </p> <p><img src=\"images/image_thumb-28-269.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Alegeți <strong> Permiteți-mi să aleg dintr-o listă de drivere disponibile pe computer </strong> . </p> <p><img src=\"images/image_thumb-29-401.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Alegeți <strong> Microsoft Basic Display Adapter </strong> și faceți clic pe <strong> Următorul </strong> . </p> <p><img src=\"images/image_thumb-30-520.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Când instalarea este finalizată, închideți toate ferestrele deschise și ați terminat. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această problemă. </p>"}