{"title":"FIX: Meniul de pornire Windows 10, Setări, Cortana sau Bara de activități nu funcționează. (Rezolvat)","content":"<p> Acest tutorial conține instrucțiuni pentru rezolvarea următoarelor probleme în Windows 10: Meniul Start nu se deschide, Căutarea Cortana nu funcționează, aplicația Setări nu se lansează, pictogramele barei de activități nu se vor deschide. </p> <p> Mulți utilizatori de Windows 10 au raportat probleme cu meniul Start, Bara de activități, Cortana și Setări, așa că în acest ghid listez cele mai comune metode de rezolvare a problemelor de mai sus. </p> <h2> Cum se remediază: bara de activități Windows 10, meniul Start, setări sau probleme Cortana. </h2> <h3> Metoda 1. Dezinstalați cea mai recentă actualizare Windows 10. </h3> <p> Mulți utilizatori au raportat că problemele menționate în acest articol sunt rezolvate după dezinstalare <strong><a href=\"https://support.microsoft.com/en-us/topic/august-11-2020-kb4566782-os-build-19041-450-ec5cf4b6-86ed-b0d3-539c-5fbe1b17f56a\" target=\"_blank\" rel=\"nofollow noopener\"> KB4566782 </a></strong> Actualizați. </p> <p> Dacă nu găsiți actualizarea KB4566782 în lista actualizărilor instalate, verificați și instalați toate actualizările disponibile și, dacă problema persistă, încercați să <strong><a href=\"https://www.repairwin.com/how-to-uninstall-updates-in-windows-10/#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> dezinstalați cele mai recente actualizări instalate. </a></strong></p> <h3> Metoda 2. Reporniți Windows 10 în modul sigur. </h3> <p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-268.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați <strong> msconfig </strong> și apăsați <strong> introduce </strong> . </p> <p><img src=\"images/image_thumb-47-537.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. La <strong> Cizmă </strong> fila selectați <strong> Boot sigur </strong> , apoi faceți clic pe <strong> O.K </strong> și reporniți computerul. </p> <p><img src=\"images/image_thumb-48-665.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 4. După repornire și în modul Safe Mode, verificați dacă problemele dvs. persistă. <br> 5. Apoi, rulați din nou instrumentul „msconfig” și la <strong> General </strong> fila, verificați <strong> Pornire normală </strong> și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-859.png\" alt=\"normal startup windows\" loading=\"lazy\"></p> <p> 6. <strong> Repornire </strong> computerul tau. <br> 7. După repornire, verificați dacă problema persistă, altfel continuați cu următoarea metodă. </p> <p> </p> <h2> Metoda 3. Efectuați o pornire curată. </h2> <p> 1. Rulați instrumentul „msconfig”. <br> 2. În fila Servicii, <strong> Verifica </strong> <strong> Ascunde toate serviciile Microsoft </strong> caseta de selectare și apoi apăsați <strong> Dezactivați toate </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-333.png\" alt=\"clean boot windows\" loading=\"lazy\"></p> <p> </p> <p> 3. Apoi selectați <strong> Lansare </strong> fila și faceți clic pe <strong> Deschideți Managerul de activități. <br> </strong> 4. <strong> </strong> Selectați unul câte unul toate programele listate și faceți clic <strong> Dezactivează. </strong></p> <p><img src=\"images/image_thumb-1-399.png\" alt=\"clean boot windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Când ați terminat, închideți fereastra respectivă și apoi faceți clic pe <strong> O.K </strong> la utilitarul „Configurare sistem” la <strong> Repornire </strong> computerul tau. <br> 6. După repornire, dacă computerul dvs. funcționează bine și fără probleme, * apoi deschideți din nou utilitarul „Configurare sistem” (msconfig) și activați rând pe rând toate programele dezactivate și reporniți computerul, până când aflați ce program cauzează problemă. </p> <p> * Notă: Dacă problema persistă, chiar și în starea Clean Boot, continuați cu următoarea metodă. </p> <h3> Metoda 4. Reinstalați și reînregistrați toate aplicațiile încorporate Windows 10. </h3> <p> Următoarea metodă de rezolvare a problemelor cu bara de activități, meniul Start, Cortana etc. din Windows 10 este reinstalarea și reînregistrarea tuturor aplicațiilor încorporate. </p> <p> 1. Deschideți PowerShell ca administrator. Pentru a face asta: </p> <blockquote><p> 1. La <strong> Cortana </strong> caseta de căutare, tastați <strong> puterea <br> </strong> 2. Faceți clic dreapta pe <strong> Windows PowerShell </strong> rezultă și selectează <strong> Rulat ca administrator. </strong></p></blockquote> <p><img src=\"images/image_thumb-51-691.png\" alt=\"FIX: Windows 10 Start Menu, Settings, Cortana or Taskbar icons Not Working.\" loading=\"lazy\"></p> <p> </p> <p> 3. În PowerShell Type (copiere și lipire) următoarea comandă și apăsați <strong> introduce </strong> : </p> <ul> <li> Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register &quot;$ ($ _. InstallLocation) \\ AppXManifest.xml&quot;} </li> </ul> <p><img src=\"images/image_thumb-2-985.png\" alt=\"register re-install windows 10 apps\" loading=\"lazy\"></p> <p> 4. Așteptați executarea comenzii și ignorați erorile (cu litere roșii). <br> 5. <strong> Repornire </strong> computerul și apoi verificați dacă problema dvs. este rezolvată. </p> <p> </p> <h3> Metoda 5. Creați un cont nou. </h3> <p> O altă metodă de rezolvare a mai multor probleme în Windows 10 este crearea unui cont nou și transferul fișierelor și datelor personale în noul cont. Pentru a face asta: </p> <p> 1. Deschideți <strong> Promptul de comandă ca administrator </strong> . <br> 2. La promptul de comandă, tastați următoarea comandă și apăsați <strong> introduce </strong> : </p> <ul> <li><strong> parola contului de utilizator net / adăugare </strong></li> </ul> <p> * Notă: La comanda de mai sus înlocuiți câmpurile „cont” și „parolă”, cu alegerea dvs. </p> <p> de exemplu. dacă doriți să creați un cont nou cu numele de utilizator „Admin1” și parola „Admin123”, tastați: <em> net user Admin1 Admin123 / adăugare </em></p> <p><img src=\"images/image_thumb-3-388.png\" alt=\"add user windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Apoi continuați și adăugați noul cont, la grupul Administratori, cu această comandă: </p> <ul> <li><strong> cont administratori de grupuri locale net / adăugare </strong></li> </ul> <p> de exemplu. În exemplul nostru, comanda este: <em> net localgroup administrators Admin1 / add </em></p> <p><img src=\"images/image_thumb-4-429.png\" alt=\"fix windows 10 start menu, cortana, settings\" loading=\"lazy\"></p> <p> </p> <p> 4. Închideți promptul de comandă Window și <strong> repornire </strong> computerul tau. <br> 5. După repornire, conectați-vă la un cont nou. <br> 6. Verificați dacă problema persistă. Dacă problema este rezolvată, transferați-vă datele și fișierele în noul cont și ați terminat. </p> <p> </p> <h3> Metoda 6. Reparați Windows 10. </h3> <p> Metoda finală pentru a rezolva problemele Windows 10 este să <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> reparați Windows 10 cu actualizare la fața locului </a> . </p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}