{"title":"FIX: Nu se poate găsi aplicația Skype în Windows 10 (rezolvat)","content":"<p> După o actualizare Windows 10, poate apărea următoarea eroare la pornire: „Windows nu poate găsi„ C: \\ Program Files \\ WindowsApps \\ Microsoft.SkypeApp… \\ Skype \\ Skype.exe ”. Asigurați-vă că ați introdus corect numele, apoi încercați din nou. . &quot; Dacă vă confruntați cu eroarea „Nu se poate găsi aplicația Skype” la pornirea Windows 10, continuați să citiți mai jos. </p> <p><img src=\"images/image_thumb-200.png\" alt=\"FIX: Cannot Find Skype App in Windows 10 \" loading=\"lazy\"></p> <p> </p> <p> Acest tutorial conține instrucțiuni pentru rezolvarea erorii „Nu se poate găsi aplicația Skype” în Windows 10. </p> <h4> FIX: Aplicația Skype nu poate porni - Windows nu poate găsi aplicația Skype. </h4> <h6> Pasul 1. Dezinstalați aplicația Skype. </h6> <p> 1. Din meniul Start <img src=\"images/image_thumb2_thumb_thumb-866.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clic <strong> Setări </strong> <img src=\"images/image_thumb-66-964.png\" alt=\"image\" loading=\"lazy\"> și apoi deschideți <strong> Aplicații </strong> . <br> 2. <strong> Selectați </strong> <strong> Skype </strong> din listă și faceți clic pe <strong> Dezinstalați </strong> . </p> <p><img src=\"images/image_thumb-4-857.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Când dezinstalarea este finalizată, <strong> repornire </strong> computerul dvs. </p> <p> 4. După repornire, dacă totuși primiți eroarea „Nu se poate găsi aplicația Skype”, continuați cu pasul 2 </p> <p> </p> <h6> Pasul 2. Reinstalați aplicația Skype. </h6> <p> 1. Deschideți <strong> Magazin Microsoft </strong> . <br> 2. Tastați <strong> Skype </strong> în bara de căutare și apoi faceți clic pe <strong> Aplicația Skype </strong> pe listă. </p> <p><img src=\"images/image_thumb-5-853.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Faceți clic pe <strong> obține </strong> pentru a instala Skype pe computer. </p> <p><img src=\"images/image_thumb-6-971.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. La finalizarea instalării, <strong> repornire </strong> computerul dvs. În mod normal, mesajul „Nu se poate găsi aplicația Skype” nu ar trebui să mai fie afișat. * </p> <p> * Notă: Dacă totuși primiți mesajul „Nu se poate găsi aplicația Skype” (aplicația Skype nu a putut fi găsită), urmați instrucțiunile de la pasul 1 de mai sus pentru a dezinstala aplicația Skype de pe computer și apoi instalați <a href=\"https://www.skype.com/en/get-skype/download-skype-for-desktop/\" target=\"_blank\" rel=\"nofollow noopener\"> Aplicația Skype pentru desktop </a> . </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}