{"title":"FIX: Nu se poate conecta la partajarea de fișiere, deoarece nu este sigur și necesită protocolul SMB1 învechit. (Rezolvat)","content":"<p> Dacă încercați să vă conectați la un folder partajat în rețea de pe un computer Windows 10 și primiți eroarea „Nu vă puteți conecta la partajarea de fișiere, deoarece nu este sigură. Această partajare necesită protocolul SMB1 învechit, care este nesigur și ar putea expune sistemul dvs. va ataca. Sistemul dvs. necesită SMB2 sau o versiune ulterioară. Pentru mai multe informații despre rezolvarea acestei probleme, consultați: https://go.microsoft.com/fwlink/?linkid=852747 &quot;, apoi continuați mai jos pentru a remedia problema. </p> <p><img src=\"images/image_thumb-30-812.png\" alt=\"You can't connect to the file share because it's not secure. This share requires the obsolete SMB1 protocol, which is unsafe...\" loading=\"lazy\"></p> <p> În Windows 10 v1709 și versiunile ulterioare, protocolul de rețea Server Message Block versiunea 1 (SMBv1) nu este instalat în mod implicit și trebuie activat manual dacă doriți să accesați un folder partajat pe o stație de lucru sau server, care utilizează protocolul SMBv1 pentru distribuire a unui fisier. </p> <p> Acest tutorial conține instrucțiuni pentru rezolvarea următoarelor erori atunci când încercați să vă conectați la un folder partajat în Windows 10: </p> <ul> <li> <p><em> Nu vă puteți conecta la partajarea de fișiere, deoarece nu este sigur. Această distribuție necesită protocolul SMB1 învechit, care nu este sigur ... </em></p> </li> <li> <p><em> Numele de rețea specificat nu mai este disponibil </em></p> </li> <li> <p><em> Eroare nespecificată 0x80004005 </em></p> </li> <li> <p><em> Serverul specificat nu poate efectua operația solicitată. </em></p> </li> </ul> <h4> Cum se remediază: nu se poate conecta la partajarea de fișiere deoarece lipsește protocolul SMBv1 (Windows 10) </h4> <p> 1. Navigați la <strong> Panou de control </strong> -&gt; <strong> Programe si caracteristici </strong> . <br> 2. Faceți clic pe <strong> Activați sau dezactivați funcțiile Windows </strong> din stânga. </p> <p> </p> <p><img src=\"images/image_thumb-68-359.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Extindeți opțiunea „SMB 1.0 / CIFS File Sharing Support” și <strong> Verifica </strong> <strong> Client SMB 1.0 / CIFS </strong> opțiune. Clic <strong> O.K </strong> cand e gata. </p> <p><img src=\"images/image_thumb-29-360.png\" alt=\"Install SMBv1 Windows 10\" loading=\"lazy\"></p> <p> 4. Când este instalat SMB 1.0 / CIFS și apoi faceți clic pe <strong> Reporniți acum </strong> pentru a reporni computerul. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}