{"title":"FIX: Eroare aplicație cameră 0xA00F424F (0x8004005) eroare în Windows 10. (Rezolvat)","content":"<p> Eroarea aplicației Cameră 0xA00F424F din Windows 10, în timp ce încerca să facă fotografii sau videoclipuri, înseamnă că aplicația Cameră nu poate salva fotografiile sau fișierele video în locația de stocare specificată pe computer. Eroarea 0xA00F424F (0x8004005) poate apărea din mai multe motive, deci urmați metodele de mai jos pentru a o remedia. </p> <p><img src=\"images/image_thumb-9-592.png\" alt=\"FIX: Camera App Error 0xA00F424F in Windows 10\" loading=\"lazy\"></p> <p> Acest tutorial conține instrucțiuni pas cu pas pentru a rezolva eroarea „A apărut o eroare. Ne pare rău, nu am putut salva fotografiile” cu eroarea: „0xA00F424F (0x80004005)” sau „PhotoCaptureFileCreationFailed (0x80131500)” </p> <h4> Cum să remediați: aplicația Cameră foto - Salvați eroarea 0xA00F424F (0x8004005) în Windows 10. </h4> <h6> Metodă 1. Permiteți aplicației Camera să acceseze Camera. </h6> <p> Prima metodă de remediere a erorii camerei 0xA00F424F este aceea de a vă asigura că aplicația Cameră are acces la camera dvs. Pentru a face asta: </p> <p> 1. Navigați la <strong> Setări </strong> &gt; <strong> Confidențialitate. <br> </strong> 2. Selectați <strong> aparat foto </strong> aplicația din panoul din stânga și din panoul din dreapta efectuați următoarele setări: </p> <p> A. Comutați <strong> Permiteți aplicațiilor să vă acceseze camera </strong> schimba cu <strong> PE </strong> . <br> b. Derulați în jos și sub <strong> „Alegeți ce aplicații Microsoft Store vă pot accesa camera” </strong> secțiune, comutați <strong> aparat foto </strong> aplicația trece la <strong> PE </strong> . * </p> <p><img src=\"images/image_thumb-4-435.png\" alt=\"Allow apps to access your camera in Windows 10\" loading=\"lazy\"></p> <h6> Metoda 2. Resetați setările aplicației camerei. </h6> <p> 1. Navigați la <strong> Setări </strong> &gt; <strong> Aplicații </strong> . <br> 2. În lista „Aplicații și caracteristici”, selectați aplicația Cameră și apoi faceți clic <strong> Opțiuni avansate </strong> . </p> <p><img src=\"images/image_thumb-5-262.png\" alt=\"Reset Camera App Settings - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Derulați în jos și faceți clic <strong> Resetați. </strong></p> <p><img src=\"images/image_thumb-6-318.png\" alt=\"Reset app settings Windows 10\" loading=\"lazy\"></p> <h6></h6> <h6> Metoda 3. Ștergeți și recreați folderul „Camera Roll”. </h6> <p> Următoarea metodă de remediere a codului de eroare 0xA00F424F (0x80004005) în aplicația Camera, este să vă asigurați că folderul „Camera Roll” (C: \\ Users \\% Username% \\ Pictures \\ Camera Roll), care este locația de salvare implicită fotografii și videoclipuri, există și are permisiunile corecte pentru salvarea fotografiilor și videoclipurilor. Pentru a face asta: </p> <p> 1. Deschideți Windows Explorer și în bara de adrese tastați următoarea adresă și apăsați <strong> introduce </strong> : </p> <ul> <li> % APPDATA% \\ Microsoft \\ Windows \\ Libraries \\ Pictures </li> </ul> <p><img src=\"images/image_thumb-10-952.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Deschideți folderul „Camera Roll” * și asigurați-vă că este gol de fișiere. (În caz contrar, mutați toate fișierele sale într-o altă locație de pe disc.). </p> <p> * Notă: dacă folderul Roll Camera nu există, treceți la pasul 4. </p> <p> 3. Acum, <strong> șterge </strong> <strong> Rola aparatului foto </strong> pliant. </p> <p><img src=\"images/image_thumb-11-440.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. În cele din urmă, creați un folder nou și denumiți-l &quot; <strong> Rola aparatului foto </strong> &quot; <br> 5. Când ați terminat, deschideți aplicația Camera și încercați să faceți o fotografie sau să înregistrați un videoclip pentru a vedea dacă problema este rezolvată. </p> <p> </p> <h6> Metoda 4. Adăugați folderul Camera Roll în Biblioteca de imagini. </h6> <p> Ultima metodă de remediere a erorii aplicației camerei 0xA00F424F este aceea de a specifica o altă locație pentru stocarea fotografiilor / videoclipurilor. Pentru a face asta: </p> <p> 1. Deschideți Windows Explorer și în bara de adrese tastați următoarea adresă și apăsați <strong> introduce </strong> : </p> <ul> <li> % APPDATA% \\ Microsoft \\ Windows \\ Libraries </li> </ul> <p> 2. Faceți clic dreapta pe <strong> Rola aparatului foto </strong> folder și selectați <strong> Proprietăți </strong> . </p> <p><img src=\"images/image_thumb-8-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Acum, efectuați una dintre următoarele: </p> <p> A. Dacă „Camera Roll” nu este listată în „Locație biblioteci, faceți clic pe <strong> Adăuga </strong> , deschideți butonul <strong> Imagini </strong> folder și apoi selectați <strong> Rola aparatului foto </strong> folder ca locație implicită de salvare pentru fotografii și videoclipuri. </p> <p> b. Dacă folderul „Camera Roll” este listat în „Locația bibliotecilor”, faceți clic pe <strong> Adăuga </strong> și specificați un nou folder de stocare pentru aplicația Camera. Când ați terminat, faceți clic pe <strong> Setați locația de salvare </strong> și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-12-180.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. În cele din urmă, deschideți aplicația Camera și încercați să faceți o fotografie sau un videoclip. </p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}