{"title":"REPARARE: Fără sunet de la boxele interne de pe laptop HP OMEN (rezolvat)","content":"<p> Acest tutorial conține instrucțiuni pas cu pas pentru a rezolva problema „fără sunet de la difuzoarele interne”, pe un <a href=\"https://support.hp.com/ph-en/document/c05576170\" target=\"_blank\" rel=\"nofollow noopener\"> Omen laptop pentru HP - 17-an009nv </a> . Problema „fără sunet de la difuzoarele laptopului”, poate apărea pe orice model de laptop HP și apare de obicei după instalarea unei actualizări a driverului Windows pentru dispozitivul Realtek High Definition Audio. </p> <p> Problemă în detalii: Pe un laptop HP care rulează Windows 10, nu există sunet de la difuzoarele interne atunci când redați muzică sau video, dar difuzoarele funcționează normal atunci când rulați testele de diagnostic HP în afara sistemului de operare. De asemenea, problema „fără sunet” apare doar cu difuzoarele laptopului și nu cu difuzoarele externe sau căștile. </p> <h4> Cum se remediază: difuzoarele laptopului fără sunet în Windows 10. </h4> <h6> Pasul 1. Creșteți volumul sunetului </h6> <p> 1. <strong> Click dreapta </strong> la <strong> pictogramă sunet </strong><img src=\"images/image_thumb-11-503.png\" alt=\"image\" loading=\"lazy\"> pe bara de activități și selectați <strong> Deschideți mixerul de volum. </strong></p> <p><img src=\"images/image_thumb-12-807.png\" alt=\"Open Volume Mixer\" loading=\"lazy\"></p> <p> 2. Trageți glisorul Difuzoare în <strong> Top </strong> și verificați dacă puteți auzi sunet. </p> <p><img src=\"images/image_thumb-13-813.png\" alt=\"Adjust Sound Volume\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Pasul 2. Setați Boxele ca dispozitiv de redare implicit. </h6> <p> 1. Navigați la Windows <strong> Panou de control </strong> și deschis <strong> Sunet. </strong></p> <p><img src=\"images/image_thumb-14-315.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Asigurați-vă că <strong> Difuzoare </strong> este <strong> Mod implicit </strong> dispozitiv de redare, altfel selectați difuzoarele și faceți clic pe <strong> Setați implicit </strong> buton. Când ați terminat, testați difuzoarele și, dacă problema persistă, continuați cu pasul următor. </p> <p><img src=\"images/image_thumb-15-993.png\" alt=\"Set Speakers as Default Playback Device\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Pasul 3. Testați boxele interne în afara ferestrelor. </h6> <p> Următorul pas pentru a rezolva problema „fără sunet pe difuzoarele interne” de pe laptopul dvs. este să testați dacă difuzoarele funcționează, atunci când executați testele de diagnosticare hardware HP. Pentru a face asta: </p> <p> 1. <strong> Opriți </strong> laptopul tău. <br> 2. Porniți laptopul și apăsați imediat butonul <strong> ESC </strong> tasta în mod repetat. <br> 3. Când apare meniul, apăsați butonul <strong> F2 </strong> cheie. <br> 4. În meniul principal, faceți clic pe <strong> Teste de componente </strong> și apoi faceți clic pe <strong> AUDIO. <br> </strong> 5. Dacă auziți sunet de la difuzoare în timpul testelor audio, continuați cu pasul 3 de mai jos. * </p> <p><strong> * Notă: </strong> Dacă nu auziți sunet de la difuzoare, opriți-vă aici deoarece există o problemă hardware care poate fi rezolvată doar de un tehnician specializat în laptop (service). </p> <p><img src=\"images/image_thumb-22-211.png\" alt=\"HP Diagnostics - Component Test\" loading=\"lazy\"></p> <p> </p> <h6><br clear=\"all\"> Pasul 4. Rulați înapoi driverul plăcii de sunet. </h6> <p> 1. Deschideți <strong> Manager de dispozitiv </strong> . Pentru a face asta: </p> <blockquote><p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-958.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. În caseta „Deschidere”, tastați: <strong> devmgmt.msc </strong> &amp; faceți clic <strong> O.K </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-5-510.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Extinde </strong> <strong> Controlere de sunet, video și jocuri. </strong></p> <p> 3. <strong> Click dreapta </strong> pe <strong> Realtek High Definition Audio </strong> dispozitiv și selectați <strong> Proprietăți. </strong></p> <p><img src=\"images/image_thumb-17-678.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. În fila Driver, faceți clic pe <strong> Reveniți pe driver </strong> buton. <strong> * </strong></p> <p><strong> * Notă: </strong> Dacă butonul Roll Back Driver este inactiv, continuați cu pasul următor. </p> <p><img src=\"images/image_thumb-18-178.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> </p> <p> 5. Selectați un motiv pentru revenirea pachetului driverului și faceți clic <strong> Da. </strong></p> <p><img src=\"images/image_thumb-19-167.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Când retrogradarea driverului este finalizată, <strong> repornire </strong> computerul tau. <br> 5. După repornire, continuați și testați sunetul de la boxele laptopului. Dacă tot nu auziți sunetul din difuzoarele laptopului, continuați cu pasul următor. </p> <p> </p> <h6><br clear=\"all\"> Pasul 5. Schimbați driverul plăcii de sunet. </h6> <p> 1. Deschideți <strong> Manager de dispozitiv. </strong><br> 2. <strong> Extinde </strong> <strong> Controlere de sunet, video și jocuri. <br> </strong> 3. <strong> Click dreapta </strong> la <strong> Realtek High Definition Audio </strong> dispozitiv, {sau la <strong> „Realtek High Definition Audio (SST) </strong> dispozitiv} și selectați <strong> Actualizați driver-ul. <br> </strong></p> <p><img src=\"images/image_thumb-6-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Selectați <strong> Răsfoiți computerul pentru drivere. </strong></p> <p><img src=\"images/image_thumb-7-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Selectați <strong> Permiteți-mi să aleg dintr-o listă de drivere disponibile pe computer </strong> . </p> <p><img src=\"images/image_thumb-8-771.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> </p> <p> 6. În ecranul următor, aplicați una dintre următoarele acțiuni, în funcție de caz: </p> <p><strong> Cazul A. </strong> Dacă în caseta „Afișați hardware compatibil”, vedeți „Dispozitiv audio de înaltă definiție” și dispozitivele „Realtek High Definition Audio” listate, apoi selectați <strong> Dispozitiv audio de înaltă definiție </strong> și faceți clic pe <strong> Următorul. </strong></p> <p><img src=\"images/image_thumb-20-130.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p><strong> Cazul B. </strong> Dacă în caseta „Afișare hardware compatibil”, vedeți numai <strong> „Realtek High Definition Audio (SST) </strong> dispozitiv, apoi: </p> <blockquote><p> A. <strong> Debifează </strong> <strong> Afișați caseta de selectare hardware compatibil. </strong></p></blockquote> <p><img src=\"images/image_thumb-9-565.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Selectează <strong> Realtek High Definition Audio </strong> driver și faceți clic <strong> Următorul. </strong></p></blockquote> <p><img src=\"images/image_thumb-10-248.png\" alt=\"FIX No Sound from Internal Speakers on Laptop\" loading=\"lazy\"></p> <p> </p> <p> 8. Când instalarea driverului este finalizată, <strong> repornire </strong> computerul tau. <br> 9. După repornire, continuați și testați sunetul de la boxele laptopului. </p> <p> </p> <h6><br clear=\"all\"> Pasul 6. Dezinstalați și reinstalați driverul plăcii de sunet. </h6> <p> 1. Deschideți <strong> Manager de dispozitiv. </strong><br> 2. <strong> Extinde </strong> <strong> Controlere de sunet, video și jocuri. <br> </strong> 3. <strong> Click dreapta </strong> la <strong> Realtek High Definition Audio </strong> dispozitiv și selectați <strong> Dezinstalați dispozitivul. </strong></p> <p><img src=\"images/image_thumb-21-889.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. După dezinstalare, <strong> repornire </strong> computerului dvs. și lăsați Windows să instaleze automat driverele de sunet. Dacă acest lucru nu se întâmplă, navigați la <strong> Setări </strong> &gt; <strong> Actualizare și securitate </strong> și forțați Windows să <strong> Verifică pentru actualizări, </strong> sau treceți la pasul-7 de mai jos. </p> <p> </p> <h6><br clear=\"all\"> Pasul 7. Actualizați driverele plăcii de sunet. </h6> <p> Navigați la site-ul de asistență al producătorului laptopului dvs. și descărcați și instalați cel mai recent driver pentru placa de sunet. Dacă nu găsiți un driver pentru placa de sunet pe site-ul de asistență al producătorilor sau dacă vă confruntați cu problema „fără sunet de la difuzoarele interne” după instalarea noului driver, încercați următoarele dacă dețineți un dispozitiv Realtek HD Audio. </p> <p> 1. Citiți instrucțiunile despre aceasta <a href=\"https://www.repairwin.com/how-to-download-realtek-audio-manager-realtek-audio-drivers-windows-10-8-1-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> articol </strong></a> la <strong> Descarca </strong> <strong> Driver audio Realtek HD v2.82. <br> </strong> 2. După descărcare, continuați și <strong> instalare </strong> <strong> Driver audio Realtek HD. <br> </strong> 3. După instalare <strong> repornire </strong> computerul și testați sunetul de la difuzoare. * </p> <p><strong> Notă finală: </strong> Dacă problema sunetului difuzoarelor persistă, căutați în Device Manager și dacă dispozitivul audio este listat ca „Realtek High Definition Audio (SST)”, urmați instrucțiunile de la pasul 5 de mai sus și schimbați „Realtek High Definition Audio (SST) „driver pentru„ Realtek High Definition Audio ”. </p> <p> Asta-i tot oameni buni! Ce metodă a funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}