{"title":"REPARARE: Serverul nu este accesibil. Este posibil să nu aveți permisiunea de a utiliza această resursă de rețea. Mânerul este nevalid. (Rezolvat)","content":"<p> Acest tutorial conține instrucțiuni pentru remedierea următoarei erori atunci când încercați să accesați un folder partajat din rețea: „Serverul nu este accesibil. Este posibil să nu aveți permisiunea de a utiliza această resursă de rețea. Contactați administratorul acestui server pentru a afla dacă aveți acces permisiuni. Mânerul este nevalid. &quot; </p> <p><img src=\"images/image_thumb-5-437.png\" alt=\"You might not have permission to use this network resource\" loading=\"lazy\"></p> <p> </p> <h2> Cum remediați: nu se poate accesa folderul partajat. Este posibil să nu aveți permisiunea de a utiliza această resursă de rețea. Mânerul este nevalid. </h2> <p> În mod normal, problema conexiunii de partajare a fișierelor „Este posibil să nu aveți permisiunea de a utiliza această resursă de rețea” apare atunci când un utilizator încearcă să acceseze un folder partajat în rețea, fără a avea permisiunile necesare. În acest caz și pentru a rezolva problema, trebuie să vă asigurați că utilizatorul are permisiunile de acces corespunzătoare în folderul partajat. </p> <p> Cu toate acestea, dacă știți că permisiunile utilizatorului pentru folderul partajat sunt corecte și problema conexiunii „Este posibil să nu aveți permisiunea de a utiliza această resursă de rețea” a apărut brusc și fără un motiv evident, atunci problema se datorează probabil instalării unui Windows Actualizați. În acest caz, continuați să citiți mai jos pentru a remedia problema. </p> <p> * Notă: dacă vă confruntați cu eroarea de partajare la mijlocul lunii ianuarie 2019, atunci vinovatul este următoarea actualizare de securitate Windows: <a href=\"https://support.microsoft.com/el-gr/help/4480970/windows-7-update-kb4480970\" target=\"_blank\" rel=\"nofollow noopener\"> 8 ianuarie 2019 — KB4480970 (pachet acumulat lunar) </a> . </p> <h6> Metoda 1. Dezinstalați cea mai recentă actualizare Windows. </h6> <p> Pe aparatul cu folderul partajat: </p> <p> 1. Faceți clic dreapta pe pictograma „Computerul meu” și selectați <strong> Proprietăți </strong> . <br> 2. Faceți clic pe <strong> Windows Update </strong> . </p> <p><img src=\"images/image_thumb-6-686.png\" alt=\"fix Network Shared Folder is Not Accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. Faceți clic pe <strong> Actualizări instalate </strong> . </p> <p><img src=\"images/image_thumb-7-999.png\" alt=\"fix cannot access shared folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Sortați actualizările după data instalată, făcând clic pe <strong> Instalat pe. </strong></p> <p><img src=\"images/image_thumb-8-158.png\" alt=\"uninstall windows update\" loading=\"lazy\"></p> <p> </p> <p> 5. Evidențiați cea mai recentă actualizare instalată pentru Windows și faceți clic <strong> Dezinstalați. </strong> * </p> <p> * de exemplu. Dacă vă confruntați cu eroarea de partajare la mijlocul lunii ianuarie 2019, continuați și dezinstalați „Actualizarea de securitate pentru Microsoft Windows KB4480970”. </p> <p><img src=\"images/image_thumb-9-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Când instalarea este finalizată, <strong> repornire </strong> calculatorul. <br> 7. După repornire, încercați din nou să accesați folderul partajat de pe computerul client. Apoi aplicați acțiunile sugerate în funcție de caz: </p> <ul> <li><strong> Cazul A: </strong> Dacă problema persistă, procedați la dezinstalarea tuturor celor mai recente actualizări instalate sau continuați <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> metoda 2 </a> de mai jos. </li> <li><strong> Cazul B: </strong> Dacă problema este rezolvată, împiedicați instalarea actualizării eliminate în viitor. Pentru a face asta: </li> </ul> <blockquote><p> 1. Navigați la Windows Update și <strong> Verifică pentru actualizări </strong> . <br> 2. Faceți clic pe <strong> Actualizări importante </strong> . </p></blockquote> <p><img src=\"images/image_thumb-22-393.png\" alt=\"view important updates\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 3. Faceți clic dreapta pe actualizarea problematică și faceți clic <strong> Ascundeți actualizarea </strong> . <br> 4. În cele din urmă faceți clic pe <strong> O.K </strong> și apoi închideți Windows Update. </p></blockquote> <p><img src=\"images/image_thumb-23-795.png\" alt=\"hide update windows 7\" loading=\"lazy\"></p> <h6> Metoda 2. Restabiliți computerul la o stare de lucru anterioară. </h6> <p> Pe aparatul cu folderul partajat: </p> <p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb-632.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați <strong> rstrui </strong> &amp; faceți clic pe <strong> O.K </strong> pentru a lansa Restaurarea sistemului. </p> <p><img src=\"images/rstui-1-300x148-611.png\" alt=\"rstui\" loading=\"lazy\"></p> <p> </p> <p> 3. Faceți clic pe <strong> Următorul </strong> la primul ecran. <br> 4. Alegeți o stare de lucru anterioară (Data / Ora) și faceți clic pe <strong> Următorul </strong> pentru a porni procesul de restaurare. </p> <p><img src=\"images/image_thumb-50-355.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. După restaurarea sistemului, încercați din nou să accesați folderul partajat de pe computerul client. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această problemă. </p>"}