{"title":"REZOLVARE: Conexiunea desktopului la distanță nu s-a putut conecta, deoarece există deja o sesiune de consolă în desfășurare (rezolvată).","content":"<p> Mesajul de eroare de la conexiunea desktop la distanță „Computerul dvs. nu s-a putut conecta la o altă sesiune de consolă de pe computerul la distanță, deoarece aveți deja o sesiune de consolă în desfășurare”, apare deoarece computerul local și cel de la distanță au aceeași adresă IP. Problema apare de obicei atunci când încercați să vă conectați de la distanță la un alt computer printr-o conexiune VPN și ați „primit” aceeași adresă IP de la routerul dvs. local, precum computerul la distanță. Pentru a remedia problema, urmați instrucțiunile de mai jos. </p> <p> </p> <p><img src=\"images/image_thumb-7-243.png\" alt=\"Remote Desktop Connection Could Not Connect because already have a console session in progress\" loading=\"lazy\"></p> <h4> Cum se remediază eroarea RDP: Desktopul la distanță nu s-a putut conecta la o altă sesiune de consolă, deoarece există deja o sesiune de consolă în desfășurare. </h4> <p> Problema din Conexiunea desktop la distanță „Nu s-a putut conecta la o altă sesiune de consolă deoarece aveți deja o sesiune de consolă în desfășurare” apare de obicei atunci când computerul local primește aleator (de la serverul DHCP), aceeași adresă IP ca adresa IP a telecomenzii computer pe care doriți să îl conectați prin RDP. </p> <p> Singura modalitate de remediere, problema de mai sus, este dezactivarea atribuirii automate a adresei IP de pe serverul DHCP, pe computerul local și specificarea manuală a unei adrese IP. Pentru a face asta: </p> <p> 1. <strong> Click dreapta </strong> pe <strong> Reţea </strong> pictogramă <img src=\"images/image_thumb-42-527.png\" alt=\"image\" loading=\"lazy\"> în Bara de activități și faceți clic pe <strong> Deschideți Centrul de rețea și partajare. </strong> * </p> <p><img src=\"images/image_thumb-104-485.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Selectați <strong> Ethernet </strong> (sau Wi-Fi) din stânga, apoi în secțiunea „Setări corelate”, faceți clic pe <strong> Schimbați opțiunile adaptorului </strong> . </p> <p><img src=\"images/image_thumb-43-117.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Dublu click </strong> la adaptorul de rețea activ (Ethernet sau Wi-Fi) și faceți clic pe <strong> Detalii </strong> . </p> <p><img src=\"images/image_thumb-8-177.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Notați detaliile adresei IP în următoarele câmpuri și apoi faceți clic pe <strong> Închide </strong> : </p> <ul> <li> Adresa IPv4 </li> <li> Mască de subrețea IPv4 </li> <li> Gateway implicit IPv4 </li> <li> Server DNS IPv4 </li> </ul> <p><img src=\"images/image_thumb-9-793.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Acum, faceți clic pe <strong> Proprietăți </strong> . </p> <p><img src=\"images/image_thumb-10-628.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Selectați <strong> „Internet Protocol Versiunea 4 (TCP / IPv4) </strong> &#39;și faceți clic <strong> Proprietăți </strong></p> <p><img src=\"images/image_thumb-106-954.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 7. La proprietățile Internet Protocol Versiunea 4 (TCP / IPv4), aplicați următoarele setări: </p> <p> A. Selectați <strong> Utilizați următoarea adresă IP: </strong></p> <blockquote><p> 1. În câmpul Adresă IP, tastați a <strong> adresă IP diferită de adresa IP pe care ați observat-o anterior </strong> . (Schimbați doar ultimul număr la o valoare mai mare). <br> 2. La masca de subrețea depusă, tastați aceeași adresă IP de subrețea ca cea pe care ați observat-o anterior. <br> 3. La Default Gateway, tastați același Gateway implicit ca cel pe care l-ați observat anterior. </p></blockquote> <p> B. Selectați <strong> Utilizați următoarele adrese de server DNS </strong> : </p> <blockquote><p> 1. La serverul DNS preferat, tastați adresa DNS pe care ați observat-o anterior. </p></blockquote> <p> C. Când ați terminat, faceți clic pe <strong> O.K </strong> de două ori și <strong> Închide </strong> pentru a închide proprietățile adaptorului. </p> <blockquote> <p><img src=\"images/image_thumb-11-850.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 8. Acum, încercați să vă conectați la computerul Remote Desktop. Problema ar trebui rezolvată. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}