{"title":"REPARARE: HDMI Fără sunet la televizor sau HDMI Nu se afișează în dispozitivele de redare (rezolvat).","content":"<p> Dacă ați conectat televizorul la laptop folosind un cablu HDMI și nu există ieșire de sunet în timpul redării unui videoclip sau HDMI nu este afișat ca dispozitiv de redare, continuați să citiți acest tutorial. </p> <p> Problemă în detalii: Pe un laptop care rulează Windows 10, dispozitivul de ieșire digitală (HDMI) nu este listat ca dispozitiv de redare și nu există ieșire de sunet atunci când este conectat la televizor cu un cablu HDMI. </p> <p> Problema „Fără ieșire de sunet de la HDMI” din Windows 10 poate apărea din mai multe motive, așa că în acest ghid veți găsi instrucțiuni pas cu pas pentru rezolvarea problemei. </p> <h2> Cum se remediază: nu există ieșiri de sunet de la HDMI și HDMI care nu sunt afișate pe dispozitivele de redare în Windows 10 * </h2> <p> * Sugestii: Înainte de a continua cu pașii de mai jos: </p> <ul> <li><strong> Click dreapta </strong> la <strong> pictogramă sunet </strong><img src=\"images/image_thumb-11-109.png\" alt=\"image\" loading=\"lazy\"> pe bara de activități pentru <strong> Deschideți mixerul de volum </strong> și asigurați-vă că <strong> Dispozitiv de ieșire digitală </strong> nu este dezactivat. </li> <li> Asigurați-vă că cablul HDMI este conectat corect atât la laptop, cât și la televizor. </li> <li> După conectarea cablului HDMI, <strong> repornire </strong> computerul tau. </li> <li> În televizor, setați portul HDMI corect ca dispozitiv de intrare video. </li> <li> Dacă aveți un laptop, închideți capacul sau apăsați butonul de pornire o dată, pentru a vă adormi laptopul. Apoi apăsați din nou butonul de alimentare și verificați din nou sunetul de pe HDMI. </li> <li> Verificați dacă problema persistă, cu un alt cablu HDMI. </li> </ul> <p> </p> <h3> Pasul 1. Setați HDMI ca dispozitiv de redare implicit. </h3> <p> Primul pas pentru a rezolva problemele audio HDMI pe Windows 10 este setarea HDMI ca dispozitiv audio implicit. </p> <p> 1. Navigați la Windows <strong> Panou de control </strong> și deschis <strong> Sunet. </strong></p> <p><img src=\"images/image_thumb-14-686.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Asigurați-vă că <strong> Ieșire digitală </strong> (HDMI) este <strong> Mod implicit </strong> dispozitiv de redare, altfel selectați <strong> Ieșire digitală </strong> dispozitiv și faceți clic pe <strong> Setați implicit </strong> buton. Când ați terminat, redați un videoclip pentru a testa sunetul HDMI și, dacă problema persistă, continuați cu pasul următor. * </p> <p><img src=\"images/image_thumb-43-106.png\" alt=\"FIX: HDMI No Sound Output \" loading=\"lazy\"></p> <p> </p> <p> * Note: Încercați următoarele, după caz: </p> <p> 1. Dacă <strong> Ieșire digitală </strong> dispozitivul este <strong> dezactivat </strong> , faceți clic dreapta pe el și faceți clic pe <strong> Permite </strong> . Apoi evidențiați-l și apăsați <strong> Setați implicit </strong> . </p> <p><img src=\"images/image_thumb-44-233.png\" alt=\"FIX: HDMI Not Listed in Playback devices \" loading=\"lazy\"></p> <p> 2. Dacă dispozitivul de ieșire digitală nu apare ca dispozitiv de redare: </p> <blockquote><p> A. Faceți clic dreapta pe un spațiu gol și asigurați-vă că atât <strong> Afișați dispozitivele dezactivate </strong> si <strong> Afișați dispozitive deconectate </strong> opțiunile sunt selectate (bifate). Dacă una dintre opțiunile de mai sus nu este selectată, atunci faceți clic pe ea pentru a o selecta. </p></blockquote> <p><img src=\"images/image_thumb-45-410.png\" alt=\"Enable HDMI DIgital Output\" loading=\"lazy\"></p> <blockquote><p> b. Apoi faceți clic dreapta pe dispozitivul de ieșire digitală și alegeți <strong> Permite. <br> c. </strong> Când ați terminat, setați ca <strong> Mod implicit </strong> <strong> Ieșire digitală </strong> dispozitiv. </p> </blockquote> <h3><br clear=\"all\"> Pasul 2. Rulați înapoi driverul plăcii de sunet. </h3> <p> În unele cazuri, problema „HDMI fără sunet la televizor” poate apărea după o actualizare automată a driverului. Deci, continuați și derulați driverul audio. </p> <p> 1. Deschideți <strong> Manager de dispozitiv </strong> . Pentru a face asta: </p> <blockquote><p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-781.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. În caseta „Deschidere”, tastați: <strong> devmgmt.msc </strong> &amp; faceți clic <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-5-389.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Extinde </strong> <strong> Controlere de sunet, video și jocuri. <br> 3. Faceți clic dreapta </strong> pe <strong> Dispozitiv audio de înaltă definiție </strong> și selectați <strong> Proprietăți. </strong></p> <p><img src=\"images/image_thumb-17-970.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. În fila Driver, faceți clic pe <strong> Reveniți pe driver </strong> buton. <strong> * </strong></p> <p> * Notă: Dacă butonul Roll Back Driver este inactiv, continuați cu pasul următor. </p> <p><img src=\"images/image_thumb-18-921.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> 5. Selectați un motiv pentru revenirea pachetului driverului și faceți clic <strong> Da. </strong></p> <p><img src=\"images/image_thumb-19-748.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Când retrogradarea driverului este finalizată, <strong> repornire </strong> computerul tau. <br> 5. După repornire, continuați și testați sunetul de pe HDMI. Dacă tot nu auziți sunet pe televizor, continuați cu pasul următor. </p> <h3> Pasul 3. Schimbați driverul plăcii de sunet. </h3> <p> Absența sunetului se datorează adesea driverului greșit al plăcii de sunet. Pentru a remedia această problemă: </p> <p> 1. Deschideți <strong> Manager de dispozitiv. </strong><br> 2. <strong> Extinde </strong> <strong> Controlere de sunet, video și jocuri. <br> </strong> 3. <strong> Click dreapta </strong> la <strong> Realtek High Definition Audio </strong> dispozitiv și selectați <strong> Actualizați driver-ul. <br> </strong></p> <p><img src=\"images/image_thumb-6-937.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Selectați <strong> Răsfoiți computerul pentru drivere. </strong></p> <p><img src=\"images/image_thumb-7-874.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Selectați <strong> Permiteți-mi să aleg dintr-o listă de drivere disponibile pe computer </strong> . </p> <p><img src=\"images/image_thumb-8-498.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. În ecranul următor, selectați <strong> Dispozitiv audio de înaltă definiție </strong> și faceți clic pe <strong> Următorul. </strong></p> <p><img src=\"images/image_thumb-20-756.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/07/image-10.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 8. Când instalarea driverului este finalizată, <strong> repornire </strong> computerul tau. <br> 9. După repornire, continuați și testați sunetul de la boxele laptopului. </p> <h3> Pasul 4. Dezinstalați și reinstalați driverul plăcii de sunet. </h3> <p> 1. Deschideți <strong> Manager de dispozitiv. </strong><br> 2. <strong> Extinde </strong> <strong> Controlere de sunet, video și jocuri. <br> </strong> 3. <strong> Click dreapta </strong> la <strong> Audio de înaltă definiție </strong> dispozitiv și selectați <strong> Dezinstalați dispozitivul. </strong></p> <p><img src=\"images/image_thumb-21-678.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. După dezinstalare, <strong> repornire </strong> computerului dvs. și lăsați Windows să instaleze automat driverele de sunet. Dacă acest lucru nu se întâmplă, navigați la <strong> Setări </strong> &gt; <strong> Actualizare și securitate </strong> și forțați Windows să <strong> Verifică pentru actualizări. </strong></p> <p> </p> <h3> Pasul 5. Dezinstalați și reinstalați adaptorul de afișare. </h3> <p> 1. Deschideți <strong> Manager de dispozitiv. <br> </strong> 2. <strong> Extinde </strong> <strong> Adaptoare de afișaj. <br> </strong> 3. <strong> Click dreapta </strong> pe adaptorul de afișaj instalat și selectați <strong> Dezinstalați dispozitivul. </strong></p> <p><img src=\"images/image_thumb-46-871.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. După dezinstalare, <strong> repornire </strong> computerului dvs. și lăsați Windows să instaleze automat driverele de afișare. Dacă acest lucru nu se întâmplă, dacă încă vă confruntați cu problema, navigați la site-ul de asistență al producătorului laptopului și descărcați cele mai recente drivere de afișare în funcție de modelul laptopului dvs. </p> <p> Asta-i tot oameni buni! Ce metodă a funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}