{"title":"REPARARE: VeraCrypt nu răspunde (Înghețare) pe Demontare în Windows 10 (rezolvat)","content":"<p> Acest ghid conține instrucțiuni pentru rezolvarea următoarei probleme cu VeraCrypt pe un computer bazat pe Windows 10: VeraCrypt nu răspunde și îngheață (se blochează) la demontarea volumului criptat. </p> <p> Problema VeraCrypt Not Responding (Congelare) în detalii: Când încercați să demontați un volum (cu toate fișierele închise din volumul montat), VeraCrypt se blochează și afișează „Nu răspunde”. Când apare această problemă, singura modalitate de a restabili Windows la o stare normală este de a termina procesul VeraCrypt din Task Manager. </p> <p> In conformitate <a href=\"https://www.veracrypt.fr/en/Issues%20and%20Limitations.html\" target=\"_blank\" rel=\"nofollow noopener\"> VeraCrypt </a> problema înghețării este cauzată de un conflict între dialogul de așteptare VeraCrypt afișat în timpul operațiilor de montare / demontare și alte programe software instalate pe aparat (de exemplu, antivirus sau firewall). </p> <h4> Cum se remediază: VeraCrypt nu răspunde la demontare / montare volum. </h4> <p> Această problemă este cauzată de un conflict între dialogul de așteptare VeraCrypt afișat în timpul operațiilor de montare / demontare și alte programe software instalate pe aparat (de exemplu, Outpost Firewall Pro). </p> <p> 1. De la VeraCrypt <strong> Setări </strong> meniu, selectați <strong> Preferințe </strong> . </p> <p><img src=\"images/image_thumb-63-122.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Verifica </strong> <strong> Nu afișați dialogul de mesaj de așteptare atunci când efectuați operații </strong> faceți clic pe opțiune <strong> O.K. </strong></p> <p><img src=\"images/image_thumb-64-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Acum procedați la montarea / demontarea volumelor fără îngheț! </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}