{"title":"REZOLVARE: Problema Wallpaperului din spate în Windows 7 (rezolvată)","content":"<p> Acest tutorial conține instrucțiuni pentru remedierea problemei Wallpaper negru atunci când imaginea de fundal este setată la „Stretch” în sistemul de operare Windows 7. Problema Wallpaper negru poate apărea pe computerele bazate pe Windows 7 după instalarea actualizării 14 ianuarie 2020 — KB4534310. </p> <p><img src=\"images/image_thumb-16-423.png\" alt=\"FIX: Back Wallpaper issue in Windows 7\" loading=\"lazy\"></p> <p> Problema fundalului negru Windows 7 este o eroare cunoscută după instalarea <a href=\"http://www.catalog.update.microsoft.com/Search.aspx?q=KB4534310\" target=\"_blank\" rel=\"nofollow noopener\"> actualizați KB4534310 </a> și ca Microsoft <a href=\"https://support.microsoft.com/en-us/help/4534310/windows-7-update-kb4534310\" target=\"_blank\" rel=\"nofollow noopener\"> spune </a> : „Lucrăm la o rezoluție și vom oferi o actualizare într-o versiune viitoare, care va fi lansată tuturor clienților care rulează Windows 7 și Windows Server 2008 R2 SP1.” </p> <p> Dacă doriți să rezolvați problema „tapetului negru”, până când Microsoft lansează o actualizare pentru a o remedia, urmați instrucțiunile de mai jos. </p> <h4> Cum se remediază problema Wallpaperului negru în Windows 7. </h4> <h6> Metoda 1. Dezinstalați actualizarea KB4534310. </h6> <p> Prima metodă de remediere a problemelor de fundal negru din Windows 7 este eliminarea actualizării KB4534310. * </p> <p> * Notă: De la actualizarea KB4534310, include îmbunătățiri de securitate și remedieri pentru Windows 7, nu este recomandabil să îl dezinstalați. Deci, vă sugerăm să remediați problema urmând instrucțiunile de la <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Metoda-2 </a> de mai jos. </p> <p> Pentru a dezinstala actualizarea KB4534310: </p> <p> 1. Faceți clic dreapta pe <strong> start </strong> meniul <img src=\"images/image_thumb-38-451.png\" alt=\"image\" loading=\"lazy\"> și alegeți <strong> Panou de control </strong> . <br> 2. Setați <strong> Vizualizare după: la pictograme mici </strong> și faceți clic pe <strong> Program și caracteristici. </strong></p> <p><img src=\"images/image_thumb-51-750.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 3. Faceți clic pe <strong> Vizualizați actualizările instalate </strong> pe panoul din stânga. </p> <p> </p> <p><img src=\"images/image_thumb-52-942.png\" alt=\"uninstall updates windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. În caseta de căutare, tastați „ <strong> KB4534310 </strong> &quot;și apăsați Enter. <br> 5. Evidențiați „Actualizare de securitate pentru Microsoft Windows (KB4534310)” și faceți clic pe <strong> Dezinstalați </strong> . </p> <p><img src=\"images/image_thumb-12-776.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Metoda 2. Schimbați poziția imaginii altfel decât „Stretch”. </h6> <p> Problema Wallpaperului negru în Windows 7 apare numai atunci când imaginea de fundal selectată este întinsă. Deci, următoarea metodă pentru a remedia problema, este să setați o altă poziție a imaginii pentru imaginea de fundal. Pentru a face asta: </p> <p> 1. Faceți clic dreapta pe desktop și faceți clic pe <strong> Personalizați </strong> . </p> <p><img src=\"images/image_thumb-17-501.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Faceți clic pe <strong> Fundal de ecran </strong></p> <p><img src=\"images/image_thumb-14-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Acum, aplicați următoarele acțiuni: </p> <p> A. La Locație imagine, selectați <strong> Biblioteca de imagini. </strong><br> b. Selectați imaginea dorită pentru fundal sau orice altă imagine / fotografie personalizată care se potrivește cu rezoluția ecranului. * </p> <blockquote> <p> * Sfat: pentru a afla rezoluția curentă a ecranului, faceți clic dreapta pe Desktop și faceți clic pe <strong> Rezolutia ecranului </strong> . </p> </blockquote> <p> c. La <strong> Poziția imaginii </strong> , selectați orice altă opțiune, cu excepția „ <strong> Întinde </strong> &quot;, cum ar fi„ Umplere ”,„ Potrivire ”,„ Placă ”sau„ Centrare ”. <br> d. Când ați terminat, faceți clic pe Salvare <strong> schimbări </strong> . </p> <p><img src=\"images/image_thumb-15-519.png\" alt=\"image\" loading=\"lazy\"></p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}