{"title":"REPARARE: laptop Dell Inspiron Slow CPU Speed ​​(Rezolvat)","content":"<p> Acest tutorial conține instrucțiuni pentru a remedia problema foarte lentă a vitezei procesorului pe un laptop Dell Inspiron 5558. Recent, un prieten de-al meu și-a adus laptopul Dell în laboratorul meu, deoarece a devenit brusc prea lent. De fapt, laptopul a funcționat rapid în trecut, dar acum este nevoie de mult timp pentru a încărca sistemul de operare (Windows 10) și aplicațiile. </p> <p> După ce am verificat laptopul, și după cum puteți vedea la captura de ecran de mai jos, am constatat că CPU rulează întotdeauna la 0.48GHz în loc de 2.20GHz. Așadar, am început depanarea și în cele din urmă am găsit următoarele două metode pentru a rezolva problema de viteză lentă a procesorului ... </p> <p> (Viteza procesorului a fost redusă cu aproximativ 85-87% pe un laptop Dell) </p> <p><img src=\"images/image_thumb-16-354.png\" alt=\"FIX Dell Laptop Slow CPU Speed\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cum se remediază problema de viteză a procesorului lent pe un laptop Dell. </h4> <h6> Metoda 1. Înlocuiți adaptorul de curent alternativ. </h6> <p> Problema de viteză lentă a procesorului este o problemă cunoscută pe laptopurile Dell, când adaptorul de alimentare CA nu este recunoscut corect de pe computer. În aceste cazuri și chiar dacă adaptorul de alimentare pare să funcționeze bine, următorul mesaj de avertizare este afișat atunci când porniți laptopul &quot;Tipul de adaptor de curent alternativ nu poate fi determinat. Acest lucru va împiedica performanța optimă a sistemului&quot;. </p> <p> Așadar, prima metodă pentru a rezolva problema de performanță lentă de pe laptopul Dell este înlocuirea adaptorului de alimentare cu un nou adaptor de alimentare Dell AC compatibil. </p> <p> </p> <h6> Metoda 2. STOP Controlul procesorului cu ThrottleStop. </h6> <p> Dacă adaptorul CA funcționează bine și laptopul nu se supraîncălzește, * atunci, o altă metodă pentru a remedia problema lentă de performanță a sistemului pe laptopul Dell, este să dezactivați limitarea necunoscută a adaptorului de alimentare, cu <strong><a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"> ThrottleStop </a></strong> utilitate. Pentru a face asta: </p> <p> 1. Descărcați fișierul <a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> ThrottleStop </strong></a> utilitar și extrageți arhiva pe care ați descărcat-o. <br> 2. Din folderul extras, faceți dublu clic pentru a rula aplicația „ThorttleStop.exe”. * <br> 3. <strong> Debifează </strong> <strong> BD PROCHOT </strong> *** bifați caseta de selectare și apoi faceți clic pe <strong> Salvați </strong> . </p> <p> * Note: <br> 1. Pentru a monitoriza temperatura procesorului, puteți utiliza <a href=\"https://www.alcpu.com/CoreTemp/\" target=\"_blank\" rel=\"nofollow noopener\"> CoreTemp </a> program. <br> 2. Dacă primiți eroarea „MFC120U.dll nu a fost găsită” sau „MSVCR120.dll lipsește”, după ce ați rulat ThrottleStop, continuați și instalați <a title=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" href=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Pachete redistribuibile Visual C ++ pentru Visual Studio 2013 </a> . ( <strong> Important: </strong> Dacă dețineți Windows pe 64 de biți, trebuie să instalați atât versiunea pe 64 de biți, cât și versiunea pe 32 de biți a pachetului Visual C ++). <br> 3. BD PROCHOT reprezintă prochot bidirecțional. PROCHOT înseamnă procesor fierbinte, care este semnalul care este activat în cadrul procesorului atunci când ajunge la aproximativ 100C până la 105C, în funcție de numărul modelului. Acest semnal este cel care inițiază limitarea termică, astfel încât procesorul să poată încetini și să nu se încălzească. Dezactivarea PROCHOT va permite procesorului dvs. să ruleze în continuare la viteză maximă. (Sursă: <a href=\"http://forum.notebookreview.com/threads/the-throttlestop-guide.531329/\" target=\"_blank\" rel=\"nofollow noopener\"> Ghidul ThrottleStop </a> ). </p> <p><img src=\"images/image_thumb-20-666.png\" alt=\"FIX Slow CPU Speed with ThrottleStop\" loading=\"lazy\"></p> <p> 4. Închideți ThrottleStop și ați terminat. Acum CPU-ul va rula la viteză maximă, până când reporniți sau opriți laptopul. * </p> <p> * Notă: Trebuie să rulați <strong> ThrottleStop </strong> program de fiecare dată când porniți computerul, dacă doriți să rulați la viteza maximă a procesorului. Pentru a vă face viața mai ușoară, urmați pașii din aceasta <a href=\"https://www.repairwin.com/how-to-start-throttlestop-at-windows-startup/\" target=\"_blank\" rel=\"nofollow noopener\"> ghid </a> pentru a porni automat ThrottleStop la pornirea Windows. </p> <p><img src=\"images/image_thumb-21-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}