{"title":"REPARARE: Instalarea actualizării Windows 10 a eșuat Eroarea 0x800711C7 - 0x2000A (rezolvată)","content":"<p> Acest tutorial conține instrucțiuni pentru remedierea erorii de actualizare Windows 10 0x800711C7 - 0x2000A: „Instalarea a eșuat în faza SAFE_OS cu o eroare în timpul PREPARE_FIRST_BOOT”. </p> <p> </p> <p><img src=\"images/image_thumb-51-797.png\" alt=\"FIX Error 0x800711C7 - 0x2000A installation failed in the SAFE_OS phase during PREPARE_FIRST_BOOT\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Windows 10 Problemă de actualizare 0x800711C7 - 0x2000A în detalii: Când încercați să actualizați Windows 10 la cea mai recentă versiune (construire) instalarea se oprește cu eroare &quot;Nu am putut instala Windows 10 - 0x800711C7 - 0x2000A - Instalarea a eșuat în faza SAFE_OS cu o eroare în timpul PREPARE_FIRST_BOOT &quot;, și apoi revine la versiunea Windows anterioară. </p> <h4> Cum se remediază eroarea de instalare a actualizării Windows 10 v1809 0x800711C7 - 0x2000A </h4> <p> </p> <h6> Metoda 1. Dezactivați Device Guard de la PowerShell. </h6> <p> Eroarea 0x800711C7 - 0x2000A în actualizarea Windows 10, apare în sistemele cu „ <a href=\"https://techcommunity.microsoft.com/t5/iis-support-blog/windows-10-device-guard-and-credential-guard-demystified/ba-p/376419\" target=\"_blank\" rel=\"nofollow noopener\"> Device Guard </a> &quot;activat, Deci, prima metodă pentru a rezolva eroarea 0x800711C7 - 0x2000A în actualizarea Windows 10, este să dezactivați dispozitivul de protecție pe sistemul dvs. </p> <p> 1. Continuați și descărcați <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=53337\" target=\"_blank\" rel=\"nofollow noopener\"> Instrument de pregătire hardware Device Guard și Credential Guard </a> de la Microsoft. <br> 2. Când descărcarea este finalizată extrageți fișierul „dgreadiness” _v3.6.zip. <br> 3. Deschideți folderul extras și din meniul File alegeți Open Windows PowerShell ca administrator. </p> <p><img src=\"images/image_thumb-52-765.png\" alt=\"FIX Error 0x800711C7 - 0x2000A Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. La PowerShell tastați următoarea comandă pentru <strong> permiteți (setați) politica de execuție pentru a rula scripturi </strong> (Presa <strong> A </strong> când i se cere să schimbe politica de execuție). </p> <ul> <li> Set-ExecutionPolicy Nelimitat </li> </ul> <p> 5. Apoi dați această comandă către <strong> dezactivați </strong> <strong> Device Guard </strong> si <strong> Credential Guard </strong> : </p> <ul> <li> . \\ DG_Readiness_Tool_v3.6 -Disable </li> </ul> <p><img src=\"images/image_thumb-53-648.png\" alt=\"Disable Device Guard and Credential Guard Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. După executarea comenzii, <strong> reporniți </strong> calculatorul. <br> 7. Încercați să actualizați Windows 10. * </p> <p> * Notă: După actualizarea Windows 10, urmați aceeași procedură pentru a activa Device Guard și Credential Guard, cu aceste comenzi: </p> <ul> <li> Set-ExecutionPolicy Nelimitat </li> <li> . \\ DG_Readiness_Tool_v3.6 -Activați </li> </ul> <p> </p> <h6> Metoda 2. Dezactivați Hyper-V din linia de comandă. </h6> <p> Următoarea metodă de rezolvare a erorii 0x800711C7 - 0x2000A în actualizarea Windows 10 este dezactivarea hipervizorului la pornirea Windows. </p> <p> 1. Deschideți <strong> promptul de comandă ca administrator </strong> . <br> 2. Tastați următoarea comandă pentru a dezactiva Hyper-V la pornirea Windows. </p> <ul> <li> bcdedit / set hypervisorlaunchtype off </li> </ul> <p><img src=\"images/image_thumb-50-768.png\" alt=\"Disable Hyper-V Command Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Reporniți </strong> computerul dvs. <br> 4. Încercați să instalați actualizarea. * </p> <p> * Notă: După actualizarea Windows 10, dați următoarea comandă pentru a porni automat Hypervisor la pornirea computerului: </p> <ul> <li> bcdedit / set hypervisorlaunchtype auto </li> </ul> <p> </p> <h6> Metoda 3. Dezactivați Secure Boot din setările BIOS-ului. </h6> <p> O altă cauză a erorii de actualizare Windows 10 0x800711C7 - 0x2000A este boot-ul securizat. Deci, continuați și dezactivați Secure Boot din setările BIOS-ului. Pentru a face asta: </p> <p> 1. Porniți sistemul și apăsați imediat tasta corespunzătoare * pentru a intra <strong> CONFIGURAREA BIOS-ULUI. </strong></p> <p> </p> <p> * Notă: De obicei, pentru a intra în BIOS, trebuie să apăsați butonul <strong> DEL </strong> sau <strong> F1 </strong> sau <strong> F2 </strong> sau <strong> F10 </strong> cheie. (depinde de producător) </p> <p> 2. Uită-te la <strong> Securitate </strong> sau la <strong> Opțiuni de pornire, </strong> sau la <strong> Autentificare </strong> setări, * pentru a găsi fișierul <strong> Încărcare sigură </strong> opțiune și <strong> Dezactivează </strong> aceasta <strong> . </strong></p> <p> * Note: <br> 1. Locația setării „Secure Boot” în BIOS depinde de producătorul dispozitivului. <br> 2. Dacă nu găsiți setarea „Secure Boot”, atunci <strong> Dezactivează </strong> <strong> Suport CSM </strong> și apoi <strong> Salvează și ieși </strong> configurarea BIOS-ului. Apoi, intrați din nou în configurarea BIOS-ului pentru a găsi Secure Boot. </p> <p><img src=\"images/image_thumb-23-385.png\" alt=\"Disable Secure Boot\" loading=\"lazy\"></p> <p> 3. <strong> Salvați </strong> setări și <strong> IEȘIRE </strong> Configurarea BIOS-ului. <br> 4. Lăsați Windows să pornească normal și să încerce să instaleze actualizarea. Dacă actualizarea eșuează din nou, reactivați „Secure Boot” și continuați cu următoarea metodă. </p> <p> </p> <h6> Metoda 4. Actualizați Windows 10 utilizând Asistentul de actualizare </h6> <p> 1. Navigați la <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Site de descărcare Windows 10 </a> și faceți clic pe <strong> Actualizează acum </strong> buton. </p> <p><img src=\"images/image_thumb_thumb-680.png\" alt=\"Update Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Salvați fișierul „Windows10Upgrade9252.exe” pe desktop. <br> 3. Faceți dublu clic pe fișierul descărcat pentru a deschide fișierul <strong> Asistent de upgrade Windows </strong> . <br> 4. Faceți clic pe <strong> Actualizează acum </strong> pentru a începe actualizarea. </p> <p><img src=\"images/image_thumb4_thumb-918.png\" alt=\"Windows 10 Update Assistant\" loading=\"lazy\"></p> <p> 5. Lăsați Windows să termine descărcarea și verificarea. <br> 6. Când verificarea ajunge la 100%, <strong> deconectați computerul de la Internet </strong> sau setați-l la „ <strong> Modul avion </strong> &quot;. <br> 7. Așteptați până când Windows vă actualizează sistemul. <br> 8. Când vi se solicită, reporniți sistemul pentru a instala actualizarea. </p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}