{"title":"REPARARE: Microfonul nu a fost detectat sau nu funcționează în Windows 10 (rezolvat)","content":"<p> Acest ghid conține instrucțiuni pentru a remedia problemele „microfonul nu a fost detectat” sau „microfonul nu funcționează”, în Windows 10. Dacă aveți probleme cu microfonul dvs. în Windows 10, atunci acest lucru poate fi cauzat de mai multe motive. Problema „microfonul nu funcționează” este o problemă pentru mulți utilizatori de Windows 10 și apare de obicei după o actualizare Windows. </p> <p> Acest tutorial conține mai multe soluții pentru rezolvarea problemelor de microfon în Windows 10. </p> <h4> Cum se remediază: Microfonul Windows 10 nu funcționează sau nu este detectat. * </h4> <p> * Notă: dacă aveți probleme cu microfonul, într-o anumită aplicație, încercați următoarele: </p> <blockquote><p> 1. Asigurați-vă că aplicației respective i se permite să utilizeze microfonul, utilizând instrucțiunile din metoda-1 de mai jos. <br> 2. Asigurați-vă că microfonul este selectat ca dispozitiv de intrare implicit în setările aplicației. (de exemplu, în Skype, accesați <strong> Setări </strong> și asigurați-vă că microfonul sau setul cu cască este selectat). <br> 3. Închideți orice altă aplicație care vă poate utiliza microfonul. <br> 4. Reporniți computerul și testați din nou MIC-ul. </p></blockquote> <h6> Soluție 1. Permiteți aplicațiilor să vă acceseze microfonul. </h6> <p> Prima metodă, pentru a rezolva problemele cu microfonul dvs. în Windows 10, este să vă asigurați că toate aplicațiile au acces la microfonul dvs. Pentru a face asta: </p> <p> 1.. Din meniul Start <img src=\"images/image_thumb2_thumb_thumb-856.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clic <strong> Setări </strong><img src=\"images/image_thumb-66-804.png\" alt=\"image\" loading=\"lazy\"> și apoi deschideți <strong> Confidențialitate </strong> . <br> 2. Selectați <strong> Microfon </strong> pe panoul din stânga și apoi <strong> Porniți </strong> <strong> Permiteți aplicațiilor să vă acceseze microfonul. </strong></p> <p><img src=\"images/image_thumb-34-268.png\" alt=\"How to FIX: Windows 10 Microphone Not Detected or Not Working\" loading=\"lazy\"></p> <p> 3. Apoi derulați în jos și asigurați-vă că aplicația pe care doriți să o utilizați, poate să o acceseze. * </p> <p> * Sugestie: pentru confidențialitatea dvs., dezactivați accesul la microfon la orice aplicație pe care nu doriți să o utilizeze microfonul. </p> <p><img src=\"images/image_thumb-35-517.png\" alt=\" FIX Windows 10 Microphone Not Working\" loading=\"lazy\"></p> <p> 4. Când ați terminat, testați microfonul. </p> <h6> Soluție 2. Verificați dacă microfonul dvs. este dispozitivul de intrare implicit (dispozitiv de înregistrare). </h6> <p> 1.. Din meniul Start <img src=\"images/image_thumb2_thumb_thumb-930.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clic <strong> Setări </strong><img src=\"images/image_thumb-66-142.png\" alt=\"image\" loading=\"lazy\"> și apoi deschideți <strong> Sistem </strong> . <br> 2. Faceți clic pe <strong> Sunet </strong> pe panoul din stânga, apoi vorbiți pentru a vă testa microfonul. Dacă microfonul funcționează, ar trebui să vedeți bara glisantă mișcându-se mai jos. Dacă nu, faceți clic pe <strong> Gestionați dispozitivele de sunet. </strong></p> <p><img src=\"images/image_thumb-36-254.png\" alt=\"Test Microphone Windows 10\" loading=\"lazy\"></p> <p> 3. La „Gestionați opțiunile dispozitivelor de sunet, asigurați-vă că microfonul dvs. este listat în„ Dispozitive de intrare ”ca dispozitiv de intrare implicit și <strong> Activat </strong> . Dacă nu, faceți clic pe microfon și faceți clic pe <strong> Permite. </strong></p> <p><img src=\"images/image_thumb-37-753.png\" alt=\"Enable Microphone Windows 10\" loading=\"lazy\"></p> <h6> Soluție 3. Verificați setările microfonului din panoul de control. </h6> <p> 1. Navigați la Windows <strong> Panou de control </strong> și deschis <strong> Sunet. </strong></p> <p><img src=\"images/image_thumb-14-511.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. La <strong> Înregistrare </strong> , selectați microfonul și faceți clic pe <strong> Proprietăți. </strong></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"Microphone Properties\" loading=\"lazy\"></p> <p> 3. La <strong> Nivel </strong> filă, <strong> trage </strong> glisorul către <strong> dreapta </strong> , pentru a crește volumul microfonului și pentru a vă asigura că microfonul nu este activat (în cazul în care microfonul este dezactivat, pictograma volumului acestuia <img src=\"images/image_thumb-39-434.png\" alt=\"image\" loading=\"lazy\"> , va fi afișat cu un simbol roșu <img src=\"images/image_thumb-40-819.png\" alt=\"image\" loading=\"lazy\"> ). Când ați terminat, faceți clic <strong> O.K </strong> și <strong> O.K </strong> pentru a închide proprietățile sunetului. </p> <p><img src=\"images/image_thumb-41-896.png\" alt=\"Microphone Levels\" loading=\"lazy\"></p> <h6> Soluția 4. Schimbați driverul plăcii de sunet. </h6> <p> Metoda finală pentru rezolvarea problemelor de microfon în Windows 10 este schimbarea driverului de sunet, mai ales dacă aveți un dispozitiv Realtek Audio. Pentru a face asta: </p> <p> 1. Deschideți <strong> Manager de dispozitiv </strong> . Pentru a face asta: </p> <blockquote><p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-918.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. În caseta „Deschidere”, tastați: <strong> devmgmt.msc </strong> &amp; faceți clic <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-5-732.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Extinde </strong> <strong> Controlere de sunet, video și jocuri. </strong></p> <p> 3. <strong> Click dreapta </strong> pe <strong> Realtek High Definition Audio </strong> dispozitiv și selectați <strong> Actualizați driver-ul. <br> </strong></p> <p><img src=\"images/image_thumb-6-629.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Selectați <strong> Răsfoiți computerul pentru drivere. </strong></p> <p><img src=\"images/image_thumb-7-637.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Selectați <strong> Permiteți-mi să aleg dintr-o listă de drivere disponibile pe computer </strong> . </p> <p><img src=\"images/image_thumb-8-118.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. În ecranul următor, selectați <strong> Dispozitiv audio de înaltă definiție </strong> și faceți clic pe <strong> Următorul. </strong></p> <p><img src=\"images/image_thumb-20-989.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p> 8. În fereastra „Actualizare avertisment driver”, faceți clic pe „Da” pentru a instala noul driver. <br> 9. Când se finalizează instalarea driverului, <strong> repornire </strong> computerul tau. <br> 10. După repornire, continuați și testați microfonul. </p> <h6></h6> <h6> Soluția 5. Dezinstalați și reinstalați driverele plăcii de sunet. </h6> <p> Soluția finală pentru a remedia problema microfonului care nu funcționează, în Windows 10 este dezinstalarea completă și reinstalarea driverelor plăcii de sunet. </p> <p> 1. Navigați la <strong> Panou de control </strong> &gt; <strong> Program și caracteristici </strong> și <strong> dezinstalați </strong> orice software legat de placa dvs. de sunet. <br> 2. Deschideți <strong> Manager de dispozitiv </strong> și <strong> extinde </strong> <strong> Controlere de sunet, video și jocuri. <br> </strong> 3. <strong> Click dreapta </strong> pe instalat <strong> Dispozitiv audio </strong> și faceți clic pe <strong> Dezinstalați dispozitivul. </strong></p> <p><img src=\"images/image_thumb-42-701.png\" alt=\"Uninstall Sound Card Device\" loading=\"lazy\"></p> <p> </p> <p> 4. Când ați terminat, navigați la site-ul de asistență al producătorului computerului sau laptopului și descărcați și instalați cel mai recent driver pentru placa de sunet. <br> 5. După instalare, <strong> repornire </strong> computerul și verificați dacă microfonul funcționează. </p> <p><strong> Ajutor suplimentar: </strong> Dacă după aplicarea soluțiilor de mai sus, microfonul dvs. nu funcționează, probabil că este deteriorat. Pentru a vă asigura, dacă dețineți un laptop conectați un microfon extern sau utilizați un alt microfon dacă dețineți un desktop. </p> <p> Asta-i tot oameni buni! Ce metodă a funcționat pentru tine? Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}