{"title":"REZOLVARE: Thunderbird nu răspunde sau se blochează. (Rezolvat)","content":"<p> Dacă Thunderbird nu răspunde, continuați mai jos pentru a rezolva problema. Thunderbird este un popular client de e-mail open-source disponibil pentru toate platformele. Dar, uneori, Thunderbird nu mai răspunde deloc sau îngheață timp de 4-5 minute înainte ca acesta să fie din nou utilizabil. </p> <p><img src=\"images/image_thumb-18-762.png\" alt=\"Thunderbird is not responding or freezing - fix\" loading=\"lazy\"></p> <p> Este posibil ca Thunderbird să nu funcționeze, din următoarele motive: </p> <ul> <li> Programul antivirus poate împiedica Thunderbird să se conecteze la Internet. </li> <li> Funcția de căutare Windows din mesajele Thunderbird poate cauza înghețarea Thunderbird. </li> <li> O setare problematică Thunderbird sau un supliment. </li> <li> Fișierele de indexare Thunderbird (fișiere MSF) pot fi corupte. </li> </ul> <p> Deoarece Thunderbird poate să nu răspundă din mai multe motive, în acest tutorial vă vom arăta toate modalitățile disponibile pentru a rezolva problema. </p> <h2> Cum se remediază: Thunderbird nu răspunde sau se blochează în Windows 10. </h2> <h3> Metoda 1. Scanați computerul pentru viruși. </h3> <p><strong> Important: </strong> Multe viruși sau programe rău intenționate pot cauza probleme cu actualizarea Windows. Deci, înainte de a continua cu pașii de depanare de mai jos, utilizați acest lucru <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Ghid de scanare și eliminare a programelor malware </a> pentru a verifica și a elimina viruși sau / și programe malware care pot rula pe computerul dvs. </p> <h3></h3> <h3> Metoda 2. Dezactivați Căutarea Windows în mesajele Thunderbird. </h3> <p> 1. Din meniul Thunderbird, selectați <strong> Instrumente </strong> &gt; <strong> Opțiuni </strong> . </p> <p> 2. În Setări generale, <strong> debifează </strong> optiunea <strong> Permiteți Căutarea Windows să caute mesaje </strong> . </p> <p><img src=\"images/image_thumb-24-636.png\" alt=\"Disable Windows Search in Thunderbird Messages\" loading=\"lazy\"></p> <p> 3. <strong> Repornire </strong> Thunderbird. </p> <p> </p> <h3> Metoda 3. Adăugați Thunderbird la excepțiile antivirus. </h3> <p> Dacă utilizați un antivirus terță parte pe computerul dvs., continuați și adăugați programul executabil „thunderbird.exe” la excepțiile programului dvs. Antivirus. </p> <p> De exemplu, dacă dețineți antivirusul AVG: </p> <p> 1. Accesați <strong> Meniul </strong> &gt; <strong> Setări </strong> . <br> 2. În <strong> General </strong> fila, faceți clic pe <strong> Excepții </strong> &gt; <strong> Adăugați o excepție </strong> . <br> 3. Faceți clic pe <strong> Naviga </strong> și localizați butonul <strong> thunderbird.exe </strong> fișier, (sau <strong> copie </strong> &amp; <strong> lipiți linia de mai jos) </strong> și apoi faceți clic pe <strong> Adăugați o excepție. * </strong></p> <ul> <li> C: \\ Program Files (x86) \\ Mozilla Thunderbird \\ thunderbird.exe </li> </ul> <p><strong> * Notă: </strong> Dacă după adăugarea fișierului „thunderbird.exe pe excepțiile AV, problema persistă, <strong> adăuga </strong> de asemenea <strong> la excepțiile AV </strong> <strong> folder în care a fost instalat Thunderbird </strong> si <strong> Dosarul profilului Thunderbird </strong> . </p> <p><img src=\"images/image_thumb-19-734.png\" alt=\"add thunderbird to antivirus exceptions\" loading=\"lazy\"></p> <p> </p> <p> </p> <h3> Metoda 4. Dezactivare - Dezinstalați programele antivirus. </h3> <p> Deoarece problema „nu răspunde” în programul Thunderbird, de obicei se datorează programului Antivirus, vă sugerăm <strong> dezactivați </strong> sau la <strong> dezinstalați complet </strong> programul dvs. antivirus și pentru a vedea dacă problema persistă. </p> <h3></h3> <p> </p> <h3> Metoda 5. Porniți Thunderbird în modul sigur. </h3> <p> Thunderbird poate îngheța și nu răspunde, dacă o extensie instalată cauzează probleme sau este deteriorată. Pentru a depana problemele cu suplimentele Thunderbird, procedați după cum urmează. </p> <p> 1. Apăsați și <strong> țineți apăsat </strong> <strong> SCHIMB </strong> tasta de pe tastatură și deschideți <strong> Thunderbird. </strong></p> <p> 2. În fereastra următoare faceți clic pe <strong> Continuați în modul sigur. </strong></p> <p><img src=\"images/image_thumb-21-196.png\" alt=\"Strat Thunderbird in Safe Mode\" loading=\"lazy\"></p> <p> </p> <p> 3. Dacă Thunderbird nu îngheață în modul sigur, atunci un supliment instalat poate cauza problema. În acest caz: </p> <ol> <li> Închide Thunderbird. </li> <li> Apăsați tasta SHIFT și lansați din nou Thunderbird. </li> <li> În fereastra următoare, <strong> Verifica </strong> <strong> Dezactivați toate suplimentele </strong> și faceți clic pe <strong> Efectuați modificări și reporniți </strong> . </li> </ol> <p><img src=\"images/image_thumb-22-149.png\" alt=\"Disable Thunderbird add-ons\" loading=\"lazy\"></p> <p> 4. Dacă Thunderbird nu răspunde din nou, continuați cu următoarea metodă. </p> <h3> Metoda 5. Resetați bara de instrumente și comenzile Thunderbird. </h3> <p> 1. Apăsați și <strong> țineți apăsat </strong> <strong> SCHIMB </strong> tasta de pe tastatură și deschideți <strong> Thunderbird. </strong></p> <p> 2. În fereastra următoare alegeți <strong> Resetați bare de instrumente și controale </strong> și faceți clic pe <strong> Efectuați modificări și reporniți. </strong></p> <p><img src=\"images/image_thumb-23-344.png\" alt=\"Reset Thunderbird Toolbars\" loading=\"lazy\"></p> <p> </p> <h3> Metoda 6. Ștergeți fișierele Index (.msf) ale Thunderbird. </h3> <p> În unele cazuri, Thunderbird îngheață, deoarece fișierele de indexare (alias fișiere MSF) devin corupte. Deci, metoda finală pentru a rezolva problema „Thunderbird care nu răspunde” este ștergerea fișierelor .MSF. * </p> <p><strong> * IMPORTANT: </strong> Deși fișierele MSF (Mail Summary Files) pot fi șterse în siguranță deoarece conțin doar antetele e-mailului și starea e-mailului (citite, necitite etc.) și nu e-mailul real, este recomandat să <a href=\"https://www.repairwin.com/how-to-transfer-thunderbird-email-and-settings-to-a-new-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> faceți backup dosarului profilului Thunderbird </a> înainte de a șterge fișierele MSF. </p> <p><strong> Pasul 1. Închideți Thunderbird. </strong></p> <p><strong> Pasul 2. Activați vizualizarea fișierelor ascunse. </strong></p> <p> 1. Navigați la Windows <strong> Panou de control </strong> și deschideți <strong> Opțiuni folder </strong> . (sau <strong> Opțiuni Explorer pentru fișiere </strong> în Windows 10). </p> <p> 2. Selectați <strong> Vedere </strong> filă și sub fila <strong> „Fișiere și foldere ascunse” </strong> secțiune, <strong> Verifica </strong> <strong> Afișați fișierele, folderele și unitățile ascunse </strong> opțiune și faceți clic pe <strong> O.K. </strong></p> <p><img src=\"images/image_thumb-34-553.png\" alt=\"Show Hidden files\" loading=\"lazy\"></p> <p> </p> <p><strong> Pasul 3. Ștergeți fișierele .MSF </strong></p> <p> 1. Navigați la folderul de profil Thunderbird de pe disc și deschideți <strong> Poștă </strong> dosar: * </p> <ul> <li> C: \\ Users \\ username \\ AppData \\ Roaming \\ Thunderbird \\ Profiles \\ ProfileName <strong> .default \\ Mail </strong></li> </ul> <p> * În cazul în care numele de utilizator este numele dvs. de utilizator Windows și ProfileName este numele profilului Mozilla în care sunt stocate e-mailurile. </p> <p> 2. Acum explorează toate folderele conținute în interiorul <strong> Poștă </strong> folder, pentru a vedea care dintre ele conține fișierele .msf. (în instalațiile implicite, cu un singur cont de e-mail, fișierele MSF sunt localizate în folderul „Foldere locale”. </p> <p> 3. <strong> Șterge </strong> toate <strong> .msf </strong> fișiere sau -mai bine- <strong> mișcare </strong> le într-un folder (nou) de pe desktop. </p> <p><img src=\"images/image_thumb-25-355.png\" alt=\"Delete Thunderbird MSF files\" loading=\"lazy\"></p> <p> 4. Când ați terminat, deschideți Thunderbird și așteptați ca Thunderbird să recreeze fișierele de indexare (fișiere MSF). </p> <p> Asta-i tot oameni buni! Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}