{"title":"REPARAȚI: Chrome Deschideți întotdeauna opțiunile Răsfoiți ca invitat - Comutați persoană la pornire.","content":"<p> Tutorialul conține instrucțiuni despre cum să împiedicați Chrome să afișeze fereastra „Schimbă persoana - Răsfoiește ca invitat” la pornire. Problemă în detalii: Pe un computer bazat pe Windows, browserul Google Chrome deschide întotdeauna opțiunile „Răsfoiți ca invitat” și „Adăugați o persoană” la pornire, iar utilizatorul trebuie să își selecteze întotdeauna profilul pentru a utiliza browserul Chrome. </p> <p><img src=\"images/image_thumb-26-805.png\" alt=\"FIX Remove Chrome Browse as Guest\" loading=\"lazy\"></p> <p> </p> <h4> Cum să eliminați fereastra de opțiuni „Browser ca invitat - Adăugați o persoană” la pornirea Chrome. </h4> <h6> Metoda 1. Verificați dacă Chrome este setat să pornească întotdeauna în modul Navigare pentru oaspeți. </h6> <p> Una dintre cele mai utile caracteristici ale browserului Google Chrome este de a crea mai multe profiluri de utilizator, mai ales dacă partajați computerul cu alții sau dacă doriți să vă separați marcajele și setările între mai multe conturi. În acest caz, puteți porni oricând Chrome cu fereastra „Comutare persoană”, adăugând unul dintre următoarele comutatoare (intrări de text) în comanda rapidă Chrome: </p> <ul> <li><strong> –Profile-directory = &quot;Profil de oaspete&quot; </strong></li> <li><strong> –Bwsi </strong></li> </ul> <p> </p> <p> Deci, mai întâi de toate, verificați dacă Chrome este setat să deschidă întotdeauna fereastra „Comutare persoană / Răsfoiți ca invitat”. Pentru a face asta: </p> <p> 1. Închideți Google Chrome. <br> 2. Faceți clic dreapta pe Comanda rapidă Chrome de pe desktop și selectați <strong> Proprietăți </strong> . <br> 3. La <strong> Comandă rapidă </strong> filă, uitați-vă la <strong> Ţintă </strong> casetă text și (dacă există) <strong> elimina </strong> intrările de text de mai sus la sfârșit și apoi faceți clic pe <strong> O.K </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-27-916.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Lansați Chrome și în fereastra „Schimbă persoana”, dă clic pe pictograma / imaginea profilului („Tu”). <br> 5. <strong> Repornire </strong> Crom. </p> <p> </p> <h6> Metoda 2. Creați un nou profil Google Chrome curat. </h6> <p> În mod implicit, Chrome stochează toate setările profilului (marcaje, parole, extensii etc.) în folderul „Date utilizator” la următoarea locație de pe computer: </p> <ul> <li><strong> C: \\ Users \\% Username% \\ AppData \\ Local \\ Google \\ Chrome \\ User Data </strong></li> </ul> <p> Dacă, dintr-un anumit motiv, folderul Profil Chrome devine corupt sau modificat necorespunzător de malware, atunci cea mai bună opțiune pe care o aveți este să forțați Chrome să recreeze un nou folder de profil Chrome (gol *). Pentru a face asta: </p> <p><strong> * Atenție: </strong> Rețineți că, ștergând dosarul de stocare al profilului Chrome, ștergeți toate datele stocate (Marcaje, Setări, Extensii, Istoric etc.). Deci, înainte de a vă șterge profilul Chrome, luați un <a href=\"https://www.repairwin.com/backup-restore-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> backupul marcajelor Chrome </a> în cazul în care doriți să reinstalați Chrome din nou. </p> <h5> Pasul 1: activați vizualizarea fișierelor și folderelor ascunse. </h5> <p> 1. Deschideți <strong> Opțiuni folder </strong> . <br> 2. La <strong> Vedere </strong> filă, <strong> Verifica </strong> <strong> Afișați fișierele, folderele și unitățile ascunse </strong> bifați și faceți clic pe <strong> O.K. </strong></p> <p><img src=\"images/image_thumb-6-189.png\" alt=\"enable hidden files folders\" loading=\"lazy\"></p> <h6></h6> <h5> Pasul 2. Forțează Chrome să creeze un folder de profil nou (curat). </h5> <p> 1. <strong> Închide </strong> Google Chrome. <br> 2. <strong> Deschis </strong> Windows Explorer și navigați la această locație: </p> <ul> <li><strong> C: \\ Users \\% USERNAME% \\ AppData \\ Local \\ Google \\ Chrome \\ </strong></li> </ul> <p> * Where% USERNAME% = Numele dvs. de utilizator. (de exemplu, dacă numele dvs. de utilizator este „Admin”, atunci trebuie să navigați la această cale: „C: \\ Users \\ Admin \\ AppData \\ Local \\ Google \\ Chrome”) </p> <p> 3. <strong> Redenumiți </strong> dosarul „Date utilizator” la „Date utilizator.BAK”. </p> <p><img src=\"images/image_thumb-28-373.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Acum deschideți Google Chrome. (În timpul pornirii, Chrome va crea automat un nou folder „Date utilizator” curat pentru a stoca marcajele și setările). </p> <p> </p> <h6> Metode suplimentare pentru rezolvarea problemelor Chrome. </h6> <p><strong> 1. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Verificați computerul pentru viruși, programe malware etc. </a></p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Dezinstalați complet și reinstalați Chrome. </a></p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}