{"title":"REZOLVARE: laptopul Lenovo este blocat pe ecranul LOGO. (Rezolvat)","content":"<p> Dacă laptopul Lenovo s-a blocat pe ecranul siglei, continuați să citiți. Acest tutorial conține instrucțiuni pas cu pas pentru a remedia următoarea problemă de pe laptopurile Lenovo: După pornire, laptopul nu pornește și se blochează pe ecranul de pornire logo Lenovo. (Problema persistă chiar și atunci când încercați să porniți de pe un dispozitiv de pornire USB). </p> <p><img src=\"images/image_thumb-17-276.png\" alt=\"FIX: Lenovo laptop is stuck at LOGO screen.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cum se remediază: Laptop blocat pe ecranul LENOVO LOGO. * </h4> <p> * Important: Înainte de depanarea unui computer, deconectați toate dispozitivele periferice pentru a vă asigura că problema nu se datorează unui dispozitiv conectat. </p> <p> </p> <h6> Pasul 1. Resetați BIOS-ul la setările implicite. </h6> <p> Primul pas pentru a rezolva înghețarea laptopului la sigla Lenovo este să resetați BIOS-ul la setările implicite. Pentru a face asta: </p> <p> 1. <strong> Opriți </strong> laptopul apăsând constant butonul de alimentare timp de 5-7 secunde. <br> 2. Acum urmați instrucțiunile de mai jos în funcție de modelul dvs., pentru a intra în BIOS: </p> <ul> <li> Dacă sistemul dvs. este <strong> ThinkPad </strong> , apăsați butonul de alimentare și apoi apăsați imediat (Fn +) F2 sau tasta (Fn +) F1 rapid și repetat. </li> <li> Dacă sistemul dvs. este <strong> ideapad </strong> laptop, localizați și <strong> presa </strong> <a href=\"https://support.lenovo.com/us/en/solutions/HT104038\" target=\"_blank\" rel=\"nofollow noopener\"> NOVO </a> , care este localizat în mod obișnuit lângă butonul de pornire, apoi selectați <strong> Accesați meniul BIOS </strong> . </li> </ul> <p> 3. La <strong> Ieșire </strong> selectați fila <strong> Încarcă setările implicite </strong> sau „Încărcați setările optimizate”. <br> 4. <strong> Salvați și ieșiți din BIOS </strong> setări și vedeți dacă puteți porni pe Windows. <br> 5. Dacă laptopul se blochează în continuare pe ecranul logo-ului Lenovo, continuați cu pasul următor. </p> <p> </p> <h6> Pasul 2. Dezactivați motorul de service Lenovo. </h6> <p> În unele laptopuri (și desktop-uri) Lenovo, sistemul se blochează la „Lenovo Logo” în timpul pornirii, când „Lenovo Service Engine” este activat. Pentru a dezactiva serviciul: </p> <p> 1. Intrați în meniul BIOS. <br> 2. La <strong> Securitate </strong> , evidențiați și dezactivați „Lenovo Service Engine”. </p> <p><img src=\"images/image_thumb-19-834.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Salvează și ieși </strong> din meniul BIOS. <br> 4. În cazul în care laptopul a rămas în continuare lipit de ecranul de pornire logo Lenovo, continuați cu pasul următor. </p> <p> </p> <h6> Pasul 3: Efectuați o resetare a alimentării. </h6> <p> Următoarea metodă pentru a rezolva problema „Lenovo Logo blocat” este să efectuați o resetare a alimentării. Pentru a face asta: </p> <p> 1. <strong> Deconectat </strong> toate perifericele conectate. <br> 2. <strong> Elimina </strong> <strong> Adaptor de curent alternativ </strong> . <br> 3. <strong> Elimina </strong> <strong> Baterie </strong> . * </p> <p> * Notă: Dacă nu puteți scoate bateria, lăsați laptopul deschis până când bateria este descărcată. </p> <p> 4. <strong> presa </strong> și <strong> țineți apăsat </strong> <strong> Putere </strong> pentru cel puțin 50-60 de secunde și apoi eliberați butonul de pornire. <br> 5. Conectați numai adaptorul de curent alternativ și porniți laptopul. <br> 6. Dacă Windows pornește normal, opriți laptopul și reconectați bateria și perifericele. </p> <h6> Pasul 4. Scoateți bateria CMOS. </h6> <p> 1. <strong> Elimina </strong> <strong> Baterie </strong> si <strong> Adaptor de curent alternativ </strong> . <br> 2. Întoarceți laptopul cu capul în jos și <strong> elimina </strong> <strong> coperta din spate </strong> . * </p> <p> * Notă: Modul de îndepărtare a capacului din spate diferă în funcție de modelul laptopului. Deci, efectuați o căutare pe Google despre cum să dezasamblați propriul model de laptop Lenovo. </p> <p> 3. Localizați și <strong> elimina </strong> <strong> Baterie CMOS </strong> . * </p> <p> * Notă: Bateria CMOS are forma unui cerc și o puteți scoate scoțând-o ușor cu o șurubelniță mică, cu cap plat. </p> <p> 4. <strong> presa </strong> și <strong> țineți apăsat </strong> <strong> Putere </strong> butonul timp de cel puțin 50-60 de secunde și apoi eliberați-l. </p> <p> 5. Conectați mai întâi adaptorul de ca și apoi reintroduceți bateria CMOS. <br> 5. Porniți laptopul. * </p> <p> * Notă: Dacă problema persistă, scoateți și lăsați bateria CMOS deconectată cel puțin 30 de minute. Apoi, puneți bateria CMOS înapoi, conectați adaptorul de curent alternativ și porniți laptopul. </p> <p> </p> <h6> Pasul 5. Scoateți unitatea DVD. * </h6> <p><strong> * Important: </strong> Opriți computerul și scoateți adaptorul de alimentare, înainte de a adăuga sau scoate piese. </p> <p> Dacă dețineți un laptop cu o unitate DVD, scoateți-l și porniți din nou laptopul. (Sună ciudat, dar în unele cazuri funcționează.) </p> <p> </p> <h6> Pasul 6. Scoateți și puneți din nou RAM și hard disk. </h6> <p> Când un computer (desktop sau laptop) îngheață la ecranul LOGO (POST), de obicei înseamnă o problemă cu hard diskul (HDD) sau cu memoria (RAM). Deci, procedați după cum urmează: </p> <p><strong> * Important: </strong> Opriți computerul și scoateți adaptorul de alimentare, înainte de a adăuga sau a elimina părțile acestuia. </p> <p> 1. Scoateți și puneți din nou modulele RAM. <br> 2. Porniți laptopul și vedeți dacă problema persistă. Dacă da, atunci ... <br> 3. Opriți laptopul și scoateți (deconectați) unitatea de disc (HDD). <br> 4. După scoaterea HDD-ului, porniți din nou laptopul. <br> 5. Dacă HDD-ul este cauza problemei, atunci ecranul de pornire Lenovo LOGO va dispărea și veți primi un mesaj care spune „Nu a fost găsit niciun dispozitiv bootabil” sau ceva de genul acesta. Dacă se întâmplă acest lucru: * </p> <blockquote><p> A. Opriți laptopul. <br> b. Curățați contactele de pe hard disk și de pe mufa HDD cu un spray de curățare a contactelor. <br> c. Reconectați hard diskul și continuați să citiți mai jos (6). </p></blockquote> <p> * Notă: dacă acest lucru nu se întâmplă, aceasta indică o problemă BIOS sau o problemă a plăcii de bază, care poate fi reparată doar de un tehnician specializat în calculatoare. </p> <p> 6. Porniți laptopul și vedeți dacă problema s-a rezolvat. Dacă nu, continuați cu copierea de rezervă a fișierelor și apoi efectuați o instalare curată a Windows, urmând pașii de mai jos: </p> <blockquote><p> A. Scoateți și conectați unitatea de disc la alt computer funcțional (de exemplu, utilizând un adaptor USB la SATA). <br> b. Dacă puteți citi conținutul unității, continuați și <strong> faceți backup fișierelor </strong> . * </p> <p> * Notă: Dacă hard diskul nu este recunoscut de pe computerul secundar, atunci HDD-ul este defect și trebuie să îl înlocuiți. </p> <p> c. După ce copiați fișierele, continuați și <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> diagnosticați hard diskul pentru probleme </a> , și conform rezultatelor, înlocuiți HDD-ul (dacă este defect) sau (dacă este OK) continuați și <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> ștergeți toate partițiile de pe HDD </a> . </p></blockquote> <p> 7. După curățarea partițiilor, puneți HDD-ul pe laptop și treceți la <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> instalați Windows curat </a> . </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}