{"title":"REPARARE: Eroare Outlook Express 0x800c0133 din cauza limitei de dimensiune de 2 GB în fișierul DBX (rezolvat)","content":"<p> Acest tutorial conține instrucțiuni pentru remedierea erorii Outlook Express 0x800c0133 din cauza limitei de dimensiune de 2 GB. Eroarea 0x800c0133 în OE, apare deoarece unul din folderele Outlook depășește limita de 2 GB ca dimensiune. </p> <p> Descrierea problemei limită de dimensiune .DBX 2GB în Outlook Express. <br> Când unul dintre principalele foldere Outlook Express (de ex. „Mesaje primite” sau „Trimise”) depășește dimensiunea de 2 GB, OE returnează eroarea 0x800c0133 în timpul operației Trimitere / Primire și uneori folderul OE corespunzător devine gol (Corupt). * De exemplu, dacă folderul „Mesaje primite” (Inbox.dbx) depășește dimensiunea de 2 GB, atunci OE nu poate primi noile e-mailuri și afișează eroarea 0x800c0133. </p> <p> * Notă: dacă unul dintre folderele OE este gol, atunci fișierul DBX asociat este corupt. În acest caz, încercați să vă recuperați e-mailurile din folderul OE deteriorat urmând instrucțiunile din acest articol: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se recuperează fișierul Outlook Express DBX GRATUIT </a> . </p> <h4> Cum se remediază problema Outlook Express 2GB Limit (Trimiteți / primiți eroare 0x800c0133). </h4> <h6> Pasul 1. Activați vizualizarea fișierelor ascunse. </h6> <p> 1. Deschideți Windows Explorer. <br> 2. Din <strong> Instrumente </strong> meniu alege <strong> Opțiuni folder </strong> . <br> 3. În fila Vizualizare, faceți clic pe <strong> Afișați fișierele și folderele ascunse </strong> și faceți clic pe <strong> O.K. </strong></p> <p><img src=\"images/image_thumb1_thumb-210.png\" alt=\"image_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Pasul 2. Găsiți fișierul Outlook Express 2GB DBX pe disc. </h6> <p> 1. Deschideți folderul magazinului Outlook Express. De obicei, acest folder se află la următoarea cale pe disc: </p> <ul> <li> C: \\ Documents and Settings \\\\ Local Settings \\ Application Data \\ Identities \\ {} \\ Microsoft \\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> de exemplu. „C: \\ Documents and Settings \\ Admin \\ Local Settings \\ Application Data \\ Identities \\ {D8F3C56D-965E-41AE-8A23-A58460ABAE00} \\ Microsoft \\ <strong> Outlook Express </strong> ” </p></blockquote> <p> 3. Din Explorator <strong> Vedere </strong> meniu alege <strong> Detalii </strong> . <br> 4. Găsiți ce fișier DBX depășește limita de stocare de 2 GB. * </p> <p> * În acest exemplu, fișierul „Inbox.dbx” depășește dimensiunea de 2 GB. </p> <p><img src=\"images/image_thumb2_thumb-339.png\" alt=\"FIX Outlook Express Error 0x800c0133\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Pasul 3. Mutați e-mailurile din folderul Oversized Mail într-un folder New Mail. </h6> <p> 1. Deschideți Outlook Express. <br> 2. Selectați folderul de e-mail supradimensionat (cu o dimensiune de peste 2 GB, de ex. Folderul „Mesaje primite” din acest exemplu). <br> 3. Dacă vă puteți vedea e-mailurile în acel folder (dosarul nu este gol), procedați după cum urmează: * </p> <p> * Observație: Dacă folderul pare gol (nu vedeți niciun e-mail pe el), atunci folderul OE (și fișierul DBX asociat) este deteriorat. În acest caz, atunci trebuie să vă recuperați e-mailurile din folderul DBX corupt urmând instrucțiunile din acest articol. </p> <p> 4. În panoul din stânga, al programului OE, faceți clic dreapta pe folderul supradimensionat și alegeți <strong> Dosar nou </strong> (pentru a crea un nou folder de e-mail) </p> <p><img src=\"images/image_thumb-6-403.png\" alt=\"outlook express 2gb limit\" loading=\"lazy\"></p> <p> </p> <p> 5. Tastați un nume recunoscut pentru noul folder urmat de un an (de ex. „Inbox-2016”) </p> <p><img src=\"images/image_thumb-7-434.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Apoi, din folderul supradimensionat (de ex. Din „Mesaje primite”), selectați un grup de e-mailuri (de exemplu, toate e-mailurile din anul 2016) și glisați-le (mutați-le) în noul folder de e-mail pe care l-ați creat anterior (de ex. În „ Mesaje primite-2016 &quot;). </p> <p><img src=\"images/image_thumb-8-450.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Repetați aceiași pași (de exemplu, creați dosare diferite în funcție de an și mutați e-mailurile din folderul supradimensionat în folderele noi). * </p> <p> * Observație: Dacă întâmpinați probleme în timpul operației de mutare (de exemplu, dacă nu puteți muta unele mesaje în noul folder), atunci: </p> <blockquote><p> 1. Închideți Outlook Express. <br> 2. Copiați (faceți backup) folderul „Outlook Express” din locația OE Store în altă destinație de pe disc. <br> 3. Apoi urmați instrucțiunile de la pasul 4 pentru a șterge fișierul .dbx supradimensionat. <br> 4. Deschideți Outlook Express. <br> 5. Importați e-mailurile din folderul de rezervă OE (From <strong> Fişier </strong> meniul mergeți la -&gt; <strong> Import </strong> <strong> Mesaje </strong> -&gt; <strong> Microsoft Outlook Express 6 </strong> -&gt; <strong> Importați e-mailuri din directorul magazinului OE ... </strong> ). ** </p> <p> ** Dacă încă vă confruntați cu probleme în timpul importului, urmați instrucțiunile din acest articol pentru a repara fișierul DBX corupt. </p></blockquote> <p> </p> <p> 8. Când terminați cu transferul de e-mail și folderul de 2 GB devine gol de e-mailuri (de exemplu, „Mesaje primite” în acest exemplu), continuați cu pasul următor. </p> <p><img src=\"images/image_thumb-10-811.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Pasul 4. Ștergeți fișierul DBX Outlook Express supradimensionat de pe disc. </h6> <p> 1. Deschideți folderul magazinului Outlook Express pe disc. <br> 2. Ștergeți fișierul DBX supradimensionat (de exemplu, „Inbox.dbx” din acest exemplu). </p> <p><img src=\"images/image_thumb-9-996.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Lansați Outlook Express. <br> 4. OE va crea (automat) un nou folder de e-mail curat și sănătos pentru a stoca e-mailurile. * </p> <p> * Notă: Dacă totuși primiți aceeași eroare, încercați să reparați folderul OE corupt urmând instrucțiunile din acest articol: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se recuperează fișierul Outlook Express DBX GRATUIT </a> . </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? </p> <p> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}