{"title":"REPARARE: Completarea Outlook este instalată pentru toți utilizatorii și nu poate fi eliminată. (Rezolvat)","content":"<p> Dacă nu puteți dezactiva sau activa un program de completare Outlook din cauza erorii &quot; <em> Suplimentul este instalat pentru toți utilizatorii de pe acest computer și poate fi conectat sau deconectat doar de un administrator </em> &quot;, continuați să citiți mai jos pentru a rezolva problema. </p> <p><img src=\"images/image_thumb-76-527.png\" alt=\"The add-is installed for all users on this computer, and can only be connected or disconnected by an administrator\" loading=\"lazy\"></p> <p> Eroarea „Programul de completare poate fi dezactivat numai de către un administrator” apare deoarece, atunci când ați instalat programul de completare, alegeți să îl instalați pentru toți utilizatorii de pe computer. În acest caz, singura soluție pentru rezolvarea erorii este dezinstalarea programului de completare utilizând privilegii administrative. </p> <h2> Cum se remediază: Nu se poate activa sau dezactiva programul de completare, deoarece este instalat pentru toți utilizatorii din Outlook, Word sau Excel. </h2> <p> Dacă nu puteți elimina sau activa un program de completare a unei aplicații Microsoft Office, din cauza unei erori &quot; <em> Suplimentul este instalat pentru toți utilizatorii de pe acest computer și poate fi conectat sau deconectat doar de un administrator &quot;, </em> lansați aplicația corespunzătoare ca administrator și continuați să eliminați programul de completare fără probleme. Pentru a face asta: </p> <p><strong> 1. </strong> Faceți clic dreapta pe aplicația Office, unde vă confruntați cu eroarea menționată mai sus (de exemplu, Outlook) și selectați <strong> Rulat ca administrator. * </strong></p> <p> * Note: <strong><br> </strong> 1. Dacă nu vedeți opțiunea „Executare administrator”, țineți apăsat butonul <strong> SCHIMB </strong> cheie și <strong> Click dreapta </strong> la aplicația Office vă confruntați cu eroarea. <br> 2. Dacă faceți clic dreapta pe aplicația Office din Windows 10 <strong> start </strong> meniul <img src=\"images/image_thumb2_thumb_thumb-340.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Programe </strong> , mergi la <strong> Mai mult </strong> &gt; <strong> Rulat ca administrator. </strong></p> <p><img src=\"images/image_thumb-77-661.png\" alt=\"FIX: Unable to Enable or Disable Add-in \" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Când vi se cere să permiteți acestei aplicații să facă modificări dispozitivului dvs. alegeți <strong> Da. </strong></p> <p><img src=\"images/image_thumb-78-120.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. După deschiderea aplicației Office, continuați să dezactivați sau să activați suplimentul dorit. De data aceasta programul de completare va fi eliminat fără probleme. </p> <p> Asta este! Spuneți-mi dacă acest ghid v-a ajutat lăsând comentariul dvs. despre experiența dvs. Vă rugăm să apreciați și să împărtășiți acest ghid pentru a-i ajuta pe ceilalți. </p>"}