{"title":"REZOLVARE: Microsoft Office Installer a întâmpinat o problemă din cauza programului Office bazat pe clic pentru a rula programul Office (rezolvat).","content":"<p> Acest tutorial conține instrucțiuni pentru rezolvarea erorii de configurare Office &quot;Am găsit o problemă! Ne pare rău, programul de instalare Microsoft Office a întâmpinat o problemă deoarece aveți instalate pe computer aceste programe Office bazate pe instalare pe clic: Microsoft Office Professional&quot;. </p> <p> Eroarea de mai sus apare de obicei atunci când încercați să instalați Visio, Project, Skype for Business sau OneDrive for Business, în timp ce aveți Microsoft Office 2019, 2016 sau 2013 Professional Plus sau Standard, deja instalat pe computerul dvs. </p> <p><img src=\"images/image_thumb-12-962.png\" alt=\"FIX: Microsoft Office Installer encountered a problem because of Click to Run installer based Office programs \" loading=\"lazy\"></p> <p> Eroarea „Ne pare rău, programul de instalare Office Click-to-Run a întâmpinat o problemă deoarece aveți instalate pe computer aceste programe Office bazate pe programul de instalare Windows”, deoarece cele mai noi versiuni de Office (2013, 2016, 2019, 365) folosesc tehnologia „Click-to-Run” pentru instalare, în timp ce edițiile de volum ale acestor versiuni utilizează „tehnologia Windows Installer (MSI)”. Aceasta înseamnă că nu puteți avea decât un singur tip de program de instalare la un moment dat. </p> <h4> Cum se remediază: programul de instalare Microsoft Office a întâmpinat o problemă din cauza programelor Office bazate pe clic pentru a rula programul Office. </h4> <h6> Metodă 1. Dezinstalare Faceți clic pentru a rula programul de instalare. </h6> <p> 1. Apăsați <strong> Windows </strong> <img src=\"images/image_thumb41-136.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați <strong> instalator </strong> și apăsați <strong> introduce </strong> pentru a naviga la folderul „C: \\ Windows \\ Installer”. </p> <p><img src=\"images/image_thumb5_thumb-550.png\" alt=\"image_thumb[5]\" loading=\"lazy\"></p> <p> 3. Din <strong> Vedere </strong> meniu, faceți clic pe <strong> Adăugați coloane </strong> și apoi faceți clic pe <strong> Alege coloane </strong></p> <p><img src=\"images/image_thumb9_thumb-870.png\" alt=\"image_thumb[9]\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Verifica </strong> <strong> Subiect </strong> și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb13_thumb-850.png\" alt=\"image_thumb[13]\" loading=\"lazy\"></p> <p><a href=\"file:///C:/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/supfiles10B8394/image%5B20%5D.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 5. Sortați rezultatele după subiect și apoi derulați în jos până când localizați „ <em> Componenta Office-Click-to-Run de localizare Office &quot; </em> . </p> <p><img src=\"images/image_thumb-16-433.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Când îl găsiți, faceți clic dreapta pe el și alegeți <strong> Dezinstalați </strong> . * </p> <p> * Notă: dacă utilizați, vedeți mai multe &quot; <em> Componente de localizare Office-Click 16 pentru a rula &quot;, </em> apoi continuați și dezinstalați-le pe toate. </p> <p><img src=\"images/image_thumb-17-609.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7. Când dezinstalarea este finalizată, procedați la instalarea din nou a Microsoft Office. * </p> <p> * Notă: Dacă totuși primiți aceeași eroare, continuați și dezinstalați toate componentele &quot;Office 16 Click-to-Run&quot; și încercați să configurați Office din nou. </p> <h6></h6> <h6> Metoda 2. Descărcați și instalați versiunea cu amănuntul a produsului Microsoft Office. </h6> <p> 1. Navigați la <a href=\"https://www.heidoc.net/joomla/technology-science/microsoft/67-microsoft-windows-iso-download-tool\" target=\"_blank\" rel=\"nofollow noopener\"> HeiDoc.net </a> și descărcați fișierul <strong><a href=\"https://www.heidoc.net/php/Windows-ISO-Downloader.exe\" target=\"_blank\" rel=\"nofollow noopener\"> Instrument ISO Windows Downloader </a></strong> . <br> 2. Faceți dublu clic pentru a rula fișierul descărcat „Windows-ISO-Downloader.exe”. <br> 3. În panoul din dreapta selectați <strong> Birou </strong> fila și apoi selectați produsul Office Version Edition și limba pe care doriți să îl instalați. <br> 4. Când ați terminat, faceți clic <strong> Descarca. </strong></p> <p><img src=\"images/image_thumb-13-868.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Când descărcarea este finalizată, faceți clic dreapta pe fișierul imagine descărcat și faceți clic pe <strong> Montură. </strong></p> <p><img src=\"images/image_thumb-18-609.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Faceți dublu clic pe <strong> Setup.exe </strong> pentru a instala produsul Office. </p> <p><img src=\"images/image_thumb-15-851.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Metoda 3. Finalizați dezinstalați versiunea instalată a Office. </h6> <p> 1. Descărcați fișierul <a href=\"http://go.microsoft.com/?linkid=9815935\" target=\"_blank\" rel=\"nofollow noopener\"> Dezinstalați Microsoft Office Fix </a> instrument pentru a elimina automat versiunea Windows Installer a Office Office 365, Office 2019, Office 2016 sau Office 2013. </p> <p> 2. Rulați „Dezinstalați Microsoft Office Fix” și apăsați <strong> Următorul </strong> la primul ecran. </p> <p><img src=\"images/image_thumb-19-947.png\" alt=\"office uninstall tool\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Lăsați procesul de rezolvare a problemelor cu Office Uninstall și eliminați software-ul Office de pe computer. </p> <p><img src=\"images/image_thumb-20-436.png\" alt=\"cannot uninstall office\" loading=\"lazy\"></p> <p> 4. Când dezinstalarea este finalizată, reporniți computerul și încercați să instalați din nou Microsoft Office. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți acest lucru. </p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-22.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p>"}