{"title":"REPARARE: Eroare DISM 1016 A apărut o eroare la încercarea de accesare a imaginii (rezolvată)","content":"<p> Acest tutorial conține instrucțiuni pentru rezolvarea următoarei erori la executarea comenzii DISM în Windows 10: „Eroare 1016: A apărut o eroare la încercarea de a accesa imaginea”. Eroarea DISM 1016 poate apărea atunci când încercați să reparați o imagine Windows deteriorată, utilizând una dintre următoarele comenzi DISM în promptul de comandă Windows 10: </p> <ul> <li> Dism / Online / Cleanup-Image / Restorehealth </li> <li> Dezactivare / Online / Cleanup-image / Restorehealth /source:wim:X:\\sources\\install.wim:1 / LimitAccess </li> </ul> <p> … Sau când utilizați comanda DISM în Windows Recovery Environment (WinRE) </p> <ul> <li> Dism.exe / Image: X: \\ / Cleanup-Image / Restorehealth </li> </ul> <p> </p> <h4> Cum se remediază eroarea DISM 1016: A apărut o eroare la încercarea de accesare a imaginii. </h4> <p><strong> Cerințe </strong> : Pentru a remedia problemele menționate în acest articol, urmând metodele de mai jos, va trebui să porniți computerul de pe un suport de instalare Windows (USB sau DVD). Dacă nu dețineți un suport de instalare Windows, puteți crea unul utilizând <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Instrumentul de creare media Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se creează un suport de instalare USB Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se creează un suport de instalare DVD Windows 10. </a></li> </ul> <p> </p> <h6> Metoda 1. Restabiliți Windows 10 așa cum era înainte de a instala actualizările. </h6> <p> Eroarea DISM 1016 apare de obicei după instalarea nereușită a unei actualizări Windows. Deci, în primul rând anulați instalarea actualizărilor. Pentru a face asta: </p> <p> 1. Porniți sistemul de pe un suport de instalare Windows. <br> 2. În ecranul de mai jos apăsați pe <strong> SCHIMB </strong> + <strong> F10 </strong> tastele pentru a lansa promptul de comandă. (sau faceți clic pe <strong> Următorul </strong> și du-te la <strong> Reparați computerul </strong> &gt; <strong> Depanare </strong> &gt; <strong> Prompt de comandă </strong> ). </p> <p><img src=\"images/image_thumb17_thumb-172.png\" alt=\"FIX DISM Error 1016: An error occurred while attempting to access the image\" loading=\"lazy\"></p> <p> </p> <p> 3. La promptul de comandă, obțineți o listă cu toate unitățile, pe sistemul dvs., cu această comandă: </p> <ul> <li><strong> wmic logicdisk obține numele </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-327.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> 4. Apoi aflați care unitate conține folderul „Windows”, tastând această comandă: * </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * de exemplu. Pentru a vedea conținutul unității C: tastați: &quot; <strong> dir C: </strong> &quot;(fără ghilimele). Dacă nu puteți vedea folderul&quot; Windows &quot;de pe unitatea C:, continuați cu următoarea literă a unității (de exemplu,&quot; dir D: &quot;,&quot; dir E: &quot;etc.), până când vedeți Dosarul „Windows” de pe una dintre unitățile enumerate (din comanda de mai sus). </p> <p> [După cum puteți vedea la captura de ecran de mai jos, folderul Windows (în acest caz) se află la unitatea D:] </p> <p> </p> <p><img src=\"images/image_thumb13_thumb-1-454.png\" alt=\"image_thumb[13]\" loading=\"lazy\"></p> <p> </p> <p> 5. Odată ce ați găsit pe ce unitate se află unitatea „Windows” (de exemplu la unitatea „D:” în acest exemplu), navigați la acea unitate tastând DriveLetter <strong> : </strong> + <strong> introduce </strong> . </p> <p> 6. Apoi creați un folder zero pe unitate tastând această comandă: </p> <ul> <li><strong> mkdir D: \\ Scratch </strong></li> </ul> <p><img src=\"images/image_thumb7_thumb-1-575.png\" alt=\"image_thumb[7]\" loading=\"lazy\"></p> <p> </p> <p> 7. Apoi dați comanda de mai jos pentru a reveni la sistemul dvs., după actualizarea nereușită: </p> <ul> <li><strong> DISM / Image: D: \\ / ScratchDir: D: \\ Scratch / Cleanup-Image / RevertPendingActions </strong></li> </ul> <p> * Notă: Schimbați litera unității <strong> D </strong> după caz. </p> <p> 8. După executarea comenzii DISM de mai sus, trebuie să primiți următorul mesaj pe ecran: </p> <p><em> &quot;Revenirea acțiunilor în așteptare din imagine .... <br> Operațiunea s-a încheiat. Orice revenire a acțiunilor în așteptare va fi încercată după repornire <br> Operațiunea a fost încheiată cu succes.&quot; </em></p> <p><img src=\"images/image_thumb11_thumb-753.png\" alt=\"image_thumb[11]\" loading=\"lazy\"></p> <p> </p> <p> 9. <strong> Închide </strong> prompt de comandă și <strong> repornire </strong> computerul tau. * </p> <p> 10. Dacă Windows pornește normal, continuați cu munca. Dacă Windows nu va porni și încearcă din nou să instaleze actualizările, atunci: </p> <blockquote><p> 1. Opriți computerul. <br> 2. Reporniți computerul de pe suportul de instalare Windows. <br> 3. Lansați promptul de comandă. <br> 4. La promptul de comandă, dați următoarele comenzi în ordine (nu uitați să modificați litera unității <strong> D </strong> după caz): </p></blockquote> <ul> <li> <ul> <li> del D: \\ Windows \\ SoftwareDistribution </li> <li> del D: \\ Windows \\ WinSxS \\ cleanup.xml </li> <li> del D: \\ Windows \\ WinSxS \\ Pending.xml </li> </ul> </li> </ul> <blockquote><p> 5. Când ați terminat, închideți promptul de comandă și <strong> repornire </strong> computerul dvs. * </p></blockquote> <p> * Notă: Dacă boot-ul eșuează din nou, atunci boot-ul din nou este promptul de comandă WinRE și dați următoarele comenzi (nu uitați să modificați litera unității <strong> D </strong> după caz): </p> <ul> <li> chkdsk / f D: </li> <li> sfc / scannow / offbootdir = D: \\ / offwindir = D: \\ windows </li> <li> dism / image: D: \\ / cleanup-image / restorehealth </li> </ul> <p> </p> <h6> Metoda 2. Restabiliți Windows Registry din Backup. </h6> <p> Următoarea metodă de remediere a erorii dism 1016 (A apărut o eroare în timp ce încercați să accesați imaginea) este restaurarea registrului Windows din folderul „RegBack”. * </p> <p> * Informații: folderul „RegBack”, (cale completă = Windows \\ System32 \\ Config \\ RegBack), este locația în care Windows stochează automat o copie de rezervă a fișierelor de registry ori de câte ori pornește mașina. </p> <p> Pentru a restabili registrul din folderul RegBack: </p> <p> 1. Porniți sistemul de pe un suport de instalare Windows și apoi urmați pașii 1-5 din metoda-1 de mai sus pentru a naviga la unitatea Windows. (de exemplu, „D:” în acest exemplu). </p> <p> 2. În primul rând, faceți o copie de rezervă a fișierelor de registry curente, oferind următoarele comenzi în ordine. (Presa <strong> introduce </strong> după ce ați tastat fiecare comandă): </p> <ul> <li><strong> cd \\ windows \\ system32 \\ config </strong></li> <li><strong> md Backup </strong></li> <li><strong> copia *. * Backup </strong></li> </ul> <p><img src=\"images/image_thumb-26-867.png\" alt=\"infinite Automatic Repair loop windows 10 fix\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Navigați acum la <strong> RegBack </strong> dosar dând această comandă: </p> <ul> <li><strong> cd RegBack </strong></li> </ul> <p> 4. Apoi tastați <strong> DIR </strong> (pentru a vizualiza conținutul folderului RegBack). </p> <p> 5. Acum vedeți dacă vreunul dintre fișierele listate are <strong> 0</strong> (zero) octeți în dimensiunea fișierului lor și continuați mai jos, în funcție de caz: </p> <ul> <li><strong> Cazul A. </strong> Dacă oricare dintre fișierele listate are 0 (zero) octeți în dimensiunea sa, atunci <strong> Opriți aici </strong> , și <strong> continuați cu următoarea metodă </strong> , deoarece fișierele de rezervă ale registrului sunt inutile sau corupte. </li> <li><strong> Cazul B. </strong> Dacă toate fișierele listate au o dimensiune diferită de zero (ca în captura de ecran de mai jos), treceți la pasul următor. </li> </ul> <p><img src=\"images/image_thumb-27-314.png\" alt=\"restore registry from backup\" loading=\"lazy\"></p> <p> </p> <p> 6. Copiați fișierele de registry din <strong> Windows \\ System32 \\ Config \\ RegBack </strong> dosar către <strong> Windows \\ System32 \\ Config \\ </strong> folder, dând această comandă: </p> <p> </p> <ul> <li><strong> copie *.* .. </strong></li> </ul> <p> 7. Când vi se solicită, apăsați <strong> A </strong> pentru a suprascrie fișierele în destinație după ce ați dat comanda de copiere. </p> <p><img src=\"images/image_thumb-28-604.png\" alt=\"fix startup repair loop\" loading=\"lazy\"></p> <p> </p> <p> 8. Când copia este finalizată, tastați <strong> Ieșire </strong> și apăsați <strong> introduce </strong> pentru a închide promptul de comandă. <br> 9. <strong> Repornire </strong> computerul și încercați să porniți Windows. </p> <p> * Notă: Dacă Windows nu pornește din nou, atunci porniți din nou este promptul de comandă WinRE și dați următoarele comenzi (nu uitați să modificați litera unității <strong> D </strong> după caz): </p> <ul> <li> chkdsk / f D: </li> <li> sfc / scannow / offbootdir = D: \\ / offwindir = D: \\ windows </li> <li> dism / image: D: \\ / cleanup-image / restorehealth </li> </ul> <p> </p> <h6> Metoda 3. Restabiliți Windows 10 la o stare de lucru anterioară. </h6> <p> Următoarea metodă pentru a rezolva eroarea DISM 1016 este să restaurați sistemul la o stare de lucru anterioară. Pentru a face asta: </p> <p> 1. Porniți sistemul de pe suportul de instalare Windows. <br> 2. În ecranul de mai jos faceți clic pe <strong> Următorul </strong> și apoi faceți clic pe <strong> Reparați computerul </strong> &gt; <strong> Depanare. </strong></p> <p><img src=\"images/image_thumb20_thumb-815.png\" alt=\"image_thumb[20]\" loading=\"lazy\"></p> <p> </p> <p> 3. La <strong> Opțiuni avansate </strong> clic <strong> Restaurarea sistemului. * </strong></p> <p> * Notă: Dacă <strong> Reveniți la o versiune anterioară </strong> opțiunea, este disponibilă pe acest ecran, apoi alegeți acea opțiune. </p> <p><img src=\"images/image_thumb28_thumb-863.png\" alt=\"image_thumb[28]\" loading=\"lazy\"></p> <p> </p> <p> 4. În ecranul următor, faceți clic pe sistemul dvs. de operare. </p> <p><img src=\"images/image_thumb29_thumb-664.png\" alt=\"image_thumb[29]\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 5. Apoi la System Restore Wizard, faceți clic pe <strong> Următorul </strong> și apoi alegeți o stare de lucru anterioară (Data / Ora) și faceți clic pe <strong> Următorul </strong> pentru a porni procesul de restaurare. </p> <p><img src=\"images/image_thumb-50-619.png\" alt=\"system restore windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Metoda 4. Reparați Windows 10. </h6> <p> Metoda finală pentru a rezolva eroarea 1016 în DISM, este să <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> reparați Windows 10 cu actualizare la fața locului </a> sau pentru a face o copie de rezervă a fișierelor și apoi la <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> instalați curat Windows 10 </a> . </p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}