{"title":"REPARARE: Windows 10 rulează extrem de lent după instalarea v2004 sau Edge Chromιum (rezolvat)","content":"<p> Mulți utilizatori au raportat că computerul lor funcționează extrem de lent după instalarea actualizării Windows 10 2004 sau după instalarea noii versiuni bazate pe Chromium a browserului Microsoft Edge. Dacă vă confruntați cu una dintre problemele menționate mai sus, urmați instrucțiunile din acest articol pentru a le rezolva. </p> <p> Problemă în detalii: După ce actualizați Windows 10 la versiunea 2004 sau după ce instalați <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> update, care instalează automat noul browser Edge (versiunea Chromium), Windows durează mult timp la procesul de boot sau rulează foarte lent. </p> <h4> Cum se remediază: probleme de pornire lentă și de performanță lentă în Windows 10 2004. </h4> <h6> Metoda 1. Instalați actualizările Windows disponibile și actualizați driverele de dispozitiv. </h6> <p> Prima metodă, pentru a rezolva problemele de performanță lentă din Windows 10, este de a efectua următorii pași: </p> <ul> <li><strong> Pasul 1. </strong> Descărcați și instalați toate actualizările Windows disponibile. </li> <li><strong> Pasul 2. </strong> Descărcați și instalați cele mai recente drivere Windows 10 pentru adaptorul de afișare. </li> <li><strong> Pasul 3. </strong> Dacă utilizați un program antivirus terță parte, dezinstalați-l și verificați dacă problema de performanță lentă persistă. Dacă nu, instalați cea mai recentă versiune a programului AV. </li> </ul> <p> </p> <h6> Metoda 2. Dezinstalați versiunea Microsoft Edge Chromium. </h6> <p> A doua metodă de remediere a problemelor de performanță lentă din Windows 10 este dezinstalarea versiunii Microsoft Edge Chromium (dacă este instalată). </p> <h5> Pasul 1. Verificați dacă este instalată noua versiune bazată pe Chromium a Microsoft Edge. </h5> <p> 1. Din meniul Start <img src=\"images/image_thumb2_thumb_thumb-381.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> clic <strong> Setări </strong><img src=\"images/image_thumb-66-515.png\" alt=\"image\" loading=\"lazy\"> și faceți clic pe <strong> Aplicații. <br> </strong> 2. Dacă <strong> Aplicații și caracteristici </strong> găsiți aplicația Microsoft Edge și conform pictogramei sale procedați după cum urmează: </p> <ul> <li> Dacă vedeți această imagine pictogramă <img src=\"images/image_thumb-32-976.png\" alt=\"image\" loading=\"lazy\"> , înseamnă că noua versiune a Microsoft Edge bazată pe Chromium este deja instalată pe computer. În acest caz, accesați <strong> <a href=\"#step-2\" target=\"_blank\" rel=\"nofollow noopener\"> pasul 2 </a></strong> pentru a dezinstala Edge Chromium de pe computer. </li> <li> Dacă vedeți această imagine pictogramă <img src=\"images/image_thumb-33-372.png\" alt=\"image\" loading=\"lazy\"> , înseamnă că noua versiune bazată pe Chromium nu este încă instalată pe computer. În acest caz, treceți la <a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"><strong> metoda-3 </strong></a> . </li> </ul> <p><img src=\"images/image_thumb-71-268.png\" alt=\"FIX: Windows 10 Running Extremely Slow after 2004 Update\" loading=\"lazy\"></p> <p> </p> <h5> Pasul 2. Eliminați Edge Chromium de pe PC. </h5> <p> Pentru a dezinstala noul Edge bazat pe Chromium în Windows 10: </p> <p> 1. Navigați la următorul folder de pe computer: * </p> <ul> <li> C: \\ Program Files (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </li> </ul> <p> * Notă: numele folderului „85.0.564.41” indică versiunea instalată a noii versiuni Chromium și poate diferi de la computerul dvs. </p> <p> 2. Selectați calea folderului în bara de adrese și faceți clic dreapta pe&gt; <strong> Copie. </strong></p> <p><img src=\"images/image_thumb-35-379.png\" alt=\"Uninstall Edge Chromiun\" loading=\"lazy\"></p> <p> </p> <p> 3. Deschideți <strong> Prompt comandă ca administrator, </strong> tip <strong> CD </strong> și apoi apăsați <strong> CTRL + V </strong> pentru a lipi în calea folderului copiat. Când ați terminat, apăsați <strong> introduce </strong> . * </p> <p> * de ex .: În exemplul curent, comanda va fi: </p> <p><em> cd C: \\ Program Files (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </em></p> <p><img src=\"images/image_thumb-36-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Acum, dați comanda de mai jos (Copiere / Lipire) în promptul de comandă pentru a elimina versiunea Chromium a browserului Microsoft Edge de pe computer. </p> <ul> <li> setup.exe –uninstall –sistem-level –verbose-logging –force-uninstall </li> </ul> <p><img src=\"images/image_thumb-37-229.png\" alt=\"Remove Edge Chromiun\" loading=\"lazy\"></p> <p> 5. Odată ce comanda de mai sus este executată, vechea versiune a EDGE va fi activată din nou. Reporniți computerul pentru a aplica modificări. <br> 6. După repornire, procedați la instalarea manuală a <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> nou browser Edge bazat pe Chromium </a> pe computerul dvs., pentru a evita instalarea din nou a problematică actualizare KB4559309. </p> <p> </p> <h6> Metoda 3. Restabiliți Windows 10 la versiunea sa anterioară. </h6> <p> 1. Din <strong> start </strong> meniul <img src=\"images/image_thumb2_thumb_thumb-872.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> deschis <strong> Setări </strong> <img src=\"images/image_thumb-66-969.png\" alt=\"image\" loading=\"lazy\"> și apoi faceți clic pe <strong> Actualizare și securitate. </strong></p> <p> 2. Alegeți <strong> Recuperare </strong> în stânga și apoi, sub secțiunea „Reveniți la versiunea anterioară a Windows 10”, faceți clic pe <strong> Incepe </strong> buton. </p> <p><img src=\"images/image_thumb-4-708.png\" alt=\"Restore Windows to earlier version\" loading=\"lazy\"></p> <p> 3. Urmați instrucțiunile de pe ecran pentru a restabili Windows 10 la versiunea sa anterioară. <br> 4. După ce reveniți la versiunea anterioară a Windows 10, computerul dvs. ar trebui să ruleze normal din nou și fără întârzieri. </p> <p> </p> <h6> Metoda 4. Reparați Windows 10. </h6> <p> Următoarea metodă pentru a rezolva problemele de performanță lentă din Windows 10 este de a repara Windows utilizând comenzile SFC și DISM: </p> <p> 1. Deschideți <strong> Prompt comandă ca administrator </strong> . <br> 2. În promptul de comandă, dați următoarea comandă dism și apăsați <strong> Introduce: </strong></p> <ul> <li><strong> DISM.exe / Online / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-175.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> </p> <p> 3. Când operațiunea DISM este finalizată, tastați următoarea comandă și apăsați <strong> introduce </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb31-316.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Acum așteptați până când System File Checker repară fișierele de sistem Windows. <br> 5. Când se face acest lucru, <strong> repornire </strong> computerul și vedeți dacă problema este rezolvată. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}