{"title":"REPARARE: Fișierul nu are fluxuri audio sau video pe Adobe Premiere.","content":"<p> Dacă primiți eroarea Adobe Premiere „Eșec la importarea fișierului” cu descrierea „Fișierul nu are aburi audio sau video” poate apărea în timp ce importați un fișier video MP4, apoi continuați să citiți mai jos. Eroarea „Fișierul nu are aburi audio sau video” în Adobe Premiere, poate apărea, deși videoclipul este redat corect în orice alte playere media (VLC, Windows Media Player etc.). </p> <p><img src=\"images/image_thumb-43-349.png\" alt=\"FIX: File has no audio or video streams on Adobe Premiere\" loading=\"lazy\"></p> <p> </p> <p> Erorile Adobe Premiere, în timp ce importați un fișier video, pot apărea din mai multe motive, așa că în acest tutorial veți găsi toate metodele disponibile pentru a remedia problema. </p> <h4> Cum se remediază: „Fișierul nu are aburi audio sau video” în Adobe Premiere. </h4> <h6> Metoda 1. Instalați QuickTime. </h6> <p> În primul rând, asigurați-vă că ați instalat cea mai recentă versiune <a href=\"https://support.apple.com/downloads/quicktime\" target=\"_blank\" rel=\"nofollow noopener\"> Timp rapid </a> versiunea de pe computer și apoi încercați să importați fișierul mp4 în Adobe Premiere. </p> <p> </p> <h6> Metoda 2. Redenumiți fișierul video. </h6> <p> 1. Creați o copie a fișierului video mp4 pe o altă locație de pe computer. (de exemplu, pe desktop) <br> 2. Redenumiți fișierul video după cum urmează: </p> <blockquote><p> A. Dați un nume de fișier mai scurt pe fișierul video și ... <br> b. Eliminați caracterele speciale din numele acestuia. (subliniere, paranteze etc.). </p></blockquote> <p> 3. Deschideți fișierul video în Adobe Premiere. </p> <p> </p> <h6> Metoda 3. Schimbați extensia numelui de fișier din MP4 în MOV. </h6> <p> Următoarea metodă pentru a ocoli eroarea Adobe Premiere „Fișierul nu are fluxuri audio sau video”, este schimbarea extensiei fișierului video, de la .mp4 la .mov (sau vice versa). Pentru a face asta: </p> <p> 1. În File Explorer, faceți clic pe <strong> Vedere </strong> -&gt; <strong> Opțiuni </strong> -&gt; <strong> Schimbați folderul și opțiunile de căutare </strong> . </p> <p><img src=\"images/image_thumb-45-776.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. La <strong> Vedere </strong> filă, <strong> clar </strong> caseta „Ascundeți extensiile pentru tipurile de fișiere cunoscute” și faceți clic pe <strong> O.K </strong> . * </p> <p> * Notă: pentru a face această setare permanentă, faceți clic pe „Aplicați la dosare”, înainte de a face clic pe OK. </p> <p><img src=\"images/image_thumb-46-490.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Acum, continuați și redenumiți / modificați extensia fișierului video, după cum urmează: </p> <ul> <li> Dacă fișierul video este în format MP4 (.mp4), schimbați extensia acestuia la .mov </li> <li> Dacă fișierul video este în format MOV (.mov), schimbați extensia acestuia în .mp4 </li> </ul> <p><img src=\"images/image_thumb-47-586.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. În cele din urmă, deschideți fișierul video în Adobe Premiere. </p> <p> </p> <p> </p> <h6> Metoda 4. Ștergeți baza de date media cache și fișierele cache. </h6> <p> Când importați un fișier media (video sau audio) și în timp ce lucrați cu acest fișier în Adobe Premiere, programul creează fișiere cache media pentru performanțe mai rapide. În plus, programul creează legături pentru aceste fișiere cache în baza de date Media Cache. În acest timp, aceste fișiere cache media și baza de date Media Cache pot deveni prea mari sau corupte și trebuie curățate pentru a evita problemele. </p> <p> Deci, următoarea metodă pentru a rezolva „Fișierul nu are fluxuri audio sau video” în Premiere, este să curățați „baza de date cache media” și să ștergeți fișierele cache. Pentru a face asta: * </p> <p><strong> A. Cum se curăță baza de date media cache a Adobe Premiere. </strong></p> <p> 1. Deschideți Adobe Premiere. <br> 2. Din meniu accesați <strong> Editați | × </strong> -&gt; <strong> Preferințe </strong> -&gt; <strong> Mass-media. <br> </strong> 3. În Media Cache Database, faceți clic pe <strong> Curat </strong> buton. </p> <p><img src=\"images/image_thumb-48-167.png\" alt=\"Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> 4. <strong> Repornire </strong> Adobe Premiere și încercați să deschideți fișierul video. dacă eroarea „Fișierul nu are fluxuri audio sau video” persistă, procedați la curățarea fișierelor cache ale Adobe Premiere urmând instrucțiunile de mai jos: </p> <p><strong> B. Cum se șterge fișierele media cache din Adobe Premiere. </strong></p> <p> 1. <strong> Deschis </strong> Adobe Premiere. <br> 2. Din meniu accesați <strong> Editați | × </strong> -&gt; <strong> Preferințe </strong> -&gt; <strong> Mass-media. <br> </strong> 3. La Media Cache Files faceți clic pe <strong> Naviga </strong> sau notați locația fișierelor cache media. </p> <p><img src=\"images/image_thumb-49-331.png\" alt=\"FIX: Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Închide </strong> Adobe Premiere. <br> 5. În File Explorer, <strong> șterge </strong> tot conținutul folderului „Fișiere media cache”. <br> 6. Importați fișierul video în Premiere. </p> <p> </p> <h6> Metoda 5. Recodificați fișierul video. </h6> <p> Metoda finală pentru a rezolva „Fișierul nu are fluxuri audio sau video” în procesul de importare Adobe Premiere, este recodarea fișierului video. Pentru a face asta: </p> <p> 1. Descărcați și instalați <a href=\"https://handbrake.fr/downloads.php\" target=\"_blank\" rel=\"nofollow noopener\"> Frână de mână </a> . <br> 2. Deschideți Frâna de mână și faceți clic <strong> Fișier - Deschideți un singur fișier video </strong> . </p> <p><img src=\"images/image_thumb-50-634.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Selectați fișierul video pe care nu îl puteți importa în Adobe Premiere și faceți clic <strong> Deschis </strong> . <br> 4. Setați formatul de ieșire la <strong> MP4, </strong> și apoi faceți clic pe <strong> Naviga </strong> și specificați locația magazinului și numele fișierului fișierului video de ieșire (recodificat). </p> <p><img src=\"images/image_thumb-51-817.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. La <strong> Dimensiuni </strong> fila, setați aceleași dimensiuni ca și fișierul sursă. <br> 6. Când ați terminat, faceți clic pe <strong> Porniți Codificare. </strong></p> <p><img src=\"images/image_thumb-52-713.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Când procesul de codificare este finalizat, închideți Handbrake. <br> 7. Deschideți fișierul video recodat în Adobe Premiere. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}