{"title":"REPARARE: Accesul rapid nu funcționează și nu se poate introduce în caseta de căutare în Windows 10 (rezolvat)","content":"<p> Dacă <strong> Acces rapid </strong> Meniul nu funcționează în Windows 10, apoi citiți acest tutorial pentru a remedia problema. Opțiunea Acces rapid din File Explorer, permite utilizatorului să navigheze ușor către fișierele și folderele deschise recent. Dar uneori, mai ales când ați deschis anterior un fișier / folder de pe o unitate externă (de exemplu, discul USB), care este acum offline, accesul rapid nu afișează fișierele recente sau nu puteți tasta în bara „Căutare”. </p> <p><img src=\"images/image_thumb-2-490.png\" alt=\"FIX: Quick Access Not Working in Windows 10 (Solved)\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cum se remediază: funcția de acces rapid și funcția de căutare nu funcționează în Windows 10. </h4> <p> </p> <h6> Metoda 1. Reporniți Windows Explorer. </h6> <p> Prima metodă de remediere a problemei de acces rapid este să reporniți procesul Windows Explorer din Task Manager. Pentru a face asta: </p> <p> 1. Apăsați <strong> Ctrl </strong> + <strong> Alt </strong> + <strong> Del </strong> a deschide <strong> Gestionar de sarcini </strong> . <br> 2. La <strong> Procese </strong> * fila, evidențiați fișierul <strong> Windows Explorer </strong> procesează și dă clic <strong> Repornire </strong> . </p> <p> * Notă: dacă nu vedeți fila „Procesare”, faceți clic pe <strong> Mai multe detalii. </strong></p> <p><img src=\"images/image_thumb-951.png\" alt=\"restart windows explorer\" loading=\"lazy\"></p> <p><strong> </strong></p> <h6> Metoda 2. Activați accesul rapid elementele recente și ștergeți istoricul exploratorului de fișiere. </h6> <p> 1. Deschideți <strong> Opțiuni folder. </strong> Pentru aceasta, deschideți Windows Explorer și din meniu, accesați <strong> Vedere </strong> &gt; <strong> Opțiuni </strong> . </p> <p><img src=\"images/image_thumb-3-949.png\" alt=\"enable quick access windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. În <strong> General </strong> , asigurați-vă că sunt selectate următoarele casete de selectare. </p> <ul> <li><strong> Afișați fișierele utilizate recent în Acces rapid </strong></li> <li><strong> Afișați folderele utilizate frecvent în Acces rapid. </strong></li> </ul> <p> 3. Apoi faceți clic pe <strong> clar </strong> pentru a șterge istoricul File Explorer. </p> <p><img src=\"images/image_thumb-4-329.png\" alt=\"clear quick access history\" loading=\"lazy\"></p> <p> </p> <p> 3. Faceți clic pe <strong> O.K </strong> și verificați dacă funcția Acces rapid și funcția de căutare funcționează. Dacă nu, reporniți „File Explorer” folosind Managerul de activități (a se vedea metoda-1 de mai sus) și verificați din nou. Dacă problema persistă, continuați cu următoarea metodă. </p> <h6> Metoda 3. Ștergeți manual Istoricul articolelor recente. </h6> <p> Următoarea metodă de rezolvare a problemelor cu elementele recente cu acces rapid sau cu funcția „Căutare” în Windows 10 este să ștergeți manual istoricul articolelor recente. Pentru a face asta: </p> <p> 1. Deschideți Windows Explorer. <br> 2. Copiați și lipiți următoarea adresă în bara de adrese și apăsați <strong> introduce </strong> : </p> <p> % AppData% \\ Microsoft \\ Windows \\ Recent \\ AutomaticDestinations </p> <p><img src=\"images/image_thumb-1-410.png\" alt=\"clear recent items windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Apăsați <strong> Ctrl </strong> + <strong> A </strong> (pentru a selecta toate articolele) și apăsați <strong> Șterge </strong> (sau faceți clic dreapta&gt; <strong> Șterge </strong> ). </p> <p><img src=\"images/image_thumb-5-834.png\" alt=\"Delete Quick Access History\" loading=\"lazy\"></p> <p> </p> <p> 4. Apoi copiați / lipiți următoarea adresă în bara de adrese și apăsați <strong> introduce </strong> . </p> <p> % AppData% \\ Microsoft \\ Windows \\ Recent \\ CustomDestinations </p> <p><img src=\"images/image_thumb-6-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Apăsați <strong> Ctrl </strong> + <strong> A </strong> din nou (pentru a selecta toate articolele) și apăsați <strong> Șterge. <br> </strong> 6. Acum apăsați <strong> Ctrl + Alt + Del </strong> a deschide <strong> Gestionar de sarcini </strong> . <br> 7. La <strong> Procese </strong> fila, evidențiați fișierul <strong> Windows Explorer </strong> procesează și dă clic <strong> Repornire </strong> . <br> 8. În mod normal, problemele cu funcția „Acces rapid” sau cu funcția „Căutare” ”trebuie să fi fost rezolvate. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}