{"title":"REPARARE: YouTube nu funcționează pe Chrome (rezolvat)","content":"<p> Cu câteva zile înainte, am întâmpinat următoarea problemă pe un computer Windows: YouTube nu funcționează în Chrome (videoclipurile nu se joacă). Dacă nu puteți viziona videoclipuri pe YouTube sau alte site-uri web cu Google Chrome, deoarece fereastra video este neagră, citiți acest tutorial pentru a remedia problema. </p> <p><img src=\"images/image_thumb-19-778.png\" alt=\"FIX YouTube Not Working on Chrome \" loading=\"lazy\"></p> <h4> Cum se remediază: YouTube sau videoclipurile online nu se încarcă în browserul Chrome. </h4> <p> Când videoclipurile YouTube nu se vor încărca în Chrome, procedați la rezolvarea problemei urmând pașii de mai jos. </p> <h6> Pasul 1. Verificați dacă puteți viziona videoclipuri cu alt browser. </h6> <p> Primul pas este de a determina dacă problema „YouTube nu funcționează” se află numai pe Google Chrome sau în toate celelalte browsere instalate. Deci, deschideți orice alt browser web (de exemplu, „Internet Explorer”) și verificați dacă puteți viziona videoclipuri YouTube. Dacă vă confruntați cu aceeași problemă, verificați-vă Conexiunea la Internet și dacă este OK, actualizați driverele de pe adaptorul de afișare. Dacă puteți viziona videoclipuri YouTube, cu un alt browser, continuați cu pasul următor. </p> <p> </p> <h6> Pasul 2. Dezactivați accelerarea hardware în Chrome. </h6> <p> Următorul pas pentru a rezolva problema „videoclipurile YouTube care nu se încarcă în Chrome” este dezactivarea accelerării hardware în browserul Chrome. Pentru a face asta: </p> <p> 1. Din meniul Chrome <img src=\"images/image_thumb-78-483.png\" alt=\"image\" loading=\"lazy\"> Selectați <strong> Setări </strong> . </p> <p><img src=\"images/image_thumb-79-661.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. La <strong> Setări </strong> pagina, derulați în jos și faceți clic <strong> Avansat </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Trageți <strong> Folosiți accelerația hardware atunci când este disponibilă </strong> schimba cu <strong> OPRIT </strong> și apoi faceți clic pe <strong> Relansați. </strong></p> <p><img src=\"images/image_thumb-16-156.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Verifică dacă poți viziona videoclipuri YouTube acum. Dacă nu, continuați cu pasul 3. </p> <p> </p> <h6> Pasul 3. Ștergeți datele de navigare (cookie-uri, cache etc.). </h6> <p> Următorul pas pentru a rezolva problema „YouTube video care nu se încarcă” în Chrome este să ștergeți datele de navigare. Pentru aceasta: </p> <p> 1. Din meniul Chrome <img src=\"images/image_thumb-78-896.png\" alt=\"image\" loading=\"lazy\"> Selectați <strong> Mai multe unelte </strong> &gt; <strong> Sterge istoricul de navigare </strong> . </p> <p><img src=\"images/image_thumb-17-593.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. La Ștergeți opțiunile datelor de navigare, selectați <strong> Tot timpul </strong> (la „Interval de timp”) și apoi faceți clic pe <strong> Date clare </strong> . </p> <p><img src=\"images/image_thumb-18-321.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Reporniți Chrome și încercați să vizionați un videoclip YouTube. Dacă problema persistă, continuați cu următoarea soluție. </p> <p> </p> <h6> Pasul 4: ștergeți setările și datele stocate în profilul dvs. Chrome. </h6> <p> Uneori, browserul Chrome nu funcționează normal dacă profilul Chrome este deteriorat. Deci, o metodă ușoară de rezolvare a problemelor Chrome este recrearea folderului de profil Chrome. Pentru a face asta: </p> <p><strong> 1. </strong> <strong> Simultan </strong> presa &quot; <strong> Windows </strong> &quot;+&quot; <strong> R </strong> ”Tastele pentru a deschide <em> ALERGA </em> fereastră. </p> <p><strong> 2. </strong> În <em> ALERGA </em> fereastra copiați și lipiți următoarea comandă în funcție de sistemul de operare Windows și apăsați <strong> O.K </strong> : </p> <ul> <li><strong> Windows 10, 8, 7 sau Vista: </strong> <ul> <li><strong> % LOCALAPPDATA% \\ Google \\ Chrome \\ </strong></li> </ul> </li> </ul> <p><img src=\"images/image_thumb4-325.png\" alt=\"chrome profile data\" loading=\"lazy\"></p> <ul> <li><strong> Windows XP: </strong> <ul> <li><strong> % USERPROFILE% \\ Local Settings \\ Application Data \\ Google \\ Chrome \\ </strong></li> </ul> </li> </ul> <p> </p> <p> 3. <strong> Redenumiți </strong> dosarul „Date utilizator” la „Date utilizator.OLD” sau <strong> șterge* </strong> folderul „Date utilizator”. </p> <p><strong> * Notă importantă: </strong> Rețineți că, ștergând dosarul de stocare al profilului Chrome, ștergeți toate datele stocate (Marcaje, Parole, Setări, Extensii, Istoric etc.). Deci, înainte de a vă șterge profilul, luați un <a href=\"https://www.repairwin.com/how-to-backup-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> backupul marcajelor Chrome </a> și <a href=\"https://www.repairwin.com/how-to-view-and-export-chrome-passwords/\" target=\"_blank\" rel=\"nofollow noopener\"> stocați parolele Chrome. </a></p> <p> </p> <p><img src=\"images/image_thumb11_thumb-690.png\" alt=\"chrome profile storage folder\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Deschis </strong> Google Chrome, încercați să vizualizați un videoclip YouTube. </p> <h6></h6> <h6> Alte soluții pentru rezolvarea problemei „Videoclipurile YouTube nu se deschid în Chrome”. </h6> <blockquote><p><strong> 1. </strong> Actualizați Google Chrome. (Din meniul Chrome <img src=\"images/image_thumb-78-732.png\" alt=\"image\" loading=\"lazy\"> clic <strong> Ajutor </strong> și apoi selectați <strong> Despre Google Chrome </strong> .) </p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Verificați computerul pentru viruși, programe malware etc. </a></p> <p><strong> 3. </strong> Actualizați driverele adaptorului de afișare. </p> <p><strong> 4. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Dezinstalați complet și reinstalați Chrome </a> . </p> <p><strong> 5. </strong> Folosiți un alt browser web. </p></blockquote> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}