{"title":"REMEDIERE: Eroare inteligentă HP - Stare imprimantă necunoscută (rezolvată)","content":"<p> Acest tutorial conține instrucțiuni pentru rezolvarea <a href=\"https://www.hpsmart.com/us/en\" target=\"_blank\" rel=\"nofollow noopener\"> HP Smart </a> eroare de aplicație „Stare imprimantă necunoscută” pe sistemul de operare Windows 10. „Starea imprimantei necunoscută” din aplicația HP SMART, poate apărea din motive necunoscute și împiedică utilizatorul să utilizeze funcția Scanare sau Imprimare de pe imprimantă. </p> <p> Problemă în detalii: Pe un computer Windows 10 cu o imprimantă HP instalată, eroarea „Stare necunoscută a imprimantei” apare în aplicația HP Smart, în ciuda faptului că imprimanta imprimă fără probleme de pe Web sau alte aplicații. Principala problemă cu această eroare este că utilizatorul nu poate utiliza opțiunea SCAN din aplicația HP Smart pentru a scana un document. </p> <p> </p> <p> </p> <p><img src=\"images/image_thumb-23-787.png\" alt=\"FIX: HP Smart \" printer status unknown loading=\"lazy\"></p> <h4> REPARARE: „Stare imprimantă necunoscută” pe HP Smart App. (Windows 10). </h4> <p> 1. Din meniul Start <img src=\"images/image_thumb2_thumb_thumb-697.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> faceți clic pe Setări <img src=\"images/image_thumb-66-822.png\" alt=\"image\" loading=\"lazy\"> și apoi deschideți <strong> Aplicații </strong> . </p> <p><img src=\"images/image_thumb-25-257.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Faceți clic pe <strong> Aplicația HP Smart </strong> și apoi faceți clic pe <strong> Opțiuni avansate </strong> . </p> <p><img src=\"images/image_thumb-26-912.png\" alt=\"FIX: Printer Status unknown on HP Smart app\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Faceți clic pe <strong> Resetați </strong> buton. </p> <p><img src=\"images/image_thumb-27-494.png\" alt=\"Fix Printer Status Unknow on HP Smart app\" loading=\"lazy\"></p> <p> 4. Când Resetarea este finalizată, închideți toate ferestrele și deschideți <strong> HP Smart </strong> aplicație. <br> 5. În mod normal, eroarea „Stare imprimantă necunoscută” ar trebui rezolvată. Doar faceți clic pe <strong> Înființat </strong> pentru a activa toate funcțiile HP Smart și ați terminat! * </p> <p><img src=\"images/image_thumb-28-849.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Notă: Dacă eroarea HP Smart „Printer Status unknown” persistă, atunci încercați următoarele: </p> <blockquote><p> 1. <strong> Închide </strong> calculatorul. <br> 2. <strong> Deconectat </strong> <strong> cablul de alimentare de la imprimantă </strong> timp de 1 minut. <br> 3. După 1 minut, <strong> aprinde </strong> ta <strong> calculator </strong> . <br> 4. După pornirea în Windows 10, <strong> reconectați cablul de alimentare al imprimantei </strong> și verificați dacă eroarea „Stare imprimantă necunoscută” din aplicația HP Smart este rezolvată. Dacă eroarea persistă, procedați la dezinstalarea și reinstalarea imprimantei și a software-ului imprimantei pe computer. </p></blockquote> <p> Asta-i tot oameni buni! Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}