{"title":"REMEDIERE: Nu putem instala Office din cauza Office 16 Faceți clic pentru a rula înregistrarea componentelor de extensibilitate. (Rezolvat)","content":"<p> Dacă nu puteți instala Office din cauza instalării „Office 16 Click to Run Extensibility Component Registration”, continuați să citiți acest tutorial, care conține instrucțiuni detaliate pentru a rezolva următoarele probleme de instalare Office: </p> <p><strong> Problema nr. 1: </strong> Când încercați să instalați o versiune pe 32 de biți a Microsoft Office, primiți eroarea: <br> <em> „Nu putem instala versiunea pe 32 de biți a Office deoarece am găsit următoarele programe pe 64 de biți pe computerul dvs.: <br> Office 16 Înregistrare pe 64 de biți a componentei de extensie Click-to-Run <br> Vă rugăm să dezinstalați toate programele Office pe 64 de biți, apoi reîncercați să instalați Office pe 32 de biți. Dacă doriți să instalați Office pe 64 de biți, rulați configurarea pe 64 de biți. &quot; </em></p> <p><img src=\"images/image_thumb-6-215.png\" alt=\"FIX: We can't Install Office because of Office 16 Click to Run Extensibility Component Registration\" loading=\"lazy\"></p> <p> </p> <p><strong> Problema nr. 2 </strong> : Când încercați să instalați o versiune pe 64 de biți a Microsoft Office, primiți eroarea: <br> <em> „Nu putem instala versiunea pe 64 de biți a Office deoarece am găsit următoarele programe pe 32 de biți pe computerul dvs.: <br> <em> Office 16 Click-to-Run Extensibility Component Înregistrare pe 32 de biți <br> <em> Vă rugăm să dezinstalați toate programele Office pe 32 de biți, apoi reîncercați să instalați Office pe 64 de biți. Dacă doriți să instalați în schimb Office pe 32 de biți, rulați configurarea pe 32 de biți. &quot; </em></em></em></p> <p> </p> <h2> Cum se remediază: Nu putem instala această versiune de Office deoarece am găsit următoarele programe pe computerul dvs.: Office 16 Click-to-Run Extensibility Component 32-bit Registration. </h2> <p> 1. Apăsați <strong> Windows </strong> <img src=\"images/image_thumb41-277.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați <strong> instalator </strong> și apăsați <strong> introduce </strong> pentru a naviga la folderul „C: \\ Windows \\ Installer”. </p> <p><img src=\"images/image_thumb-7-594.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Din <strong> Vedere </strong> meniu, faceți clic pe <strong> Adăugați coloane </strong> și apoi faceți clic pe <strong> Alege coloane </strong></p> <p><img src=\"images/image_thumb-8-367.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Verifica </strong> <strong> Subiect </strong> și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-9-532.png\" alt=\"image\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-43.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 5. Sortați rezultatele după subiect și apoi derulați în jos până când localizați „ <em> Componenta Office Extensibility Click-to-Run Office 16 &quot; </em> care este menționat în mesajul de eroare de configurare Office. </p> <p><img src=\"images/image_thumb-10-106.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Când îl găsiți, faceți clic dreapta pe el și alegeți <strong> Dezinstalați </strong> . </p> <p><img src=\"images/image_thumb-11-389.png\" alt=\"Remove office Click to Run installer\" loading=\"lazy\"></p> <p> 7. Când dezinstalarea este finalizată, procedați la instalarea din nou a Microsoft Office. * </p> <p> * Notă: Dacă primiți în continuare aceeași eroare, atunci ... </p> <p> 1. Continuați și dezinstalați toate componentele &quot;Office 16 Click-to-Run&quot; și dacă instalarea eșuează din nou ... <br> 2. Dezinstalați complet Microsoft Office de pe computer, utilizând instrucțiunile din acest document <a href=\"https://www.repairwin.com/fix-couldnt-uninstall-office-365-2016-2013-2010-or-2007/\" target=\"_blank\" rel=\"nofollow noopener\"> tutorial </a> și apoi procedați la reinstalarea Office. </p> <ul> <li> <p> Articol asociat:: <a href=\"https://www.repairwin.com/fix-couldnt-uninstall-office-365-2016-2013-2010-or-2007/\" target=\"_blank\" rel=\"noopener noreferrer\"> FIX: Nu se poate dezinstala Office 365, 2016, 2013, 2010 sau 2007. </a></p> </li> </ul> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți acest lucru. </p>"}