{"title":"REPARAȚI: CORUPȚIA MEMORIEI PISCINE SPECIALE DETECTATE cauzată de ntoskrnl.exe BSOD 0x000000c1 (rezolvat)","content":"<p> Pe un computer bazat pe Windows 10 apare următoarea eroare BSOD: &quot;SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION, cauzată de fișierul ntoskrnl.exe cu codul de eroare 0x000000c1. Eroarea de verificare a erorilor&quot; 0x000000c1 - SPECIAL POOL DETECTED MEMORY CORRUPTION &quot;este de obicei cauzată de un dispozitiv instalat driver și nu se datorează unei probleme hardware. </p> <p><strong> PISCINA SPECIALĂ DETECTATĂ CORUPEREA MEMORIEI, Cod verificare erori 0x000000c1 Eroare BSOD în detalii: </strong><br> &quot; <em> A fost detectată o problemă și Windows a fost închis pentru a preveni deteriorarea <br> pe computer. <br> </em><em> Problema pare să fie cauzată de următorul fișier: ntoskrnl.exe <br> SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION <br> ... .. <br> *** STOP: 0x000000c1 (0xfffff30dd554cfc0, 0xfffff30dd554c22c, 0x0000000000034038, <br> 0x0000000000000032) </em></p> <p><em> *** ntoskrnl.exe - Adresa 0xfffff803c544aca0 bază la 0xfffff803c52a2000 DateStamp <br> 0x5b63c7b5 &quot; </em></p> <p><img src=\"images/image_thumb-1-562.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Acest tutorial conține instrucțiuni detaliate pentru rezolvarea erorii de ecran albastru 0x000000c1 - CORUPȚIE SPECIALĂ DE MEMORIE DETECTATĂ PISCINĂ cauzată de fișierul „ntoskrnl.exe”. </p> <p> </p> <h2> Cum se remediază STOP 0x000000C1: CORUPȚIE DE MEMORIE PISCINĂ SPECIALĂ DETECTATĂ CAUZATĂ DE NTOSKENL.EXE. </h2> <p> Problema ecranului albastru „Stop 0x000000C1: CORUPȚIE DE MEMORIE DETECTATĂ PISCINĂ SPECIALĂ” poate fi cauzată din mai multe motive, de ex. drivere de dispozitiv defecte, fișiere de sistem corupte, atacuri de viruși sau dintr-un program care rulează pe fundal. Pentru a remedia problema, urmați metodele de mai jos: </p> <h6> Metoda 1. Scanați-vă sistemul pentru viruși și programe malware. </h6> <p> Primul pas pentru a rezolva problemele de pe ecranul albastru „SPECIAL POOL DETECTED MEMORY CORRUPTION” este să vă asigurați că sistemul dvs. nu conține viruși / malware. Pentru acea sarcină, urmați instrucțiunile din acest ghid: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să vă scanați computerul pentru viruși și alte programe malware. </a></p> <p> </p> <h6> Metoda 2. Dezinstalați software-ul antivirus / securitate. </h6> <p> Problema ecranului albastru „SPECIAL POOL DETECTED MEMORY CORRUPTION” poate fi cauzată după actualizarea automată a programului dvs. Antivirus / Security (mai ales dacă utilizați AVAST sau AVG). reporniți computerul. <br> - Dacă problema BSOD nu apare după eliminarea antivirusului, continuați să descărcați și să reinstalați cea mai recentă versiune a software-ului de securitate pe sistemul dvs. </p> <p> </p> <h6> Metoda 3. Porniți Windows în starea de pornire curată. </h6> <p> Următoarea metodă, pentru a rezolva problema BSOD „SPECIAL POOL DETECTED MEMORY CORRUPTION”, este să porniți Windows într-un <a href=\"https://www.repairwin.com/how-to-start-windows-in-clean-boot-state/\" target=\"_blank\" rel=\"nofollow noopener\"> „cizmă curată </a> &quot;state, pentru a identifica ce program determină blocarea sistemului dumneavoastră. </p> <p> Pentru a porni Windows în starea Clean Boot: </p> <p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-465.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați <strong> msconfig </strong> și apăsați <strong> introduce </strong> . </p> <p><img src=\"images/image_thumb-47-632.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. În fila Servicii, <strong> Ascunde toate serviciile Microsoft </strong> caseta de selectare și apoi apăsați pe <strong> Dezactivați toate </strong> , pentru a împiedica toate serviciile care nu sunt Microsoft să pornească la pornirea Windows. </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-480.png\" alt=\"clean boot state\" loading=\"lazy\"></p> <p> 4. Apoi selectați <strong> Lansare </strong> filă și <strong> Dezactivează </strong> toate celelalte programe care pornesc în timpul pornirii Windows și rulează pe fundal. * </p> <p> * Notă: Activat <strong> Windows 10 </strong> sau <strong> 8 </strong> , Selectați <strong> Deschideți Managerul de activități </strong> pentru a dezactiva programele de pornire. </p> <p><img src=\"images/image_thumb-29-570.png\" alt=\"Windows clean boot\" loading=\"lazy\"></p> <p> </p> <p> 5. Când ați terminat, faceți clic pe <strong> O.K </strong> și <strong> Repornire </strong> computerul tau. <br> 6. Dacă după repornire, computerul dvs. funcționează bine și fără probleme BSOD, lansați din nou utilitarul Configurare sistem și activați rând pe rând toate elementele dezactivate și reporniți sistemul, până când aflați care cauzează problema BSoD. * </p> <p> * Notă: Către <strong> Ieșire </strong> din <strong> Cizmă curată </strong> , lansați utilitarul Configurare sistem și la <strong> General </strong> Fila alege <strong> Pornire normală. </strong></p> <p> </p> <h6> Metoda 4. Verificați dacă există memorie (RAM) și hard disk (HDD). </h6> <p> Problemele ecranului albastru se pot datora unui modul RAM deteriorat sau a unui hard disk defect. Pentru a testa și a diagnostica componentele RAM și HDD pentru probleme, urmați instrucțiunile din aceste ghiduri: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să diagnosticați problemele de memorie ale computerului cu Memtest86 + </a></li> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Cele mai bune instrumente de testare și diagnosticare a hard diskului pentru a verifica starea de sănătate a hard diskului </a></li> </ul> <p> </p> <p> </p> <h6> Metoda 5. Actualizați driverele de dispozitiv. </h6> <p> În unele cazuri, problema BSOD „SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION cauzată de modulul ntoskrnl.exe”, apare din cauza unui driver de dispozitiv nevalid sau corupt. Deci, continuați și actualizați driverele următoarelor dispozitive de pe computerul dvs. cu această comandă: </p> <p> 1. Adaptor video (VGA). <br> 2. Chipset. <br> 3. Adaptor Ethernet. <br> 4. Adaptor Wi-Fi (dacă există). </p> <p> </p> <h6> Metoda 6. <strong> Analizați Minidump. </strong></h6> <p> Când Windows se blochează cu un ecran albastru, stochează detaliile ecranului BSoD în fișierele mici, care se numesc „ <strong> MiniDump </strong> &quot;. Analiza <strong> Minidump </strong> fișierele vă pot ajuta să depanați și să rezolvați problema ecranului albastru. Pentru a realiza această sarcină, urmați instrucțiunile din acest articol: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se analizează fișiere MiniDump cu BlueScreenView </a> . </p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}