{"title":"REPARARE: folderul DRAFTS Outlook lipsește din panoul de navigare în Outlook 2013, 2010 sau 2007. (Rezolvat)","content":"<p> Următoarea problemă a apărut la unul dintre clienții mei: dintr-o dată și fără un motiv evident, folderul Schițe lipsește din panoul de navigare din Outlook 2013. Prima acțiune pentru a restabili folderul Schițe lipsă este să căutați în toate celelalte foldere Outlook pentru a face asigurați-vă că folderul nu a fost mutat sau șters din greșeală. Dacă totuși nu găsiți folderul lipsă, continuați mai jos pentru a remedia problema. </p> <p><img src=\"images/image_thumb-37-460.png\" alt=\"Drafts folder Missing Outlook\" loading=\"lazy\"></p> <p> </p> <p> Acest tutorial conține instrucțiuni despre cum să restaurați un folder lipsă în Outlook 2007, 2010, 2013, 2016 sau 365. </p> <h4> Cum se restabilește un dosar lipsă din panoul de navigare Outlook. </h4> <h6> Metoda 1. Scanați-vă sistemul pentru viruși și programe malware. </h6> <p> Primul pas pentru a rezolva problema „folderelor lipsă” din Outlook este să vă asigurați că sistemul dvs. nu conține viruși / programe malware. Pentru acea sarcină, urmați instrucțiunile din acest ghid: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să vă scanați computerul pentru viruși și alte programe malware. </a></p> <p> </p> <h6> Metoda 2. RESETARE dosarele Outlook. </h6> <p> După scanarea antivirus, continuați și resetați folderele Outlook la valorile implicite utilizând procesul de mai jos: </p> <p> 1. Închideți aplicația Outlook. <br> 2. Apăsați tasta <strong> Windows </strong> <img src=\"images/image_thumb8_thumb_thumb-622.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 3. În caseta Căutare, tastați: <strong> outlook / resetare dosare </strong> &amp; faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-36-732.png\" alt=\"outlook reset folders\" loading=\"lazy\"></p> <p> </p> <p> 4. Outlook se va deschide și toate folderele lipsă vor fi recuperate. </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? </p> <p> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți acest lucru. </p>"}