{"title":"REPARARE: Adobe Reader DC - Salvare ca este gol (rezolvat)","content":"<p> După o actualizare automată Adobe Reader DC, a apărut următoarea problemă: Funcția „Salvare ca” afișează o fereastră goală (goală) (goală) care nu permite utilizatorului să salveze documentul PDF. </p> <p><img src=\"images/image_thumb-38-290.png\" alt=\"Adobe Reader DC - Save As is blank - fix\" loading=\"lazy\"></p> <p> Acest tutorial conține instrucțiuni pentru rezolvarea următoarei probleme: caracteristica „Salvare ca”, nu funcționează în Adobe Reader DC în Windows sau MAC OS. </p> <h4> Cum se remediază: Salvare ca este necompletat în Adobe Reader DC. </h4> <h6> Metoda 1. Scanați-vă sistemul pentru viruși și programe malware. </h6> <p> Primul pas pentru a rezolva problema „folderelor lipsă” din Outlook este să vă asigurați că sistemul dvs. nu conține viruși / programe malware. Pentru acea sarcină, urmați instrucțiunile din acest ghid: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să vă scanați computerul pentru viruși și alte programe malware. </a></p> <p> </p> <h6> Metoda 2. Dezactivați stocarea online atunci când salvați fișiere. </h6> <p> 1. De la Adobe Reader DC <strong> Editați | × </strong> faceți clic pe meniu <strong> Preferințe </strong> . </p> <p><img src=\"images/image_thumb-39-749.png\" alt=\"save as not working fix in Adobe Reader DC\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Debifează </strong> <strong> Afișați spațiul de stocare online atunci când salvați fișiere </strong> și faceți clic pe <strong> O.K. * </strong></p> <p> * Notă: opțional, debifați și caracteristica „Afișați spațiul de stocare online la deschiderea fișierelor”. </p> <p><img src=\"images/image_thumb-40-312.png\" alt=\"save as blank - abobe reader DC - fix\" loading=\"lazy\"></p> <p> </p> <p> 3. Încercați acum să utilizați caracteristica Salvați ca în Adobe DC. Problema trebuie rezolvată. </p> <p> </p> <h6> Metoda 3. Dezinstalați și reinstalați Adobe Reader DC. </h6> <p> Metoda finală pentru a rezolva ferestrele necompletate din funcția „Salvați ca” din Adobe DC este să dezinstalați complet Adobe Reader DC și apoi să descărcați și să reinstalați ultima versiune a programului de la <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> Aici </a> . </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți acest lucru. </p>"}