{"title":"REMEDIERE: Nu s-a putut transmite în flux eroarea Office în timpul instalării sau dezinstalării Office. (Rezolvat)","content":"<p> În acest ghid veți găsi instrucțiuni pas cu pas pentru a rezolva eroarea „Nu s-a putut transmite în flux Office” atunci când încercați să actualizați, instalați sau dezinstalați Office 2013, Office 2016, Office 2019 sau Office 365 pe un computer Windows. </p> <p> Problemă în detalii: Când încercați să actualizați, instalați sau eliminați Office 365, 2016 sau 2013, utilizând „ <em> Program și caracteristici </em> &quot;opțiunea din Panoul de control, primiți următorul mesaj de eroare:&quot; <em> Nu s-a putut transmite în flux Office. Ne pare rău, am întâmpinat o problemă în legătură cu transmiterea Office. Vă rugăm să încercați din nou mai târziu. Coduri de eroare: 30015-25 (1006) sau 30182-1 (2) sau 30183-39 (-2147014790) sau cod de eroare 30179-25). </em></p> <p><img src=\"images/image_thumb-4-575.png\" alt=\"Couldn't Stream Office error \" loading=\"lazy\"></p> <p> </p> <h4> Cum se remediază: nu s-a putut transmite în flux Office 2013, 2016, 2019 sau 365. </h4> <p> * Important: mesajul de eroare „Nu s-a putut transmite în flux Office” poate apărea din următoarele motive: </p> <ol> <li> <ol> <li> Programul dvs. antivirus / firewall poate împiedica conectarea la serverele Microsoft la Update Office. </li> <li> Este posibil să rămâneți fără spațiu pe disc. </li> </ol> </li> </ol> <p> Deci, înainte de a continua cu metoda de mai jos, încercați următoarele înainte de a instala, dezinstala sau actualiza Office: </p> <ol> <li> <ol> <li> Dezactivați (sau dezinstalați complet) programul dvs. Antivirus / Firewall. </li> <li> Eliberați spațiu pe hard disk și apoi încercați să reinstalați sau să actualizați Office. </li> </ol> </li> </ol> <p> Dacă după ce ați încercat cele de mai sus, vă confruntați cu eroarea „Nu s-a putut transmite în flux Office”, continuați și eliminați complet și reinstalați Office. Pentru a face asta: </p> <p> 1. Descărcați fișierul <a href=\"https://aka.ms/SaRA-officeUninstallFromPC\" target=\"_blank\" rel=\"nofollow noopener\"> Dezinstalați instrumentul de asistență Microsoft Office </a> . <br> 2. Când descărcarea este finalizată, faceți dublu clic pentru a rula „SetupProd_OffScrub.exe”. <br> 3. Faceți clic pe <strong> Instalare </strong> pentru a instala „Asistentul de asistență și recuperare Microsoft”. </p> <p><img src=\"images/image_thumb-5-986.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Când instalarea este finalizată, faceți clic pe <strong> De acord </strong> și apoi faceți clic pe <strong> Da. </strong></p> <p><img src=\"images/image_thumb-6-745.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Așteptați până când „Asistentul de asistență și recuperare Microsoft” rezolvă problema. <br> 6. Bifați caseta de selectare din partea stângă a numelui produsului Office pentru <strong> selectați toate produsele Office instalate </strong> și faceți clic pe <strong> Următorul </strong> . </p> <p><img src=\"images/image_thumb-7-956.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Acum așteptați până când procesul de eliminare Office este finalizat și când se termină acest lucru, <strong> repornire </strong> computerul tau. <br> 8. După repornire, continuați și reinstalați Office urmând instrucțiunile din aceste legături: </p> <ul> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Office 365 </a></li> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Office 2019 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Office 2016 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Office 2013 </a></li> </ul> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}