{"title":"REMEDIERE: computerul nu s-a putut conecta la o altă sesiune de consolă, deoarece aveți deja o sesiune de consolă în desfășurare. (Rezolvat)","content":"<p> Pe un computer bazat pe Windows, apare următoarea eroare în Conexiune desktop la distanță: „Computerul nu s-a putut conecta la sesiunea consolă de pe computerul la distanță, deoarece aveți deja o sesiune consolă în desfășurare”. </p> <p> </p> <p><img src=\"images/image_thumb-3-627.png\" alt=\"Your computer could no connect to console session on the remote computer because you already have a console session in progress.\" loading=\"lazy\"></p> <p> </p> <p> Acest tutorial conține instrucțiuni pentru rezolvarea următoarei erori de conexiune la desktop la distanță: „Computerul nu s-a putut conecta la sesiunea consolă de pe computerul la distanță, deoarece aveți deja o sesiune consolă în desfășurare”. </p> <h4> Cum se remediază: Conexiunea desktopului la distanță nu s-a putut conecta, deoarece aveți deja o sesiune de consolă în curs. </h4> <p> Eroarea „Computerul dvs. nu s-a putut conecta la sesiunea consolă de pe computerul la distanță, deoarece aveți deja o sesiune consolă în desfășurare”, este cauzată de faptul că unul dintre adaptoarele de rețea de pe computerul dvs. (RDP de la), are aceeași adresă IP cu computerul la care încercați să vă conectați, prin desktopul la distanță. </p> <p> De exemplu: dacă computerul la distanță are adresa IP: „192.168.1.157”, urmați pașii de mai jos: </p> <p> 1. Deschideți <strong> Prompt comandă ca administrator </strong> pe computer (RDP de la). <br> 2. Dați următoarea comandă pentru a vizualiza adresele IPv4 atribuite pe computer. </p> <ul> <li><strong> ipconfig </strong></li> </ul> <p> </p> <p> 3. Acum găsiți ce adaptor de rețea de pe computerul dvs. local (RDP de la), are aceeași adresă IP ca și computerul la distanță (RDP către). <br> 4. Când găsiți care adaptor LAN de pe computerul dvs. local, are aceeași adresă IP cu computerul la distanță, continuați și schimbați adresa IP a adaptorului respectiv cu una diferită. * </p> <p> de exemplu. În acest exemplu, adresa IP a computerului la distanță este: „192.168.1.157”, deci trebuie să schimbăm adresa IP a adaptorului Ethernet (pe computerul local), cu una diferită: de ex. la: „192.168.1.160”. </p> <p><img src=\"images/image_thumb-5-946.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> * Notă: Dacă adresa IP din rețeaua dvs. locală este atribuită de un server DHCP, atunci aveți următoarele opțiuni pentru a ocoli problema: </p> <blockquote><p> A. Pentru a specifica manual o altă adresă IP statică. <br> b. Pentru a reporni routerul (server DHCP), pentru a „lua” o altă adresă IP de la serverul DHCP. <br> c. Pentru a configura serverul DHCP (de ex. Pe router), pentru a da adrese IP unui interval care nu include adresa IP a computerului la distanță. (de ex. &quot;192.168.1.200-192.168.1.250&quot; </p></blockquote> <p> </p> <p> 5. După ce ați schimbat adresa IP de pe computerul dvs. local (RDP din), deschideți conexiunea Desktop la distanță și încercați să vă conectați la computerul la distanță. Eroarea „Computerul dvs. nu s-a putut conecta la o altă sesiune de consolă deoarece aveți deja o sesiune de consolă în desfășurare” ar trebui rezolvată. </p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? </p> <p> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}