{"title":"REPARAȚI: EROARE BSOD DPC WATCHDOG VIOLATION. (Rezolvat)","content":"<p> Pe un computer bazat pe Windows 10, 8 sau 7, poate apărea următoarea eroare BSOD: &quot;DPC_WATCHDOG_VIOLATION&quot;. Problema ecranului albastru „DPC WATCHDOG VIOLATION” a apărut de obicei ocazional, chiar dacă sistemul este inactiv și este cauzat în mod obișnuit de un driver de dispozitiv invalid sau deteriorat și în alte cazuri este legat de probleme hardware, în special cu placa grafică. </p> <p><img src=\"images/image_thumb-2-618.png\" alt=\"FIX DPC WATCHDOG VIOLATION BLUE SCREEN ERROR\" loading=\"lazy\"></p> <p> </p> <p> Acest ghid de depanare conține mai multe metode de rezolvare a <strong> ÎNCĂLCAREA DOG WATCHDOG </strong> Problemă BSOD pe sistemul de operare Windows 10, 8 / 8.1 sau 7. </p> <p> </p> <h2> Cum să remediați problema BoSD DPC WATCHDOG VIOLATION BoSD pe Windows 10/8/7. </h2> <p> Problema ecranului albastru DPC WATCHDOG VIOLATION poate fi cauzată din mai multe motive, de ex. driverele de dispozitiv sau software defecte, memoria RAM sau unitatea de disc, etc. Deci, pentru a rezolva problema BSOD „DPC WATCHDOG VIOLATION”, urmați pașii de mai jos: </p> <h6> Metoda 1. Scanați-vă sistemul pentru viruși și programe malware. </h6> <p> Primul pas pentru a rezolva problema ecranului albastru „DPC WATCHDOG VIOLATION” este să vă asigurați că sistemul dvs. nu conține viruși / programe malware. Pentru acea sarcină, urmați instrucțiunile din acest ghid: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să vă scanați computerul pentru viruși și alte programe malware. </a></p> <p> </p> <h6> Metoda 2. Dezinstalați software-ul antivirus / securitate. </h6> <p> Problema ecranului albastru „DPC WATCHDOG VIOLATION”, cauzată după actualizarea automată a programului dvs. Antivirus / Security (mai ales dacă utilizați AVAST sau AVG). Deci, continuați și dezinstalați complet programul antivirus din sistem și reporniți computerul. <br> - Dacă problema BSOD nu apare după eliminarea antivirusului, continuați să descărcați și să reinstalați cea mai recentă versiune a software-ului de securitate pe sistemul dvs. </p> <p> </p> <h6> Metoda 3. Porniți Windows în starea de pornire curată. </h6> <p> Următoarea metodă, pentru a rezolva problema BSOD „DPC WATCHDOG VIOLATION”, este să porniți Windows într-un <a href=\"https://www.repairwin.com/how-to-start-windows-in-clean-boot-state/\" target=\"_blank\" rel=\"nofollow noopener\"> „cizmă curată </a> &quot;state, pentru a identifica ce program determină blocarea sistemului dumneavoastră. </p> <p> Pentru a porni Windows în starea Clean Boot: </p> <p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați <strong> msconfig </strong> și apăsați <strong> introduce </strong> . </p> <p><img src=\"images/image_thumb-47-307.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. În fila Servicii, <strong> Ascunde toate serviciile Microsoft </strong> caseta de selectare și apoi apăsați pe <strong> Dezactivați toate </strong> , pentru a împiedica toate serviciile care nu sunt Microsoft să pornească la pornirea Windows. </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-257.png\" alt=\"clean boot state\" loading=\"lazy\"></p> <p> 4. Apoi selectați <strong> Lansare </strong> filă și <strong> Dezactivează </strong> toate celelalte programe care pornesc în timpul pornirii Windows și rulează pe fundal. * </p> <p> * Notă: Activat <strong> Windows 10 </strong> sau <strong> 8 </strong> , Selectați <strong> Deschideți Managerul de activități </strong> pentru a dezactiva programele de pornire. </p> <p><img src=\"images/image_thumb-29-129.png\" alt=\"Windows clean boot\" loading=\"lazy\"></p> <p> </p> <p> 5. Când ați terminat, faceți clic pe <strong> O.K </strong> și <strong> Repornire </strong> computerul tau. <br> 6. Dacă după repornire, computerul dvs. funcționează bine și fără probleme BSOD, lansați din nou utilitarul Configurare sistem și activați rând pe rând toate elementele dezactivate și reporniți sistemul, până când aflați care cauzează problema BSoD. * </p> <p> * Notă: Către <strong> Ieșire </strong> din <strong> Cizmă curată </strong> , lansați utilitarul Configurare sistem și la <strong> General </strong> Fila alege <strong> Pornire normală. </strong></p> <p> </p> <h6> Metoda 4. Verificați dacă există memorie (RAM) și hard disk (HDD). </h6> <p> Problemele ecranului albastru se pot datora unui modul RAM deteriorat sau a unui hard disk defect. Pentru a testa și a diagnostica componentele RAM și HDD pentru probleme, urmați instrucțiunile din aceste ghiduri: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să diagnosticați problemele de memorie ale computerului cu Memtest86 + </a></li> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Cele mai bune instrumente de testare și diagnosticare a hard diskului pentru a verifica starea de sănătate a hard diskului </a></li> </ul> <p> </p> <p> </p> <h6> Metoda 5. Actualizați driverele de afișare și de rețea. </h6> <p> În unele cazuri, problema BSOD „DPC WATCHDOG VIOLATION”, apare din cauza unui driver de dispozitiv invalid sau deteriorat. Deci, continuați și actualizați driverele următoarelor dispozitive de pe computer: * </p> <p> 1. Adaptor grafic (VGA). <br> 2. Adaptor Ethernet și adaptor Wi-Fi (dacă există). </p> <p> * Note: <br> 1. dacă problema BSOD persistă, după actualizarea driverelor de mai sus, continuați și actualizați toate celelalte drivere din sistemul dvs. (chipset, drivere audio etc.). <br> 2. În unele cazuri, eroarea „DPC_WATCHDOG_VIOLATION” poate apărea dacă aveți un SSD (Solid State Drive). Deci, dacă dețineți o unitate SSD, continuați și actualizați firmware-ul de pe unitate. Pentru instrucțiuni despre actualizarea firmware-ului SSD, consultați site-ul web al producătorului SSD. </p> <p> </p> <h6> Metoda 6. Actualizați driverul iaStor.sys. </h6> <p> 1. Navigați la Device Manager. <br> 2. Extindeți controlerele IDE ATA / ATAPI. <br> 3. Faceți dublu clic pe <strong> Controler SATA / AHCI </strong> . </p> <p><img src=\"images/image_thumb-3-252.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Selectați <strong> Conducător auto </strong> fila și faceți clic pe <strong> Detaliile șoferului </strong> . </p> <p><img src=\"images/image_thumb-4-105.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Dacă utilizați <strong> driverul iaStor.sys </strong> , apoi apasa <strong> O.K </strong> și continuați să schimbați driverul așa cum se menționează mai jos, în caz contrar săriți pașii de rest. </p> <p><img src=\"images/image_thumb-5-421.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Faceți clic pe <strong> Actualizați driver-ul </strong> . </p> <p><img src=\"images/image_thumb-6-840.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Selectați <strong> Răsfoiți computerul pentru software-ul driverului </strong> . </p> <p><img src=\"images/image_thumb-7-251.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Faceți clic pe <strong> Permiteți-mi să aleg dintr-o listă de drivere de dispozitiv de pe computer </strong> . </p> <p><img src=\"images/image_thumb-8-330.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Evidențiați <strong> Controler SATA AHCI standard </strong> și faceți clic pe <strong> Următorul </strong> . <br> 10. Când se finalizează instalarea driverului, <strong> închide </strong> toate ferestrele deschise și <strong> repornire </strong> computerul tau. </p> <p> </p> <h6> Metoda 7. <strong> Analizați Minidump. </strong></h6> <p> Când Windows se blochează cu un ecran albastru, stochează detaliile ecranului BSoD în fișierele mici, care se numesc „ <strong> MiniDump </strong> &quot;. Analiza <strong> Minidump </strong> fișierele vă pot ajuta să depanați și să rezolvați problema ecranului albastru. Pentru a realiza această sarcină, urmați instrucțiunile din acest articol: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum se analizează fișiere MiniDump cu BlueScreenView </a> . </p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}