{"title":"REZOLVARE: Eroare cod 32 pe CPU Intel - Un driver (serviciu) pentru acest dispozitiv a fost dezactivat. (Rezolvat)","content":"<p> Acest tutorial conține instrucțiuni pentru remedierea codului de eroare Device Manager 32 pe dispozitivul CPU Intel: &quot;Un driver (serviciu) pentru acest dispozitiv a fost dezactivat. Un driver alternativ poate furniza această funcționalitate. (Cod 32)&quot; </p> <p><img src=\"images/image_thumb-21-979.png\" alt=\"FIX Code 32 on Intel CPU - A driver (service) for this device has been disabled\" loading=\"lazy\"></p> <p> </p> <p> Eroarea „Cod 32” din managerul de dispozitiv indică de obicei o problemă hardware pe dispozitiv sau o problemă în driverul dispozitivului. Pentru a rezolva eroarea „Un driver (serviciu) pentru acest dispozitiv a fost dezactivat” în dispozitivul CPU Intel, urmați instrucțiunile de mai jos. </p> <h4> Cum se remediază: DEVICE MANAGER ERROR CODE 32 pe dispozitivul CPU Intel. * </h4> <p> * Note: <br> 1. Înainte de a continua cu metodele de mai jos, instalați cele mai recente actualizări Windows și instalați cele mai recente drivere Intel Chipset de pe site-ul de asistență al producătorului computerului. <br> 2. Dacă primiți eroarea „Cod 32” pe un computer laptop, încercați să o alimentați cu un alt adaptor de alimentare și verificați dacă eroarea persistă. </p> <h6> Metoda 1. Dezinstalați și reinstalați procesoarele Intel CPU. </h6> <p> 1 Apăsați „ <strong> Windows </strong> „+” <strong> R </strong> &quot;tastele pentru a deschide fereastra RUN. <br> 2. În caseta „RUN” din fereastra „RUN”, tastați: <strong> devmgmt.msc </strong> &amp; Presa <strong> Introduce. </strong></p> <p><img src=\"images/image_thumb-18-504.png\" alt=\"devmgmt.msc\" loading=\"lazy\"></p> <p> </p> <p> 3. În Manager dispozitive extindeți <strong> Procesoare. </strong><br> 4. Faceți clic dreapta pe fiecare dispozitiv CPU Intel și faceți clic <strong> Dezinstalați dispozitivul </strong> . * </p> <p> * Notă: Când vi se solicită „Reporniți computerul”, cereți „Nu” și continuați să dezinstalați toate procesoarele Intel listate. </p> <p><img src=\"images/image_thumb-19-511.png\" alt=\"FIX Code 32 on Intel CPU\" loading=\"lazy\"></p> <p> 5. Când ați terminat, <strong> repornire </strong> computerul și verificați dacă Codul de eroare 32 din managerul de dispozitive a dispărut. </p> <p> </p> <h6> Metoda 2. Activați serviciul Intel Power Management în registru. </h6> <p> Următoarea metodă pentru a rezolva codul de eroare 32 pe procesoarele Intel este să activați serviciul „Intel Power Management” utilizând editorul de registry. Pentru a face asta: </p> <p> 1. Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-871.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. În caseta „Deschidere”, tastați: <strong> regedit </strong> &amp; faceți clic <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb7-820.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Navigați la această cheie din panoul din stânga: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ intelppm </strong></li> </ul> <p> 4. În dreapta, deschideți <strong> start </strong> valoare. <br> 5. Schimbați datele de valoare de la 4 la <strong> 1 </strong> și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-20-525.png\" alt=\"Enable Intel Power Management service in Registry\" loading=\"lazy\"></p> <p> </p> <p> 6. Închideți editorul de registry și <strong> repornire </strong> computerul dvs. </p> <p> Asta e tot! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a vă ajuta să răspândiți această soluție. </p>"}