{"title":"REMEDIERE: Nu se poate schimba tema - Aero Themes Greyed Out în Windows 7 (rezolvat)","content":"<p> Următoarea problemă a apărut într-un computer bazat pe Windows 7: Windows s-a schimbat în tema de bază și utilizatorul nu poate schimba tema deoarece, când sunt deschise setările de personalizare, toate temele aeriene sunt în gri. În loc de asta, toate celelalte setări din panoul de personalizare sunt activate (Fundal desktop, Culoare Windows, Economizor de ecran etc.), așteptați să selectați o altă temă. </p> <p><img src=\"images/image_thumb-28-129.png\" alt=\"Cannot Change Theme – Themes Greyed Out\" loading=\"lazy\"></p> <p> </p> <p> Acest tutorial conține instrucțiuni pentru rezolvarea următoarei probleme în Windows 7: Tema nu poate fi modificată - Teme Greyed Out. </p> <h4> Cum se remediază: nu se poate schimba tema - temele Aero sunt gri. </h4> <h6> Metoda 1. Scanați-vă sistemul pentru viruși și programe malware. </h6> <p> Primul pas pentru a rezolva problema „nu poate schimba tema de bază” este să vă asigurați că sistemul dvs. nu conține viruși / programe malware. Pentru acea sarcină, urmați instrucțiunile din acest ghid: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cum să vă scanați computerul pentru viruși și alte programe malware. </a></p> <h6> Metoda 2. Reporniți serviciul tematic. </h6> <p> 1. Deschideți panoul de control Servicii Windows: Pentru aceasta: </p> <ul> <li> Apăsați Windows <img src=\"images/image_thumb8_thumb_thumb-720.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. </li> <li> În caseta Căutare, tastați: <strong><em> services.msc </em></strong> &amp; faceți clic pe <strong> O.K </strong> . </li> <li> (Acceptați avertismentul UAC dacă apare). </li> </ul> <p><img src=\"images/image_thumb-12-580.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. În panoul de control Servicii faceți clic dreapta pe <strong> Teme </strong> serviciu și alegeți <strong> Repornire </strong> . * </p> <p> * Notă: Dacă serviciul este oprit, faceți clic pe <strong> start </strong> . </p> <p><img src=\"images/image_thumb-29-242.png\" alt=\"Themes Greyed Out - restart theme service\" loading=\"lazy\"></p> <p> </p> <h6> Metoda 3. Activați stilurile vizuale pe ferestre și butoane. </h6> <p> 1. Faceți clic pe <strong> start </strong> , faceți clic dreapta pe <strong> Calculator a </strong> și selectați <strong> Proprietăți </strong> . </p> <p><img src=\"images/image_thumb-30-382.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Faceți clic pe <strong> Setari de sistem avansate </strong> pe stanga. </p> <p><img src=\"images/image_thumb-31-876.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. În fila „Avansat” faceți clic pe <strong> Setări </strong> la secțiunea „Performanță”. </p> <p><img src=\"images/image_thumb-15-696.png\" alt=\"fix High CPU and DISK Usage Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. La <strong> Efecte vizuale </strong> fila, bifați opțiunea „Utilizați stiluri vizuale pe ferestre și butoane” și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-32-631.png\" alt=\"fix Theme cannot be changed - themes greyed out\" loading=\"lazy\"></p> <p> </p> <h6> Metoda 4. Instalați cele mai recente drivere de afișare. </h6> <p><strong> 1. </strong> Navigheaza catre <strong> Panou de control </strong> &gt; <strong> Programe si caracteristici </strong> și <strong> dezinstalați </strong> driverul VGA instalat în prezent. </p> <p><strong> 2. </strong> Când operațiunea de dezinstalare este finalizată <strong> repornire </strong> computerul tau. </p> <p><strong> 3. </strong> După repornire, navigați la site-ul de asistență al producătorului computerului pentru a descărca și instala cele mai recente drivere pentru placa grafică. Dacă dețineți un computer desktop sau laptop * cu o placă AMD / ATI sau NVIDIA VGA, urmați pașii de mai jos pentru a găsi, descărca și instala cea mai recentă versiune de driver pentru cardul dvs. de afișare. </p> <p><strong> * Notă: </strong> Dacă nu găsiți driverele din linkurile de mai jos, accesați site-ul de asistență al producătorului computerului. </p> <p> </p> <p><strong> Pentru GPU-uri bazate pe NVIDIA. </strong></p> <ol> <li> <ol> <li> Mergi la <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Pagina de căutare avansată a driverelor NVIDIA </a> și căutați driverul corespunzător pentru adaptorul de afișaj. </li> <li> În pagina cu rezultatele căutării descărcați o versiune anterioară a driverului. </li> <li> Instalați driverul pe care l-ați descărcat și reporniți computerul. </li> </ol> </li> </ol> <p> </p> <p><strong> Pentru GPU-uri bazate pe AMD. </strong></p> <ul> <li> <ol> <li> Mergi la <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Descărcare driver AMD (ATI) </a> și căutați driverul corespunzător pentru adaptorul de afișaj. </li> <li> În pagina cu rezultatele căutării, apăsați tasta <strong> Drivere și software anterioare </strong> link din dreapta. </li> <li> Instalați driverul pe care l-ați descărcat și reporniți computerul. </li> </ol> </li> </ul> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? <br> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}