{"title":"REPARARE: Outlook a primit eroarea raportată 0x80042108 (rezolvată)","content":"<p> Acest tutorial conține instrucțiuni pas cu pas pentru a remedia eroarea 0x80042108 raportată la primirea Outlook. Eroarea Outlook 0x80042108 apare de obicei atunci când ați tastat incorect numele serverului de e-mail POP3 sau pentru că nu aveți acces la Internet. </p> <p> Problema este detaliile. Outlook 2003, 2007, 2010 sau Outlook 2013 afișează următoarea eroare în timpul procedurii de trimitere-primire: „Primirea erorii raportate (0x80042108): Outlook nu se poate conecta la serverul de e-mail de intrare (POP3). , contactați administratorul serverului sau furnizorul de servicii Internet (ISP) &quot;. </p> <p><img src=\"images/outlookerror_0x80042108-505.png\" alt=\"Outlook Error 0x80042108\" loading=\"lazy\"></p> <p> Eroarea Outlook &quot;0x80042108&quot; poate apărea în orice versiune de Outlook (2016, 2013, 2010 sau 2007) și apare atunci când programul client de e-mail Outlook nu se poate conecta la serverul de e-mail. </p> <h4> Cum se remediază eroarea 0x80042108 în Outlook 2007, 2010, 2013 sau 2016. </h4> <h6> Pasul 1. Verificați conexiunea la internet. </h6> <p> Primul pas pentru a rezolva eroarea de primire a Outlook 80042108 este să vă verificați conectivitatea la internet. Deci, deschideți browserul de internet și vizitați orice site web pentru a vă asigura că conexiunea la internet funcționează. </p> <h6> Pasul 2. Verificați setările POP3 Mail Server. </h6> <p> Al doilea pas pentru a remedia eroarea de primire Outlook 0x80042108, este să verificați dacă ați specificat setările corecte ale serverului de e-mail. Așadar, contactați furnizorul de e-mail și verificați împreună cu acesta că ați introdus corect numele serverului de e-mail primit și numărul portului. Pentru a vizualiza și modifica setările serverului de e-mail: </p> <p> 1. Deschideți Outlook. <br> 2. Accesați <strong> Fişier </strong> -&gt; <strong> Setările contului </strong> . </p> <p><img src=\"images/image_thumb-7-811.png\" alt=\"switch Account Mail Merge \" loading=\"lazy\"></p> <p> </p> <p> 3. În <strong> E-mail </strong> , faceți dublu clic pe contul dvs. de e-mail, pentru a modifica / vizualiza setările acestuia. <br> 4. Verificați dacă ați setat numele corect al serverului de poștă primită în caseta corespunzătoare. <br> 5. Când ați terminat, faceți clic pe <strong> Mai multe setari </strong> . </p> <p><img src=\"images/image_thumb-31-256.png\" alt=\"FIX: Outlook Receiving reported error 0x80042108\" loading=\"lazy\"></p> <blockquote><p> </p></blockquote> <p> 6. Faceți clic pe <strong> Avansat </strong> fila și verificați dacă ați specificat portul corect și setarea SSL pentru serverul de intrare (POP3). </p> <p> </p> <p><img src=\"images/image_thumb-33-400.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Când ați terminat, faceți clic <strong> O.K </strong> și apoi închideți toate ferestrele deschise. <br> 7. Testați din nou Outlook. </p> <h6></h6> <h6> Pasul 3. Verificați setările antivirus și firewall. </h6> <p> Dacă utilizați un program antivirus cu funcții de scanare a e-mailurilor, atunci <a href=\"https://www.repairwin.com/how-to-disable-add-ins-in-word-outlook-or-excel-2016-2013-2010-2007-or-2003/\" target=\"_blank\" rel=\"nofollow noopener\"> dezactivați programul de completare antivirus în Outlook </a> sau dezactivați temporar protecția antivirus sau dezinstalați programul antivirus. În plus, verificați setările firewall-ului și asigurați-vă că porturile serverului de e-mail pe care le utilizați nu sunt blocate din programul Firewall. Mai precis, la setările firewall: </p> <p> A. Activați următoarele fișiere pentru a accesa Internetul: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Activați următoarele porturi pentru a accesa internetul: </p> <ul> <li><strong> Portul 110 </strong> (Dacă utilizați un server de intrare POP3 fără conexiune criptată) * </li> <li><strong> Portul 995 </strong> (Dacă utilizați un server de poștă primită POP3 cu conexiune criptată (SSL activat) </li> </ul> <ul> <li><strong> Portul 143 </strong> (dacă utilizați un server de poștă electronică de intrare IMAP fără conexiune criptată) </li> <li><strong> Portul 993 </strong> (dacă utilizați un server de poștă electronică de intrare IMAP cu conexiune criptată (SSL activat) </li> </ul> <ul> <li><strong> Portul 25 </strong> Dacă serverul dvs. de poștă electronică SMTP nu utilizează SSL. * </li> <li><strong> Portul 465 </strong> sau <strong> 587 </strong> dacă serverul dvs. de poștă electronică SMTP utilizează SSL </li> </ul> <p> * Notă: implicit, portul 25 este pentru accesul de ieșire, iar portul 110 este pentru accesul de intrare. Dacă nu sunteți sigur de porturi, contactați ISP-ul sau administratorul de sistem. </p> <p> </p> <p><strong> Ajutor suplimentar: </strong> Dacă metodele de mai sus nu vă ajută, atunci încercați următoarele: </p> <p><strong> A. </strong> Eliminați și adăugați din nou contul dvs. de e-mail. <br> <strong> B. </strong><a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Reparați fișierul de date Outlook PST </a> . <br> <strong> C. </strong> Deconectați-vă de la conexiunea VPN (dacă sunteți conectat la) <br> <strong> D. </strong> Reparați instalarea biroului. Pentru a face asta: </p> <blockquote><p> 1. Navigați la Windows <strong> Panou de control </strong> &gt; <strong> Programe si caracteristici </strong> . <br> 2. Găsiți și selectați aplicația MS Office și apoi faceți clic pe <strong> Schimbare </strong> . <br> 3. Apoi selectați <strong> Reparație </strong> opțiune. </p></blockquote> <p> </p> <p> </p> <p> Asta-i tot oameni buni! A funcționat pentru tine? </p> <p> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}