{"title":"REPARARE: Nu este disponibil suficient spațiu de stocare pentru a procesa această comandă - Nu se poate accesa folderele partajate sau nu se poate utiliza desktopul la distanță (rezolvat)","content":"<p> Eroarea „Nu este disponibil suficient spațiu de stocare pentru a procesa această comandă”, poate apărea atunci când încercați să accesați folderele partajate pe o altă stație de lucru Windows sau pe un Server 2003, 2008, 2012 sau 2016 sau când utilizați conexiunea Desktop la distanță (RDP ), pentru a vă conecta la un alt computer Windows (stație de lucru sau server). </p> <p><img src=\"images/image_thumb-127.png\" alt=\"Not enough storage is available to process this command\" loading=\"lazy\"></p> <p> </p> <p> Acest tutorial conține instrucțiuni pentru rezolvarea următoarelor probleme, care pot apărea pe toate versiunile Windows (Windows 10, 8 / 8.1, 7, Vista, XP și Windows Server 2003, 2008, 2012 sau 2016): </p> <p> 1. Când încercați să accesați folderele partajate pe computerul Server, primiți mesajul de eroare: &quot; <em> Folder impartit </em> nu este accesibil. Este posibil să nu aveți permisiunea de a utiliza această resursă de rețea. Contactați administratorul acestui server pentru a afla dacă aveți permisiuni de acces. Nu este disponibilă suficientă stocare pe server pentru a procesa această comandă. &quot; </p> <p> 2. Când încercați să vă conectați de la distanță (folosind RDP) la o altă mașină bazată pe Windows, primiți mesajul de eroare: „Sistemul nu vă poate conecta din următorul motiv. Nu există suficient spațiu de stocare pentru a procesa această comandă”. </p> <h4> CUM SĂ REPARAȚI: mesajul de eroare „Nu există suficient spațiu de stocare pentru a procesa această comandă” în Remote Desktop (RDP) sau când încercați să accesați Folderele partajate. </h4> <p> Pe computerul „server” Windows, pe care doriți să-i accesați fișierele sau să vă conectați de la distanță: </p> <p><strong> 1. </strong> Presa &quot; <strong> Windows </strong> &quot;+&quot; <strong> R </strong> ”Tastele pentru a deschide <em> ALERGA </em> fereastră. <br> <strong> 2. </strong> Tip <strong> regedit </strong> și apăsați <strong> introduce </strong> pentru a deschide Editorul de registru. </p> <p><img src=\"images/image_thumb7-649.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Apoi navigați la această cheie: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ LanmanServer \\ Parameters </strong></li> </ul> <p><img src=\"images/image_thumb-1-198.png\" alt=\"fix Not enough storage - cannot access shared items\" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> În panoul din dreapta faceți dublu clic pentru a deschide fișierul <strong> IRPStackSize </strong> valoare <strong> . * </strong></p> <p><strong> * Notă: </strong> Dacă nu vedeți <strong> IRPStackSize </strong> valoare, apoi: </p> <p> </p> <blockquote><p> 1. Faceți clic dreapta pe un spațiu gol (în panoul din dreapta) și apoi selectați <strong> Nou </strong> -&gt; <strong> Valoare DWORD (32 de biți) </strong></p> <p><img src=\"images/image_thumb-2-236.png\" alt=\"fix Not enough storage using RDP (Remote Desktop)\" loading=\"lazy\"></p> </blockquote> <blockquote><p> 2. Denumiți noua valoare <strong> IRPStackSize </strong> și a lovit <strong> Introduce. </strong></p></blockquote> <p><strong> 5. </strong> Selectați <strong> Zecimal </strong> , schimbați datele de valoare în <strong> 50 </strong> și faceți clic pe <strong> O.K </strong> . * </p> <p> * Notă: Intervalul (în zecimal) pentru parametru este cuprins între 1 și 50. </p> <p><img src=\"images/image_thumb-3-255.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 6. </strong> <strong> Închide </strong> editor de registru și <strong> repornire </strong> server-ul. * </p> <p> * Notă importantă: dacă după repornire, primiți același mesaj de eroare, atunci când utilizați conexiunea Desktop la distanță sau când încercați să accesați fișierele partajate de pe un alt computer, atunci aplicați modificarea de registry de mai sus și computerului dvs. </p> <p> Asta e tot! A funcționat pentru tine? </p> <p> Vă rugăm să lăsați un comentariu în secțiunea de comentarii de mai jos sau chiar mai bine: apreciați și distribuiți această postare de blog în rețelele de socializare pentru a răspândi vestea despre această soluție. </p>"}