{"title":"REPARARE: Conexiunea desktop la distanță Mac OS nu poate verifica identitatea computerului la care doriți să vă conectați. (Rezolvat)","content":"<p> În acest tutorial veți găsi instrucțiuni pentru rezolvarea problemei &quot;Conexiunea de la distanță nu poate verifica identitatea computerului la care doriți să vă conectați. Încercați să vă reconectați la computerul bazat pe Windows sau contactați administratorul nostru.&quot;, Atunci când încercați să conectați-vă prin RDP de la un computer bazat pe Mac OS la un Windows RDSH Server 2016. </p> <p><img src=\"images/image_thumb-32-846.png\" alt=\"FIX: MAC OS Remote Desktop Connection cannot verify the identity of the computer that you want to connect to.\" loading=\"lazy\"></p> <p> </p> <h4> Cum se remediază: conexiunea MacOSX Remote Desktop nu poate verifica identitatea computerului la care doriți să vă conectați. </h4> <h6> Metoda 1. Descărcați cel mai recent client RDP din MAC App Store. </h6> <p> 1. Descărcați și instalați și cele mai recente <a href=\"https://itunes.apple.com/us/app/microsoft-remote-desktop/id715768417?mt=12&ign-mpt=uo%3D4\" target=\"_blank\" rel=\"nofollow noopener\"> Clientul Microsoft Remote Desktop </a> pe MAC. (Dacă utilizați un dispozitiv IOS, descărcați clientul RDP de la <a href=\"https://itunes.apple.com/us/app/microsoft-remote-desktop/id714464092?mt=8&ign-mpt=uo%3D4\" target=\"_blank\" rel=\"nofollow noopener\"> Aici </a> .) <br> 2. După instalare, încercați să vă conectați din nou la Windows RDP Server. Dacă problema persistă, continuați cu metoda-2 de mai jos. </p> <p> </p> <h6> Metoda 2. Modificați setările politicii de grup pe serverul Windows RDSH. </h6> <p> Pe Remote Host Session Host Server (RDSH) 2016, modificați politica de grup după cum urmează: </p> <p> 1. Apăsați simultan Windows <img src=\"images/image_thumb36-211.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> tastele pentru a deschide caseta de comandă run. <br> 2. Tastați <strong> gpedit.msc </strong> &amp; Presa <strong> Introduce. </strong></p> <p><img src=\"images/image_thumb-78-784.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. În panoul din stânga navigați la: </p> <ul> <li><strong> Configurare computer </strong> &gt; <strong> Șabloane administrative </strong> &gt; <strong> Componente Windows </strong> &gt; <strong> Servicii desktop la distanță </strong> &gt; <strong> Gazdă sesiune desktop la distanță </strong> &gt; <strong> Securitate </strong></li> </ul> <p> 4. În panoul din dreapta deschideți <strong> Necesită utilizarea unui strat de securitate specific pentru conexiunile la distanță (RDP) </strong> setare. </p> <p><img src=\"images/image_thumb-36-865.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4a. Verifica <strong> Activat </strong> , setați „Stratul de securitate” la <strong> PDR </strong> și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-37-183.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Acum, deschideți <strong> Solicitați autentificarea utilizatorului pentru conexiunile la distanță utilizând autentificarea la nivel de rețea </strong> setare, setați-o la <strong> Dezactivat </strong> și faceți clic pe <strong> O.K </strong> . </p> <p><img src=\"images/image_thumb-38-109.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Închide </strong> Editorul de politici de grup. <br> 7. <strong> Repornire </strong> computerul să aplice modificări sau să deschidă un prompt de comandă ridicat și să dea următoarea comandă: </p> <ul> <li><strong> gpupdate / forță </strong></li> </ul> <p> Asta este! Ce metodă a funcționat pentru tine? <br> Spuneți-mi dacă acest ghid v-a ajutat lăsând comentariul dvs. despre experiența dvs. Vă rugăm să apreciați și să împărtășiți acest ghid pentru a-i ajuta pe ceilalți. </p>"}