{"title":"Контактная форма 7 не работает: при отправке сообщения произошла ошибка. Пожалуйста, повторите попытку позже. (Решено)","content":"<p> Если контактная форма 7 на вашем сайте WordPress не работает, продолжайте читать ниже, чтобы решить проблему. Контактная форма 7 - один из самых известных бесплатных плагинов WordPress, который помогает вам создавать, управлять и настраивать контактную форму на вашем сайте WordPress. Недавно я обнаружил, что плагин «Контактная форма 7» на моем сайте (и во многих других) перестал работать с ошибкой «При отправке вашего сообщения произошла ошибка. Повторите попытку позже», которая обведена оранжевым прямоугольником. , после отправки формы. </p> <p><img src=\"images/image_thumb-14-729.png\" alt=\"Contact Form 7: There was an error to send your message. Please try again later\" loading=\"lazy\"></p> <p> В этом руководстве содержатся инструкции по исправлению ошибки «При отправке сообщения произошла ошибка. Повторите попытку позже» в оранжевом поле после отправки формы обратной связи. </p> <h4> Как исправить: контактная форма не работает с ошибкой «При отправке сообщения произошла ошибка». </h4> <p> Если ваша контактная форма 7 на WordPress, сайт больше не работает, выполните следующие действия: </p> <h6> Шаг 1. Подтвердите контактную форму 7. </h6> <p> 1. Перейдите в панель администратора WordPress и нажмите <strong> Контакт </strong> &gt; <strong> Контактные формы. </strong><br> 2. В верхней части страницы проверьте, есть ли сообщение об ошибке «Неверная конфигурация приводит к сбою доставки почты или другим проблемам. Проверьте свои контактные формы сейчас». <br> 3. Если вы видите это сообщение, * то <strong> щелкнуть </strong> в <strong> Проверить конфигурацию контактной формы 7 </strong> ссылка на сайт. </p> <p> * Примечание: если вы не видите это сообщение, перейдите к шагу 2. </p> <p><img src=\"images/image_thumb-813.png\" alt=\"Validate Contact Form 7 Configuration \" loading=\"lazy\"></p> <p> 4. На следующем экране щелкните значок <strong> Подтвердите 2 контактные формы сейчас </strong> кнопка. </p> <p><img src=\"images/image_thumb-1-270.png\" alt=\"Validate Contact Form\" loading=\"lazy\"></p> <p> 5. Когда проверка конфигурации будет завершена, вы должны получить сообщение «Недействительная контактная форма не найдена». </p> <p><img src=\"images/image_thumb-17-318.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Проверьте свою контактную форму и, если ошибка не исчезнет, ​​перейдите к шагу 2 ниже. </p> <h6> Шаг 2. Настройте контактную форму 7 с ключами reCAPTCHA V3. </h6> <p> В ходе исследования я обнаружил, что в последних версиях Contact Form 7 (v5.1 и новее) используется API reCAPTCHA v3 для защиты от спама и других типов автоматического злоупотребления. Таким образом, у вас есть два следующих варианта устранения ошибки контактной формы «При отправке вашего сообщения произошла ошибка. Повторите попытку позже»: * </p> <ul> <li> <p><strong> Опция 1. </strong> Для настройки Contact Form 7 с ключами reCAPTCHA V3. </p> </li> <li> <p><strong> Вариант 2. </strong> Чтобы использовать <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"noopener noreferrer\"> Контактная форма 7 - reCaptcha v2 </a> плагин для ваших контактных форм. </p> </li> </ul> <p> * Примечание. В этой статье я покажу вам, как настроить контактную форму 7 с ключами reCAPTCHA V3. Если вы не хотите использовать защиту reCAPTCHA V3, удалите плагин Contact Form 7 и установите <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"nofollow noopener\"> Контактная форма 7 - reCaptcha v2 </a> плагин. </p> <p><strong> Чтобы настроить контактную форму 7 с помощью ключей reCAPTCHA V3: </strong></p> <p> 1. Войдите в свою учетную запись Google, которую вы использовали для настройки reCAPTCHA на своем сайте, и перейдите к <a href=\"https://www.google.com/recaptcha/admin\" target=\"_blank\" rel=\"nofollow noopener\"> Консоль администратора Google reCAPTCHA. </a></p> <p> 2. Нажмите &quot;Настройки&quot;. <img src=\"images/image_thumb-2-494.png\" alt=\"image\" loading=\"lazy\"> икона. </p> <p><img src=\"images/image_thumb-3-786.png\" alt=\"Setup Contact Form 7 with recaptcha v3\" loading=\"lazy\"></p> <p> 3. Щелкните значок <strong> Корзина </strong> икона <img src=\"images/image_thumb-4-167.png\" alt=\"image\" loading=\"lazy\"> а также <strong> Удалить </strong> в <strong> Ключи reCAPTCHA V2. </strong></p> <p><img src=\"images/image_thumb-5-757.png\" alt=\"Recaptcha v3\" loading=\"lazy\"></p> <p> 4. Щелкните значок &quot;Плюс&quot;. <img src=\"images/image_thumb-6-851.png\" alt=\"image\" loading=\"lazy\"> чтобы снова зарегистрировать свой сайт. </p> <p><img src=\"images/image_thumb-7-337.png\" alt=\"Register Site with Recaptcha\" loading=\"lazy\"></p> <p> 5. На экране «Регистрация нового сайта»: </p> <blockquote> <p> а. <strong> Введите имя </strong> чтобы идентифицировать ваш сайт в будущем, <br> б. <strong> Выбирать </strong> в <strong> reCAPTCHA v3 </strong> тип. <br> c. <strong> Тип </strong> в <strong> доменное имя </strong> вашего сайта. <br> d. <strong> Принимать </strong> в <strong> Условия использования reCAPTCHA. </strong><br> е. Нажмите <strong> ОТПРАВИТЬ. </strong></p> </blockquote> <p><img src=\"images/image_thumb-8-227.png\" alt=\"Register Site with Recaptcha V3\" loading=\"lazy\"></p> <p> 6. После регистрации вы увидите экран с <strong> КЛЮЧ САЙТА </strong> и <strong> СЕКРЕТНЫЙ КЛЮЧ </strong> . <br> 7. Щелкните <strong> КОПИРОВАТЬ КЛЮЧ САЙТА </strong> а также <strong> НЕ ЗАКРЫВАЙТЕ </strong> это окно. </p> <p><img src=\"images/image_thumb-9-995.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. В другом окне браузера перейдите на панель администратора WordPress и нажмите <strong> Контакт </strong> &gt; <strong> Интеграция. </strong></p> <p> 9. Щелкните значок <strong> Настройка интеграции </strong> кнопка. </p> <p><img src=\"images/image_thumb-10-834.png\" alt=\"Integrate Recaptcha in Contact Form 7\" loading=\"lazy\"></p> <p> 10. Щелкните значок <strong> Удалить ключи </strong> кнопку, чтобы удалить ключи reCAPTCHA V2. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"image\" loading=\"lazy\"></p> <p> 11. <strong> Вставить </strong> новый <strong> Ключ сайта </strong> а затем скопируйте и вставьте новый <strong> Секретный ключ </strong> в консоли администратора reCAPTCHA и нажмите <strong> Сохранить изменения. </strong></p> <p><img src=\"images/image_thumb-12-147.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. <strong> Удалить </strong> в <strong> Кеш </strong> на Вашем сайте. <br> 13. Откройте новое окно браузера и проверьте свою контактную форму. </p> <p> Вот и все, ребята! Это сработало для вас? Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}