{"title":"ИСПРАВЛЕНИЕ: Thunderbird не отвечает или зависает. (Решено)","content":"<p> Если Thunderbird не отвечает, продолжайте ниже, чтобы решить проблему. Thunderbird - популярный почтовый клиент с открытым исходным кодом, доступный для всех платформ. Но иногда Thunderbird вообще перестает отвечать или зависает на 4-5 минут, прежде чем снова можно будет использовать. </p> <p><img src=\"images/image_thumb-18-762.png\" alt=\"Thunderbird is not responding or freezing - fix\" loading=\"lazy\"></p> <p> Thunderbird может не работать по следующим причинам: </p> <ul> <li> Антивирусная программа может помешать Thunderbird подключиться к Интернету. </li> <li> Функция поиска Windows в сообщениях Thunderbird может привести к зависанию Thunderbird. </li> <li> Проблемная настройка или надстройка Thunderbird. </li> <li> Файлы индексации Thunderbird (файлы MSF) могут быть повреждены. </li> </ul> <p> Поскольку Thunderbird может не отвечать по разным причинам, в этом руководстве мы покажем вам все доступные способы решения проблемы. </p> <h2> Как исправить: Thunderbird не отвечает или зависает в Windows 10. </h2> <h3> Метод 1. Просканируйте свой компьютер на вирусы. </h3> <p><strong> Важный: </strong> Многие вирусы или вредоносные программы могут вызывать проблемы с обновлением Windows. Поэтому, прежде чем переходить к шагам по устранению неполадок, описанным ниже, воспользуйтесь этим <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Руководство по сканированию и удалению вредоносных программ </a> для проверки и удаления вирусов и / или вредоносных программ, которые могут быть запущены на вашем компьютере. </p> <h3></h3> <h3> Способ 2. Отключите поиск Windows в сообщениях Thunderbird. </h3> <p> 1. В меню Thunderbird выберите <strong> Инструменты </strong> &gt; <strong> Параметры </strong> . </p> <p> 2. В общих настройках <strong> снимите отметку </strong> опция <strong> Разрешить поиску Windows искать сообщения </strong> . </p> <p><img src=\"images/image_thumb-24-636.png\" alt=\"Disable Windows Search in Thunderbird Messages\" loading=\"lazy\"></p> <p> 3. <strong> Запустить снова </strong> Thunderbird. </p> <p> </p> <h3> Способ 3. Добавьте Thunderbird в исключения антивируса. </h3> <p> Если вы используете сторонний антивирус на своем компьютере, продолжите и добавьте исполняемую программу thunderbird.exe в исключения вашей антивирусной программы. </p> <p> Например, если у вас есть антивирус AVG: </p> <p> 1. Перейти к <strong> Меню </strong> &gt; <strong> Настройки </strong> . <br> 2. В <strong> Общий </strong> вкладку, щелкните <strong> Исключения </strong> &gt; <strong> Добавить исключение </strong> . <br> 3. Щелкните значок <strong> Просматривать </strong> кнопку и найдите <strong> thunderbird.exe </strong> файл, (или <strong> копировать </strong> &amp; <strong> вставьте строку ниже) </strong> а затем щелкните <strong> Добавить исключение. * </strong></p> <ul> <li> C: \\ Program Files (x86) \\ Mozilla Thunderbird \\ thunderbird.exe </li> </ul> <p><strong> * Примечание: </strong> Если после добавления файла thunderbird.exe в исключения AV проблема все еще сохраняется, <strong> Добавлять </strong> также <strong> к исключениям AV </strong> в <strong> папка, в которой установлен Thunderbird </strong> и <strong> Папка профиля Thunderbird </strong> . </p> <p><img src=\"images/image_thumb-19-734.png\" alt=\"add thunderbird to antivirus exceptions\" loading=\"lazy\"></p> <p> </p> <p> </p> <h3> Метод 4. Отключить - удалить антивирусные программы. </h3> <p> Поскольку проблема &quot;не отвечает&quot; в программе Thunderbird, обычно это связано с антивирусной программой, я предлагаю <strong> запрещать </strong> или чтобы <strong> полностью удалить </strong> свою антивирусную программу и проверьте, сохраняется ли проблема. </p> <h3></h3> <p> </p> <h3> Способ 5. Запустите Thunderbird в безопасном режиме. </h3> <p> Thunderbird может зависать и не отвечать, если установленное расширение вызывает проблемы или повреждено. Чтобы устранить проблемы с надстройками Thunderbird, действуйте следующим образом. </p> <p> 1. Нажмите и <strong> удерживать </strong> в <strong> СДВИГ </strong> нажмите на клавиатуре и откройте <strong> Thunderbird. </strong></p> <p> 2. В следующем окне нажмите <strong> Продолжайте в безопасном режиме. </strong></p> <p><img src=\"images/image_thumb-21-196.png\" alt=\"Strat Thunderbird in Safe Mode\" loading=\"lazy\"></p> <p> </p> <p> 3. Если Thunderbird не зависает в безопасном режиме, проблема может быть в установленном надстройке. В этом случае: </p> <ol> <li> Закройте Thunderbird. </li> <li> Нажмите клавишу SHIFT и снова запустите Thunderbird. </li> <li> В следующем окне <strong> проверять </strong> <strong> Отключить все надстройки </strong> и нажмите <strong> Внесите изменения и перезапустите </strong> . </li> </ol> <p><img src=\"images/image_thumb-22-149.png\" alt=\"Disable Thunderbird add-ons\" loading=\"lazy\"></p> <p> 4. Если Thunderbird снова не отвечает, перейдите к следующему способу. </p> <h3> Метод 5. Сбросьте панели инструментов и элементы управления Thunderbird. </h3> <p> 1. Нажмите и <strong> удерживать </strong> в <strong> СДВИГ </strong> нажмите на клавиатуре и откройте <strong> Thunderbird. </strong></p> <p> 2. В следующем окне выберите <strong> Сбросить панели инструментов и элементы управления </strong> и нажмите <strong> Внесите изменения и перезапустите. </strong></p> <p><img src=\"images/image_thumb-23-344.png\" alt=\"Reset Thunderbird Toolbars\" loading=\"lazy\"></p> <p> </p> <h3> Метод 6. Удалите файлы индекса Thunderbird (.msf). </h3> <p> В некоторых случаях Thunderbird зависает из-за повреждения файлов индексации (также называемых файлами MSF). Итак, последний метод решения проблемы «Thunderbird не отвечает» - это удалить файлы .MSF. * </p> <p><strong> * ВАЖНЫЙ: </strong> Хотя файлы MSF (Mail Summary Files) можно безопасно удалить, поскольку они содержат только заголовки и статус электронного письма (прочитано, непрочитано и т. Д.), А не фактическое письмо, рекомендуется <a href=\"https://www.repairwin.com/how-to-transfer-thunderbird-email-and-settings-to-a-new-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> сделайте резервную копию папки профиля Thunderbird </a> перед удалением файлов MSF. </p> <p><strong> Шаг 1. Закройте Thunderbird. </strong></p> <p><strong> Шаг 2. Включите просмотр скрытых файлов. </strong></p> <p> 1. Перейдите в Windows. <strong> Панель управления </strong> и откройте <strong> Опции папки </strong> . (или <strong> Параметры проводника файлов </strong> в Windows 10). </p> <p> 2. Выберите <strong> Вид </strong> вкладка и под <strong> &quot;Скрытые файлы и папки&quot; </strong> раздел, <strong> проверять </strong> в <strong> Показать скрытые файлы, папки и диски </strong> вариант и нажмите <strong> ОК. </strong></p> <p><img src=\"images/image_thumb-34-553.png\" alt=\"Show Hidden files\" loading=\"lazy\"></p> <p> </p> <p><strong> Шаг 3. Удалите файлы .MSF. </strong></p> <p> 1. Перейдите в папку профиля Thunderbird на вашем диске и откройте <strong> Почта </strong> папка: * </p> <ul> <li> C: \\ Users \\ имя пользователя \\ AppData \\ Roaming \\ Thunderbird \\ Profiles \\ ProfileName <strong> .default \\ Mail </strong></li> </ul> <p> * Где username - это ваше имя пользователя Windows, а ProfileName - это имя профиля Mozilla, в котором хранятся электронные письма. </p> <p> 2. Теперь исследуйте все содержащиеся папки внутри <strong> Почта </strong> Папка, чтобы узнать, какая из них содержит файлы .msf. (в установках по умолчанию, только с одной учетной записью электронной почты, файлы MSF находятся в папке «Локальные папки». </p> <p> 3. <strong> Удалить </strong> все <strong> .msf </strong> файлы или -better- <strong> двигаться </strong> их в (новую) папку на рабочем столе. </p> <p><img src=\"images/image_thumb-25-355.png\" alt=\"Delete Thunderbird MSF files\" loading=\"lazy\"></p> <p> 4. Когда закончите, откройте Thunderbird и подождите, пока Thunderbird воссоздает файлы индексации (файлы MSF). </p> <p> Вот и все, ребята! Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}