{"title":"ИСПРАВЛЕНИЕ: ноутбук Lenovo застревает на экране LOGO. (Решено)","content":"<p> Если ваш ноутбук Lenovo застрял на экране с логотипом, продолжайте читать. Это руководство содержит пошаговые инструкции по устранению следующей проблемы на ноутбуках Lenovo: после включения ноутбук не загружается и зависает на заставке с логотипом Lenovo. (Проблема сохраняется даже при попытке загрузиться с загрузочного USB-устройства). </p> <p><img src=\"images/image_thumb-17-276.png\" alt=\"FIX: Lenovo laptop is stuck at LOGO screen.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Как исправить: ноутбук застревает на экране LENOVO LOGO. * </h4> <p> * Важно: перед устранением неполадок компьютера отключите все периферийные устройства, чтобы убедиться, что проблема не связана с подключенным устройством. </p> <p> </p> <h6> Шаг 1. Сбросьте BIOS до настроек по умолчанию. </h6> <p> Первым шагом к решению проблемы зависания ноутбука на логотипе Lenovo является сброс BIOS до настроек по умолчанию. Для этого: </p> <p> 1. <strong> Выключать </strong> Ноутбук, постоянно нажимая кнопку включения в течение 5-7 секунд. <br> 2. Теперь следуйте инструкциям ниже в зависимости от вашей модели, чтобы войти в BIOS: </p> <ul> <li> Если ваша система <strong> ThinkPad </strong> , нажмите кнопку питания, а затем сразу несколько раз быстро нажмите клавишу (Fn +) F2 или (Fn +) F1. </li> <li> Если ваша система <strong> Ideapad </strong> ноутбук, найдите и <strong> Нажмите </strong> в <a href=\"https://support.lenovo.com/us/en/solutions/HT104038\" target=\"_blank\" rel=\"nofollow noopener\"> НОВО </a> кнопку, которая обычно находится рядом с кнопкой питания, а затем выберите <strong> Войдите в меню BIOS </strong> . </li> </ul> <p> 3. На <strong> Выход </strong> выбор вкладки <strong> Загрузите стандартные настройки </strong> или «Загрузить оптимизированные настройки». <br> 4. <strong> Сохраните и выйдите из BIOS </strong> настройки и посмотрите, сможете ли вы загрузиться в Windows. <br> 5. Если ноутбук по-прежнему зависает на экране с логотипом Lenovo, переходите к следующему шагу. </p> <p> </p> <h6> Шаг 2. Отключите Lenovo Service Engine. </h6> <p> В некоторых ноутбуках (и настольных компьютерах) Lenovo система зависает с логотипом Lenovo во время загрузки, когда включен «Lenovo Service Engine». Чтобы отключить службу: </p> <p> 1. Войдите в меню BIOS. <br> 2. На <strong> Безопасность </strong> на вкладке выделите и отключите «Lenovo Service Engine». </p> <p><img src=\"images/image_thumb-19-834.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Сохранить и выйти </strong> из меню BIOS. <br> 4. Если ноутбук по-прежнему остается на заставке с логотипом Lenovo, перейдите к следующему шагу. </p> <p> </p> <h6> Шаг 3. Выполните сброс питания. </h6> <p> Следующий метод решения проблемы «застрял логотип Lenovo» - выполнить сброс питания. Для этого: </p> <p> 1. <strong> Отключить </strong> все подключенные периферийные устройства. <br> 2. <strong> Удалять </strong> в <strong> АС адаптер </strong> . <br> 3. <strong> Удалять </strong> в <strong> Аккумулятор </strong> . * </p> <p> * Примечание. Если не удается извлечь аккумулятор, оставьте ноутбук открытым, пока аккумулятор не разрядится. </p> <p> 4. <strong> Нажмите </strong> а также <strong> удерживать </strong> в <strong> Мощность </strong> удерживайте не менее 50-60 секунд, а затем отпустите кнопку питания. <br> 5. Подключите только адаптер переменного тока и включите ноутбук. <br> 6. Если Windows запускается нормально, выключите ноутбук и снова подключите аккумулятор и периферийные устройства. </p> <h6> Шаг 4. Извлеките батарею CMOS. </h6> <p> 1. <strong> Удалять </strong> в <strong> Аккумулятор </strong> и <strong> АС адаптер </strong> . <br> 2. Переверните ноутбук и <strong> Удалить </strong> в <strong> задняя обложка </strong> . * </p> <p> * Примечание: способ снятия задней крышки зависит от модели ноутбука. Итак, выполните поиск в Google о том, как разобрать вашу собственную модель ноутбука Lenovo. </p> <p> 3. Найдите и <strong> Удалить </strong> в <strong> CMOS аккумулятор </strong> . * </p> <p> * Примечание. Батарея CMOS имеет форму круга, и вы можете извлечь ее, осторожно поддев небольшой отверткой с плоской головкой. </p> <p> 4. <strong> Нажмите </strong> а также <strong> удерживать </strong> в <strong> Мощность </strong> удерживайте не менее 50-60 секунд, а затем отпустите. </p> <p> 5. Сначала подключите адаптер переменного тока, а затем снова вставьте батарею CMOS. <br> 5. Включите ноутбук. * </p> <p> * Примечание. Если проблема не исчезнет, ​​извлеките батарею CMOS и оставьте ее отключенной как минимум на 30 минут. Затем установите батарею CMOS, подключите адаптер переменного тока и включите ноутбук. </p> <p> </p> <h6> Шаг 5. Снимите DVD-проигрыватель. * </h6> <p><strong> * Важный: </strong> Выключите компьютер и извлеките адаптер питания, прежде чем добавлять или удалять детали. </p> <p> Если у вас есть ноутбук с DVD-приводом, снимите его и снова включите ноутбук. (Звучит странно, но в некоторых случаях работает.) </p> <p> </p> <h6> Шаг 6. Извлеките и повторно установите RAM и жесткий диск. </h6> <p> Когда компьютер (настольный или портативный) зависает на экране LOGO (POST), это обычно означает проблему с жестким диском (HDD) или памятью (RAM). Итак, действуем следующим образом: </p> <p><strong> * Важный: </strong> Выключите компьютер и извлеките адаптер питания, прежде чем добавлять или снимать его части. </p> <p> 1. Снимите и переустановите модуль (и) RAM. <br> 2. Включите ноутбук и посмотрите, сохраняется ли проблема. Если да, то… <br> 3. Выключите ноутбук и извлеките (отсоедините) жесткий диск (HDD). <br> 4. После извлечения жесткого диска снова включите ноутбук. <br> 5. Если причиной проблемы является жесткий диск, экран-заставка ЛОГОТИП Lenovo исчезнет, ​​и вы получите сообщение «Загрузочное устройство не найдено» или что-то в этом роде. Если это произойдет: * </p> <blockquote><p> а. Выключите ноутбук. <br> б. Очистите контакты жесткого диска и гнезда жесткого диска с помощью спрея для очистки контактов. <br> c. Снова подключите жесткий диск и продолжайте читать ниже (6). </p></blockquote> <p> * Примечание. Если этого не происходит, это указывает на проблему с BIOS или материнскую плату, которую может устранить только специализированный компьютерный техник. </p> <p> 6. Включите ноутбук и посмотрите, решилась ли проблема. В противном случае перейдите к резервному копированию файлов, а затем выполните чистую установку Windows, выполнив следующие действия: </p> <blockquote><p> а. Извлеките и подключите жесткий диск к другому рабочему компьютеру (например, с помощью адаптера жесткого диска USB-SATA). <br> б. Если вы можете прочитать содержимое диска, продолжайте и <strong> резервное копирование ваших файлов </strong> . * </p> <p> * Примечание. Если жесткий диск не распознается второстепенным компьютером, значит, жесткий диск неисправен и его необходимо заменить. </p> <p> c. После резервного копирования файлов продолжайте и <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> диагностировать жесткий диск на наличие проблем </a> , и в соответствии с результатами замените жесткий диск (если он неисправен) или (если он в порядке) продолжите и <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> удалить все разделы на HDD </a> . </p></blockquote> <p> 7. После очистки разделов снова установите жесткий диск на ноутбук и приступайте к работе. <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> чистая установка Windows </a> . </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}