{"title":"ИСПРАВЛЕНИЕ: в Windows 10 нет предыдущих версий (решено)","content":"<p> На компьютере под управлением Windows 10 с <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Системная защита </a> При включении этой функции возникает следующая проблема при попытке восстановить файл / папку с помощью функции «Восстановить предыдущие версии»: «Предыдущие версии недоступны». </p> <p> <img src=\"images/image_thumb-39-628.png\" alt=\"There No Previous Versions Available in Windows 10 \" loading=\"lazy\"></p> <p> </p> <p> Ошибка «Нет доступных предыдущих версий» возникает из-за того, что в Windows 10 функция «Восстановить предыдущие версии» работает только в том случае, если вы настроили &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> История файлов </a> &#39;для резервного копирования ваших файлов. Это означает, что функция «Восстановить предыдущие версии» в Windows 10 проверяет местоположение резервной копии «средства резервного копирования истории файлов», чтобы найти предыдущую версию файла / папки, а не точки восстановления системы, как это происходит в Windows. 7. Чтобы включить историю файлов в Windows 10, следуйте инструкциям в следующих статьях: </p> <ul> <li><strong> Статьи по Теме: </strong></li> <li> <ul> <li><a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Как сделать резервную копию личных файлов с историей файлов в Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Как создать теневые копии ваших файлов с помощью планировщика задач в Windows 10 </a></li> </ul> </li> </ul> <h4> Как исправить: в Windows 10 нет предыдущих версий файлов. </h4> <p> Если &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> История файлов </a> &#39;уже включен * на вашем ПК с Windows 10, но вы получаете сообщение «Нет доступных предыдущих версий», когда вы пытаетесь восстановить предыдущую версию файла или папки, следуйте инструкциям ниже: </p> <p> * Примечание: инструкции ниже <strong> не работает, если <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> История файлов УЖЕ НЕ включена </a></strong> на вашем ПК с Windows 10. </p> <p> 1. Загрузите и установите <a href=\"http://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowExplorer </a> утилита на вашем ПК. <br> 2. Откройте «ShadowExplorer» и выберите дату, с которой вы хотите восстановить файл. * </p> <p> * Примечание. Если вы не видите предыдущую дату, это означает, что история файлов отключена. Имейте в виду, что даже если вы сейчас включите историю файлов, результат будет таким же, потому что история файлов создает моментальные снимки ваших файлов с момента ее активации, а затем. </p> <p><img src=\"images/image_thumb-40-348.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Перейдите в место хранения файла / папки, которую вы хотите восстановить до предыдущей версии. <br> 4. Когда вы найдете файл, который хотите восстановить, щелкните его правой кнопкой мыши и выберите <strong> Экспорт </strong> . </p> <p><img src=\"images/image_thumb-41-653.png\" alt=\"restore previous versions shadow explorer\" loading=\"lazy\"></p> <p> </p> <p> 5. Выберите другой диск (место) для сохранения восстановленного файла и нажмите <strong> ОК </strong> . * </p> <p><strong> Важный: </strong> Сохраните восстановленные файлы на другой диск (например, флэш-накопитель) и только после того, как убедитесь, что у вас есть правильные файлы, скопируйте их в исходное место, чтобы избежать перезаписи исходных файлов. </p> <p><img src=\"images/image_thumb-38-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этой проблеме. </p>"}