{"title":"ИСПРАВЛЕНИЕ: сбросьте 120-дневный льготный период на RDS Server 2016/2012.","content":"<p> Если вы установили RDS Server 2016 в целях тестирования и истек льготный период лицензирования RDS, продолжайте читать ниже, чтобы узнать, как сбросить 120-дневный льготный период. Как вы, возможно, знаете, когда вы устанавливаете RDS Server 2016, у вас есть 120 дней для установки клиентских лицензий доступа к удаленным рабочим столам (клиентские лицензии удаленных рабочих столов), в противном случае пользователи больше не смогут устанавливать сеансы RDP на сервере узла сеансов удаленных рабочих столов с ошибкой «Удаленный сеанс рабочего стола был отключен из-за отсутствия серверов лицензирования удаленного рабочего стола, которые могли бы предоставить лицензию ». </p> <p><img src=\"images/image_thumb-32-368.png\" alt=\"Reset 120 Days Grace Period on RDS Server 2012/2016\" loading=\"lazy\"></p> <p> </p> <h4> Как сбросить льготный период лицензирования RDS на Server 2012 или 2016. * </h4> <p><strong> * Важный: </strong> Примените приведенные ниже инструкции, только если вы используете RDS Server 2016 в тестовой среде. Если вы хотите использовать сервер RDS в производственной среде, продолжайте и приобретайте клиентские лицензии на удаленные рабочие столы. </p> <p> Чтобы продлить 120-дневный льготный период для сервера лицензирования RDS: </p> <p> 1. Откройте редактор реестра и перейдите к следующему ключу: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Control \\ Terminal Server \\ RCM \\ GracePeriod </li> </ul> <p> 2. Щелкните правой кнопкой мыши кнопку GracePeriod и выберите <strong> Разрешения. </strong></p> <p><img src=\"images/image_thumb-33-473.png\" alt=\"Reset Grace Period RDS 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Затем щелкните <strong> Передовой </strong> . </p> <p><img src=\"images/image_thumb-34-585.png\" alt=\"Reset RDS Grace Period\" loading=\"lazy\"></p> <p> </p> <p> 4. Выберите <strong> Администраторы </strong> объект и щелкните <strong> Редактировать </strong> . </p> <p><img src=\"images/image_thumb-18-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Измените разрешения на <strong> Полный контроль </strong> и нажмите <strong> ОК. </strong></p> <p><img src=\"images/image_thumb-19-737.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Щелкните правой кнопкой мыши значение «L $ RTMTIMEBOMB…» и выберите <strong> Удалить </strong> . </p> <p><img src=\"images/image_thumb-35-208.png\" alt=\"Reset RDS Licensing Grace Pariod\" loading=\"lazy\"></p> <p> </p> <p> 7. Закройте редактор реестра и перезапустите сервер RDS. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}