{"title":"ИСПРАВЛЕНИЕ: Chrome всегда открывать опции «Просмотр как гость» - переключать пользователя при запуске.","content":"<p> В руководстве содержатся инструкции о том, как запретить Chrome отображать окно «Сменить пользователя - Просмотр в качестве гостя» при запуске. Проблема в деталях: на компьютере под управлением Windows браузер Google Chrome всегда открывает при запуске параметры «Просмотр в качестве гостя» и «Добавить человека», и пользователь всегда должен выбирать свой профиль, чтобы использовать браузер Chrome. </p> <p><img src=\"images/image_thumb-26-805.png\" alt=\"FIX Remove Chrome Browse as Guest\" loading=\"lazy\"></p> <p> </p> <h4> Как удалить окно параметров «Браузер в качестве гостя - Добавить человека» при запуске Chrome. </h4> <h6> Метод 1. Убедитесь, что Chrome настроен на постоянный запуск в режиме гостевого просмотра. </h6> <p> Одной из наиболее полезных функций браузера Google Chrome является создание нескольких профилей пользователей, особенно если вы используете свой компьютер совместно с другими пользователями или если вы хотите разделить свои закладки и настройки между несколькими учетными записями. В этом случае вы всегда можете запустить Chrome из окна «Сменить человека», добавив один из следующих переключателей (текстовые записи) в ярлык Chrome: </p> <ul> <li><strong> –Profile-directory = &quot;Профиль гостя&quot; </strong></li> <li><strong> –Bwsi </strong></li> </ul> <p> </p> <p> Итак, прежде всего, проверьте, настроен ли Chrome так, чтобы всегда открывать окно «Сменить пользователя / Просмотр в качестве гостя». Для этого: </p> <p> 1. Закройте Google Chrome. <br> 2. Щелкните правой кнопкой мыши ярлык Chrome на рабочем столе и выберите <strong> Характеристики </strong> . <br> 3. На <strong> Ярлык </strong> вкладка, посмотрите на <strong> Цель </strong> текстовое поле и (если есть) <strong> Удалить </strong> указанные выше текстовые записи в конце, а затем щелкните <strong> ОК </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-27-916.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Запустите Chrome и в окне «Сменить человека» щелкните значок / изображение своего профиля («Вы»). <br> 5. <strong> Запустить снова </strong> Хром. </p> <p> </p> <h6> Метод 2. Создайте новый чистый профиль Google Chrome. </h6> <p> По умолчанию Chrome хранит все настройки профиля (закладки, пароли, расширения и т. Д.) В папке «Данные пользователя» в следующем месте на вашем компьютере: </p> <ul> <li><strong> C: \\ Users \\% Имя пользователя% \\ AppData \\ Local \\ Google \\ Chrome \\ Данные пользователя </strong></li> </ul> <p> Если по какой-то причине папка профиля Chrome повреждена или неправильно изменена вредоносным ПО, лучший вариант - заставить Chrome воссоздать новую (пустую *) папку профиля Chrome. Для этого: </p> <p><strong> * Внимание: </strong> Имейте в виду, что, удаляя папку хранения профиля Chrome, вы удаляете все сохраненные данные (закладки, настройки, расширения, историю и т. Д.). Поэтому перед удалением профиля Chrome выполните <a href=\"https://www.repairwin.com/backup-restore-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> резервное копирование закладок Chrome </a> на случай, если вы захотите снова установить Chrome. </p> <h5> Шаг 1. Включите режим просмотра «Скрытые файлы и папки». </h5> <p> 1. Открыть <strong> Опции папки </strong> . <br> 2. На <strong> Вид </strong> вкладка <strong> проверять </strong> в <strong> Показать скрытые файлы, папки и диски </strong> установите флажок и щелкните <strong> ОК. </strong></p> <p><img src=\"images/image_thumb-6-189.png\" alt=\"enable hidden files folders\" loading=\"lazy\"></p> <h6></h6> <h5> Шаг 2. Заставьте Chrome создать новую (чистую) папку профиля. </h5> <p> 1. <strong> Закрывать </strong> Гугл Хром. <br> 2. <strong> Открыть </strong> Проводник Windows и перейдите в это место: </p> <ul> <li><strong> C: \\ Users \\% USERNAME% \\ AppData \\ Local \\ Google \\ Chrome \\ </strong></li> </ul> <p> * Где% USERNAME% = ваше имя пользователя. (например, если ваше имя пользователя «Admin», вам нужно перейти по этому пути: «C: \\ Users \\ Admin \\ AppData \\ Local \\ Google \\ Chrome») </p> <p> 3. <strong> Переименовать </strong> папку «Данные пользователя» в «Данные пользователя.BAK». </p> <p><img src=\"images/image_thumb-28-373.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Теперь откройте Google Chrome. (Во время запуска Chrome автоматически создаст новую чистую папку «Данные пользователя» для хранения ваших закладок и настроек). </p> <p> </p> <h6> Дополнительные методы решения проблем Chrome. </h6> <p><strong> 1. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Проверьте свой компьютер на наличие вирусов, вредоносных программ и т. Д. </a></p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Полностью удалите и переустановите Chrome. </a></p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}