{"title":"ИСПРАВЛЕНИЕ: Запуск сценариев отключен в этой системе в Windows 10 (решено)","content":"<p> Если вы пытаетесь запустить сценарий в Windows 10 PowerShell и получаете сообщение об ошибке «Не удается загрузить, поскольку в этой системе отключены запущенные сценарии», продолжайте читать ниже, чтобы устранить проблему. </p> <p><img src=\"images/image_thumb-8-134.png\" alt=\"FIX: script cannot be loaded because is disabled on Windows 10\" loading=\"lazy\"></p> <p> </p> <h2> Как исправить: не удается запустить сценарий PowerShell, поскольку политика безопасности запрещает запуск сценариев в Windows 10. </h2> <p> Ошибка PowerShell «% ScriptName% .ps1 не может быть загружена, потому что отключена в этой системе», появляется из-за политики безопасности, которая запрещает запуск сценариев. Чтобы снять ограничение и включить запуск скриптов в Windows 10, выполните следующие действия: </p> <p> 1. Открыть <strong> PowerShell как администратор </strong> . Для этого: </p> <blockquote><p> 1. Нажмите кнопку <strong> Окна <img src=\"images/image_thumb-97-958.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> р </strong> клавиши, чтобы открыть командное окно &quot;Выполнить&quot; <strong><br> </strong> 2. Тип <strong> Powershell </strong> а затем нажмите <strong> CTRL </strong> + <strong> СДВИГ </strong> + <strong> ВХОДИТЬ. </strong></p></blockquote> <p><img src=\"images/image_thumb-41-395.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. В PowerShell скопируйте / вставьте команду ниже и нажмите <strong> Входить </strong> : </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Unrestricted </li> </ul> <p> 3. Нажмите <strong> Y </strong> и ударил <strong> Входить </strong> при выполнении политики, предупреждающее сообщение о принятии изменения. </p> <p><img src=\"images/image_thumb-9-581.png\" alt=\"Enable Running Scripts on Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. После того, как изменение политики будет завершено, <strong> Закрыть </strong> окно PowerShell. </p> <p> 5. Теперь запустите сценарий, который выдал ошибку «Сценарии отключены» с помощью <strong> админ </strong> привилегии. Ошибка должна исчезнуть. * </p> <blockquote><p> * Примечание. Если вы по-прежнему получаете сообщение об ошибке «Сценарии отключены в этой системе», введите одну из следующих команд и попробуйте еще раз запустить сценарий: </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy RemoteSigned </li> <li> дистанционно подписанная политика выполнения </li> </ul> </blockquote> <p> 6. Наконец, вернитесь к предыдущему параметру политики выполнения PowerShell (ограничение), выполнив эту команду в PowerShell (Admin): * </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Restricted </li> </ul> <p> * Примечание. После выполнения указанной выше команды вы получите предупреждающее сообщение, в котором объясняются риски безопасности, связанные с изменением политики выполнения. Нажмите <strong> Y </strong> , а затем нажмите <strong> Входить </strong> чтобы принять изменение и вернуться к предыдущему параметру политики. </p> <p><img src=\"images/image_thumb-10-246.png\" alt=\"Disable running scripts windows 10\" loading=\"lazy\"></p> <p> 7. Закройте окно PowerShell, и все готово! </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}