{"title":"ИСПРАВЛЕНИЕ: разрядка батареи в Windows 10 (решено)","content":"<p> В Windows 10 многие пользователи жалуются, что их батарея ноутбука быстро разряжается даже при малой нагрузке или даже при полном выключении. Эта проблема «разряда батареи» в Windows 10 возникает по двум основным причинам. Первая причина заключается в том, что Windows 10 загружает слишком много фоновых приложений, которые потребляют заряд аккумулятора, даже если они не используются. </p> <p> Следующая причина, по которой батарея разряжается даже при полном выключении, - это функция «Быстрый запуск». В Windows 10 (и Windows 8 / 8.1) по умолчанию включена функция «Быстрый запуск», которая позволяет системе загружаться и запускаться быстрее. Фактически, когда включен «Быстрый запуск», Windows 10 не выполняет полное выключение системы и выходит из состояния гибернации. </p> <p> В этом руководстве вы найдете инструкции по предотвращению разряда аккумулятора Windows 10. </p> <h4> Как исправить проблему разряда батареи в Windows 10. </h4> <p> </p> <h6> Шаг 1. Предотвратить запуск приложений в фоновом режиме. </h6> <p> Первый шаг к решению проблемы с разрядом батареи в Windows 10 - не запускать приложения в фоновом режиме. Чтобы отключить фоновые приложения: </p> <p> 1. Перейдите к <strong> Начинать </strong> -&gt; <strong> Настройки </strong> -&gt; <strong> Конфиденциальность </strong> . <br> 2. Выберите <strong> Фоновые приложения </strong> слева, а затем справа поставьте &quot; <strong> Разрешить приложениям работать в фоновом режиме &quot; </strong> переключить на <strong> Выключенный, </strong> или индивидуально выберите приложения, которые вы не хотите запускать в фоновом режиме, и отключите их. </p> <p><img src=\"images/image_thumb-8-676.png\" alt=\"Prevent Apps from Running in the Background - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Шаг 2. Включите режим энергосбережения. </h6> <p> Следующим шагом является включение функции энергосбережения, чтобы продлить срок службы батареи за счет ограничения фоновой активности. </p> <p> 1. Перейдите к <strong> Начинать </strong> -&gt; <strong> Настройки </strong> -&gt; <strong> Система </strong> . <br> 2. На <strong> Аккумулятор </strong> параметры: </p> <blockquote> <p> а. Нажмите «Посмотреть, какие приложения влияют на срок службы батареи», чтобы узнать об использовании батареи в открытых приложениях. <br> б. <strong> Проверять </strong> &quot; <strong> Автоматическое включение режима энергосбережения при выходе из строя аккумулятора ниже &quot; </strong> установите флажок и переместите ползунок в подходящее положение. <br> c. Кроме того, выберите «Уменьшить яркость экрана в режиме энергосбережения. </p> </blockquote> <p><img src=\"images/image_thumb-9-289.png\" alt=\"turn on battery saver Windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Шаг 3. Отключите быстрый запуск. </h6> <p> Следующий шаг - заставить Windows 10 полностью выключиться, отключив функцию быстрого запуска. </p> <p> 1. Перейдите к <strong> Начинать </strong> -&gt; <strong> Настройки </strong> -&gt; <strong> Система </strong> . <br> 2. На <strong> Мощность </strong> варианты нажмите <strong> Дополнительные настройки мощности. </strong></p> <p><img src=\"images/image_thumb-10-405.png\" alt=\"FIX Battery Drain in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Выберите <strong> Выберите, что делают кнопки питания </strong> слева. </p> <p><img src=\"images/image_thumb-11-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Затем щелкните <strong> Изменить настройки, которые в настоящее время недоступны </strong> . </p> <p><img src=\"images/image_thumb-12-235.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> Снимите отметку </strong> в <strong> Включить быстрый запуск (рекомендуется) </strong> вариант и нажмите <strong> Сохранить изменения. * </strong></p> <p> * Примечание: если опция быстрого запуска уже не отмечена, отметьте ее и перезагрузите компьютер. После перезагрузки снимите флажок и снова перезагрузите компьютер. </p> <p><img src=\"images/image_thumb-13-410.png\" alt=\"Turn Off Fast Startup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Запустить снова </strong> твой компьютер. </p> <h6></h6> <h6> Шаг 4. Отключите спящий режим. </h6> <p> «Гибернация» - это функция питания, которая потребляет меньше энергии, чем спящий режим, и когда вы снова включаете компьютер, вы возвращаетесь к тому месту, где остановились. В некоторых случаях функция гибернации приводит к тому, что ваш компьютер с Windows 10 не выключается полностью. Чтобы отключить спящий режим: </p> <p> </p> <p> 1. В поле поиска введите: <strong> командная строка </strong> или же <strong> cmd <br> </strong> 2. Щелкните правой кнопкой мыши на <strong> Командная строка и выберите Запуск от имени администратора. </strong></p> <p><img src=\"images/image_thumb-14-379.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. В командной строке введите следующую команду и нажмите <strong> Входить. </strong></p> <ul> <li><strong> powercfg -h выкл </strong></li> </ul> <p><img src=\"images/image_thumb-15-234.png\" alt=\"Disable Hibernate Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. <strong> Запустить снова </strong> твой компьютер. * </p> <p> * Примечание. Если вы хотите снова включить функцию «Гибернация», просто введите эту команду в командной строке администратора: </p> <ul> <li> <ul> <li> powercfg -h выкл </li> </ul> </li> </ul> <p> </p> <h6> Шаг 5. Измените параметры питания на сетевом адаптере. </h6> <p> Следующий способ решить проблему с разрядом аккумулятора в Windows 10 - изменить настройки питания сетевых адаптеров. </p> <p> 1. Открыть <strong> Диспетчер устройств </strong> . <br> 2. Разверните <strong> Сетевые адаптеры </strong> . <br> 3. Щелкните правой кнопкой мыши установленный сетевой адаптер и выберите <strong> Характеристики </strong> . <br> 3. Выберите <strong> Управление энергопотреблением </strong> таб. <br> 4. <strong> Снимите отметку </strong> в <strong> &#39;Разрешить этому устройству выводить компьютер из спящего режима </strong> &#39;и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-7-574.png\" alt=\"modify power settings\" loading=\"lazy\"></p> <h6></h6> <h6> Шаг 6. Откатите драйвер интерфейса Intel Management Engine. </h6> <p> Если проблема с разрядом батареи появляется после установки обновления Windows 10, продолжите и откатите драйвер для интерфейса Intel Management Engine. Для этого: </p> <p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-592.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. Тип: <strong> devmgmt.msc </strong> и нажмите <strong> ОК </strong> . <br> 3. Разверните <strong> Системные устройства </strong> . <br> 4. Щелкните правой кнопкой мыши на <strong> Интерфейс Intel Management Engine </strong> и выберите <strong> Характеристики </strong> . </p> <p><img src=\"images/image_thumb-5-532.png\" alt=\"device properties\" loading=\"lazy\"></p> <p> </p> <p> 5. Выберите вкладку Драйвер и щелкните <strong> Откат драйвера </strong> . * </p> <p> </p> <p> * Если <strong> Откат драйвера </strong> отображается серым цветом, затем перейдите на сайт поддержки производителя вашего ноутбука или материнской платы, чтобы загрузить и установить более старую версию драйвера для интерфейса Intel Management Engine. </p> <p><img src=\"images/image_thumb-6-551.png\" alt=\"roll back driver\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Запустить снова </strong> твой компьютер. </p> <h6> Шаг 7. Другие предложения по устранению проблемы разряда батареи. </h6> <p> 1. Замените зарядное устройство ноутбука и всегда используйте фирменное зарядное устройство, чтобы продлить срок службы аккумулятора. <br> 2. Если батарея вашего ноутбука старая, вероятно, ее емкость упала и ее следует заменить. Чтобы проверить состояние аккумулятора, используйте <a href=\"http://www.nirsoft.net/utils/battery_information_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> BatteryInfoView </a> полезность. </p> <p><img src=\"images/image_thumb-16-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этой проблеме. </p>"}