{"title":"ИСПРАВЛЕНИЕ: Быстрый доступ не работает и невозможно ввести текст в поле поиска в Windows 10 (решено)","content":"<p> Если <strong> Быстрый доступ </strong> Меню s не работает в Windows 10, затем прочтите это руководство, чтобы исправить проблему. Параметр «Быстрый доступ» в проводнике позволяет пользователю легко переходить к недавно открывавшимся файлам и папкам. Но иногда, особенно когда вы ранее открывали файл / папку с внешнего диска (например, с USB-диска), который теперь отключен, в быстром доступе не отображаются последние файлы или вы не можете ввести строку в строке поиска. </p> <p><img src=\"images/image_thumb-2-490.png\" alt=\"FIX: Quick Access Not Working in Windows 10 (Solved)\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Как исправить: функция быстрого доступа и функция поиска не работают в Windows 10. </h4> <p> </p> <h6> Метод 1. Перезапустите проводник Windows. </h6> <p> Первый способ решить проблему с быстрым доступом - перезапустить процесс Windows Explorer из диспетчера задач. Для этого: </p> <p> 1. Нажмите <strong> Ctrl </strong> + <strong> Alt </strong> + <strong> Del </strong> открыть <strong> Диспетчер задач </strong> . <br> 2. На <strong> Процессы </strong> * выделите вкладку <strong> проводник Виндоус </strong> обработать и щелкнуть <strong> Запустить снова </strong> . </p> <p> * Примечание. Если вы не видите вкладку «Процесс», щелкните <strong> Подробнее. </strong></p> <p><img src=\"images/image_thumb-951.png\" alt=\"restart windows explorer\" loading=\"lazy\"></p> <p><strong> </strong></p> <h6> Метод 2. Включите быстрый доступ к недавним элементам и очистите историю проводника. </h6> <p> 1. Открыть <strong> Опции папки. </strong> Для этого откройте проводник Windows и в меню перейдите к <strong> Вид </strong> &gt; <strong> Параметры </strong> . </p> <p><img src=\"images/image_thumb-3-949.png\" alt=\"enable quick access windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. В <strong> Общий </strong> на вкладке убедитесь, что установлены следующие флажки. </p> <ul> <li><strong> Показать недавно использованные файлы в быстром доступе </strong></li> <li><strong> Показывать часто используемые папки в быстром доступе. </strong></li> </ul> <p> 3. Затем щелкните значок <strong> ясно </strong> кнопку, чтобы очистить историю проводника. </p> <p><img src=\"images/image_thumb-4-329.png\" alt=\"clear quick access history\" loading=\"lazy\"></p> <p> </p> <p> 3. Щелкните <strong> ОК </strong> и проверьте, работают ли быстрый доступ и функция поиска. Если нет, перезапустите «Проводник» с помощью диспетчера задач (см. Метод 1 выше) и проверьте еще раз. Если проблема не исчезнет, ​​перейдите к следующему методу. </p> <h6> Метод 3. Очистить историю недавних элементов вручную. </h6> <p> Следующий метод решения проблем с недавними элементами быстрого доступа или с функцией «Поиск» в Windows 10 - это удаление истории недавних элементов вручную. Для этого: </p> <p> 1. Откройте проводник Windows. <br> 2. Скопируйте и вставьте следующий адрес в адресную строку и нажмите <strong> Входить </strong> : </p> <p> % AppData% \\ Microsoft \\ Windows \\ Recent \\ AutomaticDestinations </p> <p><img src=\"images/image_thumb-1-410.png\" alt=\"clear recent items windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Нажмите <strong> Ctrl </strong> + <strong> А </strong> (чтобы выбрать все элементы) и нажмите <strong> Удалить </strong> (или щелкните правой кнопкой мыши&gt; <strong> Удалить </strong> ). </p> <p><img src=\"images/image_thumb-5-834.png\" alt=\"Delete Quick Access History\" loading=\"lazy\"></p> <p> </p> <p> 4. Затем скопируйте / вставьте следующий адрес в адресную строку и нажмите <strong> Входить </strong> . </p> <p> % AppData% \\ Microsoft \\ Windows \\ Recent \\ CustomDestinations </p> <p><img src=\"images/image_thumb-6-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Нажмите <strong> Ctrl </strong> + <strong> А </strong> еще раз (чтобы выбрать все элементы) и нажмите <strong> Удалить. <br> </strong> 6. Теперь нажмите <strong> Ctrl + Alt + Del </strong> открыть <strong> Диспетчер задач </strong> . <br> 7. На <strong> Процессы </strong> вкладку, выделите <strong> проводник Виндоус </strong> обработать и щелкнуть <strong> Запустить снова </strong> . <br> 8. Обычно проблемы с функцией «Быстрый доступ» или с функцией «Поиск» должны быть решены. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}