{"title":"ИСПРАВЛЕНИЕ: Ошибка Stream Office при установке или удалении Office. (Решено)","content":"<p> В этом руководстве вы найдете пошаговые инструкции по устранению ошибки «Не удалось выполнить потоковую передачу Office» при попытке обновить, установить или удалить Office 2013, Office 2016, Office 2019 или Office 365 на ПК с Windows. </p> <p> Проблема в деталях: при попытке обновить, установить или удалить Office 365, 2016 или 2013 с помощью кнопки &quot; <em> Программа и особенности </em> &quot;на панели управления, появляется следующее сообщение об ошибке:&quot; <em> Не удалось транслировать Office. К сожалению, у нас возникла проблема с потоковой передачей Office. Пожалуйста, повторите попытку позже. Код (ы) ошибки: 30015-25 (1006), или 30182–1 (2), или 30183-39 (-2147014790), или код ошибки 30179-25). </em></p> <p><img src=\"images/image_thumb-4-575.png\" alt=\"Couldn't Stream Office error \" loading=\"lazy\"></p> <p> </p> <h4> Как исправить: не удалось выполнить потоковую передачу Office 2013, 2016, 2019 или 365. </h4> <p> * Важно: сообщение об ошибке «Не удалось Stream Office» может появиться по следующим причинам: </p> <ol> <li> <ol> <li> Ваша антивирусная программа / брандмауэр может препятствовать подключению к серверам Microsoft для обновления Office. </li> <li> Возможно, вам не хватит места на диске. </li> </ol> </li> </ol> <p> Итак, перед тем, как перейти к описанному ниже методу, попробуйте сделать следующее перед установкой, удалением или обновлением Office: </p> <ol> <li> <ol> <li> Отключите (или полностью удалите) ваш антивирус / брандмауэр. </li> <li> Освободите место на жестком диске, а затем попробуйте переустановить или обновить Office. </li> </ol> </li> </ol> <p> Если после попытки описанного выше вы по-прежнему сталкиваетесь с ошибкой «Не удалось выполнить потоковую передачу Office», продолжайте и полностью удалите и переустановите Office. Для этого: </p> <p> 1. Загрузите <a href=\"https://aka.ms/SaRA-officeUninstallFromPC\" target=\"_blank\" rel=\"nofollow noopener\"> Удалить инструмент поддержки Microsoft Office </a> . <br> 2. По завершении загрузки дважды щелкните, чтобы запустить «SetupProd_OffScrub.exe». <br> 3. Щелкните <strong> Установить </strong> , чтобы установить «Помощник по поддержке и восстановлению Майкрософт». </p> <p><img src=\"images/image_thumb-5-986.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Когда установка будет завершена, нажмите <strong> Дать согласие </strong> а затем щелкните <strong> Да. </strong></p> <p><img src=\"images/image_thumb-6-745.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Подождите, пока «Помощник по поддержке и восстановлению Майкрософт» не устранит проблему. <br> 6. Установите флажок слева от названия продукта Office, чтобы <strong> выберите все установленные продукты Office </strong> и нажмите <strong> Следующий </strong> . </p> <p><img src=\"images/image_thumb-7-956.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Теперь дождитесь завершения процесса удаления Office, и когда это будет сделано, <strong> запустить снова </strong> твой компьютер. <br> 8. После перезапуска переустановите Office, следуя инструкциям по этим ссылкам: </p> <ul> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Office 365 </a></li> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Офис 2019 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Офис 2016 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Офис 2013 </a></li> </ul> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}