{"title":"ИСПРАВЛЕНИЕ: ошибка HP Smart - состояние принтера неизвестно (решено)","content":"<p> Это руководство содержит инструкции по устранению <a href=\"https://www.hpsmart.com/us/en\" target=\"_blank\" rel=\"nofollow noopener\"> HP Smart </a> ошибка приложения «Состояние принтера неизвестно» в ОС Windows 10. Сообщение «Состояние принтера неизвестно» в приложении HP SMART может отображаться по неизвестным причинам и не позволяет пользователю использовать функцию сканирования или печати на принтере. </p> <p> Проблема в деталях: на компьютере под управлением Windows 10 с установленным принтером HP в приложении HP Smart появляется сообщение об ошибке «Состояние принтера неизвестно», несмотря на то, что принтер без проблем печатает из Интернета или других приложений. Основная проблема с этой ошибкой заключается в том, что пользователь не может использовать опцию SCAN в приложении HP Smart для сканирования документа. </p> <p> </p> <p> </p> <p><img src=\"images/image_thumb-23-787.png\" alt=\"FIX: HP Smart \" printer status unknown loading=\"lazy\"></p> <h4> ИСПРАВЛЕНИЕ: «Состояние принтера неизвестно» в приложении HP Smart. (Windows 10). </h4> <p> 1. Из меню &quot;Пуск&quot; <img src=\"images/image_thumb2_thumb_thumb-697.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> нажмите Настройки <img src=\"images/image_thumb-66-822.png\" alt=\"image\" loading=\"lazy\"> а затем откройте <strong> Программы </strong> . </p> <p><img src=\"images/image_thumb-25-257.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Щелкните <strong> Приложение HP Smart </strong> а затем щелкните <strong> Расширенные опции </strong> . </p> <p><img src=\"images/image_thumb-26-912.png\" alt=\"FIX: Printer Status unknown on HP Smart app\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Щелкните значок <strong> Сброс настроек </strong> кнопка. </p> <p><img src=\"images/image_thumb-27-494.png\" alt=\"Fix Printer Status Unknow on HP Smart app\" loading=\"lazy\"></p> <p> 4. По завершении сброса закройте все окна и откройте <strong> HP Smart </strong> приложение. <br> 5. Обычно необходимо устранить ошибку «Состояние принтера неизвестно». Просто нажмите на <strong> Настраивать </strong> кнопку, чтобы включить все функции HP Smart, и готово! * </p> <p><img src=\"images/image_thumb-28-849.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Примечание. Если ошибка HP Smart «Состояние принтера неизвестно» сохраняется, попробуйте следующее: </p> <blockquote><p> 1. <strong> Неисправность </strong> компьютер. <br> 2. <strong> Отключить </strong> в <strong> шнур питания от принтера </strong> за 1 минуту. <br> 3. Через 1 минуту <strong> включить </strong> ваш <strong> компьютер </strong> . <br> 4. После загрузки Windows 10 <strong> повторно подключите шнур питания принтера </strong> и проверьте, устранена ли ошибка «Состояние принтера неизвестно» в приложении HP Smart. Если ошибка не исчезнет, ​​продолжите удаление и повторную установку принтера и программного обеспечения принтера на вашем компьютере. </p></blockquote> <p> Вот и все, ребята! Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}