{"title":"ИСПРАВЛЕНИЕ: диски отображались дважды в области навигации Windows 10 (решено)","content":"<p> В этом руководстве вы дадите инструкции по устранению следующей странной проблемы в Windows 10: Диски отображаются дважды в области навигации. Дублирование дисков в области навигации - это новая функция Windows 10, которая помогает пользователю легко изучить содержимое подключенный диск, без необходимости раскрывать меню «Этот компьютер». Но эта функция становится раздражающей, потому что, если вы используете, чтобы оставить меню «Этот компьютер» открытым, один и тот же диск отображается дважды в панели навигации. </p> <p><img src=\"images/image_thumb-22-749.png\" alt=\"Drives Displayed Twice in Navigation Pane of Windows 10\" loading=\"lazy\"></p> <p> Если вы видите повторяющиеся записи подключенных USB-накопителей или фиксированных дисков в Windows 10, следуйте приведенным ниже инструкциям, чтобы решить проблему. </p> <h4> Как удалить повторяющиеся буквы диска в проводнике Windows 10 (меню навигации). </h4> <p> Чтобы Windows 10 не отображала дважды подключенный или фиксированный диск, примените следующую настройку реестра: </p> <p> 1. Откройте редактор реестра. для этого: </p> <blockquote><p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-493.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. В поле поиска введите <strong> regedit </strong> и нажмите <strong> Входить </strong> для запуска редактора реестра. </p></blockquote> <p><img src=\"images/image_thumb7-138.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Затем перейдите к этому разделу реестра: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows \\ CurrentVersion \\ Explorer \\ Desktop \\ NameSpace \\ DelegateFolders </li> </ul> <p> 3. Затем щелкните правой кнопкой мыши и удалите <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> ключ. </p> <p><img src=\"images/image_thumb-23-428.png\" alt=\"remove duplicate drive entries windows 10 navigation pane\" loading=\"lazy\"></p> <p> </p> <p> 4. Затем перейдите к этой клавише: * </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ WOW6432Node \\ Microsoft \\ Windows \\ CurrentVersion \\ Explorer \\ Desktop \\ NameSpace \\ DelegateFolders </li> </ul> <p> 5. Удалите <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> ключ. </p> <p> 6. Закройте редактор реестра. </p> <p> * Примечание: если вы не видите ключ «WOW6432Node», проигнорируйте шаги 4 и 5 выше, поскольку они применимы только к 64-битным версиям Windows 10. </p> <p><strong> КОНЧИК: </strong> Если вы измените свое решение в будущем, просто щелкните правой кнопкой мыши на «DelegateFolders» в указанном выше месте реестра, выберите <strong> Новый </strong> -&gt; <strong> Ключ </strong> , и воссоздать удаленный <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> ключ (ы). </p> <p> Это все! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}