{"title":"ИСПРАВЛЕНИЕ: Низкая скорость процессора ноутбука Dell Inspiron (решено)","content":"<p> Это руководство содержит инструкции по устранению проблемы с очень низкой скоростью процессора на ноутбуке Dell Inspiron 5558. Недавно мой друг принес мне в лабораторию свой ноутбук Dell, потому что он внезапно стал слишком медленным. Фактически, раньше ноутбук работал быстро, но теперь загрузка операционной системы (Windows 10) и приложений занимает много времени. </p> <p> После проверки ноутбука, как вы можете видеть на скриншоте ниже, я обнаружил, что процессор всегда работает на частоте 0,48 ГГц вместо 2,20 ГГц. Итак, я начал устранение неполадок и, наконец, нашел следующие два метода решения проблемы низкой скорости процессора ... </p> <p> (Скорость процессора была снижена примерно на 85-87% на ноутбуке Dell) </p> <p><img src=\"images/image_thumb-16-354.png\" alt=\"FIX Dell Laptop Slow CPU Speed\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Как исправить проблему низкой скорости процессора на ноутбуке Dell. </h4> <h6> Метод 1. Замените адаптер переменного тока. </h6> <p> Проблема низкой скорости ЦП - известная проблема ноутбуков Dell, когда адаптер питания переменного тока не распознается компьютером правильно. В таких случаях, даже если кажется, что адаптер питания работает нормально, при включении ноутбука отображается следующее предупреждающее сообщение: «Тип адаптера питания переменного тока не может быть определен. Это препятствует оптимальной производительности системы». </p> <p> Итак, первый способ решить проблему низкой производительности ноутбука Dell - это заменить адаптер питания новым совместимым адаптером питания переменного тока Dell. </p> <p> </p> <h6> Метод 2. ОСТАНОВИТЕ троттлинг процессора с помощью ThrottleStop. </h6> <p> Если ваш адаптер переменного тока работает нормально, а ваш ноутбук не перегревается *, тогда еще один способ решить проблему низкой производительности системы на вашем ноутбуке Dell - отключить дросселирование неизвестного адаптера питания с помощью <strong><a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"> Дроссельная заслонка </a></strong> полезность. Для этого: </p> <p> 1. Загрузите <a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Дроссельная заслонка </strong></a> утилиту и распакуйте скачанный вами архив. <br> 2. В извлеченной папке дважды щелкните, чтобы запустить приложение «ThorttleStop.exe». * <br> 3. <strong> Снимите отметку </strong> в <strong> BD PROCHOT </strong> *** установите флажок, а затем нажмите <strong> Сохранить </strong> . </p> <p> * Заметки: <br> 1. Чтобы контролировать температуру процессора, вы можете использовать <a href=\"https://www.alcpu.com/CoreTemp/\" target=\"_blank\" rel=\"nofollow noopener\"> CoreTemp </a> программа. <br> 2. Если вы получаете сообщение об ошибке «MFC120U.dll не найден» или «MSVCR120.dll отсутствует» после запуска ThrottleStop, продолжите установку и установите <a title=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" href=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Распространяемые пакеты Visual C ++ для Visual Studio 2013 </a> . ( <strong> Важный: </strong> Если у вас 64-разрядная версия Windows, вам необходимо установить как 64-разрядную, так и 32-разрядную версию пакета Visual C ++). <br> 3. BD PROCHOT означает двунаправленный проход. PROCHOT означает «горячий процессор». Это сигнал, который активируется в процессоре, когда температура достигает примерно 100-105 ° C, в зависимости от номера модели. Этот сигнал инициирует тепловое регулирование, чтобы ЦП мог замедлиться и избежать перегрева. Отключение PROCHOT позволит вашему процессору продолжать работать на полной скорости. (Источник: <a href=\"http://forum.notebookreview.com/threads/the-throttlestop-guide.531329/\" target=\"_blank\" rel=\"nofollow noopener\"> Руководство ThrottleStop </a> ). </p> <p><img src=\"images/image_thumb-20-666.png\" alt=\"FIX Slow CPU Speed with ThrottleStop\" loading=\"lazy\"></p> <p> 4. Закройте ThrottleStop, и все готово. Теперь процессор будет работать на полной скорости, пока вы не перезагрузите или не выключите ноутбук. * </p> <p> * Примечание: вы должны запустить <strong> Дроссельная заслонка </strong> программа каждый раз при запуске компьютера, если вы хотите работать на полной скорости процессора. Чтобы облегчить себе жизнь, следуйте инструкциям в этом <a href=\"https://www.repairwin.com/how-to-start-throttlestop-at-windows-startup/\" target=\"_blank\" rel=\"nofollow noopener\"> гид </a> для автоматического запуска ThrottleStop при запуске Windows. </p> <p><img src=\"images/image_thumb-21-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}