{"title":"ИСПРАВЛЕНИЕ: Ошибка активации 0x80072EE7 в Windows 10. (Решено)","content":"<p> Если вы получаете сообщение об ошибке активации 0x80072EE7 при попытке активировать Windows 10, продолжайте читать это руководство, чтобы решить проблему. Ошибка активации » <em> Мы не можем активировать Windows на этом устройстве, так как наши серверы активации сейчас недоступны. Убедитесь, что вы подключены к Интернету, и мы автоматически попытаемся активировать Windows, когда служба станет доступной »с кодом ошибки: 0x80072EE7, </em> обычно появляется из-за проблем с сетью. </p> <p><img src=\"images/image_thumb-5-942.png\" alt=\"FIX: We can’t activate Windows on this device - Error 0x80072EE7\" loading=\"lazy\"></p> <p> В этом руководстве содержатся инструкции по исправлению ошибки активации Windows 10 0x80072EE7: «Мы не можем активировать Windows на этом устройстве, поскольку наши серверы активации сейчас недоступны». </p> <h4> Как устранить ошибку активации Windows 10 0x80072EE7 </h4> <h6> Шаг 1. Убедитесь, что вы подключены к Интернету. </h6> <p> Если вы не можете активировать Windows 10 из-за ошибки 0x80072EE7, прежде всего проверьте подключение к Интернету. Для этого откройте свой Интернет-браузер и посетите любой веб-сайт, чтобы убедиться, что ваше Интернет-соединение работает. </p> <p> </p> <h6> Шаг 2. Используйте действительный ключ продукта для Windows 10. </h6> <p> Ошибка активации Windows 10 0x80072EE7 может появиться, если установленный ключ продукта недействителен. Итак, убедитесь, что вы используете действующий и законный лицензионный ключ для активации Windows 10. Лицензионный ключ должен относиться к установленной версии Windows 10 (например, Home или Pro) и должен быть введен правильно. </p> <p> Чтобы изменить ключ продукта Windows 10, перейдите в <strong> Настройки </strong> &gt; <strong> Обновление и безопасность </strong> &gt; <strong> Активация </strong> и нажмите <strong> Изменить ключ продукта </strong> . </p> <p><img src=\"images/image_thumb-6-424.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Шаг 3. Измените настройки DNS. </h6> <p> 1. <strong> Щелкните правой кнопкой мыши </strong> на <strong> Сеть </strong> икона <img src=\"images/image_thumb-42-792.png\" alt=\"image\" loading=\"lazy\"> на панели задач и щелкните <strong> Откройте Центр управления сетями и общим доступом. </strong> * </p> <p><img src=\"images/image_thumb-104-479.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Выберите <strong> Ethernet </strong> (или Wi-Fi) слева, а затем в разделе &quot;Связанные настройки&quot; нажмите <strong> Изменить параметры адаптера </strong> . </p> <p><img src=\"images/image_thumb-43-166.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> 3. Щелкните правой кнопкой мыши активный сетевой адаптер (Ethernet или Wi-Fi) и выберите <strong> Характеристики </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-44-500.png\" alt=\"network properties\" loading=\"lazy\"></p> <p> 4. Выберите <strong> &#39;Интернет-протокол версии 4 (TCP / IPv4) </strong> &#39;и щелкните <strong> Характеристики </strong></p> <p><img src=\"images/image_thumb-106-472.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> 5. В свойствах Интернет-протокола версии 4 (TCP / IPv4): </p> <blockquote><p> а. <strong> Проверять </strong> в <strong> Используйте следующие адреса DNS-серверов: </strong> переключатель. <br> б. Затем введите следующие адреса DNS-серверов (общедоступные DNS-серверы Google) и нажмите <strong> ОК. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> </blockquote> <p><img src=\"images/image_thumb-109-991.png\" alt=\"google dns settings\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Запустить снова </strong> твой компьютер. </p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}