{"title":"ИСПРАВЛЕНИЕ: изменились настройки оборудования. Пожалуйста, перезагрузитесь в Windows 10 Startup. (Решено)","content":"<p> Это руководство содержит инструкции по устранению следующей проблемы при каждой загрузке Windows 10: «Параметры вашего оборудования изменились. Перезагрузите компьютер, чтобы эти изменения вступили в силу». </p> <p> Ошибка запуска Windows 10 «изменились настройки оборудования… перезагрузите компьютер», может появиться даже после новой установки Windows 10, особенно на компьютерах (настольных или портативных) с графической картой AMD. </p> <p><img src=\"images/image_thumb-71-941.png\" alt=\"FIX Hardware Settings Have Changed. Please Reboot - Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Как исправить ошибку запуска Windows 10: изменились настройки оборудования. Пожалуйста, перезагрузите компьютер… </h4> <p> 1. Откройте панель управления службами Windows: Для этого: </p> <ul> <li> Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-332.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. </li> <li> В поле поиска введите: <strong><em> services.msc </em></strong> и нажмите <strong> ОК </strong> . </li> </ul> <p><img src=\"images/image_thumb-12-644.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. В панели управления службами щелкните правой кнопкой мыши на <strong> Утилита AMD External Events </strong> сервис и выберите <strong> Характеристики </strong> . </p> <p><img src=\"images/image_thumb-72-951.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Установите <strong> Тип запуска </strong> к <strong> Отключено </strong> а затем щелкните <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-73-548.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Перезагрузить </strong> твой компьютер. Если после перезагрузки вы по-прежнему получаете сообщение об ошибке: «Параметры оборудования изменились ... перезагрузите компьютер», выполните следующие действия: </p> <p> 1. Перейдите в Панель управления -&gt; <strong> Программы и компоненты </strong> а также <strong> удалить </strong> все <strong> AMD </strong> программное обеспечение. <br> 2. Перейдите к <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Страница загрузки драйвера AMD </a> , чтобы загрузить и установить самую старую версию драйвера для вашего видеоадаптера. </p> <p> Вот и все, ребята! Это сработало для вас? Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}