{"title":"ИСПРАВЛЕНИЕ: Обновление Windows 10 не может удалить Avira AntiVir (решено)","content":"<p> На компьютере с Windows 10 при попытке обновить Windows 10 до версии 1803 или 1809 появляется следующее сообщение: «Некоторые приложения необходимо удалить: эти программы необходимо удалить, поскольку они несовместимы с обновлением: антивирус Avira» и при нажатии кнопки «Удалить и продолжить» появляется следующая ошибка: «Не удалось удалить эти приложения: Avira AntiVir». Самое забавное в этой проблеме то, что Avira Antivir (Антивирус) не установлен на ПК (не указан в установленных программах). </p> <p><img src=\"images/image_thumb-10-929.png\" alt=\"Windows 10 Update Couldn't uninstall Avira AntiVir\" loading=\"lazy\"></p> <p> Проблема «Не удалось удалить Avira AntiVir» во время обновления до Windows 10 v1803 возникает из-за того, что программа обновления находит на вашем ПК файлы, связанные с антивирусом Avira, и они не были удалены во время удаления Avira. * </p> <p> * Примечание. Если на вашем компьютере действительно установлена ​​программа «Avira Antivirus», удалите ее с помощью параметра «Программы и компоненты» на панели управления, а затем перейдите к обновлению системы до Windows 10 v1803 (или 1809). После обновления загрузите и установите последнюю версию Avira Antivirus в вашу систему. </p> <h4> Как исправить ошибку обновления Windows 10: не удалось удалить Avira AntiVir. </h4> <p> </p> <p> 1. Запустите Windows в <strong> Безопасный режим </strong> . Для этого: </p> <ul> <li> <ul> <li> Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-432.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. </li> <li> Тип <strong> msconfig </strong> и нажмите <strong> Входить </strong> . </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-47-667.png\" alt=\"msconfig\" loading=\"lazy\"></p> <ul> <li> <ul> <li> В <strong> Ботинок </strong> вкладка выберите <strong> Безопасный ботинок </strong> вариант, затем щелкните <strong> ОК </strong> и перезагрузите компьютер. </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-48-342.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 2. После перезагрузки откройте проводник и удалите <strong> avipbb.sys </strong> файл из следующих мест: </p> <ul> <li> C: \\ Windows \\ System32 \\ драйверы </li> <li> C: \\ Windows \\ SysWOW64 \\ драйверы </li> </ul> <p> </p> <p> 3. Продолжайте удалять из указанных выше расположений все остальные файлы с именем <strong> avipbb </strong> несмотря на его расширение. </p> <p> 4. Затем удалите <strong> Avira </strong> папку из следующего места: </p> <ul> <li> (64-разрядная версия Windows): C: \\ Program Files (x86) \\ <strong> Avira \\ Антивирус </strong></li> <li> (32-разрядная версия Windows): C: \\ Program Files \\ <strong> Avira \\ Антивирус </strong></li> </ul> <p> 5. Беги <strong> msconfig </strong> очередной раз. <br> 6. На вкладке Общие щелкните Обычный запуск и щелкните <strong> ОК </strong> , чтобы перезагрузить компьютер в обычном режиме. </p> <p><img src=\"images/image_thumb-11-949.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Проверьте и установите обновления. * </p> <p> * Примечание. Если вы по-прежнему сталкиваетесь с ошибкой «Не удалось удалить Avira AntiVir» во время обновления, загрузите и запустите <a href=\"https://www.avira.com/en/support-download-avira-registrycleaner/1//\" target=\"_blank\" rel=\"nofollow noopener\"> Средство очистки реестра Avira </a> . </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}