{"title":"ИСПРАВЛЕНИЕ: нет звука из внутренних динамиков на ноутбуке HP OMEN (решено)","content":"<p> Это руководство содержит пошаговые инструкции по устранению проблемы «Нет звука из внутренних динамиков» на <a href=\"https://support.hp.com/ph-en/document/c05576170\" target=\"_blank\" rel=\"nofollow noopener\"> Ноутбук Omen от HP - 17-an009nv </a> . Проблема «Нет звука из динамиков ноутбука» может возникнуть на любой модели ноутбука HP и обычно возникает после установки обновления драйвера Windows для устройства Realtek High Definition Audio. </p> <p> Проблема в деталях: на ноутбуке HP под управлением Windows 10 нет звука из внутренних динамиков при воспроизведении музыки или видео, но динамики работают нормально при запуске диагностических тестов HP вне ОС. Кроме того, проблема «нет звука» возникает только с динамиками ноутбука, а не с внешними динамиками или наушниками. </p> <h4> Как исправить: динамики ноутбука не работают в Windows 10. </h4> <h6> Шаг 1. Увеличьте громкость звука </h6> <p> 1. <strong> Щелкните правой кнопкой мыши </strong> на <strong> значок звука </strong><img src=\"images/image_thumb-11-503.png\" alt=\"image\" loading=\"lazy\"> на панели задач и выберите <strong> Смеситель открытого объема. </strong></p> <p><img src=\"images/image_thumb-12-807.png\" alt=\"Open Volume Mixer\" loading=\"lazy\"></p> <p> 2. Перетащите ползунок «Динамики» на <strong> Вершина </strong> и проверьте, слышите ли вы звук. </p> <p><img src=\"images/image_thumb-13-813.png\" alt=\"Adjust Sound Volume\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Шаг 2. Установите динамики в качестве устройства воспроизведения по умолчанию. </h6> <p> 1. Перейдите в Windows. <strong> Панель управления </strong> и открыть <strong> Звук. </strong></p> <p><img src=\"images/image_thumb-14-315.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Убедитесь, что <strong> Динамики </strong> это <strong> По умолчанию </strong> воспроизводящего устройства, в противном случае выберите динамики и щелкните <strong> Установить по умолчанию </strong> кнопка. Когда закончите, проверьте динамики и, если проблема не исчезнет, ​​перейдите к следующему шагу. </p> <p><img src=\"images/image_thumb-15-993.png\" alt=\"Set Speakers as Default Playback Device\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Шаг 3. Проверьте внутренние динамики вне Windows. </h6> <p> Следующим шагом для решения проблемы «нет звука на внутренних динамиках» на вашем ноутбуке является проверка работы динамиков при запуске тестов HP для диагностики оборудования. Для этого: </p> <p> 1. <strong> Выключать </strong> ваш ноутбук. <br> 2. Включите ноутбук и сразу нажмите кнопку <strong> ESC </strong> ключ неоднократно. <br> 3. Когда появится меню, нажмите кнопку <strong> F2 </strong> ключ. <br> 4. В главном меню щелкните <strong> Компонентные тесты </strong> а затем щелкните <strong> АУДИО. <br> </strong> 5. Если вы слышите звук из динамиков во время проверки звука, перейдите к шагу 3 ниже. * </p> <p><strong> * Примечание: </strong> Если вы не слышите звук из динамиков, остановитесь на этом, потому что есть проблема с оборудованием, которую может решить только специализированный специалист по портативному компьютеру (сервис). </p> <p><img src=\"images/image_thumb-22-211.png\" alt=\"HP Diagnostics - Component Test\" loading=\"lazy\"></p> <p> </p> <h6><br clear=\"all\"> Шаг 4. Откатите драйвер звуковой карты. </h6> <p> 1. Открыть <strong> Диспетчер устройств </strong> . Для этого: </p> <blockquote><p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-958.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. В поле «Открыть» введите: <strong> devmgmt.msc </strong> и щелкнуть <strong> ОК </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-5-510.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Расширять </strong> в <strong> Звуковые, видео и игровые контроллеры. </strong></p> <p> 3. <strong> Щелкните правой кнопкой мыши </strong> на <strong> Аудио высокого разрешения Realtek </strong> устройство и выберите <strong> Характеристики. </strong></p> <p><img src=\"images/image_thumb-17-678.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. На вкладке Драйвер щелкните <strong> Откат драйвера </strong> кнопка. <strong> * </strong></p> <p><strong> * Примечание: </strong> Если кнопка «Откатить драйвер» неактивна, перейдите к следующему шагу. </p> <p><img src=\"images/image_thumb-18-178.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> </p> <p> 5. Выберите причину отката пакета драйверов и нажмите <strong> Да. </strong></p> <p><img src=\"images/image_thumb-19-167.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Когда откат драйвера завершится, <strong> запустить снова </strong> твой компьютер. <br> 5. После перезагрузки продолжите и проверьте звук из динамиков ноутбука. Если вы по-прежнему не слышите звук из динамиков ноутбука, перейдите к следующему шагу. </p> <p> </p> <h6><br clear=\"all\"> Шаг 5. Измените драйвер звуковой карты. </h6> <p> 1. Открыть <strong> Диспетчер устройств. </strong><br> 2. <strong> Расширять </strong> в <strong> Звуковые, видео и игровые контроллеры. <br> </strong> 3. <strong> Щелкните правой кнопкой мыши </strong> в <strong> Аудио высокого разрешения Realtek </strong> устройство, {или на <strong> &#39;Realtek High Definition Audio (SST) </strong> устройство} и выберите <strong> Обновить драйвер. <br> </strong></p> <p><img src=\"images/image_thumb-6-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Выбрать <strong> Найдите на моем компьютере драйверы. </strong></p> <p><img src=\"images/image_thumb-7-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Выберите <strong> Позвольте мне выбрать из списка доступных драйверов на моем компьютере </strong> . </p> <p><img src=\"images/image_thumb-8-771.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> </p> <p> 6. На следующем экране примените одно из следующих действий в зависимости от вашего случая: </p> <p><strong> Дело А. </strong> Если в поле «Показать совместимое оборудование» вы видите перечисленные устройства «Аудио высокого разрешения» и «Аудио высокого разрешения Realtek», затем выберите <strong> Аудиоустройство высокой четкости </strong> и нажмите <strong> Следующий. </strong></p> <p><img src=\"images/image_thumb-20-130.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p><strong> Случай Б. </strong> Если в поле &quot;Показать совместимое оборудование&quot; вы увидите только <strong> &#39;Realtek High Definition Audio (SST) </strong> устройство, затем: </p> <blockquote><p> а. <strong> Снимите отметку </strong> в <strong> Флажок Показать совместимое оборудование. </strong></p></blockquote> <p><img src=\"images/image_thumb-9-565.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> б. Выберите <strong> Аудио высокого разрешения Realtek </strong> драйвер и нажмите <strong> Следующий. </strong></p></blockquote> <p><img src=\"images/image_thumb-10-248.png\" alt=\"FIX No Sound from Internal Speakers on Laptop\" loading=\"lazy\"></p> <p> </p> <p> 8. Когда установка драйвера будет завершена, <strong> запустить снова </strong> твой компьютер. <br> 9. После перезагрузки продолжите и проверьте звук из динамиков ноутбука. </p> <p> </p> <h6><br clear=\"all\"> Шаг 6. Удалите и повторно установите драйвер звуковой карты. </h6> <p> 1. Открыть <strong> Диспетчер устройств. </strong><br> 2. <strong> Расширять </strong> в <strong> Звуковые, видео и игровые контроллеры. <br> </strong> 3. <strong> Щелкните правой кнопкой мыши </strong> в <strong> Аудио высокого разрешения Realtek </strong> устройство и выберите <strong> Удалите устройство. </strong></p> <p><img src=\"images/image_thumb-21-889.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. После удаления <strong> запустить снова </strong> ваш компьютер, и пусть Windows автоматически установит звуковые драйверы. Если этого не произошло, перейдите к <strong> Настройки </strong> &gt; <strong> Обновление и безопасность </strong> и заставьте Windows <strong> Проверить обновления, </strong> или перейдите к шагу 7 ниже. </p> <p> </p> <h6><br clear=\"all\"> Шаг 7. Обновите драйверы звуковой карты. </h6> <p> Перейдите на сайт поддержки производителя вашего ноутбука, загрузите и установите последнюю версию драйвера для своей звуковой карты. Если вы не можете найти драйвер для звуковой карты на сайте поддержки производителей или если после установки нового драйвера вы все еще сталкиваетесь с проблемой «нет звука из внутренних динамиков», попробуйте следующее, если у вас есть устройство Realtek HD Audio. </p> <p> 1. Прочтите инструкции по этому <a href=\"https://www.repairwin.com/how-to-download-realtek-audio-manager-realtek-audio-drivers-windows-10-8-1-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> статья </strong></a> к <strong> скачать </strong> в <strong> Драйвер Realtek HD Audio v2.82. <br> </strong> 2. После загрузки продолжайте и <strong> установить </strong> в <strong> Аудиодрайвер Realtek HD. <br> </strong> 3. После установки <strong> запустить снова </strong> свой компьютер и проверьте звук из динамиков. * </p> <p><strong> Заключительное примечание: </strong> Если проблема со звуком в динамиках сохраняется, посмотрите в Диспетчере устройств, и если звуковое устройство указано как «Realtek High Definition Audio (SST)», следуйте инструкциям на шаге 5 выше и измените «Realtek High Definition Audio (SST)» &quot;Драйвер&quot; Realtek High Definition Audio &quot;. </p> <p> Вот и все, ребята! Какой метод сработал для вас? Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}