{"title":"ИСПРАВЛЕНИЕ: не удается установить XPS Viewer в Windows 10 (решено)","content":"<p> В предыдущем уроке я упомянул шаги, необходимые для <a href=\"https://www.repairwin.com/how-to-install-xps-viewer-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> установить XPS Viewer в Windows 10 </a> . Но некоторые пользователи жалуются, что не могут установить XPS Viewer, потому что программа просмотра XPS отсутствует в списке после нажатия кнопки «Добавить функцию» («Приложения»&gt; «Управление дополнительными функциями»&gt; «Добавить функцию») или не может быть установлена. </p> <p> В этом руководстве содержатся инструкции по устранению проблем с установкой средства просмотра XPS в версиях Windows 10 1803 и 1809. </p> <h4> Как решить проблемы с установкой XPS Viewer в Windows 10. </h4> <h6> Метод 1. Удалите и повторно установите Microsoft XPS Document Writer. </h6> <p> 1. Открыть <strong> Программы и компоненты </strong> а затем щелкните <strong> Включение и отключение функций Windows </strong> . </p> <p><img src=\"images/image_thumb-61-948.png\" alt=\"FIX: Cannot Install XPS Viewer - Windows 10\" loading=\"lazy\"></p> <p> 2. <strong> Снимите отметку </strong> в <strong> Коробка Microsoft XPS Document Writer </strong> и ударил <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-62-338.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Теперь щелкните <strong> Включение и отключение функций Windows </strong> снова и <strong> проверять </strong> в <strong> Средство записи документов Microsoft XPS </strong> коробка и щелкните <strong> ОК. <br> </strong> 4. <strong> Запустить снова </strong> ваш компьютер. <br> 5. Попробуйте установить XPS Viewer. </p> <p> </p> <h6> Способ 2. Установите XPS Viewer с помощью команды DISM. </h6> <p> 1. Открыть <strong> Командная строка от имени администратора </strong> . <br> 2. В командной строке введите следующую команду и нажмите <strong> Входить </strong> . </p> <ul> <li><strong> DISM / Online / Add-Capability /CapabilityName:XPS.Viewer~~~~0.0.1.0 </strong></li> </ul> <p><img src=\"images/image_thumb-65-661.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Метод 3. Загрузите XPS Viewer из Центра обновления Windows вместо WSUS. (Windows 10 Pro и Enterprise). </h6> <p> Если вы используете Windows 10 Pro или Enterprise, выполните следующие действия в редакторе групповой политики. * </p> <p> * Примечание. Если компьютер принадлежит к домену, перед установкой XPS Viewer необходимо изменить параметры групповой политики домена (GPO), а затем запустить команду «gpupdate / force». </p> <p> 1. Откройте редактор групповой политики. Для этого: </p> <blockquote><p> 1. Нажмите одновременно Windows <img src=\"images/image_thumb36-656.png\" alt=\"image\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. Тип <strong> gpedit.msc </strong> &amp; Нажмите <strong> Входить. </strong></p></blockquote> <p><img src=\"images/image_thumb-78-514.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. На левой панели перейдите к: </p> <ul> <li><strong> Конфигурация компьютера </strong> -&gt; <strong> Административные шаблоны </strong> -&gt; <strong> Система </strong></li> </ul> <p> 3. На правой панели дважды щелкните по <strong> Задайте настройки для установки дополнительных компонентов и ремонта компонентов </strong></p> <p><img src=\"images/image_thumb-63-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Установите политику на <strong> Включено </strong> а затем проверьте <strong> Загружайте материалы для восстановления и дополнительные функции непосредственно из Центра обновления Windows вместо служб Windows Server Update Services (WSUS). </strong> коробка. </p> <p> 5. Когда закончите, нажмите <strong> Применять </strong> а также <strong> ОК </strong> а также <strong> запустить снова </strong> ваш компьютер. </p> <p><img src=\"images/image_thumb-64-264.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. После перезагрузки попробуйте <a href=\"#install-xps-viewer-dism\" target=\"_blank\" rel=\"nofollow noopener\"> установить XPS Viewer с помощью метода DISM </a> выше. <br> 7. После установки средства просмотра XPS откройте редактор групповой политики и отмените изменения. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}