{"title":"ИСПРАВЛЕНИЕ: Outlook 0x80042112 - получение сообщения об ошибке (решено)","content":"<p> Outlook 0x80042112 Получение сообщения об ошибке, обычно возникает, когда Outlook пытается получить электронные письма очень большого размера (например, электронные письма с большими вложениями). В этом случае Outlook отображает следующую ошибку во время «выполнения отправки / получения»: «Задача«% Email-Account% - получение »сообщила об ошибке (0x80042112):« Следующие сообщения электронной почты на почтовый сервер не могут быть загружены. Если вы продолжаете получать эту ошибку, обратитесь к своему поставщику услуг Интернета (ISP) или администратору почты ». </p> <p><img src=\"images/image_thumb-7-121.png\" alt=\"FIX: Outlook 0x80042112 Receiving reported error. \" loading=\"lazy\"></p> <p> Это руководство содержит подробные инструкции по устранению ошибки получения Outlook 0x80042112. </p> <h4> Как исправить сообщение об ошибке 0x80042112. </h4> <h6> Шаг 1. Убедитесь, что вы подключены к Интернету. </h6> <p> Иногда ошибка получения Outlook 0x80042112 возникает из-за остановки подключения к Интернету. Итак, прежде всего убедитесь, что ваше интернет-соединение работает. Для этого откройте свой интернет-браузер и посетите любой веб-сайт, чтобы проверить соединение. </p> <p> </p> <h6> Шаг 2. Удалите исходящие сообщения электронной почты. </h6> <p> Второй метод устранения ошибки 0x80042112 в Outlook - это удалить или переместить в черновики все сообщения электронной почты, которые застряли в папке «Исходящие». Для этого: </p> <p> 1. В Outlook щелкните значок <strong> Отправить / получить </strong> вкладку, а затем щелкните <strong> Работать оффлайн </strong> . </p> <p><img src=\"images/image_thumb-8-737.png\" alt=\"Move Outbox Emails to Drafts folder\" loading=\"lazy\"></p> <p> 2. <strong> Запустить снова </strong> Outlook. <br> 3. Выберите <strong> Исходящие </strong> папку (слева), а затем нажмите <strong> CTRL </strong> + <strong> А </strong> чтобы выбрать все электронные письма (справа). <br> 4. Щелкните правой кнопкой мыши выбранные электронные письма и переместите их в <strong> Черновики </strong> папку, нажав <strong> Переместить -&gt; Другая папка </strong> , а затем выберите <strong> Черновики </strong> папку из списка. </p> <p><img src=\"images/image_thumb-10-352.png\" alt=\"FIX Outlook error 0x80042112\" loading=\"lazy\"></p> <p> </p> <p> 5. По завершении щелкните значок <strong> Отправить / получить </strong> вкладку и щелкните <strong> Работа в сети. <br> </strong> 6. <strong> Запустить снова </strong> Outlook и выполните отправку / получение. </p> <h6></h6> <h6> Шаг 3. Запустите Outlook без надстроек. </h6> <p> Другой способ исправить ошибку Outlook 0x80042112 при получении - запустить приложение Outlook в безопасном режиме и отключить любые надстройки, которые могут вызвать ошибку. </p> <p> 1. Чтобы запустить Outlook в безопасном режиме, удерживайте <strong> CTRL </strong> (на клавиатуре), а затем дважды щелкните ярлык Microsoft Outlook или: </p> <blockquote><p> а. Одновременно нажмите Windows <img src=\"images/image_thumb36-371.png\" alt=\"image\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> б. Тип: <strong> перспектива / сейф </strong> и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-14-671.png\" alt=\"outlook safe mode\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. В безопасном режиме Outlook перейдите к параметрам надстроек и <strong> отключить все надстройки </strong> . Для этого: </p> <ul> <li> Чтобы отключить надстройки в <strong> Outlook 2007 </strong> : </li> </ul> <blockquote><p> 1. <strong> На </strong> в <strong> Инструменты </strong> меню, щелкните <strong> Центр доверия. </strong><br> 2. Выберите <strong> Надстройки </strong> на левой панели. <br> 3. На правой панели выберите <strong> Надстройки COM </strong> и нажмите <strong> Идти… <br> </strong> 4. <strong> Снимите отметку </strong> все флажки, чтобы отключить все надстройки, и нажмите <strong> ОК. </strong></p></blockquote> <ul> <li> Чтобы отключить надстройки в <strong> Outlook 2016, 2013 </strong> или же <strong> 2010 г. </strong> : </li> </ul> <blockquote><p> 1. Щелкните значок <strong> Файл </strong> меню и выберите <strong> Параметры </strong> . <br> 2. Выберите <strong> Надстройки на </strong> левая панель. <br> 3. На правой панели выберите <strong> Надстройки COM </strong> и нажмите <strong> Идти… </strong></p></blockquote> <p><img src=\"images/image_thumb-20-411.png\" alt=\"disable outlook add-ins\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. <strong> Снимите отметку </strong> <strong> все </strong> флажки и щелкните <strong> ОК </strong> чтобы отключить все надстройки. </p> <p><strong><img src=\"images/image_thumb-21-683.png\" alt=\"turn off outlook add-ins\" loading=\"lazy\"><strong><br> </strong></strong></p> </blockquote> <p> 3. <strong> Запустить снова </strong> Outlook. <br> 4. Попробуйте отправить / получить. Если процесс отправки / получения завершается нормально и без отображения ошибки 0x80042112, продолжите и повторно включите один за другим все отключенные плагины и перезапустите Outlook, пока не найдете, какой из них вызывает проблему. </p> <p> </p> <h6> Шаг 4. Проверьте настройки антивируса и брандмауэра. </h6> <p> Если вы используете антивирусную программу с функциями сканирования электронной почты, отключите надстройку антивируса в Outlook (см. Инструкции на шаге 3 выше) или временно отключите антивирусную защиту или удалите антивирусную программу. Кроме того, проверьте настройки брандмауэра и убедитесь, что используемые вами порты почтового сервера не заблокированы программой брандмауэра. В частности, в настройках вашего брандмауэра: </p> <p> A. Включите следующие файлы для доступа в Интернет: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> Б. Включите следующие порты в брандмауэре: </p> <ul> <li><strong> Порт 110 </strong> (Если вы используете сервер входящей почты POP3 без зашифрованного соединения) * </li> <li><strong> Порт 995 </strong> (Если вы используете сервер входящей почты POP3 с зашифрованным соединением (SSL включен) </li> </ul> <ul> <li><strong> Порт 143 </strong> (если вы используете сервер входящей почты IMAP без зашифрованного соединения) </li> <li><strong> Порт 993 </strong> (если вы используете сервер входящей почты IMAP с зашифрованным соединением (SSL включен) </li> </ul> <ul> <li><strong> Порт 25 </strong> Если ваш SMTP-сервер исходящей почты не использует SSL. * </li> <li><strong> Порт 465 </strong> или же <strong> 587 </strong> если ваш SMTP-сервер исходящей почты использует SSL </li> </ul> <p> * Примечание. По умолчанию порт 25 предназначен для исходящего доступа, а порт 110 - для входящего. Если вы не уверены в портах, обратитесь к своему интернет-провайдеру или системному администратору. </p> <p> </p> <h6> Шаг 5. Восстановите файл данных Outlook PST. </h6> <p> Следующим шагом для исправления сообщения об ошибке 0x80042112 Outlook Receiving является запуск средства восстановления папки «Входящие» для восстановления файла .pst. Подробные инструкции для этого можно найти в этом руководстве: <a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Как восстановить файл данных Outlook PST </a> . </p> <p> </p> <h6> Шаг 6. Проверьте размер сообщений электронной почты в Интернете. </h6> <p> Если у вас есть доступ к своей учетной записи электронной почты через Интернет, войдите в свою учетную запись электронной почты с помощью веб-браузера и проверьте, не является ли размер сообщения электронной почты проблемой. Например, если вы нашли большое письмо в папке «Входящие», загрузите его вложения, а затем удалите это письмо. * </p> <p> * Примечание. Если у вас нет доступа к своей учетной записи электронной почты через Интернет, обратитесь к поставщику услуг электронной почты, чтобы сообщить о проблеме. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}