{"title":"ИСПРАВЛЕНИЕ: у вас в настоящее время нет разрешения на доступ к этой папке на внешнем USB-накопителе (решено)","content":"<p> Это руководство содержит подробные инструкции по решению следующей проблемы при попытке доступа к внешнему USB-диску на ноутбуке HP с Windows 10: «В настоящее время у вас нет разрешения на доступ к этой папке. Нажмите« Продолжить », чтобы получить постоянный доступ к этой папке» . Ошибка сохраняется даже после нажатия кнопки «Продолжить» для получения доступа к диску. </p> <p><img src=\"images/image_thumb-18-636.png\" alt=\"You don't have permission to access this folder\" loading=\"lazy\"></p> <p> Странная ошибка «У вас нет разрешения на доступ к этой папке» появляется на новом <a href=\"http://www8.hp.com/us/en/products/laptops/product-detail.html?oid=17047142\" target=\"_blank\" rel=\"nofollow noopener\"> HP ProBook 450 G5 </a> портативный компьютер, когда пользователь пытается просмотреть содержимое подключенного USB-диска (флэш-накопитель, USB-накопитель и т. д.). </p> <p> После исследования проблемы я обнаружил, что проблема вызвана разрешениями безопасности, примененными к <a href=\"http://www8.hp.com/us/en/solutions/computer-security.html\" target=\"_blank\" rel=\"nofollow noopener\"> HP Client Security Manager </a> программа. HP Client Security Manager - это программа, разработанная Hewlett-Packard, которая позволяет защитить ваши данные, устройство и идентификационные данные за счет повышения безопасности вашего компьютера. </p> <h2> Как исправить: нет разрешения на доступ к USB-накопителю на ноутбуке HP (Windows 10/8/7). </h2> <p> 1. Открыть <strong> Менеджер HP Client Security </strong> . </p> <p><img src=\"images/image_thumb-13-716.png\" alt=\"HP Client Security manager\" loading=\"lazy\"></p> <p> </p> <p> 2. Затем нажмите <strong> Безопасность устройства. </strong></p> <p><img src=\"images/image_thumb-14-712.png\" alt=\"fix You Don't have permission to access this folder windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. На <strong> Администраторы </strong> на вкладке &quot;Удаленное хранилище&quot; установите значение <strong> Разрешить - полный доступ </strong> и нажмите <strong> Представлять на рассмотрение. </strong></p> <p><img src=\"images/image_thumb-15-364.png\" alt=\"fix You Don't have permission o access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Дополнительно (при желании) дать <strong> Полный доступ </strong> на съемный носитель для <strong> Стандартные пользователи </strong> . </p> <p><img src=\"images/image_thumb-19-269.png\" alt=\"no permission to access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Наконец, если вы не хотите, чтобы диспетчер доступа к устройствам HP управлял доступом к диску, перейдите к <strong> Настройки Диска </strong> и установите соответствующий переключатель в положение ВЫКЛ. </p> <p><img src=\"images/image_thumb-20-822.png\" alt=\"You don't have permission to access USB drive\" loading=\"lazy\"></p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этой проблеме. </p>"}