{"title":"ИСПРАВЛЕНИЕ: Adobe Reader DC - Сохранить как пусто (решено)","content":"<p> После автоматического обновления Adobe Reader DC возникла следующая проблема: функция «Сохранить как» отображает пустое (пустое) окно (пустое), которое не позволяет пользователю сохранить документ PDF. </p> <p><img src=\"images/image_thumb-38-290.png\" alt=\"Adobe Reader DC - Save As is blank - fix\" loading=\"lazy\"></p> <p> Это руководство содержит инструкции по решению следующей проблемы: функция «Сохранить как» не работает в Adobe Reader DC в Windows или MAC OS. </p> <h4> Как исправить: в Adobe Reader DC пусто поле «Сохранить как». </h4> <h6> Метод 1. Просканируйте вашу систему на наличие вирусов и вредоносных программ. </h6> <p> Первый шаг к решению проблемы «отсутствующих папок» в Outlook - убедиться, что ваша система не содержит вирусов и вредоносных программ. Для этой задачи следуйте инструкциям в этом руководстве: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Как проверить компьютер на вирусы и другие вредоносные программы. </a></p> <p> </p> <h6> Способ 2. Отключите онлайн-хранилище при сохранении файлов. </h6> <p> 1. Из Adobe Reader DC <strong> Редактировать </strong> щелчок по меню <strong> Предпочтения </strong> . </p> <p><img src=\"images/image_thumb-39-749.png\" alt=\"save as not working fix in Adobe Reader DC\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Снимите отметку </strong> в <strong> Показывать онлайн-хранилище при сохранении файлов </strong> и нажмите <strong> ОК. * </strong></p> <p> * Примечание. При желании снимите флажок «Показывать онлайн-хранилище при открытии файлов». </p> <p><img src=\"images/image_thumb-40-312.png\" alt=\"save as blank - abobe reader DC - fix\" loading=\"lazy\"></p> <p> </p> <p> 3. Теперь попробуйте использовать функцию «Сохранить как» в Adobe DC. Проблема должна быть решена. </p> <p> </p> <h6> Метод 3. Удалите и переустановите Adobe Reader DC. </h6> <p> Последний способ устранить пустые окна в функции «Сохранить как» в Adobe DC - это полностью удалить Adobe Reader DC, а затем загрузить и переустановить последнюю версию программы с <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> здесь </a> . </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом. </p>"}