{"title":"ИСПРАВЛЕНИЕ: черный экран камеры Skype и другие проблемы с веб-камерой в Windows 10.","content":"<p> Проблема с черным / пустым экраном камеры Skype является одной из наиболее распространенных проблем в Windows 10 и может быть вызвана рядом причин, поэтому вот пошаговое руководство по ее устранению. </p> <p> В Windows 10 новое обновление может вызвать множество проблем с интегрированной веб-камерой, при этом камера может не работать или камера может не распознаваться в некоторых приложениях, в то время как в других она работает должным образом. Например, я видел случай, когда камера работала без проблем в приложениях Webex и Zoom, а в Skype отображался черный экран. </p> <p> Это руководство содержит пошаговые инструкции по устранению нескольких проблем со встроенной камерой на ноутбуках с Windows 10: * </p> <ul> <li><em> Веб-камера / камера не работает в Windows 10 </em></li> <li><em><em> Веб-камера / Камера </em> Перестал работать после обновления в Windows 10. </em></li> <li><em> Веб-камера не работает в некоторых приложениях (Skype, Windows Hello WebEx и т. Д.). </em></li> <li><em> Веб-камера отображает черный (или пустой) экран при использовании в Skype. </em></li> <li><em> Веб-камера работает в Skype, но в окне предварительного просмотра камеры отображается черный экран </em> . </li> <li> Приложения не могут распознать или найти камеру / веб-камеру </li> </ul> <p><strong> * Уведомление для владельцев Lenovo ThinkPad: </strong> Если у вас есть одна из моделей ThinkPad, перечисленных в таблице ниже, загрузите и установите этот <a href=\"/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/DC8297800EA7/Integrated%20Camera%20Driver%20Registry%20Patch%20for%20Windows%2010%20(Version%201709%20or%20later)%20-%20ThinkPad\" target=\"_blank\" rel=\"nofollow noopener\"> патч реестра от Lenovo. </a> Патч устраняет проблему, из-за которой встроенный драйвер камеры может некорректно работать после обновления до Windows 10 версии 1709 или более поздней. </p> <p><img src=\"images/image_thumb-30-725.png\" alt=\"THinkpad Registry Fix for Integrated Camera\" loading=\"lazy\"></p> <h2> Как исправить: проблемы с веб-камерой в Windows 10. </h2> <p> </p> <h3> Шаг 1. Разрешите камерам доступ к приложениям. </h3> <p> В Windows 10 камера и микрофон могут быть недоступны для приложений из-за настроек конфиденциальности, которые могли быть применены. Итак, продолжайте и позвольте приложению, у которого возникла проблема с камерой, получить доступ к вашей камере. Например, если вы столкнулись с проблемой камеры в Skype, действуйте следующим образом: </p> <p> 1. Перейдите к <strong> Начинать </strong> меню <img src=\"images/image_thumb-12-696.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Настройки </strong> -&gt; <strong> Конфиденциальность </strong> . <br> 2. Выберите <strong> Камера </strong> на левой панели и справа: </p> <blockquote><p> а. Гарантировать, что <strong> Доступ к камере для этого устройства </strong> является <strong> на. </strong> Если нет, щелкните <strong> Изменять </strong> и установить на <strong> НА. </strong><br> б. Затем установите <strong> На </strong> в <strong> Разрешить приложениям доступ к переключателю камеры </strong> . </p> <p><img src=\"images/image_thumb-20-105.png\" alt=\"Allow Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Теперь прокрутите вниз и… </p> <p> c. Если у вас возникла проблема с черным экраном камеры на <strong> Skype </strong> магазин, прокрутите вниз и на <strong> Выберите, какие приложения Microsoft Store могут получить доступ к вашей камере </strong> раздел, набор <strong> Skype </strong> к <strong> На. </strong></p> <p><img src=\"images/image_thumb-21-826.png\" alt=\"Allow Store Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> d. Если вы видите черное окно вашей камеры во время использования <strong> Skype для Windows </strong> (настольное приложение), затем убедитесь, что <strong> Разрешить настольным приложениям доступ к вашей камере </strong> переключатель <strong> На </strong> . </p> <p><img src=\"images/image_thumb-22-558.png\" alt=\"Allow Applications to Access Camera Windows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h3> Шаг 2. Проверьте, правильно ли работает ваша камера. </h3> <p> Одним из первых шагов по устранению неполадок веб-камеры является подтверждение того, что она работает в приложении Windows 10 Camera. </p> <p> 1. В поле поиска введите <strong> камера </strong> , чтобы открыть приложение &quot;Камера&quot;. <br> 2. Нажмите на лупу и найдите &quot; <strong> камера </strong> &quot;. <br> 3. Откройте <strong> Камера </strong> заявление </p> <p><img src=\"images/image_thumb-23-730.png\" alt=\"Open Camera app Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Теперь, в зависимости от результата, действуйте следующим образом: </p> <blockquote><p> A. Если ваша камера работает, вы должны увидеть свое изображение на экране. В этом случае продолжайте и проверьте свою камеру в Skype или в любом другом приложении, которое вы используете. Если веб-камера не работает или отображает черный экран, выполните следующие действия в указанном порядке: </p> <ol> <li> Попробуй <strong> удалить </strong> а также <strong> переустановить </strong> приложение с проблемой камеры (например, Skype). </li> <li> Перейдите к включению или отключению режима сервера кадров в реестре, следуя инструкциям на <a href=\"#step-3\" target=\"_blank\" rel=\"nofollow noopener\"> шаг 3 </a> . </li> </ol> <p> Б. Если ваша камера не работает в приложении «Камера», может произойти одно из следующих событий: </p> <ol> <li> Драйвер устройства камеры неправильный или поврежден. В этом случае перейдите к устранению неполадок с драйверами камеры, следуя инструкциям на <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> шаг-4 </a> . </li> <li> Камера повреждена и совсем не работает. В этом случае обратитесь в мастерскую по ремонту компьютеров, чтобы починить веб-камеру, или используйте внешнюю USB-камеру. </li> </ol> </blockquote> <h3></h3> <h3> Шаг 3. Исправьте проблему с черным экраном веб-камеры в реестре Windows 10. </h3> <p> Если камера распознается и работает без проблем в некоторых приложениях, но не работает в других или отображает черный экран в Skype, попробуйте отключить или включить «Режим сервера кадров» в реестре. </p> <p> 1. Откройте редактор реестра: для этого: </p> <blockquote><p> 1. Нажмите Windows <img src=\"images/image_thumb41-284.png\" alt=\"image\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. Тип <strong> regedit </strong> и нажмите <strong> Входить </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-845.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> 3. В редакторе реестра перейдите к следующему разделу на левой панели: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ \\ Microsoft \\ Windows Media Foundation \\ Платформа </li> </ul> <p> 4. <strong> Щелкните правой кнопкой мыши </strong> в пустом месте на правой панели и выберите <strong> Новое -&gt; Значение DWORD (32 бита). </strong></p> <p><img src=\"images/image_thumb-24-839.png\" alt=\"Fix Webcam black Screen Windows 10\" loading=\"lazy\"></p> <p> 5. Дайте имя <strong> EnableFrameServerMode </strong> к новому значению. <br> 6. Дважды щелкните вновь созданное значение и убедитесь, что данные значения <strong>0</strong> . (Нуль). Нажмите <strong> ОК. </strong></p> <p><img src=\"images/image_thumb-25-764.png\" alt=\"Fix Webcam issues Windows 10\" loading=\"lazy\"></p> <p> 7. Теперь выполните те же шаги, описанные выше (4,5 и 6), и внесите те же изменения в этот ключ: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ \\ WOW6432Node \\ Microsoft \\ Windows Media Foundation \\ Platform </li> </ul> <p> 8. Когда закончите, <strong> Закрыть </strong> Редактор реестра и <strong> запустить снова </strong> ваш компьютер. <br> 9. После перезапуска запустите Skype и проверьте, решена ли проблема с веб-камерой. Если нет, выполните те же действия, но на этот раз <strong> включить </strong> в <strong> EnableFrameServerMode </strong> изменив его значение с <strong>0 </strong> к <strong> 1 </strong> а также <strong> запустить снова </strong> снова ваш компьютер. </p> <p> </p> <h3> Шаг 4. Устраните неполадки с драйвером веб-камеры. </h3> <p> Следующим шагом для решения проблем с камерой в Windows 10 является откат или удаление / переустановка драйверов камеры. 1. Открыть <strong> Диспетчер устройств </strong> . Для этого: </p> <blockquote><p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-696.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. В поле «Открыть» введите: <strong> devmgmt.msc </strong> и щелкнуть <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-5-837.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Разверните <strong> Представьте себе устройства </strong> (или же <strong> Камеры </strong> ) <br> 3. <strong> Щелкните правой кнопкой мыши </strong> на ваше <strong> Камера </strong> и выберите <strong> Характеристики. </strong></p> <p><img src=\"images/image_thumb-26-673.png\" alt=\"Camera Properties\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 4. Выберите <strong> Водитель </strong> tab и действуйте следующим образом в зависимости от вашего случая: </p> <blockquote><p> A. Если ваша веб-камера работала раньше, <strong> Откат драйвера </strong> а также <strong> перезапуск </strong> t ваш компьютер. Затем проверьте, работает ли ваша камера. </p> <p><img src=\"images/image_thumb-27-454.png\" alt=\"Roll Back Driver - Camera\" loading=\"lazy\"></p> <p> </p> <p> Б. Если ваша камера никогда раньше не работала или если вы впервые пробуете ее (например, после новой установки Windows), попробуйте выполнить следующее в следующем порядке: </p> <ol> <li> Щелкните значок <strong> Обновить драйвер </strong> вариант, чтобы проверить наличие обновленного драйвера для вашей камеры. Если Windows обнаружит новый драйвер, установите его, а затем проверьте свою веб-камеру. Иначе… </li> <li> Нажмите <strong> Удалить устройство </strong> чтобы удалить веб-камеру, а затем <strong> запустить снова </strong> ваш компьютер. После перезагрузки проверьте, работает ли ваша камера. Если не… </li> <li> Перейдите на сайт поддержки производителя вашего ноутбука, проверьте, доступен ли новый драйвер для вашей веб-камеры, и установите его. </li> </ol> </blockquote> <h3> Дополнительная помощь по устранению проблем с камерой в Windows 10. </h3> <p> Если после описанных выше действий проблемы с веб-камерой все еще возникают, попробуйте следующее: </p> <ol> <li> <p> Установите все доступные обновления Windows 10 ( <strong> Начинать </strong> -&gt; <strong> Настройки </strong> -&gt; <strong> Обновление и безопасность </strong> и нажмите <strong> Проверить обновления). </strong></p> </li> <li> <p> Обновите Windows 10 до последней версии с помощью <strong> Помощник по обновлению. </strong> (Для этого перейдите к этому <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"noopener\"><strong> ссылка на сайт </strong></a> и щелкните <strong> Обновить сейчас </strong> кнопка). </p> </li> <li> <p><a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"noopener\"><strong> Обновите Windows 10 </strong> . </a></p> </li> </ol> <p> Вот и все, ребята! Это сработало для вас? Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}