{"title":"ИСПРАВЛЕНИЕ: панель столбцов Outlook (панель заголовка) исчезает в Outlook 2016/2019. (Решено)","content":"<p> Несколько дней назад один из моих клиентов связался со мной и сообщил, что в Outlook 2019 отсутствует полоса с заголовками столбцов («Отправить», «От», «Тема», «Получено», «Размер» и т. Д.). В частности, строка с Заголовки столбцов исчезли после того, как пользователь настроил «Параметры просмотра» и увеличил размер шрифта ROW. </p> <p><img src=\"images/image_thumb-567.png\" alt=\"FIX: Outlook Columns Bar (Header Bar) Disappear in Outlook 2016/2019\" loading=\"lazy\"></p> <p> В этом руководстве содержатся инструкции по устранению проблемы «Отсутствует строка заголовка Outlook (строка столбцов)» в Outlook 2016/2019. </p> <h4> Как исправить: в Outlook 2016/2019 отсутствует строка заголовка столбца. </h4> <p> 1. На левой панели с папками Outlook выберите папку, в которой вы не видите строку со столбцами (заголовками). </p> <p> 2. В строке меню выберите <strong> Вид </strong> а затем щелкните <strong> Просмотр настроек </strong> . </p> <p><img src=\"images/image_thumb-1-535.png\" alt=\"FIX Column Heading Row is Missing Outlook 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. В параметрах «Дополнительные параметры просмотра» нажмите <strong> Другие настройки </strong> . </p> <p><img src=\"images/image_thumb-2-711.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. В параметрах &quot;Другие настройки&quot; <strong> снимите отметку </strong> в <strong> Используйте компактный макет размером менее 125 символов </strong> флажок и щелкните <strong> ОК </strong> дважды, чтобы применить настройку и закрыть все окна. </p> <p><img src=\"images/image_thumb-3-736.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Перезапустите Outlook (или перейдите в другую папку и вернитесь к папке, в которой вы применили изменение), чтобы снова увидеть полосу с заголовками столбцов. </p> <p><img src=\"images/image_thumb-4-249.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Это все! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-5.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p>"}