{"title":"ИСПРАВЛЕНИЕ: папка Outlook DRAFTS отсутствует в области навигации в Outlook 2013, 2010 или 2007. (решено)","content":"<p> У одного из моих клиентов возникла следующая проблема: внезапно и без очевидной причины папка «Черновики» отсутствует на панели навигации в Outlook 2013. Первое действие по восстановлению отсутствующей папки «Черновики» - поиск во всех других папках Outlook, чтобы сделать убедитесь, что папка не была перемещена или удалена по ошибке. Если вы по-прежнему не можете найти отсутствующую папку, перейдите к следующему разделу, чтобы устранить проблему. </p> <p><img src=\"images/image_thumb-37-460.png\" alt=\"Drafts folder Missing Outlook\" loading=\"lazy\"></p> <p> </p> <p> В этом руководстве содержатся инструкции по восстановлению отсутствующей папки в Outlook 2007, 2010, 2013, 2016 или 365. </p> <h4> Как восстановить отсутствующую папку из области навигации Outlook. </h4> <h6> Метод 1. Просканируйте вашу систему на наличие вирусов и вредоносных программ. </h6> <p> Первый шаг к решению проблемы «отсутствующих папок» в Outlook - убедиться, что ваша система не содержит вирусов и вредоносных программ. Для этой задачи следуйте инструкциям в этом руководстве: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Как проверить компьютер на вирусы и другие вредоносные программы. </a></p> <p> </p> <h6> Способ 2. СБРОСИТЬ папки Outlook. </h6> <p> После сканирования на вирусы продолжите и сбросьте папки Outlook по умолчанию, используя процесс, описанный ниже: </p> <p> 1. Закройте приложение Outlook. <br> 2. Нажмите кнопку <strong> Окна </strong> <img src=\"images/image_thumb8_thumb_thumb-622.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 3. В поле поиска введите: <strong> Outlook / resetfolders </strong> и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-36-732.png\" alt=\"outlook reset folders\" loading=\"lazy\"></p> <p> </p> <p> 4. Откроется Outlook, и все пропавшие папки будут восстановлены. </p> <p> Вот и все, ребята! Это сработало для вас? </p> <p> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом. </p>"}