{"title":"ИСПРАВЛЕНИЕ: Ошибка восстановления системы 0x8100010B (решена)","content":"<p> Это руководство содержит инструкции по устранению ошибки восстановления системы 0x8100010B в Windows 10. Ошибка 0x8100010B может появиться при попытке увеличить максимальное использование пространства для защиты системы или при попытке удалить все предыдущие точки восстановления. </p> <p><img src=\"images/image_thumb-19-393.png\" alt=\"FIX System Restore Error 0x8100010B\" loading=\"lazy\"></p> <p> В частности, эта статья содержит инструкции по устранению следующей проблемы при восстановлении системы: </p> <p><strong> 1. Невозможно увеличить максимальное дисковое пространство для защиты системы. </strong> с ошибкой: &quot;Произошла <strong> непредвиденная ошибка на странице свойств </strong> : Имя файла, имя каталога или синтаксис метки тома неверны. (0x8007007B)). </p> <p><strong> 2. Невозможно удалить точки восстановления. </strong> в Windows 10 с ошибкой: «Не удалось удалить точки восстановления по следующей причине: Windows не смогла удалить все снимки. Повторите попытку или просмотрите журнал событий для получения дополнительных сведений. (0x8100010B)». </p> <h2> Как исправить: ошибка 0x8100010B в защите от восстановления системы. </h2> <p> 1. <strong> Запустить снова </strong> ваш компьютер. </p> <p> 2. Перейдите к <strong> Системная защита </strong> настройки: </p> <ul> <li><b> Панель управления&gt; Система&gt; Расширенные настройки системы&gt; Свойства системы&gt; Защита системы </b></li> </ul> <p> 3. Выделите <strong> Локальный диск C: (Система) </strong> и нажмите <strong> Настроить. </strong></p> <p><img src=\"images/image_thumb-22-902.png\" alt=\"0x8100010B System Protection\" loading=\"lazy\"></p> <p> </p> <p> 4. Выберите <strong> Отключить защиту системы </strong> и нажмите <strong> Применить&gt; ОК. </strong> * </p> <p> * Примечание. Это действие приведет к безвозвратному удалению всех предыдущих точек восстановления. Если вы хотите увеличить максимальное использование пространства для защиты системы без потери точек восстановления, введите следующую команду в командной строке с повышенными привилегиями и посмотрите, устранена ли проблема. </p> <ul> <li> vssadmin изменить размер shadowstorage / For = C: / On = C: / MaxSize = 15% </li> </ul> <p><img src=\"images/image_thumb-23-863.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Закрывать </strong> а также <strong> снова открыть </strong> настройки защиты системы. </p> <p> 6. Теперь выберите <strong> Включите защиту системы </strong> , настройте максимальное использование и нажмите <strong> ОК </strong> . </p> <p> 7. В разделе Параметры защиты системы выберите <strong> Включите защиту системы </strong> и нажмите <strong> ОК. </strong></p> <p><img src=\"images/image_thumb-73-430.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> Это все! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}