{"title":"ИСПРАВЛЕНИЕ: доверительные отношения между этой рабочей станцией и основным доменом не удалось (решено)","content":"<p> Если вы получаете сообщение об ошибке «Не удалось установить доверительные отношения между этой рабочей станцией и основным доменом» при попытке войти в систему в своем домене или при попытке получить доступ к общей папке на другом компьютере в домене, продолжайте читать ниже, чтобы решить проблему. </p> <p> Ошибка «Сбой доверительных отношений между рабочей станцией и основным доменом» может появляться по следующим причинам: </p> <ul> <li> Компьютер имеет то же имя, что и другой компьютер в Домене. </li> <li> Учетные данные домена (имя пользователя или пароль) недействительны. </li> <li> Срок действия учетной записи компьютера истек. * </li> </ul> <p> * Примечание. Некоторые организации собирают компьютеры (или клоны компьютеров) для дальнейшего использования. Если срок действия учетной записи компьютера истек, он больше не сможет аутентифицироваться в домене. В таких случаях компьютеры, которые не могут пройти аутентификацию в домене, должны быть удалены из домена и повторно присоединены к нему. (шаг-4) </p> <p><img src=\"images/image_thumb-32-740.png\" alt=\"FIX: Trust Relationship Between this Workstation and the Primary Domain Failed \" loading=\"lazy\"></p> <h4> Как исправить: не удалось установить доверительные отношения между рабочей станцией и доменом. </h4> <h6> Метод 1. Убедитесь, что учетные данные домена верны. </h6> <p> Прежде всего убедитесь, что учетные данные верны, особенно пароль. если вы клонировали машину с компьютерного изображения, сделанного в прошлом, и с тех пор код изменился. </p> <h6> Метод 2. Проверьте повторяющиеся имена компьютеров. </h6> <p> Убедитесь, что имя компьютера уникально и в сети нет другого компьютера с таким именем. </p> <h6> Метод 3. Проверьте наличие повторяющихся IP-адресов. </h6> <p> Убедитесь, что IP-адрес компьютера уникален и не конфликтует с другим IP-адресом в сети. </p> <h6> Метод 4. Удаление и повторное присоединение компьютера к домену. </h6> <p> Обычным методом исправления доверительных отношений между компьютером и доменом является удаление и повторное добавление затронутого компьютера в домен. </p> <h5> Шаг 1. Удалите учетную запись компьютера из домена. </h5> <p> 1. Войдите на сервер Active Directory. <br> 2. Открыть <strong> Пользователи и компьютеры Active Directory. <br> </strong> 3. Разверните <strong> Компьютеры </strong> контейнер. <br> 4. Щелкните правой кнопкой мыши пораженный компьютер и выберите <strong> Удалить. </strong></p> <p><img src=\"images/image_thumb-39-366.png\" alt=\"Delete Computer Account from Domain\" loading=\"lazy\"></p> <h5> Шаг 1. Удалите и повторно присоедините компьютер к домену. </h5> <p> 1. Войдите на зараженный компьютер с учетной записью ЛОКАЛЬНОГО администратора (Имя компьютера \\ Администратор). </p> <p> 2. Нажмите Windows <img src=\"images/image_thumb8_thumb-480.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. </p> <p> 2а. Тип <strong> sysdm.cpl </strong> и щелкнуть <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb7_thumb-169.png\" alt=\"system properties\" loading=\"lazy\"></p> <p> 3. На вкладке &quot;Имя компьютера&quot; нажмите <strong> Изменять </strong> . </p> <p><img src=\"images/image_thumb-37-924.png\" alt=\"Remove Computer from Domain\" loading=\"lazy\"></p> <p> 4. В разделе &quot;Член&quot; выберите <strong> Рабочая группа </strong> введите название рабочей группы (например, &quot;WORKGROUP&quot;) и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-34-169.png\" alt=\"Change Computer Name - Membership\" loading=\"lazy\"></p> <p> 5. Введите учетные данные администратора и щелкните <strong> ОК </strong> . <br> 6. <strong> Запустить снова </strong> компьютер. </p> <p> 7. Повторите шаги 1–4 еще раз, но на этот раз на шаге 4 выберите <strong> Домен, </strong> введите доменное имя и нажмите <strong> ОК. </strong></p> <p><img src=\"images/image_thumb-38-928.png\" alt=\"Add computer to domain\" loading=\"lazy\"></p> <p> 8. Введите учетные данные администратора домена и щелкните <strong> ОК </strong> . <br> 9. <strong> Запустить снова </strong> свой компьютер и войдите в домен, используя учетную запись пользователя домена. </p> <h6> Способ 5. Сбросить учетную запись компьютера в домене. </h6> <p> 1. Войдите на сервер Active Directory. <br> 2. Открыть <strong> Пользователи и компьютеры Active Directory. <br> </strong> 3. Разверните <strong> Компьютеры </strong> контейнер. <br> 4. Щелкните правой кнопкой мыши пораженный компьютер и выберите <strong> Сбросить Аккаунт. </strong></p> <p><img src=\"images/image_thumb-36-935.png\" alt=\"Reset Computer Account in Domain\" loading=\"lazy\"></p> <p> 5. Наконец, <strong> запустить снова </strong> в <strong> пораженная машина </strong> и войдите в домен. </p> <p> Вот и все, ребята! Какой метод сработал для вас? Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}