{"title":"ИСПРАВЛЕНИЕ: Outlook Receiving сообщил об ошибке 0x80042108 (решено)","content":"<p> В этом руководстве содержатся пошаговые инструкции по исправлению ошибки Outlook Receiving Reported 0x80042108. Ошибка Outlook 0x80042108 обычно возникает, когда вы неправильно ввели имя почтового сервера POP3 или потому что у вас нет доступа к Интернету. </p> <p> Проблема в деталях. Outlook 2003, 2007, 2010 или Outlook 2013 отображает следующую ошибку во время процедуры отправки-получения: «Получение сообщения об ошибке (0x80042108): Outlook не может подключиться к вашему почтовому серверу входящей (POP3)». Если вы продолжаете получать это сообщение обратитесь к администратору сервера или поставщику услуг Интернета (ISP) ». </p> <p><img src=\"images/outlookerror_0x80042108-505.png\" alt=\"Outlook Error 0x80042108\" loading=\"lazy\"></p> <p> Ошибка Outlook «0x80042108» может возникать в любой версии Outlook (2016, 2013, 2010 или 2007) и появляется, когда программа почтового клиента Outlook не может подключиться к почтовому серверу. </p> <h4> Как исправить ошибку 0x80042108 в Outlook 2007, 2010, 2013 или 2016. </h4> <h6> Шаг 1. Проверьте подключение к Интернету. </h6> <p> Первым шагом к устранению ошибки получения Outlook 80042108 является проверка подключения к Интернету. Итак, откройте свой Интернет-браузер и посетите любой веб-сайт, чтобы убедиться, что ваше Интернет-соединение работает. </p> <h6> Шаг 2. Проверьте настройки почтового сервера POP3. </h6> <p> Второй шаг для исправления ошибки получения Outlook 0x80042108 - это проверить, правильно ли вы указали настройки почтового сервера. Итак, обратитесь к своему провайдеру электронной почты и убедитесь, что вы правильно ввели имя сервера входящей почты и номер порта. Чтобы просмотреть и изменить настройки почтового сервера: </p> <p> 1. Откройте Outlook. <br> 2. Перейти к <strong> Файл </strong> -&gt; <strong> Настройки аккаунта </strong> . </p> <p><img src=\"images/image_thumb-7-811.png\" alt=\"switch Account Mail Merge \" loading=\"lazy\"></p> <p> </p> <p> 3. В <strong> Электронное письмо </strong> на вкладке, дважды щелкните свою учетную запись электронной почты, чтобы изменить / просмотреть ее настройки. <br> 4. Убедитесь, что вы установили правильное имя сервера входящей почты в соответствующем поле. <br> 5. Когда закончите, нажмите <strong> Больше настроек </strong> . </p> <p><img src=\"images/image_thumb-31-256.png\" alt=\"FIX: Outlook Receiving reported error 0x80042108\" loading=\"lazy\"></p> <blockquote><p> </p></blockquote> <p> 6. Щелкните значок <strong> Передовой </strong> и убедитесь, что вы указали правильный порт и настройку SSL для входящего сервера (POP3). </p> <p> </p> <p><img src=\"images/image_thumb-33-400.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Когда закончите, нажмите <strong> ОК </strong> а затем закройте все открытые окна. <br> 7. Проверьте Outlook еще раз. </p> <h6></h6> <h6> Шаг 3. Проверьте настройки антивируса и брандмауэра. </h6> <p> Если вы используете антивирусную программу с функциями сканирования электронной почты, тогда <a href=\"https://www.repairwin.com/how-to-disable-add-ins-in-word-outlook-or-excel-2016-2013-2010-2007-or-2003/\" target=\"_blank\" rel=\"nofollow noopener\"> отключить надстройку антивируса в Outlook </a> или временно отключите антивирусную защиту или удалите антивирусную программу. Кроме того, проверьте настройки брандмауэра и убедитесь, что используемые вами порты почтового сервера не заблокированы программой брандмауэра. В частности, в настройках вашего брандмауэра: </p> <p> A. Включите следующие файлы для доступа в Интернет: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> Б. Включите следующие порты для доступа в Интернет: </p> <ul> <li><strong> Порт 110 </strong> (Если вы используете сервер входящей почты POP3 без зашифрованного соединения) * </li> <li><strong> Порт 995 </strong> (Если вы используете сервер входящей почты POP3 с зашифрованным соединением (SSL включен) </li> </ul> <ul> <li><strong> Порт 143 </strong> (если вы используете сервер входящей почты IMAP без зашифрованного соединения) </li> <li><strong> Порт 993 </strong> (если вы используете сервер входящей почты IMAP с зашифрованным соединением (SSL включен) </li> </ul> <ul> <li><strong> Порт 25 </strong> Если ваш SMTP-сервер исходящей почты не использует SSL. * </li> <li><strong> Порт 465 </strong> или же <strong> 587 </strong> если ваш SMTP-сервер исходящей почты использует SSL </li> </ul> <p> * Примечание. По умолчанию порт 25 предназначен для исходящего доступа, а порт 110 - для входящего. Если вы не уверены в портах, обратитесь к своему интернет-провайдеру или системному администратору. </p> <p> </p> <p><strong> Дополнительная помощь: </strong> Если описанные выше методы не помогли, попробуйте следующее: </p> <p><strong> А. </strong> Удалите и снова добавьте свою учетную запись электронной почты. <br> <strong> Б. </strong><a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Восстановить файл данных Outlook PST </a> . <br> <strong> С. </strong> Отключитесь от VPN-соединения (если вы подключены) <br> <strong> Д. </strong> Ремонт офисной установки. Для этого: </p> <blockquote><p> 1. Перейдите в Windows. <strong> Панель управления </strong> &gt; <strong> Программы и компоненты </strong> . <br> 2. Найдите и выберите приложение MS Office, а затем щелкните <strong> Изменять </strong> . <br> 3. Затем выберите <strong> Ремонт </strong> вариант. </p></blockquote> <p> </p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? </p> <p> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}