{"title":"ИСПРАВЛЕНИЕ: Невозможно подключиться к общему файловому ресурсу, потому что он небезопасен и требует устаревшего протокола SMB1. (Решено)","content":"<p> Если вы попытаетесь подключиться к общей сетевой папке с ПК с Windows 10 и получите сообщение об ошибке «Вы не можете подключиться к общей папке, потому что она небезопасна. Для этой общей папки требуется устаревший протокол SMB1, который небезопасен и может раскрыть Ваша система может атаковать. Ваша система требует SMB2 или выше. Для получения дополнительных сведений об устранении этой проблемы см. https://go.microsoft.com/fwlink/?linkid=852747 &quot;, а затем продолжите ниже, чтобы устранить проблему. </p> <p><img src=\"images/image_thumb-30-812.png\" alt=\"You can't connect to the file share because it's not secure. This share requires the obsolete SMB1 protocol, which is unsafe...\" loading=\"lazy\"></p> <p> В Windows 10 v1709 и более поздних версиях сетевой протокол Server Message Block версии 1 (SMBv1) не установлен по умолчанию и должен быть включен вручную, если вы хотите получить доступ к общей папке на рабочей станции или сервере, который использует протокол SMBv1 для обмен файлами. </p> <p> Это руководство содержит инструкции по устранению следующих ошибок при попытке подключиться к общей папке в Windows 10: </p> <ul> <li> <p><em> Вы не можете подключиться к общему файловому ресурсу, потому что это небезопасно. Этот общий ресурс требует устаревшего протокола SMB1, что небезопасно… </em></p> </li> <li> <p><em> Указанное сетевое имя больше не доступно </em></p> </li> <li> <p><em> Неизвестная ошибка 0x80004005 </em></p> </li> <li> <p><em> Указанный сервер не может выполнить запрошенную операцию. </em></p> </li> </ul> <h4> Как исправить: не удается подключиться к общему файловому ресурсу из-за отсутствия протокола SMBv1 (Windows 10) </h4> <p> 1. Перейдите к <strong> Панель управления </strong> -&gt; <strong> Программы и компоненты </strong> . <br> 2. Щелкните <strong> Включение и отключение функций Windows </strong> слева. </p> <p> </p> <p><img src=\"images/image_thumb-68-359.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Разверните параметр «Поддержка общего доступа к файлам SMB 1.0 / CIFS» и <strong> проверять </strong> в <strong> Клиент SMB 1.0 / CIFS </strong> вариант. Нажмите <strong> ОК </strong> когда закончите. </p> <p><img src=\"images/image_thumb-29-360.png\" alt=\"Install SMBv1 Windows 10\" loading=\"lazy\"></p> <p> 4. После установки SMB 1.0 / CIFS нажмите кнопку <strong> Перезагрузить сейчас </strong> кнопку, чтобы перезагрузить компьютер. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}