{"title":"ИСПРАВЛЕНИЕ: VeraCrypt не отвечает (зависает) при отключении в Windows 10 (решено)","content":"<p> Это руководство содержит инструкции по устранению следующей проблемы с VeraCrypt на компьютере под управлением Windows 10: VeraCrypt не отвечает и зависает (зависает) при отключении зашифрованного тома. </p> <p> Подробное описание проблемы VeraCrypt Not Responding (Freezing): при попытке отключить том (со всеми файлами, закрытыми с подключенного тома) VeraCrypt зависает и отображает сообщение «Not Responding». Когда появляется эта проблема, единственный способ восстановить Windows до нормального состояния - это завершить процесс VeraCrypt из диспетчера задач. </p> <p> В соответствии <a href=\"https://www.veracrypt.fr/en/Issues%20and%20Limitations.html\" target=\"_blank\" rel=\"nofollow noopener\"> VeraCrypt </a> проблема зависания вызвана конфликтом между диалоговым окном ожидания VeraCrypt, отображаемым во время операций монтирования / размонтирования, и другим программным обеспечением, установленным на машине (например, антивирусом или брандмауэром). </p> <h4> Как исправить: VeraCrypt не отвечает при размонтировании / монтировании тома. </h4> <p> Эта проблема вызвана конфликтом между диалоговым окном ожидания VeraCrypt, отображаемым во время операций монтирования / размонтирования, и другим программным обеспечением, установленным на машине (например, Outpost Firewall Pro). </p> <p> 1. Из VeraCrypt <strong> Настройки </strong> меню выберите <strong> Предпочтения </strong> . </p> <p><img src=\"images/image_thumb-63-122.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Проверять </strong> в <strong> Не показывать диалоговое окно с сообщением об ожидании при выполнении операций </strong> опция нажмите <strong> ОК. </strong></p> <p><img src=\"images/image_thumb-64-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Теперь приступайте к монтированию / размонтированию томов без зависания! </p> <p> Вот и все, ребята! Это сработало для вас? Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}