{"title":"ИСПРАВЛЕНИЕ: Сервер недоступен. Возможно, у вас нет разрешения на использование этого сетевого ресурса. Дескриптор недействителен. (Решено)","content":"<p> В этом руководстве содержатся инструкции по исправлению следующей ошибки при попытке доступа к общей папке в сети: «Сервер недоступен. Возможно, у вас нет разрешения на использование этого сетевого ресурса. Свяжитесь с администратором этого сервера, чтобы узнать, есть ли у вас доступ. разрешения. Дескриптор недействителен &quot;. </p> <p><img src=\"images/image_thumb-5-437.png\" alt=\"You might not have permission to use this network resource\" loading=\"lazy\"></p> <p> </p> <h2> Как исправить: невозможно получить доступ к общей папке. Возможно, у вас нет разрешения на использование этого сетевого ресурса. Дескриптор недействителен. </h2> <p> Обычно проблема подключения к файлу общего доступа «Возможно, у вас нет разрешения на использование этого сетевого ресурса» появляется, когда пользователь пытается получить доступ к общей сетевой папке, не имея необходимых разрешений. В этом случае и для решения проблемы необходимо убедиться, что у пользователя есть соответствующие разрешения на доступ к общей папке. </p> <p> Однако, если вы знаете, что разрешения пользователя на общую папку верны и проблема с подключением «Возможно, у вас нет разрешения на использование этого сетевого ресурса» возникла внезапно и без очевидной причины, то проблема, вероятно, связана с установкой Windows. Обновлять. В этом случае продолжайте читать ниже, чтобы устранить проблему. </p> <p> * Примечание: если вы столкнулись с ошибкой общего доступа в середине января 2019 года, то виновником является следующее обновление безопасности Windows: <a href=\"https://support.microsoft.com/el-gr/help/4480970/windows-7-update-kb4480970\" target=\"_blank\" rel=\"nofollow noopener\"> 8 января 2019 г. - KB4480970 (ежемесячный накопительный пакет) </a> . </p> <h6> Метод 1. Удалите последнее обновление Windows. </h6> <p> На машине с общей папкой: </p> <p> 1. Щелкните правой кнопкой мыши значок «Мой компьютер» и выберите <strong> Характеристики </strong> . <br> 2. Щелкните <strong> Центр обновления Windows </strong> . </p> <p><img src=\"images/image_thumb-6-686.png\" alt=\"fix Network Shared Folder is Not Accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. Щелкните <strong> Установленные обновления </strong> . </p> <p><img src=\"images/image_thumb-7-999.png\" alt=\"fix cannot access shared folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Отсортируйте обновления по дате установки, нажав <strong> Установлен на. </strong></p> <p><img src=\"images/image_thumb-8-158.png\" alt=\"uninstall windows update\" loading=\"lazy\"></p> <p> </p> <p> 5. Выделите последнее установленное обновление для Windows и нажмите <strong> Удалить. </strong> * </p> <p> * например, Если вы столкнулись с ошибкой общего доступа в середине января 2019 года, продолжите и удалите «Обновление безопасности для Microsoft Windows KB4480970». </p> <p><img src=\"images/image_thumb-9-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Когда установка будет завершена, <strong> запустить снова </strong> компьютер. <br> 7. После перезапуска попробуйте еще раз получить доступ к общей папке с клиентского компьютера. Затем примените предложенные действия в соответствии с вашим случаем: </p> <ul> <li><strong> Случай А: </strong> Если проблема не исчезнет, ​​продолжите удаление всех последних установленных обновлений или продолжайте <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> способ 2 </a> ниже. </li> <li><strong> Случай B: </strong> Если проблема решена, запретите установку удаленного обновления в будущем. Для этого: </li> </ul> <blockquote><p> 1. Перейдите в Центр обновления Windows и <strong> Проверить обновления </strong> . <br> 2. Щелкните <strong> Важные обновления </strong> . </p></blockquote> <p><img src=\"images/image_thumb-22-393.png\" alt=\"view important updates\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 3. Щелкните проблемное обновление правой кнопкой мыши и выберите <strong> Скрыть обновление </strong> . <br> 4. Наконец нажмите <strong> ОК </strong> а затем закройте Центр обновления Windows. </p></blockquote> <p><img src=\"images/image_thumb-23-795.png\" alt=\"hide update windows 7\" loading=\"lazy\"></p> <h6> Способ 2. Верните компьютер в предыдущее рабочее состояние. </h6> <p> На машине с общей папкой: </p> <p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb-632.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. Тип <strong> Rstrui </strong> и нажмите <strong> ОК </strong> для запуска восстановления системы. </p> <p><img src=\"images/rstui-1-300x148-611.png\" alt=\"rstui\" loading=\"lazy\"></p> <p> </p> <p> 3. Щелкните <strong> Следующий </strong> на первом экране. <br> 4. Выберите более раннее рабочее состояние (Дата / Время) и нажмите <strong> Следующий </strong> чтобы начать процесс восстановления. </p> <p><img src=\"images/image_thumb-50-355.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. После восстановления системы попробуйте еще раз получить доступ к общей папке с клиентского компьютера. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этой проблеме. </p>"}