{"title":"ИСПРАВЛЕНИЕ: надстройка Outlook устанавливается для всех пользователей и не может быть удалена. (Решено)","content":"<p> Если вы не можете отключить или включить надстройку Outlook из-за ошибки » <em> Надстройка устанавливается для всех пользователей на этом компьютере и может быть подключена или отключена только администратором. </em> &quot;, продолжайте читать ниже, чтобы решить проблему. </p> <p><img src=\"images/image_thumb-76-527.png\" alt=\"The add-is installed for all users on this computer, and can only be connected or disconnected by an administrator\" loading=\"lazy\"></p> <p> Ошибка «Надстройка может быть отключена только администратором» появляется потому, что при установке надстройки вы выбираете установку для всех пользователей на компьютере. В этом случае единственным решением для устранения ошибки является удаление надстройки с правами администратора. </p> <h2> Как исправить: невозможно включить или отключить надстройку, поскольку она установлена ​​для всех пользователей в Outlook, Word или Excel. </h2> <p> Если вы не можете удалить или активировать надстройку приложения Microsoft Office из-за ошибки &quot; <em> Надстройка устанавливается для всех пользователей на этом компьютере и может быть подключена или отключена только администратором &quot;, </em> запустите соответствующее приложение от имени администратора и приступите к удалению надстройки без проблем. Для этого: </p> <p><strong> 1. </strong> Щелкните правой кнопкой мыши приложение Office, в котором вы столкнулись с упомянутой выше ошибкой (например, Outlook), и выберите <strong> Запустить от имени администратора. * </strong></p> <p> * Заметки: <strong><br> </strong> 1. Если вы не видите параметр «Запуск администратора», нажмите и удерживайте <strong> СДВИГ </strong> ключ и <strong> щелкните правой кнопкой мыши </strong> в приложении Office вы сталкиваетесь с ошибкой. <br> 2. Если вы щелкните правой кнопкой мыши приложение Office из Windows 10 <strong> Начинать </strong> меню <img src=\"images/image_thumb2_thumb_thumb-340.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Программ </strong> , перейти к <strong> Более </strong> &gt; <strong> Запустить от имени администратора. </strong></p> <p><img src=\"images/image_thumb-77-661.png\" alt=\"FIX: Unable to Enable or Disable Add-in \" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Когда вас попросят разрешить этому приложению вносить изменения в ваше устройство, выберите <strong> Да. </strong></p> <p><img src=\"images/image_thumb-78-120.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. После открытия приложения Office перейдите к отключению или включению нужной надстройки. На этот раз надстройка будет удалена без проблем. </p> <p> Это оно! Сообщите мне, помогло ли вам это руководство, оставив свой комментарий о своем опыте. Пожалуйста, поставьте лайк и поделитесь этим руководством, чтобы помочь другим. </p>"}