{"title":"ИСПРАВЛЕНИЕ: Защита от вирусов и угроз управляется вашей организацией в Windows 10. (решено)","content":"<p> Это руководство содержит инструкции по решению следующей проблемы в Центре безопасности Защитника Windows: «Защита от вирусов и угроз управляется вашей организацией» в ОС Windows 10. </p> <p> Сообщения (ошибки) Защитника Windows: «Защита от вирусов и угроз управляется вашей организацией», «Некоторые настройки управляются вашей организацией» &amp; <br> «Защита в реальном времени управляется вашим администратором», обычно появляется на рабочих компьютерах, где антивирусная защита управляется администратором домена. Если компьютер не принадлежит к домену, указанные выше ошибки появляются после установки стороннего антивируса или после вирусной атаки. </p> <p><img src=\"images/image_thumb-25-853.png\" alt=\"FIX: Virus & Threat Protection is Managed by your Organization - Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Как исправить: защита от вирусов и угроз управляется вашей организацией в Windows 10. </h4> <h6> Шаг 1. Удалите любой другой антивирус стороннего производителя. </h6> <p> Первым шагом к устранению ошибки Защитника Windows «Защита от вирусов и угроз осуществляет ваша организация» является удаление любого другого стороннего антивируса (например, Avast, MacAfee, MalwareBytes и т. Д.) Из вашей системы. </p> <p> </p> <h6> Шаг 2. Просканируйте вашу систему на наличие вирусов и вредоносных программ. </h6> <p> Второй шаг к устранению ошибки Защитника Windows «Некоторые настройки управляются вашей организацией» - убедиться, что ваша система не содержит вирусов и вредоносных программ. Для этой задачи следуйте инструкциям в этом руководстве: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Как проверить компьютер на вирусы и другие вредоносные программы. </a></p> <p> </p> <h6> Шаг 3. Восстановите настройки Защитника Windows до значений по умолчанию. </h6> <p> Включите защиту в реальном времени в Защитнике Windows одним из следующих способов: </p> <h4> Метод 1. Включите антивирусную защиту Defender в реестре. </h4> <p> 1. Открыть <strong> Редактор реестра </strong> : Для этого: </p> <ul> <li> Одновременно нажмите Windows <img src=\"images/image_thumb36-979.png\" alt=\"image\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. </li> <li> Тип <strong> regedit </strong> &amp; Нажмите <strong> Входить. </strong></li> </ul> <p><img src=\"images/image_thumb7-229.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2 .. Перейдите к следующей клавише на левой панели: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Policies \\ Microsoft \\ Защитник Windows </strong></li> </ul> <p> 3. На правой панели дважды щелкните на <strong> Отключить антишпионское ПО </strong> REG_DWORD и измените значение данных с 1 на <strong> 0. </strong></p> <p><img src=\"images/image_thumb-26-852.png\" alt=\"enable defender antivirus protection - registry\" loading=\"lazy\"></p> <p> </p> <p> 4. Щелкните <strong> ОК </strong> а также <strong> Закрыть </strong> Редактор реестра. <br> 5. <strong> Запустить снова </strong> ваш компьютер. Обычно после перезапуска Защитник Windows должен быть включен. * </p> <p> * Примечание. Если после перезагрузки компьютера Защитник Windows по-прежнему отключен со статусом «Защита от вирусов и угроз управляется вашей организацией», продолжите и измените <br> <strong> Начинать </strong> Значение REG_DWORD от 4 до <strong> 2 </strong> в следующих разделах реестра: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ SecurityHealthService </li> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ WinDefend </li> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ WdNisSvc </li> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ MpsSvc </li> </ul> <p> </p> <h5> Способ 2. Удалите <strong> Отключить антишпионское ПО </strong> Значение реестра из командной строки. </h5> <p> 1. Открыть <strong> Командная строка от имени администратора </strong> . Для этого: </p> <ul> <li> В поле поиска введите: <strong> командная строка </strong> или же <strong> cmd </strong></li> <li> Щелкните правой кнопкой мыши на <strong> cmd </strong> или же <strong> Командная строка </strong> результат и выберите <strong> Запустить от имени администратора. </strong></li> </ul> <p><img src=\"images/image_thumb-10-243.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. В командной строке введите (Копировать / Вставить) следующую команду и нажмите. <strong> Входить: </strong></p> <ul> <li> УДАЛИТЬ &quot;HKLM \\ SOFTWARE \\ Policies \\ Microsoft \\ Windows Defender&quot; / v DisableAntiSpyware. </li> </ul> <p> 3. Затем нажмите <strong> Y </strong> чтобы подтвердить свое решение. </p> <p><img src=\"images/image_thumb-28-288.png\" alt=\"enable defender antivirus protection command\" loading=\"lazy\"></p> <p> </p> <p> 4. Закройте командную строку и <strong> запустить снова </strong> твой компьютер. </p> <p> </p> <h5> Метод 3. Включите защиту в реальном времени Защитника Windows в групповой политике. </h5> <p> Если у вас есть выпуск Windows 10 Professional, Enterprise или Education, продолжите и включите защиту от вирусов Защитника Windows в групповой политике. Для этого: </p> <p> 1. Нажмите одновременно Windows <img src=\"images/image_thumb36-102.png\" alt=\"image\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. Тип <strong> gpedit.msc </strong> &amp; Нажмите <strong> Входить. </strong></p> <p><img src=\"images/image_thumb-78-343.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. На левой панели перейдите к: </p> <ul> <li><strong> Конфигурация компьютера \\ Административные шаблоны \\ Компоненты Windows \\ Антивирус Защитника Windows </strong></li> </ul> <p> 4. На правой панели откройте <strong> Отключите антивирус Защитника Windows </strong> параметр. </p> <p><img src=\"images/image14_thumb-207.png\" alt=\"turn on defender antivirus protection- group policy\" loading=\"lazy\"></p> <p> </p> <p> 5. Установите для параметра политики значение <strong> Не настроено </strong> или же <strong> Отключено </strong> чтобы включить защиту в реальном времени, нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-29-337.png\" alt=\"enable defender antivirus protection group policy\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Запустить снова </strong> компьютер. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этой проблеме. </p>"}