{"title":"ИСПРАВЛЕНИЕ: похоже, вы начали обновление и загрузились с установочного носителя (решено)","content":"<p> Следующая проблема может появиться, если вы попытаетесь выполнить чистую установку или ремонтное обновление Windows 10 с установочного носителя: «Похоже, вы запустили обновление и загрузились с установочного носителя. Если вы хотите продолжить обновление, удалите с вашего ПК и нажмите «Да». Если вместо этого вы хотите выполнить чистую установку, нажмите «Нет». </p> <p><img src=\"images/image_thumb-36-818.png\" alt=\"FIX: It looks like you started an upgrade and booted from installation media \" loading=\"lazy\"></p> <p> </p> <p> Приведенное выше сообщение об ошибке означает, что вы прервали обновление Windows 10 после его запуска. Как указано в сообщении, если вы хотите выполнить чистую установку Windows 10, вы должны выбрать «Нет», чтобы продолжить, в противном случае удалите установочный носитель и нажмите «Да», чтобы продолжить обновление Windows 10. </p> <p> В общем, приведенное выше сообщение не является проблемой, но становится большой проблемой, если обновление Windows не удается установить или если Windows 10 зависает после попытки установить обновления, и вы хотите восстановить Windows 10, загрузившись из установки. СМИ. </p> <p> В этом руководстве вы найдете подробные инструкции о том, как обойти сообщение «Похоже, вы начали обновление и загрузились с установочного носителя», отменив текущий процесс обновления Windows 10, чтобы выполнить восстановление Windows 10. обновление с установочного носителя. </p> <h4> Как отменить обновление Windows 10, если Windows не загружается * </h4> <p><strong> * Важный: </strong> Если вы можете загрузиться в Windows 10, но не можете установить обновление из среды Windows, сначала выполните следующие действия: </p> <blockquote><p> 1. Перейдите к <strong> Начинать </strong> &gt; <strong> Настройки </strong> &gt; <strong> Обновление и безопасность </strong> и нажмите «Перезагрузить сейчас», чтобы начать процесс обновления. <br> 2. После первого перезапуска оставьте прогресс «Работаем над обновлениями» на 1-2%. <br> 3. Когда это будет сделано, нажмите кнопку <strong> Мощность </strong> удерживайте кнопку в течение 10-15 секунд, чтобы полностью выключить компьютер. <br> 4. Подключите установочный носитель Windows и включите компьютер. <br> 5. Выполните остальные шаги ниже, чтобы отменить текущее обновление. </p></blockquote> <p> </p> <h6> Шаг 1. Отмените отложенные действия Центра обновления Windows. </h6> <p> 1. Загрузите систему с установочного носителя Windows. <br> 2. Когда появится сообщение «Похоже, вы начали обновление и загрузились с установочного носителя…», нажмите кнопку <strong> СДВИГ </strong> + <strong> F10 </strong> ключи для запуска командной строки. </p> <p><img src=\"images/image_thumb-37-729.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. В командной строке получите список всех дисков в вашей системе с помощью этой команды: </p> <ul> <li><strong> wmic logicdisk получает имя </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-991.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> </p> <p> 4. Затем выясните, на каком диске находится папка «Windows», набрав эту команду: * </p> <p> </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * например, Чтобы увидеть содержимое диска C :, введите: &quot; <strong> реж C: </strong> &quot;(без кавычек). Если вы не видите папку« Windows »на диске C :, переходите к следующей букве диска (например,« dir D: »,« dir E: »и т. д.), пока не увидите значок Папка &quot;Windows&quot; на одном из перечисленных дисков (из приведенной выше команды). </p> <p> например: Как вы можете видеть на скриншоте ниже, папка Windows (в этом примере) находится в <strong> D </strong> : привод.] </p> <p><img src=\"images/image_thumb-69-578.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Как только вы обнаружите, на каком диске расположен диск «Windows» (например, в этом примере на диске «D:»), перейдите к этому диску, набрав DriveLetter. <strong> : </strong> + <strong> Входить </strong> . </p> <p> 6. Затем создайте рабочую папку на диске Windows, набрав эту команду: </p> <p> </p> <ul> <li><strong> mkdir D: \\ Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-229.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Затем дайте команду ниже, чтобы отменить отложенные действия текущего обновления: </p> <ul> <li><strong> DISM / Изображение: D: \\ / ScratchDir: D: \\ Scratch / Cleanup-Image / RevertPendingActions </strong></li> </ul> <p> * Примечание: измените букву диска. <strong> D </strong> в соответствии с вашим случаем. </p> <p> 8. После выполнения указанной выше команды DISM на экране должно появиться следующее сообщение: </p> <p> &quot; <em> Отмена отложенных действий с изображения…. <br> Операция завершена. После перезагрузки будет предпринята попытка возврата к отложенным действиям. <br> Операция завершилась успешно.&quot; </em></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"DISM - RevertPendingActions\" loading=\"lazy\"></p> <p> </p> <p> 9. Закройте окно командной строки, извлеките установочный носитель и дайте Windows нормально загрузиться. </p> <p> 10. После перезагрузки вы должны увидеть на экране следующее сообщение: «Отмена изменений, внесенных в ваш компьютер». По завершении этого процесса Windows должна запуститься в обычном режиме. </p> <p><img src=\"images/image_thumb-39-836.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Шаг 2. Удалите файлы обновления с помощью очистки диска. </h6> <p> После загрузки в Windows 10 необходимо подготовить Windows 10 к восстановлению / обновлению USB, удалив уже загруженные обновления с помощью инструмента очистки диска. Для этого: </p> <p> 1. Откройте проводник, щелкните правой кнопкой мыши диск C: и выберите <strong> Характеристики </strong> . <br> 2. Щелкните значок <strong> Очистка диска </strong> кнопка. </p> <p><img src=\"images/image_thumb_thumb-190.png\" alt=\"Disk cleanup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Затем щелкните <strong> Очистить системные файлы </strong> . </p> <p><img src=\"images/image_thumb-40-950.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Теперь проверьте, чтобы удалить следующие файлы, и нажмите <strong> ОК </strong> : </p> <ul> <li> <ul> <li> <ul> <li> Очистка Центра обновления Windows. </li> <li> Антивирус Защитника Windows. </li> <li> Загруженные программные файлы. </li> <li> Временные интернет файлы. </li> <li> Предыдущие установки Windows. </li> <li> Корзина. </li> <li> Временные файлы. </li> <li> Временные установочные файлы Windows </li> </ul> </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-41-458.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Когда вас спросят, <strong> Удалить файлы </strong> . </p> <p><img src=\"images/image_thumb-42-931.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Когда очистка будет завершена, закройте свойства диска и перейдите к следующему шагу. </p> <p> </p> <h6> Шаг 3. Удалите папку «SoftwareDistribution». </h6> <p> &quot;C: \\ Windows \\ <strong> Программное обеспечение </strong> &quot;папка - это место, где Windows хранит обновления Windows. Часто эта папка оказывается поврежденной, и вам необходимо воссоздать ее, чтобы повторно загрузить обновления с нуля. Итак, действуйте следующим образом: </p> <p><strong> 1. Остановите службу обновления Windows: </strong> Для этого: </p> <blockquote><p> а. Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> б. В поле поиска введите: <strong><em> services.msc </em></strong> и нажмите <strong> ОК </strong> . </p></blockquote> <p><img src=\"images/image_thumb-12-264.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> c. В панели управления службами найдите значок &quot; <strong> Центр обновления Windows&quot; </strong> услуга. <br> d. Щелкните правой кнопкой мыши на <strong> Центр обновления Windows </strong> сервис и выберите &quot; <strong> Стоп </strong> &quot;. </p></blockquote> <p><img src=\"images/image_thumb-9-434.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. Удалите папку SoftwareDistribution. </strong></p> <blockquote><p> а. Откройте проводник Windows и перейдите к: <strong> C: \\ Windows </strong> папка. <br> б. Найти и <strong> Удалить </strong> &quot; <strong><em> Программное обеспечение </em></strong> &quot;(или переименуйте ее, например, в&quot; SoftwareDistributionOLD &quot;). </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-10-140.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Перезагрузите компьютер </strong> применить изменения. </p> <p> </p> <h6> Шаг 4. Обновите Windows 10 с установочного носителя. </h6> <p> Теперь вы готовы к восстановлению-обновлению Windows 10 с установочного носителя. Для этого: </p> <p> 1. <strong> Перезагрузить </strong> ваш компьютер и <strong> ботинок </strong> с Windows USB (или DVD) <strong> установочный носитель </strong> . <br> 2. В мастере установки Windows нажмите <strong> Следующий </strong> а затем щелкните <strong> Установите сейчас </strong> . <br> 3. <strong> Принимать </strong> «Лицензионное соглашение». <br> 4. При появлении запроса выберите «Обновить». <strong> : Установите Windows и сохраните файлы, настройки и приложения. </strong> . </p> <blockquote><p><img src=\"images/image_thumb8_thumb-241.png\" alt=\"image_thumb8\" loading=\"lazy\"></p></blockquote> <p> 5. Затем следуйте инструкциям на экране, чтобы обновить Windows 10. </p> <p> Вот и все, ребята! Это сработало для вас? Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}