{"title":"ИСПРАВЛЕНИЕ: параметр «Установить VMware Tools» неактивен. (Решено)","content":"<p> Если вы не можете установить VMware Tools на гостевой операционной системе, потому что опция «Установить VMware Tools» неактивна, продолжайте читать ниже. VMware Tools - это бесплатный набор сервисов и модулей, которые включают несколько функций на гостевой виртуальной машине, такие как более высокая производительность графики, улучшенная производительность мыши и самое важное: возможность копирования и вставки между хостом и гостевой машиной. Таким образом, хотя гостевая операционная система может работать без инструментов VMware, необходимо установить инструменты VMware, если вы хотите включить дополнительные функции VMware. </p> <p> Обычный способ установки VMware Tools - запустить гостевую машину, а затем в меню «Плеер» выбрать <strong> Управлять </strong> &gt; <strong> Установите VMware Tools </strong> . Но если вы подключили виртуальный привод CD / DVD виртуальной машины к файлу образа ISO при установке операционной системы, опция «Установить VMware Tools» будет недоступна. </p> <p><img src=\"images/image_thumb-45-164.png\" alt=\"FIX VMware Tools option is Grayed Out\" loading=\"lazy\"></p> <p> </p> <p> Это руководство содержит инструкции по устранению следующей проблемы в VMware Workstation Player. Параметр «Установить инструменты VMware» на гостевом компьютере неактивен. </p> <h4> Как установить VMware Tools, если опция «Установить VMware Tools» неактивна. </h4> <p> </p> <p> 1. Выключите виртуальную машину. <br> 2. Щелкните виртуальную машину правой кнопкой мыши и выберите <strong> Настройки </strong> . </p> <p><img src=\"images/image_thumb-39-377.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Выберите <strong> CD / DVD </strong> диск, а затем нажмите <strong> Удалять </strong> . </p> <p><img src=\"images/image_thumb-43-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Затем выберите <strong> Дискета </strong> диск, нажмите <strong> Удалять </strong> а затем щелкните <strong> ОК </strong> чтобы закрыть параметры настроек. </p> <p><img src=\"images/image_thumb-44-469.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Начинать </strong> Виртуальная машина. <br> 6. В меню &quot;Плеер&quot; выберите <strong> Управлять </strong> и нажмите <strong> Установите VMware Tools. </strong></p> <p><img src=\"images/image_thumb-42-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> Это все! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}