{"title":"ИСПРАВЛЕНИЕ: проблема с обоями на задней панели в Windows 7 (решена)","content":"<p> В этом руководстве содержатся инструкции по устранению проблемы с черными обоями, когда для фонового изображения установлено значение «Растянуть» в ОС Windows 7. Проблема с черными обоями может появиться на компьютерах под управлением Windows 7 после установки обновления KB4534310 от 14 января 2020 г. </p> <p><img src=\"images/image_thumb-16-423.png\" alt=\"FIX: Back Wallpaper issue in Windows 7\" loading=\"lazy\"></p> <p> Проблема с черным фоном Windows 7 - это известная ошибка после установки <a href=\"http://www.catalog.update.microsoft.com/Search.aspx?q=KB4534310\" target=\"_blank\" rel=\"nofollow noopener\"> обновить KB4534310 </a> и как Microsoft <a href=\"https://support.microsoft.com/en-us/help/4534310/windows-7-update-kb4534310\" target=\"_blank\" rel=\"nofollow noopener\"> говорит </a> : «Мы работаем над решением и предоставим обновление в следующем выпуске, который будет выпущен для всех клиентов, работающих под управлением Windows 7 и Windows Server 2008 R2 SP1». </p> <p> Если вы хотите решить проблему «черных обоев» до тех пор, пока Microsoft не выпустит обновление для ее устранения, следуйте приведенным ниже инструкциям. </p> <h4> Как исправить проблему с черными обоями в Windows 7. </h4> <h6> Метод 1. Удалите обновление KB4534310. </h6> <p> Первый способ решить проблемы с черными обоями в Windows 7 - удалить обновление KB4534310. * </p> <p> * Примечание. Поскольку обновление KB4534310 включает улучшения безопасности и исправления для Windows 7, удалять его не рекомендуется. Итак, мы предлагаем устранить проблему, следуя инструкциям на сайте <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Метод-2 </a> ниже. </p> <p> Чтобы удалить обновление KB4534310: </p> <p> 1. Щелкните правой кнопкой мыши на <strong> Начинать </strong> меню <img src=\"images/image_thumb-38-451.png\" alt=\"image\" loading=\"lazy\"> и выберите <strong> Панель управления </strong> . <br> 2. Установите <strong> Просмотр по: мелкие значки </strong> и нажмите <strong> Программа и особенности. </strong></p> <p><img src=\"images/image_thumb-51-750.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 3. Щелкните <strong> Просмотр установленных обновлений </strong> на левой панели. </p> <p> </p> <p><img src=\"images/image_thumb-52-942.png\" alt=\"uninstall updates windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. В поле поиска введите &quot; <strong> KB4534310 </strong> &quot;и нажмите Enter. <br> 5. Выделите «Обновление безопасности для Microsoft Windows (KB4534310)» и нажмите <strong> Удалить </strong> . </p> <p><img src=\"images/image_thumb-12-776.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Метод 2. Измените положение изображения, отличное от «Растянуть». </h6> <p> Проблема с черными обоями в Windows 7 появляется только тогда, когда выбранное фоновое изображение растянуто. Итак, следующий метод решения проблемы - установить другое положение изображения для фонового изображения. Для этого: </p> <p> 1. Щелкните правой кнопкой мыши на рабочем столе и выберите <strong> Персонализировать </strong> . </p> <p><img src=\"images/image_thumb-17-501.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Щелкните <strong> Фон рабочего стола </strong></p> <p><img src=\"images/image_thumb-14-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Теперь выполните следующие действия: </p> <p> а. В расположении изображения выберите <strong> Библиотека изображений. </strong><br> б. Выберите изображение, которое вы хотите использовать в качестве фона, или любое другое настраиваемое изображение / фотографию, соответствующее разрешению вашего экрана. * </p> <blockquote> <p> * Совет: чтобы узнать текущее разрешение экрана, щелкните правой кнопкой мыши на рабочем столе и выберите <strong> Разрешение экрана </strong> . </p> </blockquote> <p> c. В <strong> Положение изображения </strong> , выберите любой другой вариант, кроме &quot; <strong> Протяжение </strong> &quot;, например« Заливка »,« По размеру »,« Плитка »или« По центру ». <br> d. Когда закончите, нажмите Сохранить. <strong> изменения </strong> . </p> <p><img src=\"images/image_thumb-15-519.png\" alt=\"image\" loading=\"lazy\"></p> <p> Это все! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}