{"title":"ИСПРАВЛЕНИЕ: ВИДЕО DXGKRNL FATAL ERROR в Windows 10 (решено)","content":"<p> Если вы столкнулись с синей ошибкой экрана «VIDEO DXGKRNL FATAL ERROR» в Windows 10, следуйте приведенным ниже инструкциям, чтобы решить проблему. </p> <p> Ошибка BSOD Windows 10 &quot; <em> На вашем компьютере возникла проблема, и его необходимо перезагрузить. Мы просто собираем некоторую информацию об ошибках, а затем перезапустим для вас. Если вам нужна дополнительная информация, вы можете позже поискать в Интернете по названию ошибки: VIDEO DXGKRNL FATAL ERROR &quot;, </em> обычно указывает на проблему с видеодрайверами. </p> <p><img src=\"images/image_thumb-7-129.png\" alt=\"FIX: VIDEO DXGKRNL FATAL ERROR in Windows 10\" loading=\"lazy\"></p> <p> Это руководство содержит пошаговые инструкции по устранению синего экрана ошибки «VIDEO DXGKRNL FATAL ERROR» в Windows 10. </p> <h2> Как исправить: Windows 10 VIDEO DXGKRNL FATAL ERROR. </h2> <h3> Шаг 1. Исправьте VIDEO DXGKRNL FATAL ERROR, удалив / повторно установив видеодрайверы. </h3> <p> 1. Открыть <strong> Диспетчер устройств </strong> . Для этого: </p> <ol> <li> <ol> <li> Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-153.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. </li> <li> В поле «Открыть» введите: <strong> devmgmt.msc </strong> и щелкнуть <strong> ОК </strong> . </li> </ol> </li> </ol> <blockquote> <p><img src=\"images/image_thumb-5-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p></blockquote> <p> 2. <strong> Расширять </strong> в <strong> Видеоадаптеры. <br> </strong> 3. <strong> Щелкните правой кнопкой мыши </strong> на установленном адаптере дисплея и выберите <strong> Удалите устройство. </strong></p> <p><img src=\"images/image_thumb-46-240.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. В следующем окне, если у вас есть возможность: &quot; <strong> Удалите программное обеспечение драйвера для этого устройства </strong> &quot;, выберите его и нажмите <strong> ОК </strong> для удаления установленных драйверов с компьютера. </p> <p> 5. После удаления <strong> запустить снова </strong> свой компьютер и перейдите к <strong> Диспетчер устройств </strong> очередной раз. <br> 6. Щелкните правой кнопкой мыши имя компьютера (вверху) и выберите <strong> Сканирование на предмет изменений оборудования. </strong></p> <p><img src=\"images/image_thumb-8-911.png\" alt=\"Scan for hardware changes\" loading=\"lazy\"></p> <p> </p> <p> 7. Дайте Windows определить и установить драйверы дисплея, а затем <strong> запустить снова </strong> ваш компьютер снова и проверьте, сохраняется ли &quot;VIDEO DXGKRNL FATAL ERROR&quot;. * </p> <p> * Примечание. Если Windows не может автоматически установить драйверы дисплея автоматически или вы по-прежнему сталкиваетесь с ошибкой синего экрана, переходите к следующему шагу. </p> <p> </p> <h3><br clear=\"all\"> Шаг 2. Переустановите видеодрайверы с сайта производителя. </h3> <p> 1. Перейдите к <strong> Диспетчер устройств </strong> а также <strong> удалить </strong> установленный видеоадаптер. * </p> <p> * Примечание. Если у вас есть ноутбук с двумя (2) видеоадаптерами, удалите их оба. </p> <p> 2. Перейдите на сайт поддержки производителя вашего компьютера (или видеокарты) и загрузите последние версии драйверов для вашей видеокарты (видеокарт). </p> <ul> <li> <ul> <li> Для <strong> NVIDIA </strong> на базе графических процессоров, перейдите к <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Страница расширенного поиска драйверов NVIDIA </a> . </li> <li> Для <strong> AMD </strong> на базе графических процессоров, перейдите к <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Центр загрузки драйверов AMD (ATI). </a></li> <li> Для <strong> Intel </strong> на базе графических процессоров, перейдите к <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Центр загрузки графики Intel. </a></li> </ul> </li> </ul> <p> 3. Продолжите и установите загруженный драйвер. * </p> <p><strong> * Важная заметка: </strong> Если у вас есть ноутбук с двумя (2) видеоадаптерами, сначала установите драйверы для адаптера AMD или NVIDIA и перезагрузите ноутбук. После перезагрузки продолжите установку драйверов для адаптера дисплея INTEL, а затем снова перезагрузите ноутбук. </p> <p> 4. После установки <strong> запустить снова </strong> ваш компьютер и проверьте, решена ли VIDEO DXGKRNL FATAL ERROR. Если нет, переходите к следующему шагу. </p> <p> </p> <h3><br clear=\"all\"> Шаг 3. Восстановите DirectX, чтобы исправить FATAL ERROR VIDEO DXGKRNL. </h3> <p> VIDEO DXGKRNL FATAL ERROR указывает на проблему с драйверами Microsoft DirectX. Итак, приступаем к ремонту DirectX. </p> <p> 1. Загрузите <a href=\"https://www.microsoft.com/en-us/download/details.aspx?displaylang=en&id=35\" target=\"_blank\" rel=\"nofollow noopener\"> Веб-установщик среды выполнения DirectX для конечных пользователей </a> . <br> 2. Запустите загруженный файл (dxwebsetup.exe) и следуйте инструкциям на экране, чтобы установить дополнительные компоненты среды выполнения DirectX. </p> <p><img src=\"images/image_thumb-9-847.png\" alt=\"Install DirectX Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Когда установка будет завершена <strong> запустить снова </strong> ваш компьютер. </p> <p> 4. После перезагрузки перейдите в <strong> Начинать <img src=\"images/image_thumb-55-571.png\" alt=\"image\" loading=\"lazy\"> -&gt; Настройки </strong> -&gt; <strong> Обновление и безопасность -&gt; </strong> и нажмите <strong> Проверить наличие обновлений. </strong></p> <p><img src=\"images/image_thumb-76-281.png\" alt=\"Windows 10 - Check For Updates \" loading=\"lazy\"></p> <p> 5. После установки обновлений снова перезагрузите компьютер и проверьте, решена ли ошибка BSOD. Если нет, переходите к следующему шагу. </p> <p> </p> <h3><br clear=\"all\"> Шаг 4. Восстановите системные файлы Windows 10. </h3> <p> 1. Открыть <strong> Командная строка от имени администратора </strong> . <br> 2. В командной строке введите следующую команду и нажмите <strong> Входить: </strong></p> <ul> <li><strong> DISM.exe / Online / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-176.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Когда операция DISM будет завершена, введите следующую команду и нажмите <strong> Входить </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-464.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Теперь подождите, пока средство проверки системных файлов не восстановит системные файлы Windows. <br> 5. Когда это будет сделано, <strong> запустить снова </strong> ваш компьютер и проверьте, сохраняется ли ошибка. </p> <p> </p> <h3><br clear=\"all\"> Шаг 5. Проанализируйте файл журнала Minidump (BSOD). </h3> <p> Когда Windows вылетает с синим экраном, сохраняет детали экрана BSoD в небольших файлах, которые называются &quot; <strong> MiniDump </strong> &quot;. Анализ <strong> Минидамп </strong> Файл (ы) могут помочь вам в поиске и устранении неисправности VIDEO DXGKRNL FATAL ERROR на синем экране. Для выполнения этой задачи следуйте инструкциям в этой статье: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Как анализировать файлы мини-дампа с помощью BlueScreenView </a> . </p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}