{"title":"ИСПРАВЛЕНИЕ: Lexmark медленная печать нескольких страниц в Windows 10 (решено)","content":"<p> На ПК с Windows 10 с установленным принтером Lexmark печать выполняется медленно при печати нескольких страниц. Проблема медленной печати Lexmark в Windows 10 обычно возникает из-за неправильного драйвера принтера или из-за неправильных настроек принтера (Предпочтения). Чтобы решить эту проблему, продолжайте читать ниже. </p> <p><img src=\"images/image_thumb-29-115.png\" alt=\"FIX: Lexmark Slow Printing in Multiple Pages on Windows 10 \" loading=\"lazy\"></p> <p> Подробнее о проблеме с медленной печатью Lexmark: в Windows 10 ваш принтер Lexmark печатает быстро при печати одной страницы, но если вы хотите распечатать несколько страниц, печать будет медленной, потому что процесс печати начинается слишком долго, а затем принтер печатает одну. страницу за раз каждые 1-2 минуты. </p> <p> В этом руководстве содержатся инструкции по решению проблемы медленной печати нескольких страниц Lexmark в Windows 10. </p> <ul> <li><strong> Статья по теме: </strong> <a href=\"https://www.repairwin.com/fix-slow-pdf-printing-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> ИСПРАВЛЕНИЕ: медленная печать PDF-файлов в Windows 10 </a></li> </ul> <h4> Как исправить: медленная печать нескольких страниц на принтере Lexmark в Windows 10. </h4> <h6> Метод 1. Измените настройки принтера. </h6> <p> 1. Перейдите к <strong> Панель управления </strong> -&gt; <strong> Устройства и принтеры. </strong><br> 2. Щелкните правой кнопкой мыши принтер и выберите <strong> Характеристики. </strong></p> <p><img src=\"images/image_thumb-30-253.png\" alt=\"Printer Properties\" loading=\"lazy\"></p> <p> 3. На вкладке &quot;Общие&quot; <strong> щелкните &quot;Изменить свойства&quot;. </strong></p> <p><img src=\"images/image_thumb-31-900.png\" alt=\"Change Printer Properties\" loading=\"lazy\"></p> <p> 4. В настройках печати Lexmark установите <strong> Тип бумаги </strong> к <strong> Простой </strong> и нажмите <strong> ОК. * </strong></p> <p> * Примечание: другие настройки, которые можно применить к вашему принтеру для повышения скорости печати: </p> <ul> <li><strong> Разрешение печати </strong><strong> : </strong> 600 dpi замедлит работу принтера. </li> <li><strong> Тихий режим </strong><strong> : </strong> Выключенный </li> </ul> <p><img src=\"images/image_thumb-32-858.png\" alt=\"FIX Slow Lexmark Printing Lexmark - Windows 10\" loading=\"lazy\"></p> <p> 5. Теперь нажмите <strong> Применять </strong> а также <strong> ОК </strong> в окне «Свойства принтера», чтобы применить изменения. <br> 6. Откройте документ с несколькими страницами и проверьте, устранена ли проблема. Если нет, перейдите к способу 2 ниже. </p> <h6> Способ 2. Измените драйвер принтера. </h6> <p> 1. Перейдите к <strong> Панель управления </strong> -&gt; <strong> Устройства и принтеры. </strong><br> 2. Щелкните правой кнопкой мыши принтер и выберите <strong> Удалить устройство. </strong></p> <p><img src=\"images/image_thumb-33-755.png\" alt=\"Uninstall Printer Windows 10\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 2. После удаления принтера перейдите к <strong> Программы и компоненты </strong> в Панели управления и <strong> удалить </strong> в <strong> Программное обеспечение Lexmark </strong> (любой). </p> <p> 3. Перейдите к <a href=\"https://www.lexmark.com/en_us/support/download-search.html\" target=\"_blank\" rel=\"nofollow noopener\"> Драйверы и загружаемые материалы Lexmark </a> на сайте и выполните поиск доступных драйверов для вашей модели принтера и операционной системы. <br> 4. Из списка доступных драйверов загрузите и установите один из следующих драйверов: * </p> <ul> <li> <p> Универсальный драйвер печати. </p> </li> <li> <p> Универсальный драйвер печати с эмуляцией PCL5e. </p> </li> <li> <p> Универсальный драйвер печати с эмуляцией PostScript 3. </p> </li> </ul> <p> * Примечание: я предлагаю вам попробовать драйверы печати в указанном выше порядке. </p> <p> 5. Когда установка драйвера принтера будет завершена, <strong> запустить снова </strong> ваш компьютер. <br> 6. После перезапуска попробуйте распечатать длинный документ. Проблема с медленной печатью должна быть исправлена. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этой проблеме. </p>"}