{"title":"ИСПРАВЛЕНИЕ: HDMI Нет звука на ТВ или HDMI не отображается на устройствах воспроизведения (решено).","content":"<p> Если вы подключили телевизор к ноутбуку с помощью кабеля HDMI, и при воспроизведении видео звук не выводится или HDMI не отображается как устройство воспроизведения, продолжайте читать это руководство. </p> <p> Проблема в деталях: на ноутбуке под управлением Windows 10 устройство цифрового вывода (HDMI) не указано как устройство воспроизведения, и звук не выводится при подключении к телевизору с помощью кабеля HDMI. </p> <p> Проблема «Нет звука на выходе HDMI» в Windows 10 может появляться по нескольким причинам, поэтому в этом руководстве вы найдете пошаговые инструкции по устранению проблемы. </p> <h2> Как исправить: звук на выходе HDMI и HDMI не отображается на устройствах воспроизведения в Windows 10 * </h2> <p> * Предложения: Прежде чем продолжить, выполните следующие действия: </p> <ul> <li><strong> Щелкните правой кнопкой мыши </strong> на <strong> значок звука </strong><img src=\"images/image_thumb-11-109.png\" alt=\"image\" loading=\"lazy\"> на панели задач, чтобы <strong> Смеситель открытого объема </strong> и убедитесь, что <strong> Устройство цифрового вывода </strong> не отключен. </li> <li> Убедитесь, что кабель HDMI правильно подключен как к ноутбуку, так и к телевизору. </li> <li> После подключения кабеля HDMI, <strong> запустить снова </strong> твой компьютер. </li> <li> В телевизоре установите правильный порт HDMI в качестве устройства ввода видео. </li> <li> Если у вас есть ноутбук, закройте крышку или нажмите кнопку питания один раз, чтобы перевести ноутбук в спящий режим. Затем снова нажмите кнопку питания и снова проверьте звук с HDMI. </li> <li> Проверьте, сохраняется ли проблема, с помощью другого кабеля HDMI. </li> </ul> <p> </p> <h3> Шаг 1. Установите HDMI в качестве устройства воспроизведения по умолчанию. </h3> <p> Первым шагом к решению проблем со звуком HDMI в Windows 10 является установка HDMI в качестве аудиоустройства по умолчанию. </p> <p> 1. Перейдите в Windows. <strong> Панель управления </strong> и открыть <strong> Звук. </strong></p> <p><img src=\"images/image_thumb-14-686.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Убедитесь, что <strong> Цифровой выход </strong> (HDMI) - это <strong> По умолчанию </strong> устройство воспроизведения, в противном случае выберите <strong> Цифровой выход </strong> устройство и щелкните <strong> Установить по умолчанию </strong> кнопка. Когда закончите, воспроизведите видео, чтобы проверить звук HDMI, и если проблема не исчезнет, ​​перейдите к следующему шагу. * </p> <p><img src=\"images/image_thumb-43-106.png\" alt=\"FIX: HDMI No Sound Output \" loading=\"lazy\"></p> <p> </p> <p> * Примечания: в зависимости от ситуации попробуйте следующее: </p> <p> 1. Если <strong> Цифровой выход </strong> устройство <strong> отключен </strong> , щелкните по нему правой кнопкой мыши и щелкните <strong> Давать возможность </strong> . Затем выделите его и нажмите <strong> Установить по умолчанию </strong> . </p> <p><img src=\"images/image_thumb-44-233.png\" alt=\"FIX: HDMI Not Listed in Playback devices \" loading=\"lazy\"></p> <p> 2. Если устройство цифрового вывода не отображается как устройство воспроизведения: </p> <blockquote><p> а. Щелкните правой кнопкой мыши пустое место и убедитесь, что оба <strong> Показать отключенные устройства </strong> и <strong> Показать отключенные устройства </strong> параметры выбраны (отмечены). Если какой-либо из вышеперечисленных параметров не выбран, щелкните его, чтобы выбрать. </p></blockquote> <p><img src=\"images/image_thumb-45-410.png\" alt=\"Enable HDMI DIgital Output\" loading=\"lazy\"></p> <blockquote><p> б. Затем щелкните правой кнопкой мыши на устройстве цифрового вывода и выберите <strong> Давать возможность. <br> c. </strong> Когда закончите, установите как <strong> По умолчанию </strong> в <strong> Цифровой выход </strong> устройство. </p> </blockquote> <h3><br clear=\"all\"> Шаг 2. Откатите драйвер звуковой карты. </h3> <p> В некоторых случаях проблема «HDMI нет звука на телевизоре» может появиться после автоматического обновления драйвера. Итак, приступим и откатим аудиодрайвер. </p> <p> 1. Открыть <strong> Диспетчер устройств </strong> . Для этого: </p> <blockquote><p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-781.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. В поле «Открыть» введите: <strong> devmgmt.msc </strong> и щелкнуть <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-5-389.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Расширять </strong> в <strong> Звуковые, видео и игровые контроллеры. <br> 3. Щелкните правой кнопкой мыши </strong> на <strong> Аудиоустройство высокой четкости </strong> и выберите <strong> Характеристики. </strong></p> <p><img src=\"images/image_thumb-17-970.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. На вкладке Драйвер щелкните <strong> Откат драйвера </strong> кнопка. <strong> * </strong></p> <p> * Примечание. Если кнопка «Откатить драйвер» неактивна, перейдите к следующему шагу. </p> <p><img src=\"images/image_thumb-18-921.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> 5. Выберите причину отката пакета драйверов и нажмите <strong> Да. </strong></p> <p><img src=\"images/image_thumb-19-748.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Когда откат драйвера завершится, <strong> запустить снова </strong> твой компьютер. <br> 5. После перезагрузки продолжите и проверьте звук от HDMI. Если вы по-прежнему не слышите звук на телевизоре, перейдите к следующему шагу. </p> <h3> Шаг 3. Измените драйвер звуковой карты. </h3> <p> Отсутствие звука часто связано с неправильным драйвером звуковой карты. Чтобы исправить эту проблему: </p> <p> 1. Открыть <strong> Диспетчер устройств. </strong><br> 2. <strong> Расширять </strong> в <strong> Звуковые, видео и игровые контроллеры. <br> </strong> 3. <strong> Щелкните правой кнопкой мыши </strong> в <strong> Аудио высокого разрешения Realtek </strong> устройство и выберите <strong> Обновить драйвер. <br> </strong></p> <p><img src=\"images/image_thumb-6-937.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Выберите <strong> Найдите на моем компьютере драйверы. </strong></p> <p><img src=\"images/image_thumb-7-874.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Выберите <strong> Позвольте мне выбрать из списка доступных драйверов на моем компьютере </strong> . </p> <p><img src=\"images/image_thumb-8-498.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. На следующем экране выберите <strong> Аудиоустройство высокой четкости </strong> и нажмите <strong> Следующий. </strong></p> <p><img src=\"images/image_thumb-20-756.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/07/image-10.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 8. Когда установка драйвера будет завершена, <strong> запустить снова </strong> твой компьютер. <br> 9. После перезагрузки продолжите и проверьте звук из динамиков ноутбука. </p> <h3> Шаг 4. Удалите и повторно установите драйвер звуковой карты. </h3> <p> 1. Открыть <strong> Диспетчер устройств. </strong><br> 2. <strong> Расширять </strong> в <strong> Звуковые, видео и игровые контроллеры. <br> </strong> 3. <strong> Щелкните правой кнопкой мыши </strong> в <strong> Аудио высокой четкости </strong> устройство и выберите <strong> Удалите устройство. </strong></p> <p><img src=\"images/image_thumb-21-678.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. После удаления <strong> запустить снова </strong> ваш компьютер, и пусть Windows автоматически установит звуковые драйверы. Если этого не произошло, перейдите к <strong> Настройки </strong> &gt; <strong> Обновление и безопасность </strong> и заставьте Windows <strong> Проверить обновления. </strong></p> <p> </p> <h3> Шаг 5. Удалите и повторно установите адаптер дисплея. </h3> <p> 1. Открыть <strong> Диспетчер устройств. <br> </strong> 2. <strong> Расширять </strong> в <strong> Видеоадаптеры. <br> </strong> 3. <strong> Щелкните правой кнопкой мыши </strong> на установленном видеоадаптере и выберите <strong> Удалите устройство. </strong></p> <p><img src=\"images/image_thumb-46-871.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. После удаления <strong> запустить снова </strong> ваш компьютер, и пусть Windows автоматически установит драйверы дисплея. Если этого не произошло или вы все еще сталкиваетесь с проблемой, перейдите на сайт поддержки производителя вашего ноутбука и загрузите последние версии драйверов дисплея в соответствии с моделью вашего ноутбука. </p> <p> Вот и все, ребята! Какой метод сработал для вас? Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}