{"title":"ИСПРАВЛЕНИЕ: в этом режиме Windows запускаются только проверенные приложения из Магазина в Windows 10.","content":"<p> Ошибка «В целях безопасности и производительности в этом режиме Windows запускаются только проверенные приложения из Магазина» появляется, когда Windows 10 работает в S-режиме, или из-за настройки на вашем компьютере, которая ограничивает установку сторонних приложений и программного обеспечения. . </p> <p><img src=\"images/image_thumb-19-156.png\" alt=\"FIX: For security and performance, this mode of Windows only runs verified apps from the Store in Windows 10.\" loading=\"lazy\"></p> <p> В этом руководстве содержатся инструкции по устранению ошибки «В целях безопасности и производительности в этом режиме Windows запускаются только проверенные приложения из Магазина» при попытке установить стороннее приложение в Windows 10. </p> <h2> Как разрешить установку сторонних приложений в Windows 10. </h2> <h5> Шаг 1. Узнайте установленную версию Windows 10. </h5> <p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb-1-482.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. Введите следующую команду и нажмите <strong> Входить: </strong></p> <ul> <li><strong> Winver </strong></li> </ul> <p><img src=\"images/image_thumb-13-360.png\" alt=\"See Windows 10 Installed Version\" loading=\"lazy\"></p> <p> 3. Теперь, если вы видите в Windows Edition, что используете Windows 10 Home или Pro, следуйте инструкциям в <a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Метод-1 </a> , в противном случае, если у вас есть <strong> Windows 10 Домашняя S </strong> , следуйте инструкциям в <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Метод-2 </a> . </p> <p><img src=\"images/image_thumb-14-709.png\" alt=\"See Installed Windows 10 Edition\" loading=\"lazy\"></p> <p><strong> </strong></p> <p><strong> </strong></p> <h3> Метод 1. Разрешите Windows 10 устанавливать приложения из любого места. </h3> <p> 1. Из меню &quot;Пуск&quot; <img src=\"images/image_thumb2_thumb_thumb-909.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> нажмите Настройки <img src=\"images/image_thumb-66-797.png\" alt=\"image\" loading=\"lazy\"> а затем откройте <strong> Программы </strong> . </p> <p><img src=\"images/image_thumb-15-604.png\" alt=\"Windows Settings - Apps\" loading=\"lazy\"></p> <p> </p> <p> 2. В настройках приложений и функций выберите установку приложений из <strong> В любом месте </strong> . </p> <p><img src=\"images/image_thumb-16-670.png\" alt=\"Install Apps from Anywhere - Windows 10\" loading=\"lazy\"></p> <h3> Метод 2. Выйдите из S-режима Windows 10. </h3> <p> Windows 10 в S-режиме разработана для обеспечения безопасности и производительности и по этой причине не позволяет запускать приложения за пределами Microsoft Store. Чтобы обойти это ограничение, вам нужно выйти из S-режима, это очень простой способ, но имейте в виду, что после выхода из S-режима вы не сможете вернуться в Windows 10 в S-режиме. </p> <p> Чтобы выйти из режима Windows 10 S в Windows 10 Домашняя: </p> <p> 1. Из меню &quot;Пуск&quot; <img src=\"images/image_thumb2_thumb_thumb-829.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> нажмите Настройки <img src=\"images/image_thumb-66-853.png\" alt=\"image\" loading=\"lazy\"> а затем откройте <strong> Обновление и безопасность. </strong></p> <p> 2. Выберите <strong> Активация </strong> слева, а затем щелкните <a href=\"//switchwindows\" target=\"_blank\" rel=\"nofollow noopener\"> Иди в магазин </a><strong> . </strong></p> <p><img src=\"images/image_thumb-17-920.png\" alt=\"Switch Out S Mode Windows 10\" loading=\"lazy\"></p> <p> 3. На странице «Выйти из S-режима» щелкните <strong> Получать </strong> а затем щелкните <strong> Установить. </strong> * <br> 4. Наконец нажмите <strong> Да, пойдем </strong> для выхода из S-режима. </p> <p> * Примечание. Если после нажатия кнопки «Установить» вы получаете сообщение об ошибке «Что-то произошло, и мы не смогли начать обновление», продолжайте и <strong> установить все доступные обновления Windows 10 </strong> , <strong> перезагрузите ваш компьютер </strong> и попробуй еще раз. </p> <p><img src=\"images/image_thumb-18-502.png\" alt=\"Switch Out S Mode\" loading=\"lazy\"></p> <p> </p> <p> 4. Когда установка будет завершена, вы получите уведомление о том, что вы сможете устанавливать приложения не из Microsoft Store. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}