{"title":"ИСПРАВЛЕНИЕ: в Windows 10 не работают меню «Пуск», «Настройки», «Кортана» или «Панель задач». (Решено)","content":"<p> Это руководство содержит инструкции по устранению следующих проблем в Windows 10: меню «Пуск» не открывается, поиск Cortana не работает, приложение «Настройки» не запускается, значки панели задач не открываются. </p> <p> Многие пользователи Windows 10 сообщали о проблемах с меню «Пуск», панелью задач, Cortana и настройками, поэтому в этом руководстве я перечисляю наиболее распространенные методы решения вышеуказанных проблем. </p> <h2> Как исправить: панель задач Windows 10, меню «Пуск», настройки или проблемы с Кортаной. </h2> <h3> Метод 1. Удалите последнее обновление Windows 10. </h3> <p> Многие пользователи сообщают, что проблемы, упомянутые в этой статье, решаются после удаления. <strong><a href=\"https://support.microsoft.com/en-us/topic/august-11-2020-kb4566782-os-build-19041-450-ec5cf4b6-86ed-b0d3-539c-5fbe1b17f56a\" target=\"_blank\" rel=\"nofollow noopener\"> KB4566782 </a></strong> Обновлять. </p> <p> Если вы не можете найти обновление KB4566782 в списке установленных обновлений, проверьте и установите все доступные обновления, и если проблема не исчезнет, ​​попробуйте <strong><a href=\"https://www.repairwin.com/how-to-uninstall-updates-in-windows-10/#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> удалите последние установленные обновления. </a></strong></p> <h3> Способ 2. Перезагрузите Windows 10 в безопасном режиме. </h3> <p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-268.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. Тип <strong> msconfig </strong> и нажмите <strong> Входить </strong> . </p> <p><img src=\"images/image_thumb-47-537.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. На <strong> Ботинок </strong> вкладка выберите <strong> Безопасный ботинок </strong> вариант, затем щелкните <strong> ОК </strong> и перезагрузите компьютер. </p> <p><img src=\"images/image_thumb-48-665.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 4. После перезагрузки и в безопасном режиме проверьте, сохраняется ли проблема. <br> 5. Затем снова запустите инструмент msconfig в <strong> Общий </strong> вкладку, проверьте <strong> Нормальный запуск </strong> и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-859.png\" alt=\"normal startup windows\" loading=\"lazy\"></p> <p> 6. <strong> Запустить снова </strong> твой компьютер. <br> 7. После перезапуска проверьте, сохраняется ли проблема, в противном случае перейдите к следующему методу. </p> <p> </p> <h2> Метод 3. Выполните чистую загрузку. </h2> <p> 1. Запустите инструмент msconfig. <br> 2. На вкладке &quot;Услуги&quot; <strong> проверять </strong> в <strong> Скрыть все службы Microsoft </strong> флажок, а затем нажмите <strong> Отключить все </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-333.png\" alt=\"clean boot windows\" loading=\"lazy\"></p> <p> </p> <p> 3. Затем выберите <strong> Запускать </strong> вкладку и щелкните <strong> Откройте диспетчер задач. <br> </strong> 4. <strong> </strong> Поочередно выберите все перечисленные программы и нажмите <strong> Запрещать. </strong></p> <p><img src=\"images/image_thumb-1-399.png\" alt=\"clean boot windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Когда закончите, закройте это окно и нажмите <strong> ОК </strong> в утилите «Конфигурация системы», чтобы <strong> Запустить снова </strong> твой компьютер. <br> 6. После перезагрузки, если ваш компьютер работает нормально и без проблем, * затем снова откройте утилиту «Конфигурация системы» (msconfig), включите одну за другой все отключенные программы и перезагрузите компьютер, пока не выясните, какая программа вызывает сбой. проблема. </p> <p> * Примечание. Если проблема не устраняется даже в состоянии чистой загрузки, перейдите к следующему методу. </p> <h3> Метод 4. Переустановите и повторно зарегистрируйте все встроенные приложения Windows 10. </h3> <p> Следующий метод решения проблем с панелью задач, меню «Пуск», Кортаной и т. Д. В Windows 10 - это переустановка и повторная регистрация всех встроенных приложений. </p> <p> 1. Откройте PowerShell от имени администратора. Для этого: </p> <blockquote><p> 1. На <strong> Кортана </strong> поле поиска, введите <strong> Powershell <br> </strong> 2. Щелкните правой кнопкой мыши на <strong> Windows PowerShell </strong> результат и выберите <strong> Запустить от имени администратора. </strong></p></blockquote> <p><img src=\"images/image_thumb-51-691.png\" alt=\"FIX: Windows 10 Start Menu, Settings, Cortana or Taskbar icons Not Working.\" loading=\"lazy\"></p> <p> </p> <p> 3. В PowerShell введите (скопируйте и вставьте) следующую команду и нажмите <strong> Входить </strong> : </p> <ul> <li> Get-AppXPackage -AllUsers | Для каждого {Add-AppxPackage -DisableDevelopmentMode -Register &quot;$ ($ _. InstallLocation) \\ AppXManifest.xml&quot;} </li> </ul> <p><img src=\"images/image_thumb-2-985.png\" alt=\"register re-install windows 10 apps\" loading=\"lazy\"></p> <p> 4. Подождите, пока команда запустится, и игнорируйте ошибки (красные буквы). <br> 5. <strong> Запустить снова </strong> свой компьютер, а затем проверьте, решена ли ваша проблема. </p> <p> </p> <h3> Метод 5. Создайте новую учетную запись. </h3> <p> Еще один способ исправить несколько проблем в Windows 10 - создать новую учетную запись и перенести ваши личные файлы и данные в новую учетную запись. Для этого: </p> <p> 1. Открыть <strong> Командная строка от имени администратора </strong> . <br> 2. В командной строке введите следующую команду и нажмите <strong> Входить </strong> : </p> <ul> <li><strong> пароль учетной записи пользователя net / добавить </strong></li> </ul> <p> * Примечание. В приведенной выше команде замените поля «учетная запись» и «пароль» на свой выбор. </p> <p> например если вы хотите создать новую учетную запись с именем пользователя «Admin1» и паролем «Admin123», введите: <em> чистый пользователь Admin1 Admin123 / добавить </em></p> <p><img src=\"images/image_thumb-3-388.png\" alt=\"add user windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Затем продолжите и добавьте новую учетную запись в группу администраторов с помощью этой команды: </p> <ul> <li><strong> учетная запись администратора локальной группы net / добавить </strong></li> </ul> <p> например В нашем примере это команда: <em> администраторы локальной группы net Admin1 / add </em></p> <p><img src=\"images/image_thumb-4-429.png\" alt=\"fix windows 10 start menu, cortana, settings\" loading=\"lazy\"></p> <p> </p> <p> 4. Закройте окно командной строки и <strong> запустить снова </strong> твой компьютер. <br> 5. После перезапуска войдите в новую учетную запись. <br> 6. Проверьте, сохраняется ли проблема. Если проблема устранена, перенесите свои данные и файлы в новую учетную запись, и все готово. </p> <p> </p> <h3> Способ 6. Восстановить Windows 10. </h3> <p> Последний метод решения проблем с Windows 10 - это <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> восстановить Windows 10 с помощью обновления на месте </a> . </p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}