{"title":"ИСПРАВЛЕНИЕ: Подключение к удаленному рабочему столу Mac OS не может проверить личность компьютера, к которому вы хотите подключиться. (Решено)","content":"<p> В этом руководстве вы найдете инструкции по устранению проблемы «Подключение к удаленному рабочему столу не может проверить личность компьютера, к которому вы хотите подключиться. Попробуйте повторно подключиться к компьютеру под управлением Windows или обратитесь к нашему администратору.», Когда вы пытаетесь сделать это подключиться через RDP с компьютера под управлением Mac OS к Windows RDSH Server 2016. </p> <p><img src=\"images/image_thumb-32-846.png\" alt=\"FIX: MAC OS Remote Desktop Connection cannot verify the identity of the computer that you want to connect to.\" loading=\"lazy\"></p> <p> </p> <h4> Как исправить: подключение к удаленному рабочему столу MacOSX не может проверить личность компьютера, к которому вы хотите подключиться. </h4> <h6> Метод 1. Загрузите последнюю версию клиента RDP из MAC App Store. </h6> <p> 1. Загрузите и установите последнюю версию <a href=\"https://itunes.apple.com/us/app/microsoft-remote-desktop/id715768417?mt=12&ign-mpt=uo%3D4\" target=\"_blank\" rel=\"nofollow noopener\"> Клиент удаленного рабочего стола Microsoft </a> на вашем MAC. (Если вы используете устройство IOS, загрузите клиент RDP из <a href=\"https://itunes.apple.com/us/app/microsoft-remote-desktop/id714464092?mt=8&ign-mpt=uo%3D4\" target=\"_blank\" rel=\"nofollow noopener\"> здесь </a> .) <br> 2. После установки попробуйте снова подключиться к серверу Windows RDP. Если проблема не исчезнет, ​​перейдите к способу 2 ниже. </p> <p> </p> <h6> Метод 2. Измените параметры групповой политики на сервере Windows RDSH. </h6> <p> На сервере узла сеансов удаленных рабочих столов (RDSH) 2016 измените групповую политику следующим образом: </p> <p> 1. Нажмите одновременно Windows <img src=\"images/image_thumb36-211.png\" alt=\"image\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. Тип <strong> gpedit.msc </strong> &amp; Нажмите <strong> Входить. </strong></p> <p><img src=\"images/image_thumb-78-784.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. На левой панели перейдите к: </p> <ul> <li><strong> Конфигурация компьютера </strong> &gt; <strong> Административные шаблоны </strong> &gt; <strong> Компоненты Windows </strong> &gt; <strong> Службы удаленных рабочих столов </strong> &gt; <strong> Узел сеанса удаленного рабочего стола </strong> &gt; <strong> Безопасность </strong></li> </ul> <p> 4. На правой панели откройте <strong> Требовать использования определенного уровня безопасности для удаленных (RDP) подключений </strong> параметр. </p> <p><img src=\"images/image_thumb-36-865.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4а. Проверять <strong> Включено </strong> , установите &quot;Уровень безопасности&quot; на <strong> RDP </strong> и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-37-183.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Теперь откройте <strong> Требовать аутентификацию пользователя для удаленных подключений с помощью аутентификации на уровне сети </strong> настройте, установите его на <strong> Отключено </strong> и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-38-109.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Закрывать </strong> Редактор групповой политики. <br> 7. <strong> Запустить снова </strong> компьютер, чтобы применить изменения или открыть командную строку с повышенными привилегиями и дать следующую команду: </p> <ul> <li><strong> gpupdate / force </strong></li> </ul> <p> Это оно! Какой метод сработал для вас? <br> Сообщите мне, помогло ли вам это руководство, оставив свой комментарий о своем опыте. Пожалуйста, поставьте лайк и поделитесь этим руководством, чтобы помочь другим. </p>"}