{"title":"ИСПРАВЛЕНИЕ: файл не имеет аудио- или видеопотоков в Adobe Premiere.","content":"<p> Если при импорте видеофайла MP4 вы получаете сообщение об ошибке Adobe Premiere «Ошибка импорта файла» с описанием «В файле нет аудио- или видеопотоков», продолжайте чтение ниже. Ошибка «В файле нет потоков аудио или видео» в Adobe Premiere может появиться, хотя видео воспроизводится правильно в любых других медиаплеерах (VLC, Windows Media Player и т. Д.). </p> <p><img src=\"images/image_thumb-43-349.png\" alt=\"FIX: File has no audio or video streams on Adobe Premiere\" loading=\"lazy\"></p> <p> </p> <p> Ошибки Adobe Premiere при импорте видеофайла могут появиться по нескольким причинам, поэтому в этом руководстве вы найдете все доступные методы решения проблемы. </p> <h4> Как исправить: «В файле нет потокового аудио или видео» в Adobe Premiere. </h4> <h6> Способ 1. Установите QuickTime. </h6> <p> Прежде всего, убедитесь, что вы установили последнюю версию <a href=\"https://support.apple.com/downloads/quicktime\" target=\"_blank\" rel=\"nofollow noopener\"> Быстрое время </a> версию на вашем ПК, а затем попробуйте импортировать файл mp4 в Adobe Premiere. </p> <p> </p> <h6> Способ 2. Переименуйте видео файл. </h6> <p> 1. Создайте копию видеофайла mp4 в другом месте на вашем ПК. (например, на вашем рабочем столе) <br> 2. Переименуйте видеофайл следующим образом: </p> <blockquote><p> а. Задайте для видеофайла более короткое имя файла и… <br> б. Удалите из его имени любые специальные символы. (подчеркивания, круглые скобки и т. д.). </p></blockquote> <p> 3. Откройте видеофайл в Adobe Premiere. </p> <p> </p> <h6> Метод 3. Измените расширение имени файла с MP4 на MOV. </h6> <p> Следующий способ обойти ошибку Adobe Premiere «Файл не имеет аудио- или видеопотоков» - это изменить расширение видеофайла с .mp4 на .mov (или наоборот). Для этого: </p> <p> 1. В проводнике щелкните <strong> Вид </strong> -&gt; <strong> Параметры </strong> -&gt; <strong> Изменить папку и параметры поиска </strong> . </p> <p><img src=\"images/image_thumb-45-776.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. На <strong> Вид </strong> вкладка <strong> Чисто </strong> поле «Скрыть расширения для известных типов файлов» и нажмите <strong> ОК </strong> . * </p> <p> * Примечание. Чтобы сделать этот параметр постоянным, нажмите «Применить к папкам» перед тем, как нажать «ОК». </p> <p><img src=\"images/image_thumb-46-490.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Теперь переименуйте / измените расширение видеофайла, как показано ниже: </p> <ul> <li> Если видеофайл имеет формат MP4 (.mp4), измените его расширение на .mov. </li> <li> Если видеофайл имеет формат MOV (.mov), измените его расширение на .mp4. </li> </ul> <p><img src=\"images/image_thumb-47-586.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Наконец, откройте видеофайл в Adobe Premiere. </p> <p> </p> <p> </p> <h6> Метод 4. Очистите базу данных кэша мультимедиа и файлы кэша. </h6> <p> При импорте мультимедийного файла (видео или аудио) и во время работы с этим файлом в Adobe Premiere программа создает файлы кэша мультимедиа для повышения производительности. Кроме того, программа создает ссылки для этих файлов кэша в базе данных кэша мультимедиа. Со временем эти файлы кэша мультимедиа и база данных кэша мультимедиа могут стать слишком большими или поврежденными, и их необходимо очистить, чтобы избежать проблем. </p> <p> Итак, следующий метод решения проблемы «Файл не имеет аудио- или видеопотоков» в Premiere - это очистить «базу данных кэша мультимедиа» и удалить файлы кеша. Для этого: * </p> <p><strong> A. Как очистить базу данных кэша медиафайлов Adobe Premiere. </strong></p> <p> 1. Откройте Adobe Premiere. <br> 2. В меню перейдите к <strong> Редактировать </strong> -&gt; <strong> Предпочтения </strong> -&gt; <strong> СМИ. <br> </strong> 3. В базе данных Media Cache щелкните значок <strong> Чистый </strong> кнопка. </p> <p><img src=\"images/image_thumb-48-167.png\" alt=\"Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> 4. <strong> Запустить снова </strong> Adobe Premiere и попробуйте открыть видеофайл. Если ошибка «Файл не содержит аудио- или видеопотоков» сохраняется, перейдите к очистке файлов кэша Adobe Premiere, следуя приведенным ниже инструкциям: </p> <p><strong> Б. Как очистить файлы кэша мультимедиа Adobe Premiere. </strong></p> <p> 1. <strong> Открыть </strong> Adobe Premiere. <br> 2. В меню перейдите к <strong> Редактировать </strong> -&gt; <strong> Предпочтения </strong> -&gt; <strong> СМИ. <br> </strong> 3. В Media Cache Files щелкните значок <strong> Просматривать </strong> или отметьте расположение файлов кэша мультимедиа. </p> <p><img src=\"images/image_thumb-49-331.png\" alt=\"FIX: Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Закрывать </strong> Adobe Premiere. <br> 5. В проводнике <strong> Удалить </strong> все содержимое папки «Media Cache files». <br> 6. Импортируйте видеофайл в Premiere. </p> <p> </p> <h6> Метод 5. Перекодируйте видеофайл. </h6> <p> Последний метод решения проблемы «Файл не имеет аудио- или видеопотоков» в процессе импорта Adobe Premiere - перекодировать видеофайл. Для этого: </p> <p> 1. Скачайте и установите <a href=\"https://handbrake.fr/downloads.php\" target=\"_blank\" rel=\"nofollow noopener\"> Ручной тормоз </a> . <br> 2. Откройте Handbrake и щелкните <strong> Файл - открыть отдельный видеофайл. </strong> . </p> <p><img src=\"images/image_thumb-50-634.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Выберите видеофайл, который нельзя импортировать в Adobe Premiere, и нажмите <strong> Открыть </strong> . <br> 4. Установите выходной формат на <strong> MP4, </strong> а затем щелкните <strong> Просматривать </strong> и укажите место хранения и имя выходного (перекодированного) видеофайла. </p> <p><img src=\"images/image_thumb-51-817.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. На <strong> Габаритные размеры </strong> на вкладке установите те же размеры, что и у исходного файла. <br> 6. Когда закончите, нажмите <strong> Начать кодирование. </strong></p> <p><img src=\"images/image_thumb-52-713.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Когда процесс кодирования будет завершен, закройте Handbrake. <br> 7. Откройте перекодированный видеофайл в Adobe Premiere. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}