{"title":"ИСПРАВЛЕНИЕ: повторяющиеся имена пользователей на экране входа после обновления Windows 10.","content":"<p> В этом руководстве содержится несколько методов устранения проблемы с дублированием имен пользователей на экране входа после обновления Windows 10. Многие пользователи сообщают о проблеме с дублированием имен пользователей на экране входа в систему, которая возникает после установки обновлений в Windows 10. </p> <p><img src=\"images/image_thumb-44-494.png\" alt=\"FIX: Duplicate User Names in Sign-in Screen Windows 10\" loading=\"lazy\"></p> <p> Проблема в деталях: после переименования компьютера или после установки обновлений в Windows 10 система не выполняет автоматический вход в вашу учетную запись пользователя с ошибкой «неверное имя пользователя или пароль. Повторите попытку», и одновременно появляется ваше имя пользователя дважды на экране входа в систему. </p> <h4> Как исправить: на экране входа в Windows 10 один и тот же пользователь дважды отображается. </h4> <h6> Метод 1. Удалите повторяющуюся учетную запись из опций учетной записи пользователя. </h6> <p> Первый способ удалить повторяющиеся имена пользователей с экрана входа в систему - это удалить повторяющуюся учетную запись с вашего ПК. </p> <p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-923.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. В поле «Открыть» введите: <strong> контролировать userpasswords2 </strong> и щелкнуть <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-29-663.png\" alt=\"control userpasswords2 \" loading=\"lazy\"></p> <p> 3. В разделе «Учетные записи пользователей» выполните следующие действия в зависимости от вашего случая: </p> <ul> <li><strong> Дело А. </strong> Если вы видите две учетные записи с одинаковым именем пользователя: </li> </ul> <blockquote><p> а. Выберите дополнительную учетную запись и нажмите <strong> Удалять </strong> . <br> б. Нажмите <strong> ОК </strong> а также <strong> запустить снова </strong> ваш компьютер. <br> c. Если после перезапуска вы по-прежнему дважды видите свое имя пользователя на экране входа в систему, перейдите к способу 2. </p></blockquote> <p><img src=\"images/image_thumb-37-605.png\" alt=\"User Accounts Options\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Случай Б. </strong> Если вы видите только одну учетную запись: </li> </ul> <blockquote><p> а. Выберите учетную запись и нажмите <strong> Характеристики </strong> . <br> б. Скопируйте полное имя и вставьте его в поле имени пользователя для соответствия. * <br> c. Нажмите <strong> ОК </strong> а также <strong> запустить снова </strong> ваш компьютер. </p></blockquote> <p> * Примечание: если имя пользователя и полное имя уже совпадают, перейдите к способу 2. </p> <p><img src=\"images/image_thumb-38-262.png\" alt=\"Remove Duplicate User Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Способ 2. Отключите требование пароля при входе в систему. </h6> <p> 1. Выполните шаги 1 и 2 предыдущего метода, чтобы открыть параметры «Учетные записи пользователей». <br> 2. <strong> Снимите отметку </strong> в <strong> Пользователь должен ввести имя пользователя и пароль, чтобы использовать этот компьютер. </strong> и нажмите <strong> Применять </strong></p> <p><img src=\"images/image_thumb-42-373.png\" alt=\"User must enter a user name and password to use this computer \" loading=\"lazy\"></p> <p> </p> <p> 3. Введите свой пароль (дважды) и щелкните <strong> ОК </strong> дважды, чтобы закрыть все окна. </p> <p><img src=\"images/image_thumb-43-970.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. <strong> Перезагрузить </strong> твой компьютер. Если ваше имя пользователя снова появляется дважды, перейдите к следующему способу. </p> <h6></h6> <h6> Способ 3. Измените параметры входа. </h6> <p> </p> <p> 1. С самого начала <img src=\"images/image_thumb-39-183.png\" alt=\"image\" loading=\"lazy\"> меню, открыть <strong> Настройки </strong> <img src=\"images/image_thumb-50-520.png\" alt=\"image\" loading=\"lazy\"> а затем щелкните <strong> учетные записи </strong> . </p> <p><img src=\"images/image_thumb-43-892.png\" alt=\"How to Add a New User in Windows 10, 8.1.\" loading=\"lazy\"></p> <p> </p> <p> 2. Выберите <strong> Варианты входа </strong> на левой панели и <strong> выключать </strong> в <strong> Использовать мои данные для входа, чтобы автоматически завершить настройку устройства и повторно открыть мои приложения после обновления или перезапуска </strong> . </p> <p><img src=\"images/image_thumb-40-207.png\" alt=\"Modify Sign in Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Запустить снова </strong> ваш компьютер. </p> <p> </p> <h6> Метод 4. Перейдите на локальную учетную запись. </h6> <p> Последний метод решения проблемы «повторяющихся имен пользователей» - использовать локальную учетную запись для входа в Windows 10. Для этого: </p> <p> 1. С самого начала <img src=\"images/image_thumb-41-454.png\" alt=\"image\" loading=\"lazy\"> меню, открыть <strong> Настройки </strong> <img src=\"images/image_thumb-50-790.png\" alt=\"image\" loading=\"lazy\"> а затем щелкните <strong> учетные записи </strong> . <br> 2. Щелкните <strong> Электронная почта и учетные записи </strong> на левой панели. <br> 3. Далее щелкните <strong> Вместо этого войдите в локальную учетную запись. </strong></p> <p> </p> <p><img src=\"images/image_thumb-37-653.png\" alt=\"sign-in with a local account instead windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Введите пароль своей учетной записи Microsoft и нажмите <strong> Следующий </strong> . <br> 5. Затем введите имя пользователя, пароль (необязательно) для новой локальной учетной записи и щелкните <strong> Следующий </strong> . <br> 6. После перезапуска введите пароль для входа в новую локальную учетную запись. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}