{"title":"ИСПРАВЛЕНИЕ: 2147219196 Ошибка файловой системы в приложении «Фото» в Windows 10 (решено)","content":"<p> На компьютере под управлением Windows 10 с приложением «Фотографии» в качестве приложения по умолчанию для открытия изображений появляется «Ошибка файловой системы« -2147219196 », когда пользователь пытается открыть изображение .JPG или .PNG (с помощью« ФОТО » приложение). </p> <p><img src=\"images/image_thumb-73-456.png\" alt=\"FIX: 2147219196 File system error in Photos app \" loading=\"lazy\"></p> <p> </p> <p> В этом руководстве содержатся инструкции по устранению «Ошибка файловой системы 2147219196» при открытии изображений в приложении «Фото» в Windows 10. </p> <h4> Как исправить: не удается открыть изображения с помощью приложения «Фотографии» в Windows 10 с ошибкой «Ошибка файловой системы 2147219196». </h4> <p> Примечание. Прежде чем продолжить, убедитесь, что ваша система полностью обновлена. </p> <h6> Шаг 1. Запустите средство устранения неполадок приложений Магазина Windows. </h6> <p> 1. Перейдите к <strong> Начинать </strong> -&gt; <strong> Настройки </strong> -&gt; <strong> Обновление и безопасность </strong> . <br> 2. Выберите <strong> Устранение неполадок </strong> слева, а затем щелкните <strong> Средство устранения неполадок приложений Магазина Windows </strong> справа и щелкните <strong> Запустите средство устранения неполадок </strong> . </p> <p><img src=\"images/image_thumb-74-400.png\" alt=\"windows store apps troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 3. Следуйте инструкциям на экране, и пусть средство устранения неполадок устранит проблемы. <br> 4. Когда устранение неполадок будет выполнено, закройте средство устранения неполадок и попробуйте открыть файл изображения. Если ошибка не исчезнет, ​​перейдите к следующему шагу. </p> <p><img src=\"images/image_thumb-75-371.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Шаг 2. Восстановите или сбросьте настройки приложения «Фото». </h6> <p> Если вы получаете сообщение «2147219196» при попытке открыть файл .JPG или .PNG с помощью приложения «Фото», попробуйте восстановить приложение. Для этого: </p> <p> 1. Перейдите к <strong> Начинать </strong> -&gt; <strong> Настройки </strong> -&gt; <strong> Программы. <br> </strong> 2. На <strong> Приложение и функции, </strong> найдите и выберите <strong> Фотографии Microsoft </strong> и нажмите <strong> Расширенные опции. </strong></p> <p><img src=\"images/image_thumb-76-358.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. В разделе «Дополнительные параметры» щелкните значок <strong> Ремонт </strong> кнопка. <br> 4. Когда процесс будет завершен, вы увидите галочку. <img src=\"images/image_thumb-77-553.png\" alt=\"image\" loading=\"lazy\"> рядом с кнопкой «Восстановить». Продолжите и проверьте, устранена ли «Ошибка файловой системы 2147219196», открыв фотографию. <br> 5. Если проблема не исчезнет, ​​щелкните значок <strong> Сброс настроек </strong> кнопку, чтобы сбросить настройки приложения Фото. </p> <p><img src=\"images/image_thumb-78-665.png\" alt=\"repair - reset photos app\" loading=\"lazy\"></p> <p> </p> <h6> Шаг 3. Полностью удалите и переустановите приложение «Фотографии». </h6> <p> Следующим шагом по устранению «Ошибка файловой системы« -2147219196 »в приложении« Фото »является полное удаление из системы и переустановка приложения« Фото ». Для этого: </p> <p> 1. Открыть <strong> PowerShell </strong> в виде <strong> Администратор </strong> . <br> 2. В PowerShell введите следующую команду и нажмите <strong> Входить </strong> , чтобы полностью удалить приложение &quot;Фото&quot;: * </p> <ul> <li><strong> Get-AppxPackage * фото * | Удалить-AppxPackage -allusers </strong></li> </ul> <p> * Информация: приведенная выше команда удалит приложение «Фото» из Windows 10, а также удалит установочные файлы и остатки приложения «Фото» из каталога «C: \\ Program Files \\ WindowsApps \\». </p> <p><img src=\"images/image_thumb-95-600.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Когда команда будет завершена, <strong> запустить снова </strong> твой компьютер. <br> 4. Откройте Microsoft Store и установите <a href=\"https://www.microsoft.com/en-us/p/microsoft-photos/9wzdncrfjbh4#activetab=pivot:overviewtab\" target=\"_blank\" rel=\"nofollow noopener\"> Фотографии Microsoft </a> . </p> <p><img src=\"images/image_thumb-89-238.png\" alt=\"reinstall photos app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Щелкните <strong> Установить, </strong> , чтобы переустановить приложение &quot;Фото&quot; в вашей системе. </p> <p><img src=\"images/image_thumb-90-948.png\" alt=\"install photos app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. После установки приложения «Фото» откройте изображение. Ошибка «Ошибка файловой системы 2147219196» должна была быть устранена. </p> <p> Вот и все, ребята! Это сработало для вас? Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}