{"title":"ИСПРАВЛЕНИЕ: не удалось подключиться к службе обновлений. Убедитесь, что вы подключены к Интернету в Windows 10 (решено)","content":"<p> В этом руководстве содержатся инструкции по исправлению следующей ошибки в обновлении Windows 10: «Не удалось подключиться к службе обновлений. Мы попробуем еще раз позже, или вы можете проверить сейчас. Если это все еще не работает, убедитесь, что вы» повторно подключен к Интернету &quot;. </p> <p><img src=\"images/image_thumb-46-713.png\" alt=\"We couldn't connect to the update service. Make sure you're connected to the Internet in Windows 10 update\" loading=\"lazy\"></p> <p> </p> <p> Microsoft знает о вышеуказанной проблеме с обновлением и, поскольку она <a href=\"https://support.microsoft.com/en-us/help/4464619/windows-10-update-history\" target=\"_blank\" rel=\"nofollow noopener\"> объявлено 4 февраля 2019 г. </a> : &quot;Служба Центра обновления Windows пострадала от проблемы с повреждением данных из-за глобального сбоя внешнего поставщика службы DNS 29 января 2019 года. Проблема была решена в тот же день, и Центр обновления Windows теперь работает нормально, но некоторые клиенты продолжили сообщать о проблемах с подключением к службе Центра обновления Windows. Мы ожидаем, что эти проблемы исчезнут, поскольку последующие DNS-серверы будут обновлены с использованием исправленных записей DNS Центра обновления Windows ». </p> <p> Поскольку многие пользователи сообщили, что проблема еще не устранена и также влияет на Защитник Windows (не может обновлять определения Защитника) и Microsoft Store (Магазин не работает), прочтите приведенные ниже инструкции, чтобы решить любые проблемы с обновлением в Windows 10, или в Защитнике Windows и в Магазине Windows. </p> <h2> Как исправить: не удалось подключиться к службе обновления в Windows 10. </h2> <h6> Метод 1. Измените настройки DNS. </h6> <p> 1. <strong> Щелкните правой кнопкой мыши </strong> на <strong> Сеть </strong> икона <img src=\"images/image_thumb-42-546.png\" alt=\"image\" loading=\"lazy\"> на панели задач и щелкните <strong> Откройте Центр управления сетями и общим доступом. </strong> * </p> <p><img src=\"images/image_thumb-104-256.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> </p> <p> 2. Выберите <strong> Ethernet </strong> (или Wi-Fi) слева, а затем в разделе &quot;Связанные настройки&quot; нажмите <strong> Изменить параметры адаптера </strong> . </p> <p><img src=\"images/image_thumb-43-363.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3. Щелкните правой кнопкой мыши активный сетевой адаптер (Ethernet или Wi-Fi) и выберите <strong> Характеристики </strong> . </p> <p><img src=\"images/image_thumb-44-396.png\" alt=\"network properties\" loading=\"lazy\"></p> <p> 4. Выберите <strong> ‘Интернет-протокол версии 4 (TCP / IPv4) </strong> ’И нажмите <strong> Характеристики </strong></p> <p><img src=\"images/image_thumb-106-941.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 5. В свойствах Интернет-протокола версии 4 (TCP / IPv4): </p> <blockquote><p> а. <strong> Проверять </strong> в <strong> Используйте следующие адреса DNS-серверов: </strong> переключатель. <br> б. Затем введите следующие адреса DNS-серверов (общедоступные DNS-серверы Google) и нажмите <strong> ОК. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> </blockquote> <p><img src=\"images/image_thumb-109-998.png\" alt=\"google dns settings\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Запустить снова </strong> твой компьютер. </p> <p> </p> <h6> Метод 2. Запустите средство устранения неполадок Центра обновления Windows. </h6> <h6> Метод 2. Запустите средство устранения неполадок Центра обновления Windows. </h6> <p> 1. Перейдите в Windows. <strong> Панель управления </strong> , установите для параметра &quot;Просмотр по&quot; значение <strong> Маленькие значки </strong> и открыть <strong> Поиск проблемы. </strong></p> <p><img src=\"images/image_thumb-5-213.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. В параметрах устранения неполадок щелкните <strong> Устранение проблем с Центром обновления Windows. </strong></p> <p><img src=\"images/image_thumb-9-911.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Щелкните <strong> Следующий </strong> для устранения проблем с обновлением Windows. </p> <p><img src=\"images/image_thumb-8-372.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Когда процесс устранения неполадок будет завершен, <strong> Закрыть </strong> средство устранения неполадок и <strong> запустить снова </strong> ваш компьютер. <br> 6. Проверить обновления. </p> <h6> Способ 3. <strong> Удалите папку хранилища обновлений. </strong></h6> <p> «C: \\ Windows \\ SoftwareDistribution» - это место, где Windows хранит обновления Windows. Часто эта папка повреждается, и вам необходимо создать ее заново, чтобы загрузить обновления и установить с нуля. Чтобы перестроить (воссоздать) папку «SoftwareDistribution», выполните следующие действия: </p> <p><strong> Шаг 1. Остановите службу обновления Windows. </strong></p> <p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-610.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. В поле поиска введите: <strong> services.msc </strong> и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-12-860.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 3. В панели управления службами найдите <strong> Центр обновления Windows </strong> услуга. <br> 4. Щелкните правой кнопкой мыши на <strong> Центр обновления Windows </strong> сервис и выберите <strong> Стоп </strong> . </p> <p><img src=\"images/image_thumb-9-707.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Шаг 2. Удалите папку SoftwareDistribution. </strong></p> <p> 1. Откройте проводник Windows и перейдите к: <strong> C: \\ Windows </strong> папка. <br> 2. Найдите и <strong> Удалить </strong> в <strong> Программное обеспечение </strong> папку (или переименуйте ее, например, в «SoftwareDistributionOLD»). </p> <p> </p> <p><img src=\"images/image_thumb-10-148.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p><strong> Шаг 3. Запустите службу обновления Windows. </strong></p> <p> 1. Откройте панель управления службами Windows. <br> 2. Щелкните правой кнопкой мыши на <strong> Центр обновления Windows </strong> сервис и выберите <strong> Начинать </strong> . </p> <p><img src=\"images/image_thumb-11-233.png\" alt=\"start windows update service\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Шаг 4. Проверьте и установите Центр обновления Windows 10. </strong></p> <p> 1. Перейдите к <strong> Настройки </strong> -&gt; <strong> Обновление и безопасность </strong> и нажмите <strong> Проверить наличие обновлений </strong> . </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}