{"title":"ИСПРАВЛЕНИЕ: ОБНАРУЖЕНИЕ СПЕЦИАЛЬНОГО БАССЕЙНА ПОВРЕЖДЕНИЕ ПАМЯТИ, вызванное ntoskrnl.exe BSOD 0x000000c1 (решено)","content":"<p> На компьютере под управлением Windows 10 появляется следующая ошибка BSOD: «SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION, вызванная файлом ntoskrnl.exe с кодом ошибки 0x000000c1. Ошибка проверки ошибок« 0x000000c1 - SPECIAL POOL DETECTED MEMORY CORRUPTION »обычно вызывается устройством из установленного программного обеспечения или устройства драйвер и не из-за проблемы с оборудованием. </p> <p><strong> СПЕЦИАЛЬНЫЙ ПУЛ ОБНАРУЖИЛ ПОВРЕЖДЕНИЕ ПАМЯТИ, код проверки ошибки 0x000000c1 Ошибка BSOD в деталях: </strong><br> &quot; <em> Обнаружена проблема, и Windows была выключена, чтобы предотвратить повреждение <br> к вашему компьютеру. <br> </em><em> По всей видимости, причиной проблемы стал следующий файл: ntoskrnl.exe. <br> SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION <br> … .. <br> *** СТОП: 0x000000c1 (0xfffff30dd554cfc0, 0xfffff30dd554c22c, 0x0000000000034038, <br> 0x0000000000000032) </em></p> <p><em> *** ntoskrnl.exe - Адрес базы 0xfffff803c544aca0 по адресу 0xfffff803c52a2000 DateStamp <br> 0x5b63c7b5 &quot; </em></p> <p><img src=\"images/image_thumb-1-562.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Это руководство содержит подробные инструкции по устранению ошибки синего экрана 0x000000c1 - СПЕЦИАЛЬНЫЙ ПУЛ ОБНАРУЖИВАЕТ ПОВРЕЖДЕНИЕ ПАМЯТИ, вызванное файлом «ntoskrnl.exe». </p> <p> </p> <h2> Как ИСПРАВИТЬ СТОП 0x000000C1: СПЕЦИАЛЬНЫЙ БАССЕЙН ОБНАРУЖИЛ ПОВРЕЖДЕНИЕ ПАМЯТИ, ВЫЗВАННОЕ NTOSKENL.EXE. </h2> <p> Проблема с синим экраном «Stop 0x000000C1: SPECIAL POOL DETECTED MEMORY CORRUPTION» может быть вызвана несколькими причинами, например неисправные драйверы устройств, поврежденные системные файлы, вирусные атаки или программа, работающая в фоновом режиме. Чтобы решить эту проблему, выполните следующие действия: </p> <h6> Метод 1. Просканируйте вашу систему на наличие вирусов и вредоносных программ. </h6> <p> Первый шаг к решению проблемы с синим экраном «ОБНАРУЖЕНИЕ СПЕЦИАЛЬНОГО ПУЛА ПАМЯТИ» - убедиться, что ваша система не содержит вирусов и вредоносных программ. Для этой задачи следуйте инструкциям в этом руководстве: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Как проверить компьютер на вирусы и другие вредоносные программы. </a></p> <p> </p> <h6> Метод 2. Удалите антивирусное программное обеспечение / программное обеспечение безопасности. </h6> <p> Проблема с синим экраном «СПЕЦИАЛЬНЫЙ ПУЛ ОБНАРУЖЕНА ПОВРЕЖДЕНИЕ ПАМЯТИ» может возникнуть после автоматического обновления антивирусной программы / программы безопасности (особенно если вы используете AVAST или AVG). Итак, продолжайте и полностью удалите антивирусную программу из вашей системы перезагрузите компьютер. <br> - Если проблема BSOD не возникает после удаления антивируса, перейдите к загрузке и повторной установке последней версии программного обеспечения безопасности в вашей системе. </p> <p> </p> <h6> Метод 3. Запустите Windows в состоянии чистой загрузки. </h6> <p> Следующий метод решения проблемы BSOD «ОБНАРУЖЕНИЕ СПЕЦИАЛЬНОГО БАССЕЙНА ПОВРЕЖДЕНИЯ ПАМЯТИ» - запустить Windows в <a href=\"https://www.repairwin.com/how-to-start-windows-in-clean-boot-state/\" target=\"_blank\" rel=\"nofollow noopener\"> &quot;чистая загрузка </a> &quot;состояние, чтобы определить, какая программа вызывает сбой вашей системы. </p> <p> Чтобы запустить Windows в состоянии чистой загрузки: </p> <p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-465.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. Тип <strong> msconfig </strong> и нажмите <strong> Входить </strong> . </p> <p><img src=\"images/image_thumb-47-632.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. На вкладке &quot;Службы&quot; <strong> Скрыть все службы Microsoft </strong> флажок, а затем нажмите <strong> Отключить все </strong> , чтобы запретить запуск всех сторонних служб при запуске Windows. </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-480.png\" alt=\"clean boot state\" loading=\"lazy\"></p> <p> 4. Затем выберите <strong> Запускать </strong> вкладка и <strong> Запрещать </strong> все другие программы, которые запускаются при запуске Windows и работают в фоновом режиме. * </p> <p> * Примечание: Вкл. <strong> Windows 10 </strong> или же <strong> 8 </strong> , Выбрать <strong> Открыть диспетчер задач </strong> для того, чтобы отключить автозагрузку программ. </p> <p><img src=\"images/image_thumb-29-570.png\" alt=\"Windows clean boot\" loading=\"lazy\"></p> <p> </p> <p> 5. Когда закончите, нажмите <strong> ОК </strong> а также <strong> Запустить снова </strong> твой компьютер. <br> 6. Если после перезагрузки ваш компьютер работает нормально и без проблем с BSOD, то снова запустите утилиту настройки системы, включите один за другим все отключенные элементы и перезапустите систему, пока вы не узнаете, какой из них вызывает проблему BSoD. * </p> <p> * Примечание: Кому <strong> выход </strong> из <strong> Чистая загрузка </strong> состояния, запустите утилиту настройки системы и на <strong> Общий </strong> Вкладка выбрать <strong> Нормальный запуск. </strong></p> <p> </p> <h6> Метод 4. Проверьте память (RAM) и жесткий диск (HDD) на наличие проблем. </h6> <p> Проблемы с синим экраном могут быть вызваны повреждением модуля ОЗУ или неисправным жестким диском. Чтобы протестировать и диагностировать компоненты оперативной памяти и жесткого диска на наличие проблем, следуйте инструкциям в этих руководствах: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Как диагностировать проблемы с памятью компьютера с помощью Memtest86 + </a></li> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Лучшие инструменты для тестирования и диагностики жесткого диска для проверки состояния жесткого диска </a></li> </ul> <p> </p> <p> </p> <h6> Способ 5. Обновите драйверы устройств. </h6> <p> В некоторых случаях проблема BSOD «SPECIAL_POOL_DETECTED_MEMORY_CORRUPTION, вызванная модулем ntoskrnl.exe» возникает из-за недопустимого или поврежденного драйвера устройства. Итак, продолжайте и обновляйте драйверы следующих устройств на вашем компьютере в таком порядке: </p> <p> 1. Видеоадаптер (VGA). <br> 2. Чипсет. <br> 3. Адаптер Ethernet. <br> 4. Адаптер Wi-Fi (если есть). </p> <p> </p> <h6> Метод 6. <strong> Проанализируйте минидамп. </strong></h6> <p> Когда Windows вылетает с синим экраном, сохраняет детали экрана BSoD в небольших файлах, которые называются &quot; <strong> MiniDump </strong> &quot;. Анализ <strong> Минидамп </strong> файл (ы) могут помочь вам устранить неполадки и решить проблему с синим экраном. Для выполнения этой задачи следуйте инструкциям в этой статье: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Как анализировать файлы мини-дампа с помощью BlueScreenView </a> . </p> <p> Это все! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}