{"title":"ИСПРАВЛЕНИЕ: проблема с большим объемом памяти в Chrome (решена)","content":"<p> Как вы, возможно, уже заметили, Google Chrome открывает множество фоновых процессов, даже если вы открыли только несколько окон / вкладок Chrome. Это происходит потому, что Google Chrome спроектирован таким образом, чтобы создавать индивидуальный процесс для каждого плагина или расширения, установленного при открытии нового окна или вкладки. </p> <p> Хотя открытие нескольких процессов из Google Chrome является нормальным явлением, на самом деле это проблема, потому что такое поведение вызывает большое использование памяти и приводит к зависанию компьютера. </p> <p><img src=\"images/image_thumb-17-610.png\" alt=\"FIX: Multiple Processes in Chrome with High Memory Usage\" loading=\"lazy\"></p> <p> </p> <p> Это руководство содержит пошаговые инструкции о том, как запретить Chrome открывать несколько процессов для каждого окна или вкладки, чтобы решить проблему с высоким использованием памяти Chrome. </p> <h4> Как отключить несколько процессов Chrome в Windows 10. </h4> <h6> Шаг 1. Просканируйте свой компьютер на наличие вредоносных программ и вирусов. </h6> <p> Первый шаг перед устранением ошибки ERR_CONNECTION_CLOSED в Chrome - убедиться, что ваша система не содержит вирусов и вредоносных программ. Для этой задачи следуйте инструкциям в этом руководстве: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Как проверить компьютер на вирусы и другие вредоносные программы. </a></p> <h6></h6> <h6> Шаг 2. Отключите нежелательные расширения Chrome. </h6> <p> Прежде всего, проверьте, нужны ли вам все установленные расширения Chrome, и отключите те, которые вам не нужны. Для этого: </p> <p> 1. Из меню Chrome <img src=\"images/image_thumb-47-380.png\" alt=\"image\" loading=\"lazy\"> , перейти к <strong> Дополнительные инструменты </strong> -&gt; <strong> Расширения </strong></p> <p><img src=\"images/image_thumb-51-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Удалите (или отключите) все расширения, которые вам не нужны или вы не узнаете. </p> <p><img src=\"images/image_thumb-49-442.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Шаг 3. Запретить запуск Chrome в фоновом режиме, когда Chrome закрыт. </h6> <p> 1. В меню Chrome <img src=\"images/image_thumb-78-665.png\" alt=\"image\" loading=\"lazy\"> Выбрать <strong> Настройки </strong> . </p> <p><img src=\"images/image_thumb-79-868.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> 2. На <strong> Настройки </strong> страницу, прокрутите вниз и щелкните <strong> Передовой </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <p> 3. Установите переключатель &quot;Продолжать запуск фоновых приложений при закрытии Google Chrome&quot; в положение <strong> ВЫКЛЮЧЕННЫЙ </strong> . </p> <p><img src=\"images/image_thumb-18-557.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <p> </p> <h6> Шаг 4. Запретите Chrome открывать несколько процессов для одного и того же сайта. </h6> <p> 1, <strong> Щелкните правой кнопкой мыши </strong> на <strong> Гугл Хром </strong> ярлык и выберите <strong> Характеристики </strong> . <br> 2. На <strong> Общий </strong> на вкладке добавьте переключатель «–process-per-site» (без кавычек) в конец целевой строки и нажмите <strong> ОК </strong> а также <strong> Продолжать </strong> применить изменение <strong> . * </strong></p> <p> например &quot;C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; - процесс для каждого сайта. </p> <p> Примечание. Перед –process-per-site стоит пробел. </p> <p><img src=\"images/image_thumb-19-818.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Шаг 5. Отключите изоляцию сайтов Google Chrome. </h6> <p> В режиме изоляции сайтов Chrome загружает каждый веб-сайт в отдельном процессе. Фактически, это дополнительная функция безопасности, предотвращающая кражу ваших данных веб-сайтом с другого веб-сайта, открытого для другого окна / вкладки. Но режим «Изоляция сайта» увеличит использование памяти Chrome примерно на 10%. </p> <p> 1. В адресной строке Chrome введите <a href=\"//flags/#site-isolation-trial-opt-out\" target=\"_blank\" rel=\"nofollow noopener\"> хром: // флаги / # сайт-изоляция-пробная-отказ </a> и нажмите Enter. </p> <p> 2. Установите <strong> Отключить изоляцию сайта </strong> режим для <strong> Отключено </strong> а затем щелкните <strong> Перезапустить сейчас </strong> . * </p> <p> * Примечание: </p> <p><img src=\"images/image_thumb-20-397.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? </p> <p> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}