{"title":"ИСПРАВЛЕНИЕ: истек срок ожидания семафора при копировании файлов (решено)","content":"<p> Ошибка «Время ожидания семафора истекло» может отображаться при попытке скопировать большие файлы по сети или при передаче файлов с внешнего USB-накопителя на компьютер. В других случаях «Ошибка 0x80070079: истек срок ожидания семафора» появляется при попытке скопировать файлы с подключенного USB-устройства (например, с фотокамеры, мобильного телефона и т. Д.). </p> <p><img src=\"images/image_thumb-4-812.png\" alt=\"Semaphore Timeout Period has Expired\" loading=\"lazy\"></p> <p> </p> <p> В этом руководстве вы найдете несколько способов решить проблему «истек срок ожидания семафора. Ошибка 0x80070079» при копировании файлов из / в сеть или USB в Windows 10, 8, 8.1, 7 или Vista. </p> <h4> Как исправить: ошибка при копировании файла или папки. Срок семафора истек. </h4> <p><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> ЧАСТЬ 1. ИСПРАВЛЕНИЕ «Срок семафора истек» при копировании файлов с USB. </a></p> <p><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> ЧАСТЬ 2. ИСПРАВЛЕНИЕ «Срок семафора истек» при копировании файлов из сети. </a></p> <p> </p> <h6> ЧАСТЬ 1. ИСПРАВЛЕНИЕ «Срок семафора истек» при копировании файлов с USB. </h6> <p> Если вы получаете сообщение об ошибке «Срок действия семафора истек» при копировании файлов с USB-устройства (например, с внешнего USB-диска или с цифровой камеры), попробуйте следующее, чтобы устранить проблему: </p> <p><strong> 1. </strong> Закройте все открытые программы и <strong> запустить снова </strong> твой компьютер. <br> <strong> 2. </strong> Подключите USB-устройство к <strong> другой порт USB </strong> . Если на вашем компьютере есть порт USB 2.0, подключите USB-устройство к этому порту. <br> <strong> 3. </strong> Использовать <strong> другой кабель USB </strong> для подключения USB-устройства к компьютеру. <br> <strong> 4. </strong> Если вы хотите скопировать файлы с USB-устройства (например, вашего мобильного телефона или цифровой камеры), на котором есть SD-карта, тогда <strong> Удалить </strong> а также <strong> повторно вставить </strong> в <strong> SD Card </strong> . Кроме того, извлеките SD-карту из USB-устройства и подключите ее к <strong> картридер </strong> (если он у вас есть). <br> <strong> 5. </strong> <strong> Проверять </strong> а также <strong> исправить ошибки </strong> на USB-накопителе с помощью &#39; <strong> chkdsk </strong> команда. Для этого: </p> <blockquote><p> 1. Запуск <strong> Командная строка от имени администратора </strong> . </p></blockquote> <p><img src=\"images/image_thumb-30-765.png\" alt=\"command prompt administrator\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 2. В окне командной строки введите следующую команду и нажмите <strong> Входить </strong> : * </p></blockquote> <ul> <li> <ul> <li> <ul> <li><strong> chkdsk X: / F / R </strong></li> </ul> </li> </ul> </li> </ul> <p><strong> * Примечание: </strong> Замените букву диска X на букву USB-накопителя. </p> <p> </p> <p> </p> <h6> ЧАСТЬ 2. ИСПРАВЛЕНИЕ «Срок семафора истек» при копировании файлов по сети. </h6> <p> Если вы получаете сообщение об ошибке «Срок действия семафора истек» при попытке скопировать файлы по сети, попробуйте следующее: </p> <h2> Метод 1. Используйте статический IP-адрес. </h2> <p> Если вы используете DHCP, отключите его и укажите статический IP-адрес на обоих сетевых компьютерах. </p> <p> </p> <h2> Метод 2. Обновите сетевые драйверы на обоих компьютерах. </h2> <ul> <li> Если у вас есть портативный компьютер, попробуйте следующее: <ul> <li> Если вы подключены через Wi-Fi, попробуйте скопировать файлы, используя подключение Ethernet (LAN), или ... </li> <li> Перейдите на сайт поддержки производителя вашего ноутбука, чтобы загрузить и установить последние сетевые драйверы. </li> </ul> </li> <li> Если у вас настольный компьютер, загрузите последние версии драйверов для сетевой карты с сайта поддержки производителя материнской платы. </li> </ul> <p><strong> КОНЧИК: </strong> Если вы не можете найти модель своего ноутбука или материнской платы, сделайте следующее: </p> <blockquote><p> 1. Нажмите кнопку <strong> Окна </strong> <img src=\"images/image_thumb8_thumb_thumb-904.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. Тип: <strong> devmgmt.msc </strong> и нажмите <strong> ОК </strong> открыть &quot;Диспетчер устройств&quot; <strong> . </strong></p></blockquote> <p><img src=\"images/image_thumb-1-166.png\" alt=\"device manager\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> </p> <p> 3. В диспетчере устройств разверните <strong> Сетевые адаптеры. <br> </strong> 4. Щелкните правой кнопкой мыши сетевой адаптер и выберите <strong> Обновить драйвер </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-946.png\" alt=\"update driver\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Позвольте Windows автоматически найти драйвер обновления для сетевого адаптера. * </p></blockquote> <p><strong> *Примечание: </strong> Если Windows не может найти обновленный драйвер, используйте имя адаптера (например, «Сетевой адаптер Broadcom 802.11g») и выполните поиск обновленного драйвера вручную. </p> <p><img src=\"images/image_thumb-6-471.png\" alt=\"search for drivers\" loading=\"lazy\"></p> <p> </p> <p> </p> <h2> Метод 3. Временно отключите антивирус или брандмауэр. </h2> <p> Следующий метод решения проблемы «Срок семафора истек» - это временно отключить брандмауэр Windows и антивирусную программу. Чтобы отключить брандмауэр Windows: </p> <p> 1. Нажмите кнопку <strong> Окна </strong> <img src=\"images/image_thumb8_thumb_thumb-462.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. Тип: <strong> контроль </strong> и нажмите <strong> ОК </strong><strong> . </strong></p> <p><img src=\"images/image_thumb7-807.png\" alt=\"control panel command\" loading=\"lazy\"></p> <p> </p> <p> 3. Установите для параметра &quot;Просмотр по:&quot; значение <strong> Маленькие значки </strong> для отображения всех элементов панели управления. </p> <p> </p> <p><img src=\"images/image_thumb8-567.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Открыть <strong> Брандмауэр Windows </strong> (или «Брандмауэр Защитника Windows» в Windows 10). </p> <p><img src=\"images/image_thumb-7-921.png\" alt=\"disable firewall wiindows\" loading=\"lazy\"></p> <p> </p> <p> 5. Щелкните на <strong> Включение или выключение брандмауэра Windows </strong> . </p> <p><img src=\"images/image_thumb-8-655.png\" alt=\"turn off windows defender firewall\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Проверять </strong> &quot; <strong> Отключите брандмауэр Windows (не рекомендуется) </strong> &quot;вариант и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-9-907.png\" alt=\"turn off windows firewall\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Запустить снова </strong> свой компьютер, а затем скопируйте файлы. * </p> <p> * Примечание. После копирования файлов выполните указанные выше действия, чтобы повторно включить брандмауэр Windows. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}