{"title":"ИСПРАВЛЕНИЕ: Недостаточно памяти для обработки этой команды - невозможно получить доступ к общим папкам или использовать удаленный рабочий стол (решено)","content":"<p> Ошибка «Недостаточно памяти для обработки этой команды» может появиться, когда вы пытаетесь получить доступ к общим папкам на другой рабочей станции Windows или Server 2003, 2008, 2012 или 2016, или когда вы используете подключение к удаленному рабочему столу (RDP ), чтобы подключиться к другому компьютеру Windows (рабочей станции или серверу). </p> <p><img src=\"images/image_thumb-127.png\" alt=\"Not enough storage is available to process this command\" loading=\"lazy\"></p> <p> </p> <p> Это руководство содержит инструкции по устранению следующих проблем, которые могут возникнуть во всех версиях Windows (Windows 10, 8 / 8.1, 7, Vista, XP и Windows Server 2003, 2008, 2012 или 2016): </p> <p> 1. Когда вы пытаетесь получить доступ к общим папкам на сервере, вы получаете сообщение об ошибке: &quot; <em> Общая папка </em> не доступен. Возможно, у вас нет разрешения на использование этого сетевого ресурса. Свяжитесь с администратором этого сервера, чтобы узнать, есть ли у вас права доступа. Недостаточно памяти на сервере для обработки этой команды. &quot; </p> <p> 2. Когда вы пытаетесь удаленно подключиться (с помощью RDP) к другому компьютеру под управлением Windows, вы получаете сообщение об ошибке: «Система не может войти в систему по следующей причине. Недостаточно памяти для обработки этой команды». </p> <h4> КАК ИСПРАВИТЬ: Сообщение об ошибке «Недостаточно памяти для обработки этой команды» в удаленном рабочем столе (RDP) или при попытке доступа к общим папкам. </h4> <p> На &quot;сервере&quot; Windows, к файлам которого вы хотите получить доступ или подключиться удаленно: </p> <p><strong> 1. </strong> Нажмите &quot; <strong> Окна </strong> &quot;+&quot; <strong> р </strong> Клавиши, чтобы открыть <em> ЗАПУСТИТЬ </em> окно. <br> <strong> 2. </strong> Тип <strong> regedit </strong> и нажмите <strong> Входить </strong> , чтобы открыть редактор реестра. </p> <p><img src=\"images/image_thumb7-649.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Затем перейдите к этому ключу: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ LanmanServer \\ Parameters </strong></li> </ul> <p><img src=\"images/image_thumb-1-198.png\" alt=\"fix Not enough storage - cannot access shared items\" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> На правой панели дважды щелкните, чтобы открыть <strong> IRPStackSize </strong> значение <strong> . * </strong></p> <p><strong> * Примечание: </strong> Если вы не видите <strong> IRPStackSize </strong> значение, тогда: </p> <p> </p> <blockquote><p> 1. Щелкните правой кнопкой мыши пустое место (на правой панели) и выберите <strong> Новый </strong> -&gt; <strong> DWORD (32-битное) значение </strong></p> <p><img src=\"images/image_thumb-2-236.png\" alt=\"fix Not enough storage using RDP (Remote Desktop)\" loading=\"lazy\"></p> </blockquote> <blockquote><p> 2. Назовите новое значение. <strong> IRPStackSize </strong> и ударил <strong> Входить. </strong></p></blockquote> <p><strong> 5. </strong> Выбирать <strong> Десятичный </strong> , измените данные значения на <strong> 50 </strong> и нажмите <strong> ОК </strong> . * </p> <p> * Примечание: диапазон (в десятичном формате) для параметра составляет от 1 до 50. </p> <p><img src=\"images/image_thumb-3-255.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 6. </strong> <strong> Закрывать </strong> редактор реестра и <strong> запустить снова </strong> сервер. * </p> <p> * Важное примечание: если после перезагрузки вы получаете то же сообщение об ошибке, когда вы используете подключение к удаленному рабочему столу или пытаетесь получить доступ к общим файлам на другом компьютере, то примените вышеуказанное изменение реестра и к своему компьютеру. </p> <p> Это все! Это сработало для вас? </p> <p> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}