{"title":"ИСПРАВЛЕНИЕ: микрофон не обнаруживается или не работает в Windows 10 (решено)","content":"<p> Это руководство содержит инструкции по устранению проблем «микрофон не обнаружен» или «микрофон не работает» в Windows 10. Если у вас проблемы с микрофоном в Windows 10, это может быть вызвано несколькими причинами. Проблема «микрофон не работает» является проблемой для многих пользователей Windows 10 и обычно появляется после обновления Windows. </p> <p> Это руководство содержит несколько решений для устранения проблем с микрофоном в Windows 10. </p> <h4> Как исправить: микрофон в Windows 10 не работает или не обнаруживается. * </h4> <p> * Примечание. Если у вас возникли проблемы с микрофоном в конкретном приложении, попробуйте следующее: </p> <blockquote><p> 1. Убедитесь, что конкретному приложению разрешено использовать микрофон, следуя инструкциям в методе 1 ниже. <br> 2. Убедитесь, что микрофон выбран в качестве устройства ввода по умолчанию в настройках приложения. (например, в Skype перейдите на <strong> Настройки </strong> и убедитесь, что выбран ваш микрофон или гарнитура). <br> 3. Закройте все другие приложения, которые могут использовать ваш микрофон. <br> 4. Перезагрузите компьютер и снова проверьте микрофон. </p></blockquote> <h6> Решение 1. Разрешите приложениям доступ к вашему микрофону. </h6> <p> Первый способ решить проблемы с микрофоном в Windows 10 - убедиться, что все приложения имеют доступ к вашему микрофону. Для этого: </p> <p> 1.. Из меню &quot;Пуск&quot; <img src=\"images/image_thumb2_thumb_thumb-856.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> щелкнуть <strong> Настройки </strong><img src=\"images/image_thumb-66-804.png\" alt=\"image\" loading=\"lazy\"> а затем откройте <strong> Конфиденциальность </strong> . <br> 2. Выберите <strong> Микрофон </strong> на левой панели, а затем <strong> Включать </strong> в <strong> Разрешите приложениям доступ к вашему микрофону. </strong></p> <p><img src=\"images/image_thumb-34-268.png\" alt=\"How to FIX: Windows 10 Microphone Not Detected or Not Working\" loading=\"lazy\"></p> <p> 3. Затем прокрутите вниз и убедитесь, что приложение, которое вы хотите использовать с микрофоном, имеет к нему доступ. * </p> <p> * Предложение: для вашей конфиденциальности отключите доступ к микрофону для любого приложения, которое вы не хотите использовать с помощью микрофона. </p> <p><img src=\"images/image_thumb-35-517.png\" alt=\" FIX Windows 10 Microphone Not Working\" loading=\"lazy\"></p> <p> 4. Когда закончите, проверьте свой микрофон. </p> <h6> Решение 2. Убедитесь, что ваш микрофон является устройством ввода по умолчанию (записывающим устройством). </h6> <p> 1.. Из меню &quot;Пуск&quot; <img src=\"images/image_thumb2_thumb_thumb-930.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> щелкнуть <strong> Настройки </strong><img src=\"images/image_thumb-66-142.png\" alt=\"image\" loading=\"lazy\"> а затем откройте <strong> Система </strong> . <br> 2. Щелкните <strong> Звук </strong> на левой панели, а затем говорите, чтобы проверить свой микрофон. Если ваш микрофон работает, вы должны увидеть, как ползунок перемещается ниже. Если нет, то нажмите <strong> Управляйте звуковыми устройствами. </strong></p> <p><img src=\"images/image_thumb-36-254.png\" alt=\"Test Microphone Windows 10\" loading=\"lazy\"></p> <p> 3. В разделе «Параметры управления звуковыми устройствами» убедитесь, что ваш микрофон указан в разделе «Устройства ввода» в качестве устройства ввода по умолчанию, а его <strong> Включено </strong> . Если нет, нажмите на свой микрофон и нажмите <strong> Давать возможность. </strong></p> <p><img src=\"images/image_thumb-37-753.png\" alt=\"Enable Microphone Windows 10\" loading=\"lazy\"></p> <h6> Решение 3. Проверьте настройки микрофона на панели управления. </h6> <p> 1. Перейдите в Windows. <strong> Панель управления </strong> и открыть <strong> Звук. </strong></p> <p><img src=\"images/image_thumb-14-511.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. На <strong> Запись </strong> на вкладке выберите свой микрофон и нажмите <strong> Характеристики. </strong></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"Microphone Properties\" loading=\"lazy\"></p> <p> 3. На <strong> Уровень </strong> вкладка <strong> тащить </strong> ползунок к <strong> верно </strong> , чтобы увеличить громкость микрофона и убедиться, что микрофон не отключен (если микрофон отключен, его значок громкости <img src=\"images/image_thumb-39-434.png\" alt=\"image\" loading=\"lazy\"> , будет отображаться с красным символом <img src=\"images/image_thumb-40-819.png\" alt=\"image\" loading=\"lazy\"> ). Когда закончите, нажмите <strong> ОК </strong> а также <strong> ОК </strong> , чтобы закрыть Свойства звука. </p> <p><img src=\"images/image_thumb-41-896.png\" alt=\"Microphone Levels\" loading=\"lazy\"></p> <h6> Решение 4. Измените драйвер звуковой карты. </h6> <p> Последний метод решения проблем с микрофоном в Windows 10 - это изменение звукового драйвера, особенно если у вас есть аудиоустройство Realtek. Для этого: </p> <p> 1. Открыть <strong> Диспетчер устройств </strong> . Для этого: </p> <blockquote><p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-918.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. В поле «Открыть» введите: <strong> devmgmt.msc </strong> и щелкнуть <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-5-732.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Расширять </strong> в <strong> Звуковые, видео и игровые контроллеры. </strong></p> <p> 3. <strong> Щелкните правой кнопкой мыши </strong> на <strong> Аудио высокого разрешения Realtek </strong> устройство и выберите <strong> Обновить драйвер. <br> </strong></p> <p><img src=\"images/image_thumb-6-629.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Выберите <strong> Найдите на моем компьютере драйверы. </strong></p> <p><img src=\"images/image_thumb-7-637.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Выберите <strong> Позвольте мне выбрать из списка доступных драйверов на моем компьютере </strong> . </p> <p><img src=\"images/image_thumb-8-118.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. На следующем экране выберите <strong> Аудиоустройство высокой четкости </strong> и нажмите <strong> Следующий. </strong></p> <p><img src=\"images/image_thumb-20-989.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p> 8. В окне «Предупреждение об обновлении драйвера» нажмите «Да», чтобы установить новый драйвер. <br> 9. Когда установка драйвера будет завершена, <strong> запустить снова </strong> твой компьютер. <br> 10. После перезагрузки продолжите и проверьте свой микрофон. </p> <h6></h6> <h6> Решение 5. Удалите и переустановите драйверы звуковой карты. </h6> <p> Окончательное решение для устранения проблемы с неработающим микрофоном в Windows 10 - это полностью удалить и переустановить драйверы звуковой карты. </p> <p> 1. Перейдите к <strong> Панель управления </strong> &gt; <strong> Программа и особенности </strong> а также <strong> удалить </strong> любое программное обеспечение, связанное с вашей звуковой картой. <br> 2. Открыть <strong> Диспетчер устройств </strong> а также <strong> расширять </strong> в <strong> Звуковые, видео и игровые контроллеры. <br> </strong> 3. <strong> Щелкните правой кнопкой мыши </strong> на установленном <strong> Аудио-устройство </strong> и нажмите <strong> Удалить устройство. </strong></p> <p><img src=\"images/image_thumb-42-701.png\" alt=\"Uninstall Sound Card Device\" loading=\"lazy\"></p> <p> </p> <p> 4. Когда закончите, перейдите на сайт поддержки производителя вашего компьютера или ноутбука, загрузите и установите последнюю версию драйвера для вашей звуковой карты. <br> 5. После установки <strong> запустить снова </strong> свой компьютер и проверьте, работает ли ваш микрофон. </p> <p><strong> Дополнительная помощь: </strong> Если после применения вышеуказанных решений ваш микрофон по-прежнему не работает, возможно, он поврежден. Чтобы убедиться, что если у вас есть ноутбук, подключите внешний микрофон или используйте другой микрофон, если у вас есть настольный компьютер. </p> <p> Вот и все, ребята! Какой метод сработал для вас? Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}