{"title":"ИСПРАВЛЕНИЕ: Ошибка Outlook Express 0x800c0133 из-за ограничения размера 2 ГБ в файле DBX (решено)","content":"<p> Это руководство содержит инструкции по исправлению ошибки Outlook Express 0x800c0133 из-за ограничения размера 2 ГБ. Ошибка 0x800c0133 в OE возникает из-за того, что размер одной из папок Outlook превышает ограничение в 2 ГБ. </p> <p> Описание проблемы с ограничением размера .DBX 2 ГБ в Outlook Express. <br> Когда одна из основных папок Outlook Express (например, «Входящие» или «Отправленные») превышает размер 2 ГБ, OE возвращает ошибку 0x800c0133 во время операции отправки / получения, и иногда соответствующая папка OE становится пустой (поврежденной). * Например, если папка «Входящие» (Inbox.dbx) превышает размер 2 ГБ, OE не может получать новые электронные письма и отображает ошибку 0x800c0133. </p> <p> * Примечание. Если одна из папок OE пуста, значит, соответствующий файл DBX поврежден. В этом случае попробуйте восстановить свои электронные письма из поврежденной папки OE, следуя инструкциям в этой статье: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Как БЕСПЛАТНО восстановить файл Outlook Express DBX </a> . </p> <h4> Как исправить проблему с ограничением 2 ГБ в Outlook Express (ошибка отправки / получения 0x800c0133). </h4> <h6> Шаг 1. Включите просмотр скрытых файлов. </h6> <p> 1. Откройте проводник Windows. <br> 2. Из <strong> Инструменты </strong> меню выбрать <strong> Опции папки </strong> . <br> 3. На вкладке &quot;Просмотр&quot; щелкните <strong> Показать скрытые файлы и папки </strong> и нажмите <strong> ОК. </strong></p> <p><img src=\"images/image_thumb1_thumb-210.png\" alt=\"image_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Шаг 2. Найдите на диске файл DBX объемом 2 ГБ Outlook Express. </h6> <p> 1. Откройте папку магазина Outlook Express. Обычно эта папка находится на вашем диске по следующему пути: </p> <ul> <li> C: \\ Documents and Settings \\\\ Local Settings \\ Application Data \\ Identities \\ {} \\ Microsoft \\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> например «C: \\ Documents and Settings \\ Admin \\ Local Settings \\ Application Data \\ Identities \\ {D8F3C56D-965E-41AE-8A23-A58460ABAE00} \\ Microsoft \\ <strong> Outlook Express </strong> ” </p></blockquote> <p> 3. Из проводника <strong> Вид </strong> меню выбрать <strong> Подробности </strong> . <br> 4. Найдите файл DBX, размер которого превышает 2 ГБ. * </p> <p> * В этом примере размер файла Inbox.dbx превышает 2 ГБ. </p> <p><img src=\"images/image_thumb2_thumb-339.png\" alt=\"FIX Outlook Express Error 0x800c0133\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Шаг 3. Переместите электронные письма из папки Oversized Mail в папку New Mail. </h6> <p> 1. Откройте Outlook Express. <br> 2. Выберите большую почтовую папку (размером более 2 ГБ, например, папку «Входящие» в этом примере). <br> 3. Если вы видите свои электронные письма в этой папке (папка не пуста), выполните следующие действия: * </p> <p> * Примечание: если папка кажется пустой (вы не видите в ней никаких электронных писем), значит, папка OE (и связанный с ней файл DBX) повреждены. В этом случае вам необходимо восстановить свои электронные письма из поврежденной папки DBX, следуя инструкциям в этой статье. </p> <p> 4. На левой панели программы OE щелкните правой кнопкой мыши большую папку и выберите <strong> Новая папка </strong> (для создания новой почтовой папки) </p> <p><img src=\"images/image_thumb-6-403.png\" alt=\"outlook express 2gb limit\" loading=\"lazy\"></p> <p> </p> <p> 5. Введите узнаваемое имя новой папки и укажите год (например, «Входящие-2016»). </p> <p><img src=\"images/image_thumb-7-434.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Затем из большой папки (например, из папки «Входящие») выберите группу электронных писем (например, все электронные письма за 2016 год) и перетащите (переместите) их в новую папку «Почта», которую вы создали ранее (например, в « Входящие-2016 »). </p> <p><img src=\"images/image_thumb-8-450.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Повторите те же шаги (например, создавайте разные папки по годам и перемещайте письма из слишком большой папки в новые папки). * </p> <p> * Примечание: если вы столкнулись с проблемами во время операции перемещения (например, если вы не можете переместить некоторые сообщения в новую папку), то: </p> <blockquote><p> 1. Закройте Outlook Express. <br> 2. Скопируйте (сделайте резервную копию) папку «Outlook Express» из хранилища OE Store в другое место на вашем диске. <br> 3. Затем следуйте инструкциям на шаге 4, чтобы удалить слишком большой файл .dbx. <br> 4. Откройте Outlook Express. <br> 5. Импортируйте электронные письма из резервной папки OE (из <strong> Файл </strong> меню перейдите в -&gt; <strong> Импортировать </strong> <strong> Сообщения </strong> -&gt; <strong> Microsoft Outlook Express 6 </strong> -&gt; <strong> Импортировать почту из каталога оригинального магазина… </strong> ). ** </p> <p> ** Если проблемы во время импорта по-прежнему возникают, следуйте инструкциям в этой статье, чтобы восстановить поврежденный файл DBX. </p></blockquote> <p> </p> <p> 8. Когда вы закончите перенос электронной почты и папка размером 2 ГБ станет пустой (например, «Входящие» в этом примере), перейдите к следующему шагу. </p> <p><img src=\"images/image_thumb-10-811.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Шаг 4. Удалите с диска слишком большой файл Outlook Express DBX. </h6> <p> 1. Откройте папку с хранилищем Outlook Express на вашем диске. <br> 2. Удалите файл DBX большого размера (например, «Inbox.dbx» в этом примере). </p> <p><img src=\"images/image_thumb-9-996.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Запустите Outlook Express. <br> 4. OE создаст (автоматически) новую чистую и исправную почтовую папку для хранения писем. * </p> <p> * Примечание: если вы по-прежнему получаете ту же ошибку, попробуйте восстановить поврежденную папку OE, следуя инструкциям в этой статье: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Как БЕСПЛАТНО восстановить файл Outlook Express DBX </a> . </p> <p> Вот и все, ребята! Это сработало для вас? </p> <p> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}