{"title":"ИСПРАВЛЕНИЕ: Невозможно изменить тему - темы Aero неактивны в Windows 7 (решено)","content":"<p> На компьютере под управлением Windows 7 возникла следующая проблема: Windows была изменена на базовую тему, и пользователь не может изменить тему, потому что при открытии параметров персонализации все аэротемы отображаются серым цветом. Вместо этого все остальные настройки на панели персонализации включены (фон рабочего стола, цвет Windows, экранная заставка и т. Д.), Ожидайте выбора другой темы. </p> <p><img src=\"images/image_thumb-28-129.png\" alt=\"Cannot Change Theme – Themes Greyed Out\" loading=\"lazy\"></p> <p> </p> <p> Это руководство содержит инструкции по устранению следующей проблемы в Windows 7: Невозможно изменить тему - Темы выделены серым цветом. </p> <h4> Как исправить: невозможно изменить тему - темы Aero неактивны. </h4> <h6> Метод 1. Просканируйте вашу систему на наличие вирусов и вредоносных программ. </h6> <p> Первый шаг к решению проблемы «невозможно изменить основную тему» ​​- убедиться, что ваша система не содержит вирусов и вредоносных программ. Для этой задачи следуйте инструкциям в этом руководстве: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Как проверить компьютер на вирусы и другие вредоносные программы. </a></p> <h6> Способ 2. Перезапустите службу тем. </h6> <p> 1. Откройте панель управления службами Windows: Для этого: </p> <ul> <li> Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-720.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. </li> <li> В поле поиска введите: <strong><em> services.msc </em></strong> и нажмите <strong> ОК </strong> . </li> <li> (Примите предупреждение UAC, если оно появится). </li> </ul> <p><img src=\"images/image_thumb-12-580.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. В панели управления службами щелкните правой кнопкой мыши на <strong> Темы </strong> сервис и выберите <strong> Запустить снова </strong> . * </p> <p> * Примечание. Если служба остановлена, щелкните <strong> Начинать </strong> . </p> <p><img src=\"images/image_thumb-29-242.png\" alt=\"Themes Greyed Out - restart theme service\" loading=\"lazy\"></p> <p> </p> <h6> Метод 3. Включите визуальные стили для окон и кнопок. </h6> <p> 1. Щелкните значок <strong> Начинать </strong> кнопку, щелкните правой кнопкой мыши на <strong> Компьютер а </strong> и выберите <strong> Характеристики </strong> . </p> <p><img src=\"images/image_thumb-30-382.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Щелкните <strong> Расширенные системные настройки </strong> налево. </p> <p><img src=\"images/image_thumb-31-876.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. На вкладке &quot;Дополнительно&quot; нажмите. <strong> Настройки </strong> в разделе «Производительность». </p> <p><img src=\"images/image_thumb-15-696.png\" alt=\"fix High CPU and DISK Usage Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. В <strong> Визуальный эффект </strong> на вкладке, установите флажок «Использовать визуальные стили для окон и кнопок» и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-32-631.png\" alt=\"fix Theme cannot be changed - themes greyed out\" loading=\"lazy\"></p> <p> </p> <h6> Метод 4. Установите последние версии драйверов дисплея. </h6> <p><strong> 1. </strong> Перейдите к <strong> Панель управления </strong> &gt; <strong> Программы и компоненты </strong> а также <strong> удалить </strong> установленный в данный момент драйвер VGA. </p> <p><strong> 2. </strong> Когда операция удаления завершена <strong> запустить снова </strong> твой компьютер. </p> <p><strong> 3. </strong> После перезагрузки перейдите на сайт поддержки производителя вашего компьютера, чтобы загрузить и установить последние версии драйверов для вашей видеокарты. Если у вас есть настольный или портативный * компьютер с видеокартой AMD / ATI или NVIDIA VGA, выполните следующие действия, чтобы найти, загрузить и установить последнюю версию драйвера для видеокарты. </p> <p><strong> * Примечание: </strong> Если вы не можете найти драйверы по приведенным ниже ссылкам, перейдите на сайт поддержки производителя вашего компьютера. </p> <p> </p> <p><strong> Для графических процессоров на базе NVIDIA. </strong></p> <ol> <li> <ol> <li> Перейти к <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Страница расширенного поиска драйверов NVIDIA </a> и найдите соответствующий драйвер для вашего видеоадаптера. </li> <li> На странице результатов поиска скачайте предыдущую версию драйвера. </li> <li> Установите загруженный вами драйвер и перезагрузите компьютер. </li> </ol> </li> </ol> <p> </p> <p><strong> Для графических процессоров AMD. </strong></p> <ul> <li> <ol> <li> Перейти к <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Загрузка драйвера AMD (ATI) </a> и найдите соответствующий драйвер для вашего видеоадаптера. </li> <li> На странице результатов поиска нажмите кнопку <strong> Предыдущие драйверы и программное обеспечение </strong> ссылка справа. </li> <li> Установите загруженный вами драйвер и перезагрузите компьютер. </li> </ol> </li> </ul> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}