{"title":"ИСПРАВЛЕНИЕ: сенсорная панель не работает или зависает в Windows 10 (решено)","content":"<p> За последние годы я устранил множество проблем с сенсорной панелью в Windows 10 на нескольких ноутбуках (например, сенсорная панель не работает, сенсорная панель зависает и т. Д.), Поэтому я решил написать руководство по устранению этих проблем. </p> <p> Если у вас есть ноутбук, то время от времени у вас могут возникать проблемы с тачпадом устройства. Особенно если у вас Windows 10, тачпад часто может перестать работать или работать некорректно после установки обновления. Конечно, проблемы с сенсорной панелью могут указывать на аппаратную проблему, но во многих случаях неисправности сенсорной панели связаны с проблемами программного обеспечения. </p> <p> В Windows 10 сенсорная панель ноутбука может не работать по разным причинам, поэтому в этом руководстве будут рассмотрены все методы решения проблемы. </p> <h2> Как исправить проблемы с сенсорной панелью в Windows 10. </h2> <p> Выполните следующие действия, прежде чем переходить к следующим методам решения проблем с сенсорным экраном. </p> <ol> <li> Убедитесь, что Windows 10 не зависла, нажав ALT + CTRL + DEL и посмотрите, откроется ли диспетчер задач. </li> <li> Если на вашем ноутбуке есть комбинация функциональных клавиш для отключения и включения сенсорной панели. (например, Fn + F3), затем нажмите комбинацию клавиш Fn, чтобы включить сенсорную панель. (На некоторых ноутбуках тачпад можно включить / выключить, дважды коснувшись поверхности тачпада) </li> <li> Перезагрузите компьютер. </li> <li> Выполните полное выключение Windows 10, а затем снова включите ноутбук. (Чтобы выполнить полное выключение: нажмите и удерживайте кнопку <strong> СДВИГ </strong> ключ, а затем нажмите <strong> Начинать </strong> &gt; <strong> Мощность </strong> &gt; <strong> Неисправность </strong> ). </li> </ol> <p><strong> </strong></p> <h3> Метод 1. Включите сенсорную панель в Windows 10. </h3> <p> В Windows 10 есть возможность отключать или выключать тачпад при подключении внешней мыши. Итак, продолжайте и убедитесь, что сенсорная панель включена в настройках сенсорной панели. </p> <p> 1. Перейдите к <strong> Начинать </strong><img src=\"images/image_thumb2_thumb_thumb-670.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> меню -&gt; <strong> Настройки </strong> <img src=\"images/image_thumb-66-512.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Устройств. <br> </strong> 2. Выберите <strong> Сенсорная панель </strong> на левой панели и справа убедитесь, что переключатель сенсорной панели установлен в положение <strong> НА </strong> а также <strong> проверять </strong> в <strong> Оставьте тачпад включенным, когда подключена мышь </strong> вариант. * </p> <p><img src=\"images/image_thumb-38-467.png\" alt=\"Disable Touchpad Windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Примечание. Если вы не можете найти здесь тумблер / переключатель сенсорной панели… </p> <p> 1. Открыть <strong> Дополнительные настройки </strong> под <strong> Связанные настройки </strong> раздел. </p> <ul> <li> Статья по теме: <a href=\"https://www.repairwin.com/disable-touchpad-option-missing-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Отключить параметр сенсорной панели, отсутствующий в Windows 10. </strong></a></li> </ul> <p><img src=\"images/image_thumb-39-742.png\" alt=\"touchpad additional settings\" loading=\"lazy\"></p> <p> 2. Включите сенсорную панель в параметрах свойств мыши. (Если сенсорная панель уже включена, попробуйте отключить и снова включить ее.) </p> <p><img src=\"images/image_thumb-31-122.png\" alt=\"enable touchpad windows 10\" loading=\"lazy\"></p> <h3> Способ 2. Сбросьте настройки сенсорной панели в Windows 10. </h3> <p> Распространенным методом решения проблем с сенсорной панелью в Windows 10 является сброс настроек сенсорной панели до значений по умолчанию. </p> <p> 1. Перейдите к <strong> Начинать </strong><img src=\"images/image_thumb2_thumb_thumb-596.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> меню -&gt; <strong> Настройки </strong> <img src=\"images/image_thumb-66-851.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Устройств. <br> </strong> 2. На <strong> Сенсорная панель </strong> параметры <strong> , </strong> прокрутите вниз и щелкните <strong> Сброс настроек </strong> под <strong> Перезагрузите тачпад. * </strong></p> <p><img src=\"images/image_thumb-40-277.png\" alt=\"reset touchpad windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Примечание: если вы не видите <strong> Сброс настроек </strong> кнопка… </p> <p> 1. Откройте <strong> Дополнительные настройки </strong> . <br> 2. Щелкните <strong> Сбросить устройства </strong> в параметрах свойств мыши. </p> <p><img src=\"images/image_thumb-33-928.png\" alt=\"reset touchpad settings windows 10\" loading=\"lazy\"></p> <h3> Метод 3. Удалите и переустановите драйвер устройства сенсорной панели. </h3> <p> Еще одно решение для устранения проблем с сенсорной панелью в Windows 10 - полностью удалить и переустановить драйверы сенсорной панели. </p> <p> 1. Открыть <strong> Диспетчер устройств </strong> . Для этого: </p> <blockquote><p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-140.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. В поле «Открыть» введите: <strong> devmgmt.msc </strong> и щелкнуть <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-5-568.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Разверните «Мыши и другие указывающие устройства». <br> 3. <strong> Щелкните правой кнопкой мыши </strong> на <strong> Сенсорная панель </strong> устройство и щелкните <strong> Удалить. </strong></p> <blockquote> <p><img src=\"images/image_thumb-34-656.png\" alt=\"uninstall touchpad windows 10\" loading=\"lazy\"></p> </blockquote> <p> 4. После перезагрузки подождите 4-5 минут, пока Windows переустановит драйвер сенсорной панели, и проверьте, работает ли ваша сенсорная панель. Если ваш тачпад снова не работает, попробуйте установить его драйвер с сайта поддержки производителя вашего ноутбука. </p> <h3> Метод 4. Отключите и включите сенсорную панель в BIOS. * </h3> <p> * Примечание. Этот метод применим не ко всем моделям ноутбуков, но я знаю, что он работает на многих ноутбуках ASUS. </p> <p> 1. Полностью выключите портативный компьютер, нажав и удерживая клавишу SHIFT, одновременно щелкая <strong> Начинать </strong> &gt; <strong> Мощность </strong> &gt; <strong> Неисправность </strong><br> 2. Включите ноутбук и нажмите соответствующую функциональную клавишу, чтобы войти в настройки BIOS. (например, F2, F10 и т. д.), <br> 3. В настройках BIOS проверьте, есть ли настройка для сенсорной панели, внутреннего указывающего устройства или устройства трекпада (обычно этот параметр можно найти в &#39; <strong> Передовой </strong> &#39; раздел). Если так, <strong> Запрещать </strong> в <strong> сенсорная панель </strong> а также <strong> Сохранить и выйти </strong> из настроек BIOS. <br> 4. Дайте Windows 10 загрузиться. <br> 5. Выключите и снова включите ноутбук. <br> 6. Снова войдите в настройки BIOS и повторно <strong> включить тачпад </strong> &amp; <strong> Сохранить и выйти </strong> . <br> 7. После загрузки Windows 10 тачпад должен заработать. </p> <p><strong> Заключение: </strong> Если после описанных выше действий сенсорная панель по-прежнему не работает, это указывает на проблему с оборудованием. В этом случае используйте внешнюю мышь или обратитесь в мастерскую по ремонту ноутбуков, чтобы отремонтировать тачпад. </p> <p> Вот и все, ребята! Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}