{"title":"Как предотвратить автоматическую установку сетевых принтеров в Windows 10.","content":"<p> Как вы уже могли заметить, Windows 10 автоматически устанавливает драйверы для любого подключенного к сети принтера или другого устройства. Но, хотя это очень полезная функция, она также очень раздражает, особенно в бизнес-средах, где вы можете не захотеть, чтобы все принтеры использовались всеми пользователями сети. </p> <p> Конечно, если вам не нужно сетевое устройство и приложения его производителя, вы можете удалить его из своей системы. Но Windows 10 автоматически установит его снова. Чтобы избежать этого, вы должны запретить Windows автоматически устанавливать устройства, подключенные к сети (принтеры, сканеры, камеры и т. Д.), А также их приложения и значки таможни от производителя. </p> <h3> Как остановить Windows 10 для автоматической установки сетевых устройств и приложений. </h3> <p> 1. Перейдите к <strong> Панель управления </strong> . Для этого: </p> <blockquote><p> а. Введите &quot;панель управления&quot; в поле поиска Windows. <br> б. Нажмите <strong> Панель управления </strong> от результатов. </p></blockquote> <p><img src=\"images/image_thumb-53-862.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Установите <strong> Просмотр по </strong> к <strong> Маленькие значки </strong> чтобы просмотреть все элементы панели управления, а затем щелкните <strong> Центр коммуникаций и передачи данных. </strong></p> <p><img src=\"images/image_thumb-37-625.png\" alt=\"control panel network and sharing center\" loading=\"lazy\"></p> <p> </p> <p> 3. Выберите <strong> Расширенные настройки общего доступа </strong> налево <strong> . </strong></p> <p><img src=\"images/image_thumb-38-656.png\" alt=\"Prevent Windows 10 to Install Network Printers Automatically\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Снимите флажок &quot; <strong> Включить автоматическую настройку подключенных к сети устройств » </strong> и нажмите <strong> Сохранить изменения. </strong></p> <p><img src=\"images/image_thumb-39-992.png\" alt=\"Turn Off automatic setup of network connected devices \" loading=\"lazy\"></p> <p> </p> <p><strong> По желанию: </strong> Если вы хотите запретить Windows 10 автоматически загружать и устанавливать приложения производителя и пользовательские значки для любого подключенного устройства на вашем компьютере, выполните следующие действия: </p> <blockquote><p> 1. Перейдите к <strong> Панель управления </strong> -&gt; <strong> Система </strong> . <br> 2. Щелкните <strong> Системная защита </strong> налево. <br> 3. На вкладке «Оборудование» щелкните <strong> Параметры установки устройства </strong> . </p></blockquote> <p><img src=\"images/image_thumb-40-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. В разделе &quot;Параметры установки устройства&quot; выберите &quot; <strong> Нет (ваше устройство может работать не так, как ожидалось) &quot; </strong> и нажмите <strong> Сохранить изменения </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-728.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом руководстве. </p>"}