{"title":"Как найти проигрыватель Windows Media в Windows 10.","content":"<p> В течение многих лет Windows Media Player был приложением по умолчанию для воспроизведения музыки и видео. В Windows 10 проигрыватель Windows больше не является проигрывателем по умолчанию для мультимедийных файлов и заменен приложением «Фильмы и ТВ». </p> <p> Эта статья написана для всех пользователей, которые хотят найти и использовать классический проигрыватель Windows Media в качестве проигрывателя по умолчанию для воспроизведения своей музыки и видео. </p> <h4> Как найти проигрыватель Windows Media в Windows 10. </h4> <p> Самый быстрый способ узнать, установлен ли на вашем компьютере проигрыватель Windows Media, - это выполнить поиск. Для этого: </p> <p> 1. В поле поиска Кортаны введите <strong> Проигрыватель Windows Media </strong> . <br> 2. Если в результатах отображается проигрыватель Windows Media, щелкните его, чтобы запустить программу. (Если нет в списке, продолжайте ниже…) </p> <p><img src=\"images/image_thumb-66-377.png\" alt=\"How to Find Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> КОНЧИК: </strong> Чтобы установить проигрыватель Windows Media в качестве проигрывателя по умолчанию для ваших видео и музыки: </p> <blockquote><p> 1. Перейдите к <strong> Начинать </strong> -&gt; <strong> Настройки </strong> -&gt; <strong> Программы </strong> и выберите <strong> Приложения по умолчанию </strong> слева. <br> 2. На <strong> Музыкальный проигрыватель </strong> параметры, щелкните <strong> Музыка Groove </strong> а затем выберите <strong> Проигрыватель Windows Media </strong> . <br> 3. <strong> В параметрах видеоплеера </strong> нажмите <strong> Фильмы и ТВ </strong> а затем выберите <strong> Проигрыватель Windows Media </strong> . </p> <p><img src=\"images/image_thumb-72-358.png\" alt=\"set windows media player default widnows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h4> Как установить проигрыватель Windows Media в Windows 10 Home, Pro. </h4> <p> Если проигрывателя Windows Media нет в списке, вы можете установить его, перейдя по ссылке: </p> <p> 1. <strong> Панель управления </strong> -&gt; <strong> Программы и компоненты </strong> . <br> 2. Щелкните <strong> Включение и отключение функций Windows </strong> слева. </p> <p><img src=\"images/image_thumb-68-342.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. На <strong> Особенности СМИ </strong> , выберите <strong> Проигрыватель Windows Media </strong> и нажмите <strong> ОК </strong> . * </p> <p> * Примечание. Если у вас установлена ​​версия Windows 10 N или KN или вы не можете установить проигрыватель Windows Media из «функций Windows», продолжайте читать ниже ... </p> <p><img src=\"images/image_thumb-69-565.png\" alt=\"How to Install Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Как загрузить и установить проигрыватель Windows Media в версиях Windows 10 Home, Pro, N и KN. </h4> <p> Если вы не можете установить Windows Player с помощью приведенных выше инструкций или если у вас Windows 10 N или KN, вы можете загрузить Windows Media Player для Windows 10, следуя инструкциям ниже: </p> <p> 1. Загрузите <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48231\" target=\"_blank\" rel=\"nofollow noopener\"> Media Feature Pack для версий N и KN Windows 10 </a> . </p> <p> * Примечание. Загрузите <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package.msu </strong> для <strong> 32-битная ОС, </strong> и <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package_x64.msu </strong> для <strong> 64-битная ОС. </strong></p> <p> 2. Запустите загруженный файл и нажмите <strong> да </strong> на первом экране. </p> <p><img src=\"images/image_thumb-70-480.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Принимать </strong> Лицензионное соглашение и дождитесь завершения установки. </p> <p><img src=\"images/image_thumb-71-400.png\" alt=\"download windows media player windows 10\" loading=\"lazy\"></p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}