{"title":"Как перезапустить сервер HP из интерфейса iLO.","content":"<p> В этом руководстве мы найдем пошаговые инструкции по удаленному перезапуску сервера HP с помощью интерфейса HP iLO. HP Integrated Lights-Out (iLO) - это аппаратный компонент серверов HP, который обычно встроен в системную плату. Компонент iLO имеет собственное сетевое соединение, IP-адрес и веб-интерфейс и может помочь пользователю получить доступ к серверу и управлять им удаленно. </p> <h4> Как перезагрузить сервер HP с помощью веб-интерфейса iLO 5. </h4> <p> Чтобы перезапустить сервер, если он зависает, из интерфейса iLO: </p> <p> 1. На другом компьютере откройте веб-браузер и в адресной строке введите IP-адрес интерфейса iLO на сервере, который нужно перезагрузить. <br> 2. Введите имя пользователя и пароль iLO и нажмите <strong> Авторизоваться </strong> . </p> <p><img src=\"images/image_thumb-8-790.png\" alt=\"restart hp proliant server from ilo\" loading=\"lazy\"></p> <p> </p> <p> 3. Выберите <strong> Электроэнергия и тепло </strong> налево. <br> 4. В разделе «Виртуальная кнопка питания» нажмите кнопку <strong> Сброс настроек </strong> кнопку, чтобы перезапустить сервер HP. * </p> <p> * Информация: </p> <ul> <li> Виртуальный <strong> Сброс настроек </strong> кнопка имеет ту же функцию, что и <strong> Запустить снова </strong> команда в операционной системе (теплая загрузка). </li> <li> Виртуальный <strong> Холодный ботинок </strong> кнопка имеет то же действие, что и <strong> Неисправность </strong> команда в операционной системе. Если вы нажмете кнопку «Холодная загрузка», сервер выключится и перезапустится примерно через 8 секунд. </li> </ul> <p> <img src=\"images/image_thumb-9-784.png\" alt=\"How to Reboot an HP Server using iLO 5 web interface.\" loading=\"lazy\"></p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}