{"title":"Как управлять мышью с клавиатуры в Windows 10/8/7.","content":"<p> Это руководство содержит инструкции о том, как управлять мышью с помощью клавиатуры, используя функцию «Клавиши мыши» в Windows. Статья может быть полезна людям, которые не могут управлять мышью, или в случаях, когда мышь перестает работать (или не существует). и вы хотите использовать клавиатуру как мышь для работы с компьютером, чтобы закончить срочную работу. </p> <p> В <strong> Клавиши мыши </strong> Функция встроена в операционные системы Windows 10, 7 или 7 и позволяет использовать цифровую клавиатуру для перемещения указателя мыши на экране и выполнения всех обычных действий мыши (щелчок, двойной щелчок, щелчок правой кнопкой мыши). </p> <h4> Как использовать клавиатуру в качестве мыши. </h4> <h6> Метод 1. Включите клавиши мыши с помощью сочетания клавиш. * </h6> <p> Первый способ перемещения курсора мыши [без мыши <img src=\"images/wlemoticon-openmouthedsmile-273.png\" alt=\"Open-mouthed smile\" loading=\"lazy\"> ], это включить клавиши мыши следующим образом: </p> <p> 1. Нажмите <strong> левый ALT </strong> + <strong> Сдвиг влево </strong> + <strong> Num Lock </strong></p> <p><img src=\"images/image_thumb-10-220.png\" alt=\"How to Control Mouse with Keyboard \" loading=\"lazy\"></p> <p> </p> <p> 2. Когда на экране появится окно «Клавиши мыши», нажмите <strong> ВХОДИТЬ </strong> чтобы включить MouseKeys. </p> <p><img src=\"images/image_thumb-2-595.png\" alt=\"turn on mouse keys\" loading=\"lazy\"></p> <p> 3. После включения клавиш мыши вы можете использовать клавиатуру (цифровую клавиатуру) для выполнения всех действий мыши (перемещение, щелчок, щелчок правой кнопкой мыши, двойной щелчок), как показано на рисунке ниже. * </p> <p> * Примечание. Если вы хотите увеличить или уменьшить скорость указателя, прочтите инструкции следующего метода. </p> <p><strong> Функции мыши с цифровой клавиатуры </strong></p> <p><img src=\"images/image_thumb-8-332.png\" alt=\"mouse functions numeric keypas\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Метод 2. Включите клавиши мыши в Центре специальных возможностей. </h6> <p> Второй способ управления указателем мыши с помощью клавиатуры - это включить и настроить функцию «Клавиши мыши» в центре легкого доступа. Для этого: </p> <p> 1. Перейдите в Панель управления Windows, установите для параметра «Просмотр по» значение <strong> Маленькие значки </strong> а затем откройте <strong> Центр легкости доступа. </strong></p> <p><img src=\"images/image_thumb-3-309.png\" alt=\"use keyboard as mouse\" loading=\"lazy\"></p> <p> </p> <p> 2. Щелкните <strong> Упростите использование мыши. </strong></p> <p><img src=\"images/image_thumb-4-518.png\" alt=\"enable mouse keys - ease of access\" loading=\"lazy\"></p> <p> </p> <p> 3. Затем щелкните <strong> Настроить клавиши мыши </strong> . </p> <p><img src=\"images/image_thumb-9-206.png\" alt=\"Configure Pointer Speed \" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Теперь проверьте <strong> Включите клавиши мыши </strong> коробка и щелкните <strong> Применять. </strong><br> <strong> 5. </strong> Теперь попробуйте переместить курсор мыши с помощью цифровой клавиатуры и настроить <strong> Скорость указателя </strong> как хочешь. (Нажмите «Применить» при каждом изменении и «ОК», чтобы закрыть параметры «Клавиши мыши».) </p> <p><img src=\"images/image_thumb-7-340.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Это все! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}