{"title":"Как удалить защиту BitLocker с системного диска C: без ключа восстановления BitLocker или пароля.","content":"<p> Эта статья содержит пошаговые инструкции по удалению защиты BitLocker на системном диске C: для того, чтобы иметь возможность чистой установки Windows 10 на компьютере, защищенном с помощью BitLocker, если у вас нет ключа восстановления BitLocker или пароля BitLocker или если вы не можете разблокировать диск BitLocker по какой-либо причине. </p> <p><img src=\"images/image_thumb-51-648.png\" alt=\"Fix Refresh your PC error: Drive where windows is installed is locked\" loading=\"lazy\"></p> <p> </p> <p> Когда устройство с Windows 10 (ноутбук или ПК) защищено с помощью BitLocker, то единственный способ получить доступ к его содержимому или сбросить устройство (с помощью функций «Сбросить этот компьютер», «Обновить компьютер») или переустановить Windows - это разблокировать диск операционной системы C: с помощью ключа восстановления BitLocker или пароля BitLocker. </p> <p> Если у вас нет ключа восстановления BitLocker или пароля BitLocker для разблокировки системного диска C :, или ключ BitLocker не принят, то единственный вариант, который вы оставили (к сожалению), - это полностью стереть диск и выполнить чистая установка винды. </p> <p> В этом руководстве вы найдете инструкции о том, как решить следующую проблему при попытке установить Windows 10 или сбросить устройство с Windows 10 до заводского состояния по умолчанию: «Диск, на котором установлена ​​Windows, заблокирован. Разблокируйте диск и повторите попытку. &quot;. </p> <h4> Как выполнить чистую установку Windows 10 на компьютере, защищенном BitLocker (ИСПРАВЛЕНИЕ: не удается установить / обновить Windows 10 - диск заблокирован с помощью BitLocker). </h4> <p><strong> Требование: </strong> <strong> Установочный носитель Windows 10 (USB или DVD). </strong><br> Если у вас нет установочного носителя Windows, вы можете создать его, используя <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Инструмент Microsoft Media Creation </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Как создать установочный USB-носитель Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Как создать установочный DVD-диск с Windows 10. </a></li> </ul> <p> Чтобы выполнить чистую установку Windows 10 на компьютере / диске, защищенном BitLocker, следуйте приведенным ниже инструкциям: * </p> <p><strong> * ВНИМАНИЕ: НИЖЕ ПРОЦЕДУРА УДАЛЯЕТ ВСЕ СОХРАНЕННЫЕ ДАННЫЕ НА ЗАБЛОКИРОВАННОМ ДИСКЕ. ПРОДОЛЖАЙТЕ ТОЛЬКО ЕСЛИ ВЫ <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> НЕВОЗМОЖНО РАЗБЛОКИРОВАТЬ ДИСК / КОМПЬЮТЕР, ЗАЩИЩЕННЫЙ БИТЛОКЕРОМ. </a></strong></p> <p> 1. Загрузите систему с установочного носителя Windows 10. * </p> <p> * Примечание: <strong> </strong> Чтобы иметь возможность загрузиться с Windows Media (USB или DVD), выполните следующие действия: </p> <ul> <li><strong> Способ 1: </strong> После включения нажмите соответствующую функциональную клавишу (обычно это клавиша «F12» или «F8»), чтобы просмотреть параметры «Порядок загрузки» или «Меню загрузки». Затем выберите устройство USB (или DVD), которое содержит установочный носитель (файлы) Windows, и нажмите Enter. </li> <li><strong> Способ 2: </strong> Войдите в программу настройки BIOS (Настройки) и установите установочный носитель Windows как «Первое загрузочное устройство» в меню «Порядок загрузки». потом <strong> Сохранить и выйти </strong> из настроек BIOS. </li> </ul> <p> 2. На экране ниже нажмите кнопку <strong> СДВИГ </strong> + <strong> F10 </strong> ключи для запуска командной строки. (или нажмите <strong> Следующий </strong> &gt; <strong> Ремонт моего компьютера </strong> &gt; <strong> Устранение неполадок </strong> &gt; <strong> Командная строка </strong> ). * </p> <p> * Примечание. Если вам будет предложено ввести ключ восстановления, нажмите <strong> Пропустить этот диск </strong> . </p> <p><img src=\"images/image_thumb15_thumb-290.png\" alt=\"How to Remove Updates from the Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. В командной строке введите следующие команды по порядку: </p> <ul> <li><strong> diskpart </strong></li> <li><strong> список диска </strong></li> <li><strong> выберите диск 0 </strong></li> <li><strong> том списка </strong></li> </ul> <p> 4. Теперь найдите, какой из перечисленных томов имеет больший размер в ГБ. Обычно на большем томе установлена ​​Windows (заблокированный диск). * </p> <p> * например, На скриншоте ниже «Том 2» имеет больший размер. </p> <p> </p> <p><img src=\"images/image_thumb-10-992.png\" alt=\"fix drive is locked Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Затем выберите больший том, набрав эту команду: * </p> <ul> <li><strong> выберите номер тома </strong></li> </ul> <p> * Примечание. Измените номер тома с помощью приведенной выше команды в соответствии с вашим случаем (например, «выберите том 2»). </p> <p> 5. Наконец, удалите выбранный том, введя эту команду: </p> <p> </p> <ul> <li><strong> удалить переопределение тома </strong></li> </ul> <p><img src=\"images/image_thumb-14-714.png\" alt=\"delete volume override\" loading=\"lazy\"></p> <p> </p> <p> 6. Тип <strong> выход </strong> , чтобы закрыть инструмент DISKPART, а затем закрыть командную строку. <br> 7. Выключите, а затем снова включите устройство. <br> 8. Загрузитесь с установочного носителя Windows. <br> 9. Щелкните <strong> Следующий </strong> а потом <strong> Установите сейчас </strong> . <br> 10. Выберите «У меня нет ключа продукта» и примите лицензионное соглашение. <br> 11. Выберите «Выборочная установка» и затем удалите все остальные разделы / тома на диске. </p> <p><img src=\"images/image_thumb-12-362.png\" alt=\"cannot reset windows 10 drive locked with bitlocker\" loading=\"lazy\"></p> <p> </p> <p> 12. Когда закончите, выберите «Нераспределенное пространство» и нажмите <strong> Следующий. <br> </strong> 13. Следуйте инструкциям на экране, чтобы <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> чистая установка Windows 10 </a> . </p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этой проблеме. </p>"}