{"title":"Как защитить паролем папку в Windows 10 (заблокировать папку паролем).","content":"<p> Это руководство содержит два различных бесплатных и безопасных метода защиты паролем папки в ОС Windows 10/8/7. Если вы заблокируете папку паролем, она не будет доступна никому, кроме вас. Защита папки паролем полезна в тех случаях, когда вы делитесь своим компьютером с другими и не хотите, чтобы кто-то другой имел доступ к вашим личным файлам и читал их. </p> <ul> <li><strong> Связанная статья: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Как защитить паролем компьютер с Windows 10 с помощью BitLocker </a> . </strong></li> </ul> <h4> Как заблокировать папку паролем в Windows 10. </h4> <h6> Метод 1. Как заблокировать и зашифровать файлы с помощью 7-zip (все версии Windows). </h6> <p> Самый простой и безопасный способ защитить папку паролем в Windows - это использовать утилиту архиватора 7-Zip, которая также поддерживает шифрование. Чтобы зашифровать и защитить паролем папку / файл с помощью 7-zip: </p> <p> 1. Загрузите и установите <a href=\"https://www.7-zip.org/\" target=\"_blank\" rel=\"nofollow noopener\"> 7-молния </a> программа-архиватор. <br> 2. Щелкните правой кнопкой мыши папку (или файл), которую вы хотите защитить паролем, и выберите: <strong> 7-молния </strong> &gt; <strong> Добавить в архив </strong> . </p> <p><img src=\"images/image_thumb-28-978.png\" alt=\"How to Password Protect a Folder\" loading=\"lazy\"></p> <p> </p> <p> 3. В параметрах «Добавить в архив» укажите надежный пароль и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-29-728.png\" alt=\"set password to archive with 7-zip\" loading=\"lazy\"></p> <p> </p> <p> 4. Затем удалите несжатую папку (или файл) и все готово! </p> <h6> Метод 2. Как зашифровать папку с помощью защиты EFS (Windows Pro и Enterprise). </h6> <p> EFS Protection - это встроенный инструмент шифрования в редакциях Windows 10 Professional и Enterprise. Если вы защищаете папку или файл с помощью шифрования EFS, другим будет очень сложно получить доступ к зашифрованным файлам без ключа дешифрования (ключа PFX сертификата). </p> <p> Единственным недостатком шифрования EFS является то, что шифрование будет удалено, если вы скопируете зашифрованные файлы на другой сетевой компьютер или если вы отправите зашифрованные файлы по электронной почте. </p> <p> Кроме того, когда вы шифруете файлы EFS, ключ дешифрования (сертификат) сохраняется локально на вашем компьютере. Это означает, что любой, у кого есть ваш пароль, также будет иметь доступ к вашим зашифрованным файлам. По этой причине, если вы шифруете свои файлы с помощью шифрования EFS, укажите надежный пароль для входа и не делитесь им с другими. </p> <ul> <li><strong> Связанная статья: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> Как расшифровать файлы, зашифрованные EFS, и удалить шифрование EFS. </a></strong></li> </ul> <p><strong> Чтобы зашифровать папку или файл с помощью EFS: </strong><br> 1. Щелкните правой кнопкой мыши папку (или файл), который вы хотите защитить, и выберите <strong> Характеристики </strong> . <br> 2. На вкладке «Общие» щелкните <strong> Передовой </strong> . </p> <p><img src=\"images/image_thumb-13-582.png\" alt=\"enable efs protection\" loading=\"lazy\"></p> <p> </p> <p> 3. Выберите <strong> Шифрование файлов для защиты данных </strong> а затем щелкните <strong> ОК. </strong></p> <p><img src=\"images/image_thumb-14-983.png\" alt=\"How to Lock Folder with Password - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Затем щелкните <strong> Применять </strong> а также <strong> ОК </strong> еще раз, чтобы сохранить изменения и выйти. <br> 5. На этом этапе Windows предложит вам создать резервную копию ключа восстановления. Нажмите <strong> Сделайте резервную копию ключа шифрования файла. </strong></p> <p><img src=\"images/image_thumb-2-823.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Затем щелкните <strong> Создать резервную копию сейчас (рекомендуется) </strong> и сохраните ключ сертификата дешифрования на USB-накопитель. </p> <p><img src=\"images/image_thumb-15-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. В мастере экспорта сертификатов щелкните <strong> Следующий </strong> на экране приветствия. <br> 8. Затем щелкните <strong> Следующий </strong> снова на экране «Формат файла экспорта». </p> <p><img src=\"images/image_thumb-4-842.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. В разделе «Параметры безопасности»: </p> <blockquote> <p> 1. <strong> Проверять </strong> в <strong> Пароль </strong> коробка. <br> 2. Введите пароль для экспортированного ключа сертификата. <br> 3. Выберите <strong> AES256-SHA256 </strong> шифрование <br> 4. Щелкните <strong> Следующий </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-16-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. Щелкните <strong> Просматривать </strong> а также <strong> Сохранить </strong> файл сертификата (.pfx) на вашем компьютере. <br> 11. Когда закончите, нажмите <strong> Следующий </strong> продолжать. </p> <p><img src=\"images/image_thumb-17-804.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. Наконец нажмите <strong> Заканчивать </strong> . </p> <p><img src=\"images/image_thumb-18-449.png\" alt=\"image\" loading=\"lazy\"></p> <p> 13. По завершении экспорта сохраните экспортированный ключ сертификата (файл .pfx) в другое безопасное место (например, на USB-диск). </p> <p><strong> КОНЧИК: </strong> Когда вы шифруете папку (или файлы) с помощью EFS, ключ дешифрования (сертификат) сохраняется в папке вашего профиля пользователя. Таким образом, если у другого пользователя есть ваш пароль для входа в Windows, он может открывать и читать зашифрованные файлы. Чтобы этого не произошло, не сообщайте свой пароль для входа или удаляйте (деинсталлируйте) сертификат дешифрования из своего профиля, когда вы покидаете свой компьютер, и переустанавливайте его, когда вернетесь. * </p> <p> * Примечание. Чтобы удалить и повторно импортировать ключ восстановления (сертификат), перейдите по ссылке: </p> <blockquote> <p> а. <strong> Панель управления </strong> &gt; <strong> Настройки интернета. <br> </strong> б. В &quot;Свойства обозревателя&quot; щелкните значок <strong> Содержание </strong> вкладка, а затем щелкните <strong> Сертификат </strong> с. <br> c. На вкладке &quot;Личные&quot; нажмите кнопку <strong> Удалять </strong> кнопку, чтобы удалить ключ дешифрования (сертификат), или нажмите кнопку <strong> Импортировать </strong> кнопку, чтобы переустановить сертификат дешифрования с USB-накопителя. </p> </blockquote> <ul> <li> <p><strong> Связанная статья: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"noopener noreferrer\"> Как расшифровать файлы, зашифрованные EFS, и удалить шифрование EFS. </a></strong></p> </li> </ul> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}