{"title":"Как автоматически войти в Windows 10/8/7 (без ввода пароля).","content":"<p> Это руководство содержит инструкции по автоматическому входу в Windows 10. Фактически вы узнаете, как автоматически входить в свою учетную запись пользователя (учетную запись Microsoft, локальную или доменную) без необходимости вводить свои учетные данные при входе в систему или на экране блокировки. . Инструкция применима к ОС Windows 10/8/7. </p> <p> При выполнении новой установки Windows 10 вам будет предложено указать учетную запись пользователя и пароль для использования компьютера. На этом этапе вы можете использовать свою учетную запись Microsoft (с паролем учетной записи MS) или создать новую локальную учетную запись и новый пароль для входа в Windows. В обоих случаях (если вы не создаете локальную учетную запись с пустым паролем) вам будет предлагаться вводить пароль каждый раз при запуске Windows. </p> <p> Защита вашего собственного компьютера паролем является хорошей мерой безопасности, особенно если вы используете компьютер совместно с другими, или когда вы путешествуете со своим ноутбуком, или когда ваш компьютер принадлежит бизнес-среде. Но если вы единственный пользователь на своем автономном настольном компьютере или если вы используете свой ноутбук только дома, нет необходимости вводить свои учетные данные каждый раз, когда вы хотите его использовать. * </p> <p><strong> Предупреждение: </strong> НЕ ВКЛЮЧАЙТЕ АВТОМАТИЧЕСКИЙ ВХОД в Windows, если вы используете свой компьютер совместно с другими, или если вы путешествуете со своим ноутбуком или планшетом, потому что каждый, кто найдет ваш компьютер, получит легкий доступ к вашим файлам. </p> <h4> Как автоматически войти в свою учетную запись в Windows 10/8/7 / Vista. (Включить автоматический вход) </h4> <h6> Метод 1. Включите автоматический вход с помощью утилиты AUTOLOGON. </h6> <p> Microsoft разработала инструмент для автоматизации процесса входа в систему в Windows. Инструмент называется «Autologon» и позволяет легко настроить Windows на автоматический вход без необходимости вводить учетные данные при каждом запуске. Преимущество этого инструмента в том, что пароль хранится в реестре в зашифрованном виде. </p> <p> 1. Скачать <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/autologon\" target=\"_blank\" rel=\"nofollow noopener\"> Автологон </a> полезность. <br> 2. Извлеките загруженный файл. <br> 3. Запустите autologon.exe. <br> 4. Введите свой пароль и нажмите <strong> Давать возможность </strong> . </p> <p><img src=\"images/image_thumb-44-251.png\" alt=\"windows auto login\" loading=\"lazy\"></p> <p> * Примечание. Если вы хотите отключить автоматический вход в систему, снова запустите утилиту и нажмите <strong> Запрещать </strong> . </p> <p> </p> <h6> Метод 2. Включите автоматический вход из панели управления учетными записями пользователей. </h6> <p> Второй способ включить автоматический вход в Windows 10/8/7 - отключить параметр «Пользователи должны вводить имя пользователя и пароль для использования этого компьютера» в панели управления учетными записями пользователей. Для этого: </p> <p> Примечание. Если вы используете локальную учетную запись, есть еще один более простой способ принудительно выполнить автоматический вход в Windows: просто укажите новый пустой (пустой) пароль в меню «Настройки»&gt; «Учетные записи»&gt; «Параметры входа»&gt; «Изменить пароль». Затем введите свой пароль один раз, а затем дважды нажмите «Далее» и «Готово». </p> <p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-738.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. В поле «Открыть» введите: <strong> контролировать userpasswords2 </strong> и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-29-873.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. В параметрах учетных записей пользователей (вкладка &quot;Пользователи&quot;), <strong> снимите отметку </strong> в <strong> Чтобы использовать этот компьютер, пользователи должны ввести имя пользователя и пароль. </strong> а затем щелкните <strong> Применять. * </strong></p> <p> * Примечание: если вы хотите отключить автоматический вход в систему в будущем, просто установите этот флажок. </p> <p><img src=\"images/image_thumb-32-315.png\" alt=\"auto login windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Введите (дважды) пароль своей учетной записи и нажмите <strong> ОК </strong> дважды, чтобы закрыть свойства учетной записи пользователя. </p> <p><img src=\"images/image_thumb-31-509.png\" alt=\"Auto Login to Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Метод 3. Включите автоматический вход в реестр (Windows 10/8/7 / Vista). </h6> <p> Последний способ отключить пароль для входа в систему в ОС Windows 10, 8 или 7 - включить автоматический вход в реестр. Для этого: </p> <p> 1. Нажмите Windows <img src=\"images/image_thumb8_thumb_thumb-512.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 2. В поле «Открыть» введите: <strong> regedit </strong> и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb7-114.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Перейдите к этой клавише на левой панели: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ \\ Microsoft \\ Windows NT \\ CurrentVersion \\ Winlogon </li> </ul> <p> 4. На правой панели: </p> <blockquote><p> а. Щелкните правой кнопкой мыши пустое место и выберите <strong> Новый </strong> &gt; <strong> Строковое значение. </strong></p> <p><img src=\"images/image_thumb-38-930.png\" alt=\"image\" loading=\"lazy\"></p> <p> б. Переименуйте новое значение в <strong> DefaultUserName </strong> и нажмите <strong> Входить </strong> . <br> c. Откройте значение REG_SZ DefaultUserName. <br> d. Введите имя своей локальной учетной записи пользователя или своей учетной записи Microsoft и нажмите <strong> ОК </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-42-933.png\" alt=\"enable auto login registry\" loading=\"lazy\"></p> <p> </p> <p> 5а. Выполните те же действия и создайте новое значение REG_SZ (String) и назовите его <strong> DefaultPassword </strong> . <br> 5б. Дважды щелкните &quot;DefaultPassword&quot;. <strong> &#39; </strong> Значение REG_SZ, введите свой пароль в поле Значение и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-43-192.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7а. Наконец, создайте новое значение REG_SZ и назовите его <b> AutoAdminLogon </b> . <br> 7b. Дважды щелкните значение AutoAdminLogon, введите <strong> 1 </strong> в поле Значение и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-41-705.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Закройте редактор реестра и перезагрузите компьютер. * </p> <p> * Заметки: <br> 1. Если ваш компьютер является частью домена, вам необходимо создать еще одно значение REG_SZ с именем <strong> DefaultDomainName </strong> а затем введите в поле значения данных имя вашего домена. <br> 2. Чтобы отключить автоматический вход в систему в будущем, просто удалите вновь созданные строковые значения, упомянутые выше. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}