{"title":"Как просматривать заголовки сообщений, не открывая сообщение электронной почты в Outlook 2016/2019.","content":"<p> Как вы, возможно, знаете, «Заголовки сообщений» (также известные как «Источник сообщения» или «Заголовки Интернета» в Outlook) содержат все технические сведения о полученном сообщении электронной почты. В частности, «Заголовки сообщения» сообщения электронной почты содержат, помимо обычной информации (отправитель, время отправки и т. Д.), Программное обеспечение, используемое для составления сообщения, и серверы, которые прошли до того, как оно было доставлено вам. . </p> <p> Чтобы просмотреть источник сообщения / заголовки в настольном приложении Microsoft Outlook, вы можете использовать один из следующих способов: </p> <ol> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Как просмотреть заголовки сообщений в Outlook 2016/2019 после открытия сообщения электронной почты </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Как просмотреть заголовки сообщений в Outlook 2016/2019, не открывая сообщение электронной почты. </a></li> </ol> <p> </p> <h2> Как просмотреть заголовки сообщений в Outlook 2016/2019 после открытия электронной почты. </h2> <p> Обычный способ отобразить источник сообщения электронной почты в Microsoft Outlook 2016/2019 - открыть письмо и просмотреть его свойства: </p> <p> 1. Откройте сообщение электронной почты (в отдельном окне) и щелкните значок <strong> Файл </strong> меню. </p> <p><img src=\"images/image_thumb-36-771.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. От <strong> Файл </strong> меню, щелкните <strong> Характеристики </strong> . </p> <p><img src=\"images/image_thumb-37-974.png\" alt=\"View message headers outlook\" loading=\"lazy\"></p> <p> </p> <p> 3. Посмотрите на <strong> Интернет-заголовки, </strong> для просмотра источника сообщения электронной почты (подробности). </p> <p> * Примечание. Выделите и скопируйте текст заголовков Интернета в Блокноте для облегчения чтения. </p> <p><img src=\"images/image_thumb-38-976.png\" alt=\"View Internet headers in Outlook\" loading=\"lazy\"></p> <p> </p> <h2> Как просмотреть заголовки сообщений в Outlook 2016/2019, не открывая сообщение электронной почты. </h2> <p> Проблема просмотра источника сообщения (заголовков Интернета) после открытия сообщения электронной почты заключается в том, что если сообщение содержит вредоносное ПО, вы можете подвергнуть свой компьютер опасности. Чтобы избежать этого, продолжайте и следуйте приведенным ниже инструкциям, чтобы иметь возможность читать источник сообщения, не открывая электронное письмо. </p> <p> 1. В главном окне Outlook выберите <strong> Файл </strong> -&gt; <strong> Параметры </strong> . <br> 2. Выберите <strong> Настроить ленту </strong> слева и справа: </p> <p> а. В <strong> Выберите команды из </strong> раскрывающийся список, выберите <strong> Команды не на ленте. <br> </strong> б. Убедитесь, что на основных вкладках <strong> Дом (почта) </strong> выбрано и щелкните <strong> Новая группа </strong> а затем щелкните <strong> Переименовать. </strong></p> <p><img src=\"images/image_thumb-39-295.png\" alt=\"How to view the Message Headers in Outlook 2016-2019 \" loading=\"lazy\"></p> <p> c. <strong> Переименовать </strong> &quot; <strong> Новая группа </strong> &quot; к &quot; <strong> Интернет-заголовки </strong> &quot;и щелкните <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-40-856.png\" alt=\"image\" loading=\"lazy\"></p> <p> d. Теперь выберите <strong> Параметры сообщения </strong> из списка команд и щелкните <strong> Добавлять </strong> . </p> <p><img src=\"images/image_thumb-41-344.png\" alt=\"image\" loading=\"lazy\"></p> <p> е. Теперь вы должны увидеть «Параметры сообщения» под созданной вами новой группой («Заголовки Интернета»). Нажмите <strong> ОК </strong> применить изменения <strong> . </strong></p> <p><img src=\"images/image_thumb-42-209.png\" alt=\"view message source without opening email outlook\" loading=\"lazy\"></p> <p> 3. Теперь на вашем <strong> Дом </strong> На вкладке вы должны увидеть новую кнопку с названием «Параметры сообщения - Заголовки Интернета». <br> 5. С этого момента просто выделите сообщение, источник сообщения которого вы хотите просмотреть, и нажмите кнопку «Параметры сообщения», чтобы просмотреть источник сообщения, не открывая сообщение в отдельном окне. </p> <p><img src=\"images/image_thumb-43-460.png\" alt=\"view headers without opening email outlook\" loading=\"lazy\"></p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}