{"title":"Как создавать теневые копии файлов с помощью планировщика задач в Windows 10.","content":"<p> В предыдущем уроке я упомянул способ резервного копирования ваших личных файлов с помощью <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> История файлов </a> в Windows 10. В этом руководстве я покажу, как автоматически создавать теневые копии ваших личных файлов с помощью планировщика заданий. Теневые копии ваших файлов позволят вам вернуть конкретный файл или папку к более ранней версии (на определенный момент времени). </p> <p> Функция теневого копирования впервые появилась в Windows Server 2003, а затем была добавлена ​​в версии Windows Vista и 7 как часть функции восстановления системы. В процессе «теневого копирования» можно создавать резервные копии и снимки текущего состояния системы и личных файлов, даже если они используются. Процесс восстановления файлов из теневых копий более известен как «Восстановление предыдущих версий». </p> <h4> Как ежедневно создавать теневую копию ваших файлов в Windows 10. * </h4> <p><strong> * Заметки: </strong><br> 1. Используя приведенные ниже инструкции, вы сможете создавать ежедневные теневые копии (снимки) всего тома «C: \\». (Системные файлы Windows и личные данные) <br> 2. Теневые копии можно использовать для восстановления файлов на более ранний момент времени с помощью функции «Восстановить предыдущую версию» или с помощью сторонней утилиты, которая может получить доступ к теневым копиям, например <a href=\"https://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowExplorer </a> или <a href=\"https://www.nirsoft.net/utils/shadow_copy_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowCopyView </a> . <br> 3. Теневые копии <strong> нельзя использовать для восстановления вашей системы </strong> на более ранний момент времени, используя <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> Восстановление системы </a> инструмент. Если вы хотите восстановить свою систему с помощью функции восстановления системы, продолжайте и <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Включите защиту от восстановления системы. </a> <br> 4. Наконец, имейте в виду, что созданные теневые копии не являются надежной резервной копией, потому что «теневые копии» хранятся на вашем основном диске C: \\, и если диск выйдет из строя, вы потеряете все свои данные. Чтобы создать надежную резервную копию ваших данных, прочтите инструкции в этой статье: <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Как сделать резервную копию личных файлов с историей файлов в Windows 10. </a></p> <p> </p> <p><strong> Чтобы создать предыдущие версии ваших личных файлов с помощью теневых копий: </strong></p> <p> 1. Открыть <strong> Диспетчер задач </strong> . Если вы не знаете, как это сделать, тогда ... </p> <blockquote><p> 1. В поле поиска введите <strong> Задача </strong> или же <strong> Диспетчер задач </strong> . <br> 2. Откройте «Планировщик заданий» из результатов поиска. </p></blockquote> <p><img src=\"images/image_thumb-31-630.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. В планировщике заданий щелкните <strong> Создать задачу </strong> . </p> <p><img src=\"images/image_thumb-23-462.png\" alt=\"How to Start ThrottleStop at Windows Startup\" loading=\"lazy\"></p> <p> </p> <p> 3. На <strong> Общий </strong> вкладка: </p> <blockquote><p> 1. Введите «Создать теневую копию моих файлов» в качестве имени задачи. <br> 2. <strong> Проверять </strong> в <strong> Беги с высшими привилегиями </strong> коробка. </p></blockquote> <p> Примечание. Если вы хотите запустить задачу в фоновом режиме, поставьте точку в <strong> Запускать независимо от того, вошел ли пользователь в систему или нет </strong> вариант, а затем введите свой пароль для входа. </p> <p><img src=\"images/image_thumb-62-499.png\" alt=\"create shadow copies task windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Затем выберите <strong> Триггеры </strong> вкладку и щелкните <strong> Новый </strong> . <br> 4а. В окне «Новый триггер» укажите, как часто нужно создавать снимки ваших файлов, и нажмите <strong> ОК </strong> . </p> <p><img src=\"images/image_thumb-63-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Затем выберите <strong> Действия </strong> вкладку и щелкните <strong> Новый </strong> . <br> 5а. В окне «Новое действие»: </p> <blockquote><p> 1. Выберите <strong> Запустить программу </strong> . <br> 2. В «Программа / сценарий» введите: <strong> wmic </strong><br> 3. В поле «Добавить аргументы (необязательно)» введите: </p> <ul> <li><strong> вызов shadowcopy create Volume = C: \\ </strong></li> </ul> <p> 4. Когда закончите, нажмите <strong> ОК. </strong></p></blockquote> <p><img src=\"images/image_thumb-66-640.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Щелкните <strong> ОК </strong> еще раз, чтобы закрыть свойства запланированной задачи. </p> <p><img src=\"images/image_thumb-67-138.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Чтобы создать первую резервную копию, щелкните задачу правой кнопкой мыши и выберите <strong> Запустить </strong> . </p> <p><img src=\"images/image_thumb-68-388.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Готово! С этого момента, когда вы хотите восстановить файл / папку до его предыдущей версии, щелкните его правой кнопкой мыши и выберите <strong> Восстановить предыдущие версии </strong> . </p> <p><img src=\"images/image_thumb-69-568.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Полезная информация: <br> </strong> 1. Максимально выделенное пространство, которое можно использовать для хранения теневых копий, - это объем пространства, которое средство восстановления системы может использовать для хранения точек восстановления. <br> 2. Чтобы узнать используемое и максимальное выделенное пространство для хранения теневых копий, введите эту команду в командной строке (администратор): </p> <ul> <li><strong> vssadmin список shadowstorage </strong></li> </ul> <p><img src=\"images/image_thumb-76-672.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Чтобы изменить максимальное выделенное пространство для теневых копий и точек восстановления системы, перейдите к <strong> Системная защита </strong> настройки для <strong> Локальный диск (C :) </strong><br> 4. Если вы хотите удалить все сохраненные теневые копии, вы должны стереть также сохраненные точки восстановления. Если вы хотите это сделать, нажмите кнопку <strong> Удалить все точки восстановления </strong> в настройках защиты системы. </p> <p><img src=\"images/image_thumb-77-662.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Это все! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}