{"title":"Как делиться файлами и папками в ОС Windows 10, 8.1 или 7.","content":"<p> Функция общего доступа к файлам в Windows дает вам возможность легко обмениваться папками и файлами между пользователями в вашей сети. Предоставляя доступ к своим файлам другим пользователям в той же сети, вы сможете просматривать одни и те же файлы / папки и работать с ними. </p> <p> Это руководство содержит инструкции по предоставлению общего доступа к папкам и / или файлам в операционных системах Windows 10, 8, 8.1 или 7. </p> <h4> Как включить общий доступ к файлам в Windows. </h4> <h5> Шаг 1. Добавьте на свой компьютер необходимых пользователей. </h5> <p> Прежде чем вы продолжите делиться своими файлами с другими, добавьте пользователей, которые будут иметь доступ к общей папке на компьютере. Чтобы выполнить эту задачу, следуйте инструкциям в следующих статьях в зависимости от вашей версии Windows. </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-create-a-new-user-in-windows-7\" target=\"_blank\" rel=\"nofollow noopener\"> Как добавить нового пользователя в Windows 7. </a></li> <li><a href=\"https://www.repairwin.com/how-to-add-a-new-user-account-in-windows-10-8/\" target=\"_blank\" rel=\"nofollow noopener\"> Как добавить нового пользователя в Windows 10 / 8.1 </a></li> </ul> <p> </p> <h5> Шаг 2. Как поделиться папкой или файлом с другими. </h5> <p> 1. Щелкните правой кнопкой мыши папку (или файл), к которому вы хотите предоставить общий доступ, и выберите <strong> Дайте доступ к </strong> -&gt; <strong> Специфичные люди. </strong></p> <p><img src=\"images/image_thumb-56-411.png\" alt=\"How to Share Files and Folders in Windows 10, 8.1, 7\" loading=\"lazy\"></p> <p> </p> <p> 2. Используя раскрывающееся меню, выберите пользователя, с которым вы хотите поделиться своими файлами, а затем нажмите <strong> Добавлять </strong> . </p> <p><img src=\"images/image_thumb-57-274.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Теперь щелкните стрелку вниз рядом с добавленным пользователем и укажите его права доступа (уровень разрешений). </p> <p><img src=\"images/image_thumb-58-517.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. По завершении нажмите кнопку <strong> доля </strong> кнопка, </p> <p><img src=\"images/image_thumb-59-431.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Обратите внимание на данную ссылку на общую папку * и нажмите <strong> Сделанный </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-60-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. На этом этапе вы включили общий доступ к файлам на вашем компьютере. Чтобы получить доступ к общей папке с другого ПК: </p> <blockquote><p> а. В адресной строке проводника введите ссылку на общую папку, как показано на предыдущем шаге. (например, &quot;\\\\ DESKTOP-HMG31RD \\ 2Share&quot; без кавычек) <br> б. Нажмите <strong> Входить </strong> . <br> c. Введите имя пользователя и пароль пользователя, которому вы предоставили доступ, и нажмите <strong> ОК </strong> . </p></blockquote> <p><img src=\"images/image_thumb-61-512.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Дополнительная информация: <br> 1. Чтобы изменить разрешения пользователя, просто выполните описанную выше процедуру еще раз и измените уровень разрешений пользователя. <br> 2. Если вы хотите прекратить совместное использование файлов, щелкните правой кнопкой мыши общую папку / файл и перейдите в <strong> Дайте доступ к </strong> -&gt; и выберите <strong> Удалить доступ </strong> . </p> <p><img src=\"images/image_thumb-62-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этой проблеме. </p>"}