{"title":"Как расшифровать файлы, зашифрованные EFS, и удалить шифрование EFS в Windows 10.","content":"<p> В предыдущем уроке я описал способ <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> зашифруйте свои файлы с помощью шифрования EFS </a> . В этом руководстве вы узнаете, как удалить шифрование EFS и как расшифровать файлы, зашифрованные EFS, после их переноса на другой компьютер. </p> <h4> Как расшифровать зашифрованные файлы EFS и отключить шифрование EFS. </h4> <ul> <li> <p><a href=\"#part-1\"> Часть 1. Как отключить и удалить шифрование EFS на одном ПК. </a></p> </li> <li> <p><a href=\"#part-2\"> Часть 2. Как расшифровать файлы EFS на другом ПК. </a></p> </li> </ul> <h6> Часть 1. Как отключить и удалить шифрование EFS. </h6> <p> Когда вы шифруете файлы с помощью EFS, ключ дешифрования (сертификат) сохраняется локально на вашем компьютере, и файлы уже расшифрованы. Если вы хотите отключить шифрование EFS, чтобы остановить шифрование файлов / папок: </p> <p> 1. Щелкните правой кнопкой мыши зашифрованную папку / файл и измените <strong> Владение файлом </strong> к <strong> Личное </strong> . </p> <p><img src=\"images/image_thumb-26-500.png\" alt=\"how to disable efs encryption\" loading=\"lazy\"></p> <p> 2. Когда закончите, вы должны увидеть, что папка / файл разблокирован. Просто выполните те же действия, чтобы удалить шифрование со всех остальных зашифрованных папок и файлов. </p> <p> 3. Теперь, если вы не используете шифрование EFS для любого другого файла / папки и хотите полностью удалить ключ восстановления EFS (он же «ключ дешифрования - сертификат») с вашего ПК: </p> <blockquote> <p> 1. Откройте Internet Explorer и из <strong> Инструменты </strong> выбор меню <strong> настройки интернета </strong> . (или открыть <strong> настройки интернета </strong> из <strong> Панель управления </strong> .) </p> <p> 2. На <strong> Содержание </strong> щелчок по вкладке <strong> Сертификаты </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-27-186.png\" alt=\"how to remove efs certificate-recovery key\" loading=\"lazy\"></p> <blockquote> <p> 3. На вкладке «Личные» выберите сертификат дешифрования и нажмите <strong> Удалять </strong> . * </p> <p><strong> * Внимание: </strong> Перед удалением сертификата (ключа дешифрования) убедитесь, что вы сняли (остановили) шифрование для всех зашифрованных файлов. </p> </blockquote> <p><img src=\"images/image_thumb-25-639.png\" alt=\"how to remove efs recovery key\" loading=\"lazy\"></p> <blockquote> <p> 4. <strong> Запустить снова </strong> твой компьютер. </p> </blockquote> <h6></h6> <h6> Часть 2: Как расшифровать зашифрованные файлы EFS на другом компьютере. </h6> <p> Если вы перенесли зашифрованные файлы EFS на другой компьютер, то единственный способ просмотреть (открыть) файлы EFS - это владеть ключом дешифрования. Ключ дешифрования - это файл сертификата .pfx, который вы экспортировали при шифровании файлов. Если у вас нет ключа дешифрования EFS, невозможно расшифровать файлы EFS. </p> <p><strong> Чтобы расшифровать зашифрованные файлы EFS с помощью ключа дешифрования - сертификат: </strong></p> <p> 1. Дважды щелкните ключ дешифрования (файл сертификата .pfx), чтобы установить его. <br> 2. На экране приветствия мастера импорта сертификатов щелкните <strong> Следующий </strong> . <br> 3. Затем щелкните <strong> Следующий </strong> очередной раз. </p> <p><img src=\"images/image_thumb38_thumb-158.png\" alt=\"How to Decrypt EFS Encrypted files\" loading=\"lazy\"></p> <p> 4. Введите пароль, который вы использовали при экспорте ключа сертификата, и нажмите <strong> Следующий </strong> . </p> <p><img src=\"images/image_thumb39_thumb-680.png\" alt=\"install efs .pfx certificate\" loading=\"lazy\"></p> <p> 5. Оставьте настройки по умолчанию в разделе Параметры хранилища сертификатов и нажмите <strong> Следующий </strong> . </p> <p><img src=\"images/image_thumb40_thumb-629.png\" alt=\"image_thumb[40]\" loading=\"lazy\"></p> <p> 6. Наконец нажмите <strong> Заканчивать </strong> . </p> <p><img src=\"images/image_thumb41_thumb-225.png\" alt=\"image_thumb[41]\" loading=\"lazy\"></p> <p> </p> <p> 7. Теперь вы можете открывать зашифрованные файлы. * </p> <p> * Примечание. После расшифровки файлов следуйте инструкциям на <a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> часть-1 </a> выше, чтобы полностью удалить шифрование, если хотите. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}