{"title":"Как БЕСПЛАТНО восстановить файл Outlook Express DBX.","content":"<p> Outlook Express - это программа-клиент электронной почты, которая впервые появилась в Windows XP. Но даже сегодня (2018 год) некоторые клиенты все еще используют его в качестве основной программы электронной почты. Одна из основных проблем Outlook Express - проблема с ограничением 2 ГБ. </p> <p> Описание проблемы ограничения размера 2 ГБ в Outlook Express. <br> Когда одна из основных папок Outlook Express (например, «Входящие» или «Отправленные») превышает размер 2 ГБ, соответствующий файл хранилища OE DBX может быть поврежден, и папка OE может казаться пустой. В результате проблемы Outlook Express не может отправлять или получать электронные письма и отображает ошибку. <a href=\"https://www.repairwin.com/fix-outlook-express-error-0x800c0133-due-to-2gb-size-limit/\" target=\"_blank\" rel=\"nofollow noopener\"> 0x800c0133 </a> во время операции отправки / получения. </p> <p> В этом уроке я покажу вам, как восстановить поврежденный файл DBX из Outlook Express и вернуть свои электронные письма! </p> <h4> Как исправить поврежденный файл DBX Outlook Express. </h4> <p> Если одна из папок Outlook Express («Входящие», «Отправить» и т. Д.) Повреждена, следуйте приведенным ниже инструкциям, чтобы восстановить папку хранилища DBX и вернуть свои электронные письма. </p> <h6> Шаг 1. Включите просмотр скрытых файлов. </h6> <p> 1. Откройте проводник Windows. <br> 2. Из <strong> Инструменты </strong> меню выбрать <strong> Опции папки </strong> . <br> 3. На вкладке &quot;Просмотр&quot; щелкните <strong> Показать скрытые файлы и папки </strong> и нажмите <strong> ОК. </strong></p> <p><img src=\"images/image_thumb-2-290.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Шаг 2. Найдите на диске поврежденный файл Outlook Express DBX. </h6> <p> 1. Откройте папку магазина Outlook Express. Обычно эта папка находится на вашем диске по следующему пути: </p> <ul> <li> C: \\ Documents and Settings \\\\ Local Settings \\ Application Data \\ Identities \\ {} \\ Microsoft \\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> например «C: \\ Documents and Settings \\ User \\ Local Settings \\ Application Data \\ Identities \\ {D8F3C56D-965E-41AE-8A23-A58460ABAE00} \\ Microsoft \\ <strong> Outlook Express </strong> ” </p></blockquote> <p> 3. Из проводника <strong> Вид </strong> меню выбрать <strong> Подробности </strong> . <br> 4. Найдите файл DBX, размер которого превышает 2 ГБ, или найдите поврежденный файл DBX. (поврежденный файл DBX - это папка MAIL, которая кажется пустой в программе Outlook Express). </p> <p><img src=\"images/image_thumb-3-887.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Скопируйте этот файл DBX в другое место на диске (например, в новую папку на рабочем столе с именем «CorruptedDBX»). </p> <p> </p> <h6> Шаг 3. Загрузите UnDBX - бесплатную утилиту восстановления DBX Outlook Express. </h6> <p> UnDBX - отличный бесплатный инструмент восстановления Outlook Express DBX, который может извлекать все содержащиеся электронные письма Outlook Express в формате .eml. Кроме того, у него есть возможность исправить и восстановить поврежденный файл Outlook Express .DBX. </p> <p> Вы можете скачать UnDBX из <a href=\"https://sourceforge.net/projects/undbx/\" target=\"_blank\" rel=\"nofollow noopener\"> здесь </a> . </p> <p> </p> <h6> Шаг 4. Восстановите электронную почту из поврежденного файла Outlook Express DBX. </h6> <p> 1. Чтобы восстановить электронную почту из поврежденного файла DBX, дважды щелкните, чтобы запустить утилиту UnDBX. <br> 2. В утилите UnDBX: </p> <blockquote><p> 1. Выберите папку, содержащую файлы Outlook Express .dbx, а затем <strong> проверять </strong> &quot; <strong> включить режим восстановления </strong> &quot;вариант ниже. <br> 2. <strong> Выберите папку назначения </strong> на вашем компьютере для хранения (извлечения) файлов .eml. (например, в папку на рабочем столе под названием &quot;RecoveredInbox&quot;) <br> 3. Наконец нажмите <strong> Восстанавливаться </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-645.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Когда восстановление UnDBX будет завершено, откройте Outlook Express. <br> 4. Перейдите в папку, в которой UnDBX сохранил извлеченные файлы .eml. <br> 5. Перетащите извлеченные электронные письма в соответствующую папку (в Outlook Express). * </p> <p><strong> * Предложение: </strong> Чтобы избежать повторного повреждения папок Outlook Express (или обойти ограничение в 2 ГБ), я предлагаю перетаскивать электронные письма в группы (например, по годам) и помещать их в разные папки в OE. Например, выберите только электронные письма текущего года и перетащите их в новую папку OE с именем текущего года (например, «Входящие 2018»). Затем повторите те же шаги для всех остальных писем за предыдущие годы. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}