{"title":"КАК: удалить историю Интернета, пароли и файлы cookie из вашего веб-браузера (Chrome, Firefox, IE)","content":"<p> Когда вы посещаете веб-сайт с помощью веб-браузера, веб-сайт отправляет определенную информацию в браузер, и браузер сохраняет эту информацию в небольших текстовых файлах, называемых <strong> печенье </strong> с. Файлы cookie хранят настройки пользователя для этого веб-сайта, например данные для входа, поэтому пользователю не нужно повторно вводить данные для входа (имя пользователя и / или пароль), когда он возвращается на тот же веб-сайт. Файлы cookie также могут хранить историю того, какие страницы веб-сайта посетил пользователь, поэтому пользователю не нужно их запоминать или перемещаться по всем страницам веб-сайта, пока он не найдет то, что хочет. </p> <p> В то же время, когда вы посещаете веб-сайт, браузер сохраняет локальную копию всех посещенных вами веб-страниц, чтобы сохранить пропускную способность соединения и уменьшить время загрузки веб-страниц при следующем их посещении. Эта &quot;локальная копия веб-страниц&quot; известна как &quot; <strong> Временные интернет файлы </strong> &quot; из <strong> Кеш </strong> . </p> <p> Файлы cookie и кеш через некоторое время могут занимать значительный объем дискового пространства, и их необходимо очистить. В других случаях вам может потребоваться удалить кеш браузера и файлы cookie, чтобы полностью перезагрузить содержимое веб-сайта или по соображениям безопасности и конфиденциальности: например, если вы не хотите, третье лицо, чтобы узнать, какие веб-страницы вы посетили (также известный как: &quot; <strong> История просмотров </strong> &quot;) или ваши данные для входа на веб-сайт (например, GMAIL). </p> <p> В этом руководстве вы найдете два (2) простых способа удалить историю просмотров, временные файлы Интернета (кеш) и файлы cookie из Internet Explorer, Chrome и Firefox. </p> <h4> Как очистить историю просмотра веб-страниц, сохраненные пароли и файлы cookie в Chrome, Firefox и Internet Explorer. </h4> <h5><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Метод 1. Очистить данные просмотра в определенном браузере. </a></h5> <h5><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Метод 2. Удалите данные просмотра из всех веб-браузеров одним щелчком мыши! </a></h5> <p> </p> <h5> Метод 1. Удалить историю, кеш и файлы cookie из определенного браузера. </h5> <p> Как правило, каждый веб-браузер имеет параметры для удаления сохраненных данных просмотра через меню настроек / параметров, но если вы хотите легко получить доступ к этим параметрам (без необходимости перемещаться с помощью мыши по меню браузера), нажмите <strong> Ctrl </strong> + <strong> Сдвиг </strong> + <strong> Удалить </strong> вместе в открытом окне браузера. Так… </p> <p><strong> Чтобы удалить историю просмотров, кеш и файлы cookie из Internet Explorer: </strong></p> <p> 1. Откройте Internet Explorer и нажмите <strong> Ctrl </strong> + <strong> Сдвиг </strong> + <strong> Удалить. <br> </strong> 2. Выберите, какую информацию вы хотите удалить, и нажмите <strong> Удалить </strong> кнопка. </p> <p><img src=\"images/image_thumb-18-750.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> Чтобы удалить историю просмотров, кеш и файлы cookie из Chrome: </strong></p> <p> 1. Запустите Chrome и нажмите <strong> Ctrl </strong> + <strong> Сдвиг </strong> + <strong> Удалить. <br> </strong> 2. Выберите, какую информацию вы хотите удалить, а затем нажмите <strong> ОЧИСТИТЬ ДАННЫЕ </strong> . </p> <p><img src=\"images/image_thumb-19-667.png\" alt=\"clear chrome history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p><strong> Чтобы удалить историю просмотров, кеш и файлы cookie из Firefox: </strong></p> <p> 1. Откройте Firefox и одновременно нажмите <strong> Ctrl </strong> + <strong> Сдвиг </strong> + <strong> Удалить. <br> </strong> 2. Выберите данные, которые вы хотите удалить из Firefox, и нажмите <strong> Сейчас ясно. </strong></p> <p> </p> <p><img src=\"images/image_thumb-20-864.png\" alt=\"clear firefox history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> Метод 2: удалить историю браузера, кэш и файлы cookie сразу из всех веб-браузеров. </h5> <p> Если вы хотите облегчить себе жизнь, то можете воспользоваться <a href=\"https://www.ccleaner.com/\" target=\"_blank\" rel=\"nofollow noopener\"> CCleaner </a> Утилита для простого удаления временных файлов Интернета, истории и файлов cookie из всех используемых вами веб-браузеров одним щелчком мыши. </p> <p> 1. <a href=\"https://www.ccleaner.com/ccleaner/download\" target=\"_blank\" rel=\"nofollow noopener\"> Скачать </a> и установите бесплатную версию утилиты CCleaner. </p> <p> 2. Запуск <strong> CCleaner </strong> и перейдите к <strong> Окна </strong> и <strong> Приложения </strong> параметры вкладки, чтобы выбрать, какую информацию вы хотите удалить из веб-браузеров. </p> <p> 3. Когда закончите, нажмите <strong> Запустить очиститель </strong> . </p> <p><img src=\"images/image_thumb-21-173.png\" alt=\"clear internet history cache cookies - ccleaner\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Это все! Это сработало для вас? </p> <p> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}