{"title":"Как включить защиту восстановления системы в ОС Windows 10/8/7.","content":"<p> Это руководство содержит инструкции по включению защиты системы в ОС Windows 10, 8 и 7. Защита от восстановления системы (широко известная как «Защита системы») - это функция Windows, которая позволяет <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> восстановить </a> ваша система на более ранний момент времени, если Windows не работает должным образом после значительного изменения в системных файлах (например, после обновления Windows или после вирусной атаки). </p> <p> Инструмент восстановления системы использует службу теневого копирования тома для создания снимков системных файлов и реестра Windows и сохранения их как точек восстановления. Эти «точки восстановления» можно использовать для восстановления системы до предыдущего рабочего состояния, если Windows не загружается или становится нестабильной, без необходимости переустанавливать операционную систему. </p> <h4> Как включить защиту восстановления системы в Windows 10. </h4> <p> 1. Откройте проводник Windows, щелкните правой кнопкой мыши значок «Этот компьютер» и выберите <strong> Характеристики </strong> . </p> <p><img src=\"images/image_thumb-70-672.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Выберите <strong> Системная защита </strong> слева. </p> <p><img src=\"images/image_thumb-71-762.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Выделите <strong> Локальный диск C: (Система) </strong> и нажмите <strong> Настроить. </strong></p> <p><img src=\"images/image_thumb-72-782.png\" alt=\"turn on system restore protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. В разделе Параметры защиты системы выберите <strong> Включите защиту системы </strong> и нажмите <strong> ОК. * </strong></p> <p> * Примечание. Если «Защита системы: уже включена», значит, все в порядке. </p> <p><img src=\"images/image_thumb-73-192.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 5. Наконец, в параметрах защиты системы нажмите <strong> Создавать </strong> для создания снимка (точки восстановления) текущего состояния системы. </p> <p><img src=\"images/image_thumb-75-308.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Это все! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}