{"title":"Как отключить Bitlocker в среде восстановления Windows (WinRE).","content":"<p> В этом руководстве содержатся инструкции по отключению защиты BitLocker и расшифровке зашифрованного диска BitLocker в среде восстановления Windows. Инструкции могут быть полезны, если ваш компьютер защищен BitLocker и не принимает ключ восстановления BitLocker или пароль BitLocker при запуске системы, и вы не можете разблокировать диск, защищенный BitLocker. </p> <p><img src=\"images/image_thumb-52-511.png\" alt=\"Remove Bitlocker from Windows Recovery Environment \" loading=\"lazy\"></p> <h4></h4> <h4> Как удалить защиту BitLocker и расшифровать зашифрованный диск BitLocker в среде восстановления Windows (WinRE). </h4> <p><strong> Требования: </strong><br> <strong> А </strong> . <strong> Установочный носитель Windows 10 (USB или DVD). </strong> Если у вас нет установочного носителя Windows, вы можете создать его, используя <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Инструмент Microsoft Media Creation </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Как создать установочный USB-носитель Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Как создать установочный DVD-диск с Windows 10. </a></li> </ul> <p><strong> Б. Ключ восстановления BitLocker или пароль BitLocker: </strong> Чтобы отключить защиту Bitlocker, у вас должен быть пароль Bitlocker или ключ восстановления Bitlocker, чтобы сначала разблокировать диск, а затем расшифровать диск. * </p> <p> * Примечание. Если у вас нет ключа восстановления BitLocker, невозможно обойти защиту BitLocker. Если диск защищен BitLocker и у вас нет ключа восстановления BitLocker или пароля для разблокировки диска, то единственный вариант, который у вас есть (чтобы снова использовать диск), - это полностью стереть диск с помощью инструкций. в этой статье: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Как удалить защиту BitLocker с диска без ключа восстановления BitLocker или пароля. </a></p> <p> Ключ восстановления Bitlocker - это 48-значное число, которое можно найти в следующих местах: </p> <ul> <li> На распечатке, которую вы сохранили, когда включили Bitlocker. </li> <li> На USB-накопителе, который вы использовали во время активации Bitlocker, чтобы сохранить ключ восстановления Bitlocker. </li> <li> На <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Ключи восстановления учетной записи Microsoft </a> , используя учетную запись MS, которую вы используете для входа на свое устройство, или добавили на устройство, чтобы загружать приложения из Microsoft Store или активировать MS Office или для электронной почты. </li> <li> На ваше <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Учетная запись Azure </a> для рабочих ПК, которые войдут в систему с учетной записью Azure Active Directory. </li> </ul> <p> Как только вы найдете ключ восстановления BitLocker или пароль ΒitLocker, перейдите к разблокировке зашифрованного диска Bitlocker и удалению шифрования BitLocker в WinRE, следуя приведенным ниже инструкциям. </p> <p> Чтобы разблокировать и расшифровать диск операционной системы C: из WinRE: </p> <p> 1. Загрузите систему с установочного носителя Windows 10. <br> 2. На экране ниже нажмите кнопку <strong> СДВИГ </strong> + <strong> F10 </strong> ключи для запуска командной строки. (или нажмите <strong> Следующий </strong> &gt; <strong> Ремонт моего компьютера </strong> &gt; <strong> Устранение неполадок </strong> &gt; <strong> Командная строка </strong> ). * </p> <p> * Примечание. Если вам будет предложено ввести ключ восстановления, нажмите <strong> Пропустить этот диск </strong> . </p> <p><img src=\"images/image_thumb15_thumb-548.png\" alt=\"How to disable-unlock bitlocker from Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. В командной строке введите следующую команду, чтобы просмотреть букву зашифрованного диска: </p> <ul> <li><strong> управление-bde -status </strong></li> </ul> <p> </p> <p> 4. Затем перейдите к разблокировке зашифрованного диска, используя следующую команду, в зависимости от вашего случая: </p> <p><strong> Дело А. </strong> Если вам известен ключ восстановления BitLocker, введите следующую команду: </p> <ul> <li><strong> manage-bde -unlock буква-диска: -rp ключ-восстановления BitLocker </strong></li> </ul> <p> * например: если вы хотите разблокировать диск «D:», а ключ восстановления битлокера: «123456-123456-123456-123456-123456-123456», введите: </p> <ul> <li> <ul> <li> управление-bde -unlock <strong> D </strong> : -rp <strong> 123456-123456-123456-123456-123456-123456 </strong></li> </ul> </li> </ul> <p> </p> <p><strong> Случай Б. </strong> Если вы знаете пароль BitLocker для разблокировки диска, введите следующую команду: </p> <ul> <li><strong> manage-bde -unlock буква-диска: -pw BitLocker-Password </strong></li> </ul> <p> * например: если вы хотите разблокировать диск «D:» и пароль BitLocker: «123qwerty», введите: * </p> <ul> <li> <ul> <li> управление-bde -unlock <strong> D </strong> : -пароль <strong> 123qwerty </strong></li> </ul> </li> </ul> <p> </p> <p> 5. Затем перейдите к расшифровке диска и отключите защиту BitLocker с помощью этой команды: </p> <ul> <li><strong> manage-bde -off буква-диска: </strong></li> </ul> <p> * например: если вы хотите расшифровать диск &quot;D:&quot;, введите: </p> <ul> <li> <ul> <li> manage-bde –off <strong> D </strong> : </li> </ul> </li> </ul> <p> 6. Процесс расшифровки с запуском. Чтобы снова проверить тип состояния дешифрования, выполните следующую команду и убедитесь, что диск <strong> Полностью расшифрован </strong> а также <strong> Разблокирован </strong> : </p> <ul> <li><strong> управление-bde -status </strong></li> </ul> <p><img src=\"images/image_thumb9_thumb-678.png\" alt=\"decrypt bitlocker encrypted drive windows removery environment\" loading=\"lazy\"></p> <p> </p> <p> 7. Когда вы закончите, извлеките установочный носитель Windows и перезагрузите компьютер. * </p> <p> * Примечание. Если Windows не запускается, подключите диск к другому компьютеру и сделайте резервную копию ваших личных данных на другом носителе. потом <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> диагностировать привод на наличие проблем </a> и, если все в порядке, снова вставьте диск в компьютер и выполните <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> чистая установка Windows 10 </a> . </p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этой проблеме. </p>"}