{"title":"Как переустановить Windows 10, если Windows не загружается.","content":"<p> В этом руководстве вы найдете подробную инструкцию о том, как переустановить Windows 10, если Windows не загружается. В предыдущем уроке я упомянул способ <a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"nofollow noopener\"> переустановите Windows 10 с помощью функции «СБРОСИТЬ этот компьютер» </a> . Но «СБРОС этого ПК» доступен только в том случае, если Windows 10 может нормально загружаться или если вы можете запустить меню «Расширенный запуск» после загрузки в Windows (параметр «СБРОСИТЬ этот компьютер» недоступен при загрузке с USB). </p> <p> Это руководство содержит инструкции по переустановке Windows 10, если Windows не загружается, без потери ваших файлов. </p> <h2> Как переустановить пару Windows 10, если Windows не запускается. </h2> <p><strong> Требования </strong> : Чтобы переустановить Windows 10, если Windows не запускается нормально, вам необходимо загрузить компьютер с установочного носителя Windows (USB или DVD) и включить меню дополнительных параметров (меню клавиши F8). Если у вас нет установочного носителя Windows, вы можете создать его, используя <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Инструмент Microsoft Media Creation </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Как создать установочный USB-носитель Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Как создать установочный DVD-диск с Windows 10. </a></li> </ul> <p> 1. Загрузите компьютер с установочного носителя Windows. <br> 3. Нажмите <strong> Следующий </strong> на экране параметров языка. <br> 4. Выберите <strong> Почини свой компьютер </strong> . <br> 5. Затем выберите <strong> Устранение неполадок -&gt; </strong><strong> Дополнительные параметры -&gt; Командная строка. </strong></p> <p> 6. В окне командной строки введите следующую команду и нажмите <strong> Входить: </strong></p> <ul> <li><strong> bcdedit / set {default} bootmenupolicy legacy </strong></li> </ul> <p><img src=\"images/image_thumb-33-821.png\" alt=\"advanced boot options\" loading=\"lazy\"></p> <p> 7. Тип <strong> выход </strong> чтобы закрыть окно командной строки. <br> 8. Удалите установочный носитель Windows. <br> 9. Закройте все окна, чтобы перезагрузить компьютер или выключить его. </p> <p> 10. <strong> Нажмите </strong> в <strong> F8 </strong> ключ <strong> несколько раз </strong> во время включения компьютера. </p> <p> 11. В &quot;Меню дополнительных параметров&quot; выделите &quot; <strong> Почини свой компьютер </strong> &quot;вариант, а затем нажмите <strong> ВХОДИТЬ </strong> . </p> <p><img src=\"images/image_thumb-13-334.png\" alt=\"Repair your Computer in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 12. На экране &quot;Выберите вариант&quot; выберите <strong> Устранение неполадок </strong> а затем щелкните <strong> Сбросить этот компьютер -&gt; Сохранить мои файлы. </strong> * </p> <p> Заметки: <br> 1. &quot; <strong> Сохранить мои файлы &quot; </strong> вариант, удалит все ваши приложения и настройки, но сохранит ваши личные файлы. <br> 2. В <strong> «Удалить все» </strong> вариант, удалит все приложения, настройки и файлы. Выбрав эту опцию, ваш компьютер будет восстановлен до чистого состояния. <br> 3. Если вы выбрали «Удалить все», убедитесь, что у вас есть недавняя резервная копия ваших личных файлов на другой носитель (например, USB-диск), в противном случае все ваши файлы будут потеряны. </p> <p><img src=\"images/image_thumb-14-296.png\" alt=\"How to Reinstall Windows 10 if Windows Won't Boot.\" loading=\"lazy\"></p> <p> </p> <p> 13. На следующем экране выберите учетную запись с правами администратора. ) и на следующем экране введите свой пароль и нажмите <strong> Следующий </strong> . </p> <p><img src=\"images/image_thumb-15-869.png\" alt=\"How to Reinstall Windows 10 if Windows cannot Boot.\" loading=\"lazy\"></p> <p> 14. Введите пароль для выбранной учетной записи и нажмите <strong> Продолжать. </strong></p> <p><img src=\"images/image_thumb-16-692.png\" alt=\"How to Reinstall Windows 10 if Windows fails to boot.\" loading=\"lazy\"></p> <p> </p> <p> 15. Дождитесь завершения установки. </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом руководстве. </p>"}