{"title":"Как заблокировать сайты в Chrome или Firefox.","content":"<p> Если вы ищете простой способ заблокировать веб-сайт в Chrome или Firefox, продолжайте читать ниже. </p> <p> Хотя для большинства из нас Интернет стал необходимостью в повседневной жизни для работы или развлечений, с другой стороны, иногда полезно иметь возможность блокировать некоторые сайты, чтобы не отвлекаться. Например, никто не хочет, чтобы его ребенок отвлекался просмотром видео на YouTube, когда он читает уроки. </p> <p> В этом руководстве вы узнаете, как блокировать веб-сайты в Chrome и <a href=\"#firefox\" target=\"_blank\" rel=\"nofollow noopener\"> Fire Fox </a> браузеры. </p> <p> * Примечание. Если вы хотите заблокировать веб-сайт во всех браузерах, прочтите эту статью: <a href=\"https://www.repairwin.com/block-youtube-on-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Как заблокировать YouTube в Windows 10. </a></p> <h2> Как заблокировать сайты в Google Chrome. </h2> <p> Самый простой способ заблокировать веб-сайт в Chrome - использовать известное расширение BlockSite. Установка надстройки BlockSite аналогична установке любого другого расширения. </p> <p> 1. Перейдите к <a href=\"https://chrome.google.com/webstore/detail/blocksite-stay-focused-co/eiimnmioipafcokbfikbljfdeojpcgbh\" target=\"_blank\" rel=\"nofollow noopener\"> Расширение BlockSite </a> в Интернет-магазине Chrome и щелкните значок <strong> Добавить в Chrome </strong> кнопка. </p> <p><img src=\"images/image_thumb-4-439.png\" alt=\"how to block websites chrome\" loading=\"lazy\"></p> <p> 2. При появлении запроса щелкните <strong> Добавить расширение </strong> . </p> <p><img src=\"images/image_thumb-5-782.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Когда установка будет завершена, перейдите в меню Chrome&gt; Дополнительные инструменты&gt; Расширения. </p> <p><img src=\"images/image_thumb-6-830.png\" alt=\"chrome tools extensions\" loading=\"lazy\"></p> <p> 4. Найдите <strong> BlockSite </strong> расширение и нажмите <strong> Подробности. </strong></p> <p><img src=\"images/image_thumb-7-415.png\" alt=\"Blocksite details\" loading=\"lazy\"></p> <p> 5. <strong> Открыть </strong> в <strong> Варианты расширения </strong> . </p> <p><img src=\"images/image_thumb-8-135.png\" alt=\"How to Block sites chrome\" loading=\"lazy\"></p> <p> 6. Введите название сайта, который вы хотите заблокировать (например, <a href=\"http://www.youtube.com\" target=\"_blank\" rel=\"nofollow noopener\"> www.youtube.com </a> ) и нажмите значок плюса (+), чтобы добавить сайт в список заблокированных сайтов. </p> <p><img src=\"images/image_thumb-9-298.png\" alt=\"blocked sites chrome\" loading=\"lazy\"></p> <p> 7. Вот и все! С этого момента, когда вы попытаетесь посетить заблокированный сайт, вы будете проинформированы о том, что сайт заблокирован с помощью расширения BlockSite. Чтобы изменить список заблокированных сайтов, нажмите <strong> Отредактируйте свой список </strong> кнопку, чтобы внести любые изменения или удалить заблокированный сайт из списка. </p> <p><img src=\"images/image_thumb-10-951.png\" alt=\"image\" loading=\"lazy\"></p> <h3> Как защитить паролем заблокированные сайты в расширении BlockSite. </h3> <p> Если вы хотите запретить пользователям разблокировать заблокированный сайт: </p> <p> 1. Откройте <strong> BlockSite </strong> варианты расширения. <br> 2. Перейдите к <strong> Защита паролем </strong> настройки. <br> 3. <strong> Давать возможность </strong> опция Защитить <strong> предпочитаемые вами параметры BlockSite и страницу расширения Chrome с паролем </strong> а затем введите свой адрес электронной почты и пароль и нажмите <strong> Сохранить. </strong></p> <p><img src=\"images/image_thumb-11-711.png\" alt=\"password protect blocked sites\" loading=\"lazy\"></p> <p> 4. BlockSite отправит вам электронное письмо со ссылкой для подтверждения вашего адреса электронной почты. После проверки электронной почты защита паролем будет активна. </p> <h2> Как заблокировать веб-сайты в Mozilla Firefox. </h2> <p> 1. Перейдите к <a href=\"https://addons.mozilla.org/en-US/firefox/addon/blocksite/\" target=\"_blank\" rel=\"nofollow noopener\"> Расширение BlockSite </a> в надстройках Firefox. <br> 2. Щелкните значок <strong> Добавить в Firefox </strong> кнопка. </p> <p><img src=\"images/image_thumb-12-999.png\" alt=\"block websites firefox\" loading=\"lazy\"></p> <p> 2. Когда будет предложено разрешить установку расширения, нажмите <strong> Добавлять. </strong></p> <p><img src=\"images/image_thumb-13-588.png\" alt=\"Blocksite firefox\" loading=\"lazy\"></p> <p> 3. По завершении установки выберите, нужно ли блокировать веб-сайты в окнах с ограниченным доступом (инкогнито), и нажмите <strong> Хорошо </strong> . </p> <p><img src=\"images/image_thumb-14-173.png\" alt=\"how to block site\" loading=\"lazy\"></p> <p> 4. Если вы хотите запретить расширению BlockSite считывать данные на сайтах, которые вы посещаете, щелкните Может быть письмо. </p> <p><img src=\"images/image_thumb-15-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Теперь щелкните значок BlockSite и <strong> Редактировать черный список </strong> чтобы указать, какие сайты вы хотите заблокировать. </p> <p><img src=\"images/image_thumb-16-657.png\" alt=\"block sites firefox\" loading=\"lazy\"></p> <p> 6. На вкладке «Блокировать сайты» введите имя сайта, который вы хотите заблокировать (например, «facebook.com»), а затем добавьте его в список заблокированных сайтов. </p> <p><img src=\"images/image_thumb-17-817.png\" alt=\"How to block site Firefox\" loading=\"lazy\"></p> <p> 7. После того, как вы добавили сайты, которые хотите заблокировать, закройте настройки BlockSite, и все готово. </p> <p> В дополнение к своей основной функции, расширение BlockSite также имеет некоторые другие полезные функции, такие как: </p> <ul> <li> <p><strong> Режим фокусировки </strong> : Блокировать сайты на определенное время (например, 25 минут). </p> </li> <li> <p><strong> Защита паролем: </strong> Защитите свои настройки BlockSite от изменений. </p> </li> <li> <p><strong> Блокировать по словам: </strong> Блокировать URL-адреса, содержащие определенные слова. </p> </li> </ul> <p> Вот и все, ребята! Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}