{"title":"Как перенести электронную почту и настройки Thunderbird на новый компьютер.","content":"<p> Это руководство содержит подробные инструкции о том, как перенести сообщения электронной почты Thunderbird, настройки учетной записи и адресные книги на другой компьютер. Приложение электронной почты Thunderbird хранит все данные в папке профиля с расширением «.default» в конце имени. (например, &quot;wyhsxcvs.default&quot;). По умолчанию эта папка профиля хранится в следующем месте на вашем компьютере: </p> <ul> <li> C: \\ Users \\\\ AppData \\ Roaming \\ Thunderbird \\ Profiles \\ <strong> .По умолчанию </strong></li> </ul> <p><img src=\"images/image_thumb-14-425.png\" alt=\"How to Transfer Thunderbird Emails & Data to a New Computer.\" loading=\"lazy\"></p> <p> Итак, если вы хотите переместить данные Thunderbird на новый компьютер, вам необходимо перенести родительскую папку Thunderbird на новый компьютер, а затем указать Thunderbird на эту папку. </p> <h4> Как перенести профиль Thunderbird на другой компьютер. </h4> <h6> Шаг 1. Скопируйте папку профиля Thunderbird со старого компьютера. </h6> <p> </p> <p> На старом компьютере перейдите к месту хранения данных Thunderbird. Для этого: </p> <p> 1. Откройте Thunderbird. <br> 2. Из меню <img src=\"images/image_thumb21_thumb-959.png\" alt=\"image_thumb[21]\" loading=\"lazy\"> , выберите <strong> Помощь </strong> -&gt; <strong> Информация по поиску и устранению неисправностей. <br> </strong> 3. На <strong> Папка профиля </strong> линия, щелкните <strong> Открыть папку </strong> . </p> <p><img src=\"images/image_thumb-8-878.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Закройте приложение Thunderbird. <br> 5. В окне проводника щелкните на <strong> Роуминг </strong> . </p> <p><img src=\"images/image_thumb-9-272.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Копировать </strong> а также <strong> Вставить </strong> в <strong> Thunderbird </strong> папку на носитель с достаточным свободным пространством. (например, внешний USB-накопитель). </p> <p><img src=\"images/image_thumb-10-958.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Шаг 2. Перенесите профиль Thunderbird на новый компьютер. </h6> <p> 1. <a href=\"https://www.thunderbird.net/en-US/download/\" target=\"_blank\" rel=\"nofollow noopener\"> Скачать </a> и установите Thunderbird на новый компьютер. * </p> <p><strong> * Важный: </strong> В конце процесса установки <strong> снимите отметку </strong> параметр «Запустить Mozilla Thunderbird сейчас» и нажмите <strong> Заканчивать </strong> . </p> <p><img src=\"images/image_thumb-11-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Подключите USB-накопитель (с папкой «Thunderbird») к новому компьютеру. <br> 3. Щелкните правой кнопкой мыши папку «Thunderbird» и нажмите <strong> Копировать </strong> . <br> 4. Нажмите Windows <img src=\"images/image_thumb8_thumb-1-464.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> р </strong> клавиши, чтобы открыть окно команды запуска. <br> 5. Введите следующую команду <strong> </strong> и нажмите <strong> Входить: </strong></p> <ul> <li><strong> %данные приложения% </strong></li> </ul> <p><img src=\"images/image_thumb-12-421.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. В окнах проводника щелкните правой кнопкой мыши пустое место и нажмите <strong> Вставить </strong> . </p> <p><img src=\"images/image_thumb-13-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Запустите Thunderbird, и вы увидите все свои электронные письма, адресные книги и настройки учетной записи, как на старом компьютере. </p> <p> Это все! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}