{"title":"Как всегда открывать Chrome в режиме инкогнито.","content":"<p> Если вы ищете способ, чтобы Chrome всегда открывался в режиме инкогнито, продолжайте читать ниже. Когда вы запускаете Chrome в режиме инкогнито, ваши действия в браузере остаются закрытыми для других пользователей, использующих то же устройство. В режиме инкогнито Chrome не сохраняет историю просмотров, файлы cookie и информацию, введенную в формы. </p> <p> Ручной способ запустить новый сеанс Chrome в режиме инкогнито - перейти в меню Chrome. <img src=\"images/image_thumb10_thumb-963.png\" alt=\"image_thumb[10]\" loading=\"lazy\"> и выбрать «Новое окно в режиме инкогнито» или нажать CTRL + SHIFT + N. </p> <p><img src=\"images/image_thumb-42-832.png\" alt=\"Chrome New incognito window\" loading=\"lazy\"></p> <p> </p> <p> В этой статье вы найдете инструкции, как всегда запускать Google Chrome в режиме инкогнито. </p> <h4> Как всегда запускать Google Chrome в режиме инкогнито. </h4> <p> Если вы хотите всегда запускать Chrome в режиме инкогнито, создайте новый ярлык Chrome и измените его свойства следующим образом: </p> <p> 1, <strong> Щелкните правой кнопкой мыши </strong> на <strong> Гугл Хром </strong> ярлык и выберите <strong> Характеристики </strong> . <br> 2. На <strong> Общий </strong> вкладку, добавьте переключатель «–инкогнито» (без кавычек) в конец целевой строки и нажмите <strong> ОК </strong> : </p> <p> например &quot;C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; - инкогнито. </p> <p><img src=\"images/image_thumb-43-798.png\" alt=\"How to Always Open Chrome in Incognito mode.\" loading=\"lazy\"></p> <p> 3. С этого момента, когда вы запускаете Chrome с измененного ярлыка, Chrome будет открываться в режиме инкогнито. * </p> <p><strong> * КОНЧИК: </strong> Если вы хотите открыть Chrome в режиме инкогнито при открытии гиперссылки (URL) из вашего электронного письма или другой программы, вам необходимо изменить реестр. Для этого: </p> <blockquote> <p> 1. Откройте <strong> Редактор реестра </strong> . <br> 2. В реестре перейдите к следующему разделу: </p> <ul> <li> <p> HKEY_CLASSES_ROOT \\ ChromeHTML \\ shell \\ open \\ команда </p> </li> </ul> <p> 3. На правой панели дважды щелкните значок <strong> По умолчанию </strong> Строковое значение REG_SZ. </p> </blockquote> <p><img src=\"images/image_thumb-44-612.png\" alt=\"open url in chrome incognito\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. Добавьте переключатель, добавьте слово «инкогнито» (без кавычек) перед «% 1» и нажмите <strong> ОК </strong> . </p></blockquote> <blockquote><p> например Измените данные значения с: </p> <p> &quot;C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; - &quot;% 1&quot; </p> <p> к: </p> <p> &quot;C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; –incognito &quot;% 1&quot; </p></blockquote> <p><img src=\"images/image_thumb-45-148.png\" alt=\"open url chrome incognito - registry\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. С этого момента при нажатии на URL (HTML) Chrome будет открывать его в режиме инкогнито. </p></blockquote> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}