{"title":"Как открыть PowerShell от имени администратора в текущей папке в проводнике (Windows 10)","content":"<p> Если вы хотите открыть PowerShell или PowerShell от имени администратора в любом месте / папке в проводнике, продолжайте читать это руководство. Как вы знаете, обычные способы открыть PowerShell в Windows 10 - это найти его с помощью поиска Кортаны или (быстрее) нажать кнопку <strong> Выиграть <img src=\"images/image_thumb8_thumb_thumb-479.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"></strong> + <strong> Икс </strong> клавиши, чтобы открыть «Меню опытного пользователя» и запустить оттуда Windows PowerShell. </p> <p><img src=\"images/image_thumb-54-350.png\" alt=\"PoweShell Admin (Win + X menu)\" loading=\"lazy\"></p> <p> </p> <p> Хотя эти методы полезны, иногда возникает необходимость открыть PowerShell в определенном месте / папке. Для этого следуйте приведенным ниже инструкциям. </p> <h4> Как открыть Windows PowerShell в определенном месте в Windows 10. </h4> <p> 1. Перейдите в папку, в которой вы хотите открыть PowerShell. <br> 2. <strong> Удерживать </strong> в <strong> СДВИГ </strong> ключ и <strong> щелкните правой кнопкой мыши </strong> в любом месте папки. <br> 3. В контекстном меню выберите <strong> Откройте окно PowerShell здесь </strong> к <strong> </strong> откройте новое окно PowerShell в этой папке. </p> <p> </p> <p><img src=\"images/image_thumb-55-793.png\" alt=\"Open PoweShell at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Если вы хотите открыть «PowerShell As Admin» в любой папке, нажмите кнопку <strong> Файл </strong> меню и выберите <strong> Откройте Windows PowerShell от имени администратора. </strong> . * </p> <p> * Примечание. Как видно из меню «Файл», вы также можете открыть «простое» окно PowerShell. </p> <p><img src=\"images/image_thumb-56-830.png\" alt=\"Open PoweShell As Administrator at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p><strong> Дополнительная помощь: </strong> Если вы поклонник сочетаний клавиш, другой способ открыть PowerShell (Admin) - нажать кнопку <strong> Alt </strong> + <strong> F </strong> + <strong> S </strong> + <strong> А </strong> ключи в порядке. </p> <p> Вот и все, ребята! Это сработало для вас? Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}