{"title":"Как удалить НАЖМИТЕ ЗДЕСЬ, ЧТОБЫ УЗНАТЬ БОЛЬШЕ О MICROSOFT EXCHANGE в Outlook.","content":"<p> Если вы не хотите каждый раз щелкать гиперссылку «Щелкните здесь, чтобы просмотреть больше об Exchange» в Outlook, чтобы просмотреть все сохраненные электронные письма на Exchange, продолжайте читать ниже. В Outlook появляется гиперссылка «Щелкните здесь, чтобы просмотреть дополнительные сведения об Exchange», поскольку в почтовых папках отображаются только новые элементы (электронные письма). Это поведение по умолчанию, потому что, когда вы используете Microsoft Outlook 2019, Outlook 2016, Outlook 2013 или Outlook для Office 365 для подключения к почтовому ящику Exchange Server, Outlook отображает одно письмо за последний год. </p> <p><img src=\"images/image_thumb-19-421.png\" alt=\"How to Remove the \" click here to view more on exchange option in outlook. loading=\"lazy\"></p> <p> </p> <p> Чтобы удалить гиперссылку «Щелкните здесь, чтобы просмотреть дополнительные сведения об Exchange», чтобы просмотреть все элементы электронной почты при подключении к почтовому ящику Exchange, выполните следующие действия. </p> <h4> Как заставить Outlook отображать все ваши электронные письма из почтового ящика Exchange. </h4> <p> Чтобы отображать все ваши электронные письма Exchange в Outlook: </p> <p> 1. Щелкните значок <strong> Файл </strong> меню и перейдите в <strong> Счет </strong> &gt; <strong> Настройки аккаунта </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-1-139.png\" alt=\"How to Backup Outlook\" loading=\"lazy\"></p> <p> 2. Выделите учетную запись Exchange и нажмите <strong> Изменять </strong> . </p> <p><img src=\"images/image_thumb-20-777.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. В настройке «Загрузить электронную почту за прошлое» перетащите ползунок в конец. </p> <p><img src=\"images/image_thumb-17-833.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Когда закончите, нажмите <strong> Следующий </strong> а также <strong> Заканчивать </strong> а затем закройте настройки учетной записи. </p> <p><img src=\"images/image_thumb-18-585.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Запустить снова </strong> Outlook. </p> <p> Вот и все, ребята! Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением в блоге в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}