{"title":"Как отключить BitLocker в Windows 10.","content":"<p> В этом руководстве содержатся инструкции по отключению защиты Bitlocker и шифрования диска в Windows 10. Как вы, возможно, знаете, функция шифрования BitLocker, доступная в версиях Windows 10 pro и Enterprise, может помочь вам защитить содержимое вашего ПК от несанкционированного доступа. Но иногда возникает необходимость отключить Bitlocker в Windows 10, поэтому в этом руководстве вы можете узнать, как это сделать. </p> <p> Если ваш компьютер защищен с помощью BitLocker, то при запуске системы вам будет предложено подключить USB-накопитель, который вы использовали во время активации BitLocker, или ввести пароль BitLocker, чтобы разблокировать диск C: для продолжения загрузки. Если у вас их нет, нажмите <strong> ESC </strong> , чтобы ввести ключ восстановления BitLocker. * </p> <blockquote><p> * Заметки: <br> 1. Если ключ восстановления Bitlocker или пароль не принимаются при запуске системы, попробуйте разблокировать и расшифровать жесткий диск на другом компьютере с Windows 10 или попробуйте: <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-recovery-environment-winre/\" target=\"_blank\" rel=\"nofollow noopener\"> Разблокируйте и расшифруйте защищенный диск в среде восстановления Windows (WinRE). </a><br> 2. Если вы не можете разблокировать диск (например, если у вас нет ключа восстановления BitLocker или потому что ключ BitLocker не принят) и вы хотите удалить шифрование BitLocker, чтобы снова использовать защищенный диск, прочтите это руководство: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Как удалить защиту BitLocker с диска без ключа восстановления BitLocker или пароля </a> . </p></blockquote> <p><img src=\"images/image_thumb-53-752.png\" alt=\"How to Disable BitLocker in Windows 10 GUI - PowerShell\" loading=\"lazy\"></p> <p> </p> <p> После загрузки Windows следуйте приведенным ниже инструкциям, чтобы отключить защиту Bitlocker и расшифровать диск. </p> <h4> Как отключить защиту BitLocker и расшифровать зашифрованный диск BitLocker в Windows 10. </h4> <p> Чтобы отключить защиту Bitlocker, у вас должен быть пароль Bitlocker или ключ восстановления Bitlocker, чтобы сначала разблокировать диск, а затем расшифровать диск. </p> <p> Ключ восстановления Bitlocker представляет собой 48-значный цифровой ключ, который можно найти в следующих местах: </p> <ul> <li> На распечатке, которую вы сохранили, когда включили Bitlocker. </li> <li> На USB-накопителе, который вы использовали во время активации Bitlocker, чтобы сохранить ключ восстановления Bitlocker. </li> <li> На <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Ключи восстановления учетной записи Microsoft </a> , используя учетную запись MS, которую вы используете для входа на свое устройство, или добавили на устройство, чтобы загружать приложения из Microsoft Store или активировать MS Office или для электронной почты. </li> <li> На ваше <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Учетная запись Azure </a> для рабочих ПК, которые войдут в систему с учетной записью Azure Active Directory. </li> </ul> <p> Как только вы найдете ключ восстановления Bitlocker или пароль Bitlocker, перейдите к разблокировке зашифрованного диска Bitlocker и удалению шифрования Bitlocker одним из следующих способов: </p> <ul> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Метод 1. Отключите защиту BitLocker из графического интерфейса Windows. </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Метод 2. Отключите BitLocker и расшифруйте зашифрованный диск BitLocker из PowerShell. </a></li> </ul> <p> </p> <h6> Метод 1. Как отключить защиту Bitlocker в графическом интерфейсе Windows 10. </h6> <p> Чтобы отключить защиту на системном диске C: </p> <p> 1. Перейдите в Windows. <strong> Панель управления </strong> -&gt; <strong> Система и безопасность </strong> а затем щелкните <strong> Шифрование диска Bit Locker </strong> . </p> <p><img src=\"images/image_thumb-33-233.png\" alt=\"How to turn off or Turn Onn BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Рядом с диском операционной системы C: нажмите <strong> Отключить BitLocker </strong> . * </p> <p> * Заметки: <br> 1. Если параметр «Отключить BitLocker» недоступен, откройте <strong> командная строка от имени администратора </strong> и дайте следующую команду: </p> <ul> <li> управление-bde -off C: </li> </ul> <p> 2. Чтобы увидеть статус (прогресс) дешифрования диска C :, введите следующую команду: </p> <ul> <li> управление-bde -status C: </li> </ul> <p> </p> <p> </p> <p><img src=\"images/image_thumb-43-236.png\" alt=\"turn off bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. После выключения Bitlocker щелкните значок Bitlocker на панели задач, чтобы просмотреть процесс дешифрования. </p> <p><img src=\"images/image_thumb-41-694.png\" alt=\"remove bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Чтобы отключить защиту на любом другом диске, защищенном BitLocker, из графического интерфейса Windows: </p> <p> 1. Откройте проводник Windows и дважды щелкните заблокированный диск. <br> 2. Введите пароль Bitlocker или щелкните <strong> Больше опций </strong> ввести ключ восстановления Bitlocker, чтобы разблокировать диск. </p> <p><img src=\"images/image_thumb-47-646.png\" alt=\"unlock bitlocker windows 10\" loading=\"lazy\"></p> <p> 2. После разблокировки диска перейдите к <strong> Панель управления </strong> -&gt; <strong> Система и безопасность </strong> -&gt; <strong> Шифрование диска Bit Locker </strong> и после выбора диска нажмите <strong> Отключить BitLocker </strong> расшифровать диск. (см. скриншоты выше) </p> <p> </p> <h6> Метод 2. Как отключить защиту BitLocker и расшифровать зашифрованный диск BitLocker из PowerShell в Windows 10. </h6> <p> 1. Откройте PowerShell от имени администратора. Для этого: </p> <ol> <li> <ol> <li> В <strong> Кортана </strong> Поле поиска, введите <strong> Powershell </strong></li> <li> Щелкните правой кнопкой мыши на <strong> Windows PowerShell </strong> результат и выберите <strong> Запустить от имени администратора. </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb_thumb-1-316.png\" alt=\"disable bitlocker powershell windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Затем проверьте состояние шифрования каждого диска на вашем компьютере, набрав эту команду: </p> <ul> <li><strong> управление-bde -status </strong></li> </ul> <p> </p> <p> 3. Обратите внимание на букву диска, отображаемую в статусе блокировки. <strong> Заблокировано </strong> , а затем перейдите к разблокировке этого диска, набрав эту команду: * </p> <ul> <li><strong> manage-bde -unlock буква-диска: -rp ключ-восстановления BitLocker </strong></li> </ul> <p> * например: если вы хотите разблокировать диск «D:», а ключ восстановления битлокера: «123456-123456-123456-123456-123456-123456», введите: </p> <ul> <li> <ul> <li> manage-bde -unlock D: -rp 123456-123456-123456-123456-123456-123456 </li> </ul> </li> </ul> <p> </p> <p> * Примечание: если вы знаете пароль Bitlocker, введите эту команду: </p> <ul> <li><strong> manage-bde -unlock буква-диска: -pw BitLocker-Password </strong></li> </ul> <p> * например: если вы хотите разблокировать диск «D:» и пароль BitLocker: «123qwerty», введите: * </p> <ul> <li> <ul> <li> manage-bde -unlock D: -password 123qwerty </li> </ul> </li> </ul> <p> </p> <p> 4. Затем отключите шифрование Bitlocker и расшифруйте зашифрованный диск, используя одну из следующих команд: </p> <ul> <li><strong> Disable-BitLocker -MountPoint &quot;буква диска:&quot; </strong></li> <li><strong> manage-bde -off буква-диска: </strong></li> </ul> <p> * например: если вы хотите отключить шифрование битлокерами на диске &quot;D:&quot;, введите: </p> <ul> <li> <ul> <li> Отключить-BitLocker -MountPoint &quot;D:&quot; </li> </ul> </li> </ul> <blockquote> <p> ИЛИ введите… </p> </blockquote> <ul> <li> <ul> <li> manage-bde –off D: </li> </ul> </li> </ul> <p> 5. Когда процесс дешифрования будет завершен, перейдите к повторной проверке статуса шифрования, подав следующую команду: </p> <ul> <li><strong> управление-bde -status </strong></li> </ul> <p> 6. Если отображается &quot;Состояние блокировки&quot; <strong> Разблокирован </strong> и &quot;Статус конверсии&quot; показывает <strong> Полностью расшифрован, </strong> готово! </p> <p><img src=\"images/image_thumb-50-868.png\" alt=\"view bitlocker status\" loading=\"lazy\"></p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этой проблеме. </p>"}