{"title":"Как защитить свой компьютер с помощью BitLocker в Windows 10.","content":"<p> Это руководство содержит пошаговые инструкции о том, как защитить компьютер паролем с помощью шифрования BitLocker. BitLocker - это функция полного шифрования диска, включенная в выпуски Windows 10 Professional и Enterprise, и она может помочь вам защитить ваши личные данные от несанкционированного доступа. </p> <p> Представьте себе следующий сценарий: ваш личный ноутбук украден или потерян, а ваши личные данные доступны для нескромных глаз. Чтобы этого не произошло, прочтите это руководство и узнайте, как защитить паролем свой компьютер и ваши ценные данные с помощью надежного шифрования, чтобы никто не стал их использовать без пароля для дешифрования. </p> <ul> <li><strong> Связанная статья: <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Как защитить папку паролем. </a></strong></li> </ul> <h4> Как использовать BitLocker для шифрования и защиты ПК с Windows 10. </h4> <p> Чтобы защитить диск с операционной системой с помощью BitLocker в Windows 10 Pro или Enterprise: </p> <p> 1. Из Windows <strong> Панель управления </strong> нажмите <strong> Система и безопасность </strong> а затем щелкните <strong> Шифрование диска Bit Locker </strong> . </p> <p><img src=\"images/image_thumb-33-320.png\" alt=\"How to Protect your PC with BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Рядом с диском операционной системы C: нажмите <strong> Включите BitLocker </strong> . * </p> <p> * Примечание. Если после нажатия кнопки «Включить BitLocker» вы получаете сообщение об ошибке «Это устройство не может использовать доверенный платформенный модуль…», прочтите эту статью, чтобы устранить проблему. </p> <p><img src=\"images/image_thumb-34-100.png\" alt=\"turn on bitlocker operating system drive\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. На следующем экране выберите способ разблокировки диска при запуске. </p> <blockquote><p> 1. Если вы хотите разблокировать компьютер с помощью USB-устройства, щелкните <strong> Вставьте флешку. <br> </strong> 2. Если вы хотите разблокировать компьютер, введя пароль, нажмите <strong> введите пароль </strong> . (как в этом примере) </p></blockquote> <p><img src=\"images/image_thumb-35-212.png\" alt=\"enable bitlocker protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Теперь введите очень надежный пароль и нажмите <strong> Следующий </strong> . </p> <p><img src=\"images/image_thumb-36-435.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Теперь выберите, где вы хотите сохранить * ключ восстановления, и нажмите <strong> Следующий </strong> . * </p> <p> * Например: если вы входите в Windows 10 с учетной записью Microsoft, нажмите <strong> Сохраните в свою учетную запись Microsoft. </strong> Если вы входите в Windows 10 с локальной учетной записью, выберите один из других вариантов. </p> <p> Заметки: <br> 1. Если вы сохраните ключ восстановления BitLocker в своей учетной записи Microsoft, вы сможете просмотреть ключ после входа в <a title=\"https://onedrive.live.com/recoverykey.\" href=\"https://onedrive.live.com/recoverykey.\" target=\"_blank\" rel=\"nofollow noopener\"> https://onedrive.live.com/recoverykey. </a><br> 2. Я всегда предпочитаю хранить ключ восстановления на USB-накопителе, чтобы быть готовым к устранению проблем с BitLocker. </p> <p> </p> <p><img src=\"images/image_thumb-37-801.png\" alt=\"save bitlocker recovery key\" loading=\"lazy\"></p> <p> </p> <p> 6. На следующем экране оставьте настройку по умолчанию, если ваш компьютер и / или диск новые, а затем нажмите <strong> Следующий </strong> очередной раз. </p> <p><img src=\"images/image_thumb-38-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. В параметрах режима шифрования оставьте настройку по умолчанию и нажмите <strong> Следующий </strong> . </p> <p><img src=\"images/image_thumb-39-785.png\" alt=\"bitlocker encryption mode\" loading=\"lazy\"></p> <p> </p> <p> 8. На последнем экране нажмите <strong> Продолжать </strong> , чтобы перезапустить и проверить систему перед включением защиты BitLocker. </p> <p><img src=\"images/image_thumb-40-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. При перезапуске вам будет предложено ввести пароль BitLocker. Введите свой пароль и нажмите <strong> Входить </strong> . * </p> <p> * Примечание. Если BitLocker не может принять пароль или вы столкнулись с другими проблемами, попробуйте одно из следующих действий для входа в Windows: </p> <blockquote><p> 1. Нажмите клавишу ESC на экране пароля BitLocker, чтобы получить доступ к параметрам восстановления. <br> 2. После включения компьютера несколько раз нажмите клавишу ESC, чтобы обойти проверку BitLocker. </p></blockquote> <p> 10. Если тесты BitLocker прошли успешно, то после загрузки Windows 10 BitLocker начнет шифрование диска с операционной системой. Чтобы просмотреть состояние процесса шифрования, щелкните уведомление BitLocker на панели задач или перейдите в Панель управления&gt; Шифрование диска BitLocker. </p> <p><img src=\"images/image_thumb-41-171.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}