{"title":"Как сделать резервную копию личных файлов с историей файлов в Windows 10.","content":"<p> В этом руководстве я покажу вам, как настроить Windows 10 для автоматического создания копий и снимков ваших файлов с помощью инструмента резервного копирования истории файлов, чтобы иметь возможность восстановить их (при необходимости) с помощью функции «Восстановить предыдущие версии». характерная черта. </p> <p> Как вы, возможно, уже заметили, по умолчанию Windows 10 не сохраняет предыдущие версии ваших файлов или папок, как в Windows 7. Это происходит, потому что Windows 10 больше не использует службу теневого копирования тома для делать снимки ваших файлов, но вместо этого он использует только инструмент резервного копирования «История файлов». </p> <p> «История файлов» - отличный встроенный инструмент резервного копирования в Windows 10, который можно настроить для создания копий и моментальных снимков ваших файлов в другое место хранения, чем основной диск (например, на USB-накопитель, в сеть и т. Д.) . * </p> <p> * Примечание. Единственным ограничением инструмента «История файлов» является то, что вы не можете выбрать диск C: в качестве альтернативного места назначения резервной копии. если у вас нет дополнительного диска, доступного для резервного копирования, продолжайте читать это руководство, чтобы узнать, как обойти это ограничение ... </p> <ul> <li><strong> Связанная статья: </strong> <a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Как создавать теневые копии ваших файлов с помощью планировщика задач в Windows 10. </a></li> </ul> <h4> Как сделать резервную копию ваших личных файлов с помощью инструмента резервного копирования истории файлов в Windows 10. </h4> <p> 1. Как я уже упоминал выше, для резервного копирования файлов с помощью инструмента резервного копирования истории файлов вам необходимо иметь доступный накопитель, подключенный к вашему ПК (например, USB-накопитель) или сетевое расположение (например, другой компьютер в вашей сети) , или запоминающее устройство NAS). * </p> <p> * Примечание. Если у вас нет альтернативного запоминающего устройства, у вас есть следующие возможности: </p> <blockquote><p> А. К <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> уменьшить размер вашего основного диска C: \\ </a> и с доступным свободным пространством для создания нового диска для хранения резервной копии, или… </p> <p> Б. Чтобы сохранить резервную копию на основном диске C: \\. В этом случае создайте новую папку на диске C: и назовите ее «FileHistory» (или как хотите) и продолжайте дальше… </p></blockquote> <p> 2. Перейдите в Windows. <strong> Панель управления </strong> и под <strong> Система и безопасность, </strong> щелкнуть <strong> Сохранить резервную копию </strong><strong> копии ваших файлов с историей файлов. </strong></p> <p><img src=\"images/image_thumb-42-924.png\" alt=\"How to Backup & Keep Previous Versions of Files in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 3. Теперь, в зависимости от вашего случая, выполните следующие действия: </p> <ul> <li><strong> Дело А. </strong> Если у вас есть доступный диск для резервного копирования, то: </li> </ul> <blockquote><p> а. Щелкните значок <strong> Включать </strong> кнопку на экране, чтобы включить «Историю файлов». <br> б. Продолжать <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> шаг-4 </a> ниже, чтобы настроить параметры резервного копирования «История файлов». </p></blockquote> <p><img src=\"images/image_thumb-44-788.png\" alt=\"Turn On File History Windows 10\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Случай B: </strong> Если у вас нет доступного диска для резервного копирования истории файлов или если вы хотите сохранить резервную копию в сети, тогда: </li> </ul> <blockquote><p> а. Нажмите <strong> Выберите сетевое расположение. </strong></p></blockquote> <p><img src=\"images/image_thumb-56-796.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> б. На следующем экране: </p> <p> 1. Если вы хотите сохранить резервную копию в сети, введите полный сетевой путь к хранилищу резервных копий и нажмите <strong> Выберите папку </strong> . </p> <p> 2. Если вы хотите сохранить резервную копию на основном диске C: \\, введите полный сетевой путь к локальной папке резервных копий на диске C: \\ в следующей форме: * </p> <ul> <li> <strong> \\\\ Имя-компьютера \\ C $ \\ FileHistory </strong></li> </ul> <p> * Заметки: <br> 1. Замените значение «Computer-Name» на имя вашего ПК. (Чтобы узнать имя вашего компьютера, щелкните правой кнопкой мыши значок «Этот компьютер» в проводнике Windows). <br> 2. Помните, что сохранение резервной копии ваших личных файлов на том же диске, где они уже были <strong> не надежное решение </strong> . На всякий случай всегда сохраняйте резервную копию на другом устройстве хранения. </p></blockquote> <p> например: если имя компьютера «Пегас», введите: «\\\\ Пегас \\ C $ \\ FileHistory» </p> <p><img src=\"images/image_thumb-53-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> c. На следующем экране щелкните <strong> ОК </strong> . </p></blockquote> <p><img src=\"images/image_thumb-54-349.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> d. Теперь нажмите кнопку <strong> Включать </strong> Нажмите кнопку, чтобы включить инструмент резервного копирования истории файлов, а затем продолжите настройку параметров резервного копирования, описанную ниже. </p></blockquote> <p><img src=\"images/image_thumb-48-620.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Чтобы настроить параметры резервного копирования «История файлов», нажмите <strong> Расширенные настройки </strong> налево. </p> <p><img src=\"images/image_thumb-49-919.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4а. Тогда в <strong> Расширенные настройки </strong> параметры, установите, как часто делать резервные копии ваших файлов и как долго хранить сохраненные версии. Когда закончите, нажмите <strong> Сохранить изменения </strong> . </p> <p><img src=\"images/image_thumb-61-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Наконец нажмите <strong> Беги сейчас </strong> сделать первую резервную копию. * </p> <p><img src=\"images/image_thumb-55-463.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Дополнительная справка - Примечания: <br> 1. По умолчанию «История файлов» создает резервную копию папок «Библиотеки» (рабочий стол, документы, избранное, музыка, OneDrive, изображения и видео). Если вы хотите исключить одну из этих папок из резервной копии, включить другие папки или просмотреть все параметры резервного копирования истории файлов, перейдите к: </p> <ul> <li> <p><strong> Настройки <img src=\"images/image_thumb-58-467.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Обновление и безопасность </strong> &gt; <strong> Резервное копирование </strong> &gt; <strong> Больше опций. </strong></p> </li> </ul> <p><img src=\"images/image_thumb-57-938.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Чтобы восстановить файлы из резервной копии «История файлов», перейдите в одно из следующих мест: </p> <ul> <li><strong> Панель управления </strong> &gt; <strong> История файлов </strong> &gt; <strong> Восстановить личные файлы. </strong></li> <li><strong> Настройки <img src=\"images/image_thumb-59-275.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Обновление и безопасность </strong> &gt; <strong> Резервное копирование </strong> &gt; <strong> Больше опций </strong> &gt; <strong> Восстановить файлы из текущей резервной копии. </strong></li> </ul> <p> 3. Чтобы выборочно восстановить файл или папку до предыдущей версии, щелкните файл (или папку) правой кнопкой мыши и выберите <strong> Восстановить предыдущие версии </strong> . </p> <p><img src=\"images/image_thumb-60-867.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Это все! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}