{"title":"Как скрыть или показать полосы прокрутки в меню «Пуск», настройках или приложениях Windows 10.","content":"<p> Как вы могли заметить, в Windows 10 при запуске меню «Пуск», приложения «Настройки» или при работе в приложении «Магазин» полоса прокрутки по умолчанию невидима и появляется только при перемещении курсора в правую часть открытого окна. окно. Такое поведение немного раздражало, и, к счастью, Microsoft в последнем обновлении функций Windows 10 1803 (апрель 2018 г.) добавила возможность всегда отображать полосу прокрутки во всех открытых окнах (например, в меню «Пуск» в приложении «Настройки» и т. Д.). . </p> <p><img src=\"images/image_thumb-446.png\" alt=\"Show Scroll Bar in Windows 10 \" loading=\"lazy\"></p> <p> В этом руководстве содержатся инструкции о том, как всегда скрывать или отображать полосы прокрутки во всех открытых окнах и приложениях в Windows 10 v1803 (или более поздней версии). </p> <h4> Как показать или скрыть полосу прокрутки в меню «Пуск», настройках или приложениях Windows 10. </h4> <p> 1. Из <strong> Начинать </strong> <img src=\"images/image_thumb-38-810.png\" alt=\"image\" loading=\"lazy\"> меню выбрать <strong> Настройки </strong> <img src=\"images/image_thumb-44-476.png\" alt=\"image\" loading=\"lazy\"> . </p> <p> 2. Открыть <strong> Легкий доступ </strong> настройки. </p> <p><img src=\"images/image_thumb-1-268.png\" alt=\"display scroll bar windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Нажмите «Экран» слева, а затем «перетащите» <strong> Автоматически скрывать полосы прокрутки в Windows </strong> переключить на <strong> Выключенный. </strong></p> <p><img src=\"images/image_thumb-3-742.png\" alt=\"always show scroll bars windows 10\" loading=\"lazy\"></p> <p> </p> <p> Вот и все, ребята! Это сработало для вас? <br> Пожалуйста, оставьте комментарий в разделе комментариев ниже или даже лучше: поставьте лайк и поделитесь этим сообщением блога в социальных сетях, чтобы помочь распространить информацию об этом решении. </p>"}