{"title":"การแก้ไข: Adobe Reader DC – บันทึกเป็นว่างเปล่า (แก้ไขแล้ว)","content":"<p> หลังจากการอัปเดตอัตโนมัติของ Adobe Reader DC ปัญหาต่อไปนี้เกิดขึ้น: คุณลักษณะ &quot;บันทึกเป็น&quot; แสดงหน้าต่างว่าง (ว่าง) (ว่าง) ที่ไม่อนุญาตให้ผู้ใช้บันทึกเอกสาร PDF </p> <p><img src=\"images/image_thumb-38-290.png\" alt=\"Adobe Reader DC - Save As is blank - fix\" loading=\"lazy\"></p> <p> บทช่วยสอนนี้มีคำแนะนำในการแก้ไขปัญหาต่อไปนี้: คุณลักษณะ &quot;บันทึกเป็น&quot; ไม่ทำงานใน Adobe Reader DC ใน Windows หรือ MAC OS </p> <h4> วิธีแก้ไข: บันทึกเป็นว่างเปล่าใน Adobe Reader DC </h4> <h6> วิธีที่ 1. สแกนระบบของคุณเพื่อหาไวรัสและมัลแวร์ </h6> <p> ขั้นตอนแรกในการแก้ไขปัญหา &quot;โฟลเดอร์ที่หายไป&quot; ใน Outlook คือการทำให้แน่ใจว่าระบบของคุณไม่มีไวรัส/มัลแวร์ สำหรับงานนั้น ให้ทำตามคำแนะนำในคู่มือนี้: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีการสแกนคอมพิวเตอร์ของคุณเพื่อหาไวรัสและโปรแกรมที่เป็นอันตรายอื่นๆ </a></p> <p> </p> <h6> วิธีที่ 2 ปิดใช้งานที่เก็บข้อมูลออนไลน์เมื่อบันทึกไฟล์ </h6> <p> 1. จาก Adobe Reader DC <strong> แก้ไข </strong> เมนู คลิก <strong> การตั้งค่า </strong> . </p> <p><img src=\"images/image_thumb-39-749.png\" alt=\"save as not working fix in Adobe Reader DC\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> ยกเลิกการเลือก </strong> <strong> แสดงที่เก็บข้อมูลออนไลน์เมื่อบันทึกไฟล์ </strong> และคลิก <strong> ตกลง. * </strong></p> <p> * หมายเหตุ: หรือยกเลิกการเลือกคุณลักษณะ &quot;แสดงที่เก็บข้อมูลออนไลน์เมื่อเปิดไฟล์&quot; ด้วย </p> <p><img src=\"images/image_thumb-40-312.png\" alt=\"save as blank - abobe reader DC - fix\" loading=\"lazy\"></p> <p> </p> <p> 3. ตอนนี้ลองใช้คุณสมบัติบันทึกเป็นใน Adobe DC ปัญหาจะต้องได้รับการแก้ไข </p> <p> </p> <h6> วิธีที่ 3 ถอนการติดตั้งและติดตั้ง Adobe Reader DC ใหม่ </h6> <p> วิธีสุดท้ายในการแก้ไขหน้าต่างว่างในคุณสมบัติ &quot;บันทึกเป็น&quot; ใน Adobe DC คือการถอนการติดตั้ง Adobe Reader DC อย่างสมบูรณ์ จากนั้นให้ดาวน์โหลดและติดตั้งโปรแกรมเวอร์ชันล่าสุดใหม่จาก <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> ที่นี่ </a> . </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแบ่งปันโพสต์บล็อกนี้ในเครือข่ายสังคมออนไลน์เพื่อช่วยกระจายคำเกี่ยวกับเรื่องนี้ </p>"}