{"title":"การแก้ไข: เซิร์ฟเวอร์ไม่สามารถเข้าถึงได้ คุณอาจไม่ได้รับอนุญาตให้ใช้ทรัพยากรเครือข่ายนี้ แฮนเดิลไม่ถูกต้อง (แก้ไขแล้ว)","content":"<p> บทช่วยสอนนี้มีคำแนะนำในการแก้ไขข้อผิดพลาดต่อไปนี้เมื่อพยายามเข้าถึงโฟลเดอร์ที่ใช้ร่วมกันบนเครือข่าย: &quot;ไม่สามารถเข้าถึงเซิร์ฟเวอร์ คุณอาจไม่ได้รับอนุญาตให้ใช้ทรัพยากรเครือข่ายนี้ ติดต่อผู้ดูแลระบบของเซิร์ฟเวอร์นี้เพื่อดูว่าคุณมีสิทธิ์เข้าถึงหรือไม่ สิทธิ์ แฮนเดิลไม่ถูกต้อง&quot; </p> <p><img src=\"images/image_thumb-5-437.png\" alt=\"You might not have permission to use this network resource\" loading=\"lazy\"></p> <p> </p> <h2> วิธีแก้ไข: ไม่สามารถเข้าถึงโฟลเดอร์ที่ใช้ร่วมกันได้ คุณอาจไม่ได้รับอนุญาตให้ใช้ทรัพยากรเครือข่ายนี้ แฮนเดิลไม่ถูกต้อง </h2> <p> โดยปกติ ปัญหาการเชื่อมต่อการแชร์ไฟล์ &quot;คุณอาจไม่มีสิทธิ์ใช้ทรัพยากรเครือข่ายนี้&quot; จะปรากฏขึ้นเมื่อผู้ใช้พยายามเข้าถึงโฟลเดอร์แชร์บนเครือข่าย โดยไม่ต้องมีสิทธิ์ที่จำเป็น ในกรณีนี้และเพื่อแก้ไขปัญหา คุณต้องแน่ใจว่าผู้ใช้มีสิทธิ์การเข้าถึงที่เหมาะสมในโฟลเดอร์ที่ใช้ร่วมกัน </p> <p> อย่างไรก็ตาม หากคุณรู้ว่าสิทธิ์ของผู้ใช้ในโฟลเดอร์ที่ใช้ร่วมกันนั้นถูกต้อง และปัญหาการเชื่อมต่อ &quot;คุณอาจไม่ได้รับอนุญาตให้ใช้ทรัพยากรเครือข่ายนี้&quot; ปรากฏขึ้นโดยฉับพลันและไม่มีเหตุผลที่ชัดเจน แสดงว่าปัญหาอาจเกิดจากการติดตั้ง Windows อัพเดท. ในกรณีนี้ โปรดอ่านด้านล่างเพื่อแก้ไขปัญหา </p> <p> * หมายเหตุ: หากคุณพบข้อผิดพลาดในการแชร์ในช่วงกลางเดือนมกราคม 2019 ผู้ร้ายคือ Windows Security Update ต่อไปนี้: <a href=\"https://support.microsoft.com/el-gr/help/4480970/windows-7-update-kb4480970\" target=\"_blank\" rel=\"nofollow noopener\"> 8 มกราคม 2019—KB4480970 (ชุดรวมรายเดือน) </a> . </p> <h6> วิธีที่ 1 ถอนการติดตั้ง Windows Update ล่าสุด </h6> <p> บนเครื่องที่มีโฟลเดอร์ที่ใช้ร่วมกัน: </p> <p> 1. คลิกขวาที่ไอคอน &#39;My Computer&#39; แล้วเลือก <strong> คุณสมบัติ </strong> . <br> 2. คลิก <strong> Windows Update </strong> . </p> <p><img src=\"images/image_thumb-6-686.png\" alt=\"fix Network Shared Folder is Not Accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. คลิก <strong> อัพเดทที่ติดตั้ง </strong> . </p> <p><img src=\"images/image_thumb-7-999.png\" alt=\"fix cannot access shared folder\" loading=\"lazy\"></p> <p> </p> <p> 4. จัดเรียงการอัปเดตตามวันที่ติดตั้งโดยคลิก <strong> ติดตั้งเมื่อ </strong></p> <p><img src=\"images/image_thumb-8-158.png\" alt=\"uninstall windows update\" loading=\"lazy\"></p> <p> </p> <p> 5. ไฮไลต์การอัปเดตที่ติดตั้งล่าสุดสำหรับ Windows แล้วคลิก <strong> ถอนการติดตั้ง </strong> * </p> <p> * เช่น. หากคุณพบข้อผิดพลาดในการแชร์ในช่วงกลางเดือนมกราคม 2019 ให้ดำเนินการต่อและถอนการติดตั้ง &quot;การอัปเดตความปลอดภัยสำหรับ Microsoft Windows KB4480970&quot; </p> <p><img src=\"images/image_thumb-9-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. เมื่อการติดตั้งเสร็จสิ้น <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์. <br> 7. หลังจากรีสตาร์ทแล้ว ให้ลองอีกครั้งเพื่อเข้าถึงโฟลเดอร์ที่ใช้ร่วมกันจากเครื่องไคลเอนต์ จากนั้นใช้การดำเนินการที่แนะนำตามกรณีของคุณ: </p> <ul> <li><strong> กรณี ก: </strong> หากปัญหายังคงอยู่ ให้ดำเนินการถอนการติดตั้งโปรแกรมปรับปรุงที่ติดตั้งล่าสุดทั้งหมดหรือดำเนินการต่อใน <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีที่ 2 </a> ด้านล่าง </li> <li><strong> กรณี ข: </strong> หากปัญหาได้รับการแก้ไข ให้ป้องกันไม่ให้มีการติดตั้งการอัปเดตที่ลบออกไปในอนาคต ในการทำเช่นนั้น: </li> </ul> <blockquote><p> 1. ไปที่ Windows Update และ <strong> ตรวจสอบสำหรับการอัพเดต </strong> . <br> 2. คลิกที่ <strong> การอัปเดตที่สำคัญ </strong> . </p></blockquote> <p><img src=\"images/image_thumb-22-393.png\" alt=\"view important updates\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 3. คลิกขวาที่การอัปเดตที่มีปัญหาและคลิก <strong> ซ่อนการอัปเดต </strong> . <br> 4. สุดท้ายคลิก <strong> ตกลง </strong> แล้วปิด Windows Update </p></blockquote> <p><img src=\"images/image_thumb-23-795.png\" alt=\"hide update windows 7\" loading=\"lazy\"></p> <h6> วิธีที่ 2 คืนค่าพีซีของคุณเป็นสถานะการทำงานก่อนหน้า </h6> <p> บนเครื่องที่มีโฟลเดอร์ที่ใช้ร่วมกัน: </p> <p> 1. กด Windows <img src=\"images/image_thumb8_thumb-632.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> ปุ่มเพื่อเปิดกล่องคำสั่งเรียกใช้ <br> 2. พิมพ์ <strong> rstrui </strong> &amp; คลิก <strong> ตกลง </strong> เพื่อเปิดการคืนค่าระบบ </p> <p><img src=\"images/rstui-1-300x148-611.png\" alt=\"rstui\" loading=\"lazy\"></p> <p> </p> <p> 3. คลิก <strong> ต่อไป </strong> ที่หน้าจอแรก <br> 4. เลือกสถานะการทำงานก่อนหน้า (วันที่/เวลา) แล้วคลิก <strong> ต่อไป </strong> เพื่อเริ่มกระบวนการกู้คืน </p> <p><img src=\"images/image_thumb-50-355.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. หลังจากกู้คืนระบบแล้ว ให้ลองอีกครั้งเพื่อเข้าถึงโฟลเดอร์ที่ใช้ร่วมกันจากเครื่องไคลเอนต์ </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแบ่งปันโพสต์บล็อกนี้ในเครือข่ายสังคมออนไลน์เพื่อช่วยกระจายคำเกี่ยวกับปัญหานี้ </p>"}