{"title":"การแก้ไข: ไม่สามารถเชื่อมต่อกับการแชร์ไฟล์ได้เนื่องจากไม่ปลอดภัยและต้องใช้โปรโตคอล SMB1 ที่ล้าสมัย (แก้ไขแล้ว)","content":"<p> หากคุณพยายามเชื่อมต่อกับโฟลเดอร์แชร์เครือข่ายจากพีซีที่ใช้ Windows 10 และคุณได้รับข้อผิดพลาด &quot;คุณไม่สามารถเชื่อมต่อกับการแชร์ไฟล์ได้เนื่องจากไม่ปลอดภัย การแชร์นี้ต้องใช้โปรโตคอล SMB1 ที่ล้าสมัย ซึ่งไม่ปลอดภัยและอาจเปิดเผยได้ ระบบของคุณที่จะโจมตี ระบบของคุณต้องใช้ SMB2 หรือสูงกว่า สำหรับข้อมูลเพิ่มเติมเกี่ยวกับการแก้ไขปัญหานี้ โปรดดูที่ https://go.microsoft.com/fwlink/?linkid=852747&quot; จากนั้นดำเนินการต่อด้านล่างเพื่อแก้ไขปัญหา </p> <p><img src=\"images/image_thumb-30-812.png\" alt=\"You can't connect to the file share because it's not secure. This share requires the obsolete SMB1 protocol, which is unsafe...\" loading=\"lazy\"></p> <p> ใน Windows 10 v1709 และเวอร์ชันที่ใหม่กว่า โปรโตคอลเครือข่าย Server Message Block เวอร์ชัน 1 (SMBv1) จะไม่ถูกติดตั้งโดยค่าเริ่มต้น และต้องเปิดใช้งานด้วยตนเองหากคุณต้องการเข้าถึงโฟลเดอร์ที่ใช้ร่วมกันบนเวิร์กสเตชันหรือเซิร์ฟเวอร์ที่ใช้โปรโตคอล SMBv1 สำหรับ การแชร์ไฟล์. </p> <p> บทช่วยสอนนี้มีคำแนะนำในการแก้ไขข้อผิดพลาดต่อไปนี้เมื่อพยายามเชื่อมต่อกับโฟลเดอร์ที่ใช้ร่วมกันใน Windows 10: </p> <ul> <li> <p><em> คุณไม่สามารถเชื่อมต่อกับการแชร์ไฟล์ได้เนื่องจากไม่ปลอดภัย การแชร์นี้ต้องใช้โปรโตคอล SMB1 ที่ล้าสมัย ซึ่งไม่ปลอดภัย... </em></p> </li> <li> <p><em> ไม่มีชื่อเครือข่ายที่ระบุอีกต่อไป </em></p> </li> <li> <p><em> ข้อผิดพลาดที่ไม่ระบุ 0x80004005 </em></p> </li> <li> <p><em> เซิร์ฟเวอร์ที่ระบุไม่สามารถดำเนินการตามที่ร้องขอได้ </em></p> </li> </ul> <h4> วิธีแก้ไข: ไม่สามารถเชื่อมต่อกับการแชร์ไฟล์ได้เนื่องจากไม่มีโปรโตคอล SMBv1 (Windows 10) </h4> <p> 1. ไปที่ <strong> แผงควบคุม </strong> -&gt; <strong> โปรแกรมและคุณสมบัติ </strong> . <br> 2. คลิก <strong> เปิดหรือปิดคุณสมบัติ Windows Windows </strong> จากด้านซ้าย </p> <p> </p> <p><img src=\"images/image_thumb-68-359.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. ขยายตัวเลือก &#39;SMB 1.0/CIFS File Sharing Support&#39; และ <strong> ตรวจสอบ </strong> <strong> ลูกค้า SMB 1.0/CIFS </strong> ตัวเลือก คลิก <strong> ตกลง </strong> เมื่อทำเสร็จแล้ว. </p> <p><img src=\"images/image_thumb-29-360.png\" alt=\"Install SMBv1 Windows 10\" loading=\"lazy\"></p> <p> 4. เมื่อติดตั้ง SMB 1.0/CIFS แล้ว ให้คลิกที่ <strong> เริ่มต้นใหม่เดี๋ยวนี้ </strong> ปุ่มเพื่อรีบูทพีซีของคุณ </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}