{"title":"การแก้ไข: HDMI ไม่มีเสียงไปยังทีวีหรือ HDMI ไม่แสดงในอุปกรณ์เล่น (แก้ไขแล้ว)","content":"<p> หากคุณเชื่อมต่อทีวีกับแล็ปท็อปโดยใช้สาย HDMI และไม่มีเสียงออกขณะเล่นวิดีโอ หรือ HDMI ไม่แสดงเป็นอุปกรณ์การเล่น ให้อ่านบทแนะนำนี้ต่อ </p> <p> รายละเอียดปัญหา: ในแล็ปท็อปที่ใช้ Windows 10 อุปกรณ์เอาต์พุตดิจิทัล (HDMI) จะไม่อยู่ในรายการเป็นอุปกรณ์เล่นภาพ และไม่มีเอาต์พุตเสียงเมื่อเชื่อมต่อกับทีวีด้วยสาย HDMI </p> <p> ปัญหา &quot;ไม่มีเสียงออกจาก HDMI&quot; ใน Windows 10 อาจปรากฏขึ้นจากหลายสาเหตุ ดังนั้นในคู่มือนี้ คุณจะพบคำแนะนำทีละขั้นตอนในการแก้ไขปัญหา </p> <h2> วิธีแก้ไข: ไม่มีเสียงออกจาก HDMI &amp; HDMI ไม่แสดงในอุปกรณ์เล่นใน Windows 10* </h2> <p> * คำแนะนำ: ก่อนดำเนินการตามขั้นตอนด้านล่าง: </p> <ul> <li><strong> คลิกขวา </strong> ที่ <strong> ไอคอนเสียง </strong><img src=\"images/image_thumb-11-109.png\" alt=\"image\" loading=\"lazy\"> บนทาสก์บาร์ไปยัง <strong> เปิดเครื่องผสมเสียง </strong> และรับรองว่า <strong> อุปกรณ์เอาท์พุตดิจิตอล </strong> ไม่ได้ปิดเสียง </li> <li> ตรวจสอบให้แน่ใจว่าเชื่อมต่อสาย HDMI อย่างถูกต้องทั้งบนแล็ปท็อปและทีวี </li> <li> หลังจากต่อสาย HDMI แล้ว <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณ. </li> <li> ในทีวี ให้ตั้งค่าพอร์ต HDMI ที่ถูกต้องเป็นอุปกรณ์อินพุตวิดีโอ </li> <li> หากเป็นแล็ปท็อปของคุณเอง ให้ปิดฝาหรือกดปุ่มเปิด/ปิดหนึ่งครั้งเพื่อให้แล็ปท็อปเข้าสู่โหมดสลีป จากนั้นกดปุ่มเปิดปิดอีกครั้งและตรวจสอบเสียงจาก HDMI อีกครั้ง </li> <li> ตรวจสอบว่าปัญหายังคงมีอยู่หรือไม่ โดยใช้สาย HDMI อื่น </li> </ul> <p> </p> <h3> ขั้นตอนที่ 1. ตั้งค่า HDMI เป็นอุปกรณ์เล่นเริ่มต้น </h3> <p> ขั้นตอนแรกในการแก้ไขปัญหา HDMI Audio ใน Windows 10 คือการตั้งค่า HDMI เป็นอุปกรณ์เสียงเริ่มต้น </p> <p> 1. ไปที่ Windows <strong> แผงควบคุม </strong> และเปิด <strong> เสียง. </strong></p> <p><img src=\"images/image_thumb-14-686.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. ตรวจสอบให้แน่ใจว่า <strong> ดิจิตอลเอาท์พุต </strong> (HDMI) คือ <strong> ค่าเริ่มต้น </strong> อุปกรณ์เล่น มิฉะนั้น เลือก <strong> ดิจิตอลเอาท์พุต </strong> อุปกรณ์และคลิก <strong> ตั้งค่าเริ่มต้น </strong> ปุ่ม. เมื่อเสร็จแล้ว ให้เล่นวิดีโอเพื่อทดสอบเสียง HDMI และหากปัญหายังคงอยู่ ให้เข้าสู่ขั้นตอนต่อไป * </p> <p><img src=\"images/image_thumb-43-106.png\" alt=\"FIX: HDMI No Sound Output \" loading=\"lazy\"></p> <p> </p> <p> * หมายเหตุ: ลองทำสิ่งต่อไปนี้ตามกรณีของคุณ: </p> <p> 1. ถ้า <strong> ดิจิตอลเอาท์พุต </strong> อุปกรณ์คือ <strong> พิการ </strong> , คลิกขวาที่มันแล้วคลิก <strong> เปิดใช้งาน </strong> . จากนั้นไฮไลท์แล้วกด <strong> ตั้งค่าเริ่มต้น </strong> . </p> <p><img src=\"images/image_thumb-44-233.png\" alt=\"FIX: HDMI Not Listed in Playback devices \" loading=\"lazy\"></p> <p> 2. หากอุปกรณ์เอาท์พุตดิจิตอลไม่แสดงเป็นอุปกรณ์เล่น: </p> <blockquote><p> ก. คลิกขวาที่พื้นที่ว่างและตรวจสอบให้แน่ใจว่าทั้ง both <strong> แสดงอุปกรณ์ที่ปิดใช้งาน </strong> และ <strong> แสดงอุปกรณ์ที่ถูกตัดการเชื่อมต่อ </strong> เลือกตัวเลือกแล้ว (ตรวจสอบ) หากไม่ได้เลือกตัวเลือกใด ๆ ข้างต้น ให้คลิกที่ตัวเลือกนั้นเพื่อเลือก </p></blockquote> <p><img src=\"images/image_thumb-45-410.png\" alt=\"Enable HDMI DIgital Output\" loading=\"lazy\"></p> <blockquote><p> ข. จากนั้นคลิกขวาที่อุปกรณ์ Digital Output แล้วเลือก <strong> เปิดใช้งาน <br> ค. </strong> เมื่อเสร็จแล้วให้ตั้งเป็น <strong> ค่าเริ่มต้น </strong> <strong> ดิจิตอลเอาท์พุต </strong> อุปกรณ์ </p> </blockquote> <h3><br clear=\"all\"> ขั้นตอนที่ 2 ย้อนกลับไดรเวอร์การ์ดเสียง </h3> <p> ในบางกรณี ปัญหา &quot;HDMI no sound to TV&quot; อาจปรากฏขึ้นหลังจากการอัพเดตไดรเวอร์อัตโนมัติ ดังนั้นให้ดำเนินการต่อและย้อนกลับไดรเวอร์เสียง </p> <p> 1. เปิด <strong> ตัวจัดการอุปกรณ์ </strong> . ในการทำเช่นนั้น: </p> <blockquote><p> 1. กด Windows <img src=\"images/image_thumb8_thumb_thumb-781.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> ปุ่มเพื่อเปิดกล่องคำสั่งเรียกใช้ <br> 2. ในกล่อง &quot;เปิด&quot; พิมพ์: <strong> devmgmt.msc </strong> &amp; คลิก <strong> ตกลง </strong> . </p> <p><img src=\"images/image_thumb-5-389.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> ขยาย </strong> <strong> ตัวควบคุมเสียง วิดีโอ และเกม <br> 3. คลิกขวา </strong> บน <strong> อุปกรณ์เสียงความละเอียดสูง </strong> และเลือก <strong> คุณสมบัติ. </strong></p> <p><img src=\"images/image_thumb-17-970.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. ที่แท็บไดรเวอร์ คลิก <strong> ไดร์เวอร์ย้อนกลับ </strong> ปุ่ม. <strong> * </strong></p> <p> * หมายเหตุ: หากปุ่ม Roll Back Driver ไม่ทำงาน ให้ทำตามขั้นตอนต่อไป </p> <p><img src=\"images/image_thumb-18-921.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> 5. เลือกเหตุผลในการย้อนกลับแพ็คเกจไดรเวอร์และคลิก <strong> ใช่. </strong></p> <p><img src=\"images/image_thumb-19-748.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. เมื่อการย้อนกลับของไดรเวอร์เสร็จสิ้น <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณ. <br> 5. หลังจากรีสตาร์ทแล้ว ให้ดำเนินการต่อและทดสอบเสียงจาก HDMI หากคุณยังไม่ได้ยินเสียงบนทีวี ให้ทำตามขั้นตอนต่อไป </p> <h3> ขั้นตอนที่ 3 เปลี่ยนไดรเวอร์การ์ดเสียง </h3> <p> การไม่มีเสียงมักเกิดจากไดรเวอร์การ์ดเสียงที่ไม่ถูกต้อง เพื่อแก้ไขปัญหานี้: </p> <p> 1. เปิด <strong> ตัวจัดการอุปกรณ์ </strong><br> 2. <strong> ขยาย </strong> <strong> ตัวควบคุมเสียง วิดีโอ และเกม <br> </strong> 3. <strong> คลิกขวา </strong> ที่ <strong> เสียงความละเอียดสูงของ Realtek </strong> อุปกรณ์และเลือก <strong> อัปเดตไดรเวอร์ <br> </strong></p> <p><img src=\"images/image_thumb-6-937.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. เลือก <strong> เรียกดูคอมพิวเตอร์ของฉันเพื่อหาไดรเวอร์ </strong></p> <p><img src=\"images/image_thumb-7-874.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. เลือก <strong> ให้ฉันเลือกจากรายการไดรเวอร์ที่มีอยู่ในคอมพิวเตอร์ของฉัน </strong> . </p> <p><img src=\"images/image_thumb-8-498.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. ในหน้าจอถัดไป ให้เลือก <strong> อุปกรณ์เสียงความละเอียดสูง </strong> และคลิก <strong> ต่อไป. </strong></p> <p><img src=\"images/image_thumb-20-756.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/07/image-10.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 8. เมื่อการติดตั้งไดรเวอร์เสร็จสิ้น <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณ. <br> 9. หลังจากรีสตาร์ทแล้ว ให้ดำเนินการต่อและทดสอบเสียงจากลำโพงของแล็ปท็อป </p> <h3> ขั้นตอนที่ 4 ถอนการติดตั้งและติดตั้งไดรเวอร์การ์ดเสียงใหม่ </h3> <p> 1. เปิด <strong> ตัวจัดการอุปกรณ์ </strong><br> 2. <strong> ขยาย </strong> <strong> ตัวควบคุมเสียง วิดีโอ และเกม <br> </strong> 3. <strong> คลิกขวา </strong> ที่ <strong> เสียงความละเอียดสูง </strong> อุปกรณ์และเลือก <strong> ถอนการติดตั้งอุปกรณ์ </strong></p> <p><img src=\"images/image_thumb-21-678.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. หลังจากถอนการติดตั้ง <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณ และให้ Windows ติดตั้งไดรเวอร์เสียงโดยอัตโนมัติ หากไม่เกิดขึ้น ให้ไปที่ <strong> การตั้งค่า </strong> &gt; <strong> อัปเดตและความปลอดภัย </strong> และบังคับ Windows to <strong> ตรวจสอบสำหรับการอัพเดต. </strong></p> <p> </p> <h3> ขั้นตอนที่ 5. ถอนการติดตั้งและติดตั้งการ์ดแสดงผลอีกครั้ง </h3> <p> 1. เปิด <strong> ตัวจัดการอุปกรณ์ <br> </strong> 2. <strong> ขยาย </strong> <strong> อะแดปเตอร์แสดงผล <br> </strong> 3. <strong> คลิกขวา </strong> บนการ์ดแสดงผลที่ติดตั้งและเลือก and <strong> ถอนการติดตั้งอุปกรณ์ </strong></p> <p><img src=\"images/image_thumb-46-871.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. หลังจากถอนการติดตั้ง <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณ และให้ Windows ติดตั้งไดรเวอร์การแสดงผลโดยอัตโนมัติ หากสิ่งนี้ไม่เกิดขึ้น หากคุณยังคงประสบปัญหา ให้ไปที่ไซต์สนับสนุนผู้ผลิตแล็ปท็อปของคุณและดาวน์โหลดไดรเวอร์การแสดงผลล่าสุดตามรุ่นแล็ปท็อปของคุณ </p> <p> นั่นคือทั้งหมดที่! วิธีใดที่เหมาะกับคุณ โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}