{"title":"การแก้ไข: ธันเดอร์เบิร์ดไม่ตอบสนองหรือค้าง (แก้ไขแล้ว)","content":"<p> หากธันเดอร์เบิร์ดไม่ตอบสนอง ให้ดำเนินการต่อด้านล่างเพื่อแก้ไขปัญหา ธันเดอร์เบิร์ดเป็นไคลเอนต์อีเมลโอเพ่นซอร์สยอดนิยมซึ่งใช้ได้กับทุกแพลตฟอร์ม แต่บางครั้งธันเดอร์เบิร์ดหยุดตอบสนองเลย หรือค้างประมาณ 4-5 นาทีก่อนจะใช้งานได้อีกครั้ง </p> <p><img src=\"images/image_thumb-18-762.png\" alt=\"Thunderbird is not responding or freezing - fix\" loading=\"lazy\"></p> <p> ธันเดอร์เบิร์ดอาจไม่ทำงานด้วยเหตุผลดังต่อไปนี้: </p> <ul> <li> โปรแกรมป้องกันไวรัสอาจป้องกันไม่ให้ธันเดอร์เบิร์ดเชื่อมต่ออินเทอร์เน็ต </li> <li> คุณลักษณะการค้นหาของ Windows ในข้อความของธันเดอร์เบิร์ดอาจทำให้ธันเดอร์เบิร์ดหยุดทำงาน </li> <li> การตั้งค่าหรือโปรแกรมเสริมของธันเดอร์เบิร์ดที่มีปัญหา </li> <li> ไฟล์การจัดทำดัชนีของธันเดอร์เบิร์ด (ไฟล์ MSF) อาจเสียหาย </li> </ul> <p> เนื่องจากธันเดอร์เบิร์ดอาจไม่ตอบสนองด้วยเหตุผลหลายประการ ในบทช่วยสอนนี้ เราจะแสดงให้คุณเห็นวิธีการทั้งหมดที่มีในการแก้ปัญหา </p> <h2> วิธีแก้ไข: Thunderbird ไม่ตอบสนองหรือค้างใน Windows 10 </h2> <h3> วิธีที่ 1. สแกนคอมพิวเตอร์ของคุณเพื่อหาไวรัส </h3> <p><strong> สำคัญ: </strong> ไวรัสหรือโปรแกรมที่เป็นอันตรายจำนวนมากอาจทำให้เกิดปัญหากับการอัปเดต Windows ดังนั้นก่อนที่คุณจะดำเนินการตามขั้นตอนการแก้ไขปัญหาด้านล่าง ให้ใช้สิ่งนี้ <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> คู่มือการสแกนและกำจัดมัลแวร์ </a> เพื่อตรวจสอบและลบไวรัสหรือ/และโปรแกรมที่เป็นอันตรายที่อาจทำงานบนคอมพิวเตอร์ของคุณ </p> <h3></h3> <h3> วิธีที่ 2 ปิดใช้งาน Windows Search ในข้อความ Thunderbird </h3> <p> 1. จากเมนูของ Thunderbird ให้เลือก <strong> เครื่องมือ </strong> &gt; <strong> ตัวเลือก </strong> . </p> <p> 2. ในการตั้งค่าทั่วไป <strong> ยกเลิกการเลือก </strong> ทางเลือก <strong> อนุญาตให้ Windows Search ค้นหาข้อความ </strong> . </p> <p><img src=\"images/image_thumb-24-636.png\" alt=\"Disable Windows Search in Thunderbird Messages\" loading=\"lazy\"></p> <p> 3. <strong> เริ่มต้นใหม่ </strong> ธันเดอร์เบิร์ด </p> <p> </p> <h3> วิธีที่ 3 เพิ่มข้อยกเว้นของ Thunderbird ใน Antivirus </h3> <p> หากคุณใช้โปรแกรมป้องกันไวรัสของบริษัทอื่นในเครื่องของคุณ ให้ดำเนินการและเพิ่มโปรแกรมปฏิบัติการ &quot;thunderbird.exe&quot; ลงในข้อยกเว้นของโปรแกรมป้องกันไวรัส </p> <p> ตัวอย่างเช่น หากคุณเป็นเจ้าของ AVG Antivirus: </p> <p> 1. ไปที่ <strong> เมนู </strong> &gt; <strong> การตั้งค่า </strong> . <br> 2. ใน <strong> ทั่วไป </strong> แท็บ คลิก <strong> ข้อยกเว้น </strong> &gt; <strong> เพิ่มข้อยกเว้น </strong> . <br> 3. คลิก <strong> เรียกดู </strong> ปุ่มและค้นหา <strong> Thunderbird.exe </strong> ไฟล์ (หรือ <strong> สำเนา </strong> &amp; <strong> วางบรรทัดด้านล่าง) </strong> แล้วคลิก <strong> เพิ่มข้อยกเว้น * </strong></p> <ul> <li> C:\\Program Files (x86)\\Mozilla Thunderbird\\thunderbird.exe </li> </ul> <p><strong> * บันทึก: </strong> หากหลังจากเพิ่มไฟล์ &quot;thunderbird.exe ในข้อยกเว้น AV แล้ว ปัญหายังคงมีอยู่ <strong> เพิ่ม </strong> ยัง <strong> ถึงข้อยกเว้น AV </strong> <strong> โฟลเดอร์ที่ติดตั้งธันเดอร์เบิร์ด </strong> และ <strong> โฟลเดอร์โปรไฟล์ธันเดอร์เบิร์ด </strong> . </p> <p><img src=\"images/image_thumb-19-734.png\" alt=\"add thunderbird to antivirus exceptions\" loading=\"lazy\"></p> <p> </p> <p> </p> <h3> วิธีที่ 4. ปิดการใช้งาน – ถอนการติดตั้งโปรแกรมป้องกันไวรัสของคุณ </h3> <p> เนื่องจากปัญหา &quot;ไม่ตอบสนอง&quot; ในโปรแกรม Thunderbird มักเกิดจากโปรแกรมป้องกันไวรัส ฉันขอแนะนำให้ suggest <strong> ปิดการใช้งาน </strong> หรือถึง <strong> ถอนการติดตั้งอย่างสมบูรณ์ </strong> โปรแกรมป้องกันไวรัสของคุณและดูว่าปัญหายังคงมีอยู่หรือไม่ </p> <h3></h3> <p> </p> <h3> วิธีที่ 5. เริ่มธันเดอร์เบิร์ดในเซฟโหมด </h3> <p> ธันเดอร์เบิร์ดอาจค้างและไม่ตอบสนอง หากส่วนขยายที่ติดตั้งไว้ทำให้เกิดปัญหาหรือเสียหาย ในการแก้ไขปัญหาส่วนเสริมของ Thunderbird ให้ดำเนินการดังนี้ </p> <p> 1. กด และ <strong> กดค้างไว้ </strong> <strong> SHIFT </strong> บนแป้นพิมพ์ของคุณและเปิด your <strong> ธันเดอร์เบิร์ด </strong></p> <p> 2. ในหน้าต่างถัดไป ให้คลิก <strong> ดำเนินการต่อในเซฟโหมด </strong></p> <p><img src=\"images/image_thumb-21-196.png\" alt=\"Strat Thunderbird in Safe Mode\" loading=\"lazy\"></p> <p> </p> <p> 3. หากธันเดอร์เบิร์ดไม่ค้างในเซฟโหมด โปรแกรมเสริมที่ติดตั้งอาจทำให้เกิดปัญหา ในกรณีนี้: </p> <ol> <li> ปิด ธันเดอร์เบิร์ด </li> <li> กดปุ่ม SHIFT แล้วเปิดธันเดอร์เบิร์ดอีกครั้ง </li> <li> ที่หน้าต่างถัดไป <strong> ตรวจสอบ </strong> <strong> ปิดการใช้งานส่วนเสริมทั้งหมด </strong> และคลิก <strong> ทำการเปลี่ยนแปลงและเริ่มต้นใหม่ </strong> . </li> </ol> <p><img src=\"images/image_thumb-22-149.png\" alt=\"Disable Thunderbird add-ons\" loading=\"lazy\"></p> <p> 4. หากธันเดอร์เบิร์ดไม่ตอบสนองอีก ให้ทำตามขั้นตอนต่อไป </p> <h3> วิธีที่ 5. รีเซ็ตแถบเครื่องมือและตัวควบคุมธันเดอร์เบิร์ด </h3> <p> 1. กด และ <strong> กดค้างไว้ </strong> <strong> SHIFT </strong> บนแป้นพิมพ์ของคุณและเปิด your <strong> ธันเดอร์เบิร์ด </strong></p> <p> 2. ในหน้าต่างถัดไป เลือก <strong> รีเซ็ตแถบเครื่องมือและส่วนควบคุม </strong> และคลิก <strong> ทำการเปลี่ยนแปลงและเริ่มต้นใหม่ </strong></p> <p><img src=\"images/image_thumb-23-344.png\" alt=\"Reset Thunderbird Toolbars\" loading=\"lazy\"></p> <p> </p> <h3> วิธีที่ 6 ลบไฟล์ดัชนีของธันเดอร์เบิร์ด (.msf) </h3> <p> ในบางกรณีธันเดอร์เบิร์ดหยุดนิ่ง เนื่องจากไฟล์การจัดทำดัชนี (หรือที่เรียกว่าไฟล์ MSF) เสียหาย ดังนั้น วิธีสุดท้ายในการแก้ปัญหา &quot;Thunderbird ไม่ตอบสนอง&quot; คือการลบไฟล์ .MSF * </p> <p><strong> * สำคัญ: </strong> แม้ว่าไฟล์ MSF (Mail Summary Files) จะสามารถลบออกได้อย่างปลอดภัย เนื่องจากมีเฉพาะส่วนหัวของอีเมลและสถานะอีเมล (อ่านแล้ว ยังไม่ได้อ่าน ฯลฯ) และไม่ใช่อีเมลจริง ขอแนะนำให้ <a href=\"https://www.repairwin.com/how-to-transfer-thunderbird-email-and-settings-to-a-new-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> สำรองโฟลเดอร์โปรไฟล์ธันเดอร์เบิร์ด </a> ก่อนลบไฟล์ MSF </p> <p><strong> ขั้นตอนที่ 1 ปิดธันเดอร์เบิร์ด </strong></p> <p><strong> ขั้นตอนที่ 2 เปิดใช้งานมุมมองไฟล์ที่ซ่อนอยู่ </strong></p> <p> 1. ไปที่ Windows <strong> แผงควบคุม </strong> และเปิด <strong> ตัวเลือกโฟลเดอร์ </strong> . (หรือ <strong> ตัวเลือก File Explorer </strong> ใน Windows 10) </p> <p> 2. เลือก <strong> ดู </strong> แท็บและใต้ <strong> &#39;ไฟล์และโฟลเดอร์ที่ซ่อนอยู่&#39; </strong> มาตรา, <strong> ตรวจสอบ </strong> <strong> แสดงไฟล์ โฟลเดอร์ และไดรฟ์ที่ซ่อนอยู่ </strong> ตัวเลือกและคลิก <strong> ตกลง. </strong></p> <p><img src=\"images/image_thumb-34-553.png\" alt=\"Show Hidden files\" loading=\"lazy\"></p> <p> </p> <p><strong> ขั้นตอนที่ 3 ลบ .MSF files </strong></p> <p> 1. ไปที่โฟลเดอร์โปรไฟล์ธันเดอร์เบิร์ดบนดิสก์ของคุณและเปิด open <strong> จดหมาย </strong> โฟลเดอร์: * </p> <ul> <li> C:\\Users\\username\\AppData\\Roaming\\Thunderbird\\Profiles\\ProfileName <strong> .default\\Mail </strong></li> </ul> <p> * โดยที่ username คือชื่อผู้ใช้ Windows ของคุณและ ProfileName คือชื่อโปรไฟล์ Mozilla ที่เก็บอีเมล </p> <p> 2. ตอนนี้สำรวจโฟลเดอร์ที่มีอยู่ทั้งหมดภายใน <strong> จดหมาย </strong> เพื่อดูว่าไฟล์ใดมีไฟล์ .msf (ในการติดตั้งเริ่มต้น ด้วยบัญชีอีเมลเพียงบัญชีเดียว ไฟล์ MSF จะอยู่ในโฟลเดอร์ &quot;Local Folders&quot; </p> <p> 3. <strong> ลบ </strong> ทั้งหมด <strong> .msf </strong> ไฟล์ หรือ -ดีกว่า- <strong> ย้าย </strong> ไปยังโฟลเดอร์ (ใหม่) บนเดสก์ท็อปของคุณ </p> <p><img src=\"images/image_thumb-25-355.png\" alt=\"Delete Thunderbird MSF files\" loading=\"lazy\"></p> <p> 4. เมื่อเสร็จแล้ว ให้เปิดธันเดอร์เบิร์ดและรอให้ธันเดอร์เบิร์ดสร้างไฟล์การจัดทำดัชนีขึ้นใหม่ (ไฟล์ MSF) </p> <p> นั่นคือทั้งหมดที่! โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}