{"title":"การแก้ไข: การรับ Outlook รายงานข้อผิดพลาด 0x80042108 (แก้ไขแล้ว)","content":"<p> บทแนะนำนี้มีคำแนะนำทีละขั้นตอนเพื่อแก้ไขข้อผิดพลาดที่ได้รับรายงานของ Outlook 0x80042108 ข้อผิดพลาด Outlook 0x80042108 มักเกิดขึ้นเมื่อคุณพิมพ์ชื่อเซิร์ฟเวอร์อีเมล POP3 ไม่ถูกต้อง หรือเนื่องจากคุณไม่มีสิทธิ์เข้าถึงอินเทอร์เน็ต </p> <p> ปัญหาคือรายละเอียด Outlook 2003, 2007, 2010 หรือ Outlook 2013 แสดงข้อผิดพลาดต่อไปนี้ในระหว่างขั้นตอนการส่ง-รับ: &quot;การรับรายงานข้อผิดพลาด (0x80042108): Outlook ไม่สามารถเชื่อมต่อกับเซิร์ฟเวอร์อีเมลขาเข้า (POP3) ของคุณ ถ้าคุณยังคงได้รับข้อความนี้ โปรดติดต่อผู้ดูแลระบบเซิร์ฟเวอร์หรือผู้ให้บริการอินเทอร์เน็ต (ISP)&quot; </p> <p><img src=\"images/outlookerror_0x80042108-505.png\" alt=\"Outlook Error 0x80042108\" loading=\"lazy\"></p> <p> ข้อผิดพลาด &quot;0x80042108&quot; ของ Outlook สามารถเกิดขึ้นใน Outlook เวอร์ชันใดก็ได้ (2016, 2013, 2010 หรือ 2007) และปรากฏขึ้นเมื่อโปรแกรมไคลเอ็นต์อีเมล Outlook ไม่สามารถเชื่อมต่อกับเซิร์ฟเวอร์อีเมลได้ </p> <h4> วิธีแก้ไขข้อผิดพลาด 0x80042108 ใน Outlook 2007, 2010, 2013 หรือ 2016 </h4> <h6> ขั้นตอนที่ 1 ตรวจสอบการเชื่อมต่ออินเทอร์เน็ตของคุณ </h6> <p> ขั้นตอนแรกในการแก้ไขข้อผิดพลาดในการรับ Outlook 80042108 คือการตรวจสอบการเชื่อมต่ออินเทอร์เน็ตของคุณ ดังนั้น เปิดอินเทอร์เน็ตเบราว์เซอร์ของคุณและเยี่ยมชมเว็บไซต์ใด ๆ เพื่อให้แน่ใจว่าการเชื่อมต่ออินเทอร์เน็ตของคุณใช้งานได้ </p> <h6> ขั้นตอนที่ 2 ตรวจสอบการตั้งค่าเซิร์ฟเวอร์จดหมาย POP3 </h6> <p> ขั้นตอนที่สองในการแก้ไขข้อผิดพลาดที่ได้รับ Outlook 0x80042108 คือการตรวจสอบว่าคุณได้ระบุการตั้งค่าเซิร์ฟเวอร์อีเมลที่ถูกต้องหรือไม่ ดังนั้น ให้ติดต่อผู้ให้บริการอีเมลของคุณและยืนยันกับเขาว่าคุณได้พิมพ์ชื่อเซิร์ฟเวอร์อีเมลขาเข้าและหมายเลขพอร์ตอย่างถูกต้อง ในการดูและแก้ไขการตั้งค่าเซิร์ฟเวอร์อีเมล: </p> <p> 1. เปิด Outlook <br> 2. ไปที่ <strong> ไฟล์ </strong> –&gt; <strong> การตั้งค่าบัญชี </strong> . </p> <p><img src=\"images/image_thumb-7-811.png\" alt=\"switch Account Mail Merge \" loading=\"lazy\"></p> <p> </p> <p> 3. ใน <strong> อีเมล </strong> ให้ดับเบิ้ลคลิกที่บัญชีอีเมลของคุณเพื่อแก้ไข/ดูการตั้งค่า <br> 4. ตรวจสอบว่าคุณได้ตั้งชื่อเซิร์ฟเวอร์อีเมลขาเข้าที่ถูกต้องในช่องที่เกี่ยวข้อง <br> 5. เมื่อเสร็จแล้ว คลิก <strong> การตั้งค่าเพิ่มเติม </strong> . </p> <p><img src=\"images/image_thumb-31-256.png\" alt=\"FIX: Outlook Receiving reported error 0x80042108\" loading=\"lazy\"></p> <blockquote><p> </p></blockquote> <p> 6. คลิก <strong> ขั้นสูง </strong> และตรวจสอบว่าคุณได้ระบุพอร์ตที่ถูกต้องและการตั้งค่า SSL สำหรับเซิร์ฟเวอร์ขาเข้า (POP3) </p> <p> </p> <p><img src=\"images/image_thumb-33-400.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. เมื่อเสร็จแล้วคลิก <strong> ตกลง </strong> แล้วปิดหน้าต่างที่เปิดอยู่ทั้งหมด <br> 7. ทดสอบ Outlook อีกครั้ง </p> <h6></h6> <h6> ขั้นตอนที่ 3 ตรวจสอบการตั้งค่า Antivirus &amp; Firewall ของคุณ </h6> <p> หากคุณกำลังใช้โปรแกรมป้องกันไวรัสที่มีคุณสมบัติการสแกนอีเมล แสดงว่า <a href=\"https://www.repairwin.com/how-to-disable-add-ins-in-word-outlook-or-excel-2016-2013-2010-2007-or-2003/\" target=\"_blank\" rel=\"nofollow noopener\"> ปิดการใช้งาน Antivirus Add-in ใน Outlook </a> หรือปิดใช้งานการป้องกันไวรัสชั่วคราวหรือถอนการติดตั้งโปรแกรมป้องกันไวรัส นอกจากนี้ ให้ตรวจสอบการตั้งค่าไฟร์วอลล์ของคุณและตรวจสอบให้แน่ใจว่าพอร์ตเซิร์ฟเวอร์อีเมลที่คุณใช้ไม่ได้ถูกบล็อกจากโปรแกรมไฟร์วอลล์ โดยเฉพาะอย่างยิ่ง ที่การตั้งค่าไฟร์วอลล์ของคุณ: </p> <p> A. เปิดใช้งานไฟล์ต่อไปนี้เพื่อเข้าถึงอินเทอร์เน็ต: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. เปิดใช้งานพอร์ตต่อไปนี้เพื่อเข้าถึงอินเทอร์เน็ต: </p> <ul> <li><strong> พอร์ต110 </strong> (หากคุณใช้เซิร์ฟเวอร์อีเมลขาเข้า POP3 โดยไม่มีการเชื่อมต่อที่เข้ารหัส) * </li> <li><strong> พอร์ต 995 </strong> (หากคุณใช้เซิร์ฟเวอร์อีเมลขาเข้า POP3 ที่มีการเชื่อมต่อที่เข้ารหัส (เปิดใช้งาน SSL) </li> </ul> <ul> <li><strong> พอร์ต143 </strong> (หากคุณใช้เซิร์ฟเวอร์อีเมลขาเข้า IMAP โดยไม่มีการเชื่อมต่อที่เข้ารหัส) </li> <li><strong> พอร์ต 993 </strong> (หากคุณใช้เซิร์ฟเวอร์อีเมลขาเข้า IMAP ที่มีการเชื่อมต่อที่เข้ารหัส (เปิดใช้งาน SSL) </li> </ul> <ul> <li><strong> พอร์ต 25 </strong> หากเซิร์ฟเวอร์เมลขาออก SMTP ของคุณไม่ได้ใช้ SSL * </li> <li><strong> พอร์ต 465 </strong> หรือ <strong> 587 </strong> หากเซิร์ฟเวอร์เมลขาออก SMTP ของคุณใช้ SSL </li> </ul> <p> * หมายเหตุ: โดยค่าเริ่มต้น พอร์ต 25 ใช้สำหรับการเข้าถึงขาออก และพอร์ต 110 สำหรับการเข้าถึงขาเข้า หากคุณไม่แน่ใจเกี่ยวกับพอร์ต โปรดติดต่อ ISP หรือผู้ดูแลระบบของคุณ </p> <p> </p> <p><strong> ความช่วยเหลือเพิ่มเติม: </strong> หากวิธีการข้างต้นไม่สามารถช่วยคุณได้ ให้ลองทำดังนี้: </p> <p><strong> ก. </strong> ลบและเพิ่มบัญชีอีเมลของคุณอีกครั้ง <br> <strong> ข. </strong><a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> ซ่อมแซมไฟล์ข้อมูล Outlook PST </a> . <br> <strong> ค. </strong> ตัดการเชื่อมต่อจากการเชื่อมต่อ VPN (หากคุณเชื่อมต่ออยู่) <br> <strong> ง. </strong> ซ่อมติดตั้งสำนักงาน. ในการทำเช่นนั้น: </p> <blockquote><p> 1. ไปที่ Windows <strong> แผงควบคุม </strong> &gt; <strong> โปรแกรมและคุณสมบัติ </strong> . <br> 2. ค้นหาและเลือกแอปพลิเคชัน MS Office จากนั้นคลิก <strong> เปลี่ยน </strong> . <br> 3. จากนั้นเลือก <strong> ซ่อมแซม </strong> ตัวเลือก </p></blockquote> <p> </p> <p> </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? </p> <p> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}