{"title":"การแก้ไข: อุปกรณ์นี้ไม่สามารถใช้ Trusted Platform Module ใน BitLocker (แก้ไขแล้ว)","content":"<p> บนคอมพิวเตอร์ที่ใช้ Windows 10 Pro หรือ Enterprise ข้อผิดพลาดต่อไปนี้อาจปรากฏขึ้นเมื่อพยายาม <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> เปิดการเข้ารหัสไดรฟ์ด้วย BitLocker บนไดรฟ์ระบบปฏิบัติการ </a> : &quot;อุปกรณ์นี้ไม่สามารถใช้โมดูลแพลตฟอร์มที่เชื่อถือได้ ผู้ดูแลระบบของคุณต้องตั้งค่าตัวเลือก &quot;อนุญาต BitLocker โดยไม่มี TPM ที่เข้ากันได้&quot; ในนโยบาย &quot;ต้องการการตรวจสอบสิทธิ์เพิ่มเติมเมื่อเริ่มต้น&quot; สำหรับโวลุ่มระบบปฏิบัติการ&quot; </p> <p><img src=\"images/image_thumb-30-150.png\" alt=\"This device can't use a Trusted Platform Module in BitLocker\" loading=\"lazy\"></p> <p> บทช่วยสอนนี้มีคำแนะนำในการแก้ไขข้อผิดพลาด BitLocker ต่อไปนี้: &quot;อุปกรณ์นี้ไม่สามารถใช้ Trusted Platform Module…&quot; ใน Windows 10 Pro และ Enterprise Editions </p> <h4> วิธีแก้ไข: ข้อผิดพลาด &quot;อุปกรณ์นี้ไม่สามารถใช้โมดูลแพลตฟอร์มที่เชื่อถือได้&quot; ใน Bit Locker </h4> <p> BitLocker ให้การป้องกันสูงสุดเมื่อใช้กับ Trusted Platform Module (TPM) เวอร์ชัน 1.2 หรือใหม่กว่า หากคุณเป็นเจ้าของคอมพิวเตอร์ที่ไม่มีโมดูล TPM คุณต้องปิดใช้งานข้อกำหนด TPM สำหรับ BitLocker ในนโยบายกลุ่ม ในการทำเช่นนั้น: </p> <p> 1. กด Windows . พร้อมกัน <img src=\"images/image_thumb36-579.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> ปุ่มเพื่อเปิดกล่องคำสั่งเรียกใช้ <br> 2. พิมพ์ <strong> gpedit.msc </strong> &amp; กด <strong> ป้อน </strong></p> <p><img src=\"images/image_thumb-78-692.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. ที่บานหน้าต่างด้านซ้าย ให้ไปที่: </p> <ul> <li><strong> คอมพิวเตอร์ Configuration\\Administrative Templates\\Windows Components\\ BitLocker Drive Encryption\\Operating System Drives </strong></li> </ul> <p> 4. จากนั้นคลิกที่ <strong> ต้องการการรับรองความถูกต้องเพิ่มเติมเมื่อเริ่มต้น </strong> บนบานหน้าต่างด้านขวา </p> <p><img src=\"images/image_thumb-31-186.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. คลิก <strong> เปิดใช้งาน </strong> แล้วตรวจสอบ <strong> อนุญาต BitLocker โดยไม่มี TPM . ที่เข้ากันได้ </strong> ช่องทำเครื่องหมาย <strong><br> </strong> 6. คลิก <strong> ตกลง </strong> และ <strong> ปิด </strong> ตัวแก้ไขนโยบายกลุ่ม </p> <p><img src=\"images/image_thumb-32-380.png\" alt=\"Allow BitLocker without compatible Trusted Platform Module\" loading=\"lazy\"></p> <p> </p> <p> 7. เสร็จแล้ว! ดำเนินการเพื่อเปิดใช้งานการป้องกัน BitLocker บนไดรฟ์ระบบปฏิบัติการ โดยไม่มีปัญหาใดๆ </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}