{"title":"การแก้ไข: Windows ไม่สามารถติดตั้งไฟล์ที่จำเป็น รหัสข้อผิดพลาด: 0x80070017","content":"<p> บทแนะนำนี้มีคำแนะนำในการแก้ไขข้อผิดพลาดในการติดตั้ง Windows 0x80070017: &quot;Windows ไม่สามารถติดตั้งไฟล์ที่จำเป็น ไฟล์อาจเสียหายหรือสูญหาย ตรวจสอบให้แน่ใจว่าไฟล์ทั้งหมดที่จำเป็นสำหรับการติดตั้งพร้อมใช้งาน และเริ่มการติดตั้งใหม่ รหัสข้อผิดพลาด: 0x80070017&quot; ใน Windows 10 /8/7 ระบบปฏิบัติการ </p> <p><img src=\"images/image_thumb-30-955.png\" alt=\"Fix Windows Install Error 0x80070017 Windows Cannot Install Required Files\" loading=\"lazy\"></p> <p> </p> <h4> วิธีแก้ไข Windows ไม่สามารถติดตั้งไฟล์ที่จำเป็น – รหัสข้อผิดพลาด 0x80070017 (Windows 10/8/7) </h4> <h6> ขั้นตอนที่ 1 ตัดการเชื่อมต่ออุปกรณ์ที่เชื่อมต่อ </h6> <p> ขั้นตอนแรกในการแก้ไขข้อผิดพลาด 0x80070017 คือการตัดการเชื่อมต่ออุปกรณ์อื่นๆ ที่ไม่จำเป็น (เช่น ฮาร์ดไดรฟ์ USB การ์ด USB ไร้สาย) ที่ไม่จำเป็นต้องติดตั้ง Windows </p> <p> </p> <h6> ขั้นตอนที่ 2 ใช้พอร์ต USB หรือสื่อการติดตั้งอื่น </h6> <p> ข้อผิดพลาด &quot;Windows Can not Install Required Files&quot; โดยทั่วไปจะเกิดขึ้นหากคุณตั้งค่า Windows 10 จากสื่อ USB ที่เชื่อมต่อกับพอร์ต USB 3.0 ดังนั้น ให้ลองทำดังต่อไปนี้: </p> <ol> <li> <ol> <li> ตรวจสอบว่าคุณสามารถปิดใช้งานการสนับสนุน USB 3.0 จากการตั้งค่า BIOS ได้หรือไม่ </li> <li> เชื่อมต่อไดรฟ์ USB เข้ากับพอร์ต USB 2.0 (หรือกับพอร์ต USB อื่น) </li> <li> หากพีซีของคุณไม่มีพอร์ต USB 2.0 ให้ติดตั้ง Windows 10 จากแฟลชไดรฟ์ USB 2.0 </li> <li> ติดตั้ง Windows จากสื่อดีวีดี </li> <li> หากคุณต้องการติดตั้ง Windows 10 ลงในระบบที่ใช้ UEFI ให้ใช้ยูทิลิตี้ RUFUS และสร้างสื่อการติดตั้ง USB สำหรับ &quot;UEFI&quot; หากระบบของคุณไม่รองรับ UEFI ให้สร้างสื่อการติดตั้ง USB สำหรับระบบที่ใช้ &quot;ดั้งเดิม&quot; (คำแนะนำโดยละเอียดในการทำเช่นนั้นสามารถดูได้ที่นี่: <a href=\"https://www.repairwin.com/create-windows-usb-with-rufus-iso-to-usb/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีสร้าง Windows USB Boot Drive ด้วยยูทิลิตี้ Rufus </a></li> <li> รี- <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> ดาวน์โหลดไฟล์ Windows ISO </a> และสร้างสื่อการติดตั้ง Windows USB ใหม่โดยใช้ RUFUS </li> </ol> </li> </ol> <p> </p> <h6> ขั้นตอนที่ 3 ติดตั้ง Windows 10 จากอุปกรณ์ USB รุ่นเก่า </h6> <p> หากคุณได้รับข้อผิดพลาด &quot;Windows Cannot Install Required Files&quot; เมื่อคุณติดตั้ง Windows 10 จาก USB Media ที่สร้างขึ้นสำหรับระบบ UEFI ให้สร้าง USB Media ใหม่สำหรับระบบ Legacy และบูตจากอุปกรณ์ USB รุ่นเก่าเพื่อติดตั้ง Windows 10 </p> <h6></h6> <h6> ขั้นตอนที่ 4 วินิจฉัยปัญหาหน่วยความจำ </h6> <p> ขั้นตอนที่สามในการแก้ไขข้อผิดพลาดในการตั้งค่า Windows 0x80070017 คือการวินิจฉัยปัญหา RAM ของคุณ ให้ทำตามคำแนะนำจากบทความต่อไปนี้: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีวินิจฉัยปัญหาหน่วยความจำคอมพิวเตอร์ด้วย Memtest86+ </a></li> </ul> <p> </p> <h6> ขั้นตอนที่ 5. ตรวจสอบฮาร์ดไดรฟ์เพื่อหาปัญหา </h6> <p> ข้อผิดพลาดในการติดตั้ง Windows 0x80070017 สามารถเกิดขึ้นได้ หากฮาร์ดไดรฟ์เสียหาย ดังนั้นให้ดำเนินการและวินิจฉัยข้อผิดพลาดของ HDD และเปลี่ยนฮาร์ดไดรฟ์หากจำเป็น โดยทำตามคำแนะนำในคู่มือนี้: </p> <ul> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> เครื่องมือทดสอบและวินิจฉัยฮาร์ดไดรฟ์ที่ดีที่สุดเพื่อตรวจสอบสุขภาพของฮาร์ดดิสก์ </a></li> </ul> <h5></h5> <h6> ขั้นตอนที่ 6 ตรวจสอบการเชื่อมต่อสายเคเบิลและฮาร์ดแวร์ </h6> <p> หากหลังจากทำตามขั้นตอนข้างต้นแล้ว ข้อผิดพลาดในการติดตั้ง Windows 0x80070017 ยังคงปรากฏขึ้น แสดงว่า: </p> <p> 1. ตรวจสอบการเชื่อมต่อสายเคเบิลทั้งหมดและตรวจสอบให้แน่ใจว่าได้เชื่อมต่อฮาร์ดไดรฟ์อย่างถูกต้อง นอกจากนี้ หากคุณเป็นเจ้าของเดสก์ท็อปพีซี ให้เปลี่ยนสายเคเบิลข้อมูลของ HDD <br> 2. ลองติดตั้ง Windows โดยใช้การ์ดวิดีโอ (VGA) อื่น ถ้าทำได้ <br> 3. อัพเดตไบออสของคุณ </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> กรุณาแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดียิ่งขึ้น: ชอบและแบ่งปันโพสต์บล็อกนี้ในเครือข่ายสังคมเพื่อช่วยกระจายคำเกี่ยวกับปัญหานี้ </p>"}