{"title":"การแก้ไข: ติดตั้งตัวเลือกเครื่องมือ VMware เป็นสีเทา (แก้ไขแล้ว)","content":"<p> หากคุณไม่สามารถติดตั้งเครื่องมือ VMware บนระบบปฏิบัติการของแขกได้เนื่องจากตัวเลือก &quot;ติดตั้งเครื่องมือ VMware&quot; เป็นสีเทา ให้อ่านต่อไปด้านล่าง VMware Tools เป็นชุดบริการและโมดูลฟรีที่เปิดใช้งานคุณสมบัติหลายอย่างในเครื่องเสมือนของแขก เช่น ประสิทธิภาพกราฟิกที่เร็วขึ้น ประสิทธิภาพของเมาส์ที่ดีขึ้น และที่สำคัญที่สุด: ความสามารถในการคัดลอกและวางระหว่างโฮสต์และเครื่องแขก ดังนั้น แม้ว่าระบบปฏิบัติการของแขกจะสามารถทำงานได้โดยไม่ต้องใช้ VMware Tools แต่จำเป็นต้องติดตั้งเครื่องมือ VMware หากคุณต้องการเปิดใช้งานคุณสมบัติพิเศษของ VMware </p> <p> วิธีปกติในการติดตั้ง VMware Tools คือการเริ่มต้นเครื่องแขกจากนั้นเลือกจากเมนู &quot;เครื่องเล่น&quot; <strong> จัดการ </strong> &gt; <strong> ติดตั้งเครื่องมือ VMware </strong> . แต่ถ้าคุณเชื่อมต่อไดรฟ์ซีดี/ดีวีดีเสมือนของเครื่องเสมือนกับไฟล์อิมเมจ ISO เมื่อคุณติดตั้งระบบปฏิบัติการ ตัวเลือก &quot;ติดตั้งเครื่องมือ VMware&quot; จะเป็นสีเทา </p> <p><img src=\"images/image_thumb-45-164.png\" alt=\"FIX VMware Tools option is Grayed Out\" loading=\"lazy\"></p> <p> </p> <p> บทช่วยสอนนี้มีคำแนะนำในการแก้ไขปัญหาต่อไปนี้ใน VMware Workstation Player ตัวเลือก &quot;ติดตั้งเครื่องมือ VMware&quot; เป็นสีเทาในเครื่องแขก </p> <h4> วิธีการติดตั้งเครื่องมือ VMware หากตัวเลือก &#39;ติดตั้งเครื่องมือ VMware&#39; เป็นสีเทา </h4> <p> </p> <p> 1. ปิดเครื่องเสมือน <br> 2. คลิกขวาที่เครื่องเสมือนและเลือก <strong> การตั้งค่า </strong> . </p> <p><img src=\"images/image_thumb-39-377.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. เลือก <strong> ซีดี/ดีวีดี </strong> ขับแล้วคลิก <strong> ลบ </strong> . </p> <p><img src=\"images/image_thumb-43-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. จากนั้นเลือก <strong> ฟลอปปี้ </strong> ขับรถคลิก <strong> ลบ </strong> แล้วคลิก <strong> ตกลง </strong> เพื่อปิดตัวเลือกการตั้งค่า </p> <p><img src=\"images/image_thumb-44-469.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> เริ่ม </strong> เครื่องเสมือน <br> 6. จากเมนู &#39;ผู้เล่น&#39; ให้เลือก <strong> จัดการ </strong> และคลิก <strong> ติดตั้งเครื่องมือ VMware </strong></p> <p><img src=\"images/image_thumb-42-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}