{"title":"การแก้ไข: ความสัมพันธ์ที่เชื่อถือได้ระหว่างเวิร์กสเตชันนี้กับโดเมนหลักล้มเหลว (แก้ไขแล้ว)","content":"<p> หากคุณได้รับข้อผิดพลาด &quot;ความสัมพันธ์ที่เชื่อถือได้ระหว่างเวิร์กสเตชันนี้และโดเมนหลักล้มเหลว&quot; เมื่อคุณพยายามเข้าสู่ระบบในโดเมนของคุณ หรือเมื่อคุณพยายามเข้าถึงโฟลเดอร์ที่ใช้ร่วมกันบนเครื่องอื่นในโดเมน โปรดอ่านด้านล่างเพื่อแก้ไขปัญหา </p> <p> ข้อผิดพลาด &quot;ความสัมพันธ์ที่เชื่อถือได้ระหว่างเวิร์กสเตชันและโดเมนหลักล้มเหลว&quot; อาจปรากฏขึ้นเนื่องจากสาเหตุต่อไปนี้: </p> <ul> <li> คอมพิวเตอร์มีชื่อเหมือนกับคอมพิวเตอร์เครื่องอื่นในโดเมน </li> <li> ข้อมูลรับรองโดเมน (ชื่อผู้ใช้หรือรหัสผ่าน) ไม่ถูกต้อง </li> <li> บัญชีของคอมพิวเตอร์หมดอายุ * </li> </ul> <p> * หมายเหตุ: บางองค์กรสร้างคอมพิวเตอร์ล่วงหน้า (หรือโคลนคอมพิวเตอร์) เพื่อใช้ในภายหลัง หากบัญชีของคอมพิวเตอร์หมดอายุ จะไม่สามารถตรวจสอบสิทธิ์กับโดเมนได้อีกต่อไป ในกรณีดังกล่าว คอมพิวเตอร์ที่ไม่สามารถรับรองความถูกต้องกับโดเมนจะต้องถูกลบออกจากโดเมนและเข้าร่วมใหม่ (ขั้นตอนที่ 4) </p> <p><img src=\"images/image_thumb-32-740.png\" alt=\"FIX: Trust Relationship Between this Workstation and the Primary Domain Failed \" loading=\"lazy\"></p> <h4> วิธีแก้ไข: ความสัมพันธ์ที่เชื่อถือได้ระหว่างเวิร์กสเตชันและโดเมนล้มเหลว </h4> <h6> วิธีที่ 1 ตรวจสอบว่าข้อมูลรับรองโดเมนถูกต้อง </h6> <p> ก่อนอื่นตรวจสอบให้แน่ใจว่าข้อมูลประจำตัวนั้นถูกต้องและโดยเฉพาะอย่างยิ่งรหัสผ่าน หากคุณโคลนเครื่องจากภาพคอมพิวเตอร์ที่ถ่ายในอดีตและตั้งแต่นั้นมารหัสก็เปลี่ยนไป </p> <h6> วิธีที่ 2 ตรวจสอบชื่อคอมพิวเตอร์ที่ซ้ำกัน </h6> <p> ตรวจสอบให้แน่ใจว่าชื่อคอมพิวเตอร์ไม่ซ้ำกัน และไม่มีคอมพิวเตอร์เครื่องอื่นบนเครือข่ายที่มีชื่อเหมือนกัน </p> <h6> วิธีที่ 3 ตรวจสอบที่อยู่ IP ที่ซ้ำกัน </h6> <p> ตรวจสอบให้แน่ใจว่าที่อยู่ IP ของคอมพิวเตอร์ไม่ซ้ำกันและไม่ขัดแย้งกับที่อยู่ IP อื่นบนเครือข่าย </p> <h6> วิธีที่ 4. ลบและเข้าร่วมคอมพิวเตอร์อีกครั้งในโดเมน </h6> <p> วิธีปกติในการแก้ไขความสัมพันธ์ที่เชื่อถือได้ระหว่างคอมพิวเตอร์และโดเมนคือการลบและเพิ่มคอมพิวเตอร์ที่ได้รับผลกระทบลงในโดเมนอีกครั้ง </p> <h5> ขั้นตอนที่ 1 ลบบัญชีคอมพิวเตอร์ออกจากโดเมน </h5> <p> 1. เข้าสู่ระบบเซิร์ฟเวอร์ Active Directory <br> 2. เปิด <strong> ผู้ใช้ Active Directory และคอมพิวเตอร์ <br> </strong> 3. ขยาย <strong> คอมพิวเตอร์ </strong> ภาชนะ <br> 4. คลิกขวาที่คอมพิวเตอร์ที่ได้รับผลกระทบและเลือก <strong> ลบ. </strong></p> <p><img src=\"images/image_thumb-39-366.png\" alt=\"Delete Computer Account from Domain\" loading=\"lazy\"></p> <h5> ขั้นตอนที่ 1 ลบและเข้าร่วมคอมพิวเตอร์ในโดเมนอีกครั้ง </h5> <p> 1. เข้าสู่ระบบคอมพิวเตอร์ที่ได้รับผลกระทบด้วยบัญชีผู้ดูแลระบบ LOCAL (ชื่อคอมพิวเตอร์\\ผู้ดูแลระบบ) </p> <p> 2. กด Windows <img src=\"images/image_thumb8_thumb-480.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> ปุ่มเพื่อเปิดกล่องคำสั่งเรียกใช้ </p> <p> 2ก. พิมพ์ <strong> sysdm.cpl </strong> &amp; คลิก <strong> ตกลง </strong> . </p> <p><img src=\"images/image_thumb7_thumb-169.png\" alt=\"system properties\" loading=\"lazy\"></p> <p> 3. ที่แท็บ &#39;ชื่อคอมพิวเตอร์&#39; คลิก <strong> เปลี่ยน </strong> . </p> <p><img src=\"images/image_thumb-37-924.png\" alt=\"Remove Computer from Domain\" loading=\"lazy\"></p> <p> 4. ที่ สมาชิกของ เลือก <strong> กลุ่มงาน </strong> พิมพ์ชื่อเวิร์กกรุ๊ป (เช่น &quot;WORKGROUP&quot;) แล้วคลิก and <strong> ตกลง </strong> . </p> <p><img src=\"images/image_thumb-34-169.png\" alt=\"Change Computer Name - Membership\" loading=\"lazy\"></p> <p> 5. พิมพ์ข้อมูลประจำตัวของผู้ดูแลระบบแล้วคลิก <strong> ตกลง </strong> . <br> 6. <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์. </p> <p> 7. ทำตามขั้นตอนที่ 1-4 อีกครั้ง แต่คราวนี้ ที่ขั้นตอนที่ 4 ให้เลือก <strong> โดเมน, </strong> พิมพ์ชื่อโดเมนแล้วคลิก <strong> ตกลง. </strong></p> <p><img src=\"images/image_thumb-38-928.png\" alt=\"Add computer to domain\" loading=\"lazy\"></p> <p> 8. พิมพ์ข้อมูลประจำตัวผู้ดูแลโดเมนและคลิก <strong> ตกลง </strong> . <br> 9. <strong> เริ่มต้นใหม่ </strong> พีซีของคุณและลงชื่อเข้าใช้โดเมนโดยใช้บัญชีผู้ใช้โดเมน </p> <h6> วิธีที่ 5. รีเซ็ตบัญชีคอมพิวเตอร์ในโดเมน </h6> <p> 1. เข้าสู่ระบบเซิร์ฟเวอร์ Active Directory <br> 2. เปิด <strong> ผู้ใช้ Active Directory และคอมพิวเตอร์ <br> </strong> 3. ขยาย <strong> คอมพิวเตอร์ </strong> ภาชนะ <br> 4. คลิกขวาที่คอมพิวเตอร์ที่ได้รับผลกระทบและเลือก <strong> รีเซ็ตบัญชี </strong></p> <p><img src=\"images/image_thumb-36-935.png\" alt=\"Reset Computer Account in Domain\" loading=\"lazy\"></p> <p> 5. ในที่สุด <strong> เริ่มต้นใหม่ </strong> <strong> เครื่องที่ได้รับผลกระทบ </strong> และเข้าสู่ระบบในโดเมน </p> <p> นั่นคือทั้งหมดที่! วิธีใดที่เหมาะกับคุณ โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}