{"title":"การแก้ไข: การเชื่อมต่อเดสก์ท็อประยะไกลไม่สามารถเชื่อมต่อได้เนื่องจากมีเซสชันคอนโซลที่กำลังดำเนินการอยู่ (แก้ไขแล้ว)","content":"<p> ข้อความแสดงข้อผิดพลาดในการเชื่อมต่อเดสก์ท็อประยะไกล &quot;คอมพิวเตอร์ของคุณไม่สามารถเชื่อมต่อกับเซสชันคอนโซลอื่นบนคอมพิวเตอร์ระยะไกลได้เนื่องจากคุณมีเซสชันคอนโซลที่อยู่ระหว่างดำเนินการ&quot; ปรากฏขึ้นเนื่องจากคอมพิวเตอร์ในเครื่องและคอมพิวเตอร์ระยะไกลมีที่อยู่ IP เดียวกัน ปัญหามักจะเกิดขึ้นเมื่อคุณพยายามเชื่อมต่อกับคอมพิวเตอร์เครื่องอื่นจากระยะไกลผ่านการเชื่อมต่อ VPN และคุณได้รับ &quot;ได้รับ&quot; ที่อยู่ IP เดียวกันจากเราเตอร์ในเครื่องของคุณเหมือนกับคอมพิวเตอร์ระยะไกล ในการแก้ไขปัญหา ให้ทำตามคำแนะนำด้านล่าง </p> <p> </p> <p><img src=\"images/image_thumb-7-243.png\" alt=\"Remote Desktop Connection Could Not Connect because already have a console session in progress\" loading=\"lazy\"></p> <h4> วิธีแก้ไขข้อผิดพลาด RDP: เดสก์ท็อประยะไกลไม่สามารถเชื่อมต่อกับเซสชันคอนโซลอื่นได้เนื่องจากมีเซสชันคอนโซลที่อยู่ระหว่างดำเนินการ </h4> <p> ปัญหาในการเชื่อมต่อเดสก์ท็อประยะไกล &quot;ไม่สามารถเชื่อมต่อกับเซสชันคอนโซลอื่นได้ เนื่องจากคุณมีเซสชันคอนโซลที่กำลังดำเนินการอยู่&quot; มักเกิดขึ้นเมื่อคอมพิวเตอร์ในพื้นที่ได้รับแบบสุ่ม (จากเซิร์ฟเวอร์ DHCP) ซึ่งเป็นที่อยู่ IP เดียวกันกับที่อยู่ IP ของรีโมต คอมพิวเตอร์ที่คุณต้องการเชื่อมต่อผ่าน RDP </p> <p> วิธีเดียวที่จะแก้ไข ปัญหาข้างต้นคือปิดการใช้งาน Auto Assign IP Address จาก DHCP Server ในเครื่องคอมพิวเตอร์ และระบุ IP Address ด้วยตนเอง ในการทำเช่นนั้น: </p> <p> 1. <strong> คลิกขวา </strong> บน <strong> เครือข่าย </strong> ไอคอน <img src=\"images/image_thumb-42-527.png\" alt=\"image\" loading=\"lazy\"> ในทาสก์บาร์แล้วคลิก <strong> เปิดศูนย์เครือข่ายและการแบ่งปัน </strong> * </p> <p><img src=\"images/image_thumb-104-485.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. เลือก <strong> อีเธอร์เน็ต </strong> (หรือ Wi-Fi) ทางด้านซ้าย จากนั้นที่ส่วน &quot;การตั้งค่าที่เกี่ยวข้อง&quot; คลิก <strong> เปลี่ยนตัวเลือกอะแดปเตอร์ </strong> . </p> <p><img src=\"images/image_thumb-43-117.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> ดับเบิลคลิก </strong> ที่ Network Adapter ที่ใช้งานอยู่ (Ethernet หรือ Wi-Fi) และคลิก <strong> รายละเอียด </strong> . </p> <p><img src=\"images/image_thumb-8-177.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. จดรายละเอียดที่อยู่ IP ในช่องต่อไปนี้ จากนั้นคลิก <strong> ปิด </strong> : </p> <ul> <li> ที่อยู่ IPv4 </li> <li> IPv4 ซับเน็ตมาสก์ </li> <li> IPv4 เกตเวย์เริ่มต้น </li> <li> เซิร์ฟเวอร์ DNS IPv4 </li> </ul> <p><img src=\"images/image_thumb-9-793.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. ตอนนี้คลิก <strong> คุณสมบัติ </strong> . </p> <p><img src=\"images/image_thumb-10-628.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. เลือก <strong> &#39;อินเทอร์เน็ตโปรโตคอลเวอร์ชัน 4 (TCP/IPv4) </strong> &#39; และคลิก <strong> คุณสมบัติ </strong></p> <p><img src=\"images/image_thumb-106-954.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 7. ที่คุณสมบัติอินเทอร์เน็ตโปรโตคอลเวอร์ชัน 4 (TCP/IPv4) ให้ใช้การตั้งค่าต่อไปนี้: </p> <p> ก. เลือก <strong> ใช้ที่อยู่ IP ต่อไปนี้: </strong></p> <blockquote><p> 1. ที่ช่อง IP Address พิมพ์ a <strong> ที่อยู่ IP ที่แตกต่างจากที่อยู่ IP ที่คุณสังเกตเห็นก่อนหน้านี้ </strong> . (เปลี่ยนเฉพาะตัวเลขสุดท้ายเป็นค่าที่สูงกว่า) <br> 2. ที่ไฟล์ซับเน็ตมาสก์ ให้พิมพ์ที่อยู่ IP ซับเน็ตเดียวกันกับที่คุณเคยสังเกตมาก่อน <br> 3. ที่ Default Gateway ให้พิมพ์ Default Gateway เดียวกันกับที่คุณเคยสังเกตมาก่อน </p></blockquote> <p> ข. เลือก <strong> ใช้ที่อยู่เซิร์ฟเวอร์ DNS ต่อไปนี้ </strong> : </p> <blockquote><p> 1. ที่ Preferred DNS Server ให้พิมพ์ที่อยู่ DNS ที่คุณเคยสังเกตมาก่อน </p></blockquote> <p> ค. เมื่อเสร็จแล้วให้คลิก <strong> ตกลง </strong> สองครั้งและ <strong> ปิด </strong> เพื่อปิดคุณสมบัติของอแด็ปเตอร์ </p> <blockquote> <p><img src=\"images/image_thumb-11-850.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 8. ตอนนี้ ลองเชื่อมต่อกับคอมพิวเตอร์เดสก์ท็อประยะไกล ปัญหาควรได้รับการแก้ไข </p> <p> นั่นคือทั้งหมดที่! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}