{"title":"การแก้ไข: รีเซ็ตระยะเวลาผ่อนผัน 120 วันบนเซิร์ฟเวอร์ RDS 2016/2012","content":"<p> หากคุณได้ติดตั้งเซิร์ฟเวอร์ RDS 2016 เพื่อวัตถุประสงค์ในการทดสอบ และระยะเวลาผ่อนผันการให้สัญญาอนุญาต RDS หมดอายุแล้ว โปรดอ่านต่อด้านล่างเพื่อเรียนรู้วิธีการรีเซ็ตระยะเวลาผ่อนผัน 120 วัน ดังที่คุณอาจทราบเมื่อคุณติดตั้ง RDS Server 2016 คุณมีเวลา 120 วันในการติดตั้งใบอนุญาตการเข้าถึงไคลเอ็นต์ RD (RD CAL) มิฉะนั้น ผู้ใช้จะไม่สามารถสร้างเซสชัน RDP บนเซิร์ฟเวอร์โฮสต์ของเซสชัน RD ได้อีกต่อไป โดยมีข้อผิดพลาด &quot;The remote เซสชันเดสก์ท็อปถูกตัดการเชื่อมต่อเนื่องจากไม่มีเซิร์ฟเวอร์ใบอนุญาตเดสก์ท็อประยะไกลที่พร้อมให้สิทธิ์ใช้งาน&quot; </p> <p><img src=\"images/image_thumb-32-368.png\" alt=\"Reset 120 Days Grace Period on RDS Server 2012/2016\" loading=\"lazy\"></p> <p> </p> <h4> วิธีรีเซ็ตระยะเวลาผ่อนผันการอนุญาตให้ใช้สิทธิ์ RDS บนเซิร์ฟเวอร์ 2012 หรือ 2016 * </h4> <p><strong> * สำคัญ: </strong> ใช้คำแนะนำด้านล่างเฉพาะเมื่อคุณใช้ RDS Server 2016 ในสภาพแวดล้อมการทดสอบ หากคุณต้องการใช้เซิร์ฟเวอร์ RDS ในสภาพแวดล้อมการผลิต ให้ดำเนินการและซื้อ RD CAL </p> <p> หากต้องการขยายระยะเวลาผ่อนผัน 120 วันบนเซิร์ฟเวอร์การให้สิทธิ์ RDS: </p> <p> 1. เปิด Registry Editor และไปที่คีย์ต่อไปนี้: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\\RCM\\GracePeriod </li> </ul> <p> 2. คลิกขวาที่ปุ่ม &#39;GracePeriod&#39; แล้วเลือก <strong> สิทธิ์ </strong></p> <p><img src=\"images/image_thumb-33-473.png\" alt=\"Reset Grace Period RDS 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. จากนั้นคลิก <strong> ขั้นสูง </strong> . </p> <p><img src=\"images/image_thumb-34-585.png\" alt=\"Reset RDS Grace Period\" loading=\"lazy\"></p> <p> </p> <p> 4. เลือก <strong> ผู้ดูแลระบบ </strong> วัตถุและคลิก <strong> แก้ไข </strong> . </p> <p><img src=\"images/image_thumb-18-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. เปลี่ยนการอนุญาตเป็น <strong> ควบคุมทั้งหมด </strong> และคลิก <strong> ตกลง. </strong></p> <p><img src=\"images/image_thumb-19-737.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. คลิกขวาที่ค่า &quot;L$RTMTIMEBOMB…&quot; แล้วเลือก <strong> ลบ </strong> . </p> <p><img src=\"images/image_thumb-35-208.png\" alt=\"Reset RDS Licensing Grace Pariod\" loading=\"lazy\"></p> <p> </p> <p> 7. ปิด Registry Editor และรีสตาร์ทเซิร์ฟเวอร์ RDS </p> <p> นั่นคือทั้งหมดที่! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}