{"title":"การแก้ไข: แล็ปท็อป Dell Inspiron ความเร็ว CPU ช้า (แก้ไขแล้ว)","content":"<p> บทช่วยสอนนี้มีคำแนะนำในการแก้ไขปัญหาความเร็ว CPU ที่ช้ามากบนแล็ปท็อป Dell Inspiron 5558 เมื่อเร็ว ๆ นี้ เพื่อนของฉันนำแล็ปท็อป Dell มาที่ห้องแล็บของฉัน เพราะจู่ๆ คอมพิวเตอร์ก็ช้าเกินไป อันที่จริง แล็ปท็อปทำงานเร็วในอดีต แต่ตอนนี้ต้องใช้เวลานานในการโหลดระบบปฏิบัติการ (Windows 10) และแอปพลิเคชันต่างๆ </p> <p> หลังจากตรวจสอบแล็ปท็อปแล้ว ดังที่คุณเห็นในภาพหน้าจอด้านล่าง ฉันพบว่า CPU ทำงานที่ 0.48GHz เสมอ แทนที่จะเป็น 2.20GHz ดังนั้นฉันจึงเริ่มการแก้ไขปัญหาและในที่สุดฉันก็พบสองวิธีต่อไปนี้เพื่อแก้ไขปัญหาความเร็ว CPU ช้า </p> <p> (ความเร็วของ CPU ลดลงประมาณ 85-87% สำหรับแล็ปท็อป Dell) </p> <p><img src=\"images/image_thumb-16-354.png\" alt=\"FIX Dell Laptop Slow CPU Speed\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> วิธีแก้ไขปัญหาความเร็ว CPU ช้าบนแล็ปท็อป Dell </h4> <h6> วิธีที่ 1 เปลี่ยนอะแดปเตอร์ไฟ AC </h6> <p> ปัญหาความเร็วของ CPU ที่ช้า เป็นปัญหาที่ทราบในแล็ปท็อปของ Dell เมื่อไม่รู้จักอะแดปเตอร์แปลงไฟ AC จากคอมพิวเตอร์อย่างถูกต้อง ในกรณีนี้ และแม้ว่าอะแดปเตอร์จ่ายไฟจะทำงานได้ดี ข้อความเตือนต่อไปนี้จะปรากฏขึ้นเมื่อคุณเปิดเครื่องแล็ปท็อป &quot;ไม่สามารถระบุประเภทอะแดปเตอร์ไฟ AC ได้ ซึ่งจะป้องกันประสิทธิภาพของระบบที่ดีที่สุด&quot; </p> <p> ดังนั้น วิธีแรกในการแก้ไขปัญหาประสิทธิภาพการทำงานที่ช้าบนแล็ปท็อป Dell คือการเปลี่ยนอะแดปเตอร์แปลงไฟด้วยอะแดปเตอร์แปลงไฟ AC ของ Dell ที่เข้ากันได้ใหม่ </p> <p> </p> <h6> วิธีที่ 2. หยุดการควบคุม CPU ด้วย ThrottleStop </h6> <p> หากอะแดปเตอร์ AC ของคุณทำงานได้ดีและแล็ปท็อปของคุณไม่ร้อนเกินไป* อีกวิธีหนึ่งในการแก้ไขปัญหาประสิทธิภาพของระบบที่ช้าในแล็ปท็อป Dell ของคุณ คือการปิดใช้งานการควบคุมปริมาณอะแดปเตอร์แปลงไฟที่ไม่รู้จัก โดยใช้ <strong><a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"> คันเร่ง </a></strong> ยูทิลิตี้ ในการทำเช่นนั้น: </p> <p> 1. ดาวน์โหลด <a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> คันเร่ง </strong></a> ยูทิลิตี้และแตกไฟล์เก็บถาวรที่คุณดาวน์โหลด <br> 2. จากโฟลเดอร์ที่แยกออกมา ให้ดับเบิลคลิกเพื่อเรียกใช้แอปพลิเคชัน &quot;ThorttleStop.exe&quot; * <br> 3. <strong> ยกเลิกการเลือก </strong> <strong> BD PROCHOT </strong> *** ช่องทำเครื่องหมายแล้วคลิก <strong> บันทึก </strong> . </p> <p> * หมายเหตุ: <br> 1. ในการตรวจสอบอุณหภูมิ CPU คุณสามารถใช้ you <a href=\"https://www.alcpu.com/CoreTemp/\" target=\"_blank\" rel=\"nofollow noopener\"> CoreTemp </a> โปรแกรม. <br> 2. หากคุณได้รับข้อผิดพลาด &quot;ไม่พบ MFC120U.dll&quot; หรือ &quot;MSVCR120.dll หายไป&quot; หลังจากเรียกใช้ ThrottleStop ให้ดำเนินการและติดตั้ง <a title=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" href=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Visual C++ Redistributable Packages สำหรับ Visual Studio 2013 </a> . ( <strong> สำคัญ: </strong> หากคุณเป็นเจ้าของ Windows 64 บิต คุณต้องติดตั้งแพ็คเกจ Visual C++ ทั้งรุ่น 64 บิตและ 32 บิต) <br> 3. BD PROCHOT ย่อมาจาก prochot แบบสองทิศทาง PROCHOT ย่อมาจาก processor hot ซึ่งเป็นสัญญาณที่เปิดใช้งานภายใน CPU เมื่ออุณหภูมิถึงประมาณ 100C ถึง 105C ขึ้นอยู่กับหมายเลขรุ่น สัญญาณนี้คือสิ่งที่เริ่มต้นการควบคุมความร้อนเพื่อให้ CPU สามารถทำงานช้าลงและป้องกันไม่ให้เกิดความร้อนสูง การปิดใช้งาน PROCHOT จะทำให้ CPU ของคุณทำงานต่อไปด้วยความเร็วเต็มที่ (ที่มา: <a href=\"http://forum.notebookreview.com/threads/the-throttlestop-guide.531329/\" target=\"_blank\" rel=\"nofollow noopener\"> คู่มือการหยุดคันเร่ง </a> ). </p> <p><img src=\"images/image_thumb-20-666.png\" alt=\"FIX Slow CPU Speed with ThrottleStop\" loading=\"lazy\"></p> <p> 4. ปิด ThrottleStop และคุณทำเสร็จแล้ว ตอนนี้ CPU จะทำงานด้วยความเร็วเต็มที่ จนกว่าคุณจะรีสตาร์ทหรือปิดแล็ปท็อป * </p> <p> * หมายเหตุ: คุณต้องเรียกใช้ <strong> คันเร่ง </strong> โปรแกรมทุกครั้งที่คุณเริ่มคอมพิวเตอร์ หากคุณต้องการทำงานที่ความเร็ว CPU เต็มที่ เพื่อให้ชีวิตของคุณง่ายขึ้น ทำตามขั้นตอนในนี้ <a href=\"https://www.repairwin.com/how-to-start-throttlestop-at-windows-startup/\" target=\"_blank\" rel=\"nofollow noopener\"> คู่มือ </a> เพื่อเริ่ม ThrottleStop โดยอัตโนมัติเมื่อเริ่มต้น Windows </p> <p><img src=\"images/image_thumb-21-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}