{"title":"การแก้ไข: แบตเตอรี่หมดใน Windows 10 (แก้ไขแล้ว)","content":"<p> ด้วย Windows 10 ผู้ใช้หลายคนบ่นว่าแบตเตอรี่แล็ปท็อปหมดเร็วแม้ใช้งานน้อยหรือปิดเครื่องโดยสมบูรณ์ ปัญหา &quot;แบตเตอรี่หมด&quot; ใน Windows 10 เกิดขึ้น ด้วยเหตุผลพื้นฐานสองประการ เหตุผลแรกคือ Windows 10 โหลดแอปพลิเคชั่นพื้นหลังมากเกินไปที่ใช้พลังงานแบตเตอรี่แม้ว่าจะไม่ได้ใช้งานก็ตาม </p> <p> เหตุผลถัดไปที่ทำให้แบตเตอรี่หมด แม้จะปิดเครื่องโดยสมบูรณ์ ก็คือคุณสมบัติ &quot;การเริ่มต้นอย่างรวดเร็ว&quot; Windows 10 (และ Windows 8/8.1) ได้เปิดใช้งานคุณสมบัติ &quot;การเริ่มต้นอย่างรวดเร็ว&quot; โดยค่าเริ่มต้น ซึ่งช่วยให้ระบบสามารถบูตและเริ่มทำงานได้เร็วขึ้น อันที่จริง เมื่อเปิดใช้งาน &quot;การเริ่มต้นอย่างรวดเร็ว&quot; Windows 10 จะไม่ทำการปิดระบบโดยสมบูรณ์และกลับมาทำงานต่อจากสถานะไฮเบอร์เนต </p> <p> ในบทช่วยสอนนี้ คุณจะพบคำแนะนำในการป้องกันไม่ให้ Windows 10 ใช้พลังงานแบตเตอรี่หมด </p> <h4> วิธีแก้ไขปัญหาแบตเตอรี่หมดใน Windows 10 </h4> <p> </p> <h6> ขั้นตอนที่ 1 ป้องกันไม่ให้แอปทำงานในเบื้องหลัง </h6> <p> ขั้นตอนแรกในการแก้ไขปัญหาแบตเตอรี่หมดใน Windows 10 คือการหลีกเลี่ยงแอปที่จะทำงานในพื้นหลัง วิธีปิดใช้งานแอปพื้นหลัง: </p> <p> 1. ไปที่ <strong> เริ่ม </strong> -&gt; <strong> การตั้งค่า </strong> -&gt; <strong> ความเป็นส่วนตัว </strong> . <br> 2. เลือก <strong> แอพพื้นหลัง </strong> ที่ด้านซ้ายแล้วทางด้านขวาให้ใส่ &quot; <strong> ให้แอปทำงานในพื้นหลัง&quot; </strong> เปลี่ยนเป็น <strong> ปิด </strong> หรือเลือกแอปที่คุณไม่ต้องการให้ทำงานบนพื้นหลังทีละรายการแล้วปิด </p> <p><img src=\"images/image_thumb-8-676.png\" alt=\"Prevent Apps from Running in the Background - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> ขั้นตอนที่ 2. เปิดโปรแกรมประหยัดแบตเตอรี่ </h6> <p> ขั้นตอนต่อไป คือการเปิดใช้งานโหมดประหยัดแบตเตอรี่เพื่อยืดอายุการใช้งานแบตเตอรี่โดยจำกัดกิจกรรมในพื้นหลัง </p> <p> 1. ไปที่ <strong> เริ่ม </strong> -&gt; <strong> การตั้งค่า </strong> -&gt; <strong> ระบบ </strong> . <br> 2. ที่ <strong> แบตเตอรี่ </strong> ตัวเลือก: </p> <blockquote> <p> ก. คลิก &quot;ดูว่าแอปใดส่งผลต่ออายุการใช้งานแบตเตอรี่ของคุณ&quot; เพื่อค้นหาการใช้งานแบตเตอรี่จากแอปที่เปิดอยู่ <br> ข. <strong> ตรวจสอบ </strong> &quot; <strong> เปิดโหมดประหยัดแบตเตอรี่โดยอัตโนมัติหากแบตเตอรี่ของฉันเสียด้านล่าง&quot; </strong> ช่องทำเครื่องหมาย และเลื่อนตัวเลื่อนไปยังตำแหน่งที่เหมาะสม <br> ค. นอกจากนี้ เลือก &quot;ลดความสว่างหน้าจอขณะอยู่ในโหมดประหยัดแบตเตอรี่ </p> </blockquote> <p><img src=\"images/image_thumb-9-289.png\" alt=\"turn on battery saver Windows 10\" loading=\"lazy\"></p> <p> </p> <h6> ขั้นตอนที่ 3 ปิดใช้งานการเริ่มต้นอย่างรวดเร็ว </h6> <p> ขั้นตอนต่อไปคือการบังคับให้ Windows 10 ปิดระบบโดยสมบูรณ์ โดยการปิดใช้งานคุณลักษณะการเริ่มต้นอย่างรวดเร็ว </p> <p> 1. ไปที่ <strong> เริ่ม </strong> -&gt; <strong> การตั้งค่า </strong> -&gt; <strong> ระบบ </strong> . <br> 2. ที่ <strong> พลัง </strong> ตัวเลือกคลิก <strong> การตั้งค่าพลังงานเพิ่มเติม </strong></p> <p><img src=\"images/image_thumb-10-405.png\" alt=\"FIX Battery Drain in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. เลือก <strong> เลือกสิ่งที่ปุ่มเปิด/ปิดทำงาน </strong> ทางด้านซ้าย </p> <p><img src=\"images/image_thumb-11-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. จากนั้นคลิก <strong> เปลี่ยนการตั้งค่าที่ไม่สามารถใช้งานได้ในขณะนี้ </strong> . </p> <p><img src=\"images/image_thumb-12-235.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> ยกเลิกการเลือก </strong> <strong> เปิดการเริ่มต้นอย่างรวดเร็ว (แนะนำ) </strong> ตัวเลือกและคลิก <strong> บันทึกการเปลี่ยนแปลง. * </strong></p> <p> * หมายเหตุ: หากไม่ได้เลือกตัวเลือกเริ่มต้นอย่างรวดเร็ว ให้ตรวจสอบและรีสตาร์ทคอมพิวเตอร์ หลังจากรีสตาร์ทแล้ว ให้ยกเลิกการเลือกและรีสตาร์ทคอมพิวเตอร์อีกครั้ง </p> <p><img src=\"images/image_thumb-13-410.png\" alt=\"Turn Off Fast Startup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณ. </p> <h6></h6> <h6> ขั้นตอนที่ 4 ปิดการใช้งานไฮเบอร์เนต </h6> <p> &#39;ไฮเบอร์เนต&#39; เป็นคุณสมบัติด้านพลังงานที่ใช้พลังงานน้อยกว่าโหมดสลีป และเมื่อคุณเปิดเครื่องพีซีอีกครั้ง คุณจะกลับมาที่จุดที่คุณค้างไว้ ในบางกรณี คุณลักษณะไฮเบอร์เนตทำให้พีซี Windows 10 ของคุณปิดไม่สนิท ในการปิดใช้งานไฮเบอร์เนต: </p> <p> </p> <p> 1. ที่ช่องค้นหาประเภท: <strong> พร้อมรับคำสั่ง </strong> หรือ <strong> cmd <br> </strong> 2.  คลิกขวาที่ <strong> พร้อมรับคำสั่งและเลือกเรียกใช้ในฐานะผู้ดูแลระบบ </strong></p> <p><img src=\"images/image_thumb-14-379.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. ที่ command prompt ให้พิมพ์คำสั่งต่อไปนี้แล้วกด <strong> ป้อน </strong></p> <ul> <li><strong> powercfg -h ปิด </strong></li> </ul> <p><img src=\"images/image_thumb-15-234.png\" alt=\"Disable Hibernate Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณ. * </p> <p> * หมายเหตุ: หากคุณต้องการเปิดใช้งานคุณลักษณะ &#39;ไฮเบอร์เนต&#39; อีกครั้ง เพียงพิมพ์คำสั่งนี้ในพรอมต์คำสั่งของผู้ดูแลระบบ: </p> <ul> <li> <ul> <li> powercfg -h ปิด </li> </ul> </li> </ul> <p> </p> <h6> ขั้นตอนที่ 5. แก้ไขการตั้งค่าพลังงานบนอะแดปเตอร์เครือข่าย </h6> <p> วิธีถัดไปในการแก้ไขปัญหาแบตเตอรี่หมดใน Windows 10 คือการปรับเปลี่ยนการตั้งค่าพลังงานบนอะแดปเตอร์เครือข่าย </p> <p> 1. เปิด <strong> ตัวจัดการอุปกรณ์ </strong> . <br> 2. ขยาย <strong> อะแดปเตอร์เครือข่าย </strong> . <br> 3. คลิกขวาที่อะแดปเตอร์เครือข่ายที่ติดตั้งแล้วเลือก <strong> คุณสมบัติ </strong> . <br> 3. เลือก <strong> การจัดการพลังงาน </strong> แท็บ <br> 4. <strong> ยกเลิกการเลือก </strong> <strong> &#39;อนุญาตให้อุปกรณ์นี้ปลุกคอมพิวเตอร์ </strong> &#39; ช่องทำเครื่องหมายและคลิก <strong> ตกลง </strong> . </p> <p><img src=\"images/image_thumb-7-574.png\" alt=\"modify power settings\" loading=\"lazy\"></p> <h6></h6> <h6> ขั้นตอนที่ 6 ย้อนกลับไดรเวอร์อินเทอร์เฟซ Intel Management Engine </h6> <p> หากปัญหาแบตเตอรี่หมดหลังจากติดตั้งการอัปเดต Windows 10 ให้ดำเนินการและย้อนกลับไดรเวอร์สำหรับ Intel Management Engine Interface ในการทำเช่นนั้น: </p> <p> 1.  กด Windows <img src=\"images/image_thumb8_thumb_thumb-592.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> ปุ่มเพื่อเปิดกล่องคำสั่งเรียกใช้ <br> 2. ประเภท: <strong> devmgmt.msc </strong> &amp; คลิก <strong> ตกลง </strong> . <br> 3. ขยาย <strong> อุปกรณ์ระบบ </strong> . <br> 4. คลิกขวาที่ <strong> อินเทอร์เฟซ Intel Management Engine </strong> และเลือก <strong> คุณสมบัติ </strong> . </p> <p><img src=\"images/image_thumb-5-532.png\" alt=\"device properties\" loading=\"lazy\"></p> <p> </p> <p> 5. เลือกแท็บไดรเวอร์แล้วคลิก <strong> ไดร์เวอร์ย้อนกลับ </strong> . * </p> <p> </p> <p> * ถ้า <strong> ไดร์เวอร์ย้อนกลับ </strong> ปุ่มเป็นสีเทา จากนั้นไปที่ไซต์สนับสนุนของผู้ผลิตแล็ปท็อปหรือมาเธอร์บอร์ดเพื่อดาวน์โหลดและติดตั้งไดรเวอร์เวอร์ชันเก่าสำหรับ Intel Management Engine Interface </p> <p><img src=\"images/image_thumb-6-551.png\" alt=\"roll back driver\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณ. </p> <h6> ขั้นตอนที่ 7 คำแนะนำอื่น ๆ เพื่อแก้ไขปัญหาแบตเตอรี่หมด </h6> <p> 1. เปลี่ยนที่ชาร์จของแล็ปท็อปและใช้ที่ชาร์จที่มีตราสินค้าเสมอเพื่อยืดอายุการใช้งานแบตเตอรี่ของคุณ <br> 2. หากแบตเตอรี่แล็ปท็อปของคุณเก่า ความจุอาจลดลงและควรเปลี่ยนใหม่ ในการวินิจฉัยสุขภาพแบตเตอรี่ของคุณ ให้ใช้ปุ่ม <a href=\"http://www.nirsoft.net/utils/battery_information_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> BatteryInfoView </a> ยูทิลิตี้ </p> <p><img src=\"images/image_thumb-16-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแบ่งปันโพสต์บล็อกนี้ในเครือข่ายสังคมออนไลน์เพื่อช่วยกระจายคำเกี่ยวกับปัญหานี้ </p>"}