{"title":"การแก้ไข: Windows ไม่สามารถติดตั้งไฟล์ที่จำเป็น – รหัสข้อผิดพลาด 0x80070570 (แก้ไขแล้ว)","content":"<p> บทช่วยสอนนี้มีคำแนะนำในการแก้ไขข้อผิดพลาดในการติดตั้ง Windows 0x80070570: &quot;Windows ไม่สามารถติดตั้งไฟล์ที่จำเป็น ไฟล์อาจเสียหายหรือสูญหาย ตรวจสอบให้แน่ใจว่าไฟล์ทั้งหมดที่จำเป็นสำหรับการติดตั้งพร้อมใช้งาน และเริ่มการติดตั้งใหม่&quot; ข้อผิดพลาดในการติดตั้ง Windows 0x80070570 มักปรากฏขึ้นเมื่อติดตั้งระบบปฏิบัติการ Windows 10, 8 หรือ 7 จากสื่อการติดตั้ง USB 3.0 </p> <p><img src=\"images/image_thumb-17-309.png\" alt=\"FIX: Windows Cannot Install Required Files 0x80070570\" loading=\"lazy\"></p> <p> </p> <h4> วิธีแก้ไข Windows ไม่สามารถติดตั้งไฟล์ที่จำเป็น – รหัสข้อผิดพลาด 0x80070570 (Windows 10/8/7) </h4> <h6> ขั้นตอนที่ 1 ตัดการเชื่อมต่ออุปกรณ์ที่เชื่อมต่อ </h6> <p> ขั้นตอนแรกในการแก้ไขข้อผิดพลาด 0x80070570 &quot;Windows Cannot Install Required Files&quot; คือการตัดการเชื่อมต่ออุปกรณ์อื่นๆ (เช่น ฮาร์ดดิสก์ไดรฟ์ ฮาร์ดไดรฟ์ USB การ์ด USB Wireless) ที่ไม่จำเป็นต้องติดตั้ง Windows </p> <p> </p> <h6> ขั้นตอนที่ 2. ปิดการใช้งาน <strong> อุปกรณ์รักษาความปลอดภัยในตัว </strong> . </h6> <p> ข้อผิดพลาดในการติดตั้ง Windows 10 &quot;Windows Cannot Install Required Files&quot; ซึ่งมักปรากฏบนพีซี HP โดยที่ &#39;Embedded Security Device&#39; ถูกเปิดใช้งานโดยค่าเริ่มต้น เพื่อหลีกเลี่ยงข้อผิดพลาดให้ดำเนินการและปิดการใช้งานอุปกรณ์รักษาความปลอดภัยในการตั้งค่า BIOS ในการทำเช่นนั้น: </p> <p> 1. <strong> เปิดเครื่อง </strong> พีซีและ <strong> กด </strong> <strong> F10 </strong> คีย์เพื่อเข้าสู่การตั้งค่า BIOS <br> 2. ใช้ปุ่มลูกศร ไปที่ <strong> ความปลอดภัย </strong> -&gt; <strong> ความปลอดภัยของอุปกรณ์ </strong> แล้วกด <strong> ป้อน <br> </strong> 3. ตั้งค่า <strong> อุปกรณ์รักษาความปลอดภัยในตัว </strong> จาก &#39;อุปกรณ์ที่พร้อมใช้งาน&#39; ถึง <strong> อุปกรณ์ที่ซ่อนอยู่ </strong></p> <p><img src=\"images/image_thumb-23-480.png\" alt=\"FIX: HP SLOW RESTART\" loading=\"lazy\"></p> <p> </p> <p> 4. กด <strong> F10 </strong> คีย์เพื่อใช้การเปลี่ยนแปลง <br> 5. <b> บันทึกการเปลี่ยนแปลงและออกจาก f </b> การตั้งค่า rom bios <br> 6. ติดตั้ง Windows 10 </p> <h6> ขั้นตอนที่ 3 ใช้พอร์ต USB หรือสื่อการติดตั้งอื่น </h6> <p> ข้อผิดพลาด &quot;Windows Can not Install Required Files&quot; โดยทั่วไปจะเกิดขึ้นหากคุณตั้งค่า Windows 10 จากสื่อ USB ที่เชื่อมต่อกับพอร์ต USB 3.0 ดังนั้น ให้ลองทำดังต่อไปนี้: </p> <ol> <li> ตรวจสอบว่าคุณสามารถปิดใช้งานการสนับสนุน USB 3.0 จากการตั้งค่า BIOS ได้หรือไม่ </li> <li> เชื่อมต่อไดรฟ์ USB เข้ากับพอร์ต USB 2.0 (หรือกับพอร์ต USB อื่น) </li> <li> หากพีซีของคุณไม่มีพอร์ต USB 2.0 ให้ติดตั้ง Windows 10 จากแฟลชไดรฟ์ USB 2.0 หรือจากดีวีดี </li> <li> หากคุณต้องการติดตั้ง Windows 10 ลงในระบบที่ใช้ UEFI ให้ใช้ยูทิลิตี้ RUFUS และสร้างสื่อการติดตั้ง USB สำหรับ &quot;UEFI&quot; หากระบบของคุณไม่รองรับ UEFI ให้สร้างสื่อการติดตั้ง USB สำหรับระบบที่ใช้ &quot;ดั้งเดิม&quot; (คำแนะนำโดยละเอียดในการทำเช่นนั้นสามารถดูได้ที่นี่: <a href=\"https://www.repairwin.com/create-windows-usb-with-rufus-iso-to-usb/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีสร้าง Windows USB Boot Drive ด้วยยูทิลิตี้ Rufus </a></li> <li> รี- <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> ดาวน์โหลดไฟล์ Windows ISO </a> และสร้างสื่อการติดตั้ง Windows USB ใหม่โดยใช้ RUFUS </li> </ol> <p> </p> <h6> ขั้นตอนที่ 4 ติดตั้ง Windows 10 จากอุปกรณ์ USB รุ่นเก่า </h6> <p> หากคุณได้รับข้อผิดพลาด &quot;Windows Cannot Install Required Files&quot; เมื่อคุณติดตั้ง Windows 10 จาก USB Media ที่สร้างขึ้นสำหรับระบบ UEFI ให้สร้าง USB Media ใหม่สำหรับระบบ Legacy และบูตจากอุปกรณ์ USB รุ่นเก่าเพื่อติดตั้ง Windows 10 </p> <p> </p> <h6> ขั้นตอนที่ 5. วินิจฉัยปัญหาหน่วยความจำ </h6> <p> ขั้นตอนที่สามในการแก้ไขข้อผิดพลาดในการตั้งค่า Windows 0x80070570 คือการวินิจฉัยปัญหา RAM ของคุณ ให้ทำตามคำแนะนำจากบทความต่อไปนี้: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีวินิจฉัยปัญหาหน่วยความจำคอมพิวเตอร์ด้วย Memtest86+ </a></li> </ul> <p> </p> <h6> ขั้นตอนที่ 6 ตรวจสอบฮาร์ดไดรฟ์เพื่อหาปัญหา </h6> <p> ข้อผิดพลาดในการติดตั้ง Windows 0x80070570 สามารถเกิดขึ้นได้ หากฮาร์ดไดรฟ์เสียหาย ดังนั้นให้ดำเนินการและวินิจฉัยข้อผิดพลาดของ HDD และเปลี่ยนฮาร์ดไดรฟ์หากจำเป็น โดยทำตามคำแนะนำในคู่มือนี้: </p> <ul> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> เครื่องมือทดสอบและวินิจฉัยฮาร์ดไดรฟ์ที่ดีที่สุดเพื่อตรวจสอบสุขภาพของฮาร์ดดิสก์ </a></li> </ul> <h5></h5> <h6> ขั้นตอนที่ 7 ตรวจสอบการเชื่อมต่อสายเคเบิลและฮาร์ดแวร์ </h6> <p> หากหลังจากทำตามขั้นตอนข้างต้นแล้ว ข้อผิดพลาดในการติดตั้ง Windows 0x80070570 ยังคงปรากฏขึ้น แสดงว่า: </p> <p> 1. ตรวจสอบการเชื่อมต่อสายเคเบิลทั้งหมดและตรวจสอบให้แน่ใจว่าได้เชื่อมต่อฮาร์ดไดรฟ์อย่างถูกต้อง นอกจากนี้ หากคุณเป็นเจ้าของเดสก์ท็อปพีซี ให้เปลี่ยนสายเคเบิลข้อมูลของ HDD <br> 2. ลองติดตั้ง Windows โดยใช้การ์ดวิดีโอ (VGA) อื่น ถ้าทำได้ <br> 3. อัพเดตไบออสของคุณ </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> กรุณาแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดียิ่งขึ้น: ชอบและแบ่งปันโพสต์บล็อกนี้ในเครือข่ายสังคมเพื่อช่วยกระจายคำเกี่ยวกับปัญหานี้ </p>"}