{"title":"การแก้ไข: มีการติดตั้ง Outlook Add-In สำหรับผู้ใช้ทั้งหมดและไม่สามารถลบออกได้ (แก้ไขแล้ว)","content":"<p> หากคุณไม่สามารถปิดใช้งานหรือเปิดใช้งาน Add-in ของ Outlook ได้เนื่องจากข้อผิดพลาด &quot; <em> โปรแกรมเสริมได้รับการติดตั้งสำหรับผู้ใช้ทุกคนในคอมพิวเตอร์เครื่องนี้ และสามารถเชื่อมต่อหรือยกเลิกการเชื่อมต่อโดยผู้ดูแลระบบเท่านั้น </em> &quot; โปรดอ่านต่อด้านล่างเพื่อแก้ไขปัญหา </p> <p><img src=\"images/image_thumb-76-527.png\" alt=\"The add-is installed for all users on this computer, and can only be connected or disconnected by an administrator\" loading=\"lazy\"></p> <p> ข้อผิดพลาด &quot;Add-in can only be Disabled by an Administrator&quot; ปรากฏขึ้นเนื่องจากเมื่อคุณติดตั้ง Add-in คุณเลือกที่จะติดตั้งสำหรับผู้ใช้ทั้งหมดบนคอมพิวเตอร์ ในกรณีนี้ วิธีเดียวที่จะแก้ไขข้อผิดพลาดคือการถอนการติดตั้ง Add-in โดยใช้สิทธิ์ของผู้ดูแลระบบ </p> <h2> วิธีแก้ไข: ไม่สามารถเปิดหรือปิดใช้งาน Add-in ได้เนื่องจากมีการติดตั้งสำหรับผู้ใช้ทั้งหมดใน Outlook, Word หรือ Excel </h2> <p> หากคุณไม่สามารถลบหรือเปิดใช้งาน Add-in ในแอปพลิเคชัน Microsoft Office ได้ เนื่องจากข้อผิดพลาด &quot; <em> โปรแกรมเสริมนี้ได้รับการติดตั้งสำหรับผู้ใช้ทุกคนในคอมพิวเตอร์เครื่องนี้ และสามารถเชื่อมต่อหรือยกเลิกการเชื่อมต่อโดยผู้ดูแลระบบเท่านั้น&quot;, </em> เปิดแอปพลิเคชันที่เกี่ยวข้องในฐานะผู้ดูแลระบบและดำเนินการลบ Add-in โดยไม่มีปัญหา ในการทำเช่นนั้น: </p> <p><strong> 1. </strong> คลิกขวาที่แอปพลิเคชัน Office ซึ่งคุณจะพบข้อผิดพลาดที่กล่าวถึงข้างต้น (เช่น Outlook) แล้วเลือก <strong> เรียกใช้ในฐานะผู้ดูแลระบบ * </strong></p> <p> * หมายเหตุ: <strong><br> </strong> 1. หากคุณไม่เห็นตัวเลือก &quot;เรียกใช้ผู้ดูแลระบบ&quot; ให้กด . ค้างไว้ <strong> SHIFT </strong> กุญแจและ <strong> คลิกขวา </strong> ที่แอป Office คุณพบข้อผิดพลาด <br> 2. หากคุณคลิกขวาที่แอป Office จาก Windows 10 <strong> เริ่ม </strong> เมนู <img src=\"images/image_thumb2_thumb_thumb-340.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> โปรแกรม </strong> , ไปที่ <strong> มากกว่า </strong> &gt; <strong> เรียกใช้ในฐานะผู้ดูแลระบบ </strong></p> <p><img src=\"images/image_thumb-77-661.png\" alt=\"FIX: Unable to Enable or Disable Add-in \" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> เมื่อถูกขอให้อนุญาตให้แอปนี้ทำการเปลี่ยนแปลงกับอุปกรณ์ของคุณ ให้เลือก <strong> ใช่. </strong></p> <p><img src=\"images/image_thumb-78-120.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. หลังจากเปิดแอปพลิเคชัน Office ให้ดำเนินการปิดใช้งานหรือเปิดใช้งาน Add-in ที่คุณต้องการ คราวนี้ Add-in จะถูกลบออกโดยไม่มีปัญหา </p> <p> แค่นั้นแหละ! แจ้งให้เราทราบหากคู่มือนี้ช่วยคุณโดยแสดงความคิดเห็นเกี่ยวกับประสบการณ์ของคุณ โปรดกดไลค์และแชร์คู่มือนี้เพื่อช่วยเหลือผู้อื่น </p>"}