{"title":"การแก้ไข: HP Smart Error – ไม่ทราบสถานะเครื่องพิมพ์ (แก้ไขแล้ว)","content":"<p> บทช่วยสอนนี้มีคำแนะนำในการแก้ปัญหา <a href=\"https://www.hpsmart.com/us/en\" target=\"_blank\" rel=\"nofollow noopener\"> HP Smart </a> ข้อผิดพลาดของแอป &quot;ไม่ทราบสถานะเครื่องพิมพ์&quot; ในระบบปฏิบัติการ Windows 10 &quot;สถานะเครื่องพิมพ์ที่ไม่รู้จัก&quot; ในแอปพลิเคชัน HP SMART อาจปรากฏขึ้นโดยไม่ทราบสาเหตุ และป้องกันไม่ให้ผู้ใช้ใช้เพื่อสแกนหรือฟังก์ชันพิมพ์บนเครื่องพิมพ์ </p> <p> รายละเอียดปัญหา: ในคอมพิวเตอร์ Windows 10 ที่ติดตั้งเครื่องพิมพ์ HP ข้อผิดพลาด &quot;ไม่ทราบสถานะเครื่องพิมพ์&quot; ปรากฏขึ้นในแอป HP Smart แม้ว่าเครื่องพิมพ์จะพิมพ์โดยไม่มีปัญหาใดๆ จากเว็บหรือแอปพลิเคชันอื่นๆ ปัญหาหลักของข้อผิดพลาดนี้คือ ผู้ใช้ไม่สามารถใช้ตัวเลือก SCAN ในแอปพลิเคชัน HP Smart เพื่อสแกนเอกสารได้ </p> <p> </p> <p> </p> <p><img src=\"images/image_thumb-23-787.png\" alt=\"FIX: HP Smart \" printer status unknown loading=\"lazy\"></p> <h4> การแก้ไข: &quot;ไม่ทราบสถานะเครื่องพิมพ์&quot; ในแอพ HP Smart (วินโดว์ 10). </h4> <p> 1. จากเมนูเริ่ม <img src=\"images/image_thumb2_thumb_thumb-697.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> คลิกการตั้งค่า <img src=\"images/image_thumb-66-822.png\" alt=\"image\" loading=\"lazy\"> แล้วเปิด <strong> แอพ </strong> . </p> <p><img src=\"images/image_thumb-25-257.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. คลิกที่ <strong> แอพ HP Smart </strong> แล้วคลิก <strong> ตัวเลือกขั้นสูง </strong> . </p> <p><img src=\"images/image_thumb-26-912.png\" alt=\"FIX: Printer Status unknown on HP Smart app\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. คลิก <strong> รีเซ็ต </strong> ปุ่ม. </p> <p><img src=\"images/image_thumb-27-494.png\" alt=\"Fix Printer Status Unknow on HP Smart app\" loading=\"lazy\"></p> <p> 4. เมื่อการรีเซ็ตเสร็จสิ้น ให้ปิดหน้าต่างทั้งหมดแล้วเปิด <strong> HP Smart </strong> แอพ <br> 5. โดยปกติข้อผิดพลาด &quot;ไม่ทราบสถานะเครื่องพิมพ์&quot; ควรได้รับการแก้ไข เพียงคลิก <strong> ติดตั้ง </strong> เพื่อเปิดใช้งานคุณสมบัติ HP Smart ทั้งหมด เท่านี้ก็เรียบร้อย! * </p> <p><img src=\"images/image_thumb-28-849.png\" alt=\"image\" loading=\"lazy\"></p> <p> * หมายเหตุ: หากข้อผิดพลาด HP Smart &quot;ไม่ทราบสถานะเครื่องพิมพ์&quot; ยังคงมีอยู่ ให้ลองทำดังนี้: </p> <blockquote><p> 1. <strong> ปิดตัวลง </strong> คอมพิวเตอร์. <br> 2. <strong> ตัดการเชื่อมต่อ </strong> <strong> สายไฟจากเครื่องพิมพ์ </strong> เป็นเวลา 1 นาที <br> 3. หลังจาก 1 นาที <strong> เปิดเครื่อง </strong> ของคุณ <strong> คอมพิวเตอร์ </strong> . <br> 4. หลังจากบูทเป็น Windows 10 แล้ว <strong> เสียบสายไฟของเครื่องพิมพ์อีกครั้ง </strong> และตรวจสอบว่าข้อผิดพลาด &quot;ไม่ทราบสถานะเครื่องพิมพ์&quot; ในแอป HP Smart ได้รับการแก้ไขแล้วหรือไม่ หากข้อผิดพลาดยังคงอยู่ ให้ดำเนินการถอนการติดตั้งและติดตั้งเครื่องพิมพ์และซอฟต์แวร์ของเครื่องพิมพ์ใหม่บนพีซีของคุณ </p></blockquote> <p> นั่นคือทั้งหมดที่! โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}