{"title":"การแก้ไข: วิดีโอ DXGKRNL ข้อผิดพลาดร้ายแรงใน Windows 10 (แก้ไขแล้ว)","content":"<p> หากคุณพบข้อผิดพลาดหน้าจอสีน้ำเงิน &quot;VIDEO DXGKRNL FATAL ERROR&quot; ใน Windows 10 ให้ทำตามคำแนะนำด้านล่างเพื่อแก้ไขปัญหา </p> <p> ข้อผิดพลาด BSOD ของ Windows 10 &quot; <em> พีซีของคุณประสบปัญหาและจำเป็นต้องรีสตาร์ท เราแค่รวบรวมข้อมูลข้อผิดพลาด จากนั้นเราจะเริ่มต้นใหม่ให้คุณ หากคุณต้องการทราบข้อมูลเพิ่มเติม คุณสามารถค้นหาข้อผิดพลาดนี้ทางออนไลน์ในภายหลัง: VIDEO DXGKRNL FATAL ERROR&quot;, </em> มักจะระบุว่ามีปัญหากับไดรเวอร์วิดีโอ </p> <p><img src=\"images/image_thumb-7-129.png\" alt=\"FIX: VIDEO DXGKRNL FATAL ERROR in Windows 10\" loading=\"lazy\"></p> <p> บทช่วยสอนนี้มีคำแนะนำทีละขั้นตอนเพื่อแก้ไขข้อผิดพลาดหน้าจอสีน้ำเงิน &quot;VIDEO DXGKRNL FATAL ERROR&quot; ใน Windows 10 </p> <h2> วิธีแก้ไข: วิดีโอ Windows 10 DXGKRNL ข้อผิดพลาดร้ายแรง </h2> <h3> ขั้นตอนที่ 1 แก้ไข VIDEO DXGKRNL FATAL ERROR โดยการถอนการติดตั้ง/ติดตั้งไดรเวอร์วิดีโอใหม่ </h3> <p> 1. เปิด <strong> ตัวจัดการอุปกรณ์ </strong> . ในการทำเช่นนั้น: </p> <ol> <li> <ol> <li> กด Windows <img src=\"images/image_thumb8_thumb_thumb-153.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> ปุ่มเพื่อเปิดกล่องคำสั่งเรียกใช้ </li> <li> ในกล่อง &quot;เปิด&quot; พิมพ์: <strong> devmgmt.msc </strong> &amp; คลิก <strong> ตกลง </strong> . </li> </ol> </li> </ol> <blockquote> <p><img src=\"images/image_thumb-5-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p></blockquote> <p> 2. <strong> ขยาย </strong> <strong> อะแดปเตอร์แสดงผล <br> </strong> 3. <strong> คลิกขวา </strong> บนการ์ดแสดงผลที่ติดตั้งและเลือก and <strong> ถอนการติดตั้งอุปกรณ์ </strong></p> <p><img src=\"images/image_thumb-46-240.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. ในหน้าต่างถัดไป หากคุณมีตัวเลือก: &quot; <strong> ลบซอฟต์แวร์ไดรเวอร์สำหรับอุปกรณ์นี้ </strong> &quot; เลือกแล้วคลิก <strong> ตกลง </strong> เพื่อลบไดรเวอร์ที่ติดตั้งออกจากคอมพิวเตอร์ </p> <p> 5. หลังจากถอนการติดตั้ง <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณและไปที่ <strong> ตัวจัดการอุปกรณ์ </strong> อีกครั้ง <br> 6. คลิกขวาที่ชื่อคอมพิวเตอร์ (ด้านบน) แล้วเลือก <strong> สแกนหาการเปลี่ยนแปลงฮาร์ดแวร์ </strong></p> <p><img src=\"images/image_thumb-8-911.png\" alt=\"Scan for hardware changes\" loading=\"lazy\"></p> <p> </p> <p> 7. ให้ Windows ตรวจหาและติดตั้งไดรเวอร์การแสดงผล จากนั้น <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณอีกครั้งและตรวจสอบว่า &quot;VIDEO DXGKRNL FATAL ERROR&quot; ยังคงมีอยู่หรือไม่ * </p> <p> * หมายเหตุ: หาก Windows ไม่สามารถติดตั้งไดรเวอร์การแสดงผลโดยอัตโนมัติโดยอัตโนมัติ หรือหากคุณยังคงพบข้อผิดพลาดหน้าจอสีน้ำเงิน ให้ไปยังขั้นตอนถัดไป </p> <p> </p> <h3><br clear=\"all\"> ขั้นตอนที่ 2 ติดตั้งไดรเวอร์วิดีโอใหม่จากเว็บไซต์ของผู้ผลิต </h3> <p> 1. ไปที่ <strong> ตัวจัดการอุปกรณ์ </strong> และ <strong> ถอนการติดตั้ง </strong> การ์ดแสดงผลที่ติดตั้ง * </p> <p> * หมายเหตุ: หากคุณเป็นเจ้าของแล็ปท็อปที่มีการ์ดแสดงผลสอง (2) ตัว ให้ถอนการติดตั้งทั้งคู่ </p> <p> 2. ไปที่ไซต์สนับสนุนของผู้ผลิตคอมพิวเตอร์ (หรือการ์ดแสดงผล) และดาวน์โหลดไดรเวอร์ล่าสุดสำหรับการ์ดแสดงผลของคุณ </p> <ul> <li> <ul> <li> สำหรับ <strong> NVIDIA </strong> ตาม GPU นำทางไปที่ <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> หน้าการค้นหาไดรเวอร์ขั้นสูงของ NVIDIA </a> . </li> <li> สำหรับ <strong> AMD </strong> ตาม GPU นำทางไปที่ <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> ศูนย์ดาวน์โหลดไดรเวอร์ AMD (ATI) </a></li> <li> สำหรับ <strong> อินเทล </strong> ตาม GPU นำทางไปที่ <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> ศูนย์ดาวน์โหลดกราฟิก Intel </a></li> </ul> </li> </ul> <p> 3. ดำเนินการและติดตั้งไดรเวอร์ที่ดาวน์โหลดมา * </p> <p><strong> * โน๊ตสำคัญ: </strong> หากคุณเป็นเจ้าของแล็ปท็อปที่มีการ์ดแสดงผลสอง (2) ตัว ให้ดำเนินการติดตั้งไดรเวอร์สำหรับ AMD หรืออะแดปเตอร์ NVIDIA ก่อน แล้วจึงรีสตาร์ทแล็ปท็อป หลังจากรีสตาร์ทแล้ว ให้ดำเนินการและติดตั้งไดรเวอร์สำหรับการ์ดแสดงผล INTEL จากนั้นรีสตาร์ทแล็ปท็อปของคุณอีกครั้ง </p> <p> 4. หลังการติดตั้ง <strong> เริ่มต้นใหม่ </strong> พีซีของคุณและตรวจสอบว่า VIDEO DXGKRNL FATAL ERROR ได้รับการแก้ไขแล้วหรือไม่ ถ้าไม่ใช่ ให้ไปยังขั้นตอนถัดไป </p> <p> </p> <h3><br clear=\"all\"> ขั้นตอนที่ 3 ซ่อมแซม DirectX เพื่อแก้ไข VIDEO DXGKRNL FATAL ERROR </h3> <p> VIDEO DXGKRNL FATAL ERROR ระบุว่ามีปัญหากับไดรเวอร์ DirectX ของ Microsoft ดังนั้น ดำเนินการซ่อมแซม DirectX </p> <p> 1. ดาวน์โหลด <a href=\"https://www.microsoft.com/en-us/download/details.aspx?displaylang=en&id=35\" target=\"_blank\" rel=\"nofollow noopener\"> โปรแกรมติดตั้งเว็บรันไทม์ของผู้ใช้ปลายทาง DirectX </a> . <br> 2. เรียกใช้ไฟล์ที่ดาวน์โหลด (dxwebsetup.exe) และปฏิบัติตามคำแนะนำบนหน้าจอเพื่อติดตั้งส่วนประกอบเสริม DirectX Runtime </p> <p><img src=\"images/image_thumb-9-847.png\" alt=\"Install DirectX Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. เมื่อติดตั้งเสร็จ <strong> เริ่มต้นใหม่ </strong> พีซีของคุณ </p> <p> 4. หลังจากรีสตาร์ทแล้ว ให้ไปที่ <strong> เริ่ม <img src=\"images/image_thumb-55-571.png\" alt=\"image\" loading=\"lazy\"> -&gt; การตั้งค่า </strong> -&gt; <strong> อัปเดตและความปลอดภัย -&gt; </strong> และคลิก <strong> ตรวจสอบสำหรับการอัพเดต. </strong></p> <p><img src=\"images/image_thumb-76-281.png\" alt=\"Windows 10 - Check For Updates \" loading=\"lazy\"></p> <p> 5. หลังจากติดตั้งการอัปเดตแล้ว ให้รีสตาร์ทพีซีของคุณอีกครั้งและตรวจสอบว่าข้อผิดพลาด BSOD ได้รับการแก้ไขแล้วหรือไม่ ถ้าไม่ใช่ ให้ไปยังขั้นตอนถัดไป </p> <p> </p> <h3><br clear=\"all\"> ขั้นตอนที่ 4 ซ่อมแซมไฟล์ระบบ Windows 10 </h3> <p> 1. เปิด <strong> พร้อมรับคำสั่งในฐานะผู้ดูแลระบบ </strong> . <br> 2. ในพรอมต์คำสั่งให้คำสั่งต่อไปนี้แล้วกด <strong> ป้อน: </strong></p> <ul> <li><strong> DISM.exe /Online /Cleanup-image /Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-176.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. เมื่อการดำเนินการ DISM เสร็จสิ้น ให้พิมพ์คำสั่งต่อไปนี้แล้วกด <strong> ป้อน </strong> : </p> <ul> <li><strong> sfc /scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-464.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. ตอนนี้รอจนกว่า System File Checker จะซ่อมแซม Windows System Files <br> 5. เมื่อเสร็จแล้ว <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณและตรวจสอบว่าข้อผิดพลาดยังคงมีอยู่หรือไม่ </p> <p> </p> <h3><br clear=\"all\"> ขั้นตอนที่ 5. วิเคราะห์ไฟล์บันทึก Minidump (BSOD) </h3> <p> เมื่อ Windows ขัดข้องด้วยหน้าจอสีน้ำเงิน ให้เก็บรายละเอียดของหน้าจอ BSoD ไว้ในไฟล์ขนาดเล็กซึ่งเรียกว่า &quot; <strong> MiniDump </strong> &quot;การวิเคราะห์ของ <strong> มินิดัมพ์ </strong> ไฟล์สามารถช่วยคุณแก้ไขปัญหาและแก้ไขปัญหา VIDEO DXGKRNL FATAL ERROR หน้าจอสีน้ำเงิน เพื่อให้งานนี้สำเร็จ ให้ทำตามคำแนะนำในบทความนี้: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีวิเคราะห์ไฟล์ MiniDump ด้วย BlueScreenView </a> . </p> <p> </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}