{"title":"การแก้ไข: การอัปเดต Windows 10 ไม่สามารถถอนการติดตั้ง Avira AntiVir (แก้ไขแล้ว)","content":"<p> บนคอมพิวเตอร์ที่ใช้ Windows 10 ข้อความต่อไปนี้จะปรากฏขึ้นเมื่อพยายามอัปเดต Windows 10 เป็นเวอร์ชัน 1803 หรือ 1809: &quot;ต้องถอนการติดตั้งแอปบางตัว: ต้องถอนการติดตั้งโปรแกรมเหล่านี้เนื่องจากไม่รองรับการอัปเกรด: Avira Antivirus&quot; และ เมื่อกดปุ่ม &quot;ถอนการติดตั้งและดำเนินการต่อ&quot; ข้อผิดพลาดต่อไปนี้จะปรากฏขึ้น: &quot;เราไม่สามารถถอนการติดตั้งแอปเหล่านี้: Avira AntiVir&quot; สิ่งที่ตลกของปัญหานี้คือ Avira Antivir (Antivirus) ไม่ได้ติดตั้งบนพีซี (ไม่อยู่ในรายการโปรแกรมที่ติดตั้ง) </p> <p><img src=\"images/image_thumb-10-929.png\" alt=\"Windows 10 Update Couldn't uninstall Avira AntiVir\" loading=\"lazy\"></p> <p> ปัญหา &quot;ไม่สามารถถอนการติดตั้ง Avira AntiVir&quot; ระหว่างการอัปเกรด Windows 10 v1803 เกิดขึ้นเนื่องจากโปรแกรมอัปเดต ค้นหาไฟล์บางไฟล์ในพีซีของคุณที่เชื่อมโยงกับ Avira Antivirus และยังไม่ได้ลบออกระหว่างถอนการติดตั้ง Avira * </p> <p> * หมายเหตุ: หากคุณมีโปรแกรม &quot;Avira Antivirus&quot; ติดตั้งอยู่ในเครื่องของคุณจริงๆ ให้ถอนการติดตั้งโดยใช้ตัวเลือก &quot;โปรแกรมและคุณลักษณะ&quot; ในแผงควบคุม จากนั้นดำเนินการอัปเดตระบบของคุณเป็น Windows 10 v1803 (หรือ 1809) หลังจากอัปเกรดแล้ว ให้ดาวน์โหลดและติดตั้ง Avira Antivirus เวอร์ชันล่าสุดในระบบของคุณ </p> <h4> วิธีแก้ไขข้อผิดพลาดการอัปเดต Windows 10: ไม่สามารถถอนการติดตั้ง Avira AntiVir </h4> <p> </p> <p> 1. เริ่ม Windows ใน <strong> โหมดปลอดภัย </strong> . ในการทำเช่นนั้น: </p> <ul> <li> <ul> <li> กดปุ่ม Windows <img src=\"images/image_thumb8_thumb_thumb-432.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> ปุ่มเพื่อเปิดกล่องคำสั่งเรียกใช้ </li> <li> พิมพ์ <strong> msconfig </strong> แล้วกด <strong> ป้อน </strong> . </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-47-667.png\" alt=\"msconfig\" loading=\"lazy\"></p> <ul> <li> <ul> <li> ที่ <strong> บูต </strong> แท็บ เลือก <strong> บูตปลอดภัย </strong> ตัวเลือก จากนั้นคลิก <strong> ตกลง </strong> และรีสตาร์ทคอมพิวเตอร์ของคุณ </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-48-342.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 2. หลังจากรีสตาร์ทแล้ว ให้เปิด file explorer และลบไฟล์ <strong> avipbb.sys </strong> ไฟล์จากตำแหน่งต่อไปนี้: </p> <ul> <li> C:\\Windows\\System32\\drivers </li> <li> C:\\Windows\\SysWOW64\\drivers </li> </ul> <p> </p> <p> 3. ดำเนินการลบจากตำแหน่งด้านบนทุกไฟล์อื่นที่ชื่อว่า <strong> avipbb </strong> แม้จะมีการขยาย </p> <p> 4. จากนั้นลบ <strong> Avira </strong> โฟลเดอร์จากตำแหน่งต่อไปนี้: </p> <ul> <li> (Windows 64 บิต) : C:\\Program Files (x86)\\ <strong> Avira\\Antivirus </strong></li> <li> (Windows 32 บิต): C:\\Program Files\\ <strong> Avira\\Antivirus </strong></li> </ul> <p> 5. วิ่ง <strong> msconfig </strong> อีกครั้ง <br> 6. ที่แท็บ General คลิก Normal startup และคลิก <strong> ตกลง </strong> เพื่อรีสตาร์ทคอมพิวเตอร์ตามปกติ </p> <p><img src=\"images/image_thumb-11-949.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. ตรวจสอบและติดตั้งโปรแกรมปรับปรุง * </p> <p> * หมายเหตุ: หากคุณยังคงพบข้อผิดพลาด &quot;ไม่สามารถถอนการติดตั้ง Avira AntiVir&quot; ระหว่างการอัปเดต ให้ดาวน์โหลดและเรียกใช้ <a href=\"https://www.avira.com/en/support-download-avira-registrycleaner/1//\" target=\"_blank\" rel=\"nofollow noopener\"> Avira Registry Cleaner </a> . </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}