{"title":"การแก้ไข: ไฟล์ไม่มีสตรีมเสียงหรือวิดีโอใน Adobe Premiere","content":"<p> หากคุณได้รับข้อผิดพลาด Adobe Premiere &#39;File Import Failure&#39; พร้อมคำอธิบาย &quot;ไฟล์ไม่มีไอน้ำหรือวิดีโอ&quot; อาจปรากฏขึ้นขณะนำเข้าไฟล์วิดีโอ MP4 ให้อ่านต่อด้านล่าง ข้อผิดพลาด &quot;ไฟล์ไม่มีไอน้ำหรือวิดีโอ&quot; ใน Adobe Premiere อาจปรากฏขึ้นแม้ว่าวิดีโอจะเล่นอย่างถูกต้องในเครื่องเล่นสื่ออื่นๆ (VLC, Windows Media Player เป็นต้น) </p> <p><img src=\"images/image_thumb-43-349.png\" alt=\"FIX: File has no audio or video streams on Adobe Premiere\" loading=\"lazy\"></p> <p> </p> <p> ข้อผิดพลาด Adobe Premiere ขณะนำเข้าไฟล์วิดีโออาจปรากฏขึ้นจากหลายสาเหตุ ดังนั้นในบทช่วยสอนนี้ คุณจะพบวิธีการทั้งหมดที่มีในการแก้ไขปัญหา </p> <h4> วิธีแก้ไข: &quot;ไฟล์ไม่มีเสียงหรือวิดีโอ&quot; ใน Adobe Premiere </h4> <h6> วิธีที่ 1. ติดตั้ง QuickTime </h6> <p> ก่อนอื่นตรวจสอบให้แน่ใจว่าคุณได้ติดตั้งล่าสุด <a href=\"https://support.apple.com/downloads/quicktime\" target=\"_blank\" rel=\"nofollow noopener\"> เวลาด่วน </a> บนพีซีของคุณแล้วลองนำเข้าไฟล์ mp4 ใน Adobe Premiere </p> <p> </p> <h6> วิธีที่ 2. เปลี่ยนชื่อไฟล์วิดีโอ </h6> <p> 1. สร้างสำเนาของไฟล์วิดีโอ mp4 ในตำแหน่งอื่นบนพีซีของคุณ (เช่น บนเดสก์ท็อปของคุณ) <br> 2. เปลี่ยนชื่อไฟล์วิดีโอดังนี้: </p> <blockquote><p> ก. ตั้งชื่อไฟล์ให้สั้นลงในไฟล์วิดีโอ และ... <br> ข. ลบอักขระพิเศษออกจากชื่อ (ขีดล่าง วงเล็บ ฯลฯ) </p></blockquote> <p> 3. เปิดไฟล์วิดีโอใน Adobe Premiere </p> <p> </p> <h6> วิธีที่ 3 เปลี่ยนนามสกุลไฟล์จาก MP4 เป็น MOV </h6> <p> วิธีถัดไปในการหลีกเลี่ยงข้อผิดพลาด &quot;ไฟล์ไม่มีสตรีมเสียงหรือวิดีโอ&quot; ของ Adobe Premiere คือการเปลี่ยนนามสกุลของไฟล์วิดีโอ จาก .mp4 เป็น .mov (หรือกลับกัน) ในการทำเช่นนั้น: </p> <p> 1. ใน File Explorer คลิก <strong> ดู </strong> -&gt; <strong> ตัวเลือก </strong> -&gt; <strong> เปลี่ยนโฟลเดอร์และตัวเลือกการค้นหา </strong> . </p> <p><img src=\"images/image_thumb-45-776.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. ที่ <strong> ดู </strong> แท็บ <strong> ชัดเจน </strong> ช่อง &quot;ซ่อนนามสกุลสำหรับประเภทไฟล์ที่รู้จัก&quot; แล้วคลิก <strong> ตกลง </strong> . * </p> <p> * หมายเหตุ: หากต้องการให้การตั้งค่านี้เป็นแบบถาวร ให้คลิก &#39;นำไปใช้กับโฟลเดอร์&#39; ก่อนคลิก ตกลง </p> <p><img src=\"images/image_thumb-46-490.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. ตอนนี้ ดำเนินการและเปลี่ยนชื่อ/เปลี่ยนนามสกุลของไฟล์วิดีโอดังนี้: </p> <ul> <li> หากไฟล์วิดีโออยู่ในรูปแบบ MP4 (.mp4) ให้เปลี่ยนนามสกุลเป็น .mov </li> <li> หากไฟล์วิดีโออยู่ในรูปแบบ MOV (.mov) ให้เปลี่ยนนามสกุลเป็น .mp4 </li> </ul> <p><img src=\"images/image_thumb-47-586.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. สุดท้าย เปิดไฟล์วิดีโอใน Adobe Premiere </p> <p> </p> <p> </p> <h6> วิธีที่ 4 ล้างฐานข้อมูล Media Cache และไฟล์แคช </h6> <p> เมื่อคุณนำเข้าไฟล์สื่อ (วิดีโอหรือเสียง) และในขณะที่ทำงานกับไฟล์นี้ใน Adobe Premiere โปรแกรมจะสร้างไฟล์แคชสื่อเพื่อประสิทธิภาพที่รวดเร็วยิ่งขึ้น นอกจากนี้ โปรแกรมยังสร้างลิงก์สำหรับไฟล์แคชเหล่านี้ใน Media Cache Database ในระหว่างนี้ ไฟล์แคชสื่อเหล่านี้และฐานข้อมูล Media Cache อาจใหญ่เกินไปหรือเสียหาย และจำเป็นต้องได้รับการล้างเพื่อหลีกเลี่ยงปัญหา </p> <p> ดังนั้น วิธีถัดไปในการแก้ไข &quot;ไฟล์ไม่มีเสียงหรือวิดีโอสตรีม&quot; ใน Premiere คือการล้าง &quot;ฐานข้อมูลแคชสื่อ&quot; และลบไฟล์แคช ในการทำเช่นนั้น: * </p> <p><strong> A. วิธีทำความสะอาดฐานข้อมูลแคชสื่อของ Adobe Premiere </strong></p> <p> 1. เปิด Adobe Premiere <br> 2. จากเมนูไปที่ <strong> แก้ไข </strong> -&gt; <strong> การตั้งค่า </strong> -&gt; <strong> สื่อ. <br> </strong> 3. ที่ Media Cache Database ให้คลิกที่ <strong> ทำความสะอาด </strong> ปุ่ม. </p> <p><img src=\"images/image_thumb-48-167.png\" alt=\"Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> 4. <strong> เริ่มต้นใหม่ </strong> Adobe Premiere แล้วลองเปิดไฟล์วิดีโอ หากข้อผิดพลาด &quot;ไฟล์ไม่มีสตรีมเสียงหรือวิดีโอ&quot; ยังคงอยู่ ให้ดำเนินการล้างไฟล์แคชของ Adobe Premiere โดยทำตามคำแนะนำด้านล่าง: </p> <p><strong> B. วิธีล้างไฟล์ Media Cache ของ Adobe Premiere </strong></p> <p> 1. <strong> เปิด </strong> อะโดบี พรีเมียร์ <br> 2. จากเมนูไปที่ <strong> แก้ไข </strong> -&gt; <strong> การตั้งค่า </strong> -&gt; <strong> สื่อ. <br> </strong> 3. ที่ Media Cache Files ให้คลิกที่ <strong> เรียกดู </strong> ปุ่มหรือบันทึกตำแหน่งของไฟล์แคชสื่อ </p> <p><img src=\"images/image_thumb-49-331.png\" alt=\"FIX: Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> ปิด </strong> อะโดบี พรีเมียร์ <br> 5. ใน File Explorer <strong> ลบ </strong> เนื้อหาทั้งหมดของโฟลเดอร์ &quot;Media Cache files&quot; <br> 6. นำเข้าไฟล์วิดีโอใน Premiere </p> <p> </p> <h6> วิธีที่ 5. เข้ารหัสไฟล์วิดีโออีกครั้ง </h6> <p> วิธีสุดท้ายในการแก้ไข &quot;ไฟล์ไม่มีเสียงหรือสตรีมวิดีโอ&quot; ในกระบวนการนำเข้า Adobe Premiere คือการเข้ารหัสไฟล์วิดีโออีกครั้ง ในการทำเช่นนั้น: </p> <p> 1. ดาวน์โหลดและติดตั้ง <a href=\"https://handbrake.fr/downloads.php\" target=\"_blank\" rel=\"nofollow noopener\"> เบรกมือ </a> . <br> 2. เปิดเบรกมือแล้วคลิก <strong> ไฟล์ – เปิดไฟล์วิดีโอเดียว </strong> . </p> <p><img src=\"images/image_thumb-50-634.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. เลือกไฟล์วิดีโอที่คุณไม่สามารถนำเข้าใน Adobe Premiere แล้วคลิก <strong> เปิด </strong> . <br> 4. ตั้งค่ารูปแบบเอาต์พุตเป็น <strong> MP4, </strong> แล้วคลิก <strong> เรียกดู </strong> และระบุตำแหน่งร้านและชื่อไฟล์ของไฟล์วิดีโอเอาท์พุต (เข้ารหัสใหม่) </p> <p><img src=\"images/image_thumb-51-817.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. ที่ <strong> ขนาด </strong> แท็บ ตั้งค่าขนาดเดียวกันกับไฟล์ต้นฉบับ <br> 6. เมื่อเสร็จแล้วให้คลิก <strong> เริ่มเข้ารหัส </strong></p> <p><img src=\"images/image_thumb-52-713.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. เมื่อกระบวนการเข้ารหัสเสร็จสิ้น ให้ปิดเบรกมือ <br> 7. เปิดไฟล์วิดีโอที่เข้ารหัสใหม่ใน Adobe Premiere </p> <p> นั่นคือทั้งหมดที่! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}