{"title":"การแก้ไข: คอมพิวเตอร์ของคุณไม่สามารถเชื่อมต่อกับเซสชันคอนโซลอื่นได้ เนื่องจากคุณมีเซสชันคอนโซลที่กำลังดำเนินการอยู่ (แก้ไขแล้ว)","content":"<p> บนคอมพิวเตอร์ที่ใช้ Windows ข้อผิดพลาดต่อไปนี้ปรากฏขึ้นในการเชื่อมต่อเดสก์ท็อประยะไกล: &quot;คอมพิวเตอร์ของคุณไม่สามารถเชื่อมต่อกับเซสชันคอนโซลบนคอมพิวเตอร์ระยะไกลได้เนื่องจากคุณมีเซสชันคอนโซลที่กำลังดำเนินการอยู่&quot; </p> <p> </p> <p><img src=\"images/image_thumb-3-627.png\" alt=\"Your computer could no connect to console session on the remote computer because you already have a console session in progress.\" loading=\"lazy\"></p> <p> </p> <p> บทช่วยสอนนี้มีคำแนะนำในการแก้ไขข้อผิดพลาดการเชื่อมต่อเดสก์ท็อประยะไกลต่อไปนี้: &quot;คอมพิวเตอร์ของคุณไม่สามารถเชื่อมต่อกับเซสชันคอนโซลบนคอมพิวเตอร์ระยะไกลได้เนื่องจากคุณมีเซสชันคอนโซลที่กำลังดำเนินการอยู่&quot; </p> <h4> วิธีแก้ไข: ไม่สามารถเชื่อมต่อเดสก์ท็อประยะไกลได้เนื่องจากคุณมีเซสชันคอนโซลอยู่ในระหว่างดำเนินการ </h4> <p> ข้อผิดพลาด &quot;คอมพิวเตอร์ของคุณไม่สามารถเชื่อมต่อกับเซสชันคอนโซลบนคอมพิวเตอร์ระยะไกลได้เนื่องจากคุณมีเซสชันคอนโซลที่กำลังดำเนินการอยู่&quot; เกิดขึ้นเนื่องจากอะแดปเตอร์เครือข่ายตัวใดตัวหนึ่งบนคอมพิวเตอร์ของคุณ (จาก RDP) มีที่อยู่ IP เดียวกันกับคอมพิวเตอร์ ที่คุณพยายามเชื่อมต่อผ่านเดสก์ท็อประยะไกล </p> <p> ตัวอย่างเช่น หากคอมพิวเตอร์ระยะไกลมีที่อยู่ IP: &quot;192.168.1.157&quot; ให้ทำตามขั้นตอนด้านล่าง: </p> <p> 1. เปิด <strong> พร้อมรับคำสั่งในฐานะผู้ดูแลระบบ </strong> บนคอมพิวเตอร์ของคุณ (จาก RDP) <br> 2. ให้คำสั่งต่อไปนี้เพื่อดูที่อยู่ IPv4 ที่กำหนดบนพีซีของคุณ </p> <ul> <li><strong> ipconfig </strong></li> </ul> <p> </p> <p> 3. ตอนนี้ค้นหาว่าอะแดปเตอร์เครือข่ายใดในคอมพิวเตอร์ของคุณ (จาก RDP) มีที่อยู่ IP เดียวกันกับคอมพิวเตอร์ระยะไกล (RDP ถึง) <br> 4. เมื่อคุณพบว่าอะแดปเตอร์ LAN ใดในคอมพิวเตอร์ของคุณ มีที่อยู่ IP เดียวกันกับคอมพิวเตอร์ระยะไกล ให้ดำเนินการและเปลี่ยนที่อยู่ IP บนอะแดปเตอร์นั้นเป็นที่อยู่อื่น * </p> <p> เช่น. ในตัวอย่างนี้ IP ของคอมพิวเตอร์ระยะไกลคือ: &quot;192.168.1.157&quot; ดังนั้นเราจึงต้องเปลี่ยนที่อยู่ IP ของอะแดปเตอร์อีเทอร์เน็ต ถึง: &quot;192.168.1.160&quot; </p> <p><img src=\"images/image_thumb-5-946.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> * หมายเหตุ: หากที่อยู่ IP บนเครือข่ายท้องถิ่นของคุณถูกกำหนดโดยเซิร์ฟเวอร์ DHCP คุณมีตัวเลือกต่อไปนี้เพื่อหลีกเลี่ยงปัญหา: </p> <blockquote><p> ก. เพื่อระบุที่อยู่ IP แบบคงที่อื่นด้วยตนเอง <br> ข. ในการรีสตาร์ทเราเตอร์ของคุณ (เซิร์ฟเวอร์ DHCP) เพื่อ &quot;รับ&quot; ที่อยู่ IP อื่นจากเซิร์ฟเวอร์ DHCP <br> ค. ในการกำหนดค่าเซิร์ฟเวอร์ DHCP (เช่น บนเราเตอร์) กำหนดที่อยู่ IP ให้กับช่วงที่ไม่มีที่อยู่ IP ของคอมพิวเตอร์ระยะไกล (เช่น &quot;192.168.1.200-192.168.1.250&quot; </p></blockquote> <p> </p> <p> 5. หลังจากเปลี่ยนที่อยู่ IP บนคอมพิวเตอร์ของคุณ (จาก RDP) ให้เปิดการเชื่อมต่อเดสก์ท็อประยะไกล แล้วลองเชื่อมต่อกับคอมพิวเตอร์ระยะไกล ข้อผิดพลาด &quot;คอมพิวเตอร์ของคุณไม่สามารถเชื่อมต่อกับเซสชันคอนโซลอื่นได้เนื่องจากคุณมีเซสชันคอนโซลที่อยู่ระหว่างดำเนินการ&quot; ควรได้รับการแก้ไข </p> <p> </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? </p> <p> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}