{"title":"การแก้ไข: การเปิดใช้งานข้อผิดพลาด 0x80072EE7 ใน Windows 10 (แก้ไขแล้ว)","content":"<p> หากคุณได้รับข้อผิดพลาดในการเปิดใช้งาน 0x80072EE7 เมื่อคุณพยายามเปิดใช้งาน Windows 10 ให้อ่านบทแนะนำนี้ต่อเพื่อแก้ไขปัญหา ข้อผิดพลาดในการเปิดใช้งาน &quot; <em> เราไม่สามารถเปิดใช้งาน Windows บนอุปกรณ์นี้ได้ เนื่องจากเซิร์ฟเวอร์การเปิดใช้งานของเราไม่พร้อมใช้งานในขณะนี้ ตรวจสอบให้แน่ใจว่าคุณเชื่อมต่อกับอินเทอร์เน็ตและเราจะพยายามเปิดใช้งาน Windows โดยอัตโนมัติเมื่อบริการพร้อมใช้งาน&quot; พร้อมรหัสข้อผิดพลาด: 0x80072EE7, </em> มักจะปรากฏขึ้นเนื่องจากปัญหาเครือข่าย </p> <p><img src=\"images/image_thumb-5-942.png\" alt=\"FIX: We can’t activate Windows on this device - Error 0x80072EE7\" loading=\"lazy\"></p> <p> บทช่วยสอนนี้มีคำแนะนำในการแก้ไขข้อผิดพลาดในการเปิดใช้งาน Windows 10 0x80072EE7: &quot;เราไม่สามารถเปิดใช้งาน Windows บนอุปกรณ์นี้ได้เนื่องจากเซิร์ฟเวอร์การเปิดใช้งานของเราไม่พร้อมใช้งานในขณะนี้&quot; </p> <h4> วิธีแก้ไขข้อผิดพลาดการเปิดใช้งาน Windows 10 0x80072EE7 </h4> <h6> ขั้นตอนที่ 1 ตรวจสอบให้แน่ใจว่าคุณเชื่อมต่อกับอินเทอร์เน็ต </h6> <p> หากคุณไม่สามารถเปิดใช้งาน Windows 10 ได้เนื่องจากข้อผิดพลาด 0x80072EE7 ก่อนอื่น ให้ตรวจสอบการเชื่อมต่ออินเทอร์เน็ตของคุณ ในการทำเช่นนั้น ให้เปิดอินเทอร์เน็ตเบราว์เซอร์ของคุณและไปที่เว็บไซต์ใดๆ เพื่อให้แน่ใจว่าการเชื่อมต่ออินเทอร์เน็ตของคุณใช้งานได้ </p> <p> </p> <h6> ขั้นตอนที่ 2 ใช้รหัสผลิตภัณฑ์ที่ถูกต้องสำหรับ Windows 10 </h6> <p> ข้อผิดพลาดในการเปิดใช้งาน Windows 10 0x80072EE7 อาจปรากฏขึ้นหากรหัสผลิตภัณฑ์ที่ติดตั้งไม่ถูกต้อง ดังนั้น ตรวจสอบให้แน่ใจว่าคุณใช้รหัสใบอนุญาตที่ถูกต้องและถูกกฎหมายเพื่อเปิดใช้งาน Windows 10 รหัสใบอนุญาตต้องเกี่ยวข้องกับ Windows 10 เวอร์ชันที่ติดตั้ง (เช่น Home หรือ Pro) และต้องพิมพ์อย่างถูกต้อง </p> <p> หากต้องการเปลี่ยนหมายเลขผลิตภัณฑ์ Windows 10 ให้ไปที่ <strong> การตั้งค่า </strong> &gt; <strong> อัปเดตและความปลอดภัย </strong> &gt; <strong> การเปิดใช้งาน </strong> และคลิก <strong> เปลี่ยนรหัสผลิตภัณฑ์ </strong> . </p> <p><img src=\"images/image_thumb-6-424.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> ขั้นตอนที่ 3 เปลี่ยนการตั้งค่า DNS </h6> <p> 1. <strong> คลิกขวา </strong> บน <strong> เครือข่าย </strong> ไอคอน <img src=\"images/image_thumb-42-792.png\" alt=\"image\" loading=\"lazy\"> ในทาสก์บาร์แล้วคลิก <strong> เปิดศูนย์เครือข่ายและการแบ่งปัน </strong> * </p> <p><img src=\"images/image_thumb-104-479.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. เลือก <strong> อีเธอร์เน็ต </strong> (หรือ Wi-Fi) ทางด้านซ้าย จากนั้นที่ส่วน &quot;การตั้งค่าที่เกี่ยวข้อง&quot; คลิก <strong> เปลี่ยนตัวเลือกอะแดปเตอร์ </strong> . </p> <p><img src=\"images/image_thumb-43-166.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> 3. คลิกขวาที่ Network Adapter ที่ใช้งานอยู่ (Ethernet หรือ Wi-Fi) แล้วเลือก <strong> คุณสมบัติ </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-44-500.png\" alt=\"network properties\" loading=\"lazy\"></p> <p> 4. เลือก <strong> &#39;อินเทอร์เน็ตโปรโตคอลเวอร์ชัน 4 (TCP/IPv4) </strong> &#39; และคลิก <strong> คุณสมบัติ </strong></p> <p><img src=\"images/image_thumb-106-472.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> 5. ที่คุณสมบัติอินเทอร์เน็ตโปรโตคอลเวอร์ชัน 4 (TCP/IPv4): </p> <blockquote><p> ก. <strong> ตรวจสอบ </strong> <strong> ใช้ที่อยู่เซิร์ฟเวอร์ DNS ต่อไปนี้: </strong> ปุ่มตัวเลือก <br> ข. จากนั้นพิมพ์ที่อยู่เซิร์ฟเวอร์ DNS ต่อไปนี้ (เซิร์ฟเวอร์ DNS สาธารณะของ Google) แล้วคลิก <strong> ตกลง. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> </blockquote> <p><img src=\"images/image_thumb-109-991.png\" alt=\"google dns settings\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณ. </p> <p> </p> <p> นั่นคือทั้งหมดที่! มันทำงานให้คุณหรือไม่? โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}