{"title":"การแก้ไข: ข้อผิดพลาด BSOD การละเมิด DPC WATCHDOG (แก้ไขแล้ว)","content":"<p> บนคอมพิวเตอร์ที่ใช้ Windows 10, 8 หรือ 7 ข้อผิดพลาด BSOD ต่อไปนี้อาจปรากฏขึ้น: &quot;DPC_WATCHDOG_VIOLATION&quot; ปัญหาจอฟ้า &quot;DPC WATCHDOG VIOLATION&quot; มักเกิดขึ้นเป็นครั้งคราว แม้ว่าระบบจะไม่ได้ใช้งานและมักเกิดจากไดรเวอร์อุปกรณ์ที่ไม่ถูกต้องหรือเสียหาย และในบางกรณีอาจเกี่ยวข้องกับปัญหาฮาร์ดแวร์โดยเฉพาะกับการ์ดกราฟิก </p> <p><img src=\"images/image_thumb-2-618.png\" alt=\"FIX DPC WATCHDOG VIOLATION BLUE SCREEN ERROR\" loading=\"lazy\"></p> <p> </p> <p> คู่มือการแก้ไขปัญหานี้มีหลายวิธีในการแก้ไขปัญหา <strong> การละเมิด DPC WATCHDOG </strong> ปัญหา BSOD ใน Windows 10, 8/8.1 หรือ 7 OS </p> <p> </p> <h2> วิธีแก้ไขปัญหาการละเมิด DPC WATCHDOG BoSD บน Windows 10/8/7 </h2> <p> ปัญหาจอฟ้า DPC WATCHDOG VIOLATION อาจเกิดขึ้นได้จากหลายสาเหตุเช่น อุปกรณ์หรือไดรเวอร์ซอฟต์แวร์ผิดพลาด RAM หรือดิสก์ไดรฟ์เสียหาย ฯลฯ ดังนั้นเพื่อแก้ไขปัญหา BSOD &quot;DPC WATCHDOG VIOLATION&quot; ให้ทำตามขั้นตอนด้านล่าง: </p> <h6> วิธีที่ 1. สแกนระบบของคุณเพื่อหาไวรัสและมัลแวร์ </h6> <p> ขั้นตอนแรกในการแก้ไขปัญหาหน้าจอสีน้ำเงิน &quot;DPC WATCHDOG VIOLATION&quot; คือการทำให้แน่ใจว่าระบบของคุณไม่มีไวรัส/มัลแวร์ สำหรับงานนั้น ให้ทำตามคำแนะนำในคู่มือนี้: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีการสแกนคอมพิวเตอร์ของคุณเพื่อหาไวรัสและโปรแกรมที่เป็นอันตรายอื่นๆ </a></p> <p> </p> <h6> วิธีที่ 2. ถอนการติดตั้งซอฟต์แวร์ป้องกันไวรัส/ความปลอดภัยของคุณ </h6> <p> ปัญหาหน้าจอสีน้ำเงิน &quot;DPC WATCHDOG VIOLATION&quot; อาจเกิดขึ้นหลังจากการอัพเดตโปรแกรมป้องกันไวรัส/ความปลอดภัยโดยอัตโนมัติ (โดยเฉพาะหากคุณใช้ AVAST หรือ AVG) ดังนั้นให้ดำเนินการและถอนการติดตั้งโปรแกรมป้องกันไวรัสของคุณออกจากระบบโดยสมบูรณ์แล้วรีสตาร์ทเครื่องคอมพิวเตอร์ของคุณ <br> – หากปัญหา BSOD ไม่เกิดขึ้นหลังจากลบโปรแกรมป้องกันไวรัส ให้ดำเนินการดาวน์โหลดและติดตั้งซอฟต์แวร์รักษาความปลอดภัยเวอร์ชันล่าสุดในระบบของคุณอีกครั้ง </p> <p> </p> <h6> วิธีที่ 3 เริ่ม Windows ในสถานะ Clean Boot </h6> <p> วิธีถัดไป ในการแก้ไขปัญหา BSOD &quot;DPC WATCHDOG VIOLATION&quot; คือการเริ่ม Windows ใน <a href=\"https://www.repairwin.com/how-to-start-windows-in-clean-boot-state/\" target=\"_blank\" rel=\"nofollow noopener\"> &quot;คลีนบูต </a> &quot; รัฐ เพื่อระบุว่าโปรแกรมใดทำให้ระบบของคุณขัดข้อง </p> <p> ในการเริ่ม Windows ในสถานะ Clean Boot: </p> <p> 1. กดปุ่ม Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> ปุ่มเพื่อเปิดกล่องคำสั่งเรียกใช้ <br> 2. พิมพ์ <strong> msconfig </strong> แล้วกด <strong> ป้อน </strong> . </p> <p><img src=\"images/image_thumb-47-307.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. ที่แท็บบริการ <strong> ซ่อนบริการของ Microsoft ทั้งหมด </strong> กล่องกาเครื่องหมายแล้วกด <strong> ปิดการใช้งานทั้งหมด </strong> เพื่อป้องกันไม่ให้บริการที่ไม่ใช่ของ Microsoft เริ่มทำงานเมื่อเริ่มต้น Windows </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-257.png\" alt=\"clean boot state\" loading=\"lazy\"></p> <p> 4. จากนั้นเลือก <strong> สตาร์ทอัพ </strong> แท็บและ <strong> ปิดการใช้งาน </strong> โปรแกรมอื่น ๆ ทั้งหมดที่เริ่มต้นระหว่างการเริ่มต้น Windows และทำงานบนพื้นหลัง * </p> <p> * หมายเหตุ: เปิด <strong> Windows 10 </strong> หรือ <strong> 8 </strong> , เลือก <strong> เปิดตัวจัดการงาน </strong> เพื่อปิดการใช้งานโปรแกรมเริ่มต้น </p> <p><img src=\"images/image_thumb-29-129.png\" alt=\"Windows clean boot\" loading=\"lazy\"></p> <p> </p> <p> 5. เมื่อเสร็จแล้ว คลิก <strong> ตกลง </strong> และ <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณ. <br> 6. หากหลังจากรีสตาร์ท คอมพิวเตอร์ของคุณทำงานได้ดีและไม่มีปัญหา BSOD ให้เปิดยูทิลิตี้การกำหนดค่าระบบอีกครั้งและเปิดใช้งานรายการที่ถูกปิดใช้งานทั้งหมดทีละรายการและรีสตาร์ทระบบของคุณ จนกว่าคุณจะพบว่ารายการใดเป็นสาเหตุของปัญหา BSoD * </p> <p> * หมายเหตุ: ถึง <strong> ทางออก </strong> จาก <strong> คลีนบูต </strong> ให้เปิดยูทิลิตี้การกำหนดค่าระบบและที่ <strong> ทั่วไป </strong> เลือกแท็บ <strong> การเริ่มต้นปกติ </strong></p> <p> </p> <h6> วิธีที่ 4. ตรวจสอบปัญหาของหน่วยความจำ (RAM) และฮาร์ดดิสก์ (HDD) </h6> <p> ปัญหาจอฟ้า อาจเกิดจากโมดูล RAM เสียหายหรือฮาร์ดไดรฟ์เสีย ในการทดสอบและวินิจฉัยปัญหาส่วนประกอบ RAM และ HDD ให้ทำตามคำแนะนำในคู่มือเหล่านี้: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีวินิจฉัยปัญหาหน่วยความจำคอมพิวเตอร์ด้วย Memtest86+ </a></li> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> เครื่องมือทดสอบและวินิจฉัยฮาร์ดไดรฟ์ที่ดีที่สุดเพื่อตรวจสอบสุขภาพของฮาร์ดดิสก์ </a></li> </ul> <p> </p> <p> </p> <h6> วิธีที่ 5. อัปเดตไดรเวอร์ดิสเพลย์และเครือข่าย </h6> <p> ในบางกรณี ปัญหา BSOD &quot;DPC WATCHDOG VIOLATION&quot; เกิดขึ้นเนื่องจากโปรแกรมควบคุมอุปกรณ์ไม่ถูกต้องหรือเสียหาย ดังนั้น ดำเนินการและอัปเดตไดรเวอร์ของอุปกรณ์ต่อไปนี้บนคอมพิวเตอร์ของคุณ: * </p> <p> 1. อะแดปเตอร์กราฟิก (VGA) <br> 2. อะแดปเตอร์อีเทอร์เน็ตและอะแดปเตอร์ Wi-Fi (ถ้ามี) </p> <p> * หมายเหตุ: <br> 1. หากปัญหา BSOD ยังคงอยู่ หลังจากอัปเดตไดรเวอร์ด้านบนแล้ว ให้ดำเนินการและอัปเดตไดรเวอร์อื่นๆ ทั้งหมดในระบบของคุณ (ชิปเซ็ต ไดรเวอร์เสียง ฯลฯ) <br> 2. ในบางกรณี ข้อผิดพลาด &quot;DPC_WATCHDOG_VIOLATION&quot; อาจเกิดขึ้นหากคุณมีไดรฟ์โซลิดสเตต (SSD) ดังนั้น หากคุณเป็นเจ้าของไดรฟ์ SSD ให้ดำเนินการและอัปเดตเฟิร์มแวร์บนไดรฟ์ สำหรับคำแนะนำในการอัปเดตเฟิร์มแวร์ SSD ให้ดูที่เว็บไซต์ของผู้ผลิต SSD </p> <p> </p> <h6> วิธีที่ 6 อัปเดตไดรเวอร์ iaStor.sys </h6> <p> 1. ไปที่ตัวจัดการอุปกรณ์ <br> 2. ขยายตัวควบคุม IDE ATA/ATAPI <br> 3. ดับเบิ้ลคลิกที่ <strong> ตัวควบคุม SATA/AHCI </strong> . </p> <p><img src=\"images/image_thumb-3-252.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. เลือก <strong> คนขับ </strong> แท็บและคลิก <strong> รายละเอียดไดรเวอร์ </strong> . </p> <p><img src=\"images/image_thumb-4-105.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. หากคุณกำลังใช้ <strong> ไดรเวอร์ iaStor.sys </strong> จากนั้นคลิก <strong> ตกลง </strong> และดำเนินการเปลี่ยนไดรเวอร์ตามที่กล่าวไว้ด้านล่าง มิฉะนั้น ให้ข้ามขั้นตอนที่เหลือ </p> <p><img src=\"images/image_thumb-5-421.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. คลิก <strong> อัพเดทไดรเวอร์ </strong> . </p> <p><img src=\"images/image_thumb-6-840.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. เลือก <strong> เรียกดูคอมพิวเตอร์ของฉันเพื่อหาซอฟต์แวร์ไดรเวอร์ </strong> . </p> <p><img src=\"images/image_thumb-7-251.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. คลิก <strong> ให้ฉันเลือกจากรายการไดรเวอร์อุปกรณ์ในคอมพิวเตอร์ของฉัน </strong> . </p> <p><img src=\"images/image_thumb-8-330.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. เน้นที่ <strong> ตัวควบคุม SATA AHCI มาตรฐาน </strong> และคลิก <strong> ต่อไป </strong> . <br> 10. เมื่อการติดตั้งไดรเวอร์เสร็จสิ้น <strong> ปิด </strong> หน้าต่างที่เปิดอยู่ทั้งหมดและ <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณ. </p> <p> </p> <h6> วิธีที่ 7 <strong> วิเคราะห์ Minidump </strong></h6> <p> เมื่อ Windows ขัดข้องด้วยหน้าจอสีน้ำเงิน ให้เก็บรายละเอียดของหน้าจอ BSoD ไว้ในไฟล์ขนาดเล็กซึ่งเรียกว่า &quot; <strong> MiniDump </strong> &quot;การวิเคราะห์ของ analysis <strong> มินิดัมพ์ </strong> ไฟล์สามารถช่วยคุณแก้ปัญหาและแก้ไขปัญหาจอฟ้าได้ เพื่อให้งานนี้สำเร็จ ให้ทำตามคำแนะนำในบทความนี้: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีวิเคราะห์ไฟล์ MiniDump ด้วย BlueScreenView </a> . </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}