{"title":"การแก้ไข: การพิมพ์ PDF ช้าใน Windows 10 (แก้ไขแล้ว)","content":"<p> บทช่วยสอนนี้มีคำแนะนำในการแก้ปัญหาการพิมพ์ PDF ที่ช้าจาก Acrobat Reader ใน Windows 10 ดังนั้น หากคุณกำลังพยายามพิมพ์ไฟล์ PDF โดยใช้ Adobe Acrobat และการพิมพ์นั้นช้า โปรดอ่านต่อไปด้านล่าง </p> <p> ปัญหาในรายละเอียด: เมื่อคุณพยายามพิมพ์ไฟล์ PDF ไปยังเครื่องพิมพ์ในพื้นที่หรือเครือข่าย การพิมพ์ใช้เวลานาน เนื่องจากหลังจากส่งงานพิมพ์แล้ว เครื่องพิมพ์จะเริ่มพิมพ์หน้าแรกช้ามาก จากนั้นคุณต้องรอนานกว่า 2 นาทีสำหรับการพิมพ์หน้าที่เหลือ ในขณะเดียวกัน ปัญหาการพิมพ์ช้าไม่ได้เกิดขึ้นเมื่อพิมพ์จากโปรแกรมอื่น (เช่น จาก Word, Excel เป็นต้น) </p> <p> การพิมพ์เอกสาร Adobe PDF ที่ช้าใน Windows 10 อาจปรากฏขึ้นจากหลายสาเหตุ ดังนั้นบทช่วยสอนนี้จึงมีวิธีการหลายวิธีในการแก้ไขปัญหา </p> <h4> วิธีแก้ไข: การพิมพ์ไฟล์ PDF ช้ามากใน Windows 10 </h4> <h6> วิธีที่ 1 พิมพ์เอกสาร PDF เป็นรูปภาพ </h6> <p> 1. เปิด Acrobat Reader แล้วคลิก click <strong> พิมพ์ </strong> ปุ่ม. <br> 2. ที่กล่องโต้ตอบการพิมพ์ คลิก <strong> ขั้นสูง </strong></p> <p><img src=\"images/image_thumb-345.png\" alt=\"FIX: Slow PDF Printing in Windows 10\" loading=\"lazy\"></p> <p> 3. เลือก <strong> พิมพ์เป็นภาพ </strong> กล่องกาเครื่องหมาย และคลิก <strong> ตกลง. </strong></p> <p><img src=\"images/image_thumb-1-653.png\" alt=\"FIX PDF Slow Printing in Windows 10\" loading=\"lazy\"></p> <p> 4. ลองพิมพ์ไฟล์ PDF ของคุณ </p> <h6><br clear=\"all\"> วิธีที่ 2. ให้เครื่องพิมพ์กำหนดสี </h6> <p> 1. เปิด Acrobat Reader แล้วคลิก click <strong> พิมพ์ </strong> ปุ่ม. <br> 2. ที่กล่องโต้ตอบการพิมพ์ คลิก <strong> ขั้นสูง </strong></p> <p> 3. <strong> ยกเลิกการเลือก </strong> <strong> พิมพ์เป็นภาพ </strong> ช่องทำเครื่องหมาย (หากเลือก) และ <strong> ตรวจสอบ </strong> <strong> ให้เครื่องพิมพ์กำหนดสี </strong> ช่องทำเครื่องหมาย <br> 4. คลิก <strong> ตกลง </strong> เพื่อบันทึกการตั้งค่าและลองพิมพ์ไฟล์ PDF * </p> <p> * หมายเหตุ: หากการพิมพ์เหลือน้อยอีกครั้ง แสดงว่า <strong> ยกเลิกการเลือก </strong> <strong> &#39;ให้เครื่องพิมพ์กำหนดสี&#39; </strong> ตัวเลือกและดำเนินการต่อในวิธีถัดไป </p> <p><img src=\"images/image_thumb-2-580.png\" alt=\"FIX Adobe Acrobat Slow PDF Print\" loading=\"lazy\"></p> <h6> วิธีที่ 3 ติดตั้งใหม่หรือเปลี่ยนไดรเวอร์เครื่องพิมพ์ </h6> <p> วิธีสุดท้าย ในการแก้ปัญหาการพิมพ์เอกสาร PDF ช้า ให้ดำเนินการดังต่อไปนี้ </p> <p><strong> ขั้นตอนที่ 1. ติดตั้งไดรเวอร์เครื่องพิมพ์อีกครั้ง </strong></p> <p> 1. ไปที่แผงควบคุม &gt; <strong> อุปกรณ์และเครื่องพิมพ์ </strong> . <br> 2. คลิกขวาที่เครื่องพิมพ์แล้วคลิก <strong> ถอดอุปกรณ์ </strong> . </p> <p><img src=\"images/image_thumb-3-877.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. จากนั้น ไปที่แผงควบคุม &gt; <strong> โปรแกรมและคุณสมบัติ </strong> และ <strong> ถอนการติดตั้ง </strong> ซอฟต์แวร์เครื่องพิมพ์ <br> 4. <strong> เริ่มต้นใหม่ </strong> พีซีของคุณ <br> 5. จากไซต์สนับสนุนของผู้ผลิตเครื่องพิมพ์ ให้ดาวน์โหลดไดรเวอร์ล่าสุดสำหรับเครื่องพิมพ์ของคุณ <br> 6. ติดตั้งไดรเวอร์เครื่องพิมพ์แล้วลองพิมพ์ หากการพิมพ์ช้าอีกครั้ง ให้เข้าสู่ขั้นตอนที่ 2 </p> <p><strong> ขั้นตอนที่ 2. เปลี่ยนไดรเวอร์เครื่องพิมพ์ </strong></p> <p> ไปที่ไซต์สนับสนุนของผู้ผลิตเครื่องพิมพ์อีกครั้ง และตรวจสอบว่ามีไดรเวอร์ประเภทอื่นสำหรับเครื่องพิมพ์ของคุณหรือไม่ (เช่น Universal printing, PostScript, PCL6 เป็นต้น) ถ้าใช่ ให้ดาวน์โหลดและติดตั้งไดรเวอร์ประเภทอื่นแล้วลองพิมพ์ </p> <p> นั่นคือทั้งหมดที่! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}