{"title":"การแก้ไข: Outlook 0x80042112 – การรับรายงานข้อผิดพลาด (แก้ไขแล้ว)","content":"<p> Outlook 0x80042112 การรับรายงานข้อผิดพลาด มักเกิดขึ้นเมื่อ Outlook พยายามรับอีเมลขนาดใหญ่มาก (เช่น อีเมลที่มีไฟล์แนบขนาดใหญ่) ในกรณีนี้ Outlook แสดงข้อผิดพลาดต่อไปนี้ระหว่าง &#39;ส่ง/รับความคืบหน้า&#39;: &quot;งาน &#39;%อีเมลบัญชี% – การรับ&#39; รายงานข้อผิดพลาด (0x80042112) : &#39;ไม่สามารถดาวน์โหลดข้อความอีเมลต่อไปนี้บนเซิร์ฟเวอร์อีเมลได้ ติดต่อผู้ให้บริการอินเทอร์เน็ต (ISP) หรือผู้ดูแลระบบอีเมลของคุณ หากคุณยังคงได้รับข้อผิดพลาดนี้&quot; </p> <p><img src=\"images/image_thumb-7-121.png\" alt=\"FIX: Outlook 0x80042112 Receiving reported error. \" loading=\"lazy\"></p> <p> บทช่วยสอนนี้มีคำแนะนำโดยละเอียดในการแก้ไขข้อผิดพลาดที่ได้รับ Outlook 0x80042112 </p> <h4> วิธีแก้ไข Outlook ที่ได้รับรายงานข้อผิดพลาด 0x80042112 </h4> <h6> ขั้นตอนที่ 1 ตรวจสอบให้แน่ใจว่าคุณเชื่อมต่อกับอินเทอร์เน็ต </h6> <p> บางครั้ง Outlook ที่ได้รับข้อผิดพลาด 0x80042112 เกิดขึ้นเนื่องจากการเชื่อมต่ออินเทอร์เน็ตหยุดลง ก่อนอื่น ให้ตรวจสอบว่าการเชื่อมต่ออินเทอร์เน็ตของคุณใช้งานได้ ในการทำเช่นนั้น ให้เปิดอินเทอร์เน็ตเบราว์เซอร์ของคุณและไปที่เว็บไซต์ใดๆ เพื่อตรวจสอบการเชื่อมต่อของคุณ </p> <p> </p> <h6> ขั้นตอนที่ 2 ลบข้อความอีเมลขาออก </h6> <p> วิธีที่สองในการแก้ไขข้อผิดพลาด 0x80042112 ใน Outlook คือการลบหรือย้ายไปยังฉบับร่าง ข้อความอีเมลทั้งหมดที่ติดอยู่ในกล่องขาออก ในการทำเช่นนั้น: </p> <p> 1. ใน Outlook ให้คลิกที่ <strong> ส่ง/รับ </strong> แท็บแล้วคลิก <strong> ทำงานออฟไลน์ </strong> . </p> <p><img src=\"images/image_thumb-8-737.png\" alt=\"Move Outbox Emails to Drafts folder\" loading=\"lazy\"></p> <p> 2. <strong> เริ่มต้นใหม่ </strong> แนวโน้ม <br> 3. เลือก <strong> กล่องขาออก </strong> โฟลเดอร์ (ทางซ้าย) แล้วกด <strong> CTRL </strong> + <strong> อา </strong> เพื่อเลือกอีเมลทั้งหมด (ทางด้านขวา) <br> 4. คลิกขวาที่อีเมลที่เลือกและย้ายไปที่ <strong> ร่างจดหมาย </strong> โฟลเดอร์โดยคลิก <strong> ย้าย -&gt; โฟลเดอร์อื่น </strong> แล้วเลือก <strong> ร่างจดหมาย </strong> โฟลเดอร์จากรายการ </p> <p><img src=\"images/image_thumb-10-352.png\" alt=\"FIX Outlook error 0x80042112\" loading=\"lazy\"></p> <p> </p> <p> 5. เมื่อเสร็จแล้วให้คลิกที่ <strong> ส่ง/รับ </strong> แท็บแล้วคลิก <strong> ทำงานออนไลน์. <br> </strong> 6. <strong> เริ่มต้นใหม่ </strong> Outlook และดำเนินการส่ง/รับ </p> <h6></h6> <h6> ขั้นตอนที่ 3 เรียกใช้ Outlook โดยไม่มีโปรแกรมเสริม </h6> <p> อีกวิธีหนึ่งในการแก้ไขข้อผิดพลาดของ Outlook 0x80042112 ในการรับคือการเริ่มแอปพลิเคชัน Outlook ในเซฟโหมดและปิดใช้งาน Add-in ใด ๆ ที่อาจทำให้เกิดข้อผิดพลาด </p> <p> 1. เมื่อต้องการเริ่ม Outlook ในเซฟโหมด ให้กด . ค้างไว้ <strong> CTRL </strong> คีย์ (บนแป้นพิมพ์ของคุณ) แล้วดับเบิลคลิกที่ทางลัดของ Microsoft Outlook หรือ: </p> <blockquote><p> ก. กด Windows . พร้อมกัน <img src=\"images/image_thumb36-371.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> ปุ่มเพื่อเปิดกล่องคำสั่งเรียกใช้ <br> ข. ประเภท: <strong> แนวโน้ม / ปลอดภัย </strong> และคลิก <strong> ตกลง </strong> . </p> <p><img src=\"images/image_thumb-14-671.png\" alt=\"outlook safe mode\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. ใน Outlook Safe Mode ให้ไปที่ตัวเลือก Add-in และ <strong> ปิดการใช้งาน Add-in ทั้งหมด </strong> . ในการทำเช่นนั้น: </p> <ul> <li> วิธีปิดการใช้งานโปรแกรมเสริมใน <strong> Outlook 2007 </strong> : </li> </ul> <blockquote><p> 1. <strong> บน </strong> <strong> เครื่องมือ </strong> เมนู คลิก <strong> ศูนย์ความเชื่อถือ </strong><br> 2. เลือก <strong> ส่วนเสริม </strong> บนบานหน้าต่างด้านซ้าย <br> 3. ที่บานหน้าต่างด้านขวา เลือก <strong> COM Add-in </strong> และคลิก <strong> ไป… <br> </strong> 4. <strong> ยกเลิกการเลือก </strong> ช่องทำเครื่องหมายทั้งหมด เพื่อปิดใช้งาน Add-in ทั้งหมดและคลิก <strong> ตกลง. </strong></p></blockquote> <ul> <li> วิธีปิดการใช้งานโปรแกรมเสริมใน <strong> Outlook 2016, 2013 </strong> หรือ <strong> 2010 </strong> : </li> </ul> <blockquote><p> 1. คลิก <strong> ไฟล์ </strong> เมนูและเลือก <strong> ตัวเลือก </strong> . <br> 2. เลือก <strong> Add-in ที่ </strong> บานหน้าต่างด้านซ้าย <br> 3. ที่บานหน้าต่างด้านขวา เลือก <strong> COM Add-in </strong> และคลิก <strong> ไป… </strong></p></blockquote> <p><img src=\"images/image_thumb-20-411.png\" alt=\"disable outlook add-ins\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. <strong> ยกเลิกการเลือก </strong> <strong> ทั้งหมด </strong> ช่องทำเครื่องหมายและคลิก <strong> ตกลง </strong> เพื่อปิดการใช้งาน Add-in ทั้งหมด </p> <p><strong><img src=\"images/image_thumb-21-683.png\" alt=\"turn off outlook add-ins\" loading=\"lazy\"><strong><br> </strong></strong></p> </blockquote> <p> 3. <strong> เริ่มต้นใหม่ </strong> แนวโน้ม <br> 4. ลองส่ง/รับ หากความคืบหน้าในการส่ง/รับสิ้นสุดลงตามปกติและไม่แสดงข้อผิดพลาด 0x80042112 ให้ดำเนินการต่อและเปิดใช้งานปลั๊กอินที่ปิดใช้งานทั้งหมดทีละตัวแล้วเริ่ม Outlook ใหม่ จนกว่าคุณจะพบว่าอันใดเป็นสาเหตุของปัญหา </p> <p> </p> <h6> ขั้นตอนที่ 4 ตรวจสอบการตั้งค่า Antivirus &amp; Firewall ของคุณ </h6> <p> หากคุณกำลังใช้โปรแกรมป้องกันไวรัสที่มีคุณสมบัติการสแกนอีเมล ให้ปิดใช้งานโปรแกรมป้องกันไวรัสเพิ่มเติมใน Outlook (ดูคำแนะนำในขั้นตอนที่ 3 ด้านบน) หรือปิดใช้งานการป้องกันไวรัสชั่วคราวหรือถอนการติดตั้งโปรแกรมป้องกันไวรัส นอกจากนี้ ให้ตรวจสอบการตั้งค่าไฟร์วอลล์ของคุณและตรวจสอบให้แน่ใจว่าพอร์ตเซิร์ฟเวอร์อีเมลที่คุณใช้ไม่ได้ถูกบล็อกจากโปรแกรมไฟร์วอลล์ โดยเฉพาะอย่างยิ่ง ที่การตั้งค่าไฟร์วอลล์ของคุณ: </p> <p> A. เปิดใช้งานไฟล์ต่อไปนี้เพื่อเข้าถึงอินเทอร์เน็ต: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. เปิดใช้งานพอร์ตต่อไปนี้ในไฟร์วอลล์: </p> <ul> <li><strong> พอร์ต110 </strong> (หากคุณใช้เซิร์ฟเวอร์อีเมลขาเข้า POP3 โดยไม่มีการเชื่อมต่อที่เข้ารหัส) * </li> <li><strong> พอร์ต 995 </strong> (หากคุณใช้เซิร์ฟเวอร์อีเมลขาเข้า POP3 ที่มีการเชื่อมต่อที่เข้ารหัส (เปิดใช้งาน SSL) </li> </ul> <ul> <li><strong> พอร์ต143 </strong> (หากคุณใช้เซิร์ฟเวอร์อีเมลขาเข้า IMAP โดยไม่มีการเชื่อมต่อที่เข้ารหัส) </li> <li><strong> พอร์ต 993 </strong> (หากคุณใช้เซิร์ฟเวอร์อีเมลขาเข้า IMAP ที่มีการเชื่อมต่อที่เข้ารหัส (เปิดใช้งาน SSL) </li> </ul> <ul> <li><strong> พอร์ต 25 </strong> หากเซิร์ฟเวอร์เมลขาออก SMTP ของคุณไม่ได้ใช้ SSL * </li> <li><strong> พอร์ต 465 </strong> หรือ <strong> 587 </strong> หากเซิร์ฟเวอร์เมลขาออก SMTP ของคุณใช้ SSL </li> </ul> <p> * หมายเหตุ: โดยค่าเริ่มต้น พอร์ต 25 ใช้สำหรับการเข้าถึงขาออก และพอร์ต 110 สำหรับการเข้าถึงขาเข้า หากคุณไม่แน่ใจเกี่ยวกับพอร์ต โปรดติดต่อ ISP หรือผู้ดูแลระบบของคุณ </p> <p> </p> <h6> ขั้นตอนที่ 5 ซ่อมแซมไฟล์ข้อมูล Outlook PST </h6> <p> ขั้นตอนต่อไปในการแก้ไขข้อผิดพลาดที่ได้รับรายงานของ Outlook 0x80042112 คือการเรียกใช้เครื่องมือซ่อมแซมกล่องขาเข้าเพื่อซ่อมแซมไฟล์ .pst ของคุณ คำแนะนำโดยละเอียดในการทำที่สามารถพบได้ในบทช่วยสอนนี้: <a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีซ่อมแซมไฟล์ข้อมูล Outlook PST </a> . </p> <p> </p> <h6> ขั้นตอนที่ 6 ตรวจสอบขนาดของข้อความอีเมลจากเว็บ </h6> <p> หากคุณมีสิทธิ์เข้าถึงบัญชีอีเมลของคุณทางเว็บ ให้ลงชื่อเข้าใช้บัญชีอีเมลของคุณโดยใช้เว็บเบราว์เซอร์และตรวจสอบว่าขนาดของอีเมลเป็นปัญหาหรือไม่ ตัวอย่างเช่น หากคุณพบอีเมลขนาดใหญ่ในกล่องขาเข้า ให้ดาวน์โหลดไฟล์แนบแล้วลบอีเมลนั้น * </p> <p> * หมายเหตุ: หากคุณไม่มีสิทธิ์เข้าถึงบัญชีอีเมลของคุณผ่านทางเว็บ โปรดติดต่อผู้ให้บริการอีเมลของคุณเพื่อรายงานปัญหา </p> <p> นั่นคือทั้งหมดที่! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}