{"title":"การแก้ไข: ไม่สามารถลงชื่อเข้าใช้แอป Office บนเดสก์ท็อป - หน้าต่างข้อมูลประจำตัวไม่ปรากฏขึ้น (แก้ไขแล้ว)","content":"<p> เมื่อไม่กี่วันก่อน ฉันได้แก้ไขปัญหาต่อไปนี้ในคอมพิวเตอร์ Windows 10 ที่ใช้ Microsoft Office: ผู้ใช้ไม่สามารถลงชื่อเข้าใช้แอปพลิเคชัน Office ใดๆ (Word, Outlook ฯลฯ) เนื่องจากระบบไม่เคยแสดงหน้าต่างข้อมูลประจำตัวเพื่อเข้าสู่ Office 365 รหัสผ่าน ดังนั้น ถ้าคุณไม่สามารถลงชื่อเข้าใช้ Office Desktop Apps เนื่องจากกล่องรหัสผ่านไม่ปรากฏขึ้น โปรดอ่านต่อด้านล่าง </p> <p> คำอธิบายปัญหา: หลังจากเปิดแอป Office บนเดสก์ท็อป (Word, Excel ฯลฯ) ระบบจะแจ้งให้คุณลงชื่อเข้าใช้โดยใช้ข้อมูลประจำตัวบัญชี Microsoft ของคุณ อย่างไรก็ตาม หลังจากป้อนชื่อผู้ใช้ของคุณ หน้าต่างการเข้าสู่ระบบจะปิดลงและข้อความแจ้งรหัสผ่านจะไม่ปรากฏขึ้น ด้วยเหตุนี้ คุณจึงไม่สามารถใช้แอปพลิเคชัน Office หรือประสบปัญหาอื่นๆ ปัญหาดังกล่าวสามารถปรากฏใน Microsoft Office 2013 &amp; Office 2016 </p> <p> บทช่วยสอนนี้มีคำแนะนำในการแก้ไขปัญหาต่อไปนี้ใน Windows 10: ไม่สามารถลงชื่อเข้าใช้แอปพลิเคชันเดสก์ท็อปของ Microsoft Office โดยใช้ข้อมูลประจำตัวของ Office 365 เนื่องจากหน้าต่างข้อมูลประจำตัวไม่ปรากฏขึ้น </p> <h4> วิธีแก้ไข: ไม่สามารถลงชื่อเข้าใช้ด้วยบัญชี MS ของคุณกับแอปพลิเคชัน Office Desktop ใดๆ (สำนักงาน 2556/2559/2562). </h4> <h6> วิธีที่ 1 ลบข้อมูลรับรอง Office ที่เก็บไว้ออกจากแผงควบคุม </h6> <p> วิธีแรกในการแก้ปัญหาการลงชื่อเข้าใช้ในแอปเดสก์ท็อปของ Office คือการลบข้อมูลประจำตัวของ Microsoft ที่จัดเก็บไว้ออกจากพีซีของคุณ ในการทำเช่นนั้น: </p> <p> 1. ปิดโปรแกรม Office ทั้งหมด <br> 2. ไปที่ Windows <strong> แผงควบคุม </strong> และเปิด <strong> ตัวจัดการข้อมูลรับรอง </strong> . </p> <p><img src=\"images/image_thumb-23-297.png\" alt=\"Control Panel - Credential Manager\" loading=\"lazy\"></p> <p> 3. ที่ <strong> ข้อมูลรับรอง Windows </strong> ลบข้อมูลประจำตัวสำหรับ Microsoft Office </p> <p><img src=\"images/image_thumb-24-389.png\" alt=\"Remove Office Credentials\" loading=\"lazy\"></p> <p> </p> <p> 4. เปิดแอป Office แล้วลองลงชื่อเข้าใช้ด้วยบัญชี Microsoft ของคุณอีกครั้ง หากคุณยังไม่สามารถเข้าสู่ระบบบัญชีได้ ให้ทำตามขั้นตอนในวิธีที่ 2 ด้านล่าง </p> <p> </p> <h6> วิธีที่ 2 ปิดใช้งานการรับรองความถูกต้องสมัยใหม่ </h6> <p> วิธีที่สอง ในการแก้ปัญหาการลงชื่อเข้าใช้ในแอปพลิเคชัน Office คือการปิดใช้งาน Modern Authentication ใน Office ในการทำเช่นนั้น: </p> <p> 1. เปิด Registry Editor และไปที่คีย์นี้: </p> <ul> <li> HKEY_CURRENT_USER\\Software\\Microsoft\\Office\\16.0\\Common\\Identity </li> </ul> <p> 2. ที่บานหน้าต่างด้านขวา ตรวจสอบว่าคุณสามารถเห็นค่าที่มีชื่อหรือไม่: <strong> เปิดใช้งานADAL </strong> ถ้าไม่เช่นนั้น… </p> <blockquote> <p> ก. คลิกขวาที่พื้นที่ว่างแล้วเลือก <strong> ใหม่ </strong> &gt; <strong> ค่า DWORD (32 บิต) </strong></p> </blockquote> <p><img src=\"images/image_thumb-25-384.png\" alt=\"Disable Modern Authentication\" loading=\"lazy\"></p> <p> </p> <blockquote><p> ข. ตั้งชื่อค่าใหม่: <strong> เปิดใช้งานADAL </strong> แล้วกด <strong> ป้อน </strong></p></blockquote> <p><img src=\"images/image_thumb-26-875.png\" alt=\"Turn Off Modern Authentication\" loading=\"lazy\"></p> <p> 3. ดับเบิ้ลคลิกที่ <strong> เปิดใช้งานADAL </strong> ให้ตั้งค่าข้อมูลค่าเป็น <strong>0 </strong> และคลิก <strong> ตกลง. </strong></p> <p><img src=\"images/image_thumb-27-612.png\" alt=\"EnableADAL \" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> ปิด </strong> Registry Editor และ Registry <strong> เริ่มต้นใหม่ </strong> พีซี <br> 5. เปิดแอปพลิเคชัน Office แล้วลองอีกครั้งเพื่อลงชื่อเข้าใช้อีกครั้ง </p> <p> </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}