{"title":"การแก้ไข: ไดรฟ์แสดงสองครั้งในบานหน้าต่างนำทางของ Windows 10 (แก้ไขแล้ว)","content":"<p> ในบทช่วยสอนนี้ คุณจะมีคำแนะนำในการแก้ไขปัญหาแปลก ๆ ต่อไปนี้ใน Windows 10: ไดรฟ์แสดงสองครั้งในบานหน้าต่างนำทาง การปรากฏที่ซ้ำกันของไดรฟ์ในบานหน้าต่างนำทางคือคุณสมบัติใหม่ Windows 10 ที่ช่วยให้ผู้ใช้สำรวจเนื้อหาของ ไดรฟ์ที่เชื่อมต่อโดยไม่ต้องขยายเมนู &quot;พีซีเครื่องนี้&quot; แต่ฟีเจอร์นี้น่ารำคาญเพราะถ้าคุณใช้เพื่อเปิดเมนู &quot;พีซีเครื่องนี้&quot; ไว้ ไดรฟ์เดียวกันจะแสดงสองครั้งในบานหน้าต่างนำทาง </p> <p><img src=\"images/image_thumb-22-749.png\" alt=\"Drives Displayed Twice in Navigation Pane of Windows 10\" loading=\"lazy\"></p> <p> หากคุณเห็นรายการซ้ำกันของไดรฟ์ USB ที่ต่ออยู่หรือไดรฟ์แบบคงที่ใน Windows 10 ให้ทำตามคำแนะนำด้านล่างเพื่อแก้ไขปัญหา </p> <h4> วิธีลบอักษรระบุไดรฟ์ที่ซ้ำกันใน Windows 10 Explorer (เมนูการนำทาง) </h4> <p> เพื่อป้องกัน Windows 10 ให้แสดงไดรฟ์ที่ต่ออยู่หรือคงที่สองครั้ง ให้ใช้การปรับแต่งรีจิสทรีต่อไปนี้ </p> <p> 1. เปิดตัวแก้ไขรีจิสทรี ที่จะทำ: </p> <blockquote><p> 1. กด Windows <img src=\"images/image_thumb8_thumb_thumb-493.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> ปุ่มเพื่อเปิดกล่องคำสั่งเรียกใช้ <br> 2. ในกล่องค้นหา พิมพ์ <strong> regedit </strong> แล้วกด <strong> ป้อน </strong> เพื่อเปิด Registry Editor </p></blockquote> <p><img src=\"images/image_thumb7-138.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. จากนั้นไปที่คีย์รีจิสทรีนี้: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Desktop\\NameSpace\\DelegateFolders </li> </ul> <p> 3. จากนั้นคลิกขวาและลบ <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> สำคัญ. </p> <p><img src=\"images/image_thumb-23-428.png\" alt=\"remove duplicate drive entries windows 10 navigation pane\" loading=\"lazy\"></p> <p> </p> <p> 4. จากนั้นไปที่คีย์นี้: * </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Desktop\\NameSpace\\DelegateFolders </li> </ul> <p> 5. ลบ <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> สำคัญ. </p> <p> 6. ปิดตัวแก้ไขรีจิสทรี </p> <p> * หมายเหตุ: หากคุณไม่เห็นคีย์ &quot;WOW6432Node&quot; ให้ข้ามขั้นตอนที่ 4 และ 5 ด้านบน เนื่องจากใช้กับ Windows 10 รุ่น 64 บิตเท่านั้น </p> <p><strong> เคล็ดลับ: </strong> หากคุณเปลี่ยนการตัดสินใจในอนาคต เพียงคลิกขวาที่ &#39;DelegateFolders&#39; ที่ตำแหน่งรีจิสทรีด้านบน เลือก <strong> ใหม่ </strong> -&gt; <strong> สำคัญ </strong> และสร้างใหม่ที่ถูกลบ <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> คีย์ </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}