{"title":"การแก้ไข: ข้อผิดพลาด Outlook Express 0x800c0133 เนื่องจากขีดจำกัดขนาด 2GB ในไฟล์ DBX (แก้ไขแล้ว)","content":"<p> บทแนะนำนี้มีคำแนะนำในการแก้ไขข้อผิดพลาดของ Outlook Express 0x800c0133 เนื่องจากขีดจำกัดขนาด 2GB ข้อผิดพลาด 0x800c0133 ใน OE เกิดขึ้นเนื่องจากโฟลเดอร์ Outlook หนึ่งโฟลเดอร์มีขนาดเกินขีดจำกัด 2GB </p> <p> คำอธิบายของปัญหาการจำกัดขนาด .DBX 2GB ใน Outlook Express <br> เมื่อหนึ่งในโฟลเดอร์หลักของ Outlook Express (เช่น &quot;กล่องขาเข้า&quot; หรือ &quot;ส่ง&quot;) เกินขนาด 2GB OE จะส่งกลับข้อผิดพลาด 0x800c0133 ระหว่างการดำเนินการส่ง/รับ และบางครั้งโฟลเดอร์ OE ที่เกี่ยวข้องจะว่างเปล่า (เสียหาย)* ตัวอย่างเช่น หากโฟลเดอร์ &quot;Inbox&quot; (Inbox.dbx) มีขนาดเกิน 2GB OE จะไม่สามารถรับอีเมลใหม่และแสดงข้อผิดพลาด 0x800c0133 </p> <p> * หมายเหตุ: หากหนึ่งในโฟลเดอร์ OE ว่างเปล่า แสดงว่าไฟล์ DBX ที่เกี่ยวข้องเสียหาย ในกรณีนั้น ให้พยายามกู้คืนอีเมลของคุณจากโฟลเดอร์ OE ที่เสียหายโดยทำตามคำแนะนำในบทความนี้: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีการกู้คืนไฟล์ Outlook Express DBX ฟรี </a> . </p> <h4> วิธีแก้ไขปัญหาขีด จำกัด Outlook Express 2GB (ส่ง / รับข้อผิดพลาด 0x800c0133) </h4> <h6> ขั้นตอนที่ 1 เปิดใช้งานมุมมองไฟล์ที่ซ่อนอยู่ </h6> <p> 1. เปิด Windows Explorer <br> 2. จาก <strong> เครื่องมือ </strong> เลือกเมนู <strong> ตัวเลือกโฟลเดอร์ </strong> . <br> 3. ที่แท็บ มุมมอง คลิก <strong> แสดงไฟล์และโฟลเดอร์ที่ซ่อนอยู่ </strong> และคลิก <strong> ตกลง. </strong></p> <p><img src=\"images/image_thumb1_thumb-210.png\" alt=\"image_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> ขั้นตอนที่ 2 ค้นหาไฟล์ Outlook Express 2GB DBX บนดิสก์ของคุณ </h6> <p> 1. เปิดโฟลเดอร์ร้านค้า Outlook Express โดยปกติโฟลเดอร์นี้จะอยู่ที่เส้นทางต่อไปนี้บนดิสก์ของคุณ: </p> <ul> <li> C:\\Documents and Settings\\\\Local Settings\\Application Data\\Identities\\{}\\Microsoft\\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> เช่น. “C:\\Documents and Settings\\Admin\\Local Settings\\Application Data\\Identities\\{D8F3C56D-965E-41AE-8A23-A58460ABAE00}\\Microsoft\\ <strong> Outlook Express </strong> ” </p></blockquote> <p> 3. จากนักสำรวจ <strong> ดู </strong> เลือกเมนู <strong> รายละเอียด </strong> . <br> 4. ค้นหาไฟล์ DBX ที่เกินขีดจำกัดที่เก็บข้อมูล 2GB * </p> <p> * ในตัวอย่างนี้ ไฟล์ &quot;Inbox.dbx&quot; มีขนาดเกิน 2GB </p> <p><img src=\"images/image_thumb2_thumb-339.png\" alt=\"FIX Outlook Express Error 0x800c0133\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> ขั้นตอนที่ 3 ย้ายอีเมลจากโฟลเดอร์ Oversized Mail ไปยังโฟลเดอร์ New Mail </h6> <p> 1. เปิด Outlook Express <br> 2. เลือกโฟลเดอร์เมลขนาดใหญ่ (ที่มีขนาดเกิน 2GB เช่น โฟลเดอร์ &quot;Inbox&quot; ในตัวอย่างนี้) <br> 3. หากคุณเห็นอีเมลของคุณในโฟลเดอร์นั้น (โฟลเดอร์นั้นไม่ว่างเปล่า) ให้ทำดังนี้: * </p> <p> * หมายเหตุ: หากโฟลเดอร์ดูเหมือนว่างเปล่า (คุณไม่เห็นอีเมลในนั้น) แสดงว่าโฟลเดอร์ OE (และไฟล์ DBX ที่เกี่ยวข้อง) จะเสียหาย ในกรณีนี้ คุณต้องกู้คืนอีเมลจากโฟลเดอร์ DBX ที่เสียหายโดยทำตามคำแนะนำในบทความนี้ </p> <p> 4. ที่บานหน้าต่างด้านซ้ายของโปรแกรม OE ให้คลิกขวาที่โฟลเดอร์ขนาดใหญ่และเลือก <strong> แฟ้มใหม่ </strong> (เพื่อสร้างโฟลเดอร์เมลใหม่) </p> <p><img src=\"images/image_thumb-6-403.png\" alt=\"outlook express 2gb limit\" loading=\"lazy\"></p> <p> </p> <p> 5. พิมพ์ชื่อที่รู้จักสำหรับโฟลเดอร์ใหม่ตามด้วยปี (เช่น &quot;Inbox-2016&quot;) </p> <p><img src=\"images/image_thumb-7-434.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. จากนั้น จากโฟลเดอร์ขนาดใหญ่ (เช่น จาก &quot;Inbox&quot;) ให้เลือกกลุ่มอีเมล (เช่น อีเมลทั้งหมดจากปี 2016) แล้วลากและวาง (ย้าย) ไปที่โฟลเดอร์ Mail ใหม่ที่คุณสร้างไว้ก่อนหน้านี้ (เช่น &quot; อินบ็อกซ์-2016&quot;) </p> <p><img src=\"images/image_thumb-8-450.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. ทำซ้ำขั้นตอนเดิม (เช่น สร้างโฟลเดอร์ต่างๆ ตามปี และย้ายอีเมลจากโฟลเดอร์ขนาดใหญ่ไปยังโฟลเดอร์ใหม่) * </p> <p> * หมายเหตุ: หากคุณประสบปัญหาระหว่างการดำเนินการย้าย (เช่น หากคุณไม่สามารถย้ายข้อความบางข้อความไปยังโฟลเดอร์ใหม่ได้) ให้ทำดังนี้ </p> <blockquote><p> 1. ปิด Outlook Express <br> 2. คัดลอก (สำรอง) โฟลเดอร์ &quot;Outlook Express&quot; จากตำแหน่ง OE Store ไปยังปลายทางอื่นบนดิสก์ของคุณ <br> 3. จากนั้นทำตามคำแนะนำในขั้นตอนที่ 4 เพื่อลบไฟล์ .dbx ที่มีขนาดใหญ่เกินไป <br> 4. เปิด Outlook Express <br> 5. นำเข้าอีเมลจากโฟลเดอร์สำรอง OE (From <strong> ไฟล์ </strong> เมนูไปที่ -&gt; <strong> นำเข้า </strong> <strong> ข้อความ </strong> -&gt; <strong> Microsoft Outlook Express 6 </strong> -&gt; <strong> นำเข้าจดหมายจากไดเรกทอรีร้านค้า OE… </strong> ). ** </p> <p> ** หากคุณยังคงประสบปัญหาในระหว่างการนำเข้า ให้ทำตามคำแนะนำในบทความนี้เพื่อซ่อมแซมไฟล์ DBX ที่เสียหาย </p></blockquote> <p> </p> <p> 8. เมื่อคุณโอนอีเมลเสร็จแล้วและโฟลเดอร์ 2GB ว่างเปล่าจากอีเมล (เช่น &quot;กล่องจดหมาย&quot; ในตัวอย่างนี้) ให้ทำตามขั้นตอนต่อไป </p> <p><img src=\"images/image_thumb-10-811.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> ขั้นตอนที่ 4 ลบไฟล์ Outlook Express DBX ขนาดใหญ่ออกจากดิสก์ของคุณ </h6> <p> 1. เปิดโฟลเดอร์เก็บ Outlook Express บนดิสก์ของคุณ <br> 2. ลบไฟล์ DBX ที่มีขนาดใหญ่เกินไป (เช่น &quot;Inbox.dbx&quot; ในตัวอย่างนี้) </p> <p><img src=\"images/image_thumb-9-996.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. เปิด Outlook Express <br> 4. OE จะสร้าง (โดยอัตโนมัติ) โฟลเดอร์อีเมลใหม่ที่สะอาดและปลอดภัยเพื่อจัดเก็บอีเมล * </p> <p> * หมายเหตุ: หากคุณยังคงได้รับข้อผิดพลาดเดิม ให้ลองซ่อมแซมโฟลเดอร์ OE ที่เสียหายโดยทำตามคำแนะนำในบทความนี้: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีการกู้คืนไฟล์ Outlook Express DBX ฟรี </a> . </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? </p> <p> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}