{"title":"วิธีป้องกันพีซีของคุณด้วย BitLocker ใน Windows 10","content":"<p> บทช่วยสอนนี้มีคำแนะนำทีละขั้นตอนเกี่ยวกับวิธีการใช้รหัสผ่านป้องกันพีซีของคุณด้วยการเข้ารหัสด้วย BitLocker BitLocker เป็นคุณลักษณะการเข้ารหัสดิสก์เต็มรูปแบบที่รวมอยู่ใน Windows 10 รุ่น Professional และ Enterprise และสามารถช่วยคุณในการปกป้องข้อมูลส่วนบุคคลของคุณจากการเข้าถึงโดยไม่ได้รับอนุญาต </p> <p> ลองนึกภาพสถานการณ์ต่อไปนี้: แล็ปท็อปส่วนตัวของคุณถูกขโมยหรือสูญหาย และข้อมูลส่วนตัวของคุณจะอยู่ในสายตาที่ไม่รอบคอบ เพื่อหลีกเลี่ยงไม่ให้สิ่งนี้เกิดขึ้น โปรดอ่านคู่มือนี้ และเรียนรู้วิธีป้องกันรหัสผ่านพีซีและข้อมูลที่มีค่าของคุณด้วยการเข้ารหัสที่รัดกุม เพื่อไม่ให้ใครเข้าถึงได้หากไม่มีรหัสผ่านถอดรหัส </p> <ul> <li><strong> บทความที่เกี่ยวข้อง: <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีป้องกันโฟลเดอร์ด้วยรหัสผ่าน </a></strong></li> </ul> <h4> วิธีใช้ BitLocker เพื่อเข้ารหัสและปกป้องพีซี Windows 10 ของคุณ </h4> <p> เพื่อป้องกันไดรฟ์ระบบปฏิบัติการด้วย BitLocker ใน Windows 10 Pro หรือ Enterprise: </p> <p> 1. จาก Windows <strong> แผงควบคุม </strong> , คลิก <strong> ระบบและความปลอดภัย </strong> แล้วคลิก <strong> การเข้ารหัสลับไดรฟ์ด้วย Bit Locker </strong> . </p> <p><img src=\"images/image_thumb-33-320.png\" alt=\"How to Protect your PC with BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. ถัดจากไดรฟ์ระบบปฏิบัติการ C: คลิก <strong> เปิด BitLocker </strong> . * </p> <p> * หมายเหตุ: หากหลังจากกด &#39;เปิด BitLocker&#39; คุณได้รับข้อผิดพลาด &quot;อุปกรณ์นี้ไม่สามารถใช้โมดูลแพลตฟอร์มที่เชื่อถือได้…&quot; ให้อ่านบทความนี้เพื่อแก้ไขปัญหา </p> <p><img src=\"images/image_thumb-34-100.png\" alt=\"turn on bitlocker operating system drive\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. ในหน้าจอถัดไป เลือกวิธีที่คุณต้องการปลดล็อกไดรฟ์เมื่อเริ่มต้นระบบ </p> <blockquote><p> 1. หากคุณต้องการปลดล็อกพีซีโดยใช้อุปกรณ์ USB คลิก <strong> ใส่แฟลชไดรฟ์ USB <br> </strong> 2. หากคุณต้องการปลดล็อกพีซีโดยพิมพ์รหัสผ่าน ให้คลิก <strong> ใส่รหัสผ่าน </strong> . (เช่นในตัวอย่างนี้) </p></blockquote> <p><img src=\"images/image_thumb-35-212.png\" alt=\"enable bitlocker protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. ตอนนี้พิมพ์รหัสผ่านที่รัดกุมมากแล้วคลิก <strong> ต่อไป </strong> . </p> <p><img src=\"images/image_thumb-36-435.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. ตอนนี้เลือกตำแหน่งที่คุณต้องการบันทึก* คีย์การกู้คืนแล้วคลิก <strong> ต่อไป </strong> . * </p> <p> * ตัวอย่างเช่น หากคุณเข้าสู่ระบบ Windows 10 ด้วยบัญชี Microsoft ให้คลิก <strong> บันทึกลงในบัญชี Microsoft ของคุณ </strong> หากคุณเข้าสู่ระบบ Windows 10 ด้วยบัญชีท้องถิ่น ให้เลือกตัวเลือกอื่น </p> <p> หมายเหตุ: <br> 1. หากคุณบันทึกคีย์การกู้คืน BitLocker ลงในบัญชี Microsoft ของคุณ คุณสามารถดูคีย์ได้หลังจากเข้าสู่ระบบ <a title=\"https://onedrive.live.com/recoverykey.\" href=\"https://onedrive.live.com/recoverykey.\" target=\"_blank\" rel=\"nofollow noopener\"> https://onedrive.live.com/recoverykey </a><br> 2. ฉันชอบเก็บคีย์การกู้คืนไว้ในไดรฟ์ USB เสมอ เพื่อเตรียมพร้อมที่จะแก้ไขปัญหา BitLocker </p> <p> </p> <p><img src=\"images/image_thumb-37-801.png\" alt=\"save bitlocker recovery key\" loading=\"lazy\"></p> <p> </p> <p> 6. ในหน้าจอถัดไปให้ปล่อยการตั้งค่าเริ่มต้นไว้หากพีซีและ/หรือไดรฟ์ของคุณเป็นเครื่องใหม่ จากนั้นคลิก <strong> ต่อไป </strong> อีกครั้ง </p> <p><img src=\"images/image_thumb-38-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. ที่ตัวเลือกโหมดการเข้ารหัส ให้ปล่อยการตั้งค่าเริ่มต้นไว้และคลิก <strong> ต่อไป </strong> . </p> <p><img src=\"images/image_thumb-39-785.png\" alt=\"bitlocker encryption mode\" loading=\"lazy\"></p> <p> </p> <p> 8. ที่หน้าจอสุดท้าย คลิก <strong> ดำเนินการต่อ </strong> เพื่อรีสตาร์ทและตรวจสอบระบบก่อนเปิดใช้งานการป้องกันด้วย BitLocker </p> <p><img src=\"images/image_thumb-40-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. เมื่อรีสตาร์ท คุณจะได้รับแจ้งให้ป้อนรหัสผ่าน BitLocker ของคุณ พิมพ์รหัสผ่านแล้วกด <strong> ป้อน </strong> . * </p> <p> * หมายเหตุ: หาก BitLocker ไม่สามารถยอมรับรหัสผ่านได้ หรือหากคุณประสบปัญหาอื่นๆ ให้ลองดำเนินการอย่างใดอย่างหนึ่งต่อไปนี้เพื่อเข้าสู่ระบบ Windows </p> <blockquote><p> 1. กดปุ่ม ESC ที่หน้าจอรหัสผ่านของ BitLocker เพื่อเข้าถึงตัวเลือกการกู้คืน <br> 2. กดปุ่ม ESC ซ้ำๆ หลังจากเปิดเครื่องพีซีของคุณ เพื่อหลีกเลี่ยงการทดสอบ BitLocker </p></blockquote> <p> 10. หากการทดสอบ BitLocker ผ่าน หลังจากบูทเป็น Windows 10 แล้ว BitLocker จะเริ่มเข้ารหัสไดรฟ์ระบบปฏิบัติการของคุณ หากต้องการดูสถานะของกระบวนการเข้ารหัส ให้คลิกการแจ้งเตือน BitLocker ในแถบงาน หรือไปที่แผงควบคุม &gt; การเข้ารหัสลับไดรฟ์ด้วย BitLocker </p> <p><img src=\"images/image_thumb-41-171.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}