{"title":"วิธีการกู้คืนไฟล์ Outlook Express DBX ฟรี","content":"<p> Outlook Express เป็นโปรแกรมไคลเอนต์อีเมลที่เห็นครั้งแรกใน Windows XP แต่แม้กระทั่งวันนี้ (ปี 2018) ลูกค้าบางคนก็ยังใช้มันเป็นโปรแกรมอีเมลหลัก ปัญหาหลักอย่างหนึ่งของ Outlook Express คือปัญหาขีดจำกัด 2GB </p> <p> คำอธิบายของปัญหาขีดจำกัดขนาด 2GB ใน Outlook Express <br> เมื่อหนึ่งในโฟลเดอร์หลักของ Outlook Express (เช่น &quot;กล่องจดหมาย&quot; หรือ &quot;ส่ง&quot;) เกินขนาด 2GB ไฟล์จัดเก็บ OE DBX ที่เกี่ยวข้องอาจเสียหาย และโฟลเดอร์ OE อาจดูเหมือนว่างเปล่า อันเป็นผลมาจากปัญหา Outlook Express ไม่สามารถส่งหรือรับอีเมลและแสดงข้อผิดพลาด <a href=\"https://www.repairwin.com/fix-outlook-express-error-0x800c0133-due-to-2gb-size-limit/\" target=\"_blank\" rel=\"nofollow noopener\"> 0x800c0133 </a> ระหว่างดำเนินการส่ง/รับ </p> <p> ในบทช่วยสอนนี้ ฉันจะแสดงให้คุณเห็นถึงวิธีซ่อมแซมไฟล์ DBX ที่เสียหายจาก Outlook Express และกู้คืนอีเมลของคุณ! </p> <h4> วิธีแก้ไขไฟล์ Outlook Express DBX ที่เสียหาย </h4> <p> หากโฟลเดอร์ใดโฟลเดอร์หนึ่งของ Outlook Express (กล่องจดหมาย ส่ง ฯลฯ) เสียหาย ให้ทำตามคำแนะนำด้านล่างเพื่อซ่อมแซมโฟลเดอร์ร้านค้า DBX และกู้คืนอีเมลของคุณ </p> <h6> ขั้นตอนที่ 1 เปิดใช้งานมุมมองไฟล์ที่ซ่อนอยู่ </h6> <p> 1. เปิด Windows Explorer <br> 2. จาก <strong> เครื่องมือ </strong> เลือกเมนู <strong> ตัวเลือกโฟลเดอร์ </strong> . <br> 3. ที่แท็บ มุมมอง คลิก <strong> แสดงไฟล์และโฟลเดอร์ที่ซ่อนอยู่ </strong> และคลิก <strong> ตกลง. </strong></p> <p><img src=\"images/image_thumb-2-290.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> ขั้นตอนที่ 2 ค้นหาไฟล์ Outlook Express DBX ที่เสียหายบนดิสก์ของคุณ </h6> <p> 1. เปิดโฟลเดอร์ร้านค้า Outlook Express โดยปกติโฟลเดอร์นี้จะอยู่ที่เส้นทางต่อไปนี้บนดิสก์ของคุณ: </p> <ul> <li> C:\\Documents and Settings\\\\Local Settings\\Application Data\\Identities\\{}\\Microsoft\\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> เช่น. “C:\\Documents and Settings\\User\\Local Settings\\Application Data\\Identities\\{D8F3C56D-965E-41AE-8A23-A58460ABAE00}\\Microsoft\\ <strong> Outlook Express </strong> ” </p></blockquote> <p> 3. จากนักสำรวจ <strong> ดู </strong> เลือกเมนู <strong> รายละเอียด </strong> . <br> 4. ค้นหาไฟล์ DBX ที่เกินขีดจำกัดที่เก็บข้อมูล 2GB หรือค้นหาไฟล์ DBX ที่เสียหาย (ไฟล์ DBX ที่เสียหาย คือโฟลเดอร์ MAIL ที่ดูเหมือนว่างเปล่าในโปรแกรม Outlook Express) </p> <p><img src=\"images/image_thumb-3-887.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. คัดลอกไฟล์ DBX นั้นไปยังตำแหน่งอื่นบนดิสก์ของคุณ (เช่น ไปยังโฟลเดอร์ใหม่บนเดสก์ท็อปของคุณที่ชื่อ &quot;CorruptedDBX&quot;) </p> <p> </p> <h6> ขั้นตอนที่ 3 ดาวน์โหลด UnDBX – ยูทิลิตี้การกู้คืน DBX Outlook Express ฟรี </h6> <p> UnDBX เป็นเครื่องมือซ่อมแซม Outlook Express DBX ที่ยอดเยี่ยมและฟรี ซึ่งสามารถแยกอีเมล Outlook Express ที่มีอยู่ทั้งหมดในรูปแบบ .eml นอกจากนี้ยังมีตัวเลือกในการแก้ไขและซ่อมแซมไฟล์ Outlook Express .DBX ที่เสียหาย </p> <p> คุณสามารถดาวน์โหลด UnDBX ได้จาก <a href=\"https://sourceforge.net/projects/undbx/\" target=\"_blank\" rel=\"nofollow noopener\"> ที่นี่ </a> . </p> <p> </p> <h6> ขั้นตอนที่ 4 กู้คืนอีเมลจากไฟล์ Outlook Express DBX ที่เสียหาย </h6> <p> 1. ในการกู้คืนอีเมลจากไฟล์ DBX ที่เสียหาย ให้ดับเบิลคลิกเพื่อเรียกใช้ยูทิลิตี UnDBX <br> 2. ในยูทิลิตี้ UnDBX: </p> <blockquote><p> 1. เลือกโฟลเดอร์ที่มีไฟล์ .dbx ของ Outlook Express แล้วเลือก <strong> ตรวจสอบ </strong> &quot; <strong> เปิดใช้งานโหมดการกู้คืน </strong> &quot; ตัวเลือกด้านล่าง <br> 2. <strong> เลือกโฟลเดอร์ปลายทาง </strong> บนคอมพิวเตอร์ของคุณเพื่อจัดเก็บ (แตกไฟล์) ไฟล์ .eml (เช่น ไปยังโฟลเดอร์บนเดสก์ท็อปของคุณที่ชื่อ &quot;RecoveredInbox&quot;) <br> 3. สุดท้าย click <strong> กู้คืน </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-645.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. เมื่อการกู้คืน UnDBX เสร็จสิ้น ให้เปิด Outlook Express <br> 4. นำทางไปยังโฟลเดอร์ที่ UnDBX บันทึกไฟล์ .eml ที่แยกออกมา <br> 5. ลากและวางอีเมลที่แยกแล้วไปยังโฟลเดอร์ที่เกี่ยวข้อง (ใน Outlook Express) * </p> <p><strong> * คำแนะนำ: </strong> เพื่อหลีกเลี่ยงไม่ให้โฟลเดอร์ Outlook Express เสียหายอีก (หรือเพื่อหลีกเลี่ยงขีดจำกัด 2GB) ฉันแนะนำให้ลากและวางอีเมลในกลุ่ม (เช่น ตามปี) และนำไปไว้ในโฟลเดอร์อื่นใน OE ตัวอย่างเช่น เลือกเฉพาะอีเมลจากปีปัจจุบัน แล้วลากและวางลงในโฟลเดอร์ OE ใหม่ที่มีชื่อเป็นปีปัจจุบัน (เช่น &quot;Inbox 2018&quot;) จากนั้นทำซ้ำขั้นตอนเดิมจากอีเมลอื่นๆ ทั้งหมดจากปีก่อนหน้า </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}