{"title":"วิธีลงชื่อเข้าใช้ Windows 10/8/7 อัตโนมัติ (โดยไม่ต้องพิมพ์รหัสผ่าน)","content":"<p> บทช่วยสอนนี้มีคำแนะนำเกี่ยวกับวิธีการลงชื่อเข้าใช้ Windows 10 โดยอัตโนมัติ อันที่จริง คุณจะได้เรียนรู้วิธีลงชื่อเข้าใช้บัญชีผู้ใช้ของคุณโดยอัตโนมัติ (บัญชี Microsoft, Local หรือ Domain) โดยไม่ต้องป้อนข้อมูลประจำตัวของคุณที่ลงชื่อเข้าใช้หรือที่หน้าจอล็อค . คำแนะนำนี้ใช้กับระบบปฏิบัติการ Windows 10/8/7 </p> <p> เมื่อคุณทำการติดตั้ง Windows 10 ใหม่ คุณจะได้รับแจ้งให้ระบุบัญชีผู้ใช้และรหัสผ่านเพื่อใช้คอมพิวเตอร์ ในขั้นตอนนี้ คุณสามารถใช้บัญชี Microsoft ของคุณ (ด้วยรหัสผ่านบัญชี MS) หรือสร้างบัญชีภายในเครื่องใหม่และรหัสผ่านใหม่เพื่อลงชื่อเข้าใช้ใน Windows ในทั้งสองกรณี (เว้นแต่คุณจะสร้างบัญชีภายในเครื่องด้วยรหัสผ่านเปล่า) คุณจะได้รับแจ้งให้พิมพ์รหัสผ่านทุกครั้งที่เริ่ม Windows </p> <p> การปกป้องคอมพิวเตอร์ของคุณด้วยรหัสผ่านเป็นมาตรการรักษาความปลอดภัยที่ดี โดยเฉพาะอย่างยิ่งหากคุณใช้คอมพิวเตอร์ร่วมกับผู้อื่น หรือเมื่อคุณเดินทางกับแล็ปท็อป หรือเมื่อพีซีของคุณอยู่ในสภาพแวดล้อมทางธุรกิจ แต่ถ้าคุณเป็นผู้ใช้เพียงคนเดียวในคอมพิวเตอร์เดสก์ท็อปแบบสแตนด์อโลนของคุณ หรือหากคุณใช้แล็ปท็อปที่บ้านเท่านั้น คุณไม่จำเป็นต้องพิมพ์ข้อมูลประจำตัวของคุณทุกครั้งที่คุณต้องการใช้ * </p> <p><strong> คำเตือน: </strong> ห้ามเปิดใช้งานการเข้าสู่ระบบอัตโนมัติบน Windows หากคุณใช้คอมพิวเตอร์ร่วมกับผู้อื่น หรือหากคุณเดินทางพร้อมกับแล็ปท็อปหรือแท็บเล็ต เพราะทุกคนที่ค้นพบคอมพิวเตอร์ของคุณจะสามารถเข้าถึงไฟล์ของคุณได้โดยง่าย </p> <h4> วิธีลงชื่อเข้าใช้บัญชีผู้ใช้ของคุณใน Windows 10/8/7/Vista โดยอัตโนมัติ (เปิดใช้งานการเข้าสู่ระบบอัตโนมัติ) </h4> <h6> วิธีที่ 1. เปิดการเข้าสู่ระบบอัตโนมัติโดยใช้ยูทิลิตี้ AUTOLOGON </h6> <p> Microsoft ได้ออกแบบเครื่องมือเพื่อทำให้กระบวนการเข้าสู่ระบบใน Windows เป็นไปโดยอัตโนมัติ เครื่องมือนี้มีชื่อว่า &quot;Autologon&quot; และช่วยให้คุณสามารถกำหนดค่า Windows ให้เข้าสู่ระบบอัตโนมัติได้อย่างง่ายดายโดยไม่ต้องพิมพ์ข้อมูลประจำตัวของคุณทุกครั้งที่เริ่มต้น ข้อดีของเครื่องมือนี้คือ รหัสผ่านถูกเก็บไว้ในรีจิสทรี </p> <p> 1. ดาวน์โหลด <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/autologon\" target=\"_blank\" rel=\"nofollow noopener\"> เข้าสู่ระบบอัตโนมัติ </a> ยูทิลิตี้ <br> 2. แตกไฟล์ที่ดาวน์โหลดมา <br> 3. เรียกใช้ &quot;autologon.exe&quot; <br> 4. พิมพ์รหัสผ่านแล้วคลิก <strong> เปิดใช้งาน </strong> . </p> <p><img src=\"images/image_thumb-44-251.png\" alt=\"windows auto login\" loading=\"lazy\"></p> <p> * หมายเหตุ: หากคุณต้องการเปิดการเข้าสู่ระบบอัตโนมัติ ให้เรียกใช้ยูทิลิตี้อีกครั้งแล้วคลิก <strong> ปิดการใช้งาน </strong> . </p> <p> </p> <h6> วิธีที่ 2 เปิดใช้งานการลงชื่อเข้าใช้อัตโนมัติจากแผงควบคุมบัญชีผู้ใช้ </h6> <p> วิธีที่สองในการเปิดใช้งานการเข้าสู่ระบบอัตโนมัติใน Windows 10/8/7 คือการปิดใช้งานการตั้งค่า &quot;ผู้ใช้ต้องป้อนชื่อผู้ใช้และรหัสผ่านเพื่อใช้คอมพิวเตอร์เครื่องนี้&quot; ในแผงควบคุมบัญชีผู้ใช้ ในการทำเช่นนั้น: </p> <p> หมายเหตุ: หากคุณใช้บัญชีท้องถิ่น มีอีกวิธีหนึ่งที่ง่ายกว่าในการบังคับให้ Windows ลงชื่อเข้าใช้โดยอัตโนมัติ: เพียงระบุรหัสผ่านใหม่เปล่า (ว่างเปล่า) จากการตั้งค่า &gt; บัญชี &gt; ตัวเลือกการลงชื่อเข้าใช้ &gt; เปลี่ยนรหัสผ่าน จากนั้นพิมพ์รหัสผ่านของคุณหนึ่งครั้ง จากนั้นคลิก Next สองครั้งและเสร็จสิ้น </p> <p> 1. กด Windows <img src=\"images/image_thumb8_thumb_thumb-738.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> ปุ่มเพื่อเปิดกล่องคำสั่งเรียกใช้ <br> 2. ในกล่อง &quot;เปิด&quot; พิมพ์: <strong> ควบคุมรหัสผ่านผู้ใช้2 </strong> &amp; คลิก <strong> ตกลง </strong> . </p> <p><img src=\"images/image_thumb-29-873.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. ในตัวเลือกบัญชีผู้ใช้ (แท็บ &#39;ผู้ใช้&#39;) <strong> ยกเลิกการเลือก </strong> <strong> ผู้ใช้ต้องป้อนชื่อผู้ใช้และรหัสผ่านเพื่อใช้ช่องทำเครื่องหมายคอมพิวเตอร์เครื่องนี้ </strong> แล้วคลิก <strong> สมัคร. * </strong></p> <p> * หมายเหตุ: หากคุณต้องการปิดใช้งานการเข้าสู่ระบบอัตโนมัติในอนาคต ให้เลือกช่องนี้ </p> <p><img src=\"images/image_thumb-32-315.png\" alt=\"auto login windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. พิมพ์ (สองครั้ง) รหัสผ่านบัญชีของคุณแล้วคลิก <strong> ตกลง </strong> สองครั้งเพื่อปิดคุณสมบัติบัญชีผู้ใช้ </p> <p><img src=\"images/image_thumb-31-509.png\" alt=\"Auto Login to Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> วิธีที่ 3 เปิดใช้งานการเข้าสู่ระบบอัตโนมัติใน Registry (Windows 10/8/7/Vista) </h6> <p> วิธีสุดท้ายในการปิดใช้งานการเข้าสู่ระบบด้วยรหัสผ่านในระบบปฏิบัติการ Windows 10, 8 หรือ 7 คือการเปิดใช้งานการลงทะเบียนการลงชื่อเข้าใช้อัตโนมัติ ในการทำเช่นนั้น: </p> <p> 1. กด Windows <img src=\"images/image_thumb8_thumb_thumb-512.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> ปุ่มเพื่อเปิดกล่องคำสั่งเรียกใช้ <br> 2. ในกล่อง &quot;เปิด&quot; พิมพ์: <strong> regedit </strong> &amp; คลิก <strong> ตกลง </strong> . </p> <p><img src=\"images/image_thumb7-114.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. ไปที่คีย์นี้จากบานหน้าต่างด้านซ้าย: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon </li> </ul> <p> 4. ที่บานหน้าต่างด้านขวา: </p> <blockquote><p> ก. คลิกขวาที่พื้นที่ว่างแล้วเลือก <strong> ใหม่ </strong> &gt; <strong> ค่าสตริง. </strong></p> <p><img src=\"images/image_thumb-38-930.png\" alt=\"image\" loading=\"lazy\"></p> <p> ข. เปลี่ยนชื่อค่าใหม่เป็น <strong> DefaultUserName </strong> แล้วกด <strong> ป้อน </strong> . <br> ค. เปิดค่า REG_SZ &#39;DefaultUserName&#39; <br> ง. พิมพ์ชื่อบัญชีผู้ใช้ภายในของคุณหรือบัญชี Microsoft ของคุณแล้วคลิก <strong> ตกลง </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-42-933.png\" alt=\"enable auto login registry\" loading=\"lazy\"></p> <p> </p> <p> 5ก. ทำตามขั้นตอนเดียวกันและสร้างค่า REG_SZ (สตริง) ใหม่และตั้งชื่อว่า <strong> DefaultPassword </strong> . <br> 5ข. ดับเบิลคลิกที่ &#39;DefaultPassword <strong> &#39; </strong> ค่า REG_SZ พิมพ์รหัสผ่านของคุณในช่อง Value data แล้วคลิก <strong> ตกลง </strong> . </p> <p><img src=\"images/image_thumb-43-192.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7ก. สุดท้าย สร้างค่า REG_SZ ใหม่และตั้งชื่อว่า <b> เข้าสู่ระบบผู้ดูแลระบบอัตโนมัติ </b> . <br> 7b. ดับเบิลคลิกที่ค่า &#39;AutoAdminLogon&#39; พิมพ์ <strong> 1 </strong> ในกล่องข้อมูลค่าและคลิก <strong> ตกลง </strong> . </p> <p><img src=\"images/image_thumb-41-705.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. ปิดตัวแก้ไขรีจิสทรีและรีสตาร์ทพีซีของคุณ * </p> <p> * หมายเหตุ: <br> 1. หากคอมพิวเตอร์ของคุณเป็นส่วนหนึ่งของโดเมน คุณจะต้องสร้างค่า REG_SZ อีกค่าหนึ่งโดยใช้ชื่อ <strong> DefaultDomainName </strong> จากนั้นให้พิมพ์กล่องข้อมูลค่าชื่อโดเมนของคุณ <br> 2. หากต้องการปิดใช้งานการเข้าสู่ระบบอัตโนมัติในอนาคต เพียงลบค่าสตริงที่สร้างขึ้นใหม่ตามที่กล่าวไว้ข้างต้น </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}