{"title":"วิธีสำรองไฟล์ส่วนบุคคลด้วยประวัติไฟล์ใน Windows 10","content":"<p> ในบทช่วยสอนนี้ ฉันจะแสดงวิธีกำหนดค่า Windows 10 ให้สร้างสำเนาและสแน็ปช็อตของไฟล์ของคุณโดยอัตโนมัติโดยใช้เครื่องมือสำรองข้อมูลประวัติไฟล์ เพื่อให้สามารถกู้คืนได้ (หากจำเป็น) โดยใช้ &quot;กู้คืนเวอร์ชันก่อนหน้า&quot; ลักษณะเฉพาะ. </p> <p> ตามที่คุณอาจสังเกตเห็นแล้ว โดยค่าเริ่มต้น Windows 10 จะไม่เก็บไฟล์หรือโฟลเดอร์เวอร์ชันก่อนหน้าของคุณไว้ เช่นใน Windows 7 สิ่งนี้เกิดขึ้น เนื่องจาก Windows 10 จะไม่ใช้บริการ &#39;Volume Shadow Copy&#39; ถ่ายภาพสแน็ปช็อตของไฟล์ของคุณ แต่จะใช้เฉพาะเครื่องมือสำรองข้อมูล &#39;ประวัติไฟล์&#39; เท่านั้น </p> <p> &quot;ประวัติไฟล์&quot; เป็นเครื่องมือสำรองข้อมูลในตัวที่ยอดเยี่ยมใน Windows 10 ที่สามารถกำหนดค่าให้ถ่ายสำเนาและสแน็ปช็อตของไฟล์ไปยังตำแหน่งที่จัดเก็บอื่นนอกเหนือจากไดรฟ์หลัก (เช่น ไดรฟ์ USB เครือข่าย ฯลฯ) . * </p> <p> * หมายเหตุ: ข้อจำกัดเพียงอย่างเดียวของเครื่องมือ &quot;ประวัติไฟล์&quot; คือไม่อนุญาตให้คุณเลือกไดรฟ์ C: เป็นปลายทางสำรองสำรอง หากคุณไม่มีไดรฟ์สำรองสำหรับการสำรองข้อมูล ให้อ่านบทช่วยสอนนี้ต่อไปเพื่อหาวิธีเลี่ยงข้อจำกัดนี้... </p> <ul> <li><strong> บทความที่เกี่ยวข้อง: </strong> <a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีสร้าง Shadow Copy ของไฟล์ด้วย Task Scheduler ใน Windows 10 </a></li> </ul> <h4> วิธีสำรองไฟล์ส่วนตัวของคุณด้วยเครื่องมือสำรองข้อมูลประวัติไฟล์ใน Windows 10 </h4> <p> 1. ตามที่ได้กล่าวไว้ข้างต้น ในการสำรองไฟล์ของคุณด้วยเครื่องมือสำรองข้อมูลประวัติไฟล์ คุณต้องมีไดรฟ์จัดเก็บข้อมูลที่เชื่อมต่อกับพีซีของคุณ (เช่น ไดรฟ์ USB) หรือตำแหน่งเครือข่าย (เช่น คอมพิวเตอร์เครื่องอื่นในเครือข่าย หรืออุปกรณ์จัดเก็บข้อมูล NAS) * </p> <p> * หมายเหตุ: หากคุณไม่ได้เป็นเจ้าของอุปกรณ์จัดเก็บข้อมูลสำรอง คุณมีตัวเลือกดังต่อไปนี้: </p> <blockquote><p> ก. โต <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> ลดขนาดไดรฟ์หลักของคุณ C:\\ </a> และด้วยพื้นที่ว่างที่พร้อมใช้งานเพื่อสร้างไดรฟ์ใหม่เพื่อเก็บข้อมูลสำรอง หรือ... </p> <p> B. ในการจัดเก็บข้อมูลสำรองไว้ในไดรฟ์หลัก C:\\ ในกรณีนี้ ให้สร้างโฟลเดอร์ใหม่บนไดรฟ์ C: และตั้งชื่อว่า &quot;FileHistory&quot; (หรืออะไรก็ได้ที่คุณต้องการ) และดำเนินการต่อด้านล่าง... </p></blockquote> <p> 2. ไปที่ Windows <strong> แผงควบคุม </strong> และต่ำกว่า <strong> ระบบและความปลอดภัย, </strong> คลิก <strong> บันทึกข้อมูลสำรอง </strong><strong> สำเนาไฟล์ของคุณด้วยประวัติไฟล์ </strong></p> <p><img src=\"images/image_thumb-42-924.png\" alt=\"How to Backup & Keep Previous Versions of Files in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 3. ตามกรณีของคุณ ให้ดำเนินการดังต่อไปนี้: </p> <ul> <li><strong> กรณี ก. </strong> หากคุณเป็นเจ้าของไดรฟ์ที่พร้อมใช้งานสำหรับการสำรองข้อมูล ให้ทำดังนี้ </li> </ul> <blockquote><p> ก. คลิก <strong> เปิด </strong> ปุ่มที่หน้าจอเพื่อเปิดใช้งาน &#39;ประวัติไฟล์&#39; <br> ข. ไปต่อ <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> ขั้นตอนที่ 4 </a> ด้านล่างเพื่อกำหนดการตั้งค่าการสำรองข้อมูล &#39;ประวัติไฟล์&#39; </p></blockquote> <p><img src=\"images/image_thumb-44-788.png\" alt=\"Turn On File History Windows 10\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> กรณี ข: </strong> หากคุณไม่ได้เป็นเจ้าของไดรฟ์ที่พร้อมใช้งานสำหรับการสำรองข้อมูลประวัติไฟล์ หรือหากคุณต้องการจัดเก็บข้อมูลสำรองบนเครือข่าย ให้ทำดังนี้ </li> </ul> <blockquote><p> ก. คลิก <strong> เลือกตำแหน่งเครือข่าย </strong></p></blockquote> <p><img src=\"images/image_thumb-56-796.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> ข. ที่หน้าจอถัดไป: </p> <p> 1. หากคุณต้องการบันทึกข้อมูลสำรองบนเครือข่าย ให้พิมพ์เส้นทางเครือข่ายแบบเต็มของตำแหน่งที่เก็บข้อมูลสำรอง แล้วคลิก <strong> เลือกโฟลเดอร์ </strong> . </p> <p> 2.  หากคุณต้องการบันทึกข้อมูลสำรองในไดรฟ์หลัก C:\\ ให้พิมพ์พาธเครือข่ายแบบเต็มไปยังโฟลเดอร์สำรองในเครื่องบนไดรฟ์ C:\\ ในแบบฟอร์มนี้: * </p> <ul> <li> <strong> \\\\ชื่อคอมพิวเตอร์\\C$\\FileHistory </strong></li> </ul> <p> * หมายเหตุ: <br> 1. แทนที่ค่า &quot;Computer-Name&quot; ด้วยชื่อพีซีของคุณ (หากต้องการค้นหาชื่อคอมพิวเตอร์ของคุณ ให้คลิกขวาที่ไอคอน &quot;พีซีเครื่องนี้&quot; ใน Windows Explorer) <br> 2. โปรดจำไว้ว่า การบันทึกข้อมูลสำรองของไฟล์ส่วนตัวของคุณไว้ที่ไดรฟ์เดียวกันกับที่จัดเก็บไว้แล้ว <strong> ไม่ใช่วิธีแก้ปัญหาที่เชื่อถือได้ </strong> . เพื่อความปลอดภัย ให้จัดเก็บข้อมูลสำรองไว้ในอุปกรณ์จัดเก็บข้อมูลอื่นเสมอ </p></blockquote> <p> เช่น: ถ้าชื่อคอมพิวเตอร์คือ &quot;Pegasus&quot; ให้พิมพ์: &quot;\\\\Pegasus\\C$\\FileHistory&quot; </p> <p><img src=\"images/image_thumb-53-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> ค. ในหน้าจอถัดไป ให้คลิก <strong> ตกลง </strong> . </p></blockquote> <p><img src=\"images/image_thumb-54-349.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> ง. ตอนนี้คลิกที่ <strong> เปิด </strong> เพื่อเปิดใช้งานเครื่องมือสำรองข้อมูลประวัติไฟล์ จากนั้นดำเนินการร้องต่อเพื่อกำหนดการตั้งค่าการสำรองข้อมูล </p></blockquote> <p><img src=\"images/image_thumb-48-620.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. ในการกำหนดค่าตัวเลือกการสำรองข้อมูล &#39;ประวัติไฟล์&#39; ให้คลิก <strong> ตั้งค่าขั้นสูง </strong> ทางซ้าย. </p> <p><img src=\"images/image_thumb-49-919.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4ก. แล้วที่ <strong> ตั้งค่าขั้นสูง </strong> กำหนดความถี่ในการสำรองไฟล์ของคุณ และระยะเวลาที่จะเก็บเวอร์ชันที่บันทึกไว้ เสร็จแล้วคลิก <strong> บันทึกการเปลี่ยนแปลง </strong> . </p> <p><img src=\"images/image_thumb-61-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. สุดท้าย click <strong> วิ่งเลย </strong> เพื่อทำการสำรองข้อมูลครั้งแรกของคุณ * </p> <p><img src=\"images/image_thumb-55-463.png\" alt=\"image\" loading=\"lazy\"></p> <p> * ความช่วยเหลือเพิ่มเติม – หมายเหตุ: <br> 1. ตามค่าเริ่มต้น &#39;ประวัติไฟล์&#39; จะสำรองข้อมูลโฟลเดอร์ &#39;ไลบรารี&#39; (เดสก์ท็อป เอกสาร รายการโปรด เพลง OneDrive รูปภาพและวิดีโอ) หากคุณต้องการแยกโฟลเดอร์เหล่านี้ออกจากข้อมูลสำรอง รวมโฟลเดอร์อื่น หรือตรวจสอบตัวเลือกการสำรองข้อมูลประวัติไฟล์ทั้งหมด ให้ไปที่: </p> <ul> <li> <p><strong> การตั้งค่า <img src=\"images/image_thumb-58-467.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> อัปเดต &amp; ความปลอดภัย </strong> &gt; <strong> สำรอง </strong> &gt; <strong> ตัวเลือกเพิ่มเติม </strong></p> </li> </ul> <p><img src=\"images/image_thumb-57-938.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. ในการกู้คืนไฟล์ของคุณจากข้อมูลสำรอง &quot;ประวัติไฟล์&quot; ให้ไปที่ตำแหน่งใดตำแหน่งหนึ่งต่อไปนี้: </p> <ul> <li><strong> แผงควบคุม </strong> &gt; <strong> ประวัติไฟล์ </strong> &gt; <strong> กู้คืนไฟล์ส่วนบุคคล </strong></li> <li><strong> การตั้งค่า <img src=\"images/image_thumb-59-275.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> อัปเดต &amp; ความปลอดภัย </strong> &gt; <strong> สำรอง </strong> &gt; <strong> ตัวเลือกเพิ่มเติม </strong> &gt; <strong> กู้คืนไฟล์จากข้อมูลสำรองปัจจุบัน </strong></li> </ul> <p> 3. หากต้องการเลือกกู้คืนไฟล์หรือโฟลเดอร์เป็นเวอร์ชันก่อนหน้า ให้คลิกขวาที่ไฟล์ (หรือโฟลเดอร์) แล้วเลือก <strong> กู้คืนเวอร์ชันก่อนหน้า </strong> . </p> <p><img src=\"images/image_thumb-60-867.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}