{"title":"วิธีเปิดใช้งานการป้องกันการคืนค่าระบบในระบบปฏิบัติการ Windows 10/8/7","content":"<p> บทช่วยสอนนี้มีคำแนะนำเกี่ยวกับวิธีการเปิดใช้งานการป้องกันระบบในระบบปฏิบัติการ Windows 10, 8 และ 7 System Restore Protection (เรียกทั่วไปว่า &#39;System Protection&#39;) เป็นคุณลักษณะของ Windows ที่ช่วยให้คุณ <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> คืนค่า </a> ระบบของคุณไปยังช่วงเวลาก่อนหน้านี้ หาก Windows ทำงานไม่ถูกต้องหลังจากมีการเปลี่ยนแปลงที่สำคัญในไฟล์ระบบ (เช่น หลังจาก Windows Update หรือหลังจากการโจมตีของไวรัส) </p> <p> เครื่องมือ System Restore ใช้บริการ Volume Shadow Copy เพื่อถ่ายภาพสแน็ปช็อตของไฟล์ระบบ Windows และรีจิสตรี้ และบันทึกเป็น Restore Points &quot;จุดคืนค่า&quot; เหล่านี้สามารถใช้เพื่อกู้คืนระบบกลับสู่สภาพการทำงานก่อนหน้า หาก Windows ไม่สามารถบู๊ตได้หรือหากไม่เสถียร โดยไม่ต้องติดตั้งระบบปฏิบัติการใหม่ </p> <h4> วิธีเปิดการป้องกันการคืนค่าระบบใน Windows 10 </h4> <p> 1. เปิด Windows explorer คลิกขวาที่ไอคอน &quot;พีซีเครื่องนี้&quot; แล้วเลือก <strong> คุณสมบัติ </strong> . </p> <p><img src=\"images/image_thumb-70-672.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 2. เลือก <strong> การป้องกันระบบ </strong> ทางด้านซ้าย </p> <p><img src=\"images/image_thumb-71-762.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. เน้นที่ <strong> ดิสก์ในเครื่อง C: (ระบบ) </strong> และคลิก <strong> กำหนดค่า </strong></p> <p><img src=\"images/image_thumb-72-782.png\" alt=\"turn on system restore protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. ที่ตัวเลือกการป้องกันระบบ เลือก <strong> เปิดการป้องกันระบบ </strong> และคลิก <strong> ตกลง. * </strong></p> <p> * หมายเหตุ: หากเปิดใช้งาน &quot;การป้องกันระบบ: อยู่แล้ว ถือว่าใช้ได้&quot; </p> <p><img src=\"images/image_thumb-73-192.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 5. สุดท้าย ที่ตัวเลือกการป้องกันระบบ คลิก <strong> สร้าง </strong> เพื่อสร้างสแน็ปช็อต (จุดคืนค่า) ของสถานะระบบปัจจุบัน </p> <p><img src=\"images/image_thumb-75-308.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}