{"title":"วิธีบล็อก YouTube บน Windows 10","content":"<p> เนื่องจากการเรียนทางไกลได้กลายเป็นส่วนหนึ่งของชีวิตเด็กๆ ในช่วงไม่กี่ปีที่ผ่านมา ผู้ปกครองจำนวนมากจึงมองหาวิธีบล็อกวิดีโอ YouTube ระหว่างการเรียนรู้ทางอิเล็กทรอนิกส์ หรือลดเวลาที่เด็กๆ ใช้หน้าคอมพิวเตอร์ดูวิดีโอแทนการทำกิจกรรมอื่นๆ </p> <p> นอกจากการเสพติด YouTube ที่ทำให้ผู้ปกครองต้องกังวลแล้ว ในช่วงไม่กี่ปีที่ผ่านมามีการเผยแพร่วิดีโอ YouTube จำนวนมากที่มีเนื้อหาไม่เหมาะสมหรือเป็นอันตรายสำหรับเด็ก และด้วยเหตุนี้จึงจำเป็นต้องจำกัดการเข้าถึง YouTube โดยเฉพาะอย่างยิ่งเมื่อไม่มีผู้ปกครองดูแล </p> <p> ในคู่มือนี้ คุณจะได้เรียนรู้วิธีป้องกันการเข้าถึงเว็บไซต์ YouTube ในทุกเบราว์เซอร์ * </p> <p> * หมายเหตุ: หากคุณต้องการบล็อกเว็บไซต์ใน Chrome หรือ Firefox เท่านั้น โปรดอ่านบทความนี้: <a href=\"https://www.repairwin.com/block-websites-on-chrome-firefox/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีบล็อกเว็บไซต์ใน Chrome และ Firefox </a></p> <h2> วิธีบล็อก YouTube บนเบราว์เซอร์ใด ๆ บนระบบปฏิบัติการ Windows 10, 8 หรือ 7 </h2> <p> วิธีที่เชื่อถือได้มากที่สุดในการบล็อกเว็บไซต์บนเบราว์เซอร์ใดๆ บนพีซี Windows คือการใช้ไฟล์ &quot;โฮสต์&quot; <strong> เจ้าภาพ </strong> file เป็นไฟล์ระบบปฏิบัติการที่จับคู่ชื่อโฮสต์ (ชื่อโดเมน) กับที่อยู่ IP พูดง่ายๆ ก็คือ เมื่อคุณพิมพ์ที่อยู่ของเว็บไซต์ในเบราว์เซอร์ของคุณ คอมพิวเตอร์จะดูที่ที่อยู่ในท้องถิ่นก่อน <strong> เจ้าภาพ </strong> ไฟล์เพื่อแก้ไขที่อยู่ IP หากชื่อไซต์ไม่ปรากฏในไฟล์โฮสต์ แสดงว่ากำลังพยายามค้นหาที่อยู่ IP จากบริการ DNS ที่คุณใช้บนอุปกรณ์ของคุณ </p> <p> วิธีบล็อก YouTube บนเว็บเบราว์เซอร์ (เช่น Chrome, Firefox, Edge ฯลฯ) บน Windows ผ่านไฟล์โฮสต์: </p> <p> 1. เปิด <strong> แผ่นจดบันทึก </strong> ใบสมัคร <strong> เป็นผู้ดูแลระบบ </strong> . ในการทำเช่นนั้น: </p> <blockquote><p> ก. พิมพ์ <strong> แผ่นจดบันทึก </strong> ในช่องค้นหา </p> <p> ข. <strong> คลิกขวา </strong> บน <strong> แผ่นจดบันทึก </strong> และเลือก <strong> เรียกใช้ในฐานะผู้ดูแลระบบ </strong> . </p> <p><img src=\"images/image_thumb-584.png\" alt=\"run notepad as administrator\" loading=\"lazy\"></p></blockquote> <p> </p> <p> 2. จาก <strong> ไฟล์ </strong> เมนู เลือก <strong> เปิด. <br> </strong> 3. นำทางไปยังตำแหน่งนี้บนดิสก์ของคุณ: </p> <ul> <li> C:\\Windows\\System32\\drivers\\etc </li> </ul> <p> 4. เปลี่ยน &quot;ประเภทไฟล์&quot; เป็น <strong> เอกสารทั้งหมด </strong> แล้วเปิด <strong> เจ้าภาพ </strong> ไฟล์ </p> <p><img src=\"images/image_thumb-1-968.png\" alt=\"block sites hosts file\" loading=\"lazy\"></p> <p> </p> <p> 5. ในตอนท้ายให้เพิ่มบรรทัดต่อไปนี้:* </p> <ul> <li> 127.0.0.1    youtube.com </li> <li> 127.0.0.1    www.youtube.com </li> <li> 127.0.0.1    m.youtube.com </li> </ul> <p> * หมายเหตุ: กด TAB หลังจากพิมพ์ 127.0.0.1 </p> <p><img src=\"images/image_thumb-2-460.png\" alt=\"block youtube hosts\" loading=\"lazy\"></p> <p> </p> <p> 6. เมื่อเสร็จแล้วให้คลิก <strong> ไฟล์ </strong> &gt; <strong> บันทึก </strong> และปิดแผ่นจดบันทึก </p> <p> 7. สุดท้ายเปิดเบราว์เซอร์ของคุณและลองไปที่ YouTube โดยปกติ คุณควรได้รับข้อความ: &quot;เชื่อมต่อกับอินเทอร์เน็ต คุณออฟไลน์ ตรวจสอบการเชื่อมต่อของคุณ&quot; </p> <p><img src=\"images/image_thumb-3-490.png\" alt=\"block youtube.com hosts\" loading=\"lazy\"></p> <p> </p> <p> 8. คุณทำเสร็จแล้ว หากคุณต้องการปลดบล็อก YouTube ในอนาคต เพียงทำตามขั้นตอนเดียวกัน แต่คราวนี้ให้ลบสาม (3) บรรทัดที่เพิ่มในไฟล์โฮสต์หรือพิมพ์สัญลักษณ์ <strong> # </strong> หน้าแต่ละบรรทัดที่เพิ่ม </p> <p> นั่นคือทั้งหมดที่! โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}