{"title":"วิธีเปิด PowerShell ในฐานะผู้ดูแลระบบที่โฟลเดอร์ปัจจุบันใน File Explorer (Windows 10)","content":"<p> หากคุณต้องการเปิด PowerShell หรือ PowerShell ในฐานะผู้ดูแลระบบ ณ ตำแหน่ง/โฟลเดอร์ใดๆ ใน File Explorer ให้อ่านบทแนะนำนี้ต่อ ตามที่คุณทราบวิธีปกติในการเปิด PowerShell ใน Windows 10 คือการค้นหาโดยใช้การค้นหา Cortana หรือ (เร็วกว่า) เพื่อกดปุ่ม <strong> ชนะ <img src=\"images/image_thumb8_thumb_thumb-479.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"></strong> + <strong> X </strong> คีย์เพื่อเปิด &quot;เมนู Power User&quot; และเรียกใช้ Windows PowerShell จากที่นั่น </p> <p><img src=\"images/image_thumb-54-350.png\" alt=\"PoweShell Admin (Win + X menu)\" loading=\"lazy\"></p> <p> </p> <p> แม้ว่าวิธีการเหล่านี้จะมีประโยชน์ แต่บางครั้งก็จำเป็นต้องเปิด PowerShell ในตำแหน่ง/โฟลเดอร์เฉพาะ โดยทำตามคำแนะนำด้านล่าง </p> <h4> วิธีเปิด Windows PowerShell ในตำแหน่งเฉพาะใน Windows 10 </h4> <p> 1. ไปที่โฟลเดอร์ที่คุณต้องการเปิด PowerShell <br> 2. <strong> กดค้างไว้ </strong> <strong> SHIFT </strong> กุญแจและ <strong> คลิกขวา </strong> ที่ใดก็ได้ภายในโฟลเดอร์ <br> 3. จากเมนูคลิกขวา เลือก <strong> เปิดหน้าต่าง PowerShell ที่นี่ </strong> ถึง <strong> </strong> เปิดหน้าต่าง PowerShell ใหม่ในโฟลเดอร์นั้น </p> <p> </p> <p><img src=\"images/image_thumb-55-793.png\" alt=\"Open PoweShell at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p> 4. หากคุณต้องการเปิด &#39;PowerShell As Admin&#39; ในโฟลเดอร์ใดๆ ให้คลิกที่ <strong> ไฟล์ </strong> เมนูและเลือก <strong> เปิด Windows PowerShell ในฐานะผู้ดูแลระบบ </strong> . * </p> <p> * หมายเหตุ: ดังที่คุณเห็นจากเมนู &#39;ไฟล์&#39; คุณยังสามารถเปิดหน้าต่าง PowerShell ที่ &quot;ธรรมดา&quot; ได้อีกด้วย </p> <p><img src=\"images/image_thumb-56-830.png\" alt=\"Open PoweShell As Administrator at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p><strong> ความช่วยเหลือเพิ่มเติม: </strong> หากคุณเป็นแฟนตัวยงของแป้นพิมพ์ลัด วิธีอื่นในการเปิด PowerShell (ผู้ดูแลระบบ) คือการกดปุ่ม <strong> Alt </strong> + <strong> F </strong> + <strong> ส </strong> + <strong> อา </strong> คีย์ตามลำดับ </p> <p> นั่นคือทั้งหมดที่! มันทำงานให้คุณหรือไม่? โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}