{"title":"วิธีป้องกันรหัสผ่านโฟลเดอร์ใน Windows 10 (ล็อคโฟลเดอร์ด้วยรหัสผ่าน)","content":"<p> บทช่วยสอนนี้ประกอบด้วยวิธีการฟรีและปลอดภัยสองวิธีในการป้องกันรหัสผ่านโฟลเดอร์ในระบบปฏิบัติการ Windows 10/8/7 หากคุณล็อกโฟลเดอร์ด้วยรหัสผ่าน บุคคลอื่นจะไม่สามารถเข้าถึงโฟลเดอร์นั้นได้ การปกป้องโฟลเดอร์ด้วยรหัสผ่านจะมีประโยชน์ในกรณีที่คุณแชร์คอมพิวเตอร์กับผู้อื่น และคุณไม่ต้องการให้คนอื่นเข้าถึงและอ่านไฟล์ส่วนตัวของคุณ </p> <ul> <li><strong> บทความที่เกี่ยวข้อง: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีใส่รหัสผ่านป้องกันพีซี Windows 10 ของคุณด้วย BitLocker </a> . </strong></li> </ul> <h4> วิธีล็อคโฟลเดอร์ด้วยรหัสผ่านใน Windows 10 </h4> <h6> วิธีที่ 1. วิธีล็อคและเข้ารหัสไฟล์ด้วย 7-zip (Windows ทุกรุ่น) </h6> <p> วิธีที่ง่ายและปลอดภัยที่สุดในการปกป้องโฟลเดอร์ด้วยรหัสผ่านใน Windows คือการใช้ยูทิลิตี้ 7-Zip archiver ที่รองรับการเข้ารหัสด้วย ในการเข้ารหัสและป้องกันด้วยรหัสผ่านโฟลเดอร์/ไฟล์ด้วย 7-zip: </p> <p> 1. ดาวน์โหลดและติดตั้ง <a href=\"https://www.7-zip.org/\" target=\"_blank\" rel=\"nofollow noopener\"> 7-Zip </a> โปรแกรมเก็บถาวร <br> 2. คลิกขวาที่โฟลเดอร์ (หรือไฟล์) ที่คุณต้องการป้องกันด้วยรหัสผ่านและเลือก: <strong> 7-Zip </strong> &gt; <strong> เพิ่มในที่เก็บถาวร </strong> . </p> <p><img src=\"images/image_thumb-28-978.png\" alt=\"How to Password Protect a Folder\" loading=\"lazy\"></p> <p> </p> <p> 3. ที่ตัวเลือก &quot;เพิ่มในไฟล์เก็บถาวร&quot; ให้ระบุรหัสผ่านที่คาดเดายากแล้วคลิก <strong> ตกลง </strong> . </p> <p><img src=\"images/image_thumb-29-728.png\" alt=\"set password to archive with 7-zip\" loading=\"lazy\"></p> <p> </p> <p> 4. จากนั้นลบโฟลเดอร์ที่ไม่บีบอัด (หรือไฟล์) และทำเสร็จแล้ว! </p> <h6> วิธีที่ 2. วิธีเข้ารหัสโฟลเดอร์ด้วย EFS Protection (Windows Pro &amp; Enterprise) </h6> <p> EFS Protection เป็นเครื่องมือเข้ารหัสในตัวใน Windows 10 รุ่น Professional และ Enterprise หากคุณปกป้องโฟลเดอร์หรือไฟล์ที่มีการเข้ารหัส EFS ผู้อื่นจะเข้าถึงไฟล์ที่เข้ารหัสได้ยากมาก โดยไม่ต้องมีคีย์ถอดรหัส </p> <p> ข้อเสียเพียงอย่างเดียวของการเข้ารหัส EFS คือการเข้ารหัสจะถูกลบออกหากคุณคัดลอกไฟล์ที่เข้ารหัสบนคอมพิวเตอร์เครือข่ายอื่นหรือหากคุณส่งอีเมลไฟล์ที่เข้ารหัส </p> <p> นอกจากนี้ เมื่อคุณเข้ารหัสไฟล์ EFS ของคุณ คีย์ถอดรหัส (ใบรับรอง) จะถูกจัดเก็บไว้ในคอมพิวเตอร์ของคุณ ซึ่งหมายความว่าทุกคนที่มีรหัสผ่านของคุณจะสามารถเข้าถึงไฟล์ที่เข้ารหัสของคุณได้ ด้วยเหตุผลดังกล่าว หากคุณเข้ารหัสไฟล์ของคุณด้วยการเข้ารหัส EFS ให้ระบุรหัสผ่านสำหรับเข้าสู่ระบบที่รัดกุมและอย่าแชร์กับผู้อื่น </p> <ul> <li><strong> บทความที่เกี่ยวข้อง: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีถอดรหัสไฟล์ที่เข้ารหัส EFS และลบการเข้ารหัส EFS </a></strong></li> </ul> <p><strong> ในการเข้ารหัสโฟลเดอร์หรือไฟล์ด้วย EFS: </strong><br> 1. คลิกขวาที่โฟลเดอร์ (หรือไฟล์) ที่คุณต้องการป้องกันและเลือก <strong> คุณสมบัติ </strong> . <br> 2. ที่แท็บทั่วไป คลิก, <strong> ขั้นสูง </strong> . </p> <p><img src=\"images/image_thumb-13-582.png\" alt=\"enable efs protection\" loading=\"lazy\"></p> <p> </p> <p> 3. เลือก <strong> เข้ารหัสไฟล์เพื่อรักษาความปลอดภัยข้อมูล </strong> แล้วคลิก <strong> ตกลง. </strong></p> <p><img src=\"images/image_thumb-14-983.png\" alt=\"How to Lock Folder with Password - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. จากนั้นคลิก <strong> สมัคร </strong> และ <strong> ตกลง </strong> อีกครั้งเพื่อบันทึกการเปลี่ยนแปลงและออก <br> 5. ณ จุดนี้ Windows จะแจ้งให้คุณสำรองข้อมูลคีย์การกู้คืน คลิก <strong> สำรองคีย์การเข้ารหัสไฟล์ของคุณ </strong></p> <p><img src=\"images/image_thumb-2-823.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. จากนั้นคลิก <strong> สำรองข้อมูลเลย (แนะนำ) </strong> และบันทึกคีย์ใบรับรองการถอดรหัสลงในไดรฟ์ USB </p> <p><img src=\"images/image_thumb-15-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. ที่ตัวช่วยสร้างการส่งออกใบรับรอง ให้คลิก <strong> ต่อไป </strong> ที่หน้าจอต้อนรับ <br> 8. จากนั้นคลิก <strong> ต่อไป </strong> อีกครั้งที่หน้าจอส่งออกรูปแบบไฟล์ </p> <p><img src=\"images/image_thumb-4-842.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. ที่ตัวเลือกความปลอดภัย: </p> <blockquote> <p> 1. <strong> ตรวจสอบ </strong> <strong> รหัสผ่าน </strong> กล่อง. <br> 2. พิมพ์รหัสผ่านสำหรับคีย์ใบรับรองที่ส่งออก <br> 3. เลือก <strong> AES256-SHA256 </strong> การเข้ารหัส <br> 4. คลิก <strong> ต่อไป </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-16-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. คลิก <strong> เรียกดู </strong> และ <strong> บันทึก </strong> ไฟล์ใบรับรอง (.pfx) บนคอมพิวเตอร์ของคุณ <br> 11. เมื่อเสร็จแล้ว คลิก <strong> ต่อไป </strong> เพื่อจะดำเนินการต่อ. </p> <p><img src=\"images/image_thumb-17-804.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. สุดท้าย click <strong> เสร็จสิ้น </strong> . </p> <p><img src=\"images/image_thumb-18-449.png\" alt=\"image\" loading=\"lazy\"></p> <p> 13. เมื่อการส่งออกเสร็จสิ้น ให้บันทึกคีย์ใบรับรองที่ส่งออก (ไฟล์ .pfx) ไปยังตำแหน่งที่ปลอดภัยอื่น (เช่น ไปยังดิสก์ USB) </p> <p><strong> เคล็ดลับ: </strong> เมื่อคุณเข้ารหัสโฟลเดอร์ (หรือไฟล์) ด้วย EFS คีย์ถอดรหัส (ใบรับรอง) จะถูกเก็บไว้ในโฟลเดอร์โปรไฟล์ผู้ใช้ของคุณ ดังนั้น หากผู้ใช้รายอื่นมีรหัสผ่านสำหรับเข้าสู่ระบบ Windows ของคุณ ก็สามารถเปิดและอ่านไฟล์ที่เข้ารหัสได้ เพื่อหลีกเลี่ยงไม่ให้สิ่งนี้เกิดขึ้น อย่าเปิดเผยรหัสผ่านเข้าสู่ระบบของคุณ หรือลบ (ถอนการติดตั้ง) ใบรับรองการถอดรหัสออกจากโปรไฟล์ของคุณเมื่อคุณออกจากพีซีและติดตั้งใหม่เมื่อคุณกลับมา * </p> <p> * หมายเหตุ: หากต้องการลบและนำเข้าคีย์การกู้คืน (ใบรับรอง) อีกครั้ง ให้ไปที่: </p> <blockquote> <p> ก. <strong> แผงควบคุม </strong> &gt; <strong> ตัวเลือกอินเทอร์เน็ต. <br> </strong> ข. ที่ &#39;ตัวเลือกอินเทอร์เน็ต&#39; คลิก <strong> เนื้อหา </strong> แท็บแล้วคลิก <strong> ใบรับรอง </strong> ส. <br> ค. ที่แท็บ &#39;ส่วนตัว&#39; คลิก <strong> ลบ </strong> เพื่อลบคีย์ถอดรหัส (ใบรับรอง) หรือคลิกปุ่ม <strong> นำเข้า </strong> เพื่อติดตั้งใบรับรองการถอดรหัสจากไดรฟ์ USB อีกครั้ง </p> </blockquote> <ul> <li> <p><strong> บทความที่เกี่ยวข้อง: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"noopener noreferrer\"> วิธีถอดรหัสไฟล์ที่เข้ารหัส EFS และลบการเข้ารหัส EFS </a></strong></p> </li> </ul> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}