{"title":"วิธีลบการป้องกัน BitLocker ออกจากไดรฟ์ระบบ C: โดยไม่ต้องใช้คีย์การกู้คืน BitLocker หรือรหัสผ่าน","content":"<p> บทความนี้ประกอบด้วยคำแนะนำทีละขั้นตอนเกี่ยวกับวิธีการลบ BitLocker Protection บนไดรฟ์ระบบ C: เพื่อให้สามารถล้างการติดตั้ง Windows 10 บนคอมพิวเตอร์ที่มีการป้องกันด้วย BitLocker หากคุณไม่มีคีย์การกู้คืน BitLocker หรือรหัสผ่าน BitLocker หรือ หากคุณไม่สามารถปลดล็อกไดรฟ์ BitLocker ได้ไม่ว่าด้วยเหตุผลใดก็ตาม </p> <p><img src=\"images/image_thumb-51-648.png\" alt=\"Fix Refresh your PC error: Drive where windows is installed is locked\" loading=\"lazy\"></p> <p> </p> <p> เมื่ออุปกรณ์ Windows 10 (แล็ปท็อปหรือพีซี) ได้รับการปกป้องด้วย BitLocker วิธีเดียวที่จะเข้าถึงเนื้อหาหรือรีเซ็ตอุปกรณ์ (โดยใช้คุณสมบัติ &quot;รีเซ็ตพีซีเครื่องนี้&quot; &quot;รีเฟรชพีซีของคุณ&quot;) หรือติดตั้งใหม่ Windows คือการปลดล็อกระบบปฏิบัติการไดรฟ์ C: โดยใช้ BitLocker Recovery Key หรือรหัสผ่าน BitLocker </p> <p> หากคุณไม่มีคีย์การกู้คืน BitLocker หรือรหัสผ่าน BitLocker เพื่อปลดล็อกไดรฟ์ระบบ C: หรือไม่ยอมรับคีย์ BitLocker ตัวเลือกเดียวที่คุณเหลือ (ขออภัย) คือการลบไดรฟ์ทั้งหมดและดำเนินการ ล้างการติดตั้ง Windows </p> <p> ในบทช่วยสอนนี้ คุณจะพบคำแนะนำในการแก้ไขปัญหาต่อไปนี้เมื่อพยายามติดตั้ง Windows 10 หรือรีเซ็ตอุปกรณ์ Windows 10 ที่สถานะเริ่มต้นจากโรงงาน: &quot;ไดรฟ์ที่ติดตั้ง Windows ถูกล็อก ปลดล็อกไดรฟ์แล้วลองอีกครั้ง &quot;. </p> <h4> วิธีทำความสะอาด ติดตั้ง Windows 10 บนคอมพิวเตอร์ที่มีการป้องกันด้วย BitLocker (แก้ไข: ไม่สามารถติดตั้ง/รีเฟรช Windows 10 - ไดรฟ์ถูกล็อคด้วย BitLocker) </h4> <p><strong> ข้อกำหนด: </strong> <strong> สื่อการติดตั้ง Windows 10 (USB หรือ DVD) </strong><br> หากคุณไม่ได้เป็นเจ้าของ Windows Installation Media คุณสามารถสร้างได้โดยใช้ <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> เครื่องมือสร้างสื่อของ Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีสร้างสื่อการติดตั้ง Windows 10 USB </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีสร้างสื่อการติดตั้งดีวีดี Windows 10 </a></li> </ul> <p> ในการติดตั้ง Windows 10 ใหม่ทั้งหมด บนคอมพิวเตอร์/ไดรฟ์ที่มีการป้องกันด้วย BitLocker ให้ทำตามคำแนะนำด้านล่าง: * </p> <p><strong> * ข้อควรระวัง: ขั้นตอนด้านล่างจะลบข้อมูลที่จัดเก็บไว้ในไดรฟ์ที่ล็อกทั้งหมด ดำเนินการเฉพาะเมื่อคุณ <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> ไม่สามารถปลดล็อกไดรฟ์/คอมพิวเตอร์ที่มีการป้องกัน BITLOCKER </a></strong></p> <p> 1. บูตระบบของคุณจากสื่อการติดตั้ง Windows 10 * </p> <p> * บันทึก: <strong> </strong> เพื่อให้สามารถบูตจาก Windows Media (USB หรือ DVD) ได้ ให้ทำตามขั้นตอนด้านล่าง: </p> <ul> <li><strong> วิธีที่ 1: </strong> หลังจากเปิดเครื่อง ให้กดปุ่มฟังก์ชันที่เกี่ยวข้อง (โดยทั่วไปคือปุ่ม &quot;F12&quot; หรือ &quot;F8&quot;) เพื่อดูตัวเลือก &quot;ลำดับการบู๊ต&quot; หรือ &quot;เมนูการบู๊ต&quot; จากนั้นเลือกอุปกรณ์ USB (หรือ DVD) ที่มีสื่อการติดตั้ง Windows (ไฟล์) แล้วกด Enter </li> <li><strong> วิธีที่ 2: </strong> เข้าสู่ BIOS Setup (การตั้งค่า) และตั้งค่า Windows Installation Media เป็น &quot;First Boot Device&quot; ที่เมนู &quot;Boot Order&quot; แล้ว <strong> บันทึกและออก </strong> จากการตั้งค่าไบออส </li> </ul> <p> 2. ที่หน้าจอด้านล่าง ให้กด <strong> SHIFT </strong> + <strong> F10 </strong> ปุ่มเพื่อเปิดพรอมต์คำสั่ง (หรือกด <strong> ต่อไป </strong> &gt; <strong> ซ่อมคอมพิวเตอร์ของฉัน </strong> &gt; <strong> แก้ไขปัญหา </strong> &gt; <strong> พร้อมรับคำสั่ง </strong> ). * </p> <p> * หมายเหตุ: หากคุณได้รับแจ้งให้ป้อนคีย์การกู้คืน ให้คลิก <strong> ข้ามไดรฟ์นี้ </strong> . </p> <p><img src=\"images/image_thumb15_thumb-290.png\" alt=\"How to Remove Updates from the Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. ในพรอมต์คำสั่งให้คำสั่งต่อไปนี้ตามลำดับ: </p> <ul> <li><strong> ดิสก์พาร์ท </strong></li> <li><strong> รายการดิสก์ </strong></li> <li><strong> เลือกดิสก์ 0 </strong></li> <li><strong> ปริมาณรายการ </strong></li> </ul> <p> 4. ตอนนี้ค้นหาว่าไดรฟ์ข้อมูลใดที่มีขนาดที่ใหญ่กว่าในหน่วย GB โดยทั่วไปแล้ว ปริมาณที่มากขึ้นคือตำแหน่งที่ติดตั้ง Windows (ไดรฟ์ที่ล็อกไว้) * </p> <p> * เช่น. ที่ภาพหน้าจอด้านล่าง &quot;เล่มที่ 2&quot; มีขนาดใหญ่กว่า </p> <p> </p> <p><img src=\"images/image_thumb-10-992.png\" alt=\"fix drive is locked Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. จากนั้นเลือกปริมาณที่มากขึ้นโดยพิมพ์คำสั่งนี้: * </p> <ul> <li><strong> เลือกจำนวนเสียง </strong></li> </ul> <p> * หมายเหตุ: เปลี่ยนหมายเลขระดับเสียงตามคำสั่งด้านบนตามกรณีของคุณ (เช่น &quot;select volume 2&quot;) </p> <p> 5. สุดท้ายลบโวลุ่มที่เลือกโดยให้คำสั่งนี้: </p> <p> </p> <ul> <li><strong> ลบการแทนที่ระดับเสียง </strong></li> </ul> <p><img src=\"images/image_thumb-14-714.png\" alt=\"delete volume override\" loading=\"lazy\"></p> <p> </p> <p> 6. พิมพ์ <strong> ทางออก </strong> เพื่อปิดเครื่องมือ DISKPART แล้วปิดพรอมต์คำสั่ง <br> 7. ปิดแล้วเปิดอุปกรณ์ของคุณอีกครั้ง <br> 8. บูตจากสื่อการติดตั้ง Windows <br> 9. คลิก <strong> ต่อไป </strong> แล้วก็ <strong> ติดตั้งในขณะนี้ </strong> . <br> 10. เลือก &quot;ฉันไม่มีรหัสผลิตภัณฑ์&quot; แล้วยอมรับข้อตกลงใบอนุญาต <br> 11. เลือก &quot;ติดตั้งแบบกำหนดเอง&quot; จากนั้นลบพาร์ติชั่น/โวลุ่มที่เหลือทั้งหมดบนดิสก์ </p> <p><img src=\"images/image_thumb-12-362.png\" alt=\"cannot reset windows 10 drive locked with bitlocker\" loading=\"lazy\"></p> <p> </p> <p> 12. เมื่อเสร็จแล้ว เลือก &quot;พื้นที่ที่ไม่ได้ถูกจัดสรร&quot; แล้วคลิก <strong> ต่อไป. <br> </strong> 13. ปฏิบัติตามคำแนะนำบนหน้าจอเพื่อ <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> ล้างการติดตั้ง Windows 10 </a> . </p> <p> </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแบ่งปันโพสต์บล็อกนี้ในเครือข่ายสังคมออนไลน์เพื่อช่วยกระจายคำเกี่ยวกับปัญหานี้ </p>"}