{"title":"วิธีการ: ลบประวัติอินเทอร์เน็ต รหัสผ่าน และคุกกี้จากเว็บเบราว์เซอร์ของคุณ (Chrome, Firefox, IE)","content":"<p> เมื่อคุณเยี่ยมชมเว็บไซต์ด้วยเว็บเบราว์เซอร์ของคุณ เว็บไซต์จะส่งข้อมูลบางอย่างไปยังเบราว์เซอร์และเบราว์เซอร์จะเก็บข้อมูลนั้นไว้ในไฟล์ข้อความขนาดเล็กที่เรียกว่า <strong> คุกกี้ </strong> ส. คุกกี้จะเก็บค่ากำหนดของผู้ใช้ไว้กับเว็บไซต์นั้น เช่น ข้อมูลการเข้าสู่ระบบ เพื่อให้ผู้ใช้ไม่ต้องป้อนรายละเอียดการเข้าสู่ระบบอีกครั้ง (ชื่อผู้ใช้และ/หรือรหัสผ่าน) เมื่อกลับมายังเว็บไซต์เดิม คุกกี้ยังสามารถเก็บประวัติว่าหน้าใดของเว็บไซต์ที่ผู้ใช้เข้าชม ดังนั้นผู้ใช้จึงไม่ต้องจำหน้าเหล่านั้น หรือนำทางผ่านหน้าทั้งหมดของเว็บไซต์ จนกว่าเขาจะพบสิ่งที่ต้องการ </p> <p> ในเวลาเดียวกัน เมื่อคุณเยี่ยมชมเว็บไซต์ เบราว์เซอร์จะจัดเก็บสำเนาของหน้าเว็บทั้งหมดที่คุณเยี่ยมชมในเครื่อง เพื่อประหยัดแบนด์วิดท์การเชื่อมต่อและเพื่อลดเวลาในการโหลดของหน้าเว็บในครั้งต่อไปที่คุณเยี่ยมชม &#39;สำเนาของหน้าเว็บในเครื่อง&#39; นี้เรียกว่า &quot; <strong> ไฟล์อินเตอร์เน็ตชั่วคราว </strong> &quot;ของ <strong> แคช </strong> . </p> <p> คุกกี้และแคช หลังจากผ่านไประยะหนึ่งอาจมีพื้นที่ดิสก์จำนวนมากและจำเป็นต้องล้างข้อมูลเหล่านี้ ในกรณีอื่นๆ คุณอาจต้องลบแคชและคุกกี้ของเบราว์เซอร์เพื่อโหลดเนื้อหาของเว็บไซต์ซ้ำทั้งหมด หากคุณไม่ต้องการ บุคคลที่สามเพื่อค้นหาว่าหน้าเว็บใดที่คุณเยี่ยมชม (aka: &quot; <strong> ประวัติการค้นหา </strong> &quot;) หรือรายละเอียดการเข้าสู่ระบบของคุณไปยังเว็บไซต์ (เช่น GMAIL) </p> <p> ในบทช่วยสอนนี้ คุณจะพบวิธีง่ายๆ สอง (2) วิธีในการลบประวัติการท่องเว็บ ไฟล์อินเทอร์เน็ตชั่วคราว (แคช) และคุกกี้จาก Internet Explorer, Chrome และ Firefox </p> <h4> วิธีล้างประวัติการท่องเว็บ รหัสผ่านที่บันทึกไว้และคุกกี้ใน Chrome, Firefox และ Internet Explorer </h4> <h5><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีที่ 1. ล้างข้อมูลการท่องเว็บจากเบราว์เซอร์เฉพาะ </a></h5> <h5><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีที่ 2. ลบข้อมูลการท่องเว็บจากเว็บเบราว์เซอร์ทั้งหมดด้วยคลิกเดียว! </a></h5> <p> </p> <h5> วิธีที่ 1. ลบประวัติ แคช และคุกกี้จากเบราว์เซอร์เฉพาะ </h5> <p> โดยทั่วไป เว็บเบราว์เซอร์แต่ละตัวมีตัวเลือกในการลบข้อมูลการท่องเว็บที่เก็บไว้ผ่านเมนูการตั้งค่า / ตัวเลือก แต่ถ้าคุณต้องการเข้าถึงตัวเลือกนั้นอย่างง่ายดาย (โดยไม่ต้องเลื่อนเมาส์ผ่านเมนูของเบราว์เซอร์) ให้กด <strong> Ctrl </strong> + <strong> กะ </strong> + <strong> ลบ </strong> คีย์ร่วมกันบนหน้าต่างเบราว์เซอร์ที่เปิดอยู่ ดังนั้น… </p> <p><strong> ในการลบประวัติการเรียกดู แคช และคุกกี้จาก Internet Explorer: </strong></p> <p> 1. เปิด Internet Explorer แล้วกด <strong> Ctrl </strong> + <strong> กะ </strong> + <strong> ลบ. <br> </strong> 2. เลือกประเภทข้อมูลที่คุณต้องการลบและคลิก <strong> ลบ </strong> ปุ่ม. </p> <p><img src=\"images/image_thumb-18-750.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> ในการลบประวัติการท่องเว็บ แคช และคุกกี้จาก Chrome: </strong></p> <p> 1. เปิด Chrome แล้วกด <strong> Ctrl </strong> + <strong> กะ </strong> + <strong> ลบ. <br> </strong> 2. เลือกประเภทข้อมูลที่ต้องการล้าง จากนั้นกด <strong> ข้อมูลชัดเจน </strong> . </p> <p><img src=\"images/image_thumb-19-667.png\" alt=\"clear chrome history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p><strong> ในการลบประวัติการเรียกดู แคช และคุกกี้จาก Firefox: </strong></p> <p> 1. เปิด Firefox แล้วกด .พร้อมกัน <strong> Ctrl </strong> + <strong> กะ </strong> + <strong> ลบ. <br> </strong> 2. เลือกข้อมูลที่คุณต้องการลบออกจาก Firefox แล้วคลิก <strong> เคลียร์เลย </strong></p> <p> </p> <p><img src=\"images/image_thumb-20-864.png\" alt=\"clear firefox history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> วิธีที่ 2. ลบประวัติเบราว์เซอร์ แคช และคุกกี้จากเว็บเบราว์เซอร์ทั้งหมดพร้อมกัน </h5> <p> หากคุณต้องการทำให้ชีวิตของคุณง่ายขึ้น คุณสามารถใช้ <a href=\"https://www.ccleaner.com/\" target=\"_blank\" rel=\"nofollow noopener\"> CCleaner </a> ยูทิลิตีเพื่อลบไฟล์อินเทอร์เน็ตชั่วคราว ประวัติและคุกกี้จากเว็บเบราว์เซอร์ทั้งหมดที่คุณใช้ได้อย่างง่ายดายเพียงคลิกเดียว </p> <p> 1. <a href=\"https://www.ccleaner.com/ccleaner/download\" target=\"_blank\" rel=\"nofollow noopener\"> ดาวน์โหลด </a> และติดตั้งยูทิลิตี้ CCleaner เวอร์ชันฟรี </p> <p> 2. เปิดตัว <strong> CCleaner </strong> และนำทางไปยัง <strong> Windows </strong> และ <strong> แอปพลิเคชั่น </strong> ตัวเลือกแท็บ เพื่อเลือกข้อมูลที่คุณต้องการลบออกจากเว็บเบราว์เซอร์ </p> <p> 3. เมื่อเสร็จแล้วคลิก <strong> Run Cleaner </strong> . </p> <p><img src=\"images/image_thumb-21-173.png\" alt=\"clear internet history cache cookies - ccleaner\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? </p> <p> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}