{"title":"วิธีแชร์ไฟล์และโฟลเดอร์ในระบบปฏิบัติการ Windows 10, 8.1 หรือ 7","content":"<p> คุณสมบัติการแชร์ไฟล์ใน Windows ช่วยให้คุณสามารถแชร์โฟลเดอร์และไฟล์ระหว่างผู้ใช้ในเครือข่ายของคุณ ด้วยการแบ่งปันไฟล์ของคุณกับผู้ใช้รายอื่นในเครือข่ายเดียวกัน คุณจะสามารถดูและทำงานกับไฟล์/โฟลเดอร์เดียวกันได้ </p> <p> บทช่วยสอนนี้มีคำแนะนำเกี่ยวกับวิธีการแชร์โฟลเดอร์และ/หรือไฟล์ในระบบปฏิบัติการ Windows 10, 8, 8.1 หรือ 7 </p> <h4> วิธีเปิดใช้งานการแชร์ไฟล์ใน Windows </h4> <h5> ขั้นตอนที่ 1 เพิ่มผู้ใช้ที่จำเป็นลงในพีซีของคุณ </h5> <p> ก่อนที่คุณจะแชร์ไฟล์กับผู้อื่นต่อไป ให้เพิ่มผู้ใช้ที่จะสามารถเข้าถึงโฟลเดอร์ที่ใช้ร่วมกันบนคอมพิวเตอร์ได้ ในการดำเนินการดังกล่าว ให้ทำตามคำแนะนำในบทความต่อไปนี้ ตามเวอร์ชัน Windows ของคุณ </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-create-a-new-user-in-windows-7\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีเพิ่มผู้ใช้ใหม่ใน Windows 7 </a></li> <li><a href=\"https://www.repairwin.com/how-to-add-a-new-user-account-in-windows-10-8/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีเพิ่มผู้ใช้ใหม่ใน Windows 10/8.1 </a></li> </ul> <p> </p> <h5> ขั้นตอนที่ 2 วิธีแชร์โฟลเดอร์หรือไฟล์กับผู้อื่น </h5> <p> 1. คลิกขวาที่โฟลเดอร์ (หรือไฟล์) ที่คุณต้องการแชร์และเลือก <strong> ให้การเข้าถึง access </strong> -&gt; <strong> คนเฉพาะ. </strong></p> <p><img src=\"images/image_thumb-56-411.png\" alt=\"How to Share Files and Folders in Windows 10, 8.1, 7\" loading=\"lazy\"></p> <p> </p> <p> 2. โดยใช้เมนูแบบเลื่อนลง ให้เลือกผู้ใช้ที่คุณต้องการแชร์ไฟล์ด้วย แล้วคลิก <strong> เพิ่ม </strong> . </p> <p><img src=\"images/image_thumb-57-274.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. ตอนนี้ คลิกที่ลูกศรลง ถัดจากผู้ใช้ที่คุณเพิ่ม และระบุสิทธิ์การเข้าถึง (ระดับสิทธิ์) </p> <p><img src=\"images/image_thumb-58-517.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. เมื่อเสร็จแล้วให้กด <strong> แบ่งปัน </strong> ปุ่ม, </p> <p><img src=\"images/image_thumb-59-431.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. สังเกตลิงก์ที่กำหนดไปยังโฟลเดอร์ที่แชร์* แล้วคลิก <strong> เสร็จแล้ว </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-60-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. ณ จุดนี้ คุณได้เปิดใช้งานการแชร์ไฟล์บนคอมพิวเตอร์ของคุณ ในการเข้าถึงโฟลเดอร์ที่ใช้ร่วมกันจากพีซีเครื่องอื่น: </p> <blockquote><p> ก. ที่แถบที่อยู่ของ Explorer ให้พิมพ์ลิงก์ไปยังโฟลเดอร์ที่ใช้ร่วมกัน ดังที่แสดงในขั้นตอนก่อนหน้า (เช่น.&quot;\\\\DESKTOP-HMG31RD\\2Share&quot; โดยไม่ใส่เครื่องหมายอัญประกาศ) <br> ข. กด <strong> ป้อน </strong> . <br> ค. พิมพ์ชื่อผู้ใช้และรหัสผ่านของผู้ใช้ที่คุณให้สิทธิ์การเข้าถึงและกด <strong> ตกลง </strong> . </p></blockquote> <p><img src=\"images/image_thumb-61-512.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> ข้อมูลเพิ่มเติม: <br> 1.หากต้องการเปลี่ยนการอนุญาตของผู้ใช้ ให้ทำตามขั้นตอนด้านบนอีกครั้ง และเปลี่ยนระดับการอนุญาตของผู้ใช้ <br> 2. หากคุณต้องการหยุดการแชร์ไฟล์ ให้คลิกขวาที่โฟลเดอร์/ไฟล์ที่แชร์ แล้วไปที่ <strong> ให้การเข้าถึง access </strong> -&gt; และเลือก <strong> ลบการเข้าถึง </strong> . </p> <p><img src=\"images/image_thumb-62-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแบ่งปันโพสต์บล็อกนี้ในเครือข่ายสังคมออนไลน์เพื่อช่วยกระจายคำเกี่ยวกับปัญหานี้ </p>"}