{"title":"วิธีลบคลิกที่นี่เพื่อดูข้อมูลเพิ่มเติมเกี่ยวกับตัวเลือก MICROSOFT EXCHANGE ใน Outlook","content":"<p> หากคุณไม่ต้องการคลิกไฮเปอร์ลิงก์ &quot;คลิกที่นี่เพื่อดูเพิ่มเติมใน Exchange&quot; ทุกครั้งใน Outlook เพื่อดูอีเมลที่จัดเก็บไว้ทั้งหมดบน Exchange ให้อ่านต่อด้านล่าง ไฮเปอร์ลิงก์ &quot;คลิกที่นี่เพื่อดูเพิ่มเติมใน Exchange&quot; ใน Outlook ปรากฏขึ้นเนื่องจากโฟลเดอร์อีเมลแสดงเฉพาะรายการที่ใหม่กว่า (อีเมล) นี่เป็นลักษณะการทำงานเริ่มต้น เนื่องจากเมื่อคุณใช้ Microsoft Outlook 2019, Outlook 2016, Outlook 2013 หรือ Outlook สำหรับ Office 365 เพื่อเชื่อมต่อกับกล่องจดหมาย Exchange Server ของคุณ Outlook จะแสดงอีเมลหนึ่งฉบับจากปีที่แล้ว </p> <p><img src=\"images/image_thumb-19-421.png\" alt=\"How to Remove the \" click here to view more on exchange option in outlook. loading=\"lazy\"></p> <p> </p> <p> หากต้องการลบไฮเปอร์ลิงก์ &quot;คลิกที่นี่เพื่อดูเพิ่มเติมใน Exchange&quot; ที่จะแสดง หากต้องการดูรายการอีเมลทั้งหมดของคุณ เมื่อเชื่อมต่อกับกล่องจดหมาย Exchange ให้ทำตามขั้นตอนด้านล่าง </p> <h4> วิธีบังคับให้ Outlook แสดงอีเมลทั้งหมดของคุณจากกล่องจดหมาย Exchange </h4> <p> ในการแสดงอีเมล Exchange ทั้งหมดใน Outlook: </p> <p> 1. คลิก <strong> ไฟล์ </strong> เมนูและไปที่ <strong> บัญชีผู้ใช้ </strong> &gt; <strong> การตั้งค่าบัญชี </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-1-139.png\" alt=\"How to Backup Outlook\" loading=\"lazy\"></p> <p> 2. ไฮไลท์บัญชี Exchange แล้วคลิก <strong> เปลี่ยน </strong> . </p> <p><img src=\"images/image_thumb-20-777.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. ที่การตั้งค่า &quot;ดาวน์โหลดอีเมลสำหรับอดีต&quot; ให้ลากตัวเลื่อนไปที่จุดสิ้นสุด </p> <p><img src=\"images/image_thumb-17-833.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. เมื่อเสร็จแล้ว คลิก <strong> ต่อไป </strong> และ <strong> เสร็จสิ้น </strong> แล้วปิดการตั้งค่าบัญชี </p> <p><img src=\"images/image_thumb-18-585.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> เริ่มต้นใหม่ </strong> แนวโน้ม </p> <p> นั่นคือทั้งหมดที่! โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแชร์โพสต์บล็อกนี้ในเครือข่ายโซเชียลเพื่อช่วยกระจายคำเกี่ยวกับโซลูชันนี้ </p>"}