{"title":"วิธีลบการแจ้งเตือน PROTECTED VIEW ในเอกสาร Word หรือ Excel ที่ได้รับหรือดาวน์โหลดทั้งหมด","content":"<p> &quot;มุมมองที่ได้รับการป้องกัน&quot; เป็นคุณลักษณะที่เพิ่มใน Office เวอร์ชันล่าสุด เพื่อป้องกันคอมพิวเตอร์ของคุณจากไวรัสที่อาจฝังอยู่ในไฟล์ใดๆ ที่ดาวน์โหลดจากอินเทอร์เน็ตหรือได้รับทางอีเมล แม้ว่าการแจ้งเตือน &quot;มุมมองที่ได้รับการป้องกัน&quot; จะสามารถลบออกได้อย่างง่ายดายโดยคลิก &quot;เปิดใช้งานการแก้ไข&quot; แต่ก็น่ารำคาญเมื่อคุณได้รับเอกสารจำนวนมากจากแหล่งที่เชื่อถือได้ </p> <p><img src=\"images/image_thumb-19-615.png\" alt=\"How to Remove Protected View Notification in Word-Excel\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> บทความที่เกี่ยวข้อง: </strong> <a href=\"https://www.repairwin.com/fix-file-cannot-be-previewed-in-outlook-word-experienced-an-error-when-opening-attachment/?preview=true\" target=\"_blank\" rel=\"nofollow noopener\"> การแก้ไข: ไม่สามารถแสดงตัวอย่างหรือเปิดไฟล์แนบอีเมล Word หรือ Excel ใน Office 2013, 206, 2019 หรือ 365 </a> . </li> </ul> <h4> วิธีปิดการใช้งาน Protected View Alert ใน Word หรือ Excel </h4> <p> ในการลบการแจ้งเตือน PROTECTED VIEW ใน Microsoft Word หรือ Excel เวอร์ชัน 2013, 2016, 2019 หรือ 365: </p> <p> 1. จาก <strong> ไฟล์ </strong> เมนู คลิก <strong> ตัวเลือก </strong> . <br> 2. ที่ <strong> ศูนย์ทรัสต์ </strong> ตัวเลือก เลือก <strong> การตั้งค่าศูนย์ความเชื่อถือ </strong> . </p> <p><img src=\"images/image_thumb-16-270.png\" alt=\"fix Word experienced an error trying to open the file\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> ยกเลิกการเลือก </strong> ทั้งหมด &quot; <strong> เปิดใช้งานมุมมองที่ได้รับการป้องกัน.. </strong> &quot; กล่องกาเครื่องหมายและคลิก <strong> ตกลง </strong> . </p> <p><img src=\"images/image_thumb-17-740.png\" alt=\"disable protected view option word - excel\" loading=\"lazy\"></p> <p> </p> <p> นั่นคือทั้งหมดที่! มันทำงานให้คุณหรือไม่? <br> โปรดแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดีกว่านั้น: ชอบและแบ่งปันโพสต์บล็อกนี้ในเครือข่ายสังคมออนไลน์เพื่อช่วยกระจายคำเกี่ยวกับเรื่องนี้ </p>"}