{"title":"วิธีป้องกันไม่ให้ Windows 10 ติดตั้งเครื่องพิมพ์เครือข่ายโดยอัตโนมัติ","content":"<p> ตามที่คุณอาจสังเกตเห็นแล้ว Windows 10 จะติดตั้งไดรเวอร์สำหรับเครื่องพิมพ์ที่เชื่อมต่อเครือข่ายหรืออุปกรณ์อื่นๆ โดยอัตโนมัติ แม้ว่านี่จะเป็นคุณสมบัติที่มีประโยชน์มาก แต่ก็น่ารำคาญมาก โดยเฉพาะอย่างยิ่งในสภาพแวดล้อมทางธุรกิจ ซึ่งคุณอาจไม่ต้องการให้ผู้ใช้เครือข่ายทุกคนใช้เครื่องพิมพ์ทั้งหมด </p> <p> แน่นอน หากคุณไม่ต้องการอุปกรณ์เครือข่ายและแอพของผู้ผลิต คุณสามารถลบออกจากระบบของคุณได้ แต่ Windows 10 จะติดตั้งอีกครั้งโดยอัตโนมัติ เพื่อหลีกเลี่ยงปัญหานี้ คุณต้องป้องกันไม่ให้ Windows ติดตั้งอุปกรณ์ที่เชื่อมต่อเครือข่ายโดยอัตโนมัติ (เครื่องพิมพ์ สแกนเนอร์ กล้อง ฯลฯ) รวมถึงแอปและไอคอนที่กำหนดเองจากผู้ผลิต </p> <h3> วิธีหยุด Windows 10 เพื่อติดตั้งอุปกรณ์เครือข่ายและแอพโดยอัตโนมัติ </h3> <p> 1. ไปที่ <strong> แผงควบคุม </strong> . ในการทำเช่นนั้น: </p> <blockquote><p> ก. พิมพ์ &quot;แผงควบคุม&quot; ที่ช่องค้นหาของ Windows Windows <br> ข. คลิก <strong> แผงควบคุม </strong> จากผลลัพธ์ </p></blockquote> <p><img src=\"images/image_thumb-53-862.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. ตั้งค่า <strong> ดูโดย </strong> ถึง <strong> ไอคอนขนาดเล็ก </strong> เพื่อดูรายการแผงควบคุมทั้งหมด แล้วคลิก <strong> ศูนย์เครือข่ายและการแบ่งปัน </strong></p> <p><img src=\"images/image_thumb-37-625.png\" alt=\"control panel network and sharing center\" loading=\"lazy\"></p> <p> </p> <p> 3. เลือก <strong> การตั้งค่าการแชร์ขั้นสูง </strong> ทางซ้าย <strong> . </strong></p> <p><img src=\"images/image_thumb-38-656.png\" alt=\"Prevent Windows 10 to Install Network Printers Automatically\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. ล้าง &quot; <strong> เปิดการตั้งค่าอัตโนมัติของอุปกรณ์ที่เชื่อมต่อเครือข่าย&quot; </strong> และคลิก <strong> บันทึกการเปลี่ยนแปลง. </strong></p> <p><img src=\"images/image_thumb-39-992.png\" alt=\"Turn Off automatic setup of network connected devices \" loading=\"lazy\"></p> <p> </p> <p><strong> ไม่จำเป็น: </strong> หากคุณต้องการป้องกันไม่ให้ Windows 10 ดาวน์โหลดและติดตั้งแอปของผู้ผลิตและไอคอนที่กำหนดเองโดยอัตโนมัติ สำหรับอุปกรณ์ที่เชื่อมต่อบนพีซีของคุณ ให้ทำดังนี้ </p> <blockquote><p> 1. ไปที่ <strong> แผงควบคุม </strong> -&gt; <strong> ระบบ </strong> . <br> 2. คลิก <strong> การป้องกันระบบ </strong> ทางซ้าย. <br> 3. ที่แท็บ Hardware คลิก <strong> การตั้งค่าการติดตั้งอุปกรณ์ </strong> . </p></blockquote> <p><img src=\"images/image_thumb-40-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. ที่ &#39;การตั้งค่าการติดตั้งอุปกรณ์&#39; ให้เลือก  &quot; <strong> ไม่ (อุปกรณ์ของคุณอาจไม่ทำงานตามที่คาดไว้)&quot; </strong> และคลิก <strong> บันทึกการเปลี่ยนแปลง </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-728.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> นั่นคือทั้งหมด! มันทำงานให้คุณหรือไม่? <br> กรุณาแสดงความคิดเห็นในส่วนความคิดเห็นด้านล่างหรือดียิ่งขึ้น: ชอบและแบ่งปันโพสต์บล็อกนี้ในเครือข่ายสังคมเพื่อช่วยกระจายคำเกี่ยวกับคู่มือนี้ </p>"}