{"title":"BitLocker Korumasını Sistem Sürücüsü C&#39;den Kaldırma: BitLocker Kurtarma anahtarı veya Parola olmadan.","content":"<p> Bu makale, BitLocker Recovery anahtarınız veya BitLocker parolanız veya BitLocker sürücüsünün kilidini herhangi bir nedenle açamazsanız. </p> <p><img src=\"images/image_thumb-51-648.png\" alt=\"Fix Refresh your PC error: Drive where windows is installed is locked\" loading=\"lazy\"></p> <p> </p> <p> Bir Windows 10 cihazı (dizüstü bilgisayar veya PC) BitLocker ile korunduğunda, içeriğine erişmenin veya cihazı sıfırlamanın (&quot;Bu Bilgisayarı Sıfırla&quot;, &quot;Bilgisayarınızı yenileyin&quot; özelliklerini kullanarak) veya yeniden yüklemenin tek yolu Windows, BitLocker Kurtarma Anahtarını veya BitLocker parolasını kullanarak işletim sistemi C: sürücüsünün kilidini açmaktır. </p> <p> C: sistem sürücüsünün kilidini açmak için BitLocker Recovery anahtarınız veya BitLocker parolanız yoksa veya BitLocker anahtarı kabul edilmezse, bıraktığınız tek seçenek (maalesef) sürücüyü tamamen silmek ve bir temiz Windows kurulumu. </p> <p> Bu öğreticide, Windows 10&#39;u yüklemeye çalışırken veya bir Windows 10 aygıtını fabrika varsayılan durumuna sıfırlamaya çalışırken aşağıdaki sorunun nasıl çözüleceğine ilişkin yönergeler bulacaksınız: &quot;Windows&#39;un yüklü olduğu sürücü kilitli. Sürücünün kilidini açın ve yeniden deneyin. &quot;. </p> <h4> Windows 10&#39;u BitLocker Korumalı Bir Bilgisayara Yükleme Nasıl Temizlenir (DÜZELTME: Windows 10 Yüklenemiyor/Yenilenemiyor - Sürücü BitLocker ile Kilitlendi.) </h4> <p><strong> Gereksinim: </strong> <strong> Bir Windows 10 Kurulum Ortamı (USB veya DVD). </strong><br> Bir Windows Kurulum Ortamına sahip değilseniz, kullanarak bir tane oluşturabilirsiniz. <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft&#39;un Medya Oluşturma aracı </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows 10 USB yükleme medyası nasıl oluşturulur. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows 10 DVD yükleme medyası nasıl oluşturulur. </a></li> </ul> <p> BitLocker Korumalı Bilgisayarda/Sürücüde Windows 10&#39;un temiz yüklemesini gerçekleştirmek için aşağıdaki talimatları izleyin: * </p> <p><strong> * DİKKAT: AŞAĞIDAKİ PROSEDÜR KİLİTLİ SÜRÜCÜDE DEPOLANAN TÜM VERİLERİ SİLECEKTİR. YALNIZCA DEVAM EDERSENİZ <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> BITLOCKER KORUMALI SÜRÜCÜ/BİLGİSAYARIN KİLİDİ ​​AÇILAMIYOR. </a></strong></p> <p> 1. Sisteminizi Windows 10 yükleme ortamından başlatın. * </p> <p> * Not: <strong> </strong> Windows Media&#39;dan (USB veya DVD) önyükleme yapabilmek için aşağıdaki adımları izleyin: </p> <ul> <li><strong> Yöntem 1: </strong> Güç Açıldıktan sonra, &quot;Önyükleme Sırası&quot; veya &quot;Önyükleme Menüsü&quot; seçeneklerini görüntülemek için ilgili İşlev tuşuna (genellikle &quot;F12&quot; veya &quot;F8&quot; tuşudur) basın. Ardından, Windows kurulum Ortamını (dosyaları) içeren USB (veya DVD) aygıtını seçin ve Enter&#39;a basın. </li> <li><strong> Yöntem 2: </strong> BIOS Kurulumuna (Ayarlar) girin ve Windows Kurulum Ortamını &quot;Önyükleme Sırası&quot; menüsünde &quot;İlk Önyükleme Aygıtı&quot; olarak ayarlayın. Sonra <strong> Kaydet ve çık </strong> BIOS ayarlarından. </li> </ul> <p> 2. Aşağıdaki ekranda <strong> VARDİYA </strong> + <strong> F10 </strong> komut istemini başlatmak için tuşlar. (veya basın <strong> Sonraki </strong> &gt; <strong> Bilgisayarımı Onar </strong> &gt; <strong> Sorun giderme </strong> &gt; <strong> Komut istemi </strong> ). * </p> <p> * Not: Kurtarma anahtarını istediyseniz, <strong> Bu sürücüyü ATLA </strong> . </p> <p><img src=\"images/image_thumb15_thumb-290.png\" alt=\"How to Remove Updates from the Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. Komut isteminde sırayla aşağıdaki komutları verin: </p> <ul> <li><strong> disk bölümü </strong></li> <li><strong> liste diski </strong></li> <li><strong> disk 0&#39;ı seç </strong></li> <li><strong> liste hacmi </strong></li> </ul> <p> 4. Şimdi listelenen birimlerden hangisinin GB cinsinden daha büyük olduğunu bulun. Genellikle daha büyük birim, Windows&#39;un yüklü olduğu yerdir (kilitli sürücü). * </p> <p> * Örneğin. Aşağıdaki ekran görüntüsünde &quot;Cilt 2&quot; daha büyük boyuta sahiptir. </p> <p> </p> <p><img src=\"images/image_thumb-10-992.png\" alt=\"fix drive is locked Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Ardından şu komutu yazarak daha büyük hacmi seçin: * </p> <ul> <li><strong> ses numarası seç </strong></li> </ul> <p> * Not: Yukarıdaki komutta cilt numarasını durumunuza göre değiştirin (örneğin, &quot;cilt 2&#39;yi seçin&quot;) </p> <p> 5. Son olarak şu komutu vererek seçili birimi silin: </p> <p> </p> <ul> <li><strong> birim geçersiz kılmayı sil </strong></li> </ul> <p><img src=\"images/image_thumb-14-714.png\" alt=\"delete volume override\" loading=\"lazy\"></p> <p> </p> <p> 6. Tip <strong> çıkış </strong> DISKPART aracını kapatmak ve ardından Komut İstemi&#39;ni kapatmak için. <br> 7. Cihazınızı Kapatın ve ardından tekrar AÇIN. <br> 8. Windows Kurulum Ortamından önyükleme yapın. <br> 9. Tıklayın <strong> Sonraki </strong> ve sonra <strong> Şimdi kur </strong> . <br> 10. &quot;Ürün anahtarım yok&quot;u seçin ve ardından Lisans sözleşmesini kabul edin. <br> 11. &quot;Özel yükleme&quot;yi seçin ve ardından diskteki kalan tüm bölümleri/birimleri silin. </p> <p><img src=\"images/image_thumb-12-362.png\" alt=\"cannot reset windows 10 drive locked with bitlocker\" loading=\"lazy\"></p> <p> </p> <p> 12. Bittiğinde, &quot;Ayrılmamış alan&quot;ı seçin ve <strong> Sonraki. <br> </strong> 13. Ekrandaki komutları takip etmek için <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> temiz kurulum Windows 10 </a> . </p> <p> </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne veya daha iyisi için bir yorum bırakın: Bu sorunla ilgili sözcüğün yayılmasına yardımcı olmak için bu blog gönderisini sosyal ağlarda beğenin ve paylaşın. </p>"}