{"title":"Chrome&#39;u Her Zaman Gizli modda Açma.","content":"<p> Chrome&#39;u her zaman gizli modda açmanın bir yolunu arıyorsanız, aşağıdaki okumaya devam edin. Chrome&#39;u gizli modda başlattığınızda, tarayıcı etkinliğiniz aynı cihazı kullanan diğer kullanıcılardan gizli kalır. Gizli modda Chrome, göz atma geçmişinizi, çerezleri ve formlara girdiğiniz bilgileri kaydetmez. </p> <p> Gizli modda yeni bir Chrome oturumu başlatmanın manuel yolu, Chrome&#39;un menüsüne gitmektir. <img src=\"images/image_thumb10_thumb-963.png\" alt=\"image_thumb[10]\" loading=\"lazy\"> ve &quot;Yeni gizli pencere&quot;yi seçmek veya CTRL + SHIFT + N tuşlarına basın. </p> <p><img src=\"images/image_thumb-42-832.png\" alt=\"Chrome New incognito window\" loading=\"lazy\"></p> <p> </p> <p> Bu makalede, Google Chrome&#39;un her zaman gizli modda nasıl başlatılacağına ilişkin talimatları bulacaksınız. </p> <h4> Google Chrome&#39;u Her Zaman Gizli Modda Başlatma. </h4> <p> Chrome&#39;u her zaman gizli modda başlatmak istiyorsanız, yeni bir Chrome kısayolu oluşturun ve özelliklerini aşağıdaki gibi değiştirin: </p> <p> 1, <strong> Sağ tık </strong> üzerinde <strong> Google Chrome </strong> kısayol ve seç <strong> Özellikleri </strong> . <br> 2. <strong> Genel </strong> sekmesinde, hedef satırın sonuna &quot;–gizli&quot; anahtarını (tırnak işaretleri olmadan) ekleyin ve <strong> TAMAM MI </strong> : </p> <p> Örneğin. &quot;C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe&quot; –gizli </p> <p><img src=\"images/image_thumb-43-798.png\" alt=\"How to Always Open Chrome in Incognito mode.\" loading=\"lazy\"></p> <p> 3. Şu andan itibaren, Chrome&#39;u değiştirilmiş kısayoldan başlattığınızda, Chrome gizli modda açılacaktır. * </p> <p><strong> * İPUCU: </strong> Chrome&#39;u gizli modda açmak istiyorsanız, e-postanızdan veya başka bir programdan bir köprü (URL) açarken kayıt defterini değiştirmeniz gerekir. Bunu yapmak için: </p> <blockquote> <p> 1. <strong> Kayıt düzenleyici </strong> . <br> 2. Kayıt defterinde aşağıdaki anahtara gidin: </p> <ul> <li> <p> HKEY_CLASSES_ROOT\\ChromeHTML\\shell\\open\\komut </p> </li> </ul> <p> 3. Sağ bölmede, simgesine çift tıklayın. <strong> Varsayılan </strong> REG_SZ dize değeri. </p> </blockquote> <p><img src=\"images/image_thumb-44-612.png\" alt=\"open url in chrome incognito\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4.  Anahtarı ekleyin &quot;%1&quot;den önce &quot;gizli&quot; kelimesini (tırnak işaretleri olmadan) ekleyin ve <strong> TAMAM MI </strong> . </p></blockquote> <blockquote><p> Örneğin. Değer verilerini şuradan değiştirin: </p> <p> &quot;C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe&quot; — &quot;%1&quot; </p> <p> için: </p> <p> &quot;C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe&quot; –gizli &quot;%1&quot; </p></blockquote> <p><img src=\"images/image_thumb-45-148.png\" alt=\"open url chrome incognito - registry\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Şu andan itibaren, bir URL&#39;ye (HTML) tıklandığında, Chrome onu gizli modda açacaktır. </p></blockquote> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}