{"title":"Chrome Bileşenleri ve Google Chrome Manuel Olarak Nasıl Güncellenir.","content":"<p> Yeni bir Chrome güncellemesi mevcut olduğunda, Google Chrome, güncellemeyi yüklemek için kullanıcıdan tarayıcıyı yeniden başlatmasını ister. Ancak bazen, güncelleme uygulandıktan sonra Chrome çökebilir veya donabilir. Bunun nedeni, Chrome&#39;un henüz güncellenmemiş olabilecek birkaç ayrı bileşen içermesidir ve bu durumda bunları manuel olarak güncellemeniz gerekir. </p> <p> Bu eğitici, Chrome ve Chrome bileşenlerinin manuel olarak nasıl güncelleneceğine ilişkin talimatlar içerir. </p> <h4> Google Chrome ve Chrome Bileşenlerini Manuel Olarak Güncelleme. </h4> <h6> Bölüm 1. Google Chrome Manuel Olarak Nasıl Güncellenir. </h6> <p> Google Chrome&#39;un en son sürümünü yüklemek için: </p> <p> 1. Chrome menüsünden <img src=\"images/image_thumb-4-667.png\" alt=\"image\" loading=\"lazy\"> Tıklayın <strong> Yardım -&gt; Google Chrome Hakkında </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-39-551.png\" alt=\"How to Update Chrome manually\" loading=\"lazy\"></p> <p> </p> <p> 2. Google Chrome güncellemeleri kontrol edecek ve ardından son güncellemeyi otomatik olarak yükleyecektir. </p> <p><img src=\"images/image_thumb-40-825.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Güncelleme tamamlandığında, <strong> yeniden başlat </strong> buton. </p> <p><img src=\"images/image_thumb-41-622.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Bölüm 2. Chrome Bireysel Bileşenleri Nasıl Güncellenir. </h6> <p> 1. Chrome&#39;un adres çubuğuna şunu yazın: </p> <ul> <li><strong> chrome://bileşenler </strong></li> </ul> <p> 2. <strong> Güncellemeleri kontrol ediniz </strong> güncellemek istediğiniz her Chrome bileşenindeki düğmesine basın. </p> <p><img src=\"images/image_thumb-42-446.png\" alt=\"How to Update Chrome Components\" loading=\"lazy\"></p> <p> </p> <p> 3. Güncellemeyi tamamladığınızda Chrome&#39;u yeniden başlatın. </p> <p> Ek Yardım: Chrome&#39;u ve bileşenlerini güncelledikten sonra tarayıcınızla ilgili sorunlarla karşılaşırsanız, devam edin. <a href=\"https://www.repairwin.com/how-to-uninstall-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Chrome&#39;u tamamen kaldırın ve yeniden yükleyin </a> . </p> <p> Bu kadar! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}