{"title":"DÜZELTME: Görünüşe göre bir yükseltme başlatmış ve yükleme ortamından başlatmışsınız (Çözüldü)","content":"<p> Bir yükleme ortamından Windows 10&#39;un temiz yüklemesini veya onarım yükseltmesini gerçekleştirmeyi denerseniz aşağıdaki sorun görünebilir: &quot;Yükseltmeye başlamış ve yükleme medyasından önyüklenmiş gibi görünüyorsunuz. Yükseltmeye devam etmek istiyorsanız, medyayı bilgisayarınızdan seçin ve Evet&#39;e tıklayın. Bunun yerine temiz bir kurulum yapmak istiyorsanız, Hayır&#39;a tıklayın. </p> <p><img src=\"images/image_thumb-36-818.png\" alt=\"FIX: It looks like you started an upgrade and booted from installation media \" loading=\"lazy\"></p> <p> </p> <p> Yukarıdaki hata mesajı, başlatıldıktan sonra Windows 10 yükseltmesini yarıda kestiğiniz anlamına gelir. Mesajda belirtildiği gibi, temiz bir Windows 10 kurulumu yapmak istiyorsanız, devam etmek için &quot;Hayır&quot;ı seçmelisiniz, aksi halde kurulum medyasını kaldırın ve Windows 10 yükseltmesine devam etmek için &quot;Evet&quot;e tıklayın. </p> <p> Genel olarak, yukarıdaki mesaj bir sorun değildir, ancak Windows güncellemesi yüklenemezse veya güncellemeleri yüklemeye çalıştıktan sonra Windows 10 döngüde kalırsa ve Windows 10&#39;u bir kurulumdan başlatarak onarmak istiyorsanız büyük bir sorun haline gelir. medya. </p> <p> Bu öğreticide, bir Windows 10 onarımı gerçekleştirmek için şu anda çalışan Windows 10 güncelleme işlemini iptal ederek &quot;Yükseltmeye başlamış ve yükleme medyasından başlatılmış gibi görünüyorsunuz&quot; mesajını nasıl atlayacağınızla ilgili ayrıntılı talimatlar bulacaksınız. kurulum medyasından yükseltin. </p> <h4> Windows Önyükleme Yapamıyorsa Devam Eden Windows 10 Güncellemesi Nasıl İptal Edilir * </h4> <p><strong> * Önemli: </strong> Windows 10&#39;a önyükleme yapabiliyorsanız ancak güncellemeyi Windows ortamından yükleyemiyorsanız, önce aşağıdaki işlemleri uygulayın: </p> <blockquote><p> 1. Şuraya gidin: <strong> Başlat </strong> &gt; <strong> Ayarlar </strong> &gt; <strong> Güncelleme ve güvenlik </strong> ve güncelleme işlemini başlatmak için &quot;Şimdi Yeniden Başlat&quot;a tıklayın. <br> 2. İlk yeniden başlatmanın ardından, &quot;Güncellemeler üzerinde çalışma&quot; ilerlemesini %1-2&#39;ye gelecek şekilde bırakın. <br> 3. Bu yapıldığında, <strong> Güç </strong> PC&#39;nizi tamamen kapatmak için 10-15 saniye <br> 4. Windows yükleme medyasını takın ve PC&#39;nizi açın. <br> 5. Devam eden güncellemeyi iptal etmek için aşağıdaki geri kalan adımları izleyin. </p></blockquote> <p> </p> <h6> Adım 1. Windows Update Bekleyen Eylemlerini iptal edin. </h6> <p> 1. Sisteminizi bir Windows yükleme ortamından başlatın. <br> 2. &quot;Yükseltmeye başladınız ve yükleme medyasından başlatıldınız gibi görünüyor...&quot; mesajı göründüğünde, düğmesine basın. <strong> VARDİYA </strong> + <strong> F10 </strong> komut istemini başlatmak için tuşlar. </p> <p><img src=\"images/image_thumb-37-729.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Komut isteminde, bu komutla sisteminizdeki tüm sürücülerin bir listesini alın: </p> <ul> <li><strong> wmic mantıksal disk adını al </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-991.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> </p> <p> 4. Ardından, şu komutu yazarak hangi sürücünün &quot;Windows&quot; klasörünü içerdiğini öğrenin: * </p> <p> </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * Örneğin. C: sürücüsünün içeriğini görmek için şunu yazın: &quot; <strong> yön C: </strong> &quot; (tırnak işaretleri olmadan). C: sürücüsünde &quot;Windows&quot; klasörünü göremiyorsanız, bir sonraki sürücü harfine (örn. &quot;dir D:&quot;, &quot;dir E:&quot; vb.) devam edin. Listelenen sürücülerden birindeki &quot;Windows&quot; klasörü (yukarıdaki komuttan). </p> <p> ör.: Aşağıdaki ekran görüntüsünde görebileceğiniz gibi, Windows klasörü (bu örnekte) <strong> D </strong> : sürücü.] </p> <p><img src=\"images/image_thumb-69-578.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. &quot;Windows&quot; sürücüsünün hangi sürücüde bulunduğunu bulduktan sonra (örneğin, bu örnekte &quot;D:&quot; sürücüsünde), DriveLetter yazarak o sürücüye gidin. <strong> : </strong> + <strong> Giriş </strong> . </p> <p> 6. Ardından, şu komutu yazarak Windows sürücüsünde bir karalama klasörü oluşturun: </p> <p> </p> <ul> <li><strong> mkdir D:\\Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-229.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Ardından, devam etmekte olan güncellemenin bekleyen eylemlerini geri almak için aşağıdaki komutu verin: </p> <ul> <li><strong> DISM /Image:D:\\ /ScratchDir:D:\\Scratch /Cleanup-Image /RevertPendingActions </strong></li> </ul> <p> * Not: Sürücü harfini değiştirin <strong> D </strong> senin durumuna göre. </p> <p> 8. Yukarıdaki DISM komutu yürütüldüğünde, ekranda aşağıdaki mesajı almalısınız: </p> <p> &quot; <em> Görüntüden bekleyen eylemler geri alınıyor…. <br> İşlem tamamlandı. Bekleyen eylemlerin geri alınması, yeniden başlatmanın ardından denenecektir. <br> Operasyon başarıyla tamamlandı.&quot; </em></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"DISM - RevertPendingActions\" loading=\"lazy\"></p> <p> </p> <p> 9. Komut istemi penceresini kapatın, yükleme medyasını çıkarın ve Windows&#39;un normal şekilde açılmasına izin verin. </p> <p> 10. Yeniden başlattıktan sonra ekranınızda şu mesajı görmelisiniz: &quot;Bilgisayarınızda yapılan değişiklikler geri alınıyor.&quot; Bu işlem bittiğinde Windows normal şekilde başlamalıdır. </p> <p><img src=\"images/image_thumb-39-836.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Adım 2. Disk Temizleme ile Yükseltme Dosyalarını Kaldırın. </h6> <p> Windows 10&#39;da önyükleme yaptıktan sonra, önceden indirilmiş güncellemeleri Disk Temizleme aracıyla silerek Windows 10&#39;u USB onarımı/yükseltmesi için hazırlamanız gerekir. Bunu yapmak için: </p> <p> 1. Dosya gezginini açın, C: sürücüsüne sağ tıklayın ve <strong> Özellikleri </strong> . <br> 2. <strong> Disk temizleme </strong> buton. </p> <p><img src=\"images/image_thumb_thumb-190.png\" alt=\"Disk cleanup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Ardından tıklayın <strong> Sistem dosyalarını temizleyin </strong> . </p> <p><img src=\"images/image_thumb-40-950.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Şimdi aşağıdaki dosyaları kaldırmak için işaretleyin ve tıklayın. <strong> TAMAM MI </strong> : </p> <ul> <li> <ul> <li> <ul> <li> Windows Güncelleme Temizleme. </li> <li> Windows Defender Antivirüs. </li> <li> İndirilen Program Dosyaları. </li> <li> Geçici internet dosyaları. </li> <li> Önceki Windows Kurulumları. </li> <li> Geridönüşüm kutusu. </li> <li> Geçici dosyalar. </li> <li> Geçici Windows Kurulum dosyaları </li> </ul> </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-41-458.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Sorulduğunda, <strong> Dosyaları sil </strong> . </p> <p><img src=\"images/image_thumb-42-931.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Temizleme tamamlandığında, disk özelliklerini kapatın ve bir sonraki adıma geçin. </p> <p> </p> <h6> Adım 3. &#39;SoftwareDistribution&#39; Klasörünü silin. </h6> <p> &quot;C:\\Windows\\ <strong> Yazılım Dağıtımı </strong> &quot; klasörü, Windows&#39;un Windows Güncellemelerini depoladığı konumdur. Çoğu zaman, bu klasör bozulur ve güncellemeleri sıfırdan yeniden indirmek için yeniden oluşturmanız gerekir. Bu nedenle, aşağıdaki gibi ilerleyin: </p> <p><strong> 1. Windows Update Hizmetini Durdurun: </strong> Bunu yapmak için: </p> <blockquote><p> bir. Windows&#39;a basın <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> $ </strong> Çalıştır komut kutusunu açmak için tuşlar. <br> b. Arama kutusuna şunu yazın: <strong><em> services.msc </em></strong> &amp; Tıklayın <strong> TAMAM MI </strong> . </p></blockquote> <p><img src=\"images/image_thumb-12-264.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> c. Hizmetler kontrol panelinde &quot; <strong> Windows güncelleme&quot; </strong> hizmet. <br> d. sağ tıklayın <strong> Windows güncelleme </strong> servisini seçin ve &quot; <strong> Dur </strong> &quot;. </p></blockquote> <p><img src=\"images/image_thumb-9-434.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. SoftwareDistribution klasörünü silin. </strong></p> <blockquote><p> bir. Windows Gezgini&#39;ni açın ve şuraya gidin: <strong> C:\\Windows </strong> Klasör. <br> b. Bul ve <strong> Sil </strong> &quot; <strong><em> Yazılım Dağıtımı </em></strong> &quot; klasörü (veya yeniden adlandırın. ör. &quot;SoftwareDistributionOLD&quot; olarak değiştirin). </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-10-140.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Bilgisayarı yeniden başlatın </strong> değişiklikleri uygulamak için. </p> <p> </p> <h6> Adım 4. Windows 10&#39;u yükleme medyasından yükseltin. </h6> <p> Artık Windows 10&#39;u bir yükleme ortamından onarmaya-yükseltmeye hazırsınız. Bunu yapmak için: </p> <p> 1. <strong> yeniden başlat </strong> bilgisayarınız ve <strong> çizme </strong> Windows USB&#39;den (veya DVD&#39;den) <strong> kurulum ortamı </strong> . <br> 2. Windows Kurulum sihirbazında, <strong> Sonraki </strong> ve ardından tıklayın <strong> Şimdi kur </strong> . <br> 3. <strong> Kabul etmek </strong> &#39;Lisans sözleşmesi&#39;. <br> 4. Sorulduğunda Yükselt&#39;i seçin <strong> : Windows&#39;u yükleyin ve dosyaları, ayarları ve uygulamaları saklayın </strong> . </p> <blockquote><p><img src=\"images/image_thumb8_thumb-241.png\" alt=\"image_thumb8\" loading=\"lazy\"></p></blockquote> <p> 5. Ardından, Windows 10&#39;u yükseltmek için ekrandaki talimatları izleyin. </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}