{"title":"DÜZELTME: Windows 10&#39;da Skype Kamera Siyah ekranı ve diğer Web Kamerası sorunları.","content":"<p> Skype kamera siyah/boş ekran sorunu, Windows 10&#39;daki en yaygın sorunlardan biridir ve birkaç nedenden kaynaklanabilir, işte sorunu nasıl çözeceğinize ilişkin adım adım bir kılavuz. </p> <p> Windows 10&#39;da yeni bir güncelleme, entegre web kameranızda birçok soruna neden olabilir ve bazı uygulamalarda kamera düzgün çalışırken bazı uygulamalarda çalışmayabilir veya kamera tanınmayabilir. Örneğin, Webex ve Zoom uygulamalarında kamera sorunsuz çalışırken Skype&#39;ta siyah bir ekran görüntülediği bir durum gördüm. </p> <p> Bu kılavuz, Windows 10 yüklü dizüstü bilgisayarlarda tümleşik kamerayla ilgili çeşitli sorunları çözmek için adım adım talimatlar içerir: * </p> <ul> <li><em> Web kamerası/Kamera Windows 10&#39;da çalışmıyor </em></li> <li><em><em> Web kamerası/Kamera </em> Windows 10&#39;da Güncellemeden sonra çalışmayı durdurdu. </em></li> <li><em> Web kamerası bazı uygulamalarda (Skype, Windows Hello WebEx, vb.) çalışmıyor. </em></li> <li><em> Web kamerası, Skype&#39;ta kullanıldığında siyah (veya boş) bir ekran görüntüler. </em></li> <li><em> Web kamerası Skype&#39;ta çalışıyor ancak kamera önizleme penceresinde siyah bir ekran görüntüleniyor </em> . </li> <li> Uygulamalar Kamerayı/Web Kamerasını tanıyamıyor veya bulamıyor </li> </ul> <p><strong> * Lenovo ThinkPad sahipleri için not: </strong> Aşağıdaki tabloda listelenen ThinkPad modellerinden birine sahipseniz, bunu indirip yüklemeye devam edin. <a href=\"/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/DC8297800EA7/Integrated%20Camera%20Driver%20Registry%20Patch%20for%20Windows%2010%20(Version%201709%20or%20later)%20-%20ThinkPad\" target=\"_blank\" rel=\"nofollow noopener\"> Lenovo&#39;dan kayıt defteri yaması. </a> Yama, Windows 10 sürüm 1709 veya sonraki bir sürüme yükseltildikten sonra tümleşik kamera sürücüsünün düzgün çalışmayabileceği bir sorunu düzeltir. </p> <p><img src=\"images/image_thumb-30-725.png\" alt=\"THinkpad Registry Fix for Integrated Camera\" loading=\"lazy\"></p> <h2> Nasıl DÜZELTİLİR: Windows 10&#39;da web kamerası sorunları. </h2> <p> </p> <h3> Adım 1. Uygulamalara Kamera Erişimine İzin Verin. </h3> <p> Windows 10&#39;da Kamera ve Mikrofon, uygulanmış olabilecek Gizlilik ayarları nedeniyle uygulamalar tarafından kullanılamayabilir. Bu nedenle, devam edin ve kamera sorunu olan uygulamanın kameranıza erişmesine izin verin. Örneğin, Skype&#39;ta kamera sorunuyla karşılaşırsanız aşağıdakileri yapın: </p> <p> 1. Gitmek için gezinin <strong> Başlat </strong> Menü <img src=\"images/image_thumb-12-696.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Ayarlar </strong> -&gt; <strong> Gizlilik </strong> . <br> 2. Seç <strong> Kamera </strong> sol bölmede ve sağda: </p> <blockquote><p> bir. emin olun <strong> Bu cihaz için kamera erişimi </strong> dır-dir <strong> üzerinde. </strong> Değilse, tıklayın <strong> Değişiklik </strong> ve ayarla <strong> AÇIK. </strong><br> b. sonra ayarla <strong> açık </strong> <strong> Uygulamaların kamera anahtarınıza erişmesine izin verin </strong> . </p> <p><img src=\"images/image_thumb-20-105.png\" alt=\"Allow Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Şimdi aşağı kaydırın ve… </p> <p> c. Siyah kamera ekranı sorunu yaşıyorsanız <strong> Skype </strong> uygulamayı saklayın, aşağı kaydırın ve <strong> Hangi Microsoft Store uygulamalarının kameranıza erişebileceğini seçin </strong> bölüm, set <strong> Skype </strong> için <strong> Açık. </strong></p> <p><img src=\"images/image_thumb-21-826.png\" alt=\"Allow Store Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> d. kullanırken kameranızın siyah ekran penceresini görürseniz <strong> Windows için Skype </strong> (masaüstü uygulaması), ardından <strong> Masaüstü uygulamalarının kameranıza erişmesine izin verin </strong> anahtar <strong> açık </strong> . </p> <p><img src=\"images/image_thumb-22-558.png\" alt=\"Allow Applications to Access Camera Windows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h3> Adım 2. Kameranızın düzgün çalışıp çalışmadığını kontrol edin. </h3> <p> Web kameranızda sorun gidermenin ilk adımlarından biri, web kameranızın Windows 10 Kamera uygulamasında çalıştığını doğrulamaktır. </p> <p> 1. Arama kutusuna şunu yazın <strong> kamera </strong> Kamera uygulamasını açmak için <br> 2. Büyüteç&#39;e tıklayın ve &quot; <strong> kamera </strong> &quot;. <br> 3. <strong> Kamera </strong> uygulama </p> <p><img src=\"images/image_thumb-23-730.png\" alt=\"Open Camera app Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Şimdi sonuca göre aşağıdaki gibi ilerleyin: </p> <blockquote><p> A. Kameranız çalışıyorsa, görüntünüzü ekranda görmelisiniz. Bu durumda, devam edin ve kameranızı Skype&#39;ta veya kullandığınız başka bir uygulamada kontrol edin. Web kamerası çalışmıyorsa veya siyah bir ekran görüntülüyorsa aşağıdaki adımları sırasıyla uygulayın: </p> <ol> <li> deneyin <strong> kaldır </strong> ve <strong> yeniden kurmak </strong> kamera sorunu olan uygulama (örn. Skype). </li> <li> Aşağıdaki talimatları izleyerek Kayıt Defterinde Çerçeve Sunucusu Modunu Etkinleştirme veya Devre Dışı Bırakma ile devam edin. <a href=\"#step-3\" target=\"_blank\" rel=\"nofollow noopener\"> Aşama 3 </a> . </li> </ol> <p> B. Kameranız Kamera uygulamasında da çalışmıyorsa aşağıdakilerden biri olabilir: </p> <ol> <li> Kamera aygıtı sürücüsü yanlış veya hasarlı. Bu durumda, aşağıdaki talimatları izleyerek kamera sürücülerinde sorun gidermeye devam edin. <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> 4. adım </a> . </li> <li> Kamera hasarlı ve hiç çalışmıyor. Bu durumda, web kameranızı onarmak için bir bilgisayar tamirhanesine gidin veya harici bir USB kamera kullanın. </li> </ol> </blockquote> <h3></h3> <h3> Adım 3. Windows 10 Kayıt Defteri&#39;nde Web Kamerası Siyah Ekran sorununu düzeltin. </h3> <p> Kamera tanınır ve bazı uygulamalarda sorunsuz çalışıyorsa, ancak diğerlerinde çalışmıyorsa veya Skype&#39;ta siyah bir ekran görüntüleniyorsa, kayıt defterinde &quot;Çerçeve Sunucusu Modu&quot;nu devre dışı bırakmayı veya etkinleştirmeyi deneyin. </p> <p> 1. Kayıt Defteri Düzenleyicisi&#39;ni açın: Bunu yapmak için: </p> <blockquote><p> 1. Windows&#39;a basın <img src=\"images/image_thumb41-284.png\" alt=\"image\" loading=\"lazy\"> + <strong> $ </strong> Çalıştır komut kutusunu açmak için tuşlar. <br> 2. Tip <strong> regedit </strong> ve bas <strong> Giriş </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-845.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> 3. Kayıt Defteri Düzenleyicisi&#39;nde sol bölmede aşağıdaki anahtara gidin: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows Media Foundation\\Platform </li> </ul> <p> 4. <strong> Sağ tık </strong> sağ bölmede boş bir alana tıklayın ve <strong> Yeni -&gt; DWORD (32-bit) Değeri. </strong></p> <p><img src=\"images/image_thumb-24-839.png\" alt=\"Fix Webcam black Screen Windows 10\" loading=\"lazy\"></p> <p> 5. Adını ver <strong> EnableFrameServerMode </strong> yeni değere. <br> 6. Yeni oluşturulan değere çift tıklayın ve değer verisinin doğru olduğundan emin olun. <strong>0</strong> . (Sıfır). Tıklayın <strong> TAMAM MI. </strong></p> <p><img src=\"images/image_thumb-25-764.png\" alt=\"Fix Webcam issues Windows 10\" loading=\"lazy\"></p> <p> 7. Şimdi, yukarıdaki (4,5 &amp; 6) aynı adımları takip edin ve bu tuşta aynı değişiklikleri yapın: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows Media Foundation\\Platform </li> </ul> <p> 8. Bittiğinde, <strong> kapat </strong> Kayıt Defteri Düzenleyicisi ve <strong> tekrar başlat </strong> senin bilgisayarın. <br> 9. Yeniden başlattıktan sonra Skype&#39;ı başlatın ve WebCam ile ilgili sorunun çözülüp çözülmediğini kontrol edin. Değilse, aynı adımları izleyin, ancak bu sefer <strong> etkinleştirme </strong> <strong> EnableFrameServerMode </strong> değerini değiştirerek <strong>0 </strong> için <strong> 1 </strong> ve <strong> tekrar başlat </strong> PC&#39;nizi tekrar </p> <p> </p> <h3> Adım 4. Web Kamerası Sürücüsünde Sorun Giderin. </h3> <p> Windows 10&#39;da Kamera sorunlarını düzeltmek için bir sonraki adım, Kamera sürücülerini geri almak veya kaldırmak/yeniden yüklemektir. 1. Aç <strong> Aygıt Yöneticisi </strong> . Bunu yapmak için: </p> <blockquote><p> 1. Windows&#39;a basın <img src=\"images/image_thumb8_thumb_thumb-696.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> $ </strong> Çalıştır komut kutusunu açmak için tuşlar. <br> 2. &quot;Aç&quot; kutusuna şunu yazın: <strong> devmgmt.msc </strong> &amp; Tıklayın <strong> TAMAM MI </strong> . </p> <p><img src=\"images/image_thumb-5-837.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Genişlet <strong> Cihazları Hayal Edin </strong> (veya <strong> kameralar </strong> ) <br> 3. <strong> Sağ tık </strong> senin üzerinde <strong> Kamera </strong> ve Seç <strong> Özellikleri. </strong></p> <p><img src=\"images/image_thumb-26-673.png\" alt=\"Camera Properties\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 4. <strong> sürücü </strong> sekmesine gidin ve durumunuza göre aşağıdaki gibi ilerleyin: </p> <blockquote><p> A. Web kameranız daha önce çalışıyorsa, <strong> Sürücüyü geri al </strong> ve <strong> yeniden başlat </strong> PC&#39;niz. Ardından kameranızın çalışıp çalışmadığını kontrol edin. </p> <p><img src=\"images/image_thumb-27-454.png\" alt=\"Roll Back Driver - Camera\" loading=\"lazy\"></p> <p> </p> <p> B. Kameranız daha önce hiç çalışmadıysa veya kameranızı ilk kez deniyorsanız (örneğin, yeni bir Windows kurulumundan sonra), aşağıdakileri sırayla deneyin: </p> <ol> <li> Tıkla <strong> Sürücüyü güncelle </strong> seçeneği, kameranızın güncellenmiş sürücüsünü kontrol etmek için. Windows yeni bir sürücü bulursa, yükleyin ve ardından Web Kameranızı kontrol edin. Aksi takdirde… </li> <li> Tıklayın <strong> Cihazı Kaldır </strong> Web kamerasını kaldırmak ve ardından <strong> tekrar başlat </strong> senin bilgisayarın. Yeniden başlattıktan sonra kameranızın çalışıp çalışmadığını kontrol edin. Değilse… </li> <li> Dizüstü bilgisayar üreticinizin destek sitesine gidin ve Web kameranız için yeni bir sürücü olup olmadığını kontrol edin ve yükleyin. </li> </ol> </blockquote> <h3> Windows 10&#39;da Kamera Sorunlarını düzeltmek için Ek Yardım. </h3> <p> Yukarıdaki adımlardan sonra hala web kameranızla ilgili sorunlarınız varsa, aşağıdakileri deneyin: </p> <ol> <li> <p> Mevcut tüm Windows 10 güncellemelerini yükleyin ( <strong> Başlat </strong> -&gt; <strong> Ayarlar </strong> -&gt; <strong> Güncelleme ve Güvenlik </strong> ve tıklayın <strong> Güncellemeleri kontrol et). </strong></p> </li> <li> <p> kullanarak Windows 10&#39;u en son sürüme güncelleyin. <strong> Yardımcısı güncelleyin. </strong> (Bunu yapmak için buna gidin <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"noopener\"><strong> bağlantı </strong></a> ve tıklayın <strong> Şimdi güncelle </strong> buton). </p> </li> <li> <p><a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"noopener\"><strong> Windows 10&#39;u yenileyin </strong> . </a></p> </li> </ol> <p> Hepsi bu kadar millet! İşinize yaradı mı? Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}