{"title":"DÜZELTME: Windows 10 Başlat Menüsü, Ayarlar, Cortana veya Görev Çubuğu çalışmıyor. (Çözüldü)","content":"<p> Bu eğitici, Windows 10&#39;da aşağıdaki sorunları düzeltmek için talimatlar içerir: Başlat Menüsü açılmıyor, Cortana Arama çalışmıyor, Ayarlar uygulaması başlatılmıyor, Görev çubuğu simgeleri açılmıyor. </p> <p> Birçok Windows 10 kullanıcısı Başlat menüsü, Görev Çubuğu, Cortana ve Ayarlar ile ilgili sorunlar bildirdi, bu nedenle bu kılavuzda yukarıdaki sorunları çözmek için en yaygın yöntemleri listeliyorum. </p> <h2> Nasıl Düzeltilir: Windows 10 Görev Çubuğu, Başlat Menüsü, Ayarlar veya Cortana Sorunları. </h2> <h3> Yöntem 1. En Son Windows 10 Güncelleştirmesini Kaldırın. </h3> <p> Birçok kullanıcı, bu makalede bahsedilen sorunların kaldırıldıktan sonra çözüldüğünü bildirdi. <strong><a href=\"https://support.microsoft.com/en-us/topic/august-11-2020-kb4566782-os-build-19041-450-ec5cf4b6-86ed-b0d3-539c-5fbe1b17f56a\" target=\"_blank\" rel=\"nofollow noopener\"> KB4566782 </a></strong> Güncelleme. </p> <p> KB4566782 güncellemesini yüklü güncellemeler listesinde bulamıyorsanız, mevcut tüm güncellemeleri kontrol edip yükleyin ve sorun devam ederse deneyin. <strong><a href=\"https://www.repairwin.com/how-to-uninstall-updates-in-windows-10/#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> en son yüklenen güncellemeleri kaldırın. </a></strong></p> <h3> Yöntem 2. Windows 10&#39;u Güvenli Modda yeniden başlatın. </h3> <p> 1. Windows&#39;a basın <img src=\"images/image_thumb8_thumb_thumb-268.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> $ </strong> Çalıştır komut kutusunu açmak için tuşlar. <br> 2. Tip <strong> msconfig </strong> ve bas <strong> Giriş </strong> . </p> <p><img src=\"images/image_thumb-47-537.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Çizme </strong> sekmesini seçin <strong> Güvenli Önyükleme </strong> seçeneğini tıklayın, ardından <strong> TAMAM MI </strong> ve bilgisayarınızı yeniden başlatın. </p> <p><img src=\"images/image_thumb-48-665.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 4. Yeniden başlattıktan sonra ve Güvenli Moddayken, sorunlarınızın devam edip etmediğini kontrol edin. <br> 5. Ardından, &#39;msconfig&#39; aracını tekrar çalıştırın ve <strong> Genel </strong> sekmesini kontrol edin <strong> Normal başlangıç </strong> ve tıklayın <strong> TAMAM MI </strong> . </p> <p><img src=\"images/image_thumb-859.png\" alt=\"normal startup windows\" loading=\"lazy\"></p> <p> 6. <strong> Tekrar başlat </strong> senin bilgisayarın. <br> 7. Yeniden başlattıktan sonra sorunun devam edip etmediğini kontrol edin, aksi takdirde sonraki yönteme geçin. </p> <p> </p> <h2> Yöntem 3. Temiz Önyükleme gerçekleştirin. </h2> <p> 1. &#39;msconfig&#39; aracını çalıştırın. <br> 2. Hizmetler sekmesinde, <strong> Kontrol </strong> <strong> Bütün Microsoft Servisleri&#39;ni gizle </strong> onay kutusunu seçin ve ardından <strong> Hepsini etkisiz hale getir </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-333.png\" alt=\"clean boot windows\" loading=\"lazy\"></p> <p> </p> <p> 3. Ardından <strong> Başlamak </strong> sekmesini ve tıklayın <strong> Görev Yöneticisi&#39;ni açın. <br> </strong> 4. <strong> </strong> Listelenen tüm programları tek tek seçin ve tıklayın. <strong> Devre dışı bırak. </strong></p> <p><img src=\"images/image_thumb-1-399.png\" alt=\"clean boot windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Bittiğinde, o pencereyi kapatın ve ardından <strong> TAMAM MI </strong> için &#39;Sistem Yapılandırması&#39; yardımcı programında <strong> Tekrar başlat </strong> senin bilgisayarın. <br> 6. Yeniden başlattıktan sonra, bilgisayarınız iyi ve sorunsuz çalışıyorsa*, &#39;Sistem Yapılandırması&#39; (msconfig) yardımcı programını tekrar açın ve devre dışı bırakılan tüm programları tek tek etkinleştirin ve hangi programın hataya neden olduğunu bulana kadar bilgisayarınızı yeniden başlatın sorun. </p> <p> * Not: Temiz Önyükleme durumunda bile sorun devam ederse, sonraki yönteme geçin. </p> <h3> Yöntem 4. Tüm Windows 10 Yerleşik Uygulamalarını Yeniden Yükleyin ve Yeniden Kaydedin. </h3> <p> Windows 10&#39;da Görev Çubuğu, Başlat menüsü, Cortana vb. ile ilgili sorunları çözmenin bir sonraki yöntemi, tüm yerleşik uygulamaları yeniden yüklemek ve yeniden kaydettirmektir. </p> <p> 1. PowerShell&#39;i Yönetici olarak açın. Bunu yapmak için: </p> <blockquote><p> 1. <strong> Cortana </strong> arama kutusuna yazın <strong> güç kalkanı <br> </strong> 2. Sağ tıklayın <strong> Windows PowerShell&#39;i </strong> sonuç ve seç <strong> Yönetici olarak çalıştır. </strong></p></blockquote> <p><img src=\"images/image_thumb-51-691.png\" alt=\"FIX: Windows 10 Start Menu, Settings, Cortana or Taskbar icons Not Working.\" loading=\"lazy\"></p> <p> </p> <p> 3. PowerShell Türünde (kopyala ve yapıştır) aşağıdaki komutu ve tuşuna basın <strong> Giriş </strong> : </p> <ul> <li> Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode - &quot;$($_.InstallLocation)\\AppXManifest.xml&quot;} kaydını yapın </li> </ul> <p><img src=\"images/image_thumb-2-985.png\" alt=\"register re-install windows 10 apps\" loading=\"lazy\"></p> <p> 4. Komutun çalışmasını bekleyin ve hataları yok sayın (kırmızı harflerle). <br> 5. <strong> Tekrar başlat </strong> bilgisayarınızı ve ardından sorununuzun çözülüp çözülmediğini kontrol edin. </p> <p> </p> <h3> Yöntem 5. Yeni Bir Hesap Oluşturun. </h3> <p> Windows 10&#39;daki çeşitli sorunları çözmenin başka bir yöntemi de yeni bir hesap oluşturmak ve kişisel dosyalarınızı ve verilerinizi yeni hesaba aktarmaktır. Bunu yapmak için: </p> <p> 1. Aç <strong> Yönetici Olarak Komut İstemi </strong> . <br> 2. Komut isteminde aşağıdaki komutu yazın ve <strong> Giriş </strong> : </p> <ul> <li><strong> net kullanıcı hesabı şifresi / ekle </strong></li> </ul> <p> * Not: Yukarıdaki komutta &quot;hesap&quot; ve &quot;şifre&quot; alanlarını seçiminizle değiştirin. </p> <p> Örneğin. &quot;Admin1&quot; kullanıcı adı ve &quot;Admin123&quot; şifresiyle yeni bir hesap oluşturmak istiyorsanız şunu yazın: <em> net kullanıcı Admin1 Admin123 /ekle </em></p> <p><img src=\"images/image_thumb-3-388.png\" alt=\"add user windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Ardından devam edin ve şu komutla yeni hesabı Yöneticiler grubuna ekleyin: </p> <ul> <li><strong> net yerel grup yöneticileri hesabı / ekle </strong></li> </ul> <p> Örneğin. Örneğimizde komut şudur: <em> net yerel grup yöneticileri Admin1 /add </em></p> <p><img src=\"images/image_thumb-4-429.png\" alt=\"fix windows 10 start menu, cortana, settings\" loading=\"lazy\"></p> <p> </p> <p> 4. Komut istemi Penceresini kapatın ve <strong> tekrar başlat </strong> senin bilgisayarın. <br> 5. Yeniden başlattıktan sonra yeni hesaba giriş yapın. <br> 6. Sorunun devam edip etmediğini kontrol edin. Sorun çözülürse, verilerinizi ve dosyalarınızı yeni hesaba aktarın ve işiniz bitti. </p> <p> </p> <h3> Yöntem 6. Windows 10&#39;u onarın. </h3> <p> Windows 10 sorunlarını çözmenin son yöntemi, <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows 10&#39;u Yerinde Yükseltme ile onarın </a> . </p> <p> </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}