{"title":"DÜZELTME: Dosyanın Adobe Premiere&#39;de ses veya video akışı yok.","content":"<p> Bir MP4 video dosyasını içe aktarırken &quot;Dosyada ses veya video buharı yok&quot; açıklamasıyla birlikte &#39;Dosya Alma Hatası&#39; Adobe Premiere hatası alırsanız, aşağıdaki okumaya devam edin. Adobe Premiere&#39;de &quot;Dosyada ses veya video buharı yok&quot; hatası, videonun diğer medya oynatıcılarda (VLC, Windows Media Player vb.) düzgün oynatılmasına rağmen görünebilir. </p> <p><img src=\"images/image_thumb-43-349.png\" alt=\"FIX: File has no audio or video streams on Adobe Premiere\" loading=\"lazy\"></p> <p> </p> <p> Bir video dosyasını içe aktarırken Adobe Premiere hataları çeşitli nedenlerle görünebilir, bu nedenle bu eğitimde sorunu çözmek için mevcut tüm yöntemleri bulacaksınız. </p> <h4> Nasıl düzeltilir: Adobe Premiere&#39;de &quot;Dosyada ses veya video buharı yok&quot;. </h4> <h6> Yöntem 1. QuickTime&#39;ı yükleyin. </h6> <p> Her şeyden önce, en son yüklediğinizden emin olun. <a href=\"https://support.apple.com/downloads/quicktime\" target=\"_blank\" rel=\"nofollow noopener\"> Hızlı zaman </a> sürümünü bilgisayarınıza yükleyin ve ardından mp4 dosyasını Adobe Premiere&#39;de içe aktarmayı deneyin. </p> <p> </p> <h6> Yöntem 2. Video dosyasını yeniden adlandırın. </h6> <p> 1. PC&#39;nizdeki başka bir konumda mp4 video dosyasının bir kopyasını oluşturun. (örneğin, Masaüstünüzde) <br> 2. Video dosyasını aşağıdaki gibi yeniden adlandırın: </p> <blockquote><p> bir. Video dosyasına daha kısa bir dosya adı verin ve… <br> b. Adından tüm özel karakterleri kaldırın. (alt çizgi, parantez vb.). </p></blockquote> <p> 3. Video dosyasını Adobe Premiere&#39;de açın. </p> <p> </p> <h6> Yöntem 3. Dosya Adı Uzantısını MP4&#39;ten MOV&#39;a değiştirin. </h6> <p> Adobe Premiere&#39;in &quot;Dosyada ses veya video akışı yok&quot; hatasını atlamanın bir sonraki yöntemi, video dosyasının uzantısını .mp4&#39;ten .mov&#39;a (veya tam tersi) değiştirmektir. Bunu yapmak için: </p> <p> 1. Dosya Gezgini&#39;nde, <strong> Görünüm </strong> -&gt; <strong> Seçenekler </strong> -&gt; <strong> Klasörü ve arama seçeneklerini değiştirin </strong> . </p> <p><img src=\"images/image_thumb-45-776.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Görünüm </strong> sekme, <strong> açık </strong> &quot;Bilinen dosya türleri için uzantıları gizle&quot; kutusunu işaretleyin ve <strong> TAMAM MI </strong> . * </p> <p> * Not: Bu ayarı kalıcı hale getirmek için, Tamam&#39;a tıklamadan önce &#39;Klasörlere uygula&#39;yı tıklayın. </p> <p><img src=\"images/image_thumb-46-490.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Şimdi devam edin ve video dosyasının uzantısını aşağıdaki gibi yeniden adlandırın/değiştirin: </p> <ul> <li> Video dosyası MP4 biçimindeyse (.mp4), uzantısını .mov olarak değiştirin. </li> <li> Video dosyası MOV biçimindeyse (.mov), uzantısını .mp4 olarak değiştirin </li> </ul> <p><img src=\"images/image_thumb-47-586.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Son olarak, video dosyasını Adobe Premiere&#39;de açın. </p> <p> </p> <p> </p> <h6> Yöntem 4. Medya Önbellek Veritabanını ve Önbellek Dosyalarını temizleyin. </h6> <p> Bir medya dosyasını (Video veya Ses) içe aktardığınızda ve Adobe Premiere&#39;de bu dosyayla çalışırken, program daha hızlı performans için medya önbellek dosyalarını oluşturur. Ayrıca program, Medya Önbellek Veritabanında bu önbellek dosyaları için bağlantılar oluşturur. Zaman içinde, bu ortam önbellek dosyaları ve Ortam Önbelleği veritabanı çok büyüyebilir veya bozulabilir ve sorunları önlemek için temizlenmesi gerekebilir. </p> <p> Bu nedenle, Premiere&#39;de &quot;Dosyada ses veya video akışı yok&quot; sorununu çözmenin bir sonraki yöntemi, &quot;Medya Önbellek Veritabanını&quot; temizlemek ve önbellek dosyalarını silmek. Bunu yapmak için: * </p> <p><strong> A. Adobe Premiere&#39;in Medya Önbelleği Veritabanını Temizleme. </strong></p> <p> 1. Adobe Premiere&#39;i açın. <br> 2. Menüden şuraya gidin: <strong> Düzenle </strong> -&gt; <strong> Tercihler </strong> -&gt; <strong> Medya. <br> </strong> 3. Medya Önbellek Veritabanında <strong> Temiz </strong> buton. </p> <p><img src=\"images/image_thumb-48-167.png\" alt=\"Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> 4. <strong> Tekrar başlat </strong> Adobe Premiere ve video dosyasını açmayı deneyin. &quot;Dosyada ses veya video akışı yok&quot; hatası devam ederse, aşağıdaki talimatları izleyerek Adobe Premiere&#39;in önbellek dosyalarını temizlemeye devam edin: </p> <p><strong> B. Adobe Premiere&#39;in Medya Önbellek Dosyaları Nasıl Temizlenir. </strong></p> <p> 1. <strong> Açık </strong> Adobe premiere. <br> 2. Menüden şuraya gidin: <strong> Düzenle </strong> -&gt; <strong> Tercihler </strong> -&gt; <strong> Medya. <br> </strong> 3. Medya Önbellek Dosyalarında <strong> Araştır </strong> düğmesine basın veya medya önbellek dosyalarının konumunu not edin. </p> <p><img src=\"images/image_thumb-49-331.png\" alt=\"FIX: Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Kapat </strong> Adobe premiere. <br> 5. Dosya Gezgini&#39;nde, <strong> silmek </strong> &quot;Medya Önbellek dosyaları&quot; klasörünün tüm içeriği. <br> 6. Video dosyasını Premiere&#39;e aktarın. </p> <p> </p> <h6> Yöntem 5. Video Dosyasını yeniden kodlayın. </h6> <p> Adobe Premiere içe aktarma işleminde &quot;Dosyada ses veya video akışı yok&quot; sorununu çözmenin son yöntemi, video dosyasını yeniden kodlamaktır. Bunu yapmak için: </p> <p> 1. İndirin ve kurun <a href=\"https://handbrake.fr/downloads.php\" target=\"_blank\" rel=\"nofollow noopener\"> El freni </a> . <br> 2. El Freni&#39;ni açın ve <strong> Dosya – Tek bir video dosyası açın </strong> . </p> <p><img src=\"images/image_thumb-50-634.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Adobe Premiere&#39;de içe aktaramadığınız video dosyasını seçin ve <strong> Açık </strong> . <br> 4. Çıktı biçimini şu şekilde ayarlayın: <strong> MP4, </strong> ve ardından tıklayın <strong> Araştır </strong> ve çıktı (yeniden kodlanmış) video dosyasının depolama konumunu ve dosya adını belirtin. </p> <p><img src=\"images/image_thumb-51-817.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Boyutlar </strong> sekmesinde, kaynak dosyayla aynı boyutları ayarlayın. <br> 6. Bittiğinde, tıklayın <strong> Encode&#39;u başlatın. </strong></p> <p><img src=\"images/image_thumb-52-713.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Kodlama işlemi tamamlandığında El Freni&#39;ni kapatın. <br> 7. Yeniden kodlanmış video dosyasını Adobe Premiere&#39;de açın. </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}