{"title":"DÜZELTME: Halihazırda devam eden bir konsol oturumunuz olduğundan bilgisayarınız başka bir konsol oturumuna bağlanamadı. (Çözüldü)","content":"<p> Windows tabanlı bir bilgisayarda, Uzak Masaüstü Bağlantısında şu hata görünüyor: &quot;Zaten devam eden bir konsol oturumunuz olduğundan, bilgisayarınız uzak bilgisayardaki konsol oturumuna bağlanamadı&quot;. </p> <p> </p> <p><img src=\"images/image_thumb-3-627.png\" alt=\"Your computer could no connect to console session on the remote computer because you already have a console session in progress.\" loading=\"lazy\"></p> <p> </p> <p> Bu öğretici, aşağıdaki Uzak Masaüstü Bağlantısı hatasını çözmek için yönergeler içerir: &quot;Zaten devam eden bir konsol oturumunuz olduğundan, bilgisayarınız uzak bilgisayardaki konsol oturumuna bağlanamadı&quot;. </p> <h4> Nasıl Düzeltilir: Devam Eden Bir Konsol Oturumunuz olduğundan Uzak Masaüstü Bağlantısı Bağlanamadı. </h4> <p> &quot;Zaten devam eden bir konsol oturumunuz olduğundan bilgisayarınız uzak bilgisayardaki konsol oturumuna bağlanamadı&quot; hatası, bilgisayarınızdaki ağ bağdaştırıcılarından birinin (RDP&#39;den) bilgisayarla aynı IP adresine sahip olmasından kaynaklanır. uzak masaüstü aracılığıyla bağlanmaya çalıştığınız </p> <p> Örneğin: uzak bilgisayarın IP adresi &quot;192.168.1.157&quot; ise, aşağıdaki adımları izleyin: </p> <p> 1. Aç <strong> Yönetici Olarak Komut İstemi </strong> bilgisayarınızda (RDP&#39;den). <br> 2. PC&#39;nizde atanan IPv4 Adreslerini görüntülemek için aşağıdaki komutu verin. </p> <ul> <li><strong> ipconfig </strong></li> </ul> <p> </p> <p> 3. Şimdi yerel bilgisayarınızdaki (RDP&#39;den) hangi ağ bağdaştırıcısının uzak bilgisayarla (RDP&#39;den) aynı IP adresine sahip olduğunu bulun. <br> 4. Yerel bilgisayarınızdaki hangi LAN adaptörünün uzak bilgisayarla aynı IP adresine sahip olduğunu bulduğunuzda, devam edin ve o adaptördeki IP adresini farklı bir adresle değiştirin. * </p> <p> Örneğin. Bu örnekte Uzak bilgisayarın IP&#39;si: &quot;192.168.1.157&quot;, bu nedenle Ethernet adaptörünün (yerel bilgisayarda) IP Adresini farklı bir adresle değiştirmeliyiz: ör. için: &quot;192.168.1.160&quot;. </p> <p><img src=\"images/image_thumb-5-946.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> * Not: Yerel ağınızdaki IP adresi bir DHCP sunucusu tarafından atanmışsa, sorunu atlamak için aşağıdaki seçenekleriniz vardır: </p> <blockquote><p> bir. Manuel olarak farklı bir statik IP adresi belirtmek için. <br> b. DHCP sunucusundan farklı bir IP Adresi &quot;almak&quot; için yönlendiricinizi (DHCP sunucusu) yeniden başlatmak için. <br> c. DHCP sunucusunu yapılandırmak (örneğin yönlendiricide), uzak bilgisayarın IP adresini içermeyen bir aralığa IP adresleri vermek için. (ör. &quot;192.168.1.200-192.168.1.250&quot; </p></blockquote> <p> </p> <p> 5. Yerel bilgisayarınızdaki (RDP&#39;den) IP adresini değiştirdikten sonra, Uzak Masaüstü bağlantısını açın ve Uzak bilgisayara bağlanmayı deneyin. &quot;Halihazırda devam eden bir konsol oturumunuz olduğu için bilgisayarınız başka bir konsol oturumuna bağlanamadı&quot; hatası çözülmelidir. </p> <p> </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? </p> <p> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}