{"title":"DÜZELTME: Sunucu Erişilemez. Bu ağ kaynağını kullanma izniniz olmayabilir. Tutamaç geçersiz. (Çözüldü)","content":"<p> Bu öğretici, ağdaki paylaşılan bir klasöre erişmeye çalışırken aşağıdaki hatayı düzeltmek için talimatlar içerir: &quot;Sunucuya erişilemiyor. Bu ağ kaynağını kullanma izniniz olmayabilir. Erişiminiz olup olmadığını öğrenmek için bu sunucunun yöneticisiyle iletişime geçin. izinler. tanıtıcı geçersiz.&quot; </p> <p><img src=\"images/image_thumb-5-437.png\" alt=\"You might not have permission to use this network resource\" loading=\"lazy\"></p> <p> </p> <h2> Nasıl DÜZELTME: Paylaşılan Klasöre Erişilemiyor. Bu ağ kaynağını kullanma izniniz olmayabilir. Tutamaç geçersiz. </h2> <p> Normalde, bir kullanıcı gerekli izinlere sahip olmadan bir ağ paylaşımlı klasörüne erişmeye çalıştığında &quot;Bu ağ kaynağını kullanma izniniz olmayabilir&quot; dosya paylaşımı bağlantı sorunu görünür. Bu durumda ve sorunu çözmek için, kullanıcının paylaşılan klasör üzerinde uygun erişim izinlerine sahip olduğundan emin olmalısınız. </p> <p> Ancak, kullanıcının paylaşılan klasör üzerindeki izinlerinin doğru olduğunu biliyorsanız ve &quot;Bu ağ kaynağını kullanma izniniz olmayabilir&quot; bağlantı sorunu aniden ve bariz bir neden olmadan ortaya çıktıysa, sorun muhtemelen bir Windows kurulumundan kaynaklanmaktadır. Güncelleme. Bu durumda sorunu çözmek için aşağıdaki okumaya devam edin. </p> <p> * Not: Ocak 2019&#39;un ortasında paylaşım hatasıyla karşılaşırsanız, suçlu aşağıdaki Windows Güvenlik Güncellemesidir: <a href=\"https://support.microsoft.com/el-gr/help/4480970/windows-7-update-kb4480970\" target=\"_blank\" rel=\"nofollow noopener\"> 8 Ocak 2019—KB4480970 (Aylık Toplama) </a> . </p> <h6> Yöntem 1. En Son Windows Güncellemesini Kaldırın. </h6> <p> Paylaşılan klasöre sahip makinede: </p> <p> 1. &#39;Bilgisayarım&#39; simgesine sağ tıklayın ve <strong> Özellikleri </strong> . <br> 2. tıklayın <strong> Windows güncelleme </strong> . </p> <p><img src=\"images/image_thumb-6-686.png\" alt=\"fix Network Shared Folder is Not Accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. tıklayın <strong> Yüklü Güncellemeler </strong> . </p> <p><img src=\"images/image_thumb-7-999.png\" alt=\"fix cannot access shared folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Tıklayarak güncellemeleri yükleme tarihine göre sıralayın. <strong> Yüklenmiş. </strong></p> <p><img src=\"images/image_thumb-8-158.png\" alt=\"uninstall windows update\" loading=\"lazy\"></p> <p> </p> <p> 5. Windows için en son yüklenen güncellemeyi vurgulayın ve <strong> Kaldır. </strong> * </p> <p> * Örneğin. Ocak 2019&#39;un ortasında paylaşım hatasıyla karşılaşırsanız, devam edin ve &quot;Microsoft Windows KB4480970 için Güvenlik Güncelleştirmesi&quot;ni kaldırın. </p> <p><img src=\"images/image_thumb-9-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Kurulum tamamlandığında, <strong> tekrar başlat </strong> bilgisayar. <br> 7. Yeniden başlattıktan sonra, istemci makineden paylaşılan klasöre erişmeyi tekrar deneyin. Ardından önerilen eylemleri durumunuza göre uygulayın: </p> <ul> <li><strong> Durum A: </strong> Sorun devam ederse, en son yüklenen tüm güncellemeleri kaldırmaya devam edin veya devam edin. <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> yöntem 2 </a> altında. </li> <li><strong> Durum B: </strong> Sorun çözülürse, kaldırılan güncellemenin gelecekte yüklenmesini önleyin. Bunu yapmak için: </li> </ul> <blockquote><p> 1. Windows Update&#39;e gidin ve <strong> Güncellemeleri kontrol et </strong> . <br> 2. üzerine tıklayın <strong> Önemli Güncellemeler </strong> . </p></blockquote> <p><img src=\"images/image_thumb-22-393.png\" alt=\"view important updates\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 3. Sorunlu güncellemeye sağ tıklayın ve <strong> Güncellemeyi gizle </strong> . <br> 4. Son olarak tıklayın <strong> TAMAM MI </strong> ve ardından Windows Update&#39;i kapatın. </p></blockquote> <p><img src=\"images/image_thumb-23-795.png\" alt=\"hide update windows 7\" loading=\"lazy\"></p> <h6> Yöntem 2. Bilgisayarınızı Önceki Çalışma Durumuna geri yükleyin. </h6> <p> Paylaşılan klasöre sahip makinede: </p> <p> 1. Windows&#39;a basın <img src=\"images/image_thumb8_thumb-632.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> $ </strong> Çalıştır komut kutusunu açmak için tuşlar. <br> 2. Tip <strong> rstrui </strong> &amp; Tıklayın <strong> TAMAM MI </strong> Sistem Geri Yükleme&#39;yi başlatmak için. </p> <p><img src=\"images/rstui-1-300x148-611.png\" alt=\"rstui\" loading=\"lazy\"></p> <p> </p> <p> 3. tıklayın <strong> Sonraki </strong> ilk ekranda. <br> 4. Daha önceki bir çalışma durumunu (Tarih/Saat) seçin ve <strong> Sonraki </strong> geri yükleme işlemini başlatmak için </p> <p><img src=\"images/image_thumb-50-355.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Sistem geri yüklemesinden sonra, istemci makineden paylaşılan klasöre yeniden erişmeyi deneyin. </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne veya daha iyisi için bir yorum bırakın: Bu sorunla ilgili sözcüğün yayılmasına yardımcı olmak için bu blog gönderisini sosyal ağlarda beğenin ve paylaşın. </p>"}