{"title":"DÜZELTME: Devam eden bir konsol oturumu olduğundan Uzak Masaüstü Bağlantısı Bağlanamadı (Çözüldü).","content":"<p> Uzak Masaüstü Bağlantısı&#39;nda &quot;Zaten devam eden bir konsol oturumunuz olduğu için bilgisayarınız uzak bilgisayardaki başka bir konsol oturumuna bağlanamadı&quot; hata mesajı, yerel ve uzak bilgisayar aynı IP Adresine sahip olduğundan görünür. Sorun genellikle, bir VPN bağlantısı aracılığıyla başka bir bilgisayara uzaktan bağlanmaya çalıştığınızda ve yerel yönlendiricinizden uzak bilgisayarla aynı IP adresini &quot;aldığınızda&quot; ortaya çıkar. Sorunu çözmek için aşağıdaki talimatları izleyin. </p> <p> </p> <p><img src=\"images/image_thumb-7-243.png\" alt=\"Remote Desktop Connection Could Not Connect because already have a console session in progress\" loading=\"lazy\"></p> <h4> RDP hatası nasıl düzeltilir: Devam eden bir konsol oturumu olduğundan Uzak Masaüstü başka bir konsol oturumuna bağlanamadı. </h4> <p> Uzak Masaüstü Bağlantısı&#39;ndaki &quot;Zaten bir konsol oturumunuz olduğundan başka bir konsol oturumuna bağlanılamadı&quot; sorunu, genellikle yerel bilgisayar, uzaktan kumandanın IP Adresi ile aynı IP adresini rastgele (DHCP sunucusundan) aldığında ortaya çıkar RDP üzerinden bağlanmak istediğiniz bilgisayar. </p> <p> Yukarıdaki sorunu düzeltmenin tek yolu, yerel bilgisayardaki DHCP Sunucusundan Otomatik IP Adresi Atamayı devre dışı bırakmak ve manuel olarak bir IP Adresi belirlemektir. Bunu yapmak için: </p> <p> 1. <strong> Sağ tık </strong> üzerinde <strong> Ağ </strong> simge <img src=\"images/image_thumb-42-527.png\" alt=\"image\" loading=\"lazy\"> Görev Çubuğunda ve tıklayın <strong> Ağ ve Paylaşım Merkezini Aç. </strong> * </p> <p><img src=\"images/image_thumb-104-485.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Seç <strong> Ethernet </strong> (veya Wi-Fi) ve ardından &#39;İlgili ayarlar&#39; bölümünde <strong> Bağdaştırıcı seçeneklerini değiştir </strong> . </p> <p><img src=\"images/image_thumb-43-117.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Çift tıklama </strong> aktif Ağ Bağdaştırıcısında (Ethernet veya Wi-Fi) ve tıklayın <strong> Ayrıntılar </strong> . </p> <p><img src=\"images/image_thumb-8-177.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Aşağıdaki alanlara IP Adresi ayrıntılarını not edin ve ardından <strong> Kapat </strong> : </p> <ul> <li> IPv4 Adresi </li> <li> IPv4 Alt Ağ Maskesi </li> <li> IPv4 Varsayılan Ağ Geçidi </li> <li> IPv4 DNS Sunucusu </li> </ul> <p><img src=\"images/image_thumb-9-793.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Şimdi, tıklayın <strong> Özellikleri </strong> . </p> <p><img src=\"images/image_thumb-10-628.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> &#39;İnternet Protokolü Sürüm 4 (TCP/IPv4) </strong> &#39; ve tıklayın <strong> Özellikleri </strong></p> <p><img src=\"images/image_thumb-106-954.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 7. İnternet Protokolü Sürüm 4 (TCP/IPv4) özelliklerinde aşağıdaki ayarları uygulayın: </p> <p> A. Seç <strong> Aşağıdaki IP Adresini kullanın: </strong></p> <blockquote><p> 1. IP Adresi alanına bir yazın <strong> daha önce fark ettiğiniz IP Adresinden farklı IP Adresi </strong> . (Yalnızca son sayıyı daha yüksek bir değerle değiştirin). <br> 2. Dosyalanan Alt ağ maskesinde, daha önce fark ettiğinizle aynı Alt Ağ IP Adresini yazın. <br> 3. Varsayılan Ağ Geçidi&#39;nde, daha önce fark ettiğinizle aynı Varsayılan Ağ Geçidini yazın. </p></blockquote> <p> B. Seç <strong> Aşağıdaki DNS sunucu adreslerini kullanın </strong> : </p> <blockquote><p> 1. Tercih Edilen DNS Sunucusu&#39;na daha önce fark ettiğiniz DNS Adresini yazın. </p></blockquote> <p> C. Bittiğinde, tıklayın <strong> TAMAM MI </strong> iki kez ve <strong> Kapat </strong> Bağdaştırıcının özelliklerini kapatmak için. </p> <blockquote> <p><img src=\"images/image_thumb-11-850.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 8. Şimdi Uzak Masaüstü bilgisayarına bağlanmayı deneyin. Sorun çözülmeli. </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}