{"title":"DÜZELTME: Bu aygıt, BitLocker&#39;da Güvenilir Platform Modülü kullanamaz. (Çözüldü)","content":"<p> Windows 10 Pro veya Enterprise bilgisayarda, aşağıdaki hata görüntülenebilir: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> İşletim Sistemi sürücüsünde BitLocker sürücü şifrelemesini açın </a> : &quot;Bu cihaz bir Güvenilir Platform Modülü kullanamaz. Yöneticiniz, OS birimleri için &quot;Başlangıçta ek kimlik doğrulama iste&quot; ilkesinde &quot;Uyumlu bir TPM olmadan BitLocker&#39;a izin ver&quot; seçeneğini ayarlamalıdır. </p> <p><img src=\"images/image_thumb-30-150.png\" alt=\"This device can't use a Trusted Platform Module in BitLocker\" loading=\"lazy\"></p> <p> Bu eğitici, aşağıdaki BitLocker hatasını çözmek için talimatlar içerir: Windows 10 Pro ve Enterprise Sürümlerinde &quot;Bu cihaz bir Güvenilir Platform Modülü kullanamaz...&quot;. </p> <h4> Nasıl Düzeltilir: Bit Locker&#39;da &quot;Bu aygıt Güvenilir Platform Modülü kullanamaz&quot; hatası. </h4> <p> BitLocker, Güvenilir Platform Modülü (TPM) sürüm 1.2 veya üzeri ile kullanıldığında en fazla korumayı sağlar. TPM modülü olmayan bir bilgisayarınız varsa, grup ilkesinde BitLocker için TPM gereksinimini devre dışı bırakmanız gerekir. Bunu yapmak için: </p> <p> 1. Windows&#39;a aynı anda basın <img src=\"images/image_thumb36-579.png\" alt=\"image\" loading=\"lazy\"> + <strong> $ </strong> Çalıştır komut kutusunu açmak için tuşlar. <br> 2. Tip <strong> gpedit.msc </strong> &amp; Basın <strong> Giriş. </strong></p> <p><img src=\"images/image_thumb-78-692.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Sol bölmede şuraya gidin: </p> <ul> <li><strong> Bilgisayar Yapılandırması\\Yönetim Şablonları\\Windows Bileşenleri\\ BitLocker Sürücü Şifrelemesi\\İşletim Sistemi Sürücüleri </strong></li> </ul> <p> 4. Ardından öğesine tıklayın <strong> Başlangıçta ek kimlik doğrulaması gerektir </strong> sağ bölmede. </p> <p><img src=\"images/image_thumb-31-186.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Tıklayın <strong> Etkin </strong> ve sonra kontrol edin <strong> Uyumlu bir TPM olmadan BitLocker&#39;a izin ver </strong> onay kutusu. <strong><br> </strong> 6. Tıklayın <strong> TAMAM MI </strong> ve <strong> kapat </strong> Grup İlkesi Düzenleyicisi. </p> <p><img src=\"images/image_thumb-32-380.png\" alt=\"Allow BitLocker without compatible Trusted Platform Module\" loading=\"lazy\"></p> <p> </p> <p> 7. İşiniz bitti! İşletim sistemi sürücüsünde herhangi bir sorun olmadan BitLocker korumasını etkinleştirmeye devam edin. </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}