{"title":"DÜZELTME: DPC WATCHDOG İHLALİ BSOD HATASI. (Çözüldü)","content":"<p> Windows 10, 8 veya 7 tabanlı bir bilgisayarda aşağıdaki BSOD hatası görünebilir: &quot;DPC_WATCHDOG_VIOLATION&quot;. Mavi ekran sorunu &quot;DPC WATCHDOG İHLALİ&quot;, sistem boşta olsa ve genellikle geçersiz veya hasarlı bir aygıt sürücüsünden kaynaklansa ve diğer bazı durumlarda özellikle Grafik kartıyla ilgili donanım sorunlarıyla ilgili olsa bile zaman zaman meydana gelir. </p> <p><img src=\"images/image_thumb-2-618.png\" alt=\"FIX DPC WATCHDOG VIOLATION BLUE SCREEN ERROR\" loading=\"lazy\"></p> <p> </p> <p> Bu sorun giderme kılavuzu, sorunu çözmek için çeşitli yöntemler içerir. <strong> DPC WATCHDOG İHLALİ </strong> Windows 10, 8/8.1 veya 7 işletim sisteminde BSOD sorunu. </p> <p> </p> <h2> Windows 10/8/7&#39;de DPC WATCHDOG İHLALİ BoSD Sorunu Nasıl Düzeltilir. </h2> <p> Mavi ekran sorunu DPC WATCHDOG İHLALİ çeşitli nedenlerle ortaya çıkabilir; hatalı aygıt veya yazılım sürücüleri, hasarlı RAM veya Disk sürücüsü vb. Bu nedenle, &quot;DPC WATCHDOG İHLALİ&quot; BSOD sorununu çözmek için aşağıdaki adımları izleyin: </p> <h6> Yöntem 1. Sisteminizi Virüslere ve Kötü Amaçlı Yazılımlara karşı tarayın. </h6> <p> &quot;DPC WATCHDOG İHLALİ&quot; mavi ekran sorununu çözmenin ilk adımı, sisteminizin virüs/kötü amaçlı yazılım içermediğinden emin olmaktır. Bu görev için bu kılavuzdaki talimatları izleyin: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Bilgisayarınızı Virüslere ve Diğer Kötü Amaçlı Programlara Karşı Nasıl Tararsınız. </a></p> <p> </p> <h6> Yöntem 2. Antivirüs/Güvenlik Yazılımınızı kaldırın. </h6> <p> &quot;DPC WATCHDOG İHLALİ&quot; mavi ekran sorunu, Antivirüs/Güvenlik programınızın otomatik olarak güncellenmesinden sonra (özellikle AVAST veya AVG kullanıyorsanız) neden olabilir. Bu nedenle, devam edin ve virüsten koruma programınızı sisteminizden tamamen kaldırın ve bilgisayarınızı yeniden başlatın. <br> – BSOD sorunu, virüsten koruma yazılımının kaldırılmasından sonra oluşmazsa, güvenlik yazılımınızın en son sürümünü indirip sisteminize yeniden yüklemeye devam edin. </p> <p> </p> <h6> Yöntem 3. Windows&#39;u Temiz Önyükleme Durumunda başlatın. </h6> <p> &quot;DPC WATCHDOG İHLALİ&quot; BSOD sorununu çözmek için bir sonraki yöntem, Windows&#39;u bir <a href=\"https://www.repairwin.com/how-to-start-windows-in-clean-boot-state/\" target=\"_blank\" rel=\"nofollow noopener\"> &quot;temiz çizme </a> &quot; durumu, hangi programın sisteminizin çökmesine neden olduğunu belirlemek için. </p> <p> Windows&#39;u Temiz Önyükleme durumunda başlatmak için: </p> <p> 1. Windows&#39;a basın <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> $ </strong> Çalıştır komut kutusunu açmak için tuşlar. <br> 2. Tip <strong> msconfig </strong> ve bas <strong> Giriş </strong> . </p> <p><img src=\"images/image_thumb-47-307.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. Hizmetler sekmesinde, <strong> Bütün Microsoft Servisleri&#39;ni gizle </strong> onay kutusunu seçin ve ardından <strong> Hepsini etkisiz hale getir </strong> Microsoft dışındaki tüm hizmetlerin Windows başlangıcında başlamasını önlemek için </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-257.png\" alt=\"clean boot state\" loading=\"lazy\"></p> <p> 4. Ardından <strong> Başlamak </strong> sekme ve <strong> devre dışı bırak </strong> Windows başlangıcında başlayan ve arka planda çalışan diğer tüm programlar. * </p> <p> * Not: Açık <strong> Windows 10 </strong> veya <strong> 8 </strong> , seç <strong> Görev Yöneticisini Aç </strong> başlangıç ​​programlarını devre dışı bırakmak için. </p> <p><img src=\"images/image_thumb-29-129.png\" alt=\"Windows clean boot\" loading=\"lazy\"></p> <p> </p> <p> 5. Bittiğinde, tıklayın <strong> TAMAM MI </strong> ve <strong> Tekrar başlat </strong> senin bilgisayarın. <br> 6. Yeniden başlattıktan sonra bilgisayarınız düzgün ve BSOD sorunları olmadan çalışıyorsa, Sistem Yapılandırma yardımcı programını yeniden başlatın ve devre dışı bırakılan tüm öğeleri tek tek etkinleştirin ve hangisinin BSoD sorununa neden olduğunu bulana kadar sisteminizi yeniden başlatın. * </p> <p> * Not tutmak <strong> çıkış </strong> itibaren <strong> Temiz çizme </strong> durumunda, Sistem Yapılandırma yardımcı programını başlatın ve <strong> Genel </strong> Sekme seçimi <strong> Normal başlangıç. </strong></p> <p> </p> <h6> Yöntem 4. Sorunlar için Belleği (RAM) ve Sabit Diski (HDD) denetleyin. </h6> <p> Mavi Ekran Sorunları, hasarlı bir RAM modülünden veya bozuk bir sabit sürücüden kaynaklanabilir. RAM ve HDD bileşenlerinizde sorun olup olmadığını test etmek ve tanılamak için bu kılavuzlardaki talimatları izleyin: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Memtest86+ ile Bilgisayar Belleği sorunları nasıl teşhis edilir </a></li> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Sabit Diskin Sağlığını Kontrol Etmek İçin En İyi Sabit Disk Test ve Tanılama Araçları </a></li> </ul> <p> </p> <p> </p> <h6> Yöntem 5. Görüntü ve Ağ Sürücülerini Güncelleyin. </h6> <p> Bazı durumlarda, BSOD sorunu &quot;DPC WATCHDOG İHLALİ&quot;, geçersiz veya bozuk bir aygıt sürücüsü nedeniyle oluşur. Bu nedenle, devam edin ve bilgisayarınızdaki aşağıdaki cihazların sürücülerini güncelleyin: * </p> <p> 1. Grafik Bağdaştırıcısı (VGA). <br> 2. Ethernet Adaptörü ve Wi-Fi adaptörü (varsa). </p> <p> * Notlar: <br> 1. BSOD sorunu devam ederse, yukarıdaki sürücüleri güncelledikten sonra devam edin ve sisteminizdeki diğer tüm sürücüleri (Yonga Seti, Ses sürücüleri vb.) güncelleyin. <br> 2. Katı Hal Sürücünüz (SSD) varsa, bazı durumlarda &quot;DPC_WATCHDOG_VIOLATION&quot; hatası oluşabilir. Bu nedenle, bir SSD sürücünüz varsa, devam edin ve sürücüdeki bellenimi güncelleyin. SSD üretici yazılımının nasıl güncellendiğine ilişkin talimatlar için SSD üreticinizin web sitesine bakın. </p> <p> </p> <h6> Yöntem 6. iaStor.sys Sürücüsünü güncelleyin. </h6> <p> 1. Aygıt Yöneticisi&#39;ne gidin. <br> 2. IDE ATA/ATAPI Denetleyicilerini genişletin. <br> 3. çift tıklayın <strong> SATA/AHCI Denetleyicisi </strong> . </p> <p><img src=\"images/image_thumb-3-252.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. <strong> sürücü </strong> sekmesini ve tıklayın <strong> Sürücü Ayrıntıları </strong> . </p> <p><img src=\"images/image_thumb-4-105.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> iaStor.sys sürücüsü </strong> , ardından tıklayın <strong> TAMAM MI </strong> ve aşağıda belirtildiği gibi sürücüyü değiştirmeye devam edin, aksi takdirde kalan adımları atlayın. </p> <p><img src=\"images/image_thumb-5-421.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Tıklayın <strong> Sürücüyü güncelle </strong> . </p> <p><img src=\"images/image_thumb-6-840.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Seç <strong> Sürücü yazılımı için bilgisayarıma göz atın </strong> . </p> <p><img src=\"images/image_thumb-7-251.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Tıklayın <strong> Bilgisayarımdaki aygıt sürücüleri listesinden seçim yapmama izin ver </strong> . </p> <p><img src=\"images/image_thumb-8-330.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Vurgulayın <strong> Standart SATA AHCI Denetleyicisi </strong> ve tıklayın <strong> Sonraki </strong> . <br> 10. Sürücü kurulumu tamamlandığında, <strong> kapat </strong> tüm açık pencereler ve <strong> tekrar başlat </strong> senin bilgisayarın. </p> <p> </p> <h6> Yöntem 7. <strong> Analiz et: Minidump. </strong></h6> <p> Windows mavi ekranla çöktüğünde, BSoD ekranının ayrıntılarını &quot; adlı küçük dosya(lar)da saklar. <strong> MiniDump </strong> &quot;. <strong> mini döküm </strong> dosya(lar), mavi ekran sorununu gidermenize ve çözmenize yardımcı olabilir. Bu görevi gerçekleştirmek için bu makaledeki yönergeleri izleyin: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> BlueScreenView ile MiniDump Dosyaları Nasıl Analiz Edilir </a> . </p> <p> Bu kadar! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}