{"title":"DÜZELTME: İşlem sonlandırılamıyor. İşlem tamamlanamadı, Erişim reddedildi.","content":"<p> &quot;İşlem sonlandırılamıyor. İşlem tamamlanamadı, Erişim reddedildi&quot; hatası aldığınız için Windows&#39;ta bir işlemi veya hizmeti sonlandıramıyorsanız, sorunu nasıl çözeceğinizi öğrenmek için aşağıdaki okumaya devam edin. </p> <p><img src=\"images/image_thumb-10-874.png\" alt=\"Unable to terminate process. Access is denied\" loading=\"lazy\"></p> <p> Windows&#39;ta çalışan bir işlemi durdurmanın genel yolu, Görev Yöneticisi&#39;ni açmak, işlem adına sağ tıklayıp &#39;Görevi Sonlandır&#39;ı seçmektir. Ancak, bildiğiniz gibi, bazen &quot;İşlem sonlandırılamıyor. Erişim reddedildi&quot; mesajını aldığınız için bir işlemi durdurmak imkansızdır. </p> <p> Benzer şekilde, bir hizmeti durdurmak istiyorsanız ve yapamıyorsanız, &quot;Durdur&quot; seçeneği gri olduğundan veya durdurmaya çalışırken &quot;Hizmet durdurulamıyor. Erişim reddedildi&quot; hatası aldığınız için benzer bir sorunla karşılaşabilirsiniz hizmet. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"Unable to Terminate Service\" loading=\"lazy\"></p> <p> Bu öğreticide, normal yöntemlerle sonlandıramayacağınız herhangi bir hizmeti veya işlemi nasıl sonlandıracağınızı öğreneceksiniz. </p> <h4> Windows 10/8/7 İşletim Sisteminde PowerShell&#39;den Herhangi Bir Hizmeti veya Programı Durdurmaya Zorlama. </h4> <ul> <li><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> PowerShell&#39;den Herhangi Bir Uygulamayı Kapatmaya Zorlama. </a></li> <li><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> PowerShell&#39;den Herhangi Bir Hizmeti Kapatmaya Zorlama. </a></li> </ul> <h6></h6> <h6> Bölüm 1. PowerShell&#39;den Bir Uygulama Nasıl Sonlandırılır. </h6> <p> 1. PowerShell&#39;i Yönetici olarak açın. </p> <p> 2. PowerShell&#39;de işlem kimliğini (PID) almak için aşağıdaki komutu yazın. </p> <ul> <li><strong> görev listesi </strong></li> </ul> <p><img src=\"images/image_thumb-12-275.png\" alt=\"Terminate process from powershell\" loading=\"lazy\"></p> <p> </p> <p> 3. Silmek istediğiniz uygulamanın adını not edin ve uygulamanın tüm örneklerini kapatmak için aşağıdaki komutu yazın. * </p> <ul> <li> Durdurma İşlemi -Adı &quot;Uygulama_Adı&quot; </li> </ul> <p> * Not: Application_Name alanında, .exe uzantısı olmadan uygulamanın adını yazın. Örneğin, &quot;chrome.exe&quot; uygulamasını kapatmaya zorlamak istiyorsanız şunu yazın: </p> <ul> <li><em> İşlemi Durdur -Adı &quot;chrome&quot; </em></li> </ul> <p><img src=\"images/image_thumb-16-974.png\" alt=\"Stop Program PowerShell\" loading=\"lazy\"></p> <p> </p> <p><strong> İPUCU: </strong> Bir programın tek bir örneğini sonlandırmak istiyorsanız, aşağıdaki komutu yazın: </p> <ul> <li> Durdurma İşlemi -ID PID </li> </ul> <p> * Not: PID&#39;de program örneğinin benzersiz numarasını yazın. </p> <p> </p> <h6> Bölüm 2. PowerShell&#39;den Bir Hizmet Nasıl Sonlandırılır. </h6> <p> 1. Görev yöneticisini açın ve <strong> Hizmetler </strong> sekmesine dikkat edin <strong> PID </strong> durdurmak istediğiniz hizmetin </p> <p><em> Örneğin. Bu örnekte &quot;AdobeARMservice&quot; hizmetini PID ile durdurmaya zorlayacağız. <strong> 1640 </strong> . </em></p> <p><img src=\"images/image_thumb-14-150.png\" alt=\"Force Stop Service PowerShell\" loading=\"lazy\"></p> <p> </p> <p> 2. Ardından, çalıştırın <strong> Yönetici olarak PowerShell </strong> ve şu komutu yazın: </p> <ul> <li> kill -id PID </li> </ul> <p> * Not: Görev Yöneticisi&#39;nde fark ettiğiniz PID&#39;yi PID olarak yazın. Bu örnekte komut şöyle olacaktır: </p> <ul> <li><em> öldür -id 1640 </em></li> </ul> <p><img src=\"images/image_thumb-15-147.png\" alt=\"Kill Running Service from PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}