{"title":"DÜZELTME: Viber, Yahoo ve diğer Uygulamalar Android Cihazlarda Kilitleniyor – Mart 2021 (Çözüldü).","content":"<p> Son birkaç saat içinde birkaç kullanıcı, birçok Android uygulamasının kilitlendiğini bildirdi (22 Mart 2021). Özellikle Gmail, Viber, Google Chrome ve diğer önemli uygulamalar açıldıktan hemen sonra açılıp kapanmıyor. Sorun birçok Android cihazı ve özellikle Samsung&#39;un cihazlarını etkiliyor. Benzer bir sorunla karşılaşırsanız, nasıl düzelteceğinizi öğrenmek için aşağıdaki okumaya devam edin. </p> <p> Güncelleme (23 Mart 2021): Google sorunu çabucak tespit etti ve <strong> Android Web Görünümü </strong> app suçluydu ve kendisi ve diğer Chrome uygulamaları için güncellemeleri zorlayarak düzeltti. </p> <h4> Nasıl Düzeltilir: Android Google Apps, Viber vb. Kilitlenme sorunu (22 Mart 2021). </h4> <p> 1. Android&#39;i açın <strong> Ayarlar. </strong></p> <p> 2. dokunun <strong> Uygulamaları yönet </strong> (veya <strong> Uygulamalar ve Bildirimler </strong> veya <strong> Uygulamalar </strong> bazı Android cihazlarda). </p> <p><img src=\"images/image_thumb-27-815.png\" alt=\"FIX: Android Apps are Crashing on Samsung or other Devices.\" loading=\"lazy\"></p> <p> </p> <p> 3. Menüye tıklayın. <strong> üç nokta </strong><img src=\"images/image_thumb-28-382.png\" alt=\"image\" loading=\"lazy\"> sağ üst köşede ve öğesini seçin <strong> Tüm uygulamaları göster </strong> (veya <strong> Sistem uygulamalarını göster </strong> ). </p> <p><img src=\"images/image_thumb-29-272.png\" alt=\"FIX Android GMAIL or Viber Crash \" loading=\"lazy\"></p> <p> </p> <p> 3. Bulun <strong> Android Sistem Web Görünümü </strong> uygulama (veya <strong> Android Web Görünümü </strong> ) listeye girin ve açın. </p> <p><img src=\"images/image_thumb-30-842.png\" alt=\"FIX GMAIL Chrome or Viber Crash on Android - March 2021\" loading=\"lazy\"></p> <p> </p> <p> 4. Tıklayın <strong> Güncellemeleri kaldır. </strong></p> <p><img src=\"images/image_thumb-31-471.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. dokunun <strong> TAMAM MI </strong> uyarı mesajında. </p> <p> 6. <strong> Tekrar başlat </strong> cihazınız ve sorun gitmiş olmalı. </p> <p> Hepsi bu kadar millet! Hangi yöntem işinize yaradı? Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}