{"title":"DÜZELTME: HP Akıllı Hata – Yazıcı Durumu bilinmiyor (Çözüldü)","content":"<p> Bu eğitici, sorunu çözmek için talimatlar içerir. <a href=\"https://www.hpsmart.com/us/en\" target=\"_blank\" rel=\"nofollow noopener\"> HP Akıllı </a> Windows 10 işletim sisteminde &quot;Yazıcı Durumu bilinmiyor&quot; uygulama hatası. HP SMART uygulamasındaki &quot;Yazıcı Durumu bilinmiyor&quot;, bilinmeyen nedenlerle görünebilir ve kullanıcının yazıcıdaki Tarama veya Yazdırma işlevini kullanmasını engeller. </p> <p> Ayrıntılarda sorun: HP yazıcı yüklü bir Windows 10 bilgisayarda, yazıcının Web&#39;den veya diğer uygulamalardan sorunsuz bir şekilde yazdırmasına rağmen HP Smart uygulamasında &quot;Yazıcı Durumu bilinmiyor&quot; hatası görünüyor. Bu hatayla ilgili temel sorun, kullanıcının bir belgeyi taramak için HP Smart uygulamasındaki TARAMA seçeneğini kullanamamasıdır. </p> <p> </p> <p> </p> <p><img src=\"images/image_thumb-23-787.png\" alt=\"FIX: HP Smart \" printer status unknown loading=\"lazy\"></p> <h4> DÜZELTME: HP Smart Uygulamasında &quot;Yazıcı Durumu bilinmiyor&quot;. (Windows 10). </h4> <p> 1. Başlat menüsünden <img src=\"images/image_thumb2_thumb_thumb-697.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> Ayarlar&#39;ı tıklayın <img src=\"images/image_thumb-66-822.png\" alt=\"image\" loading=\"lazy\"> ve sonra aç <strong> Uygulamalar </strong> . </p> <p><img src=\"images/image_thumb-25-257.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. üzerine tıklayın <strong> HP Akıllı uygulaması </strong> ve ardından tıklayın <strong> Gelişmiş seçenekler </strong> . </p> <p><img src=\"images/image_thumb-26-912.png\" alt=\"FIX: Printer Status unknown on HP Smart app\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. <strong> Sıfırla </strong> buton. </p> <p><img src=\"images/image_thumb-27-494.png\" alt=\"Fix Printer Status Unknow on HP Smart app\" loading=\"lazy\"></p> <p> 4. Sıfırlama tamamlandığında tüm pencereleri kapatın ve <strong> HP Akıllı </strong> uygulama. <br> 5. Normalde &quot;Yazıcı Durumu bilinmiyor&quot; hatası çözülmelidir. sadece tıklayın <strong> Kurulum </strong> düğmesine basarak tüm HP Smart özelliklerini etkinleştirin ve işiniz bitti! * </p> <p><img src=\"images/image_thumb-28-849.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Not: HP Smart &quot;Yazıcı Durumu bilinmiyor&quot; hatası devam ederse, aşağıdakileri deneyin: </p> <blockquote><p> 1. <strong> Kapat </strong> bilgisayar. <br> 2. <strong> bağlantıyı kes </strong> <strong> yazıcıdan güç kablosu </strong> 1 dakika için. <br> 3. 1 dakika sonra, <strong> açık </strong> sizin <strong> bilgisayar </strong> . <br> 4. Windows 10&#39;a önyükleme yaptıktan sonra, <strong> yazıcının güç kablosunu yeniden bağlayın </strong> ve HP Smart uygulamasındaki &quot;Yazıcı Durumu bilinmiyor&quot; hatasının çözülüp çözülmediğini kontrol edin. Hata devam ederse, yazıcıyı ve yazıcının yazılımını bilgisayarınızdan kaldırıp yeniden yükleyin. </p></blockquote> <p> Hepsi bu kadar millet! Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}