{"title":"DÜZELTME: Adobe Reader DC – Farklı Kaydet boş (Çözüldü)","content":"<p> Adobe Reader DC otomatik güncellemesinden sonra aşağıdaki sorun oluştu: &quot;Farklı Kaydet&quot; özelliği, kullanıcının PDF belgesini kaydetmesine izin vermeyen boş (boş) bir pencere (boş) görüntüler. </p> <p><img src=\"images/image_thumb-38-290.png\" alt=\"Adobe Reader DC - Save As is blank - fix\" loading=\"lazy\"></p> <p> Bu öğretici, aşağıdaki sorunu çözmek için talimatlar içerir: &quot;Farklı Kaydet&quot; özelliği, Windows veya MAC OS&#39;de Adobe Reader DC&#39;de çalışmaz. </p> <h4> DÜZELTME: Adobe Reader DC&#39;de Farklı Kaydet seçeneği boştur. </h4> <h6> Yöntem 1. Sisteminizi Virüslere ve Kötü Amaçlı Yazılımlara karşı tarayın. </h6> <p> Outlook&#39;ta &quot;eksik klasörler&quot; sorununu çözmenin ilk adımı, sisteminizin virüs/kötü amaçlı yazılım içermediğinden emin olmaktır. Bu görev için bu kılavuzdaki talimatları izleyin: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Bilgisayarınızı Virüslere ve Diğer Kötü Amaçlı Programlara Karşı Nasıl Tararsınız. </a></p> <p> </p> <h6> Yöntem 2. Dosyaları kaydederken Çevrimiçi Depolamayı devre dışı bırakın. </h6> <p> 1. Adobe Reader DC&#39;den <strong> Düzenle </strong> menü tıklaması <strong> Tercihler </strong> . </p> <p><img src=\"images/image_thumb-39-749.png\" alt=\"save as not working fix in Adobe Reader DC\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> İşareti kaldırın </strong> <strong> Dosyaları kaydederken çevrimiçi depolamayı göster </strong> ve tıklayın <strong> TAMAM MI. * </strong></p> <p> * Not: İsteğe bağlı olarak, &quot;Dosyaları açarken çevrimiçi depolamayı göster&quot; özelliğinin işaretini de kaldırın. </p> <p><img src=\"images/image_thumb-40-312.png\" alt=\"save as blank - abobe reader DC - fix\" loading=\"lazy\"></p> <p> </p> <p> 3. Şimdi Adobe DC&#39;de Farklı Kaydet özelliğini kullanmayı deneyin. Sorun çözülmeli. </p> <p> </p> <h6> Yöntem 3. Adobe Reader DC&#39;yi kaldırın ve yeniden yükleyin. </h6> <p> Adobe DC&#39;deki &#39;Farklı Kaydet&#39; özelliğindeki boş pencereleri çözmenin son yöntemi, Adobe Reader DC&#39;yi tamamen kaldırmak ve ardından programın en son sürümünü buradan indirip yeniden yüklemektir. <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> İşte </a> . </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}