{"title":"DÜZELTME: Chrome Her Zaman Misafir Olarak Göz At - Başlangıçta Kişi Değiştir seçeneklerini açın.","content":"<p> Eğitici, Chrome&#39;un başlangıçta &quot;Kişi Değiştir - Misafir Olarak Göz At&quot; penceresini görüntülemesinin nasıl önleneceğine ilişkin talimatlar içerir. Ayrıntılarda sorun: Windows tabanlı bir bilgisayarda, Google Chrome tarayıcısı başlangıçta her zaman &quot;Misafir Olarak Gözat&quot; ve &quot;Kişi ekle&quot; seçeneklerini açar ve kullanıcının Chrome tarayıcısını kullanmak için her zaman profilini seçmesi gerekir. </p> <p><img src=\"images/image_thumb-26-805.png\" alt=\"FIX Remove Chrome Browse as Guest\" loading=\"lazy\"></p> <p> </p> <h4> Chrome Başlangıcında &quot;Misafir Olarak Tarayıcı - Kişi Ekle&quot; seçenekleri penceresi nasıl kaldırılır. </h4> <h6> Yöntem 1. Chrome&#39;un Misafir Tarama Modunda Her Zaman Başlatılacak şekilde Ayarlanıp Ayarlanmadığını kontrol edin. </h6> <p> Google Chrome tarayıcısının en kullanışlı özelliklerinden biri, özellikle bilgisayarınızı başkalarıyla paylaşıyorsanız veya yer işaretlerinizi ve ayarlarınızı birden çok hesabınız arasında ayırmak istiyorsanız, birden çok kullanıcı profili oluşturmaktır. Bu durumda, Chrome kısayoluna aşağıdaki anahtarlardan (metin girişlerinden) birini ekleyerek Chrome&#39;u her zaman &quot;Kişi Değiştir&quot; penceresiyle başlatabilirsiniz: </p> <ul> <li><strong> –profile-directory=&quot;Misafir Profili&quot; </strong></li> <li><strong> -bwsi </strong></li> </ul> <p> </p> <p> Her şeyden önce, Chrome&#39;un her zaman &quot;Kişi Değiştir/Misafir Olarak Göz At&quot; penceresini açacak şekilde ayarlanıp ayarlanmadığını kontrol edin. Bunu yapmak için: </p> <p> 1. Google Chrome&#39;u kapatın. <br> 2. Masaüstünüzdeki Chrome Kısayoluna sağ tıklayın ve <strong> Özellikleri </strong> . <br> 3. <strong> Kısayol </strong> sekmesine bakın <strong> Hedef </strong> metin kutusu ve (varsa) <strong> Kaldır </strong> sonunda yukarıdaki metin girişlerini ve ardından <strong> TAMAM MI </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-27-916.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Chrome&#39;u başlatın ve &quot;Kişi Değiştir&quot; penceresinde profil simgenize/resme (&quot;Siz&quot;) tıklayın. <br> 5. <strong> Tekrar başlat </strong> Krom. </p> <p> </p> <h6> Yöntem 2. Yeni Bir Temiz Google Chrome Profili Oluşturun. </h6> <p> Varsayılan olarak Chrome, tüm Profil ayarlarını (yer imleri, şifreler, uzantılar vb.) bilgisayarınızda aşağıdaki konumda bulunan &quot;Kullanıcı Verileri&quot; klasöründe saklar: </p> <ul> <li><strong> C:\\Users\\%Kullanıcı Adı%\\AppData\\Local\\Google\\Chrome\\Kullanıcı Verileri </strong></li> </ul> <p> Herhangi bir nedenle Chrome Profili klasörü kötü amaçlı yazılım tarafından bozulursa veya uygunsuz şekilde değiştirilirse, sahip olduğunuz en iyi seçenek Chrome&#39;u yeni (boş*) bir Chrome profil klasörü oluşturmaya zorlamak olacaktır. Bunu yapmak için: </p> <p><strong> * Dikkat: </strong> Chrome profil depolama klasörünüzü silerek, saklanan tüm verileri (Yer İşaretleri, Ayarlar, Uzantılar, Geçmiş vb.) sileceğinizi unutmayın. Bu nedenle, Chrome profilinizi silmeden önce bir <a href=\"https://www.repairwin.com/backup-restore-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> Chrome yer işaretlerinizin yedeği </a> Chrome&#39;u yeniden yüklemek istemeniz durumunda. </p> <h5> Adım 1: Gizli dosya ve klasörler görünümünü etkinleştirin. </h5> <p> 1. Aç <strong> Dosya seçenekleri </strong> . <br> 2. <strong> Görünüm </strong> sekme, <strong> Kontrol </strong> <strong> Gizli dosyaları, klasörleri ve sürücüleri göster </strong> onay kutusunu işaretleyin ve tıklayın <strong> TAMAM MI. </strong></p> <p><img src=\"images/image_thumb-6-189.png\" alt=\"enable hidden files folders\" loading=\"lazy\"></p> <h6></h6> <h5> Adım 2. Chrome&#39;u Yeni (Temiz) Bir Profil Klasörü Oluşturmaya Zorlayın. </h5> <p> 1. <strong> Kapat </strong> Google Chrome. <br> 2. <strong> Açık </strong> Windows Gezgini ve şu konuma gidin: </p> <ul> <li><strong> C:\\Users\\%USERNAME%\\AppData\\Local\\Google\\Chrome\\ </strong></li> </ul> <p> * %USERNAME% = Kullanıcı Adınız. (örneğin, kullanıcı adınız &quot;Yönetici&quot; ise şu yola gitmeniz gerekir: &quot;C:\\Users\\Admin\\AppData\\Local\\Google\\Chrome&quot;) </p> <p> 3. <strong> Adını değiştirmek </strong> &quot;User Data&quot; klasörünü &quot;User Data.BAK&quot; klasörüne atın. </p> <p><img src=\"images/image_thumb-28-373.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Şimdi Google Chrome&#39;u açın. (Başlangıç ​​sırasında Chrome, yer işaretlerinizi ve ayarlarınızı depolamak için otomatik olarak yeni ve temiz bir &quot;Kullanıcı Verileri&quot; klasörü oluşturur). </p> <p> </p> <h6> Chrome sorunlarını Çözmek için Ek Yöntemler. </h6> <p><strong> 1. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Bilgisayarınızda virüs, kötü amaçlı yazılım vb. olup olmadığını kontrol edin. </a></p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Chrome&#39;u tamamen kaldırıp yeniden yükleyin. </a></p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}