{"title":"DÜZELTME: Chrome Yüksek Bellek Kullanımı sorunu (Çözüldü)","content":"<p> Fark etmiş olabileceğiniz gibi, Google Chrome, yalnızca birkaç Chrome penceresi/sekmesi açmış olsanız bile birçok arka plan işlemini açar. Bunun nedeni, Google Chrome&#39;un yeni bir pencere veya sekme açtığınızda yüklenen her eklenti veya uzantı için ayrı bir işlem oluşturacak şekilde tasarlanmasıdır. </p> <p> Google Chrome&#39;dan birden çok işlemin açılması normal bir davranış olsa da aslında bu bir sorundur, çünkü bu davranış çok fazla bellek kullanımına neden olur ve bilgisayarı yanıtsız hale getirir. </p> <p><img src=\"images/image_thumb-17-610.png\" alt=\"FIX: Multiple Processes in Chrome with High Memory Usage\" loading=\"lazy\"></p> <p> </p> <p> Bu eğitici, Chrome&#39;un yüksek bellek kullanımı sorununu çözmek için Chrome&#39;un her pencere veya sekme için birden çok işlem açmasını nasıl engelleyeceğiniz konusunda adım adım talimatlar içerir. </p> <h4> Windows 10&#39;da Birden Çok Chrome İşlemi Nasıl Devre Dışı Bırakılır. </h4> <h6> Adım 1. Bilgisayarınızı Kötü Amaçlı Yazılım ve Virüslere karşı tarayın. </h6> <p> Chrome&#39;daki &quot;ERR_CONNECTION_CLOSED&quot; hatasını gidermeden önceki ilk adım, sisteminizin virüs/kötü amaçlı yazılım içermediğinden emin olmaktır. Bu görev için bu kılavuzdaki talimatları izleyin: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Bilgisayarınızı Virüslere ve Diğer Kötü Amaçlı Programlara Karşı Nasıl Tararsınız. </a></p> <h6></h6> <h6> 2. Adım. İstenmeyen Chrome Uzantılarını Devre Dışı Bırakın. </h6> <p> Her şeyden önce, yüklü tüm Chrome uzantılarına ihtiyacınız olup olmadığını kontrol edin ve ihtiyacınız olmayanları devre dışı bırakın. Bunu yapmak için: </p> <p> 1. Chrome&#39;un menüsünden <img src=\"images/image_thumb-47-380.png\" alt=\"image\" loading=\"lazy\"> , git <strong> Diğer Araçlar </strong> -&gt; <strong> Uzantılar </strong></p> <p><img src=\"images/image_thumb-51-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. İhtiyacınız olmayan veya tanımadığınız tüm uzantıları kaldırın (veya devre dışı bırakın). </p> <p><img src=\"images/image_thumb-49-442.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> 3. Adım. Chrome Kapalıyken Chrome&#39;un Arka Planda Çalışmasını Önleyin. </h6> <p> 1. Chrome menüsünden <img src=\"images/image_thumb-78-665.png\" alt=\"image\" loading=\"lazy\"> seç <strong> Ayarlar </strong> . </p> <p><img src=\"images/image_thumb-79-868.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Ayarlar </strong> sayfayı aşağı kaydırın ve tıklayın <strong> ileri </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <p> 3. &quot;Google Chrome kapalıyken arka planda uygulamaları çalıştırmaya devam et&quot; anahtarını <strong> KAPALI </strong> . </p> <p><img src=\"images/image_thumb-18-557.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <p> </p> <h6> 4. Adım. Chrome&#39;un Aynı Site İçin Birden Çok İşlem Açmasını Önleyin. </h6> <p> 1, <strong> Sağ tık </strong> üzerinde <strong> Google Chrome </strong> kısayol ve seç <strong> Özellikleri </strong> . <br> 2. <strong> Genel </strong> sekmesinde, hedef satırın sonuna &quot; – site başına işlem&quot; (tırnak işaretleri olmadan) anahtarını ekleyin ve <strong> TAMAM MI </strong> ve <strong> Devam et </strong> değişikliği uygulamak için <strong> . * </strong></p> <p> Örneğin. &quot;C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe&quot; –site başına işlem </p> <p> Not: Site başına işlemden önce bir boşluk var </p> <p><img src=\"images/image_thumb-19-818.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Adım 5. Google Chrome Site İzolasyonunu devre dışı bırakın. </h6> <p> Site İzolasyonu modunda, Chrome her web sitesini kendi sürecinde yükler. Bu aslında bir web sitesinin başka bir pencereye/sekmeye açık olan başka bir web sitesinden verilerinizi çalmasını önlemek için ek bir güvenlik özelliğidir. Ancak &quot;Site İzolasyonu&quot; modu, Chrome&#39;un bellek kullanımını yaklaşık %10 oranında artıracaktır. </p> <p> 1. Chrome adres çubuğuna şunu yazın <a href=\"//flags/#site-isolation-trial-opt-out\" target=\"_blank\" rel=\"nofollow noopener\"> chrome://flags/#site-izolation-deneme-opt-out </a> ve enter&#39;a tıklayın. </p> <p> 2. <strong> Site izolasyonunu devre dışı bırak </strong> modu <strong> devre dışı </strong> ve ardından tıklayın <strong> Şimdi Yeniden Başlat </strong> . * </p> <p> * Not: </p> <p><img src=\"images/image_thumb-20-397.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? </p> <p> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}