{"title":"DÜZELTME: Windows 10&#39;da Dokunmatik Yüzey Çalışmıyor veya donuyor (Çözüldü)","content":"<p> Geçtiğimiz yıllarda birkaç dizüstü bilgisayarda Windows 10&#39;da birçok dokunmatik yüzey sorununu giderdim (örneğin, dokunmatik yüzey çalışmıyor, dokunmatik yüzey donuyor, vb.), bu yüzden bu sorunları gidermek için bir eğitim yazmaya karar verdim. </p> <p> Bir dizüstü bilgisayarınız varsa, zaman zaman dokunmatik yüzey aygıtıyla ilgili sorunlar yaşayabilirsiniz. Özellikle Windows 10&#39;unuz varsa, bir güncelleme yükledikten sonra dokunmatik yüzey genellikle çalışmayı durdurabilir veya düzgün çalışmayabilir. Elbette dokunmatik yüzey sorunları bir donanım sorununa işaret edebilir, ancak çoğu durumda dokunmatik yüzey arızaları bir yazılım sorunlarından kaynaklanır. </p> <p> Windows 10&#39;da dizüstü bilgisayarın dokunmatik yüzeyi çeşitli nedenlerle çalışmayabilir, bu nedenle bu eğitimde sorunu çözmeye yönelik tüm yöntemler ele alınacaktır. </p> <h2> Windows 10&#39;da Dokunmatik Yüzey Sorunları Nasıl Düzeltilir. </h2> <p> Dokunmatik ekran sorunlarını gidermek için aşağıdaki yöntemlerle ilerlemeden önce bu adımları izleyin. </p> <ol> <li> ALT + CTRL + DEL tuşlarına basarak Windows 10&#39;un donmadığından emin olun ve Görev Yöneticisi&#39;nin açılıp açılmadığına bakın. </li> <li> Dizüstü bilgisayarınızda dokunmatik yüzeyi devre dışı bırakmak ve etkinleştirmek için bir İşlev tuşu kombinasyonu varsa. (ör. Fn + F3), ardından dokunmatik yüzeyi açmak için Fn tuş bileşimine basın. (Bazı dizüstü bilgisayarlarda dokunmatik yüzey, dokunmatik yüzeyin yüzeyine iki kez dokunularak açılıp kapatılabilir) </li> <li> Bilgisayarı yeniden başlatın. </li> <li> Tam Windows 10 kapatma gerçekleştirin ve ardından dizüstü bilgisayarınızı yeniden açın. (Tam kapatma gerçekleştirmek için: <strong> VARDİYA </strong> tuşuna basın ve ardından tıklayın <strong> Başlat </strong> &gt; <strong> Güç </strong> &gt; <strong> Kapat </strong> ). </li> </ol> <p><strong> </strong></p> <h3> Yöntem 1. Windows 10&#39;da Dokunmatik Yüzeyi Etkinleştirin. </h3> <p> Windows 10, harici bir fare bağlandığında dokunmatik yüzeyi devre dışı bırakma veya kapatma özelliğine sahiptir. Bu nedenle, devam edin ve Dokunmatik Yüzey ayarlarında Dokunmatik Yüzeyin etkinleştirildiğinden emin olun. </p> <p> 1. Şuraya gidin: <strong> Başlat </strong><img src=\"images/image_thumb2_thumb_thumb-670.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menü -&gt; <strong> Ayarlar </strong> <img src=\"images/image_thumb-66-512.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Cihazlar. <br> </strong> 2. Seç <strong> Dokunmatik yüzey </strong> sol panelde ve sağda Dokunmatik Yüzey anahtarının olarak ayarlandığından emin olun. <strong> AÇIK </strong> ve ayrıca <strong> Kontrol </strong> <strong> Bir fare bağlandığında dokunmatik yüzeyi açık bırakın </strong> seçenek. * </p> <p><img src=\"images/image_thumb-38-467.png\" alt=\"Disable Touchpad Windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Not: Dokunmatik Yüzey geçiş/anahtarını burada bulamazsanız… </p> <p> 1. Aç <strong> Ek ayarlar </strong> altında <strong> İlgili ayarlar </strong> Bölüm. </p> <ul> <li> İlgili makale: <a href=\"https://www.repairwin.com/disable-touchpad-option-missing-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Windows 10&#39;da Eksik Dokunmatik Yüzey Seçeneği&#39;ni devre dışı bırakın. </strong></a></li> </ul> <p><img src=\"images/image_thumb-39-742.png\" alt=\"touchpad additional settings\" loading=\"lazy\"></p> <p> 2. Fare Özellikleri seçeneklerinde dokunmatik yüzeyi etkinleştirin. (Dokunmatik yüzey zaten etkinse, devre dışı bırakıp yeniden etkinleştirmeyi deneyin.) </p> <p><img src=\"images/image_thumb-31-122.png\" alt=\"enable touchpad windows 10\" loading=\"lazy\"></p> <h3> Yöntem 2. Windows 10&#39;da Dokunmatik Yüzey ayarlarını sıfırlayın. </h3> <p> Windows 10&#39;da dokunmatik yüzey sorunlarını çözmenin yaygın bir yöntemi, dokunmatik yüzey ayarlarını varsayılanlarına sıfırlamaktır. </p> <p> 1. Şuraya gidin: <strong> Başlat </strong><img src=\"images/image_thumb2_thumb_thumb-596.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menü -&gt; <strong> Ayarlar </strong> <img src=\"images/image_thumb-66-851.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Cihazlar. <br> </strong> 2. <strong> Dokunmatik yüzey </strong> seçenekler <strong> , </strong> aşağı kaydırın ve tıklayın <strong> Sıfırla </strong> altında <strong> Dokunmatik yüzeyinizi sıfırlayın. * </strong></p> <p><img src=\"images/image_thumb-40-277.png\" alt=\"reset touchpad windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Not: Göremiyorsanız, <strong> Sıfırla </strong> buton… </p> <p> 1. <strong> Ek ayarlar </strong> . <br> 2. tıklayın <strong> Cihazları Sıfırla </strong> Fare Özellikleri seçeneklerinde. </p> <p><img src=\"images/image_thumb-33-928.png\" alt=\"reset touchpad settings windows 10\" loading=\"lazy\"></p> <h3> Yöntem 3. Dokunmatik Yüzey aygıt sürücüsünü kaldırın ve yeniden yükleyin. </h3> <p> Windows 10&#39;daki dokunmatik yüzey sorunlarını çözmenin başka bir çözümü de dokunmatik yüzey sürücülerini tamamen kaldırıp yeniden yüklemektir. </p> <p> 1. Aç <strong> Aygıt Yöneticisi </strong> . Bunu yapmak için: </p> <blockquote><p> 1. Windows&#39;a basın <img src=\"images/image_thumb8_thumb_thumb-140.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> $ </strong> Çalıştır komut kutusunu açmak için tuşlar. <br> 2. &quot;Aç&quot; kutusuna şunu yazın: <strong> devmgmt.msc </strong> &amp; Tıklayın <strong> TAMAM MI </strong> . </p> <p><img src=\"images/image_thumb-5-568.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Fareleri ve diğer işaretleme aygıtlarını genişletin. <br> 3. <strong> Sağ tık </strong> üzerinde <strong> Dokunmatik Yüzey </strong> cihaz ve tıklayın <strong> Kaldır. </strong></p> <blockquote> <p><img src=\"images/image_thumb-34-656.png\" alt=\"uninstall touchpad windows 10\" loading=\"lazy\"></p> </blockquote> <p> 4. Yeniden başlattıktan sonra, Windows&#39;un dokunmatik yüzey sürücüsünü yeniden yüklemesi için 4-5 dakika bekleyin ve dokunmatik yüzeyinizin çalışıp çalışmadığını kontrol edin. Dokunmatik yüzeyiniz tekrar çalışmazsa, dizüstü bilgisayarınızın üreticisinin destek sitesinden sürücüsünü yüklemeyi deneyin. </p> <h3> Yöntem 4. BIOS&#39;ta Dokunmatik Yüzeyi Devre Dışı Bırakın ve Etkinleştirin. * </h3> <p> * Not: Bu yöntem tüm dizüstü bilgisayar modelleri için geçerli değildir, ancak birçok ASUS dizüstü bilgisayarda çalıştığını biliyorum. </p> <p> 1. Tıklarken SHIFT tuşunu basılı tutarak dizüstü bilgisayarınızı tamamen kapatın. <strong> Başlat </strong> &gt; <strong> Güç </strong> &gt; <strong> Kapat </strong><br> 2. Dizüstü bilgisayarı açın ve BIOS ayarlarına girmek için ilgili İşlev tuşuna basın. (ör. F2, F10, vb.), <br> 3. BIOS ayarlarında, Dokunmatik Yüzey veya Dahili İşaretleme Aygıtı veya İzleme Dörtgeni aygıtı için bir ayar olup olmadığını kontrol edin (bu ayar genellikle &#39; <strong> ileri </strong> &#39; Bölüm). Öyleyse, <strong> devre dışı bırak </strong> <strong> dokunmatik yüzey cihazı </strong> ve <strong> Kaydet ve çık </strong> BIOS ayarlarından. <br> 4. Windows 10&#39;un yüklenmesine izin verin. <br> 5. Dizüstü bilgisayarınızı tekrar kapatın ve açın. <br> 6. BIOS ayarlarına yeniden girin ve yeniden <strong> Dokunmatik Yüzeyi etkinleştir </strong> &amp; <strong> Kaydet çık </strong> . <br> 7. Windows 10&#39;a önyükleme yaptıktan sonra dokunmatik yüzey çalışmalıdır. </p> <p><strong> Sonuç: </strong> Yukarıdaki adımlardan sonra dokunmatik yüzeyiniz hala çalışmıyorsa, bu bir donanım sorunu olduğunu gösterir. Bu durumda, dokunmatik yüzey aygıtını onarmak için harici bir fare kullanın veya bir dizüstü bilgisayar tamirhanesine gidin. </p> <p> Hepsi bu kadar millet! Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}