{"title":"DÜZELTME: Outlook Eklentisi tüm kullanıcılar için Yüklenir ve kaldırılamaz. (Çözüldü)","content":"<p> Hata nedeniyle bir Outlook Eklentisini devre dışı bırakamaz veya etkinleştiremezseniz &quot; <em> Eklenti, bu bilgisayardaki tüm kullanıcılar için yüklenir ve yalnızca bir yönetici tarafından bağlanabilir veya bağlantısı kesilebilir. </em> &quot;, sorunu çözmek için aşağıdaki okumaya devam edin. </p> <p><img src=\"images/image_thumb-76-527.png\" alt=\"The add-is installed for all users on this computer, and can only be connected or disconnected by an administrator\" loading=\"lazy\"></p> <p> Eklentiyi yüklediğinizde, bilgisayardaki tüm kullanıcılar için yüklemeyi seçtiğiniz için &quot;Eklenti yalnızca Yönetici Tarafından Devre Dışı Bırakılabilir&quot; hatası görünür. Bu durumda, hatayı çözmenin tek çözümü, yönetici ayrıcalıklarını kullanarak eklentiyi kaldırmaktır. </p> <h2> Nasıl düzeltilir: Outlook, Word veya Excel&#39;deki tüm kullanıcılar için yüklendiğinden Eklenti Etkinleştirilemiyor veya Devre Dışı Bırakılamıyor. </h2> <p> Hata nedeniyle bir Microsoft Office uygulamasını bir Eklentiyi kaldıramaz veya etkinleştiremezseniz &quot; <em> Eklenti, bu bilgisayardaki tüm kullanıcılar için yüklenir ve yalnızca bir yönetici tarafından bağlanabilir veya bağlantısı kesilebilir&quot;, </em> ilgili uygulamayı Yönetici olarak başlatın ve Eklentiyi sorunsuz bir şekilde kaldırmaya devam edin. Bunu yapmak için: </p> <p><strong> 1. </strong> Yukarıda belirtilen hatayla karşılaştığınız (örn. Outlook) Office uygulamasına sağ tıklayın ve <strong> Yönetici olarak çalıştır. * </strong></p> <p> * Notlar: <strong><br> </strong> 1. &quot;Yönetici Çalıştır&quot; seçeneğini görmüyorsanız, <strong> VARDİYA </strong> anahtar ve <strong> sağ tık </strong> Office uygulamasında hatayla karşılaşırsınız. <br> 2. Windows 10&#39;dan Office uygulamasına sağ tıklarsanız <strong> Başlat </strong> Menü <img src=\"images/image_thumb2_thumb_thumb-340.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> programlar </strong> , git <strong> Daha </strong> &gt; <strong> Yönetici olarak çalıştır. </strong></p> <p><img src=\"images/image_thumb-77-661.png\" alt=\"FIX: Unable to Enable or Disable Add-in \" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Bu uygulamanın cihazınızda değişiklik yapmasına izin vermeniz istendiğinde <strong> Evet. </strong></p> <p><img src=\"images/image_thumb-78-120.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Office uygulamasını açtıktan sonra, istediğiniz Eklentiyi devre dışı bırakmak veya etkinleştirmek için ilerleyin. Bu sefer eklenti sorunsuz bir şekilde kaldırılacaktır. </p> <p> Bu kadar! Deneyiminizle ilgili yorumunuzu bırakarak bu kılavuzun size yardımcı olup olmadığını bana bildirin. Lütfen başkalarına yardımcı olmak için bu kılavuzu beğenin ve paylaşın. </p>"}