{"title":"DÜZELTME: 2016/2012 RDS Sunucusunda 120 Günlük Yetkisiz Kullanım Süresini Sıfırlayın.","content":"<p> Test amacıyla bir RDS Server 2016 kurduysanız ve RDS lisansı yetkisiz kullanım süresi sona erdiyse, 120 günlük yetkisiz kullanım süresinin nasıl sıfırlanacağını öğrenmek için aşağıdaki okumaya devam edin. RDS Server 2016&#39;yı kurduğunuzda bildiğiniz gibi, RD istemci erişim lisanslarını (RD CAL&#39;ler) kurmak için 120 gününüz vardır, aksi takdirde kullanıcılar artık RD Oturum Ana Bilgisayarı sunucusunda &quot;Uzak lisans sağlamak için kullanılabilir Uzak Masaüstü Lisans sunucusu olmadığından masaüstü oturumunun bağlantısı kesildi&quot;. </p> <p><img src=\"images/image_thumb-32-368.png\" alt=\"Reset 120 Days Grace Period on RDS Server 2012/2016\" loading=\"lazy\"></p> <p> </p> <h4> Sunucu 2012 veya 2016&#39;da RDS Lisansı Yetkisiz Kullanım Süresi Nasıl Sıfırlanır. * </h4> <p><strong> * Önemli: </strong> Aşağıdaki talimatları yalnızca RDS Server 2016&#39;yı bir test ortamında kullanıyorsanız uygulayın. RDS Sunucusunu bir üretim ortamında kullanmak istiyorsanız, devam edin ve RD CAL&#39;leri satın alın. </p> <p> RDS Lisans Sunucusunda 120 günlük Yetkisiz Kullanım Süresini uzatmak için: </p> <p> 1. Kayıt Defteri Düzenleyicisini açın ve aşağıdaki anahtarda gezinin: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal Sunucusu\\RCM\\GracePeriod </li> </ul> <p> 2. &#39;GracePeriod&#39; tuşuna sağ tıklayın ve <strong> İzinler. </strong></p> <p><img src=\"images/image_thumb-33-473.png\" alt=\"Reset Grace Period RDS 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Ardından tıklayın <strong> ileri </strong> . </p> <p><img src=\"images/image_thumb-34-585.png\" alt=\"Reset RDS Grace Period\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Yöneticiler </strong> nesne ve tıklayın <strong> Düzenle </strong> . </p> <p><img src=\"images/image_thumb-18-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. İzinleri şu şekilde değiştirin: <strong> Tam kontrol </strong> ve tıklayın <strong> TAMAM MI. </strong></p> <p><img src=\"images/image_thumb-19-737.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. &quot;L$RTMTIMEBOMB…&quot; değerine sağ tıklayın ve seçin <strong> Sil </strong> . </p> <p><img src=\"images/image_thumb-35-208.png\" alt=\"Reset RDS Licensing Grace Pariod\" loading=\"lazy\"></p> <p> </p> <p> 7. Kayıt Defteri Düzenleyicisini kapatın ve RDS Sunucusunu yeniden başlatın. </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}