{"title":"DÜZELTME: VeraCrypt Windows 10&#39;da Kaldırma İşleminde Yanıt Vermiyor (Donuyor) (Çözüldü)","content":"<p> Bu kılavuz, Windows 10 tabanlı bir bilgisayarda VeraCrypt ile ilgili aşağıdaki sorunu gidermek için yönergeler içerir: VeraCrypt yanıt vermiyor ve şifreli birimin bağlantısını keserken donuyor (kilitleniyor). </p> <p> VeraCrypt Yanıt Vermiyor (Donuyor) sorunu ayrıntılı olarak: Bir birimin bağlantısını kesmeye çalıştığınızda (takılı birimden tüm dosyalar kapalıyken), VeraCrypt askıda kalıyor ve &quot;Yanıt Vermiyor&quot; gösteriyor. Bu sorun göründüğünde, Windows&#39;u normal duruma döndürmenin tek yolu VeraCrypt işlemini Görev Yöneticisi&#39;nden sonlandırmaktır. </p> <p> Göre <a href=\"https://www.veracrypt.fr/en/Issues%20and%20Limitations.html\" target=\"_blank\" rel=\"nofollow noopener\"> VeraCrypt </a> donma sorunu, takma/sökme işlemleri sırasında görüntülenen VeraCrypt bekleme iletişim kutusu ile makinede yüklü olan diğer yazılımlar (örn. Antivirüs veya Güvenlik Duvarı) arasındaki çakışmadan kaynaklanır. </p> <h4> Nasıl düzeltilir: VeraCrypt Sökme/Montaj Hacmine Yanıt Vermiyor. </h4> <p> Bu sorun, takma/sökme işlemleri sırasında görüntülenen VeraCrypt bekleme iletişim kutusu ile makinede yüklü olan diğer yazılımlar (örn. Outpost Firewall Pro) arasındaki çakışmadan kaynaklanır. </p> <p> 1. VeraCrypt&#39;ten <strong> Ayarlar </strong> menü, seç <strong> Tercihler </strong> . </p> <p><img src=\"images/image_thumb-63-122.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Kontrol </strong> <strong> İşlemleri gerçekleştirirken bekleme mesajı iletişim kutusunu gösterme </strong> seçenek tıklaması <strong> TAMAM MI. </strong></p> <p><img src=\"images/image_thumb-64-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Şimdi hacimleri donmadan takmaya/çıkarmaya devam edin! </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}