{"title":"DÜZELTME: Dizüstü Bilgisayar Dell Inspiron Yavaş CPU Hızı (Çözüldü)","content":"<p> Bu öğretici, bir Dell Inspiron 5558 dizüstü bilgisayarda çok yavaş CPU hızı sorununu düzeltmeye yönelik yönergeler içerir. Geçenlerde bir arkadaşım Dell dizüstü bilgisayarını aniden çok yavaşladığı için laboratuvarıma getirdi. Aslında eskiden laptop hızlı çalışıyordu ama artık işletim sistemi (Windows 10) ve uygulamaların yüklenmesi uzun zaman alıyor. </p> <p> Dizüstü bilgisayarı kontrol ettikten sonra ve aşağıdaki ekran görüntüsünde de görebileceğiniz gibi, CPU&#39;nun 2.20GHz yerine her zaman 0.48GHz&#39;de çalıştığını gördüm. Bu yüzden sorun gidermeye başladım ve sonunda yavaş CPU hızı sorununu çözmek için aşağıdaki iki yöntemi buldum… </p> <p> (Bir Dell dizüstü bilgisayarda CPU Hızı yaklaşık %85-87 oranında azaltıldı) </p> <p><img src=\"images/image_thumb-16-354.png\" alt=\"FIX Dell Laptop Slow CPU Speed\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Dell Dizüstü Bilgisayarda Yavaş CPU Hızı sorunu nasıl düzeltilir? </h4> <h6> Yöntem 1. AC Güç Adaptörünü değiştirin. </h6> <p> Yavaş CPU hızı sorunu, AC güç adaptörü bilgisayardan doğru şekilde tanınmadığında Dell dizüstü bilgisayarlarda bilinen bir sorundur. Bu durumda, güç adaptörü iyi çalışıyor gibi görünse bile, dizüstü bilgisayarı açtığınızda aşağıdaki uyarı mesajı görüntülenir &quot;AC Güç Adaptörü tipi belirlenemiyor. Bu, optimum sistem performansını engeller&quot;. </p> <p> Bu nedenle, Dell dizüstü bilgisayarınızdaki yavaş performans sorununuzu çözmenin ilk yöntemi, güç adaptörünü uyumlu yeni bir Dell AC güç adaptörüyle değiştirmektir. </p> <p> </p> <h6> Yöntem 2. ThrottleStop ile CPU Kısıtlamasını DURDURUN. </h6> <p> AC adaptörünüz iyi çalışıyorsa ve dizüstü bilgisayarınız aşırı ısınmıyorsa*, Dell dizüstü bilgisayarınızdaki yavaş sistem performansı sorununu düzeltmenin başka bir yöntemi, <strong><a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"> Gaz Durdurma </a></strong> Yarar. Bunu yapmak için: </p> <p> 1. İndir <a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Gaz Durdurma </strong></a> yardımcı programı ve indirdiğiniz arşivi çıkarın. <br> 2. Çıkarılan klasörden &quot;ThorttleStop.exe&quot; uygulamasını çalıştırmak için çift tıklayın. * <br> 3. <strong> İşareti kaldırın </strong> <strong> BD PROCHOT </strong> *** onay kutusunu ve ardından <strong> Kayıt etmek </strong> . </p> <p> * Notlar: <br> 1. CPU sıcaklığını izlemek için <a href=\"https://www.alcpu.com/CoreTemp/\" target=\"_blank\" rel=\"nofollow noopener\"> Çekirdek Sıcaklık </a> programı. <br> 2. ThrottleStop&#39;u çalıştırdıktan sonra &quot;MFC120U.dll bulunamadı&quot; veya &quot;MSVCR120.dll eksik&quot; hatası alırsanız, devam edin ve <a title=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" href=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Visual Studio 2013 için Visual C++ Yeniden Dağıtılabilir Paketleri </a> . ( <strong> Önemli: </strong> Windows 64-bit&#39;iniz varsa, Visual C++ paketinin hem 64bit hem de 32bit sürümünü yüklemeniz gerekir). <br> 3. BD PROCHOT, çift yönlü prochot anlamına gelir. PROCHOT, model numarasına bağlı olarak yaklaşık 100C ila 105C&#39;ye ulaştığında CPU içinde etkinleştirilen sinyal olan işlemci sıcak anlamına gelir. Bu sinyal, termal kısma işlemini başlatan şeydir, böylece CPU yavaşlayabilir ve aşırı ısınmayı önleyebilir. PROCHOT&#39;u devre dışı bırakmak, CPU&#39;nuzun tam hızda çalışmaya devam etmesini sağlar. (Kaynak: <a href=\"http://forum.notebookreview.com/threads/the-throttlestop-guide.531329/\" target=\"_blank\" rel=\"nofollow noopener\"> ThrottleStop Kılavuzu </a> ). </p> <p><img src=\"images/image_thumb-20-666.png\" alt=\"FIX Slow CPU Speed with ThrottleStop\" loading=\"lazy\"></p> <p> 4. ThrottleStop&#39;u kapatın ve işiniz bitti. Artık, siz dizüstü bilgisayarı yeniden başlatana veya kapatana kadar CPU tam hızda çalışacaktır. * </p> <p> * Not: Çalıştırmanız gerekir. <strong> Gaz Durdurma </strong> tam CPU hızında çalıştırmak istiyorsanız, bilgisayarınızı her başlattığınızda programlayın. Hayatınızı kolaylaştırmak için bu bölümdeki adımları izleyin. <a href=\"https://www.repairwin.com/how-to-start-throttlestop-at-windows-startup/\" target=\"_blank\" rel=\"nofollow noopener\"> kılavuz </a> Windows başlangıcında ThrottleStop&#39;u otomatik olarak başlatmak için. </p> <p><img src=\"images/image_thumb-21-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}