{"title":"DÜZELTME: Windows 10&#39;da Bu Sistemde Komut Dosyalarının Çalıştırılması Devre Dışı Bırakıldı (Çözüldü)","content":"<p> Windows 10 PowerShell&#39;de bir komut dosyası çalıştırmaya çalışıyorsanız ve &quot;Bu sistemde çalışan komut dosyaları devre dışı bırakıldığından yüklenemiyor&quot; hata mesajını alıyorsanız, sorunu çözmek için aşağıdaki okumaya devam edin. </p> <p><img src=\"images/image_thumb-8-134.png\" alt=\"FIX: script cannot be loaded because is disabled on Windows 10\" loading=\"lazy\"></p> <p> </p> <h2> Nasıl Düzeltilir: Güvenlik İlkesi komut dosyalarının Windows 10&#39;da çalışmasını engellediği için PowerShell Komut Dosyası Çalıştırılamıyor. </h2> <p> &quot;%ScriptName%.ps1 bu sistemde devre dışı olduğu için yüklenemiyor&quot; PowerShell hatası, komut dosyalarının çalışmasını engelleyen bir güvenlik ilkesi nedeniyle görünüyor. Kısıtlamayı kaldırmak ve Windows 10&#39;da çalışan komut dosyalarını etkinleştirmek için aşağıdakileri yapın: </p> <p> 1. Aç <strong> Yönetici olarak PowerShell </strong> . Bunu yapmak için: </p> <blockquote><p> 1. tuşuna basın <strong> pencereler <img src=\"images/image_thumb-97-958.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> $ </strong> &#39;Çalıştır&#39; komut kutusunu açmak için tuşlar <strong><br> </strong> 2. Tip <strong> güç kalkanı </strong> ve ardından basın <strong> CTRL </strong> + <strong> VARDİYA </strong> + <strong> GİRİŞ. </strong></p></blockquote> <p><img src=\"images/image_thumb-41-395.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. PowerShell&#39;de aşağıdaki komutu kopyalayın/yapıştırın ve <strong> Giriş </strong> : </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Sınırsız </li> </ul> <p> 3. Basın <strong> Y </strong> ve vur <strong> Giriş </strong> değişikliği kabul etmek için yürütme politikası uyarı mesajında ​​.. </p> <p><img src=\"images/image_thumb-9-581.png\" alt=\"Enable Running Scripts on Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Politika değişikliği tamamlandıktan sonra, <strong> kapat </strong> PowerShell penceresi. </p> <p> 5. Şimdi, size &quot;Komut Dosyaları Devre Dışı&quot; hatası veren komut dosyasını çalıştırın. <strong> yönetici </strong> ayrıcalıklar. Hata şimdi gitmiş olmalı. * </p> <blockquote><p> * Not: Hala &quot;Bu sistemde komut dosyaları devre dışı&quot; hatasını alıyorsanız, aşağıdaki komutlardan birini verin ve komut dosyanızı yeniden çalıştırmayı deneyin: </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy RemoteSigned </li> <li> set-executionpolicy remotesigned </li> </ul> </blockquote> <p> 6. Son olarak, PowerShell&#39;de (Yönetici) şu komutu çalıştırarak önceki PowerShell yürütme ilkesi ayarına (kısıtlama) geri dönün: * </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Kısıtlı </li> </ul> <p> * Not: Yukarıdaki komutu çalıştırdıktan sonra, bir yürütme politikası değişikliğinin güvenlik risklerini açıklayan bir uyarı mesajı alacaksınız. Basın <strong> Y </strong> düğmesine basın ve ardından <strong> Giriş </strong> Değişikliği kabul etmek ve önceki ilke ayarınıza dönmek için </p> <p><img src=\"images/image_thumb-10-246.png\" alt=\"Disable running scripts windows 10\" loading=\"lazy\"></p> <p> 7. PowerShell penceresini kapatın ve işiniz bitti! </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}