{"title":"DÜZELTME: Windows 10 Gezinti Bölmesinde İki Kez Görüntülenen Sürücüler (Çözüldü)","content":"<p> Bu öğreticide, Windows 10&#39;da aşağıdaki garip sorunu gidermek için talimatlar bulacaksınız: Gezinti Bölmesi&#39;nde iki kez görüntülenen sürücüler. Gezinme bölmesinde sürücülerin yinelenen görünümü, kullanıcının içeriğini kolayca keşfetmesine yardımcı olan yeni bir Windows 10 özelliğidir. &quot;Bu bilgisayar&quot; menüsünü genişletmek zorunda kalmadan takılı sürücü.Ancak bu özellik can sıkıcı hale gelir çünkü &quot;Bu bilgisayar&quot; menüsünü açık tutmak için kullanırsanız, aynı sürücü gezinme bölmesinde iki kez görüntülenir. </p> <p><img src=\"images/image_thumb-22-749.png\" alt=\"Drives Displayed Twice in Navigation Pane of Windows 10\" loading=\"lazy\"></p> <p> Windows 10&#39;da takılı USB sürücülerinizin veya sabit sürücülerin yinelenen girişlerini görürseniz, sorunu çözmek için aşağıdaki talimatları izleyin. </p> <h4> Windows 10 Gezgini&#39;nde (Gezinme Menüsü) Yinelenen Sürücü Harfleri Nasıl Kaldırılır. </h4> <p> Windows 10&#39;un bağlı veya sabit bir sürücüyü iki kez görüntülemesini önlemek için aşağıdaki kayıt defteri ince ayarını uygulayın: </p> <p> 1. Kayıt Defteri Düzenleyicisi&#39;ni açın. bunu yapmak için: </p> <blockquote><p> 1. Windows&#39;a basın <img src=\"images/image_thumb8_thumb_thumb-493.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> $ </strong> Çalıştır komut kutusunu açmak için tuşlar. <br> 2. Arama kutusuna şunu yazın <strong> regedit </strong> ve bas <strong> Giriş </strong> Kayıt Defteri Düzenleyicisi&#39;ni başlatmak için. </p></blockquote> <p><img src=\"images/image_thumb7-138.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Ardından bu kayıt defteri anahtarına gidin: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Desktop\\NameSpace\\DelegateFolders </li> </ul> <p> 3. Ardından sağ tıklayın ve <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> anahtar. </p> <p><img src=\"images/image_thumb-23-428.png\" alt=\"remove duplicate drive entries windows 10 navigation pane\" loading=\"lazy\"></p> <p> </p> <p> 4. Ardından şu tuşa gidin: * </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Desktop\\NameSpace\\DelegateFolders </li> </ul> <p> 5. Sil <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> anahtar. </p> <p> 6. Kayıt Defteri Düzenleyicisi&#39;ni kapatın. </p> <p> * Not: &quot;WOW6432Node&quot; anahtarını göremiyorsanız, yukarıdaki 4. ve 5. adımları dikkate almayın çünkü bunlar yalnızca Windows 10&#39;un 64 bit sürümleri için geçerlidir. </p> <p><strong> İPUCU: </strong> Gelecekte kararınızı değiştirirseniz, yukarıdaki kayıt konumlarında &#39;DelegateFolders&#39;a sağ tıklayın, seçin <strong> Yeni </strong> -&gt; <strong> Anahtar </strong> ve silinenleri yeniden oluşturun <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> anahtarlar). </p> <p> Bu kadar! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}