{"title":"DÜZELTME: Outlook 0x80042112 – Bildirilen hata alınıyor (Çözüldü)","content":"<p> Outlook 0x80042112 Bildirilen hata alınıyor, genellikle Outlook çok büyük boyutlu e-postaları (ör. büyük ekleri olan e-postalar) almaya çalışırken oluşur. Bu durumda, Outlook &#39;Gönderme/Alma İlerlemesi&#39; sırasında aşağıdaki hatayı görüntüler: &quot;Görev &#39;%E-posta-Hesabı% – Alınıyor&#39; hata bildirdi (0x80042112): &#39;Posta sunucusundaki aşağıdaki e-posta iletileri indirilemiyor. Bu hatayı almaya devam ederseniz, İnternet servis sağlayıcınıza (ISS) veya posta yöneticinize başvurun.&quot; </p> <p><img src=\"images/image_thumb-7-121.png\" alt=\"FIX: Outlook 0x80042112 Receiving reported error. \" loading=\"lazy\"></p> <p> Bu öğretici, Outlook&#39;un 0x80042112 alma hatasını çözmek için ayrıntılı yönergeler içerir. </p> <h4> Outlook Alma Bildirilen Hatası 0x80042112 Nasıl Onarılır. </h4> <h6> Adım 1. İnternete bağlı olduğunuzdan emin olun. </h6> <p> Bazen Outlook 0x80042112 hatası alıyor, çünkü İnternet bağlantısı durduruluyor. Bu nedenle, her şeyden önce, İnternet bağlantınızın çalıştığını doğrulayın. Bunu yapmak için İnternet tarayıcınızı açın ve bağlantınızı kontrol etmek için herhangi bir web sitesini ziyaret edin. </p> <p> </p> <h6> Adım 2. Giden Kutusu E-posta Mesajlarını Sil. </h6> <p> Outlook&#39;ta 0x80042112 hatasını çözmenin ikinci yöntemi, Giden Kutusu&#39;nda takılı kalmış tüm e-posta iletilerini silmek veya taslaklara taşımaktır. Bunu yapmak için: </p> <p> 1. Outlook&#39;ta, <strong> Gönder/Al </strong> sekmesini ve ardından <strong> Çevrimdışı çalışmak </strong> . </p> <p><img src=\"images/image_thumb-8-737.png\" alt=\"Move Outbox Emails to Drafts folder\" loading=\"lazy\"></p> <p> 2. <strong> Tekrar başlat </strong> Görünüm. <br> 3. <strong> giden kutusu </strong> klasörü (solda) ve ardından <strong> CTRL </strong> + <strong> bir </strong> tüm e-postaları seçmek için (sağda). <br> 4. Seçilen e-postaları sağ tıklayın ve <strong> taslaklar </strong> klasör, tıklayarak <strong> Taşı -&gt; Diğer Klasör </strong> öğesini seçin ve ardından <strong> taslaklar </strong> listeden klasör. </p> <p><img src=\"images/image_thumb-10-352.png\" alt=\"FIX Outlook error 0x80042112\" loading=\"lazy\"></p> <p> </p> <p> 5. İşiniz bittiğinde, <strong> Gönder/Al </strong> sekmesini tıklayın ve <strong> Çevrimiçi Çalışın. <br> </strong> 6. <strong> Tekrar başlat </strong> Outlook&#39;a gidin ve Gönder/Al işlemini gerçekleştirin. </p> <h6></h6> <h6> Adım 3. Outlook&#39;u Eklentiler olmadan çalıştırın. </h6> <p> Alma sırasında Outlook 0x80042112 hatasını düzeltmenin başka bir yöntemi de Outlook uygulamasını Güvenli Modda başlatmak ve hataya neden olabilecek Eklentileri devre dışı bırakmaktır. </p> <p> 1. Outlook&#39;u Güvenli Modda başlatmak için <strong> CTRL </strong> (klavyenizde) tuşuna basın ve ardından Microsoft Outlook kısayoluna çift tıklayın veya: </p> <blockquote><p> bir. Windows&#39;a aynı anda basın <img src=\"images/image_thumb36-371.png\" alt=\"image\" loading=\"lazy\"> + <strong> $ </strong> Çalıştır komut kutusunu açmak için tuşlar. <br> b. Tür: <strong> görünüm / güvenli </strong> ve tıklayın <strong> TAMAM MI </strong> . </p> <p><img src=\"images/image_thumb-14-671.png\" alt=\"outlook safe mode\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. Outlook Güvenli Modunda Eklenti seçeneklerine gidin ve <strong> tüm Eklentileri devre dışı bırak </strong> . Bunu yapmak için: </p> <ul> <li> Eklentileri devre dışı bırakmak için <strong> Outlook 2007 </strong> : </li> </ul> <blockquote><p> 1. <strong> açık </strong> <strong> Araçlar </strong> menü, tıklayın <strong> Güven merkezi. </strong><br> 2. Seç <strong> Eklentiler </strong> sol bölmede. <br> 3. Sağ bölmede öğesini seçin. <strong> COM Eklentileri </strong> ve tıklayın <strong> Git… <br> </strong> 4. <strong> İşareti kaldırın </strong> tüm eklentileri devre dışı bırakmak için tüm onay kutularını tıklayın ve <strong> TAMAM MI. </strong></p></blockquote> <ul> <li> Eklentileri devre dışı bırakmak için <strong> Görünüm 2016, 2013 </strong> veya <strong> 2010 </strong> : </li> </ul> <blockquote><p> 1. <strong> Dosya </strong> menü ve seçin <strong> Seçenekler </strong> . <br> 2. Seç <strong> Eklentiler </strong> sol bölme. <br> 3. Sağ bölmede öğesini seçin. <strong> COM Eklentileri </strong> ve tıklayın <strong> Git… </strong></p></blockquote> <p><img src=\"images/image_thumb-20-411.png\" alt=\"disable outlook add-ins\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. <strong> İşareti kaldırın </strong> <strong> herşey </strong> onay kutuları ve tıklayın <strong> TAMAM MI </strong> Tüm Eklentileri devre dışı bırakmak için. </p> <p><strong><img src=\"images/image_thumb-21-683.png\" alt=\"turn off outlook add-ins\" loading=\"lazy\"><strong><br> </strong></strong></p> </blockquote> <p> 3. <strong> Tekrar başlat </strong> Görünüm. <br> 4. Göndermeyi/Almayı deneyin. Gönderme/alma işlemi normal şekilde ve 0x80042112 hatası görüntülenmiyorsa, devam edin ve devre dışı bırakılan tüm eklentileri birer birer yeniden etkinleştirin ve hangisinin soruna neden olduğunu bulana kadar Outlook&#39;u yeniden başlatın. </p> <p> </p> <h6> Adım 4. Antivirüs ve Güvenlik Duvarı ayarlarınızı kontrol edin. </h6> <p> E-posta tarama özelliklerine sahip bir virüsten koruma programı kullanıyorsanız, Outlook&#39;ta Virüsten Koruma Eklentisini devre dışı bırakın (yukarıdaki 3. adımdaki talimatlara bakın) veya Virüsten Koruma korumasını geçici olarak devre dışı bırakın veya Virüsten Koruma programını kaldırın. Ayrıca Güvenlik Duvarı ayarlarınızı kontrol edin ve kullandığınız e-posta sunucusu bağlantı noktalarının Güvenlik Duvarı programından engellenmediğinden emin olun. Daha spesifik olarak, Güvenlik Duvarı ayarlarınızda: </p> <p> A. İnternete erişmek için aşağıdaki dosyaları etkinleştirin: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Güvenlik Duvarında aşağıdaki bağlantı noktalarını etkinleştirin: </p> <ul> <li><strong> 110 numaralı bağlantı noktası </strong> (Şifreli bağlantı olmadan bir POP3 Gelen Posta Sunucusu kullanıyorsanız) * </li> <li><strong> 995 numaralı bağlantı noktası </strong> (Şifreli bağlantıya sahip bir POP3 Gelen Posta Sunucusu kullanıyorsanız (SSL Etkin) </li> </ul> <ul> <li><strong> 143 numaralı bağlantı noktası </strong> (şifreli bağlantı olmadan bir IMAP Gelen Posta Sunucusu kullanıyorsanız) </li> <li><strong> 993 numaralı bağlantı noktası </strong> (şifreli bağlantıya sahip bir IMAP Gelen Posta Sunucusu kullanıyorsanız (SSL Etkin) </li> </ul> <ul> <li><strong> 25 numaralı bağlantı noktası </strong> SMTP Giden Posta sunucunuz SSL kullanmıyorsa. * </li> <li><strong> 465 numaralı bağlantı noktası </strong> veya <strong> 587 </strong> SMTP Giden Posta sunucunuz SSL kullanıyorsa </li> </ul> <p> * Not: Varsayılan olarak, 25 numaralı bağlantı noktası giden erişim içindir ve 110 numaralı bağlantı noktası gelen erişim içindir. Bağlantı noktalarından emin değilseniz, ISS&#39;nize veya sistem yöneticinize başvurun. </p> <p> </p> <h6> Adım 5. Outlook PST Veri dosyasını onarın. </h6> <p> Outlook Alma olarak bildirilen 0x80042112 hatasını düzeltmenin bir sonraki adımı, .pst dosyanızı onarmak için Gelen Kutusu Onarım Aracı&#39;nı çalıştırmaktır. Bunu yapmak için ayrıntılı talimatlar bu eğitimde bulunabilir: <a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Outlook PST Veri Dosyası Nasıl Onarılır </a> . </p> <p> </p> <h6> Adım 6. WEB&#39;den E-posta Mesajının/Mesajlarının Boyutunu kontrol edin. </h6> <p> E-posta hesabınıza web üzerinden erişiminiz varsa, web tarayıcınızı kullanarak e-posta hesabınızda oturum açın ve sorunun e-posta boyutunun olup olmadığını kontrol edin. Örneğin, Gelen Kutunuzda büyük bir e-posta bulursanız, eklerini indirin ve ardından o e-postayı silin. * </p> <p> * Not: Web üzerinden e-posta hesabınıza erişiminiz yoksa, sorunu bildirmek için e-posta sağlayıcınıza başvurun. </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}