{"title":"Dosya Gezgini&#39;nde Geçerli Klasörde Yönetici Olarak PowerShell Nasıl Açılır (Windows 10)","content":"<p> Dosya Gezgini&#39;nde herhangi bir konumda/klasörde PowerShell veya PowerShell&#39;i Yönetici olarak açmak istiyorsanız, bu öğreticiyi okumaya devam edin. Windows 10&#39;da PowerShell&#39;i açmanın olağan yollarını bildiğiniz gibi, Cortana aramasını kullanarak aramak veya (daha hızlı) <strong> kazanmak <img src=\"images/image_thumb8_thumb_thumb-479.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"></strong> + <strong> X </strong> &quot;Güçlü Kullanıcı menüsünü&quot; açmak ve oradan Windows PowerShell&#39;i çalıştırmak için tuşlara basın. </p> <p><img src=\"images/image_thumb-54-350.png\" alt=\"PoweShell Admin (Win + X menu)\" loading=\"lazy\"></p> <p> </p> <p> Bu yöntemler faydalı olsa da bazen PowerShell&#39;i belirli bir konumda/klasörde açma ihtiyacı olabiliyor. Bunu yapmak için aşağıdaki talimatları izleyin. </p> <h4> Windows 10&#39;da Belirli Bir Konumda Windows PowerShell Nasıl Açılır. </h4> <p> 1. PowerShell&#39;i açmak istediğiniz klasöre gidin. <br> 2. <strong> basılı tutun </strong> <strong> VARDİYA </strong> anahtar ve <strong> sağ tık </strong> klasörün içinde herhangi bir yerde. <br> 3. Sağ tıklama menüsünden <strong> PowerShell penceresini burada açın </strong> için <strong> </strong> bu klasörde yeni bir PowerShell penceresi açın. </p> <p> </p> <p><img src=\"images/image_thumb-55-793.png\" alt=\"Open PoweShell at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Herhangi bir klasörde &#39;Yönetici Olarak PowerShell&#39;i açmak istiyorsanız, <strong> Dosya </strong> menü ve seçin <strong> Windows PowerShell&#39;i yönetici olarak açın </strong> . * </p> <p> * Not: &#39;Dosya&#39; menüsünden de görebileceğiniz gibi, &quot;basit&quot; bir PowerShell penceresi de açabilirsiniz. </p> <p><img src=\"images/image_thumb-56-830.png\" alt=\"Open PoweShell As Administrator at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p><strong> Ek yardım: </strong> Klavye kısayollarının hayranıysanız, PowerShell&#39;i (Yönetici) açmanın başka bir yolu da <strong> alt </strong> + <strong> F </strong> + <strong> S </strong> + <strong> bir </strong> anahtarlar sırayla. </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}