{"title":"DÜZELTME: DBX dosyasındaki 2 GB Boyut Sınırı Nedeniyle Outlook Express Hatası 0x800c0133 (Çözüldü)","content":"<p> Bu öğretici, 2 GB boyut sınırı nedeniyle Outlook Express Hatası 0x800c0133&#39;ü düzeltmek için yönergeler içerir. OE&#39;deki 0x800c0133 hatası, Outlook klasörlerinden birinin boyut olarak 2 GB sınırını aşması nedeniyle oluşur. </p> <p> Outlook Express&#39;te .DBX 2GB boyut sınırı sorununun açıklaması. <br> Ana Outlook Express klasörlerinden biri (örneğin &quot;Gelen Kutusu&quot; veya &quot;Gönderildi&quot;) 2 GB&#39;ı aştığında, Gönderme/Alma işlemi sırasında OE 0x800c0133 hatası verir ve bazen ilgili OE klasörü boş olur (Bozuk).* Örneğin, &quot;Gelen Kutusu&quot; klasörünün (Inbox.dbx) boyutu 2 GB&#39;ı aşarsa, OE yeni e-postaları alamaz ve 0x800c0133 hatasını görüntüler. </p> <p> * Not: OE klasörlerinden biri boşsa, ilişkili DBX dosyası bozuktur. Bu durumda, bu makaledeki talimatları uygulayarak E-postalarınızı bozuk OE klasöründen kurtarmayı deneyin: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> ÜCRETSİZ Outlook Express DBX dosyası nasıl kurtarılır </a> . </p> <h4> Outlook Express 2GB Sınırı sorunu nasıl düzeltilir (Gönderme/Alma Hatası 0x800c0133). </h4> <h6> Adım 1. Gizli Dosyalar Görünümünü Etkinleştirin. </h6> <p> 1. Windows Gezgini&#39;ni açın. <br> 2. <strong> Araçlar </strong> menü seç <strong> Dosya seçenekleri </strong> . <br> 3. Görünüm sekmesinde, <strong> Gizli dosya ve klasörleri göster </strong> ve tıklayın <strong> TAMAM MI. </strong></p> <p><img src=\"images/image_thumb1_thumb-210.png\" alt=\"image_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Adım 2. Diskinizde Outlook Express 2GB DBX dosyasını bulun. </h6> <p> 1. Outlook Express mağaza klasörünü açın. Genellikle bu klasör diskinizde aşağıdaki yolda bulunur: </p> <ul> <li> C:\\Documents and Settings\\\\Local Settings\\Application Data\\Identities\\{}\\Microsoft\\ <strong> Outlook Ekspres </strong></li> </ul> <blockquote><p> Örneğin. “C:\\Documents and Settings\\Admin\\Local Settings\\Application Data\\Identities\\{D8F3C56D-965E-41AE-8A23-A58460ABAE00}\\Microsoft\\ <strong> Outlook Ekspres </strong> ” </p></blockquote> <p> 3. Explorer&#39;dan <strong> Görünüm </strong> menü seç <strong> Ayrıntılar </strong> . <br> 4. Hangi DBX dosyasının 2GB depolama sınırını aştığını bulun. * </p> <p> * Bu örnekte, &quot;Inbox.dbx&quot; dosyasının boyutu 2 GB&#39;ı aşıyor. </p> <p><img src=\"images/image_thumb2_thumb-339.png\" alt=\"FIX Outlook Express Error 0x800c0133\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Adım 3. E-postaları Büyük Boy Posta klasöründen Yeni Posta klasörüne taşıyın. </h6> <p> 1. Outlook Express&#39;i açın. <br> 2. Büyük boyutlu posta klasörünü seçin (2 GB&#39;den büyük, örneğin bu örnekte &quot;Gelen Kutusu&quot; klasörü). <br> 3. Eğer o klasörde e-postalarınızı görebiliyorsanız (klasör boş değil), aşağıdaki gibi ilerleyin: * </p> <p> * Uyarı: Klasör boş görünüyorsa (üzerinde herhangi bir e-posta görmüyorsanız), OE klasörü (ve ilişkili DBX dosyası) bozuktur. Bu durumda, bu makaledeki talimatları izleyerek e-postalarınızı bozuk DBX klasöründen kurtarmanız gerekir. </p> <p> 4. OE programının sol bölmesinde, büyük boyutlu klasöre sağ tıklayın ve <strong> Yeni dosya </strong> (yeni bir posta klasörü oluşturmak için) </p> <p><img src=\"images/image_thumb-6-403.png\" alt=\"outlook express 2gb limit\" loading=\"lazy\"></p> <p> </p> <p> 5. Yeni klasör için tanınabilir bir ad ve ardından bir yıl yazın (ör. &quot;Gelen Kutusu-2016&quot;) </p> <p><img src=\"images/image_thumb-7-434.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Ardından, büyük boyutlu klasörden (örn. &quot;Gelen Kutusu&quot;ndan), bir grup e-posta seçin (örn. 2016 yılından tüm e-postalar) ve bunları daha önce oluşturduğunuz yeni Posta klasörüne (örn. &quot; Gelen Kutusu-2016&quot;). </p> <p><img src=\"images/image_thumb-8-450.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Aynı adımları tekrarlayın (örneğin, yıllara göre farklı klasörler oluşturun ve postaları büyük boyutlu klasörden yeni klasörlere taşıyın). * </p> <p> * Uyarı: Taşıma işlemi sırasında sorunlarla karşılaşırsanız (örneğin, bazı mesajları yeni klasöre taşıyamazsanız), o zaman: </p> <blockquote><p> 1. Outlook Express&#39;i kapatın. <br> 2. &quot;Outlook Express&quot; klasörünü OE Store konumundan diskinizdeki başka bir hedefe kopyalayın (yedekleyin). <br> 3. Ardından, büyük boyutlu .dbx dosyasını silmek için 4. adımdaki talimatları izleyin. <br> 4. Outlook Express&#39;i açın. <br> 5. E-postaları OE yedekleme klasöründen içe aktarın (Kimden <strong> Dosya </strong> menüye gidin -&gt; <strong> İthalat </strong> <strong> Mesajlar </strong> -&gt; <strong> Microsoft Outlook Express6 </strong> -&gt; <strong> OE mağaza dizininden postayı içe aktar… </strong> ). ** </p> <p> ** İçe aktarma sırasında hala sorunlarla karşılaşıyorsanız, bozuk DBX dosyasını onarmak için bu makaledeki yönergeleri izleyin. </p></blockquote> <p> </p> <p> 8. E-posta aktarımını tamamladığınızda ve 2GB&#39;lık klasör e-postalardan (örneğin, bu örnekte &quot;Gelen Kutusu&quot;) boşaldığında bir sonraki adıma geçin. </p> <p><img src=\"images/image_thumb-10-811.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Adım 4. Büyük boyutlu Outlook Express DBX dosyasını diskinizden silin. </h6> <p> 1. Diskinizdeki Outlook Express mağaza klasörünü açın. <br> 2. Büyük boyutlu DBX dosyasını silin (örneğin, bu örnekte &quot;Inbox.dbx&quot;). </p> <p><img src=\"images/image_thumb-9-996.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Outlook Express&#39;i başlatın. <br> 4. OE, e-postaları depolamak için (otomatik olarak) yeni, temiz ve sağlıklı bir posta klasörü oluşturacaktır. * </p> <p> * Not: Hala aynı hatayı alıyorsanız, bu makaledeki talimatları izleyerek bozuk OE klasörünü onarmayı deneyin: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> ÜCRETSİZ Outlook Express DBX dosyası nasıl kurtarılır </a> . </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? </p> <p> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}