{"title":"DÜZELTME: Bu komutu işlemek için yeterli depolama alanı yok – Paylaşılan Klasörlere Erişilemiyor veya Uzak Masaüstü Kullanılamıyor (Çözüldü)","content":"<p> &quot;Bu komutu işlemek için yeterli depolama alanı yok&quot; hatası, başka bir Windows iş istasyonundaki veya bir Server 2003, 2008, 2012 veya 2016&#39;daki paylaşılan klasörlere erişmeye çalıştığınızda veya Uzak Masaüstü Bağlantısını (RDP) kullandığınızda görünebilir. ), başka bir Windows bilgisayarına (İş İstasyonu veya Sunucu) bağlanmak için. </p> <p><img src=\"images/image_thumb-127.png\" alt=\"Not enough storage is available to process this command\" loading=\"lazy\"></p> <p> </p> <p> Bu öğretici, tüm Windows sürümlerinde (Windows 10, 8/8.1, 7, Vista, XP ve Windows Server 2003, 2008, 2012 veya 2016) görülebilen aşağıdaki sorunları çözmek için talimatlar içerir: </p> <p> 1. Sunucu makinesinde paylaşılan klasörlere erişmeye çalıştığınızda şu hata mesajını alıyorsunuz: &quot; <em> Paylaşılan klasör </em> ulaşılabilir değil. Bu ağ kaynağını kullanma izniniz olmayabilir. Erişim izinlerinizin olup olmadığını öğrenmek için bu sunucunun yöneticisiyle iletişime geçin. Bu komutu işlemek için yeterli sunucu depolama alanı yok.&quot; </p> <p> 2. Başka bir Windows tabanlı makineye (RDP kullanarak) uzaktan bağlanmaya çalıştığınızda, şu hata mesajını alıyorsunuz: &quot;Sistem aşağıdaki nedenden dolayı oturum açamıyor. Bu komutu işlemek için yeterli depolama alanı yok&quot;. </p> <h4> NASIL DÜZELTİLİR: Uzak Masaüstü&#39;nde (RDP) veya Paylaşılan Klasörlere erişmeye çalışırken &quot;Bu komutu işlemek için yeterli depolama alanı yok&quot; hata mesajı. </h4> <p> Dosyalarına erişmek veya uzaktan bağlanmak istediğiniz Windows &quot;sunucu&quot; makinesinde: </p> <p><strong> 1. </strong> &quot; tuşuna basın <strong> pencereler </strong> ” + “ <strong> $ </strong> ” tuşlarını açmak için <em> ÇALIŞTIRMAK </em> pencere. <br> <strong> 2. </strong> Tür <strong> regedit </strong> ve bas <strong> Giriş </strong> Kayıt Defteri Düzenleyicisi&#39;ni açmak için. </p> <p><img src=\"images/image_thumb7-649.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Ardından bu tuşa gidin: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\LanmanServer\\Parameters </strong></li> </ul> <p><img src=\"images/image_thumb-1-198.png\" alt=\"fix Not enough storage - cannot access shared items\" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Açmak için sağ bölmede çift tıklayın <strong> IRPStackBoyutu </strong> değer <strong> . * </strong></p> <p><strong> * Not: </strong> göremiyorsanız <strong> IRPStackBoyutu </strong> değer, ardından: </p> <p> </p> <blockquote><p> 1. Boş bir alana sağ tıklayın (sağ bölmede) ve ardından <strong> Yeni </strong> –&gt; <strong> DWORD (32 bit) değeri </strong></p> <p><img src=\"images/image_thumb-2-236.png\" alt=\"fix Not enough storage using RDP (Remote Desktop)\" loading=\"lazy\"></p> </blockquote> <blockquote><p> 2. Yeni değeri adlandırın <strong> IRPStackBoyutu </strong> ve vur <strong> Giriş. </strong></p></blockquote> <p><strong> 5. </strong> Seç <strong> Ondalık </strong> , değer verilerini şu şekilde değiştirin <strong> 50 </strong> ve tıklayın <strong> TAMAM MI </strong> . * </p> <p> * Not: Parametre aralığı (ondalık olarak) 1 ile 50 arasındadır. </p> <p><img src=\"images/image_thumb-3-255.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 6. </strong> <strong> Kapat </strong> kayıt defteri düzenleyicisi ve <strong> tekrar başlat </strong> sunucu. * </p> <p> * Önemli not: Yeniden başlattıktan sonra, Uzak Masaüstü Bağlantısını kullanırken veya başka bir bilgisayarda paylaşılan dosyalara erişmeye çalıştığınızda aynı hata mesajını alıyorsanız, yukarıdaki kayıt defteri değişikliğini bilgisayarınıza da uygulayın. </p> <p> Bu kadar! İşinize yaradı mı? </p> <p> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}