{"title":"DÜZELTME: Lenovo dizüstü bilgisayar LOGO ekranında takılı kaldı. (Çözüldü)","content":"<p> Lenovo dizüstü bilgisayarınız logo ekranında takılı kaldıysa okumaya devam edin. Bu öğretici, Lenovo dizüstü bilgisayarlarda aşağıdaki sorunu çözmek için adım adım yönergeler içerir: Açıldıktan sonra dizüstü bilgisayar açılmıyor ve Lenovo logosu açılış ekranında takılıyor. (USB önyüklenebilir bir aygıttan başlatmayı denediğinizde bile sorun devam ediyor). </p> <p><img src=\"images/image_thumb-17-276.png\" alt=\"FIX: Lenovo laptop is stuck at LOGO screen.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> DÜZELTME: Dizüstü Bilgisayar LENOVO LOGO ekranında Takıldı. * </h4> <p> * Önemli: Bir bilgisayarda sorun gidermeden önce, sorunun bağlı bir aygıttan kaynaklanmadığından emin olmak için tüm çevre aygıtlarının bağlantısını kesin. </p> <p> </p> <h6> Adım 1. BIOS&#39;u varsayılan ayarlara sıfırlayın. </h6> <p> Dizüstü bilgisayarın Lenovo logosunda donmasını çözmenin ilk adımı, BIOS&#39;u varsayılan ayarlara sıfırlamaktır. Bunu yapmak için: </p> <p> 1. <strong> Kapat </strong> Güç düğmesine 5-7 saniye boyunca sürekli basarak dizüstü bilgisayarı. <br> 2. Şimdi BIOS&#39;a girmek için modelinize göre aşağıdaki talimatları izleyin: </p> <ul> <li> Eğer sisteminiz <strong> ThinkPad </strong> , Güç düğmesine basın ve ardından hemen (Fn+) F2 veya (Fn+) F1 tuşuna hızla ve art arda basın. </li> <li> Eğer sisteminiz <strong> fikir defteri </strong> dizüstü bilgisayar, bulun ve <strong> basın </strong> <a href=\"https://support.lenovo.com/us/en/solutions/HT104038\" target=\"_blank\" rel=\"nofollow noopener\"> NOVO </a> Genellikle Güç düğmesinin yanında bulunan düğmeyi seçin ve ardından <strong> BIOS Menüsüne Girin </strong> . </li> </ul> <p> 3. <strong> çıkış </strong> sekme seçimi <strong> Varsayılanları Yükle </strong> veya &quot;Optimize edilmiş ayarları yükle&quot;. <br> 4. <strong> Kaydet ve BIOS&#39;tan çık </strong> ayarları ve Windows&#39;a önyükleme yapıp yapamayacağınıza bakın. <br> 5. Dizüstü bilgisayar hala Lenovo logo ekranında donuyorsa, bir sonraki adıma geçin. </p> <p> </p> <h6> Adım 2. Lenovo Hizmet Motorunu devre dışı bırakın. </h6> <p> Bazı Lenovo dizüstü bilgisayarlarda (ve masaüstü bilgisayarlarda), &quot;Lenovo Service Engine&quot; etkinleştirildiğinde sistem, önyükleme sırasında &quot;Lenovo Logosu&quot;nda asılı kalır. Hizmeti devre dışı bırakmak için: </p> <p> 1. BIOS menüsüne girin. <br> 2. <strong> Güvenlik </strong> sekmesinde &quot;Lenovo Service Engine&quot; öğesini vurgulayın ve devre dışı bırakın. </p> <p><img src=\"images/image_thumb-19-834.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Kaydet ve çık </strong> BIOS menüsünden. <br> 4. Dizüstü bilgisayar hala Lenovo logosu açılış ekranında takılı kalıyorsa, bir sonraki adıma geçin. </p> <p> </p> <h6> Adım 3: Güç Sıfırlaması gerçekleştirin. </h6> <p> &quot;Lenovo Logosu takıldı&quot; sorununu çözmenin bir sonraki yöntemi, güç sıfırlaması yapmaktır. Bunu yapmak için: </p> <p> 1. <strong> bağlantıyı kes </strong> tüm bağlı çevre birimleri. <br> 2. <strong> Kaldırmak </strong> <strong> AC Adaptörü </strong> . <br> 3. <strong> Kaldırmak </strong> <strong> pil </strong> . * </p> <p> * Not: Pili çıkaramazsanız, pil boşalana kadar dizüstü bilgisayarı açık bırakın. </p> <p> 4. <strong> Basın </strong> ve <strong> basılı tut </strong> <strong> Güç </strong> düğmesini en az 50-60 saniye basılı tutun ve ardından Güç düğmesini bırakın. <br> 5. Yalnızca AC Adaptörünü bağlayın ve dizüstü bilgisayarı açın. <br> 6. Windows normal şekilde başlarsa, dizüstü bilgisayarınızı kapatın ve pili ve çevre birimlerini yeniden bağlayın. </p> <h6> Adım 4. CMOS pilini çıkarın. </h6> <p> 1. <strong> Kaldırmak </strong> <strong> pil </strong> ve <strong> AC adaptörü </strong> . <br> 2. Dizüstü bilgisayarı ters çevirin ve <strong> Kaldır </strong> <strong> arka kapak </strong> . * </p> <p> * Not: Arka kapağı çıkarma şekli dizüstü bilgisayar modeline göre farklılık gösterir. Bu nedenle, kendi Lenovo dizüstü bilgisayar modelinizi nasıl sökeceğiniz konusunda bir Google araması yapın. </p> <p> 3. Bulun ve <strong> Kaldır </strong> <strong> CMOS pil </strong> . * </p> <p> * Not: CMOS pili bir daire şeklindedir ve küçük, düz uçlu bir tornavidayla hafifçe kaldırarak pili çıkarabilirsiniz. </p> <p> 4. <strong> Basın </strong> ve <strong> basılı tut </strong> <strong> Güç </strong> en az 50-60 saniye basılı tutun ve ardından bırakın. </p> <p> 5. Önce AC Adaptörünü bağlayın ve ardından CMOS pilini yeniden takın. <br> 5. Dizüstü bilgisayarı açın. * </p> <p> * Not: Sorun devam ederse, CMOS pilini çıkarın ve en az 30 dakika boyunca fişten çekin. Ardından CMOS pilini geri takın, AC Adaptörünü bağlayın ve dizüstü bilgisayarı açın. </p> <p> </p> <h6> Adım 5. DVD birimini çıkarın. * </h6> <p><strong> * Önemli: </strong> Parça eklemeden veya çıkarmadan önce bilgisayarınızı kapatın ve Güç Adaptörünü çıkarın. </p> <p> DVD sürücülü bir dizüstü bilgisayarınız varsa, çıkarın ve dizüstü bilgisayarınızı yeniden açın. (Bu kulağa tuhaf geliyor, ancak bazı durumlarda işe yarıyor.) </p> <p> </p> <h6> Adım 6. RAM ve Sabit Sürücüyü Çıkarın ve Yeniden Yerleştirin. </h6> <p> Bir bilgisayar (masaüstü veya dizüstü bilgisayar) LOGO (POST) ekranında donduğunda, genellikle sabit sürücü (HDD) veya bellek (RAM) ile ilgili bir sorun olduğu anlamına gelir. Bu nedenle, aşağıdaki gibi ilerleyin: </p> <p><strong> * Önemli: </strong> Parçalarını eklemeden veya çıkarmadan önce bilgisayarınızı kapatın ve Güç Adaptörünü çıkarın. </p> <p> 1. RAM Modülünü/Modüllerini çıkarın ve yeniden yerleştirin. <br> 2. Dizüstü bilgisayarı açın ve sorunun devam edip etmediğini görün. Evet ise, o zaman… <br> 3. Dizüstü bilgisayarı kapatın ve sabit sürücüyü (HDD) çıkarın (bağlantısını kesin). <br> 4. HDD&#39;yi çıkardıktan sonra dizüstü bilgisayarı tekrar açın. <br> 5. Sorunun nedeni HDD ise, Lenovo LOGO açılış ekranı kaybolacak ve &quot;Önyüklenebilir aygıt bulunamadı&quot; veya buna benzer bir mesaj alacaksınız. Bu olursa:* </p> <blockquote><p> bir. Dizüstü bilgisayarı kapatın. <br> b. Hem sabit sürücüdeki hem de HDD soketindeki temas noktalarını bir kontak temizleyici spreyle temizleyin. <br> c. Sabit sürücüyü yeniden bağlayın ve aşağıdaki (6) okumaya devam edin. </p></blockquote> <p> * Not: Bu gerçekleşmezse, bu yalnızca uzman bir bilgisayar teknisyeni tarafından onarılabilecek bir BIOS sorununa veya bir ana kart sorununa işaret eder. </p> <p> 6. Dizüstü bilgisayarı açın ve sorunun çözülüp çözülmediğine bakın. Değilse, dosyalarınızı yedeklemeye devam edin ve ardından aşağıdaki adımları izleyerek temiz bir Windows yüklemesi gerçekleştirin: </p> <blockquote><p> bir. Sabit sürücüyü çıkarın ve çalışan başka bir bilgisayara bağlayın (örneğin, bir USB - SATA Sabit Sürücü Adaptörü kullanarak). <br> b. Sürücünün içeriğini okuyabiliyorsanız, devam edin ve <strong> dosyalarını yedekle </strong> . * </p> <p> * Not: Sabit sürücü ikincil bilgisayardan tanınmazsa, HDD arızalıdır ve değiştirmeniz gerekir. </p> <p> c. Dosyalarınızı yedekledikten sonra devam edin ve <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Sorunlar için Sabit Sürücüyü teşhis edin </a> ve sonuçlara göre HDD&#39;yi değiştirin (arızalıysa) veya (uygunsa) devam edin ve <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> HDD&#39;deki tüm bölümleri sil </a> . </p></blockquote> <p> 7. Bölümleri temizledikten sonra, HDD&#39;yi dizüstü bilgisayara geri koyun ve devam edin. <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> temiz kurulum Windows </a> . </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}