{"title":"DÜZELTME: Bu İş İstasyonu ile Birincil Etki Alanı Arasındaki Güven İlişkisi Başarısız Oldu (Çözüldü)","content":"<p> Etki alanınızda oturum açmaya çalıştığınızda veya etki alanındaki başka bir makinede paylaşılan bir klasöre erişmeye çalıştığınızda &quot;Bu İş İstasyonu ile Birincil Etki Alanı Arasındaki Güven İlişkisi Başarısız Oldu&quot; hatası alıyorsanız, sorunu çözmek için aşağıdaki okumaya devam edin. </p> <p> &quot;İş İstasyonu ve Birincil Etki Alanı Arasındaki Güven İlişkisi Başarısız&quot; hatası aşağıdaki nedenlerle görünebilir: </p> <ul> <li> Bilgisayar, Etki Alanındaki başka bir bilgisayarla aynı ada sahiptir. </li> <li> Etki Alanı Kimlik Bilgileri (Kullanıcı Adı veya Parola) geçersiz. </li> <li> Bilgisayarın hesabının süresi doldu. * </li> </ul> <p> * Not: Bazı kuruluşlar daha sonra kullanmak üzere bilgisayarları (veya bilgisayar klonlarını) önceden oluşturur. Bilgisayarın hesabının süresi dolmuşsa, artık etki alanıyla kimlik doğrulaması yapamaz. Bu gibi durumlarda, etki alanıyla kimlik doğrulaması yapamayan bilgisayarlar etki alanından kaldırılmalı ve yeniden birleştirilmelidir. (adım-4) </p> <p><img src=\"images/image_thumb-32-740.png\" alt=\"FIX: Trust Relationship Between this Workstation and the Primary Domain Failed \" loading=\"lazy\"></p> <h4> Nasıl Düzeltilir: İş İstasyonu ve Etki Alanı Arasındaki Güven İlişkisi Başarısız Oldu. </h4> <h6> Yöntem 1. Etki Alanı Kimlik Bilgilerinin Doğru olduğunu doğrulayın. </h6> <p> Her şeyden önce, kimlik bilgilerinin ve özellikle şifrenin doğru olduğundan emin olun. makineyi geçmişte çekilmiş bir bilgisayar görüntüsünden klonladıysanız ve o zamandan beri kod değişti. </p> <h6> Yöntem 2. Yinelenen Bilgisayar Adlarını denetleyin. </h6> <p> Bilgisayar adının benzersiz olduğundan ve ağda aynı ada sahip başka bir bilgisayar olmadığından emin olun. </p> <h6> Yöntem 3. Yinelenen IP adreslerini denetleyin. </h6> <p> Bilgisayarın IP Adresinin benzersiz olduğundan ve Ağdaki başka bir IP Adresi ile çakışmadığından emin olun. </p> <h6> Yöntem 4. Etki Alanındaki Bilgisayarı Kaldırın ve Yeniden Katılın. </h6> <p> Bir bilgisayar ile etki alanı arasındaki güven ilişkisini düzeltmenin genel yöntemi, etkilenen bilgisayarı kaldırıp etki alanına yeniden eklemektir. </p> <h5> Adım 1. Etki Alanından Bilgisayar Hesabını Silin. </h5> <p> 1. Active Directory Sunucusunda oturum açın. <br> 2. Aç <strong> Aktif Dizin kulanıcıları ve bilgisayarları. <br> </strong> 3. Genişlet <strong> bilgisayarlar </strong> konteyner. <br> 4. Etkilenen bilgisayara sağ tıklayın ve <strong> Sil. </strong></p> <p><img src=\"images/image_thumb-39-366.png\" alt=\"Delete Computer Account from Domain\" loading=\"lazy\"></p> <h5> Adım 1. Etki Alanındaki Bilgisayarı Kaldırın ve Yeniden Katılın. </h5> <p> 1. Etkilenen bilgisayarda YEREL Yönetici hesabıyla (Bilgisayar adı\\Yönetici) oturum açın. </p> <p> 2. Windows&#39;a basın <img src=\"images/image_thumb8_thumb-480.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> $ </strong> Çalıştır komut kutusunu açmak için tuşlar. </p> <p> 2a. Tür <strong> sysdm.cpl </strong> &amp; Tıklayın <strong> TAMAM MI </strong> . </p> <p><img src=\"images/image_thumb7_thumb-169.png\" alt=\"system properties\" loading=\"lazy\"></p> <p> 3. &#39;Bilgisayar Adı&#39; sekmesinde <strong> Değişiklik </strong> . </p> <p><img src=\"images/image_thumb-37-924.png\" alt=\"Remove Computer from Domain\" loading=\"lazy\"></p> <p> 4. Üyesi&#39;nde, öğesini seçin. <strong> çalışma grubu </strong> , bir çalışma grubu adı yazın (ör. WORKGROUP&quot;) ve tıklayın <strong> TAMAM MI </strong> . </p> <p><img src=\"images/image_thumb-34-169.png\" alt=\"Change Computer Name - Membership\" loading=\"lazy\"></p> <p> 5. Yöneticinin kimlik bilgilerini yazın ve <strong> TAMAM MI </strong> . <br> 6. <strong> Tekrar başlat </strong> bilgisayar. </p> <p> 7. 1-4 arası adımları tekrar gerçekleştirin, ancak bu sefer 4. adımda, <strong> Alan adı, </strong> Alan Adını yazın ve tıklayın <strong> TAMAM MI. </strong></p> <p><img src=\"images/image_thumb-38-928.png\" alt=\"Add computer to domain\" loading=\"lazy\"></p> <p> 8. Etki Alanı Yöneticisi kimlik bilgilerini yazın ve <strong> TAMAM MI </strong> . <br> 9. <strong> Tekrar başlat </strong> PC&#39;niz ve etki alanı kullanıcı hesabını kullanarak etki alanına giriş yapın. </p> <h6> Yöntem 5. Etki Alanındaki Bilgisayar Hesabını Sıfırlayın. </h6> <p> 1. Active Directory Sunucusunda oturum açın. <br> 2. Aç <strong> Aktif Dizin kulanıcıları ve bilgisayarları. <br> </strong> 3. Genişlet <strong> bilgisayarlar </strong> konteyner. <br> 4. Etkilenen bilgisayara sağ tıklayın ve <strong> Hesabı Sıfırla. </strong></p> <p><img src=\"images/image_thumb-36-935.png\" alt=\"Reset Computer Account in Domain\" loading=\"lazy\"></p> <p> 5. Son olarak, <strong> tekrar başlat </strong> <strong> etkilenen makine </strong> ve Domain&#39;de oturum açın. </p> <p> Hepsi bu kadar millet! Hangi yöntem işinize yaradı? Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}