{"title":"DÜZELTME: Şu anda Harici USB Sürücüsünde bu klasöre erişim izniniz yok (Çözüldü)","content":"<p> Bu öğretici, Windows 10 yüklü bir HP dizüstü bilgisayarda harici bir USB diske erişmeye çalışırken aşağıdaki sorunu çözmek için ayrıntılı yönergeler içerir: &quot;Şu anda bu klasöre erişim izniniz yok. Bu klasöre kalıcı olarak erişmek için devam et&#39;i tıklayın&quot; . Sürücüye erişmek için &#39;Devam&#39; düğmesine bastıktan sonra bile hata devam ediyor. </p> <p><img src=\"images/image_thumb-18-636.png\" alt=\"You don't have permission to access this folder\" loading=\"lazy\"></p> <p> Yepyeni bir dosyada &quot;Bu klasöre erişim izniniz yok&quot; garip hatası görünüyor. <a href=\"http://www8.hp.com/us/en/products/laptops/product-detail.html?oid=17047142\" target=\"_blank\" rel=\"nofollow noopener\"> HP ProBook 450 G5 </a> dizüstü bilgisayar, kullanıcı bağlı bir USB diskin (Kalem sürücü, USB Sürücü, vb.) içeriğini görüntülemeye çalıştığında. </p> <p> Sorunu araştırdıktan sonra, sorunun güvenlik izinlerinden kaynaklandığını keşfettim. <a href=\"http://www8.hp.com/us/en/solutions/computer-security.html\" target=\"_blank\" rel=\"nofollow noopener\"> HP İstemci Güvenlik Yöneticisi </a> programı. HP Client Security Manager, Hewlett-Packard&#39;dan geliştirilmiş bir programdır ve bilgisayarınızın güvenliğini artırarak verilerinizi, aygıtınızı ve kimliğinizi korumanıza olanak tanır. </p> <h2> Nasıl düzeltilir: HP Dizüstü Bilgisayarda USB Sürücüsüne Erişim İzni Yok (Windows 10/8/7). </h2> <p> 1. Aç <strong> HP İstemci Güvenliği yöneticisi </strong> . </p> <p><img src=\"images/image_thumb-13-716.png\" alt=\"HP Client Security manager\" loading=\"lazy\"></p> <p> </p> <p> 2. Ardından üzerine tıklayın <strong> Cihaz Güvenliği. </strong></p> <p><img src=\"images/image_thumb-14-712.png\" alt=\"fix You Don't have permission to access this folder windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. <strong> Yöneticiler </strong> sekmesinde, &#39;Depolama kaldırma&#39; güvenliğini <strong> İzin Ver – Tam Erişim </strong> ve tıklayın <strong> Sunmak. </strong></p> <p><img src=\"images/image_thumb-15-364.png\" alt=\"fix You Don't have permission o access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Ek olarak (isterseniz), verin <strong> Tam erişim </strong> çıkarılabilir depolama ortamına <strong> Standart Kullanıcılar </strong> . </p> <p><img src=\"images/image_thumb-19-269.png\" alt=\"no permission to access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Son olarak, HP Device Access Manager&#39;ın sürücüdeki erişimi kontrol etmesini istemiyorsanız, şuraya gidin: <strong> Sürücü Ayarları </strong> ve ilgili anahtarı KAPALI konumuna getirin. </p> <p><img src=\"images/image_thumb-20-822.png\" alt=\"You don't have permission to access USB drive\" loading=\"lazy\"></p> <p> </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne veya daha iyisi için bir yorum bırakın: Bu sorunla ilgili sözcüğün yayılmasına yardımcı olmak için bu blog gönderisini sosyal ağlarda beğenin ve paylaşın. </p>"}