{"title":"DÜZELTME: Outlook DRAFTS klasörü Outlook 2013, 2010 veya 2007&#39;deki Gezinti Bölmesi&#39;nde Eksik. (Çözüldü)","content":"<p> Müşterilerimden birinde aşağıdaki sorun oluştu: Birdenbire ve belirgin bir neden olmadan Taslaklar klasörü Outlook 2013&#39;teki gezinme bölmesinde kayboluyor. Eksik Taslaklar klasörünü geri yüklemek için ilk eylem, diğer tüm Outlook klasörlerinde arama yapmaktır. klasörün yanlışlıkla taşınmadığından veya silinmediğinden emin olun. Eksik klasörü hala bulamıyorsanız, sorunu çözmek için aşağıdan devam edin. </p> <p><img src=\"images/image_thumb-37-460.png\" alt=\"Drafts folder Missing Outlook\" loading=\"lazy\"></p> <p> </p> <p> Bu öğretici, Outlook 2007, 2010, 2013, 2016 veya 365&#39;te eksik bir klasörü nasıl geri yükleyeceğinize ilişkin yönergeler içerir. </p> <h4> Outlook Gezinti bölmesinden Eksik Klasör Nasıl Geri Yüklenir. </h4> <h6> Yöntem 1. Sisteminizi Virüslere ve Kötü Amaçlı Yazılımlara karşı tarayın. </h6> <p> Outlook&#39;ta &quot;eksik klasörler&quot; sorununu çözmenin ilk adımı, sisteminizin virüs/kötü amaçlı yazılım içermediğinden emin olmaktır. Bu görev için bu kılavuzdaki talimatları izleyin: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Bilgisayarınızı Virüslere ve Diğer Kötü Amaçlı Programlara Karşı Nasıl Tararsınız. </a></p> <p> </p> <h6> Yöntem 2. Outlook Klasörlerini SIFIRLA. </h6> <p> Virüs taramasından sonra devam edin ve aşağıdaki işlemi kullanarak Outlook klasörlerini varsayılana sıfırlayın: </p> <p> 1. Outlook uygulamasını kapatın. <br> 2. tuşuna basın <strong> pencereler </strong> <img src=\"images/image_thumb8_thumb_thumb-622.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> $ </strong> Çalıştır komut kutusunu açmak için tuşlar. <br> 3. Arama kutusuna şunu yazın: <strong> görünüm / sıfırlama klasörleri </strong> &amp; Tıklayın <strong> TAMAM MI </strong> . </p> <p><img src=\"images/image_thumb-36-732.png\" alt=\"outlook reset folders\" loading=\"lazy\"></p> <p> </p> <p> 4. Outlook açılacak ve tüm eksik klasörler geri alınacaktır. </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? </p> <p> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}