{"title":"DÜZELTME: Outlook Alma hatası 0x80042108 (Çözüldü) bildirildi","content":"<p> Bu eğitici, Outlook Alma Raporlandı hatasını 0x80042108 düzeltmek için adım adım talimatlar içerir. Outlook 0x80042108 hatası, genellikle POP3 e-posta sunucusunun adını yanlış yazdığınızda veya İnternet erişiminiz olmadığında oluşur. </p> <p> Sorun ayrıntılardır. Outlook 2003, 2007, 2010 veya Outlook 2013, Gönder-Al prosedürü sırasında aşağıdaki hatayı görüntüler: &quot;Bildirilen hata (0x80042108): Outlook, gelen (POP3) e-posta sunucunuza bağlanamıyor. Bu mesajı almaya devam ederseniz , sunucu yöneticinize veya İnternet servis sağlayıcınıza (ISS) başvurun&quot;. </p> <p><img src=\"images/outlookerror_0x80042108-505.png\" alt=\"Outlook Error 0x80042108\" loading=\"lazy\"></p> <p> Outlook &quot;0x80042108&quot; hatası, Outlook&#39;un herhangi bir sürümünde (2016, 2013, 2010 veya 2007) oluşabilir ve Outlook e-posta istemci programı e-posta sunucusuna bağlanamadığında görünür. </p> <h4> Outlook 2007, 2010, 2013 veya 2016&#39;da Hata 0x80042108 Nasıl Onarılır. </h4> <h6> Adım 1. İnternet Bağlantınızı kontrol edin. </h6> <p> Outlook 80042108 alma hatasını çözmenin ilk adımı, İnternet bağlantınızı kontrol etmektir. Bu nedenle, İnternet bağlantınızın çalıştığından emin olmak için İnternet tarayıcınızı açın ve herhangi bir web sitesini ziyaret edin. </p> <h6> Adım 2. POP3 Posta Sunucusu ayarlarını doğrulayın. </h6> <p> Outlook&#39;un 0x80042108 alma hatasını düzeltmenin ikinci adımı, doğru e-posta sunucusu ayarlarını belirtip belirtmediğinizi kontrol etmektir. Bu nedenle, E-posta sağlayıcınıza başvurun ve gelen Posta Sunucusu Adını ve Bağlantı Noktası numarasını doğru yazdığınızı doğrulayın. E-posta sunucusu ayarlarını görüntülemek ve değiştirmek için: </p> <p> 1. Outlook&#39;u açın. <br> 2. Git <strong> Dosya </strong> –&gt; <strong> Hesap ayarları </strong> . </p> <p><img src=\"images/image_thumb-7-811.png\" alt=\"switch Account Mail Merge \" loading=\"lazy\"></p> <p> </p> <p> 3. İçinde <strong> E-posta </strong> sekmesinde, ayarlarını değiştirmek/görüntülemek için e-posta hesabınıza çift tıklayın. <br> 4. İlgili kutuda doğru Gelen Posta Sunucusu adını belirlediğinizi doğrulayın. <br> 5. Bittiğinde, tıklayın <strong> Daha fazla ayar </strong> . </p> <p><img src=\"images/image_thumb-31-256.png\" alt=\"FIX: Outlook Receiving reported error 0x80042108\" loading=\"lazy\"></p> <blockquote><p> </p></blockquote> <p> 6. <strong> ileri </strong> sekmesine gidin ve Gelen sunucusu (POP3) için doğru bağlantı noktası ve SSL ayarını belirttiğinizi doğrulayın. </p> <p> </p> <p><img src=\"images/image_thumb-33-400.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Bittiğinde tıklayın <strong> TAMAM MI </strong> ve ardından tüm açık pencereleri kapatın. <br> 7. Outlook&#39;u yeniden test edin. </p> <h6></h6> <h6> 3. Adım. Antivirüs ve Güvenlik Duvarı ayarlarınızı kontrol edin. </h6> <p> E-posta tarama özelliklerine sahip bir virüsten koruma programı kullanıyorsanız, <a href=\"https://www.repairwin.com/how-to-disable-add-ins-in-word-outlook-or-excel-2016-2013-2010-2007-or-2003/\" target=\"_blank\" rel=\"nofollow noopener\"> Outlook&#39;ta Antivirüs Eklentisini devre dışı bırakın </a> veya Antivirus korumasını geçici olarak devre dışı bırakın veya Antivirus programını kaldırın. Ayrıca Güvenlik Duvarı ayarlarınızı kontrol edin ve kullandığınız e-posta sunucusu bağlantı noktalarının Güvenlik Duvarı programından engellenmediğinden emin olun. Daha spesifik olarak, Güvenlik Duvarı ayarlarınızda: </p> <p> A. İnternete erişmek için aşağıdaki dosyaları etkinleştirin: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. İnternete erişmek için aşağıdaki bağlantı noktalarını etkinleştirin: </p> <ul> <li><strong> 110 numaralı bağlantı noktası </strong> (Şifreli bağlantı olmadan bir POP3 Gelen Posta Sunucusu kullanıyorsanız) * </li> <li><strong> 995 numaralı bağlantı noktası </strong> (Şifreli bağlantıya sahip bir POP3 Gelen Posta Sunucusu kullanıyorsanız (SSL Etkin) </li> </ul> <ul> <li><strong> 143 numaralı bağlantı noktası </strong> (şifreli bağlantı olmadan bir IMAP Gelen Posta Sunucusu kullanıyorsanız) </li> <li><strong> 993 numaralı bağlantı noktası </strong> (şifreli bağlantıya sahip bir IMAP Gelen Posta Sunucusu kullanıyorsanız (SSL Etkin) </li> </ul> <ul> <li><strong> 25 numaralı bağlantı noktası </strong> SMTP Giden Posta sunucunuz SSL kullanmıyorsa. * </li> <li><strong> 465 numaralı bağlantı noktası </strong> veya <strong> 587 </strong> SMTP Giden Posta sunucunuz SSL kullanıyorsa </li> </ul> <p> * Not: Varsayılan olarak, 25 numaralı bağlantı noktası giden erişim içindir ve 110 numaralı bağlantı noktası gelen erişim içindir. Bağlantı noktalarından emin değilseniz, ISS&#39;nize veya sistem yöneticinize başvurun. </p> <p> </p> <p><strong> Ek yardım: </strong> Yukarıdaki yöntemler size yardımcı olmazsa, aşağıdakileri deneyin: </p> <p><strong> A. </strong> E-posta hesabınızı tekrar kaldırın ve ekleyin. <br> <strong> B. </strong><a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Outlook PST veri dosyasını onarın </a> . <br> <strong> C. </strong> VPN Bağlantısıyla bağlantıyı kesin (bağlıysanız) <br> <strong> D. </strong> Office Kurulumunu Onarın. Bunu yapmak için: </p> <blockquote><p> 1. Windows&#39;a gidin <strong> Kontrol Paneli </strong> &gt; <strong> Programlar ve Özellikler </strong> . <br> 2. MS Office uygulamasını bulup seçin ve ardından <strong> Değişiklik </strong> . <br> 3. Ardından <strong> Tamir etmek </strong> seçenek. </p></blockquote> <p> </p> <p> </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? </p> <p> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}