{"title":"DÜZELTME: Güvenli olmadığı ve eski SMB1 protokolünü gerektirdiği için dosya paylaşımına bağlanılamıyor. (Çözüldü)","content":"<p> Windows 10 bilgisayardan bir ağ paylaşımlı klasörüne bağlanmaya çalışırsanız ve &quot;Güvenli olmadığı için dosya paylaşımına bağlanamazsınız. Bu paylaşım, güvenli olmayan ve ifşa olabilecek eski SMB1 protokolünü gerektirir. saldırmak için sisteminiz. Sisteminiz SMB2 veya üstü gerektirir. Bu sorunu çözme hakkında daha fazla bilgi için bkz. </p> <p><img src=\"images/image_thumb-30-812.png\" alt=\"You can't connect to the file share because it's not secure. This share requires the obsolete SMB1 protocol, which is unsafe...\" loading=\"lazy\"></p> <p> Windows 10 v1709 ve sonraki sürümlerde, Sunucu İleti Bloğu sürüm 1 (SMBv1) ağ protokolü varsayılan olarak yüklenmez ve SMBv1 protokolünü kullanan bir iş istasyonunda veya sunucuda paylaşılan bir klasöre erişmek istiyorsanız manuel olarak etkinleştirilmelidir. dosya paylaşımı. </p> <p> Bu öğretici, Windows 10&#39;da paylaşılan bir klasöre bağlanmaya çalışırken aşağıdaki hataları çözmek için talimatlar içerir: </p> <ul> <li> <p><em> Güvenli olmadığı için dosya paylaşımına bağlanamazsınız. Bu paylaşım, güvenli olmayan eski SMB1 protokolünü gerektirir… </em></p> </li> <li> <p><em> Belirtilen ağ adı artık mevcut değil </em></p> </li> <li> <p><em> Belirtilmemiş hata 0x80004005 </em></p> </li> <li> <p><em> Belirtilen sunucu istenen işlemi gerçekleştiremiyor. </em></p> </li> </ul> <h4> DÜZELTME: SMBv1 Protokolü Eksik Olduğundan Dosya Paylaşımına Bağlanamıyor (Windows 10) </h4> <p> 1. Şuraya gidin: <strong> Kontrol Paneli </strong> -&gt; <strong> Programlar ve Özellikler </strong> . <br> 2. tıklayın <strong> Windows özelliklerini açma veya kapatma </strong> soldan. </p> <p> </p> <p><img src=\"images/image_thumb-68-359.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. &#39;SMB 1.0/CIFS Dosya Paylaşım Desteği&#39; seçeneğini genişletin ve <strong> Kontrol </strong> <strong> SMB 1.0/CIFS İstemcisi </strong> seçenek. Tıklayın <strong> TAMAM MI </strong> bittiğinde. </p> <p><img src=\"images/image_thumb-29-360.png\" alt=\"Install SMBv1 Windows 10\" loading=\"lazy\"></p> <p> 4. SMB 1.0/CIFS kurulduğunda ve ardından <strong> Şimdi yeniden başlat </strong> PC&#39;nizi yeniden başlatmak için düğmesine basın. </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}