{"title":"DÜZELTME: VMware Araçlarını Yükle seçeneği Grileştirildi. (Çözüldü)","content":"<p> VMware Tools&#39;u &quot;Install VMware Tools&quot; seçeneği gri olduğu için çalışan konuk üzerine yükleyemiyorsanız, aşağıdaki okumaya devam edin. VMware Tools, konuk sanal makinesinde daha hızlı grafik performansı, gelişmiş fare performansı ve en önemlisi: Ana Bilgisayar ve Konuk makinesi arasında kopyalama ve yapıştırma yeteneği gibi çeşitli özellikleri etkinleştiren ücretsiz bir hizmetler ve modüller setidir. Bu nedenle, konuk işletim sistemi VMware Tools olmadan çalışabilse de, ekstra VMware özelliklerini etkinleştirmek istiyorsanız VMware araçlarının yüklenmesi gerekir. </p> <p> VMware Tools&#39;u kurmanın olağan yolu, konuk makineyi başlatmak ve ardından &quot;Oyuncu&quot; menüsünden seçim yapmaktır. <strong> Yönet </strong> &gt; <strong> VMware Tools&#39;u yükleyin </strong> . Ancak, işletim sistemini kurduğunuzda sanal makinenin sanal CD/DVD sürücüsünü bir ISO görüntü dosyasına bağladıysanız, &quot;VMware Araçlarını Kur&quot; seçeneği grileşir. </p> <p><img src=\"images/image_thumb-45-164.png\" alt=\"FIX VMware Tools option is Grayed Out\" loading=\"lazy\"></p> <p> </p> <p> Bu öğretici, VMware Workstation Player&#39;da aşağıdaki sorunu düzeltmeye yönelik yönergeler içerir. Konuk makinesinde &quot;VMware Araçlarını Yükle&quot; seçeneği gri renktedir. </p> <h4> &#39;VMware Araçlarını Kur&#39; seçeneği Grileşmişse VMware Araçları Nasıl Kurulur. </h4> <p> </p> <p> 1. Sanal Makineyi Kapatın. <br> 2. Sanal makineye sağ tıklayın ve seçin <strong> Ayarlar </strong> . </p> <p><img src=\"images/image_thumb-39-377.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. <strong> CD/DVD </strong> sürücü ve ardından tıklayın <strong> Kaldırmak </strong> . </p> <p><img src=\"images/image_thumb-43-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Ardından <strong> disket </strong> sürücü, tıklayın <strong> Kaldırmak </strong> ve ardından tıklayın <strong> TAMAM MI </strong> Ayarlar seçeneklerini kapatmak için </p> <p><img src=\"images/image_thumb-44-469.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Başlat </strong> Sanal Makine. <br> 6. &#39;Oyuncu&#39; menüsünden <strong> Yönet </strong> ve tıklayın <strong> VMware Tools&#39;u yükleyin. </strong></p> <p><img src=\"images/image_thumb-42-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> Bu kadar! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}