{"title":"iLO arabiriminden bir HP Sunucusu Nasıl Yeniden Başlatılır.","content":"<p> Bu öğreticide, HP&#39;nin iLO arabirimini kullanarak bir HP sunucusunun uzaktan nasıl yeniden başlatılacağına ilişkin adım adım yönergeler bulacağız. HP Integrated Lights-Out (iLO), HP sunucularında bulunan ve genellikle sistem kartına tümleşik olan bir donanım bileşenidir. iLO bileşeninin kendi ağ bağlantısı, IP adresi ve web arayüzü vardır ve kullanıcının sunucuya uzaktan erişmesine ve sunucuyu yönetmesine yardımcı olabilir. </p> <h4> iLO 5 web arabirimini kullanarak bir HP Sunucusunu Yeniden Başlatma. </h4> <p> Bir sunucu askıda kalırsa, iLO arabiriminden yeniden başlatmak için: </p> <p> 1. Başka bir bilgisayardan bir web tarayıcısı açın ve adres çubuğuna, yeniden başlatmak istediğiniz sunucudaki iLO arabiriminin IP adresini yazın. <br> 2. iLO kullanıcı adını ve parolayı yazın ve <strong> Oturum aç </strong> . </p> <p><img src=\"images/image_thumb-8-790.png\" alt=\"restart hp proliant server from ilo\" loading=\"lazy\"></p> <p> </p> <p> 3. Seçin <strong> Güç ve Termal </strong> soldaki. <br> 4. Sanal Güç Düğmesi bölümünde, <strong> Sıfırla </strong> HP sunucunuzu yeniden başlatmak için düğmesine basın. * </p> <p> * Bilgi: </p> <ul> <li> sanal <strong> Sıfırla </strong> düğmesi ile aynı işleve sahiptir. <strong> Tekrar başlat </strong> işletim sisteminde komut (sıcak önyükleme). </li> <li> sanal <strong> Soğuk bot </strong> düğmesi ile aynı eyleme sahiptir <strong> Kapat </strong> işletim sisteminde komut. &#39;Soğuk Önyükleme&#39; düğmesine basarsanız, sunucu kapanacak ve yaklaşık 8 saniye sonra yeniden başlayacaktır. </li> </ul> <p> <img src=\"images/image_thumb-9-784.png\" alt=\"How to Reboot an HP Server using iLO 5 web interface.\" loading=\"lazy\"></p> <p> </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}