{"title":"NASIL YAPILIR: İnternet Geçmişini, Şifreleri ve Çerezleri Web Tarayıcınızdan (Chrome, Firefox, IE) Silin","content":"<p> Web tarayıcınızla bir web sitesini ziyaret ettiğinizde, web sitesi tarayıcıya bazı bilgiler gönderir ve tarayıcı bu bilgileri küçük metin dosyalarında saklar. <strong> kurabiye </strong> s. Çerezler, kullanıcının o web sitesine yönelik tercihlerini saklar, ör. kullanıcı aynı web sitesine geri döndüğünde oturum açma bilgilerini (kullanıcı adı ve/veya şifre) yeniden girmek zorunda kalmaz. Çerezler ayrıca kullanıcının web sitesinin hangi sayfalarını ziyaret ettiğinin bir geçmişini tutabilir, böylece kullanıcı istediğini bulana kadar onları hatırlamak veya web sitesinin tüm sayfalarında gezinmek zorunda kalmaz. </p> <p> Aynı zamanda, bir web sitesini ziyaret ettiğinizde, tarayıcı, bağlantı bant genişliğinden tasarruf etmek ve bir sonraki ziyaretinizde web sayfalarının yüklenme süresini azaltmak için ziyaret ettiğiniz tüm web sayfalarının yerel bir kopyasını saklar. Bu &quot;web sayfalarının yerel kopyası&quot;, &quot; <strong> Geçici internet dosyaları </strong> &quot; nın-nin <strong> önbellek </strong> . </p> <p> Çerezler ve Önbellek, bir süre sonra önemli miktarda disk alanı tutabilir ve bunları temizleme ihtiyacı vardır. Diğer durumlarda, web sitesinin içeriğini tamamen yeniden yüklemek için veya güvenlik ve gizlilik nedenleriyle tarayıcı önbelleğini ve çerezleri silmeniz gerekebilir: ör. istemiyorsanız, hangi web sayfalarını ziyaret ettiğinizi öğrenmek için üçüncü bir kişi (aka: &quot; <strong> Arama geçmişi </strong> &quot;) veya bir web sitesine giriş bilgilerinizdir (ör. GMAIL). </p> <p> Bu eğitimde, Tarama Geçmişini, Geçici İnternet Dosyalarını (Önbellek) ve Çerezleri Internet Explorer, Chrome ve Firefox&#39;tan silmenin iki (2) kolay yolunu bulacaksınız. </p> <h4> Chrome, Firefox ve Internet Explorer&#39;da Web Tarama Geçmişi, Kayıtlı Şifreler ve Çerezler Nasıl Temizlenir. </h4> <h5><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Yöntem 1. Belirli Bir Tarayıcıdan Tarama Verilerini Temizleyin. </a></h5> <h5><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Yöntem 2. Tek Tıklamayla Tüm Web Tarayıcılarından Tarama Verilerini Silin! </a></h5> <p> </p> <h5> Yöntem 1. Belirli Bir Tarayıcıdan Geçmişi, Önbelleği ve Tanımlama Bilgilerini Sil. </h5> <p> Genel olarak, her web tarayıcısının Ayarlar / Seçenekler menüsü aracılığıyla saklanan tarama verilerini kaldırma seçenekleri vardır, ancak bu seçeneklere kolayca erişmek istiyorsanız (farenizle tarayıcı menüsünde gezinmek zorunda kalmadan), ardından düğmesine basın. <strong> Ctrl </strong> + <strong> Vardiya </strong> + <strong> Sil </strong> açık tarayıcı pencerenizde tuşları birlikte kullanın. Yani… </p> <p><strong> Internet Explorer&#39;dan tarama geçmişini, önbelleği ve tanımlama bilgilerini silmek için: </strong></p> <p> 1. Internet Explorer&#39;ı açın ve <strong> Ctrl </strong> + <strong> Vardiya </strong> + <strong> Sil. <br> </strong> 2. Ne tür bilgileri silmek istediğinizi seçin ve <strong> Sil </strong> buton. </p> <p><img src=\"images/image_thumb-18-750.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> Chrome&#39;dan göz atma geçmişini, önbelleği ve çerezleri silmek için: </strong></p> <p> 1. Chrome&#39;u başlatın ve <strong> Ctrl </strong> + <strong> Vardiya </strong> + <strong> Sil. <br> </strong> 2. Ne tür bilgilerin silinmesini istediğinizi seçin ve ardından <strong> NET VERİLER </strong> . </p> <p><img src=\"images/image_thumb-19-667.png\" alt=\"clear chrome history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p><strong> Firefox&#39;tan tarama geçmişini, önbelleği ve çerezleri silmek için: </strong></p> <p> 1. Firefox&#39;u açın ve aynı anda <strong> Ctrl </strong> + <strong> Vardiya </strong> + <strong> Sil. <br> </strong> 2. Firefox&#39;tan kaldırmak istediğiniz verileri seçin ve <strong> Şimdi Temizle. </strong></p> <p> </p> <p><img src=\"images/image_thumb-20-864.png\" alt=\"clear firefox history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> Yöntem 2. Tarayıcı Geçmişini, Önbelleği ve Tanımlama Bilgilerini tüm Web Tarayıcılarından aynı anda silin. </h5> <p> Hayatınızı kolaylaştırmak istiyorsanız, o zaman kullanabilirsiniz. <a href=\"https://www.ccleaner.com/\" target=\"_blank\" rel=\"nofollow noopener\"> CCleaner </a> Kullandığınız tüm Web Tarayıcılarından Geçici İnternet Dosyalarını, Geçmişi ve Çerezleri tek bir tıklamayla kolayca silmek için yardımcı program. </p> <p> 1. <a href=\"https://www.ccleaner.com/ccleaner/download\" target=\"_blank\" rel=\"nofollow noopener\"> İndir </a> ve CCleaner yardımcı programının Ücretsiz sürümünü yükleyin. </p> <p> 2. Başlat <strong> CCleaner </strong> ve şuraya gidin <strong> pencereler </strong> ve <strong> Uygulamalar </strong> sekme seçenekleri, web tarayıcılarından hangi bilgilerin silinmesini istediğinizi seçmek için. </p> <p> 3. Bittiğinde tıklayın <strong> Temizleyici Çalıştır </strong> . </p> <p><img src=\"images/image_thumb-21-173.png\" alt=\"clear internet history cache cookies - ccleaner\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Bu kadar! İşinize yaradı mı? </p> <p> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}