{"title":"uTorrent&#39;te Tohumlama Nasıl Durdurulur.","content":"<p> Büyük dosyaları İnternet üzerinden indirmek veya paylaşmak için en popüler P2P istemcisi olduğu için, çoğumuz uTorrent&#39;i yıllar boyunca film veya diğer dosyaları indirmek için kullandık. Ancak bazen uTorrent&#39;te tohumlamayı durdurmanız gerekir, çünkü büyük bir dosyayı (uTorrent aracılığıyla) yüklemek veya indirmek için mevcut tüm İnternet bant genişliğine (hıza) ihtiyacınız vardır. </p> <p> Bu makalede, uTorrent&#39;te tohumlamanın nasıl tamamen devre dışı bırakılacağı ve indirdikten sonra tohumlamanın nasıl durdurulacağı hakkında adım adım talimatlar bulacaksınız. </p> <h2> uTorrent&#39;te Tohumlama Nasıl Kapatılır. </h2> <p> A. uTorrent&#39;te dosya indirirken veya yüklerken tohumlamayı geçici olarak durdurmak için: </p> <p> 1. Torrent Feed&#39;inizdeki torrent&#39;e tıklayın ve <strong> DUR </strong> düğmesine basın veya <strong> geri dönüşüm </strong> tohumlama dosyasını listeden kaldırmak için simge. </p> <p><img src=\"images/image_thumb-51-323.png\" alt=\"Stop Seeding uTorrent\" loading=\"lazy\"></p> <p> </p> <p> B. uTorrent tohumlamayı tamamen devre dışı bırakmak için aşağıdakileri yapın: </p> <p> 1. Gönderen <strong> Seçenekler </strong> menü, tıklayın <strong> Tercihler. </strong></p> <p><img src=\"images/image_thumb-52-513.png\" alt=\"uTorrent Preferences\" loading=\"lazy\"></p> <p> </p> <p> 2. İçinde <strong> Bant genişliği </strong> seçenekleri, aşağıdaki değişiklikleri yapın ve ardından <strong> TAMAM MI. </strong></p> <ul> <li> Yı kur <strong> Maksimum Yükleme Hızı (kB/s) </strong> için <strong> 1 </strong> . </li> <li> Yı kur <strong> Torrent başına yükleme yuvası sayısı </strong> için <strong>0</strong> . </li> </ul> <p><img src=\"images/image_thumb-53-961.png\" alt=\"disable seeding uTorrent\" loading=\"lazy\"></p> <p> </p> <p> C. Torrent dosyası indirildiğinde uTorrent tohumlanmasını otomatik olarak önlemek için. </p> <p> 1. Gönderen <strong> Seçenekler </strong> menü, tıklayın <strong> Tercihler. <br> </strong> 2. <strong> </strong> İçinde <strong> Kuyruk </strong> seçenekleri, aşağıdaki değişiklikleri yapın ve ardından <strong> TAMAM MI. </strong></p> <ul> <li> Yı kur <strong> Minimum Oran (%) </strong> için <strong>0</strong></li> <li> Yı kur <strong> Minimum ekim süresi (dakika) </strong> için <strong>0</strong></li> <li> Yı kur <strong> Minimum mevcut tohum sayısı </strong> için <strong> 0</strong></li> <li><strong> Kontrol </strong> <strong> Yükleme hızını sınırlayın </strong> onay kutusu ve türü <strong>0</strong> kutuda. </li> </ul> <p><img src=\"images/image_thumb-54-589.png\" alt=\"prevent utorrent seeding\" loading=\"lazy\"></p> <p> Hepsi bu kadar millet! Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}