{"title":"ÜCRETSİZ Outlook Express DBX dosyası nasıl kurtarılır.","content":"<p> Outlook Express, ilk olarak Windows XP&#39;de görülen bir e-posta istemci programıdır. Ancak bugün bile (2018 yılı) bazı müşteriler bunu ana E-posta programları olarak kullanmaya devam ediyor. Outlook Express&#39;in temel sorunlarından biri 2GB limit sorunudur. </p> <p> Outlook Express&#39;te 2 GB boyut sınırı sorununun açıklaması. <br> Ana Outlook Express klasörlerinden biri (örneğin, &quot;Gelen Kutusu&quot; veya &quot;Gönderilen&quot;) 2 GB&#39;ı aştığında, ilgili OE DBX mağaza dosyası bozulabilir ve OE klasörü boş görünebilir. Sorunun bir sonucu olarak, Outlook Express e-posta Gönderemez veya Alamaz ve hatayı görüntüler. <a href=\"https://www.repairwin.com/fix-outlook-express-error-0x800c0133-due-to-2gb-size-limit/\" target=\"_blank\" rel=\"nofollow noopener\"> 0x800c0133 </a> Gönder/Al işlemi sırasında. </p> <p> Bu eğitimde size Outlook Express&#39;ten bozuk bir DBX dosyasını nasıl onaracağınızı ve e-postalarınızı nasıl geri alacağınızı göstereceğim! </p> <h4> Bozuk Outlook Express DBX Dosyası Nasıl Düzeltilir. </h4> <p> Outlook Express klasörlerinden biri (gelen kutusu, Gönder vb.) bozulursa, DBX mağaza klasörünü onarmak ve e-postalarınızı geri almak için aşağıdaki talimatları izleyin. </p> <h6> Adım 1. Gizli Dosyalar Görünümünü Etkinleştirin. </h6> <p> 1. Windows Gezgini&#39;ni açın. <br> 2. <strong> Araçlar </strong> menü seç <strong> Dosya seçenekleri </strong> . <br> 3. Görünüm sekmesinde, <strong> Gizli dosya ve klasörleri göster </strong> ve tıklayın <strong> TAMAM MI. </strong></p> <p><img src=\"images/image_thumb-2-290.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Adım 2. Diskinizde Bozuk Outlook Express DBX dosyasını bulun. </h6> <p> 1. Outlook Express mağaza klasörünü açın. Genellikle bu klasör diskinizde aşağıdaki yolda bulunur: </p> <ul> <li> C:\\Documents and Settings\\\\Local Settings\\Application Data\\Identities\\{}\\Microsoft\\ <strong> Outlook Ekspres </strong></li> </ul> <blockquote><p> Örneğin. “C:\\Documents and Settings\\Kullanıcı\\Local Settings\\Application Data\\Identities\\{D8F3C56D-965E-41AE-8A23-A58460ABAE00}\\Microsoft\\ <strong> Outlook Ekspres </strong> ” </p></blockquote> <p> 3. Explorer&#39;dan <strong> Görünüm </strong> menü seç <strong> Ayrıntılar </strong> . <br> 4. Hangi DBX dosyasının 2GB depolama sınırını aştığını veya bozuk DBX dosyasını bulun. (bozuk DBX dosyası, Outlook Express programında boş görünen MAIL klasörüdür). </p> <p><img src=\"images/image_thumb-3-887.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Bu DBX dosyasını diskinizdeki başka bir konuma kopyalayın (örneğin, masaüstünüzde &quot;CorruptedDBX&quot; adlı yeni bir klasöre). </p> <p> </p> <h6> Adım 3. UnDBX – Ücretsiz DBX Outlook Express Kurtarma Yardımcı Programını İndirin. </h6> <p> UnDBX, içerdiği tüm Outlook Express e-postalarını .eml biçiminde çıkarabilen mükemmel ve ücretsiz bir Outlook Express DBX Onarım Aracıdır. Ayrıca, bozuk bir Outlook Express .DBX dosyasını düzeltme ve onarma seçeneğine de sahiptir. </p> <p> UnDBX&#39;i şuradan indirebilirsiniz: <a href=\"https://sourceforge.net/projects/undbx/\" target=\"_blank\" rel=\"nofollow noopener\"> İşte </a> . </p> <p> </p> <h6> Adım 4. E-postaları bozuk Outlook Express DBX dosyasından kurtarın. </h6> <p> 1. Bozuk DBX dosyasındaki e-postaları kurtarmak için, UnDBX yardımcı programını çalıştırmak için çift tıklayın. <br> 2. UnDBX yardımcı programında: </p> <blockquote><p> 1. Outlook Express .dbx dosyalarını içeren klasörü seçin ve ardından <strong> Kontrol </strong> &quot; <strong> Kurtarma modunu etkinleştir </strong> &quot;seçeneği aşağıda. <br> 2. <strong> Bir hedef klasör seçin </strong> .eml dosyalarını saklamak (ayıklamak) için bilgisayarınızda. (örneğin, masaüstünüzde &quot;RecoveredInbox&quot; adlı bir klasöre) <br> 3. Son olarak tıklayın <strong> Kurtarmak </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-645.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. UnDBX kurtarma işlemi tamamlandığında Outlook Express&#39;i açın. <br> 4. UnDBX&#39;in ayıklanan .eml dosyalarını kaydettiği klasöre gidin. <br> 5. Çıkarılan e-postaları ilgili klasöre (Outlook Express&#39;te) sürükleyip bırakın. * </p> <p><strong> * Öneri: </strong> Outlook Express klasörlerinin tekrar bozulmasını önlemek (veya 2 GB sınırını atlamak için), e-postaları gruplar halinde (örneğin yıllara göre) sürükleyip bırakmanızı ve OE&#39;de farklı klasörlere koymanızı öneririm. Örneğin, yalnızca geçerli yıla ait e-postaları seçin ve bunları, geçerli yılla (ör. &quot;Gelen Kutusu 2018&quot;) adlı yeni bir OE klasörüne sürükleyip bırakın. Ardından, önceki yıllardaki diğer tüm e-postalardaki aynı adımları tekrarlayın. </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}