{"title":"Windows 10&#39;da YouTube Nasıl Engellenir.","content":"<p> Uzaktan eğitim son yıllarda çocukların hayatlarının bir parçası haline geldiğinden, birçok ebeveyn, e-öğrenme sırasında YouTube videolarını engellemenin veya çocukların başka etkinlikler yapmak yerine bilgisayar başında video izleyerek geçirdikleri süreyi azaltmanın bir yolunu arıyor. </p> <p> Ebeveynleri endişelendiren YouTube bağımlılığının yanı sıra, son yıllarda çocuklar için uygunsuz veya tehlikeli içeriğe sahip birçok YouTube videosu yayınlanmıştır ve bu nedenle özellikle ebeveynlerin gözetimi olmadığı durumlarda YouTube erişiminin kısıtlanması gerekmektedir. </p> <p> Bu kılavuzda, tüm tarayıcılarda YouTube web sitesine erişimi nasıl engelleyeceğinizi öğreneceksiniz. * </p> <p> * Not: Bir web sitesini yalnızca Chrome veya Firefox&#39;ta engellemek istiyorsanız bu makaleyi okuyun: <a href=\"https://www.repairwin.com/block-websites-on-chrome-firefox/\" target=\"_blank\" rel=\"nofollow noopener\"> Chrome ve Firefox&#39;ta Web Siteleri Nasıl Engellenir? </a></p> <h2> Windows 10, 8 veya 7 İşletim Sisteminde Herhangi Bir Tarayıcıda YouTube Nasıl Engellenir. </h2> <p> Windows PC&#39;deki herhangi bir tarayıcıda herhangi bir web sitesini engellemenin en güvenilir yolu &quot;hosts&quot; dosyasını kullanmaktır. <strong> ev sahibi </strong> file, ana bilgisayar adlarını (etki alanı adlarını) IP adreslerine eşleyen bir işletim sistemi dosyasıdır. Basit bir ifadeyle, tarayıcınıza bir web sitesinin adresini yazdığınızda, bilgisayar önce yerel adrese bakar. <strong> ev sahibi </strong> IP Adresini çözmek için dosya. Ana bilgisayar dosyasında site adı görünmüyorsa, cihazınızda kullandığınız DNS hizmetinden IP adresini bulmaya çalışıyordur. </p> <p> Ana bilgisayar dosyası aracılığıyla Windows&#39;ta herhangi bir web tarayıcısında (ör. Chrome, Firefox, Edge vb.) YouTube&#39;u engellemek için: </p> <p> 1. Aç <strong> not defteri </strong> uygulama <strong> Yönetici olarak </strong> . Bunu yapmak için: </p> <blockquote><p> bir. Tür <strong> not defteri </strong> arama kutusunda </p> <p> b. <strong> Sağ tık </strong> üzerinde <strong> not defteri </strong> ve seçin <strong> Yönetici olarak çalıştır </strong> . </p> <p><img src=\"images/image_thumb-584.png\" alt=\"run notepad as administrator\" loading=\"lazy\"></p></blockquote> <p> </p> <p> 2. Gönderen <strong> Dosya </strong> menü, seç <strong> Açık. <br> </strong> 3. Diskinizde şu konuma gidin: </p> <ul> <li> C:\\Windows\\System32\\sürücüler\\vb </li> </ul> <p> 4. &quot;Dosya türü&quot;nü şu şekilde değiştirin: <strong> Tüm dosyalar </strong> ve sonra aç <strong> ev sahibi </strong> dosya </p> <p><img src=\"images/image_thumb-1-968.png\" alt=\"block sites hosts file\" loading=\"lazy\"></p> <p> </p> <p> 5. Sonuna aşağıdaki satırları ekleyin:* </p> <ul> <li> 127.0.0.1    youtube.com </li> <li> 127.0.0.1    www.youtube.com </li> <li> 127.0.0.1    m.youtube.com </li> </ul> <p> * Not: 127.0.0.1 yazdıktan sonra SEKME tuşuna basın. </p> <p><img src=\"images/image_thumb-2-460.png\" alt=\"block youtube hosts\" loading=\"lazy\"></p> <p> </p> <p> 6. Bittiğinde, tıklayın <strong> Dosya </strong> &gt; <strong> Kayıt etmek </strong> ve not defterini kapatın. </p> <p> 7. Son olarak tarayıcınızı açın ve YouTube&#39;u ziyaret etmeyi deneyin. Normalde şu mesajı almalısınız: &quot;İnternete bağlanın. Çevrimdışısınız. Bağlantınızı kontrol edin&quot;. </p> <p><img src=\"images/image_thumb-3-490.png\" alt=\"block youtube.com hosts\" loading=\"lazy\"></p> <p> </p> <p> 8. İşiniz bitti. Gelecekte YouTube&#39;un engellemesini kaldırmak isterseniz, aynı adımları uygulamanız yeterlidir. ancak bu sefer hosts dosyasına eklenen üç (3) satırı kaldırın veya sembolünü yazın <strong> # </strong> eklenen her satırın önünde. </p> <p> Hepsi bu kadar millet! Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}