{"title":"Windows 10/8/7&#39;de Otomatik Oturum Açma (Parola Yazmadan).","content":"<p> Bu eğitici, Windows 10&#39;da nasıl otomatik oturum açılacağına ilişkin talimatlar içerir. Aslında, Oturum Açma veya Kilit ekranında kimlik bilgilerinizi girmek zorunda kalmadan kullanıcı hesabınıza (Microsoft, Yerel veya Etki Alanı hesabı) otomatik olarak nasıl oturum açacağınızı öğreneceksiniz . Talimatlar Windows 10/8/7 işletim sistemi için geçerlidir. </p> <p> Yeni bir Windows 10 kurulumu gerçekleştirdiğinizde, bilgisayarı kullanmak için bir kullanıcı hesabı ve bir parola belirtmeniz istenecektir. Bu adımda, Microsoft hesabınızı (MS hesabı parolanızla) kullanabilir veya Windows&#39;ta oturum açmak için yeni bir Yerel Hesap ve yeni bir parola oluşturabilirsiniz. Her iki durumda da (boş parolayla yerel bir hesap oluşturmadığınız sürece), Windows&#39;u her başlattığınızda parolanızı yazmanız istenir. </p> <p> Kendi bilgisayarınızı bir parola ile korumak, özellikle bilgisayarınızı başkalarıyla paylaşıyorsanız veya dizüstü bilgisayarınızla seyahat ederken veya bilgisayarınız bir iş ortamına aitse, iyi bir güvenlik önlemidir. Ancak, bağımsız masaüstü bilgisayarınızdaki tek kullanıcı sizseniz veya dizüstü bilgisayarınızı yalnızca evde kullanıyorsanız, onu her kullanmak istediğinizde kimlik bilgilerinizi yazmanıza gerek yoktur. * </p> <p><strong> Uyarı: </strong> Bilgisayarınızı başkalarıyla paylaşıyorsanız veya dizüstü bilgisayarınız veya tabletinizle seyahat ediyorsanız, Windows&#39;ta OTOMATİK OTURUM AÇMAYI ETKİNLEŞTİRMEYİN, çünkü bilgisayarınızı bulan herkes dosyalarınıza kolayca erişebilir. </p> <h4> Windows 10/8/7/Vista&#39;da Kullanıcı Hesabınızda Otomatik Olarak Nasıl Oturum Açılır. (Otomatik Girişi Etkinleştir) </h4> <h6> Yöntem 1. AUTOLOGON yardımcı programını kullanarak Otomatik Oturum Açma&#39;yı açın. </h6> <p> Microsoft, Windows&#39;ta oturum açma işlemini otomatikleştirmek için bir araç tasarladı. Aracın adı &quot;Otomatik Oturum Açma&quot;dır ve Windows&#39;u her açılışta kimlik bilgilerinizi yazmak zorunda kalmadan otomatik oturum açacak şekilde kolayca yapılandırmanıza olanak tanır. Bu aracın avantajı, parolanın kayıt defterinde şifreli olarak saklanmasıdır. </p> <p> 1. İndir <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/autologon\" target=\"_blank\" rel=\"nofollow noopener\"> otomatik oturum açma </a> Yarar. <br> 2. İndirilen dosyayı çıkarın. <br> 3. &quot;autologon.exe&quot;yi çalıştırın <br> 4. Parolanızı yazın ve tıklayın. <strong> etkinleştirme </strong> . </p> <p><img src=\"images/image_thumb-44-251.png\" alt=\"windows auto login\" loading=\"lazy\"></p> <p> * Not: Otomatik oturum açmayı kapatmak istiyorsanız, yardımcı programı tekrar çalıştırın ve <strong> devre dışı bırak </strong> . </p> <p> </p> <h6> Yöntem 2. Kullanıcı Hesapları kontrol panelinden Otomatik Oturum Açmayı etkinleştirin. </h6> <p> Windows 10/8/7&#39;de Otomatik Oturum Açmayı etkinleştirmenin ikinci yöntemi, Kullanıcı Hesapları kontrol panelinde &quot;Kullanıcılar bu bilgisayarı kullanmak için bir kullanıcı adı ve parola girmelidir&quot; ayarını devre dışı bırakmaktır. Bunu yapmak için: </p> <p> Not: Yerel bir hesap kullanıyorsanız, Windows&#39;u otomatik olarak Oturum Açmaya zorlamanın daha basit bir yolu daha vardır: Ayarlar &gt; Hesaplar &gt; Oturum açma seçenekleri &gt; Parolayı Değiştir&#39;den yeni bir boş (boş) parola belirlemeniz yeterlidir. Ardından parolanızı bir kez yazın ve ardından iki kez İleri&#39;ye ve Bitir&#39;e tıklayın. </p> <p> 1. Windows&#39;a basın <img src=\"images/image_thumb8_thumb_thumb-738.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> $ </strong> Çalıştır komut kutusunu açmak için tuşlar. <br> 2. &quot;Aç&quot; kutusuna şunu yazın: <strong> kullanıcı şifrelerini kontrol et2 </strong> &amp; Tıklayın <strong> TAMAM MI </strong> . </p> <p><img src=\"images/image_thumb-29-873.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Kullanıcı Hesapları seçeneklerinde (&#39;Kullanıcılar&#39; sekmesi), <strong> işaretini kaldır </strong> <strong> Kullanıcılar bu bilgisayarı kullanmak için bir kullanıcı adı ve parola girmelidir onay kutusu </strong> ve ardından tıklayın <strong> Uygulamak. * </strong></p> <p> * Not: Gelecekte otomatik oturum açmayı devre dışı bırakmak isterseniz, bu kutuyu işaretlemeniz yeterlidir. </p> <p><img src=\"images/image_thumb-32-315.png\" alt=\"auto login windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Hesap şifrenizi (iki kez) yazın ve tıklayın. <strong> TAMAM MI </strong> Kullanıcı Hesabı özelliklerini kapatmak için iki kez. </p> <p><img src=\"images/image_thumb-31-509.png\" alt=\"Auto Login to Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Yöntem 3. Kayıt Defterinde Otomatik Oturum Açmayı Etkinleştir (Windows 10/8/7/Vista). </h6> <p> Windows 10, 8 veya 7 işletim sisteminde parolayla oturum açmayı devre dışı bırakmanın son yöntemi, otomatik oturum açma kayıt defterini etkinleştirmektir. Bunu yapmak için: </p> <p> 1. Windows&#39;a basın <img src=\"images/image_thumb8_thumb_thumb-512.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> $ </strong> Çalıştır komut kutusunu açmak için tuşlar. <br> 2. &quot;Aç&quot; kutusuna şunu yazın: <strong> regedit </strong> &amp; Tıklayın <strong> TAMAM MI </strong> . </p> <p><img src=\"images/image_thumb7-114.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Sol bölmeden bu tuşa gidin: </p> <ul> <li> HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon </li> </ul> <p> 4. Sağ bölmede: </p> <blockquote><p> bir. Boş bir alana sağ tıklayın ve seçin <strong> Yeni </strong> &gt; <strong> Dize değeri. </strong></p> <p><img src=\"images/image_thumb-38-930.png\" alt=\"image\" loading=\"lazy\"></p> <p> b. Yeni değeri şu şekilde yeniden adlandırın: <strong> VarsayılanKullanıcıAdı </strong> ve bas <strong> Giriş </strong> . <br> c. &#39;DefaultUserName&#39; REG_SZ değerini açın. <br> d. Yerel Kullanıcı Hesabınızın veya Microsoft Hesabınızın adını yazın ve tıklayın. <strong> TAMAM MI </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-42-933.png\" alt=\"enable auto login registry\" loading=\"lazy\"></p> <p> </p> <p> 5a. Aynı adımları uygulayın ve yeni bir REG_SZ (String) değeri oluşturun ve adlandırın <strong> Varsayılan şifre </strong> . <br> 5b. &#39;DefaultPassword&#39;e çift tıklayın <strong> &#39; </strong> REG_SZ değeri, Değer verisi kutusuna şifrenizi yazın ve tıklayın <strong> TAMAM MI </strong> . </p> <p><img src=\"images/image_thumb-43-192.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7a. Son olarak, yeni bir REG_SZ değeri oluşturun ve adlandırın <b> OtomatikYöneticiOturumu </b> . <br> 7b. &#39;AutoAdminLogon&#39; değerine çift tıklayın, yazın <strong> 1 </strong> Değer verisi kutusuna tıklayın ve <strong> TAMAM MI </strong> . </p> <p><img src=\"images/image_thumb-41-705.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Kayıt Defteri Düzenleyicisini kapatın ve PC&#39;nizi yeniden başlatın. * </p> <p> * Notlar: <br> 1. Bilgisayarınız bir Etki Alanının parçasıysa, bu adla başka bir REG_SZ değeri oluşturmanız gerekir. <strong> VarsayılanAlanAdı </strong> ve ardından değer veri kutusuna alan adınızın adını yazın. <br> 2. Gelecekte otomatik oturum açmayı devre dışı bırakmak için, yukarıda bahsedilen yeni oluşturulan dize değerlerini silmeniz yeterlidir. </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}