{"title":"Windows Kurtarma Ortamında (WinRE) Bitlocker Nasıl Devre Dışı Bırakılır.","content":"<p> Bu öğretici, Windows Kurtarma Ortamı&#39;nda BitLocker korumasının nasıl devre dışı bırakılacağı ve BitLocker şifreli bir sürücünün şifresinin nasıl çözüleceği hakkında yönergeler içerir. Bilgisayarınız BitLocker korumalıysa ve sistem başlangıcında Bitlocker kurtarma anahtarını veya BitLocker parolasını kabul etmiyorsa ve BitLocker korumalı sürücünün kilidini açamıyorsanız, yönergeler yararlı olabilir. </p> <p><img src=\"images/image_thumb-52-511.png\" alt=\"Remove Bitlocker from Windows Recovery Environment \" loading=\"lazy\"></p> <h4></h4> <h4> Windows Kurtarma Ortamında (WinRE) BitLocker Korumasını Kaldırma ve BitLocker Şifreli Sürücünün Şifresini Çözme. </h4> <p><strong> Gereksinimler: </strong><br> <strong> bir </strong> . <strong> Bir Windows 10 Kurulum Ortamı (USB veya DVD). </strong> Bir Windows Kurulum Ortamına sahip değilseniz, kullanarak bir tane oluşturabilirsiniz. <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft&#39;un Medya Oluşturma aracı </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows 10 USB yükleme medyası nasıl oluşturulur. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows 10 DVD yükleme medyası nasıl oluşturulur. </a></li> </ul> <p><strong> B. BitLocker Kurtarma anahtarı veya BitLocker Parolası: </strong> Bitlocker korumasını kapatmak için önce sürücünün kilidini açmak ve ardından sürücünün şifresini çözmek için Bitlocker parolasına veya Bitlocker Kurtarma Anahtarına sahip olmanız gerekir. * </p> <p> * Not: BitLocker kurtarma anahtarınız yoksa BitLocker korumasını atlamanın bir yolu yoktur. Bir disk BitLocker korumalıysa ve sürücünün kilidini açmak için BitLocker Kurtarma Anahtarına veya parolaya sahip değilseniz, sahip olduğunuz tek seçenek (sürücüyü yeniden kullanmak için) yönergeleri kullanarak sürücüyü tamamen silmektir. Bu makalede: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> BitLocker Kurtarma Anahtarı veya Parolası Olmadan Bir Sürücüden BitLocker Koruması Nasıl Kaldırılır. </a></p> <p> Bitlocker kurtarma anahtarı 48 basamaklı bir sayıdır ve aşağıdaki konumlarda bulunabilir: </p> <ul> <li> Bitlocker&#39;ı etkinleştirdiğinizde kaydettiğiniz bir çıktıda. </li> <li> Kullandığınız bir USB sürücüde, Bitlocker kurtarma anahtarını kaydetmek için Bitlocker aktivasyonu sırasında. </li> <li> de <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Hesap Kurtarma Anahtarları </a> , cihazınıza giriş yapmak için kullandığınız MS hesabını kullanarak veya Microsoft Store&#39;dan uygulama indirmek veya MS Office&#39;i etkinleştirmek veya e-posta için cihaza eklediğiniz. </li> <li> senin üzerinde <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Azure Hesabı </a> Azure Active Directory hesabıyla oturum açan iş bilgisayarları için. </li> </ul> <p> BitLocker kurtarma anahtarını veya ΒitLocker parolasını bulduktan sonra, aşağıdaki talimatları izleyerek Bitlocker şifreli sürücünün kilidini açmaya ve WinRE&#39;de Bitlocker şifrelemesini kaldırmaya devam edin. </p> <p> WinRE&#39;den işletim sistemi C: sürücüsünün kilidini açmak ve şifresini çözmek için: </p> <p> 1. Sisteminizi Windows 10 yükleme ortamından başlatın. <br> 2. Aşağıdaki ekranda <strong> VARDİYA </strong> + <strong> F10 </strong> komut istemini başlatmak için tuşlar. (veya basın <strong> Sonraki </strong> &gt; <strong> Bilgisayarımı Onar </strong> &gt; <strong> Sorun giderme </strong> &gt; <strong> Komut istemi </strong> ). * </p> <p> * Not: Kurtarma anahtarını istediyseniz, <strong> Bu sürücüyü ATLA </strong> . </p> <p><img src=\"images/image_thumb15_thumb-548.png\" alt=\"How to disable-unlock bitlocker from Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. Komut isteminde, şifrelenmiş sürücünün sürücü harfini görüntülemek için aşağıdaki komutu yazın: </p> <ul> <li><strong> yönetmek-bde -durumu </strong></li> </ul> <p> </p> <p> 4. Ardından, durumunuza göre aşağıdaki komutu kullanarak şifreli sürücünün kilidini açmaya devam edin: </p> <p><strong> Vaka A. </strong> BitLocker kurtarma anahtarını biliyorsanız, şu komutu verin: </p> <ul> <li><strong> Manage-bde -unlock sürücü harfi: -rp BitLocker-recovery-key​ </strong></li> </ul> <p> * örneğin: &quot;D:&quot; sürücüsünün kilidini açmak istiyorsanız ve bit kilitleyici kurtarma anahtarı: &quot;123456-123456-123456-123456-123456-123456&quot; ise şunu yazın: </p> <ul> <li> <ul> <li> yönet-bde -kilidini aç <strong> D </strong> : -rp <strong> 123456-123456-123456-123456-123456-123456 </strong></li> </ul> </li> </ul> <p> </p> <p><strong> Durum B. </strong> Sürücünün kilidini açmak için BitLocker parolasını biliyorsanız, şu komutu verin: </p> <ul> <li><strong> yönet-bde -sürücü harfinin kilidini aç: -pw BitLocker-Password </strong></li> </ul> <p> * örneğin: &quot;D:&quot; sürücüsünün kilidini açmak istiyorsanız ve BitLocker parolası: &quot;123qwerty&quot; ise, şunu yazın: * </p> <ul> <li> <ul> <li> yönet-bde -kilidini aç <strong> D </strong> : -parola <strong> 123qwerty </strong></li> </ul> </li> </ul> <p> </p> <p> 5. Ardından sürücünün şifresini çözmeye devam edin ve bu komutla BitLocker korumasını kapatın: </p> <ul> <li><strong> Manage-bde -off sürücü harfi: </strong></li> </ul> <p> * örneğin: &quot;D:&quot; sürücüsünün şifresini çözmek istiyorsanız, şunu yazın: </p> <ul> <li> <ul> <li> yönetmek-bde –off <strong> D </strong> : </li> </ul> </li> </ul> <p> 6. Başlangıç ​​ile şifre çözme işlemi. Şifre çözme durumunu kontrol etmek için aşağıdaki komutu tekrar yazın ve sürücünün <strong> Tamamen Şifresi Çözülmüş </strong> ve <strong> kilidi açıldı </strong> : </p> <ul> <li><strong> yönetmek-bde -durumu </strong></li> </ul> <p><img src=\"images/image_thumb9_thumb-678.png\" alt=\"decrypt bitlocker encrypted drive windows removery environment\" loading=\"lazy\"></p> <p> </p> <p> 7. İşiniz bittiğinde, Windows yükleme medyasını çıkarın ve bilgisayarı yeniden başlatın. * </p> <p> * Not: Windows başlatılamıyorsa, sürücüyü başka bir bilgisayara bağlayın ve kişisel verilerinizi başka bir ortama yedekleyin. Sonra <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> sorunları sürücüde teşhis edin </a> ve uygunsa, diski bilgisayara geri koyun ve bir <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> temiz Windows 10 kurulumu </a> . </p> <p> </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne veya daha iyisi için bir yorum bırakın: Bu sorunla ilgili sözcüğün yayılmasına yardımcı olmak için bu blog gönderisini sosyal ağlarda beğenin ve paylaşın. </p>"}