{"title":"Windows 10&#39;da Bilgisayarınızı BitLocker ile Nasıl Korursunuz?","content":"<p> Bu eğitici, bilgisayarınızı BitLocker şifrelemesi ile nasıl parola ile koruyacağınız konusunda adım adım talimatlar içerir. BitLocker, Windows 10 Professional ve Enterprise sürümlerinde bulunan bir tam disk şifreleme özelliğidir ve kişisel verilerinizi yetkisiz erişime karşı korumanıza yardımcı olabilir. </p> <p> Şu senaryoyu hayal edin: Kişisel dizüstü bilgisayarınız çalınır veya kaybolur ve özel verileriniz sağduyulu olmayan gözler tarafından kullanılabilir. Bunun olmasını önlemek için, bu kılavuzu okuyun ve şifre çözme şifresi olmayan hiç kimse tarafından erişilemez hale gelmek için bilgisayarınızı ve değerli verilerinizi güçlü şifreleme ile nasıl parola ile koruyacağınızı öğrenin. </p> <ul> <li><strong> İlgili Makale: <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Şifreli Klasör Nasıl Korunur? </a></strong></li> </ul> <h4> Windows 10 PC&#39;nizi Şifrelemek ve Korumak için BitLocker nasıl kullanılır? </h4> <p> Windows 10 Pro veya Enterprise&#39;da BitLocker ile İşletim Sistemi sürücüsünü korumak için: </p> <p> 1. Windows&#39;tan <strong> Kontrol Paneli </strong> , Tıklayın <strong> Sistem ve Güvenlik </strong> ve ardından tıklayın <strong> Bitlocker sürücü şifreleme </strong> . </p> <p><img src=\"images/image_thumb-33-320.png\" alt=\"How to Protect your PC with BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. İşletim sistemi C: sürücüsünün yanındaki <strong> Bitlocker&#39;ı aç </strong> . * </p> <p> * Not: &#39;BitLocker&#39;ı Aç&#39;a bastıktan sonra, &quot;Bu aygıt Güvenilir Platform Modülü kullanamıyor...&quot; hatasını alırsanız, sorunu çözmek için bu makaleyi okuyun. </p> <p><img src=\"images/image_thumb-34-100.png\" alt=\"turn on bitlocker operating system drive\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Bir sonraki ekranda, başlangıçta sürücünün kilidini nasıl açmak istediğinizi seçin. </p> <blockquote><p> 1. Bir USB cihazı kullanarak PC&#39;nizin kilidini açmak istiyorsanız <strong> Bir USB flash sürücü takın. <br> </strong> 2. Bir parola yazarak PC&#39;nizin kilidini açmak istiyorsanız, tıklayın <strong> Bir parola girin </strong> . (bu örnekte olduğu gibi) </p></blockquote> <p><img src=\"images/image_thumb-35-212.png\" alt=\"enable bitlocker protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Şimdi çok güçlü bir şifre yazın ve tıklayın. <strong> Sonraki </strong> . </p> <p><img src=\"images/image_thumb-36-435.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Şimdi kurtarma anahtarını nereye kaydetmek* istediğinizi seçin ve <strong> Sonraki </strong> . * </p> <p> * Örneğin: Windows 10&#39;da bir Microsoft hesabıyla oturum açarsanız, <strong> Microsoft Hesabınıza kaydedin. </strong> Windows 10&#39;da yerel bir hesapla oturum açarsanız, diğer seçeneklerden birini seçin. </p> <p> Notlar: <br> 1. BitLocker kurtarma anahtarını Microsoft Hesabınıza kaydederseniz, oturum açtıktan sonra anahtarı görüntüleyebilirsiniz. <a title=\"https://onedrive.live.com/recoverykey.\" href=\"https://onedrive.live.com/recoverykey.\" target=\"_blank\" rel=\"nofollow noopener\"> https://onedrive.live.com/recoverykey. </a><br> 2. BitLocker sorunlarını gidermeye hazır olmak için kurtarma anahtarını her zaman bir USB sürücüsünde saklamayı tercih ederim. </p> <p> </p> <p><img src=\"images/image_thumb-37-801.png\" alt=\"save bitlocker recovery key\" loading=\"lazy\"></p> <p> </p> <p> 6. Bir sonraki ekranda, bilgisayarınız ve/veya sürücünüz yeniyse varsayılan ayarı bırakın ve ardından <strong> Sonraki </strong> tekrar. </p> <p><img src=\"images/image_thumb-38-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Şifreleme modu seçeneklerinde, varsayılan ayarı bırakın ve tıklayın. <strong> Sonraki </strong> . </p> <p><img src=\"images/image_thumb-39-785.png\" alt=\"bitlocker encryption mode\" loading=\"lazy\"></p> <p> </p> <p> 8. Son ekranda tıklayın <strong> Devam et </strong> , BitLocker korumasını etkinleştirmeden önce sistemi yeniden başlatmak ve kontrol etmek için. </p> <p><img src=\"images/image_thumb-40-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Yeniden başlatma sırasında BitLocker parolanızı girmeniz istenir. Şifrenizi yazın ve tuşuna basın <strong> Giriş </strong> . * </p> <p> * Not: BitLocker parolayı kabul edemezse veya başka sorunlarla karşılaşırsanız, Windows&#39;ta oturum açmak için aşağıdaki işlemlerden birini deneyin: </p> <blockquote><p> 1. Kurtarma seçeneklerine erişmek için BitLocker&#39;ın Parola ekranında ESC tuşuna basın. <br> 2. BitLocker testini atlamak için PC&#39;nizi açtıktan sonra ESC tuşuna art arda basın. </p></blockquote> <p> 10. BitLocker testleri başarılı olursa, Windows 10&#39;a önyükleme yaptıktan sonra BitLocker, işletim sistemi sürücünüzü şifrelemeye başlar. Şifreleme işleminin durumunu görüntülemek için görev çubuğundaki BitLocker bildirimini tıklayın veya Denetim Masası &gt; BitLocker Sürücü Şifrelemesi&#39;ne gidin. </p> <p><img src=\"images/image_thumb-41-171.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}