{"title":"Windows 10&#39;da Kişisel Dosyaları Dosya Geçmişi ile Yedekleme.","content":"<p> Bu eğitimde, Windows 10&#39;u Dosya Geçmişi yedekleme aracını kullanarak dosyalarınızın kopyalarını ve anlık görüntülerini otomatik olarak oluşturacak şekilde nasıl yapılandıracağınızı göstereceğim ve bunları geri yükleyebilmek için (gerekirse), &quot;Önceki Sürümleri Geri Yükle&quot; özellik. </p> <p> Fark etmiş olabileceğiniz gibi, varsayılan olarak Windows 10, Windows 7&#39;deki gibi dosyalarınızın veya klasörlerinizin önceki sürümlerini saklamaz. dosyalarınızın anlık görüntülerini alın, ancak bunun yerine yalnızca &#39;Dosya Geçmişi&#39; yedekleme aracını kullanır. </p> <p> &quot;Dosya Geçmişi&quot;, dosyalarınızın kopyalarını ve anlık görüntülerini ana sürücüden (örneğin bir USB Sürücüsüne, Ağa, vb.) . * </p> <p> * Not: &quot;Dosya Geçmişi&quot; aracının tek sınırlaması, alternatif bir yedekleme hedefi olarak C: sürücüsünü seçmenize izin vermemesidir. Yedekleme için kullanılabilecek ikincil bir sürücünüz yoksa, bu sınırlamayı nasıl atlayacağınızı öğrenmek için bu öğreticiyi okumaya devam edin… </p> <ul> <li><strong> İlgili makale: </strong> <a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows 10&#39;da Görev Zamanlayıcı ile Dosyalarınızın Gölge Kopyalarını Nasıl Oluşturabilirsiniz? </a></li> </ul> <h4> Windows 10&#39;da Dosya Geçmişi Yedekleme aracıyla Kişisel Dosyalarınızı Nasıl Yedeklersiniz? </h4> <p> 1. Yukarıda bahsettiğim gibi, Dosya Geçmişi yedekleme aracı ile dosyalarınızı yedeklemek için, PC&#39;nize bağlı kullanılabilir bir depolama sürücüsüne (örn. USB sürücüsü) veya bir ağ konumuna (örn. Ağınızdaki başka bir bilgisayar) sahip olmanız gerekir veya bir NAS depolama aygıtı). * </p> <p> * Not: Alternatif bir depolama cihazınız yoksa aşağıdaki seçeneklere sahipsiniz: </p> <blockquote><p> A. için <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> ana sürücünüzün boyutunu küçültün C:\\ </a> ve yedeği depolamak için yeni bir sürücü oluşturmak için mevcut boş alanla veya… </p> <p> B. Yedeklemeyi C:\\ ana sürücüsünde depolamak için. Bu durumda, C: sürücüsünde yeni bir klasör oluşturun ve &quot;FileHistory&quot; (veya ne istersen) olarak adlandırın ve aşağıdan devam edin… </p></blockquote> <p> 2. Windows&#39;a gidin <strong> Kontrol Paneli </strong> ve altında <strong> Sistem ve Güvenlik, </strong> Tıklayın <strong> Yedeklemeyi kaydet </strong><strong> Dosya Geçmişi ile dosyalarınızın kopyaları. </strong></p> <p><img src=\"images/image_thumb-42-924.png\" alt=\"How to Backup & Keep Previous Versions of Files in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 3. Şimdi durumunuza göre aşağıdakileri yapın: </p> <ul> <li><strong> Vaka A. </strong> Yedekleme için uygun bir sürücünüz varsa, o zaman: </li> </ul> <blockquote><p> bir. Tıkla <strong> Aç </strong> &#39;Dosya Geçmişi&#39;ni etkinleştirmek için ekrandaki düğmesine basın. <br> b. Devam etmek <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> 4. adım </a> &#39;Dosya Geçmişi&#39; yedekleme ayarlarını yapılandırmak için aşağıdaki </p></blockquote> <p><img src=\"images/image_thumb-44-788.png\" alt=\"Turn On File History Windows 10\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Durum B: </strong> Dosya Geçmişi yedeklemesi için uygun bir sürücünüz yoksa veya yedeklemeyi ağda depolamak istiyorsanız: </li> </ul> <blockquote><p> bir. Tıklayın <strong> Bir ağ konumu seçin. </strong></p></blockquote> <p><img src=\"images/image_thumb-56-796.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Bir sonraki ekranda: </p> <p> 1. Yedeklemeyi Ağa kaydetmek istiyorsanız, yedekleme depolama konumunun tam ağ yolunu yazın ve <strong> Dosya Seç </strong> . </p> <p> 2.  Yedeği ana C:\\ sürücünüze kaydetmek istiyorsanız, C:\\ sürücüsündeki yerel yedekleme klasörünün tam ağ yolunu şu formda yazın: * </p> <ul> <li> <strong> \\\\Bilgisayar Adı\\C$\\FileHistory </strong></li> </ul> <p> * Notlar: <br> 1. &quot;Bilgisayar Adı&quot; değerini PC&#39;nizin adıyla değiştirin. (Bilgisayarınızın adını bulmak için Windows Gezgini&#39;nde &quot;Bu PC&quot; simgesine sağ tıklayın). <br> 2. Kişisel dosyalarınızın yedeğini zaten depoladıkları sürücüye kaydetmenin <strong> güvenilir bir çözüm değil </strong> . Güvende olmak için, yedeği her zaman başka bir depolama cihazında saklayın. </p></blockquote> <p> örneğin: bilgisayarın adı &quot;Pegasus&quot; ise şunu yazın: &quot;\\\\Pegasus\\C$\\FileHistory&quot; </p> <p><img src=\"images/image_thumb-53-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> c. Bir sonraki ekranda, tıklayın <strong> TAMAM MI </strong> . </p></blockquote> <p><img src=\"images/image_thumb-54-349.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> d. Şimdi tıklayın <strong> Aç </strong> Dosya Geçmişi yedekleme aracını etkinleştirmek için düğmesine basın ve ardından yedekleme ayarlarını yapılandırmaya devam edin. </p></blockquote> <p><img src=\"images/image_thumb-48-620.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. &#39;Dosya Geçmişi&#39; yedekleme seçeneklerini yapılandırmak için <strong> Gelişmiş Ayarlar </strong> soldaki. </p> <p><img src=\"images/image_thumb-49-919.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4a. sonra <strong> Gelişmiş Ayarlar </strong> seçenekleri, dosyalarınızı ne sıklıkta yedekleyeceğinizi ve kaydedilen sürümlerin ne kadar süreyle saklanacağını ayarlayın. Bittiğinde, tıklayın <strong> Değişiklikleri Kaydet </strong> . </p> <p><img src=\"images/image_thumb-61-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Son olarak tıklayın <strong> Şimdi koş </strong> ilk yedeğinizi almak için. * </p> <p><img src=\"images/image_thumb-55-463.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Ek Yardım – Notlar: <br> 1. Varsayılan olarak &#39;Dosya Geçmişi&#39;, &#39;Kitaplıklar&#39; klasörlerinin (Masaüstü, Belgeler, Sık Kullanılanlar, Müzik, OneDrive, Resimler ve Videolar) bir yedeğini alır. Bu klasörlerden birini yedeklemeden çıkarmak, diğer klasörleri dahil etmek veya tüm Dosya Geçmişi yedekleme seçeneklerini gözden geçirmek istiyorsanız şuraya gidin: </p> <ul> <li> <p><strong> Ayarlar <img src=\"images/image_thumb-58-467.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Güncelleme ve Güvenlik </strong> &gt; <strong> Destek olmak </strong> &gt; <strong> Daha fazla seçenek. </strong></p> </li> </ul> <p><img src=\"images/image_thumb-57-938.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Dosyalarınızı &#39;Dosya Geçmişi&#39; yedeklemesinden geri yüklemek için aşağıdaki konumlardan birine gidin: </p> <ul> <li><strong> Kontrol Paneli </strong> &gt; <strong> Dosya Geçmişi </strong> &gt; <strong> Kişisel Dosyaları Geri Yükleyin. </strong></li> <li><strong> Ayarlar <img src=\"images/image_thumb-59-275.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Güncelleme ve Güvenlik </strong> &gt; <strong> Destek olmak </strong> &gt; <strong> Daha fazla seçenek </strong> &gt; <strong> Dosyaları geçerli bir yedekten geri yükleyin. </strong></li> </ul> <p> 3. Bir dosyayı veya klasörü önceki sürümüne seçerek geri yüklemek için dosyaya (veya klasöre) sağ tıklayın ve <strong> Önceki Sürümleri Geri Yükle </strong> . </p> <p><img src=\"images/image_thumb-60-867.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Bu kadar! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}