{"title":"Windows 10&#39;da BitLocker Nasıl Devre Dışı Bırakılır.","content":"<p> Bu eğitici, Windows 10&#39;da Bitlocker Koruması ve Sürücü şifrelemesinin nasıl devre dışı bırakılacağına ilişkin talimatlar içerir. Bildiğiniz gibi, Windows 10 pro ve kurumsal sürümlerinde bulunan BitLocker şifreleme özelliği, PC içeriğinizi yetkisiz erişimden korumanıza yardımcı olabilir. Ancak bazen Windows 10&#39;da Bitlocker&#39;ı devre dışı bırakma ihtiyacı vardır, bu yüzden bu kılavuzda bunu nasıl yapacağınızı bulabilirsiniz. </p> <p> Bilgisayarınız BitLocker ile korunuyorsa, sistemi başlattığınızda, önyüklemeye devam etmek için BitLocker etkinleştirme sırasında kullandığınız USB sürücüsünü bağlamanız veya C: sürücüsünün kilidini açmak için BitLocker parolanızı girmeniz istenecektir. Bunlardan herhangi birine sahip değilseniz, düğmesine basın. <strong> ESC </strong> BitLocker kurtarma anahtarınızı girmek için * </p> <blockquote><p> * Notlar: <br> 1. Bitlocker Kurtarma Anahtarı veya Parola sistem başlangıcında kabul edilmiyorsa, sabit sürücünün kilidini açmayı ve şifresini başka bir Windows 10 bilgisayarında çözmeyi deneyin veya şunları deneyin: <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-recovery-environment-winre/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows Kurtarma Ortamında (WinRE) Korumalı Sürücünün Kilidini Açın ve Şifresini Çözün. </a><br> 2. Sürücünün Kilidini Açamıyorsanız (örneğin, BitLocker Kurtarma Anahtarına sahip değilseniz veya BitLocker anahtarı kabul edilmediğinden) ve korumalı sürücüyü tekrar kullanmak için BitLocker şifrelemesini kaldırmak istiyorsanız, bu öğreticiyi okuyun: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> BitLocker Kurtarma Anahtarı veya Parolası Olmadan Bir Sürücüden BitLocker Koruması Nasıl Kaldırılır </a> . </p></blockquote> <p><img src=\"images/image_thumb-53-752.png\" alt=\"How to Disable BitLocker in Windows 10 GUI - PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Windows&#39;a önyükleme yaptıktan sonra, bitlocker korumasını devre dışı bırakmak ve sürücünün şifresini çözmek için aşağıdaki talimatları izleyin. </p> <h4> Windows 10&#39;da BitLocker Korumasını Kapatma ve Bitlocker Şifreli Sürücünün Şifresini Çözme. </h4> <p> Bitlocker korumasını kapatmak için önce sürücünün kilidini açmak ve ardından sürücünün şifresini çözmek için Bitlocker parolasına veya bitlocker kurtarma anahtarına sahip olmanız gerekir. </p> <p> Bitlocker kurtarma anahtarı 48 basamaklı bir sayı anahtarıdır ve aşağıdaki konumlarda bulunabilir: </p> <ul> <li> Bitlocker&#39;ı etkinleştirdiğinizde kaydettiğiniz bir çıktıda. </li> <li> Kullandığınız bir USB sürücüde, Bitlocker kurtarma anahtarını kaydetmek için Bitlocker aktivasyonu sırasında. </li> <li> de <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Hesap Kurtarma Anahtarları </a> , cihazınıza giriş yapmak için kullandığınız MS hesabını kullanarak veya Microsoft Store&#39;dan uygulama indirmek veya MS Office&#39;i etkinleştirmek veya e-posta için cihaza eklediğiniz. </li> <li> senin üzerinde <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Azure Hesabı </a> Azure Active Directory hesabıyla oturum açan iş bilgisayarları için. </li> </ul> <p> Bitlocker kurtarma anahtarını veya bitlocker parolasını bulduktan sonra, aşağıdaki yollardan birini kullanarak Bitlocker şifreli sürücünün kilidini açmaya ve Bitlocker şifrelemesini kaldırmaya devam edin: </p> <ul> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Yöntem 1. Windows GUI&#39;den BitLocker Korumasını devre dışı bırakın. </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Yöntem 2. BitLocker&#39;ı Devre Dışı Bırakın ve PowerShell&#39;den Bitlocker Şifreli Bir Sürücünün Şifresini Çözün. </a></li> </ul> <p> </p> <h6> Yöntem 1. Windows 10 GUI&#39;de Bitlocker Koruması Nasıl Kapatılır. </h6> <p> Sistem Sürücüsü C&#39;nizdeki korumayı devre dışı bırakmak için: </p> <p> 1. Windows&#39;a gidin <strong> Kontrol Paneli </strong> -&gt; <strong> Sistem ve Güvenlik </strong> ve ardından tıklayın <strong> Bitlocker sürücü şifreleme </strong> . </p> <p><img src=\"images/image_thumb-33-233.png\" alt=\"How to turn off or Turn Onn BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. İşletim sistemi C: sürücüsünün yanındaki <strong> BitLocker&#39;ı Kapatın </strong> . * </p> <p> * Notlar: <br> 1. &quot;BitLocker&#39;ı Kapat&quot; seçeneği mevcut değilse, <strong> yönetici olarak komut istemi </strong> ve aşağıdaki komutu verin: </p> <ul> <li> yönetmek-bde -off C: </li> </ul> <p> 2. C: sürücüsünün şifre çözme durumunu (ilerleme durumunu) görmek için şu komutu verin: </p> <ul> <li> yönetmek-bde -durum C: </li> </ul> <p> </p> <p> </p> <p><img src=\"images/image_thumb-43-236.png\" alt=\"turn off bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Bitlocker&#39;ı Kapattıktan sonra, şifre çözme işlemini görüntülemek için görev çubuğundaki Bitlocker simgesine tıklayın. </p> <p><img src=\"images/image_thumb-41-694.png\" alt=\"remove bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Windows GUI&#39;den herhangi bir BitLocker korumalı sürücüde korumayı devre dışı bırakmak için: </p> <p> 1. Windows Gezgini&#39;ni açın ve ardından kilitli sürücüye çift tıklayın. <br> 2. Bitlocker parolasını girin veya <strong> Daha fazla seçenek </strong> Sürücünün kilidini açmak için Bitlocker Recovery anahtarını girmek için. </p> <p><img src=\"images/image_thumb-47-646.png\" alt=\"unlock bitlocker windows 10\" loading=\"lazy\"></p> <p> 2. Sürücünün kilidini açtıktan sonra şuraya gidin: <strong> Kontrol Paneli </strong> -&gt; <strong> Sistem ve Güvenlik </strong> -&gt; <strong> Bitlocker sürücü şifreleme </strong> ve sürücüyü seçtikten sonra tıklayın <strong> BitLocker&#39;ı kapatın </strong> Sürücünün şifresini çözmek için. (yukarıdaki ekran görüntülerine bakın) </p> <p> </p> <h6> Yöntem 2. BitLocker Korumasını Kapatma ve Windows 10&#39;da PowerShell&#39;den Bitlocker Şifreli Bir Sürücünün Şifresini Çözme. </h6> <p> 1. PowerShell&#39;i Yönetici olarak açın. Bunu yapmak için: </p> <ol> <li> <ol> <li> at <strong> Cortana </strong> arama kutusuna yazın <strong> güç kalkanı </strong></li> <li> sağ tıklayın <strong> Windows PowerShell&#39;i </strong> sonuç ve seç <strong> Yönetici olarak çalıştır. </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb_thumb-1-316.png\" alt=\"disable bitlocker powershell windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Ardından, şu komutu yazarak bilgisayarınızdaki her bir sürücünün şifreleme durumunu kontrol edin: </p> <ul> <li><strong> yönetmek-bde -durumu </strong></li> </ul> <p> </p> <p> 3. Kilit Durumunun hangi sürücü harfinde gösterildiğine dikkat edin. <strong> Kilitli </strong> ve ardından şu komutu yazarak bu sürücünün kilidini açmaya devam edin: * </p> <ul> <li><strong> Manage-bde -unlock sürücü harfi: -rp BitLocker-recovery-key​ </strong></li> </ul> <p> * örneğin: &quot;D:&quot; sürücüsünün kilidini açmak istiyorsanız ve bit kilitleyici kurtarma anahtarı: &quot;123456-123456-123456-123456-123456-123456&quot; ise şunu yazın: </p> <ul> <li> <ul> <li> yönet-bde -D kilidini aç: -rp 123456-123456-123456-123456-123456-123456 </li> </ul> </li> </ul> <p> </p> <p> * Not: Bitlocker şifresini biliyorsanız şu komutu verin: </p> <ul> <li><strong> yönet-bde -sürücü harfinin kilidini aç: -pw BitLocker-Password </strong></li> </ul> <p> * örneğin: &quot;D:&quot; sürücüsünün kilidini açmak istiyorsanız ve BitLocker parolası: &quot;123qwerty&quot; ise, şunu yazın: * </p> <ul> <li> <ul> <li> yönet-bde - D kilidini aç: -şifre 123qwerty </li> </ul> </li> </ul> <p> </p> <p> 4. Ardından, aşağıdaki komutlardan birini kullanarak bitlocker şifrelemesini devre dışı bırakın ve şifreli sürücünün şifresini çözün: </p> <ul> <li><strong> Disable-BitLocker -MountPoint &quot;sürücü harfi:&quot; </strong></li> <li><strong> Manage-bde -off sürücü harfi: </strong></li> </ul> <p> * ör.: &quot;D:&quot; sürücüsündeki bit kilitleyici şifrelemeyi devre dışı bırakmak istiyorsanız, şunu yazın: </p> <ul> <li> <ul> <li> Disable-BitLocker -MountPoint &quot;D:&quot; </li> </ul> </li> </ul> <blockquote> <p> VEYA yazın… </p> </blockquote> <ul> <li> <ul> <li> yönetmek-bde –off D: </li> </ul> </li> </ul> <p> 5. Şifre çözme işlemi tamamlandığında, şu komutu vererek şifreleme durumunu tekrar kontrol etmeye devam edin: </p> <ul> <li><strong> yönetmek-bde -durumu </strong></li> </ul> <p> 6. &#39;Kilit Durumu&#39; görüntülenirse <strong> kilidi açıldı </strong> ve &#39;Dönüşüm Durumu&#39; gösterilir <strong> Tamamen Şifrelenmiş, </strong> sen bittin! </p> <p><img src=\"images/image_thumb-50-868.png\" alt=\"view bitlocker status\" loading=\"lazy\"></p> <p> </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne veya daha iyisi için bir yorum bırakın: Bu sorunla ilgili sözcüğün yayılmasına yardımcı olmak için bu blog gönderisini sosyal ağlarda beğenin ve paylaşın. </p>"}