{"title":"Windows 10&#39;da Bir Klasörü Parolayla Koruma (Klasörü Parola ile Kilitle).","content":"<p> Bu öğretici, Windows 10/8/7 işletim sisteminde bir klasörü parolayla korumak için iki farklı ücretsiz ve güvenli yöntem içerir. Bir klasörü şifre ile kilitlerseniz, sizden başka kimse bu klasöre erişemez. Bir klasörü parola ile korumak, bilgisayarınızı başkalarıyla paylaştığınız ve başka birinin özel dosyalarınıza erişmesini ve okumasını istemediğiniz durumlarda kullanışlıdır. </p> <ul> <li><strong> İlgili makale: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> BitLocker ile Windows 10 Bilgisayarınızı Parolayla Koruma </a> . </strong></li> </ul> <h4> Windows 10&#39;da Şifreli Bir Klasör Nasıl Kilitlenir. </h4> <h6> Yöntem 1. 7-zip ile Dosyaları Kilitleme ve Şifreleme (Windows Tüm Sürümler). </h6> <p> Windows&#39;ta bir klasörü parola ile korumanın en kolay ve en güvenli yöntemi, şifrelemeyi de destekleyen 7-Zip arşivleme yardımcı programını kullanmaktır. Bir klasörü/dosyayı 7-zip ile şifrelemek ve parola ile korumak için: </p> <p> 1. İndirin ve yükleyin <a href=\"https://www.7-zip.org/\" target=\"_blank\" rel=\"nofollow noopener\"> 7-Zip </a> arşiv programı <br> 2. Parola ile korumak istediğiniz klasöre (veya dosyaya) sağ tıklayın ve şunları seçin: <strong> 7-Zip </strong> &gt; <strong> Arşive Ekle </strong> . </p> <p><img src=\"images/image_thumb-28-978.png\" alt=\"How to Password Protect a Folder\" loading=\"lazy\"></p> <p> </p> <p> 3. &#39;Arşive ekle&#39; seçeneklerinde, güçlü bir parola belirleyin ve ardından <strong> TAMAM MI </strong> . </p> <p><img src=\"images/image_thumb-29-728.png\" alt=\"set password to archive with 7-zip\" loading=\"lazy\"></p> <p> </p> <p> 4. Ardından sıkıştırılmamış klasörü (veya dosyayı) silin ve işleminiz bitti! </p> <h6> Yöntem 2. Bir Klasörü EFS Korumasıyla Şifreleme (Windows Pro &amp; Enterprise). </h6> <p> EFS Koruması, Windows 10 Professional ve Enterprise sürümlerinde yerleşik bir şifreleme aracıdır. Bir klasörü veya bir dosyayı EFS şifreleme ile korursanız, şifre çözme anahtarına (sertifika PFX anahtarı) sahip olmadan başkalarının şifrelenmiş dosyalara erişmesi çok zordur. </p> <p> EFS şifrelemesinin tek dezavantajı, şifrelenmiş dosyaları başka bir ağ bilgisayarına kopyalarsanız veya şifrelenmiş dosyaları e-postayla gönderirseniz şifrelemenin kaldırılacak olmasıdır. </p> <p> Ayrıca, EFS dosyalarınızı şifrelediğinizde, şifre çözme anahtarı (sertifika) bilgisayarınızda yerel olarak depolanır. Bu, şifrenizi bilen herkesin şifrelenmiş dosyalarınıza da erişebileceği anlamına gelir. Bu nedenle, dosyalarınızı EFS şifrelemesi ile şifreliyorsanız, güçlü bir giriş şifresi belirleyin ve başkalarıyla paylaşmayın. </p> <ul> <li><strong> İlgili Makale: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> EFS Şifreli dosyaların şifresini çözme ve EFS Şifrelemeyi Kaldırma. </a></strong></li> </ul> <p><strong> Bir klasörü veya dosyayı EFS ile şifrelemek için: </strong><br> 1. Korumak istediğiniz klasöre (veya dosyaya) sağ tıklayın ve seçin <strong> Özellikleri </strong> . <br> 2. Genel sekmesinde, <strong> ileri </strong> . </p> <p><img src=\"images/image_thumb-13-582.png\" alt=\"enable efs protection\" loading=\"lazy\"></p> <p> </p> <p> 3. Seçin <strong> Verileri korumak için dosyaları şifreleyin </strong> ve ardından tıklayın <strong> TAMAM MI. </strong></p> <p><img src=\"images/image_thumb-14-983.png\" alt=\"How to Lock Folder with Password - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Ardından tıklayın <strong> Uygulamak </strong> ve <strong> TAMAM MI </strong> değişiklikleri kaydetmek ve çıkmak için tekrar <br> 5. Bu noktada Windows, kurtarma anahtarını yedeklemenizi ister. Tıklayın <strong> Dosya şifreleme anahtarınızı yedekleyin. </strong></p> <p><img src=\"images/image_thumb-2-823.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Ardından <strong> Şimdi yedekleyin (önerilir) </strong> ve şifre çözme sertifikası anahtarını bir USB sürücüsüne kaydedin. </p> <p><img src=\"images/image_thumb-15-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Sertifika Dışa Aktarma sihirbazında <strong> Sonraki </strong> Karşılama ekranında. <br> 8. Ardından <strong> Sonraki </strong> tekrar Dosya Formatını Dışa Aktar ekranında. </p> <p><img src=\"images/image_thumb-4-842.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. Güvenlik seçeneklerinde: </p> <blockquote> <p> 1. <strong> Kontrol </strong> <strong> Parola </strong> Kutu. <br> 2. Dışa aktarılan sertifika anahtarı için bir parola yazın. <br> 3. Seçin <strong> AES256-SHA256 </strong> şifreleme <br> 4. Tıklayın <strong> Sonraki </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-16-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. Tıklayın <strong> Araştır </strong> ve <strong> Kayıt etmek </strong> bilgisayarınızdaki sertifika (.pfx) dosyası. <br> 11. Bittiğinde, tıklayın <strong> Sonraki </strong> devam etmek. </p> <p><img src=\"images/image_thumb-17-804.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. Son olarak tıklayın <strong> Bitiş </strong> . </p> <p><img src=\"images/image_thumb-18-449.png\" alt=\"image\" loading=\"lazy\"></p> <p> 13. Dışa aktarma tamamlandığında, dışa aktarılan sertifika anahtarını (.pfx dosyası) başka bir güvenli konuma (örn. bir USB diske) kaydedin. </p> <p><strong> İPUCU: </strong> Bir klasörü (veya dosyaları) EFS ile şifrelediğinizde, şifre çözme anahtarı (sertifika) kullanıcı profili klasörünüzde depolanır. Bu nedenle, başka bir kullanıcı Windows oturum açma parolanıza sahipse, şifrelenmiş dosyaları açıp okuyabilir. Bunun olmasını önlemek için, oturum açma parolanızı paylaşmayın veya PC&#39;nizden ayrıldığınızda şifre çözme sertifikasını profilinizden kaldırın (kaldırın) ve geri döndüğünüzde yeniden yükleyin. * </p> <p> * Not: Kurtarma anahtarını (sertifika) kaldırmak ve yeniden içe aktarmak için şu adrese gidin: </p> <blockquote> <p> bir. <strong> Kontrol Paneli </strong> &gt; <strong> İnternet Seçenekleri. <br> </strong> b. &#39;İnternet Seçenekleri&#39;nde <strong> içerik </strong> sekmesini ve ardından tıklayın <strong> sertifika </strong> s. <br> c. &#39;Kişisel&#39; sekmesinde <strong> Kaldırmak </strong> düğmesine, şifre çözme anahtarını (sertifika) kaldırmak için veya <strong> İthalat </strong> USB sürücüsünden şifre çözme sertifikasını yeniden yüklemek için düğmesine basın. </p> </blockquote> <ul> <li> <p><strong> İlgili Makale: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"noopener noreferrer\"> EFS Şifreli dosyaların şifresini çözme ve EFS Şifrelemeyi Kaldırma. </a></strong></p> </li> </ul> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın </p>"}