{"title":"Windows 10/8/7 İşletim Sisteminde Sistem Geri Yükleme Koruması Nasıl Etkinleştirilir.","content":"<p> Bu eğitici, Windows 10, 8 ve 7 işletim sistemlerinde Sistem Korumasının nasıl etkinleştirileceğine ilişkin talimatlar içerir. Sistem Geri Yükleme Koruması (genellikle &#39;Sistem Koruması&#39; olarak bilinir), aşağıdakileri yapmanızı sağlayan bir Windows özelliğidir. <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> onarmak </a> sistem dosyalarında önemli bir değişiklikten sonra (örneğin bir Windows Güncellemesinden sonra veya bir virüs saldırısından sonra) Windows düzgün çalışmıyorsa, sisteminizi daha önceki bir zamana </p> <p> Sistem Geri Yükleme aracı, Windows sistem dosyalarının ve kayıt defterinin anlık görüntülerini almak için Birim Gölge Kopyası hizmetini kullanır ve Geri Yükleme Noktaları olarak kaydeder. Bu &quot;Geri Yükleme Noktaları&quot;, Windows&#39;un önyükleme yapmaması veya kararsız hale gelmesi durumunda, işletim sistemini yeniden yüklemeye gerek kalmadan sistemi önceki bir çalışma durumuna geri yüklemek için kullanılabilir. </p> <h4> Windows 10&#39;da Sistem Geri Yükleme Koruması Nasıl Açılır? </h4> <p> 1. Windows gezginini açın, &#39;Bu PC&#39; simgesine sağ tıklayın ve <strong> Özellikleri </strong> . </p> <p><img src=\"images/image_thumb-70-672.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Seç <strong> Sistem koruması </strong> solda. </p> <p><img src=\"images/image_thumb-71-762.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Vurgulayın <strong> Yerel Disk C: (Sistem) </strong> ve tıklayın <strong> Yapılandır. </strong></p> <p><img src=\"images/image_thumb-72-782.png\" alt=\"turn on system restore protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Sistem Koruma seçeneklerinde, öğesini seçin. <strong> Sistem korumasını aç </strong> ve tıklayın <strong> TAMAM MI. * </strong></p> <p> * Not: &quot;Sistem Koruması: zaten etkinse, sorun yok demektir. </p> <p><img src=\"images/image_thumb-73-192.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 5. Son olarak, Sistem Koruma seçeneklerinde, <strong> Oluşturmak </strong> mevcut sistem durumunun bir anlık görüntüsünü (Geri Yükleme Noktası) oluşturmak için. </p> <p><img src=\"images/image_thumb-75-308.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Bu kadar! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p>"}