{"title":"Windows 10&#39;da Office 2019, 2016 veya 2013&#39;te Güncellemeler Nasıl Kontrol Edilir.","content":"<p> Bu öğreticide, Office 2019, 2016 ve Office 2013&#39;te güncelleştirmeleri manuel olarak nasıl kontrol edeceğinizi öğreneceksiniz. Tüm Office sürümlerinde, kullanılabilir Office güncelleştirmelerini yüklemenin iki yolu vardır: Otomatik ve El ile. </p> <h4> Office 209/2016/2013/2010 Manuel Olarak Nasıl Güncellenir. </h4> <h6> Yöntem 1. Office 2019, 2016 ve Office 2013&#39;te Office Güncellemelerini Manuel Olarak Kontrol Etme. </h6> <p> Tüm Office sürümlerinde mevcut Office güncellemelerini manuel olarak kontrol etmek ve yüklemek için: </p> <p> 1. Herhangi bir Office programını açın (ör. Word). <br> 2. Gönderen <strong> Dosya </strong> menü, seç <strong> hesap </strong> . * </p> <p> * Not: Office 2010&#39;da seçin <strong> Yardım. </strong></p> <p> 3. Genişlet <strong> Güncelleme seçenekleri </strong> ve tıklayın <strong> Şimdi güncelle </strong> . * </p> <p> * Not: &#39;Güncelleme Seçenekleri&#39; mevcut değilse, aşağıdaki Yöntem-2&#39;deki talimatları izleyin. </p> <p><img src=\"images/image_thumb-19-478.png\" alt=\"How to Check for Updates in Office 2019, 2016 or 2013 in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Yöntem 2. Office 2019, 2016 ve Office 2013 için Office Güncelleştirmelerini Otomatik Olarak Yükleme. </h6> <p> Windows&#39;un mevcut Office güncellemelerini otomatik olarak indirip kurmasını istiyorsanız, Windows güncelleme ayarlarına gidin ve aşağıdaki ayarı kontrol edin: </p> <ul> <li> Windows&#39;u güncellediğinizde diğer Microsoft ürünleri için güncellemeler alın (Windows 10) </li> <li> Windows&#39;u güncelleştirdiğimde bana diğer Microsoft ürünleri için güncellemeler ver (Windows 7) </li> </ul> <h5> Windows 10&#39;da Office güncellemelerini otomatik olarak yüklemek için. </h5> <p><strong> 1. </strong> git <strong> Ayarlar </strong> -&gt; <strong> Güncelleme ve Güvenlik -&gt; Gelişmiş seçenekler. </strong></p> <p><img src=\"images/image_thumb-20-149.png\" alt=\"Change Update Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Güncelleme seçeneklerinde, &#39;Windows&#39;u güncellerken diğer Microsoft ürünleri için güncellemeleri al&#39; kaydırıcısını sürükleyin. <strong> AÇIK. </strong></p> <p><img src=\"images/image_thumb-21-717.png\" alt=\"automatically install office updates windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Önceki ekrana gidin ve <strong> Güncellemeleri kontrol et </strong> Mevcut Office güncellemelerini hemen yüklemek istediğinizde düğmesine basın. </p> <p> </p> <h5> Windows 7&#39;de Office güncelleştirmelerini otomatik olarak yüklemek için. </h5> <p> 1. Şuraya gidin: <strong> Kontrol Paneli </strong> -&gt; <strong> Windows güncelleme </strong> ve tıklayın <strong> Ayarları değiştir </strong> . </p> <p><img src=\"images/image_thumb-22-108.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Windows&#39;u güncelleştirdiğimde bana diğer Microsoft ürünleri için güncellemeler ver </strong> onay kutusunu işaretleyin ve tıklayın <strong> Uygulamak </strong> . </p> <p> 3. tıklayın <strong> Güncellemeleri kontrol et </strong> mevcut tüm Güncellemeleri yüklemek için </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın veya daha da iyisi: Bu kılavuz hakkında kelime yaymaya yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın. </p> <p> </p>"}