{"title":"Windows 10&#39;un Ağ Yazıcılarını Otomatik Olarak Yüklemesini Önleme.","content":"<p> Fark etmiş olabileceğiniz gibi, Windows 10, ağa bağlı herhangi bir yazıcı veya başka bir aygıt için sürücüleri otomatik olarak yükler. Ancak bu çok kullanışlı bir özellik olmasına rağmen, özellikle tüm yazıcıların tüm ağ kullanıcıları tarafından kullanılmasını istemeyebileceğiniz iş ortamlarında çok can sıkıcıdır. </p> <p> Tabii ki, bir ağ cihazı ve üreticisinin uygulamalarını istemiyorsanız, onu sisteminizden kaldırabilirsiniz. Ancak, Windows 10 otomatik olarak yeniden yükleyecektir. Bunu önlemek için, Windows&#39;un ağa bağlı aygıtları (yazıcılar, tarayıcılar, kameralar vb.) ve bunların uygulamalarını ve üreticiden gelen gümrük simgelerini otomatik olarak yüklemesini engellemelisiniz. </p> <h3> Ağ Aygıtlarını ve Uygulamalarını Otomatik Olarak Yüklemek için Windows 10&#39;u Nasıl DURDURUN. </h3> <p> 1. Şuraya gidin: <strong> Kontrol Paneli </strong> . Bunu yapmak için: </p> <blockquote><p> bir. Windows arama kutusuna &quot;kontrol paneli&quot; yazın <br> b. Tıklayın <strong> Kontrol Paneli </strong> sonuçlardan. </p></blockquote> <p><img src=\"images/image_thumb-53-862.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. <strong> Görüntüleme ölçütü </strong> için <strong> Küçük ikonlar </strong> tüm kontrol paneli öğelerini görüntülemek için ve ardından <strong> Ağ ve Paylaşım Merkezi. </strong></p> <p><img src=\"images/image_thumb-37-625.png\" alt=\"control panel network and sharing center\" loading=\"lazy\"></p> <p> </p> <p> 3. Seçin <strong> Gelişmiş paylaşım ayarları </strong> soldaki <strong> . </strong></p> <p><img src=\"images/image_thumb-38-656.png\" alt=\"Prevent Windows 10 to Install Network Printers Automatically\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. &quot; <strong> Ağa bağlı cihazların otomatik kurulumunu aç&quot; </strong> ve tıklayın <strong> Değişiklikleri Kaydet. </strong></p> <p><img src=\"images/image_thumb-39-992.png\" alt=\"Turn Off automatic setup of network connected devices \" loading=\"lazy\"></p> <p> </p> <p><strong> İsteğe bağlı: </strong> Windows 10&#39;un PC&#39;nize bağlı herhangi bir cihaz için üreticinin uygulamalarını ve özel simgelerini otomatik olarak indirip yüklemesini önlemek istiyorsanız, o zaman: </p> <blockquote><p> 1. Şuraya gidin: <strong> Kontrol Paneli </strong> -&gt; <strong> sistem </strong> . <br> 2. tıklayın <strong> Sistem koruması </strong> soldaki. <br> 3. Donanım sekmesinde, öğesine tıklayın. <strong> Cihaz kurulum ayarları </strong> . </p></blockquote> <p><img src=\"images/image_thumb-40-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. &quot;Cihaz yükleme ayarları&quot;nda  &quot; <strong> Hayır (cihazınız beklendiği gibi çalışmayabilir)&quot; </strong> ve tıklayın <strong> Değişiklikleri Kaydet </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-728.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu kılavuz hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini sosyal ağlarda beğenin ve paylaşın. </p>"}