{"title":"Windows 10&#39;da EFS Şifreli Dosyaların Şifresini Çözme ve EFS Şifrelemeyi Kaldırma.","content":"<p> Bir önceki eğitimde, yolu tarif etmiştim <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> EFS şifrelemesini kullanarak dosyalarınızı şifreleyin </a> . Bu eğitimde, EFS şifrelemesinin nasıl kaldırılacağını ve EFS şifreli dosyaların başka bir bilgisayara aktarıldıktan sonra şifresinin nasıl çözüleceğini öğreneceksiniz. </p> <h4> EFS Şifreli Dosyaların Şifresi Nasıl Çözülür ve EFS Şifrelemesi Devre Dışı Bırakılır. </h4> <ul> <li> <p><a href=\"#part-1\"> Bölüm 1. Aynı Bilgisayarda EFS Şifrelemesi Nasıl Devre Dışı Bırakılır ve Kaldırılır. </a></p> </li> <li> <p><a href=\"#part-2\"> Bölüm 2. Başka Bir Bilgisayardaki EFS dosyalarının şifresi nasıl çözülür. </a></p> </li> </ul> <h6> Bölüm 1. EFS Şifrelemesi Nasıl Devre Dışı Bırakılır ve Kaldırılır. </h6> <p> Dosyalarınızı EFS ile şifrelerken, şifre çözme anahtarı (sertifika) bilgisayarınızda yerel olarak depolanır ve dosyaların şifresi zaten çözülür. Dosyalarınızı/klasörlerinizi şifrelemeyi durdurmak için EFS şifrelemesini devre dışı bırakmak istiyorsanız: </p> <p> 1. Şifrelenmiş klasöre/dosyaya sağ tıklayın ve <strong> Dosya sahipliği </strong> için <strong> Kişiye özel </strong> . </p> <p><img src=\"images/image_thumb-26-500.png\" alt=\"how to disable efs encryption\" loading=\"lazy\"></p> <p> 2. Bittiğinde, klasörün/dosyanın kilidinin açıldığını görmelisiniz. Diğer tüm şifrelenmiş klasör ve dosyalardaki şifrelemeyi kaldırmak için aynı adımları uygulamanız yeterlidir. </p> <p> 3. Şimdi, EFS şifrelemesini başka bir dosya/klasör için kullanmıyorsanız ve EFS kurtarma anahtarını (diğer adıyla &quot;şifre çözme anahtarı – sertifika&quot;) bilgisayarınızdan tamamen kaldırmak istiyorsanız: </p> <blockquote> <p> 1. Internet Explorer&#39;ı açın ve <strong> Araçlar </strong> menü seçimi <strong> internet Seçenekleri </strong> . (veya aç <strong> internet Seçenekleri </strong> itibaren <strong> Kontrol Paneli </strong> .) </p> <p> 2. <strong> içerik </strong> sekme tıklaması <strong> sertifikalar </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-27-186.png\" alt=\"how to remove efs certificate-recovery key\" loading=\"lazy\"></p> <blockquote> <p> 3. Kişisel sekmesinde, şifre çözme sertifikasını seçin ve <strong> Kaldırmak </strong> . * </p> <p><strong> * Dikkat: </strong> Sertifikayı (şifre çözme anahtarı) kaldırmadan önce tüm şifrelenmiş dosyalar için şifrelemeyi kaldırdığınızdan (durdurduğunuzdan) emin olun. </p> </blockquote> <p><img src=\"images/image_thumb-25-639.png\" alt=\"how to remove efs recovery key\" loading=\"lazy\"></p> <blockquote> <p> 4. <strong> Tekrar başlat </strong> senin bilgisayarın. </p> </blockquote> <h6></h6> <h6> Bölüm 2: Başka bir bilgisayardaki EFS şifreli dosyaların şifresi nasıl çözülür. </h6> <p> EFS şifreli dosyaları başka bir bilgisayara aktardıysanız, EFS dosyalarını görüntülemenin (açmanın) tek yolu şifre çözme anahtarına sahip olmaktır. Şifre çözme anahtarı, dosyaları şifrelerken dışa aktardığınız sertifika .pfx dosyasıdır. EFS şifre çözme anahtarınız yoksa, EFS dosyalarının şifresini çözmenin bir yolu yoktur. </p> <p><strong> Şifre Çözme Anahtarı - Sertifika&#39;yı kullanarak EFS şifreli dosyaların şifresini çözmek için: </strong></p> <p> 1. Yüklemek için şifre çözme anahtarına (sertifika .pfx dosyası) çift tıklayın. <br> 2. Sertifika Alma Sihirbazı&#39;nın Hoş Geldiniz ekranında <strong> Sonraki </strong> . <br> 3. Ardından tıklayın <strong> Sonraki </strong> tekrar. </p> <p><img src=\"images/image_thumb38_thumb-158.png\" alt=\"How to Decrypt EFS Encrypted files\" loading=\"lazy\"></p> <p> 4. Sertifika anahtarını dışa aktarırken kullandığınız parolayı yazın ve <strong> Sonraki </strong> . </p> <p><img src=\"images/image_thumb39_thumb-680.png\" alt=\"install efs .pfx certificate\" loading=\"lazy\"></p> <p> 5. Sertifika Deposu seçeneklerinde varsayılan ayarları bırakın ve <strong> Sonraki </strong> . </p> <p><img src=\"images/image_thumb40_thumb-629.png\" alt=\"image_thumb[40]\" loading=\"lazy\"></p> <p> 6. Son olarak tıklayın <strong> Bitiş </strong> . </p> <p><img src=\"images/image_thumb41_thumb-225.png\" alt=\"image_thumb[41]\" loading=\"lazy\"></p> <p> </p> <p> 7. Artık şifrelenmiş dosyaları açabilirsiniz. * </p> <p> * Not: Dosyaların şifresini çözdükten sonra, adresindeki talimatları izleyin. <a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> Bölüm 1 </a> yukarıdaki, isterseniz şifrelemeyi tamamen kaldırmak için. </p> <p> Hepsi bu kadar millet! İşinize yaradı mı? <br> Lütfen aşağıdaki yorum bölümüne bir yorum bırakın, hatta daha iyisi: Bu çözüm hakkındaki sözlerin yayılmasına yardımcı olmak için bu blog gönderisini beğenin ve sosyal ağlarda paylaşın </p>"}