{"title":"ВИПРАВЛЕННЯ: Не вдається відкрити посилання з електронної пошти Windows 10 або Outlook у Windows 10. (Вирішено)","content":"<p> Якщо ви не можете відкрити посилання з електронних листів у програмах Windows 10 Mail &amp; Outlook, продовжуйте читати нижче, щоб вирішити проблему. Багато користувачів повідомляють, що після оновлення Windows 10 вони не зможуть відкрити вбудовані посилання з електронних листів у веб-браузері та отримати невідому помилку. </p> <p> Проблема в деталях: на комп’ютері під керуванням Windows 10 гіперпосилання з електронних листів програми Outlook або програми Windows 10 Mail не відкриваються у веб-браузері, особливо якщо ви використовуєте як браузер за замовчуванням Chrome або Firefox, а не Microsoft Edge . </p> <h4> Як виправити: неможливо відкрити HTML-посилання з електронних листів після оновлення Windows 10. </h4> <h6> Спосіб 1. Скиньте програми за замовчуванням. </h6> <p> 1. Закрийте всі відкриті веб-браузери. <br> 2. Закрийте електронну програму, яку ви використовуєте (наприклад, Windows 10 Mail, Outlook) </p> <p> 3. З меню «Пуск» <img src=\"images/image_thumb2_thumb_thumb-709.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> натисніть <strong> Налаштування </strong><img src=\"images/image_thumb-66-594.png\" alt=\"image\" loading=\"lazy\"> і натисніть <strong> Програми </strong></p> <p><img src=\"images/image_thumb-72-875.png\" alt=\"Windows 10 Apps\" loading=\"lazy\"></p> <p> 4. Виберіть <strong> Програми за замовчуванням </strong> на лівій панелі, а потім клацніть на <strong> Скинути </strong> кнопку для скидання програм, рекомендованих Microsoft. </p> <p><img src=\"images/image_thumb-73-622.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 5. Тепер відкрийте свою поштову програму та відкрийте гіперпосилання з електронного листа. Зазвичай посилання відкриється у браузері Microsoft Edge без проблем. </p> <p> 6. Тепер, <strong> закрити </strong> поштову програму знову. </p> <p> 7. Відкрийте веб-браузер і встановіть його за замовчуванням або перейдіть до <strong> Налаштування&gt; </strong> <strong> Додатки&gt; Програми за замовчуванням </strong> і в <strong> Веб-браузер </strong> варіантів, натисніть на <strong> Microsoft Edge </strong> і виберіть улюблений браузер веб-браузером за замовчуванням. </p> <p><img src=\"images/image_thumb-75-384.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 8. Відкрийте програму Пошта ще раз і спробуйте відкрити гіперпосилання. Якщо проблема не зникає, виконайте кроки у способі-2. </p> <h6> Спосіб 2. Зміна асоціацій HTML у реєстрі. </h6> <p> 1. Одночасно натисніть Windows <img src=\"images/image_thumb36-617.png\" alt=\"image\" loading=\"lazy\"> + <strong> Р </strong> клавіші, щоб відкрити поле команди запуску. <br> 2. Тип <strong> regedit </strong> &amp; натисніть <strong> Введіть. </strong></p> <p><img src=\"images/image_thumb7-779.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2. На лівій панелі перейдіть до цього підрозділу: </p> <ul> <li><strong> HKEY_CURRENT_USER \\ Software \\ Classes \\ .html </strong></li> </ul> <p> 3. Зараз <em> подвійне клацання </em> біля <strong> (За замовчуванням) </strong> Рядок на правій панелі та встановіть для значення даних значення <strong> htmlфайл </strong></p> <p><img src=\"images/image_thumb2-467.png\" alt=\"Cannot Open Links from Windows 10 Email or Outlook in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 4. Виконайте ту ж операцію та змініть <em><strong> За замовчуванням </strong></em> значення рядка до <strong> htmlфайл </strong> у цих підрозділах: </p> <ul> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .htm </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .shtml </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .xhtml </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .xht <br> </em></li> </ul> <p> 5. Закрийте редактор реєстру та <strong> перезапустити </strong> комп&#39;ютера. <br> 6. Спробуйте відкрити гіперпосилання з вашої програми електронної пошти. </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це. </p>"}