{"title":"ВИПРАВЛЕННЯ: Outlook 0x80042112 - отримання повідомлення про помилку (вирішено)","content":"<p> Outlook 0x80042112 Отримання повідомлення про помилку, як правило, виникає, коли Outlook намагається отримувати електронні листи дуже великого розміру (наприклад, електронні листи з великими вкладеннями). У цьому випадку Outlook відображає таку помилку під час &quot;Надсилання / отримання прогресу&quot;: &quot;Завдання&quot;% Email-Account% - отримання &quot;повідомляє про помилку (0x80042112):&quot; Наступні повідомлення електронної пошти на поштовому сервері завантажити не можна. Зверніться до свого постачальника послуг Інтернету (ISP) або до адміністратора пошти, якщо ви продовжуєте отримувати цю помилку. &quot; </p> <p><img src=\"images/image_thumb-7-121.png\" alt=\"FIX: Outlook 0x80042112 Receiving reported error. \" loading=\"lazy\"></p> <p> Цей підручник містить докладні інструкції щодо усунення помилки отримання Outlook 0x80042112. </p> <h4> Як виправити отримання повідомлення про помилку 0x80042112 в Outlook. </h4> <h6> Крок 1. Переконайтеся, що ви підключені до Інтернету. </h6> <p> Іноді помилка отримання Outlook 0x80042112 виникає через припинення з’єднання з Інтернетом. Отже, перш за все, перевірте, чи працює з’єднання з Інтернетом. Для цього відкрийте свій Інтернет-браузер і відвідайте будь-який веб-сайт, щоб перевірити з’єднання. </p> <p> </p> <h6> Крок 2. Видалити вихідні повідомлення електронної пошти. </h6> <p> Другим способом усунення помилки 0x80042112 в Outlook є видалення або переміщення до чернеток усіх повідомлень електронної пошти, які застрягли в папці &quot;Вихідні&quot;. Для цього: </p> <p> 1. У програмі Outlook натисніть <strong> Надіслати / Отримати </strong> , а потім натисніть <strong> Працюйте в автономному режимі </strong> . </p> <p><img src=\"images/image_thumb-8-737.png\" alt=\"Move Outbox Emails to Drafts folder\" loading=\"lazy\"></p> <p> 2. <strong> Перезапустіть </strong> Outlook. <br> 3. Виберіть <strong> Вихідні </strong> папку (ліворуч), а потім натисніть <strong> CTRL </strong> + <strong> A </strong> щоб вибрати всі електронні листи (праворуч). <br> 4. Клацніть правою кнопкою миші на вибрані електронні листи та перемістіть їх до <strong> Чернетки </strong> , натиснувши <strong> Перемістити -&gt; Інша папка </strong> , а потім виберіть <strong> Чернетки </strong> зі списку. </p> <p><img src=\"images/image_thumb-10-352.png\" alt=\"FIX Outlook error 0x80042112\" loading=\"lazy\"></p> <p> </p> <p> 5. Закінчивши, клацніть на <strong> Надіслати / Отримати </strong> та натисніть <strong> Робота в Інтернеті. <br> </strong> 6. <strong> Перезапустіть </strong> Outlook і виконайте надсилання / отримання. </p> <h6></h6> <h6> Крок 3. Запустіть Outlook без надбудов. </h6> <p> Іншим методом виправлення помилки Outlook 0x80042112 при отриманні є запуск програми Outlook у безпечному режимі та вимкнення будь-яких надбудов, які можуть спричинити помилку. </p> <p> 1. Щоб запустити Outlook у безпечному режимі, натисніть і утримуйте <strong> CTRL </strong> клавіші (на клавіатурі), а потім двічі клацніть на ярлику Microsoft Outlook, або: </p> <blockquote><p> a. Одночасно натисніть Windows <img src=\"images/image_thumb36-371.png\" alt=\"image\" loading=\"lazy\"> + <strong> Р </strong> клавіші, щоб відкрити поле команди запуску. <br> b. Тип: <strong> світогляд / безпечний </strong> і натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb-14-671.png\" alt=\"outlook safe mode\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. У безпечному режимі Outlook перейдіть до Параметри надбудов та <strong> вимкнути всі надбудови </strong> . Для цього: </p> <ul> <li> Щоб вимкнути надбудови в <strong> Outlook 2007 </strong> : </li> </ul> <blockquote><p> 1. <strong> Увімкнено </strong> <strong> Інструменти </strong> меню, натисніть <strong> Центр довіри. </strong><br> 2. Виберіть <strong> Надбудови </strong> на лівій панелі. <br> 3. На правій панелі виберіть <strong> Надбудови COM </strong> і натисніть <strong> Іди… <br> </strong> 4. <strong> Зніміть прапорець </strong> всі прапорці, щоб вимкнути всі надбудови та клацнути <strong> ГАРАЗД. </strong></p></blockquote> <ul> <li> Щоб вимкнути надбудови в <strong> Outlook 2016, 2013 </strong> або <strong> 2010 рік </strong> : </li> </ul> <blockquote><p> 1. Клацніть на <strong> Файл </strong> меню та виберіть <strong> Варіанти </strong> . <br> 2. Виберіть <strong> Надбудови на </strong> ліва панель. <br> 3. На правій панелі виберіть <strong> Надбудови COM </strong> і натисніть <strong> Іди… </strong></p></blockquote> <p><img src=\"images/image_thumb-20-411.png\" alt=\"disable outlook add-ins\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. <strong> Зніміть прапорець </strong> <strong> всі </strong> і натисніть <strong> гаразд </strong> щоб вимкнути всі надбудови. </p> <p><strong><img src=\"images/image_thumb-21-683.png\" alt=\"turn off outlook add-ins\" loading=\"lazy\"><strong><br> </strong></strong></p> </blockquote> <p> 3. <strong> Перезапустіть </strong> Outlook. <br> 4. Спробуйте надіслати / отримати. Якщо процес надсилання / отримання закінчується нормально і без відображення помилки 0x80042112, тоді продовжуйте та ввімкніть по черзі всі відключені плагіни та перезапустіть Outlook, поки не з’ясуєте, який із них викликає проблему. </p> <p> </p> <h6> Крок 4. Перевірте налаштування антивірусу та брандмауера. </h6> <p> Якщо ви використовуєте антивірусну програму з функціями сканування електронної пошти, вимкніть антивірусну надбудову в Outlook (див. Інструкції на кроці 3 вище) або тимчасово вимкніть антивірусний захист або видаліть антивірусну програму. Крім того, перевірте налаштування брандмауера та переконайтеся, що порти сервера електронної пошти, які ви використовуєте, не блокуються програмою брандмауера. Більш конкретно, у налаштуваннях брандмауера: </p> <p> A. Увімкніть такі файли для доступу до Інтернету: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Увімкніть такі порти у брандмауері: </p> <ul> <li><strong> Порт 110 </strong> (Якщо ви використовуєте сервер вхідної пошти POP3 без зашифрованого з’єднання) * </li> <li><strong> Порт 995 </strong> (Якщо ви використовуєте сервер вхідної пошти POP3 із зашифрованим з’єднанням (SSL увімкнено) </li> </ul> <ul> <li><strong> Порт 143 </strong> (якщо ви використовуєте сервер вхідної пошти IMAP без зашифрованого з’єднання) </li> <li><strong> Порт 993 </strong> (якщо ви використовуєте сервер вхідної пошти IMAP із зашифрованим з&#39;єднанням (SSL увімкнено) </li> </ul> <ul> <li><strong> Порт 25 </strong> Якщо ваш сервер вихідної пошти SMTP не використовує SSL. * </li> <li><strong> Порт 465 </strong> або <strong> 587 </strong> якщо ваш сервер вихідної пошти SMTP використовує SSL </li> </ul> <p> * Примітка: За замовчуванням порт 25 призначений для вихідного доступу, а порт 110 - для вхідного. Якщо ви не впевнені в портах, зверніться до свого провайдера або системного адміністратора. </p> <p> </p> <h6> Крок 5. Відремонтуйте файл даних PST Outlook. </h6> <p> Наступним кроком, щоб виправити повідомлення про отримання повідомлення про помилку 0x80042112 в Outlook, є запуск засобу відновлення папки &quot;Вхідні&quot; для відновлення вашого файлу .pst. Детальні вказівки щодо цього можна знайти в цьому посібнику: <a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Як відновити файл даних PST Outlook </a> . </p> <p> </p> <h6> Крок 6. Перевірте розмір повідомлень електронної пошти з веб-сторінки. </h6> <p> Якщо у вас є доступ до вашого облікового запису електронної пошти через Інтернет, увійдіть у свій обліковий запис електронної пошти за допомогою веб-браузера та перевірте, чи не є проблемою розмір електронної пошти. Наприклад, якщо ви знайдете великий електронний лист у вхідних, завантажте його вкладення та видаліть цей електронний лист. * </p> <p> * Примітка. Якщо у вас немає доступу до вашого облікового запису електронної пошти через Інтернет, зверніться до свого постачальника послуг електронної пошти, щоб повідомити про проблему. </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}