{"title":"ВИПРАВЛЕННЯ: VeraCrypt не реагує (зависає) на демонтаж у Windows 10 (вирішено)","content":"<p> Цей посібник містить інструкції щодо виправлення наступної проблеми з VeraCrypt на комп&#39;ютері під керуванням Windows 10: VeraCrypt не реагує та зависає (зависає) під час демонтажу зашифрованого тому. </p> <p> Проблема з VeraCrypt не реагує (заморожування) детально: При спробі демонтувати том (із закритими усіма файлами від змонтованого тому) VeraCrypt зависає та відображає &quot;Не відповідає&quot;. Коли з’являється ця проблема, єдиним способом відновити Windows до нормального стану є завершення процесу VeraCrypt із диспетчера завдань. </p> <p> Відповідно до <a href=\"https://www.veracrypt.fr/en/Issues%20and%20Limitations.html\" target=\"_blank\" rel=\"nofollow noopener\"> VeraCrypt </a> проблема зависання спричинена конфліктом між діалоговим вікном очікування VeraCrypt, що відображається під час операцій монтування / демонтажу, та іншим програмним забезпеченням, встановленим на машині (наприклад, антивірус або брандмауер). </p> <h4> Як виправити: VeraCrypt не реагує на демонтаж / монтажний обсяг. </h4> <p> Ця проблема викликана конфліктом між діалоговим вікном очікування VeraCrypt, що відображається під час операцій монтування / демонтажу, та іншим програмним забезпеченням, встановленим на машині (наприклад, Outpost Firewall Pro). </p> <p> 1. Від VeraCrypt&#39;s <strong> Налаштування </strong> меню, виберіть <strong> Преференції </strong> . </p> <p><img src=\"images/image_thumb-63-122.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Перевірте </strong> <strong> Не показувати діалогове вікно повідомлення про очікування під час виконання операцій </strong> клацніть варіант <strong> ГАРАЗД. </strong></p> <p><img src=\"images/image_thumb-64-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Тепер приступайте до монтування / демонтажу томів без заморожування! </p> <p> Це все, шановні! Вам це вдалося? Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}