{"title":"ВИПРАВЛЕННЯ: Швидкий доступ не працює та неможливо ввести у вікні пошуку в Windows 10 (вирішено)","content":"<p> Якщо <strong> Швидкий доступ </strong> Меню s не працює в Windows 10, тоді прочитайте цей посібник, щоб вирішити проблему. Параметр швидкого доступу у Провіднику файлів дозволяє користувачеві легко перейти до нещодавно відкритих файлів та папок. Але іноді, особливо коли ви раніше відкривали файл / папку із зовнішнього накопичувача (наприклад, вашого USB-диска), який зараз перебуває в режимі офлайн, у швидкому доступі не відображаються останні файли, або ви не можете ввести на панелі пошуку. </p> <p><img src=\"images/image_thumb-2-490.png\" alt=\"FIX: Quick Access Not Working in Windows 10 (Solved)\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Як виправити: функція швидкого доступу та функція пошуку не працюють у Windows 10. </h4> <p> </p> <h6> Спосіб 1. Перезапустіть Провідник Windows. </h6> <p> Перший спосіб вирішити проблему швидкого доступу - це перезапустити процес Провідника Windows із диспетчера завдань. Для цього: </p> <p> 1. Натисніть <strong> Ctrl </strong> + <strong> Alt </strong> + <strong> Дел </strong> відкривати <strong> Диспетчер завдань </strong> . <br> 2. В <strong> Процеси </strong> *, виділіть <strong> Провідник Windows </strong> процес і натисніть <strong> Перезапустіть </strong> . </p> <p> * Примітка. Якщо вкладка &quot;Процес&quot; не відображається, натисніть <strong> Детальніше. </strong></p> <p><img src=\"images/image_thumb-951.png\" alt=\"restart windows explorer\" loading=\"lazy\"></p> <p><strong> </strong></p> <h6> Спосіб 2. Увімкніть швидкий доступ до нещодавніх елементів та очищення історії провідника файлів. </h6> <p> 1. Відкрити <strong> Параметри папки. </strong> Для цього відкрийте Провідник Windows і в меню перейдіть до <strong> Переглянути </strong> &gt; <strong> Варіанти </strong> . </p> <p><img src=\"images/image_thumb-3-949.png\" alt=\"enable quick access windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. В <strong> Загальні </strong> переконайтеся, що встановлені такі прапорці. </p> <ul> <li><strong> Показати нещодавно використані файли у розділі Швидкий доступ </strong></li> <li><strong> Показати часто використовувані папки у швидкому доступі. </strong></li> </ul> <p> 3. Потім клацніть на <strong> Ясно </strong> , щоб очистити історію Провідника файлів. </p> <p><img src=\"images/image_thumb-4-329.png\" alt=\"clear quick access history\" loading=\"lazy\"></p> <p> </p> <p> 3. Клацніть <strong> гаразд </strong> і перевірте, чи працює швидкий доступ та функція пошуку. Якщо ні, перезапустіть «Провідник файлів» за допомогою диспетчера завдань (див. Метод-1 вище) і перевірте ще раз. Якщо проблема не зникне, перейдіть до наступного способу. </p> <h6> Спосіб 3. Очищення історії останніх елементів вручну. </h6> <p> Наступним методом вирішення проблем із швидким доступом до останніх елементів або з функцією &quot;Пошук&quot; у Windows 10 є видалення історії останніх елементів вручну. Для цього: </p> <p> 1. Відкрийте Провідник Windows. <br> 2. Скопіюйте та вставте таку адресу в адресний рядок і натисніть <strong> Введіть </strong> : </p> <p> % AppData% \\ Microsoft \\ Windows \\ Recent \\ AutomaticDestinations </p> <p><img src=\"images/image_thumb-1-410.png\" alt=\"clear recent items windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Натисніть <strong> Ctrl </strong> + <strong> A </strong> (щоб вибрати всі елементи) і натисніть <strong> Видалити </strong> (або клацніть правою кнопкою миші&gt; <strong> Видалити </strong> ). </p> <p><img src=\"images/image_thumb-5-834.png\" alt=\"Delete Quick Access History\" loading=\"lazy\"></p> <p> </p> <p> 4. Потім скопіюйте / вставте наступну адресу в адресний рядок і натисніть <strong> Введіть </strong> . </p> <p> % AppData% \\ Microsoft \\ Windows \\ Recent \\ CustomDestinations </p> <p><img src=\"images/image_thumb-6-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Натисніть <strong> Ctrl </strong> + <strong> A </strong> ще раз (щоб вибрати всі елементи) і натисніть <strong> Видалити. <br> </strong> 6. Тепер натисніть <strong> Ctrl + Alt + Del </strong> відкривати <strong> Диспетчер завдань </strong> . <br> 7. В <strong> Процеси </strong> на вкладці, виділіть <strong> Провідник Windows </strong> процес і натисніть <strong> Перезапустіть </strong> . <br> 8. Зазвичай проблеми з функцією &quot;Швидкий доступ&quot; або з функцією &quot;Пошук&quot; повинні бути вирішені. </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}