{"title":"ВИПРАВЛЕННЯ: Папка DRAFTS Outlook відсутня в області навігації в Outlook 2013, 2010 або 2007 (вирішено)","content":"<p> У одного з моїх клієнтів виникла така проблема: Раптом і без очевидної причини папка Чернетки відсутня на панелі навігації в Outlook 2013. Перша дія відновлення відсутньої папки Чернетки - це пошук у всіх інших папках Outlook, переконайтеся, що папку не було переміщено або видалено помилково. Якщо ви все ще не можете знайти відсутні папки, перейдіть нижче, щоб вирішити проблему. </p> <p><img src=\"images/image_thumb-37-460.png\" alt=\"Drafts folder Missing Outlook\" loading=\"lazy\"></p> <p> </p> <p> Цей підручник містить інструкції щодо відновлення відсутньої папки в Outlook 2007, 2010, 2013, 2016 або 365. </p> <h4> Як відновити відсутні папки з навігаційної панелі Outlook. </h4> <h6> Спосіб 1. Скануйте свою систему на наявність вірусів та шкідливих програм. </h6> <p> Першим кроком для вирішення проблеми &quot;відсутніх папок&quot; в Outlook є переконання, що у вашій системі немає вірусів та шкідливих програм. Для цього завдання дотримуйтесь інструкцій у цьому посібнику: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Як сканувати комп’ютер на наявність вірусів та інших шкідливих програм. </a></p> <p> </p> <h6> Спосіб 2. СКИНУТИ папки Outlook. </h6> <p> Після сканування вірусів продовжте та скиньте папки Outlook до стандартних за допомогою наведеного нижче процесу: </p> <p> 1. Закрийте програму Outlook. <br> 2. Натисніть кнопку <strong> Windows </strong> <img src=\"images/image_thumb8_thumb_thumb-622.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> Р. </strong> клавіші, щоб відкрити поле команди запуску. <br> 3. У полі пошуку введіть: <strong> перспективи / скидання папок </strong> &amp; натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb-36-732.png\" alt=\"outlook reset folders\" loading=\"lazy\"></p> <p> </p> <p> 4. Outlook відкриється, і всі відсутні папки будуть повернуті. </p> <p> Це все, шановні! Вам це вдалося? </p> <p> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це. </p>"}