{"title":"ВИПРАВЛЕННЯ: попередніх версій у Windows 10 немає (вирішено)","content":"<p> На комп&#39;ютері під керуванням Windows 10 із <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Захист системи </a> Увімкнено, при спробі відновити файл / папку за допомогою функції &quot;Відновити попередні версії&quot; з&#39;являється така проблема: &quot;Немає доступних попередніх версій&quot;. </p> <p> <img src=\"images/image_thumb-39-628.png\" alt=\"There No Previous Versions Available in Windows 10 \" loading=\"lazy\"></p> <p> </p> <p> Помилка &quot;Немає попередніх версій&quot; виникає, оскільки в Windows 10 функція &quot;Відновити попередні версії&quot; працює лише в тому випадку, якщо ви налаштували &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Історія файлів </a> &#39;для резервного копіювання файлів. Це означає, що функція «Відновити попередні версії» в Windows 10 переглядає місце резервного копіювання «Інструмента резервного копіювання історії файлів», щоб знайти попередню версію файлу / папки, а не пункти відновлення системи, як це відбувається в Windows 7. Щоб увімкнути Історію файлів у Windows 10, дотримуйтесь інструкцій у таких статтях: </p> <ul> <li><strong> Пов’язані статті: </strong></li> <li> <ul> <li><a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Як створити резервну копію особистих файлів за допомогою історії файлів у Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Як створити тіньові копії ваших файлів за допомогою планувальника завдань у Windows 10 </a></li> </ul> </li> </ul> <h4> Як виправити: попередні версії файлів, доступних у Windows 10, відсутні. </h4> <p> Якщо <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Історія файлів </a> &#39;вже ввімкнено * на вашому ПК з Windows 10, але ви отримуєте повідомлення &quot;Немає доступних попередніх версій&quot;. При спробі відновити попередню версію файлу або папки, дотримуйтесь інструкцій нижче: </p> <p> * Примітка: Наведені нижче інструкції <strong> не працює, якщо <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Історію файлів ВЖЕ не ввімкнено </a></strong> на ПК з Windows 10. </p> <p> 1. Завантажте та встановіть <a href=\"http://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowExplorer </a> утиліта на вашому ПК. <br> 2. Відкрийте &quot;ShadowExplorer&quot; і виберіть дату, з якої ви хочете відновити файл. * </p> <p> * Примітка: Якщо ви не бачите попередньої дати, це означає, що історію файлів вимкнено. Майте на увазі, що навіть якщо ви ввімкнули історію файлів зараз, результат буде однаковим, оскільки історія файлів створює знімки ваших файлів з моменту їх активації, а потім. </p> <p><img src=\"images/image_thumb-40-348.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Перейдіть до місця зберігання файлу / папки, який потрібно відновити до попередньої версії. <br> 4. Коли ви знайдете файл, який потрібно відновити, клацніть на ньому правою кнопкою миші та виберіть <strong> Експорт </strong> . </p> <p><img src=\"images/image_thumb-41-653.png\" alt=\"restore previous versions shadow explorer\" loading=\"lazy\"></p> <p> </p> <p> 5. Виберіть інший диск (місце) для збереження відновленого файлу та натисніть <strong> гаразд </strong> . * </p> <p><strong> Важливо: </strong> Збережіть відновлені файли (файли) на інший диск (наприклад, флешку), і лише переконавшись, що у вас є правильні файли, скопіюйте їх у вихідне місце, щоб уникнути перезапису оригінальних файлів. </p> <p><img src=\"images/image_thumb-38-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про цю проблему. </p>"}