{"title":"ВИПРАВЛЕННЯ: Windows 10 працює надзвичайно повільно після встановлення v2004 або Edge Chromιum (вирішено)","content":"<p> Багато користувачів повідомляють, що їх ПК працює надзвичайно повільно після встановлення оновлення для Windows 10 2004 або після встановлення нової версії браузера Microsoft Edge на основі Chromium. Якщо ви стикаєтесь із однією з вищезазначених проблем, дотримуйтесь інструкцій у цій статті, щоб вирішити їх. </p> <p> Проблема в деталях: Після оновлення Windows 10 до версії 2004 або після інсталяції <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> оновлення, яке автоматично встановлює новий браузер Edge (версія Chromium), Windows займає багато часу під час завантаження або працює дуже повільно. </p> <h4> Як виправити: проблеми з повільним завантаженням та повільною продуктивністю в Windows 10 2004. </h4> <h6> Спосіб 1. Встановіть доступні оновлення Windows та оновіть драйвери пристроїв. </h6> <p> Перший спосіб вирішити проблеми з повільною продуктивністю в Windows 10 - виконати такі дії: </p> <ul> <li><strong> Крок 1. </strong> Завантажте та встановіть усі доступні оновлення Windows. </li> <li><strong> Крок 2. </strong> Завантажте та встановіть найновіші драйвери Windows 10 для адаптера дисплея. </li> <li><strong> Крок 3. </strong> Якщо ви використовуєте сторонні антивірусні програми, видаліть їх і перевірте, чи проблема з повільною продуктивністю не зникає. Якщо ні, встановіть останню версію програми AV. </li> </ul> <p> </p> <h6> Спосіб 2. Видаліть версію Microsoft Edge Chromium. </h6> <p> Другим способом усунення проблем із повільною продуктивністю в Windows 10 є видалення версії Microsoft Edge Chromium (якщо вона встановлена). </p> <h5> Крок 1. Перевірте, чи встановлена ​​нова версія Microsoft Edge на основі Chromium. </h5> <p> 1. З меню «Пуск» <img src=\"images/image_thumb2_thumb_thumb-381.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> натисніть <strong> Налаштування </strong><img src=\"images/image_thumb-66-515.png\" alt=\"image\" loading=\"lazy\"> і натисніть <strong> Програми. <br> </strong> 2. Якщо <strong> Програми та функції </strong> знайдіть програму Microsoft Edge і відповідно до її піктограми виконайте наступні дії: </p> <ul> <li> Якщо ви бачите це зображення піктограми <img src=\"images/image_thumb-32-976.png\" alt=\"image\" loading=\"lazy\"> , це означає, що на вашому комп’ютері вже встановлена ​​нова версія Microsoft Edge на основі Chromium. У цьому випадку перейдіть до <strong> <a href=\"#step-2\" target=\"_blank\" rel=\"nofollow noopener\"> крок-2 </a></strong> видалити Edge Chromium з ПК. </li> <li> Якщо ви бачите це зображення піктограми <img src=\"images/image_thumb-33-372.png\" alt=\"image\" loading=\"lazy\"> , це означає, що нова версія на базі Chromium ще не встановлена ​​на вашому комп’ютері. У цьому випадку перейдіть до <a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"><strong> метод-3 </strong></a> . </li> </ul> <p><img src=\"images/image_thumb-71-268.png\" alt=\"FIX: Windows 10 Running Extremely Slow after 2004 Update\" loading=\"lazy\"></p> <p> </p> <h5> Крок 2. Видаліть Edge Chromium з ПК. </h5> <p> Щоб видалити новий Edge на базі Chromium у Windows 10: </p> <p> 1. Перейдіть до наступної папки на вашому ПК: * </p> <ul> <li> C: \\ Program Files (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </li> </ul> <p> * Примітка: Назва папки &quot;85.0.564.41&quot; вказує на встановлену версію нової версії Chromium і може відрізнятися на вашому ПК. </p> <p> 2. Виберіть шлях до папки в адресному рядку та клацніть правою кнопкою миші&gt; <strong> Копіювати. </strong></p> <p><img src=\"images/image_thumb-35-379.png\" alt=\"Uninstall Edge Chromiun\" loading=\"lazy\"></p> <p> </p> <p> 3. Відкрити <strong> Командний рядок як адміністратор, </strong> типу <strong> компакт-диск </strong> а потім натисніть <strong> CTRL + V </strong> вставити в скопійований шлях до папки. Після закінчення натисніть <strong> Введіть </strong> . * </p> <p> * наприклад: У поточному прикладі команда буде такою: </p> <p><em> cd C: \\ Program Files (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </em></p> <p><img src=\"images/image_thumb-36-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Тепер у командному рядку дайте наведену нижче команду (Копіювати / Вставити), щоб видалити версію браузера Microsoft Edge Chromium з вашого ПК. </p> <ul> <li> setup.exe –установка –системний рівень –вербозове ведення журналу –силка-видалення </li> </ul> <p><img src=\"images/image_thumb-37-229.png\" alt=\"Remove Edge Chromiun\" loading=\"lazy\"></p> <p> 5. Після виконання вищевказаної команди стара версія EDGE буде знову активована. Перезавантажте ПК, щоб застосувати зміни. <br> 6. Після перезапуску перейдіть до встановлення <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> новий браузер Edge на основі Chromium </a> на своєму ПК, щоб уникнути повторного встановлення проблемного оновлення KB4559309. </p> <p> </p> <h6> Спосіб 3. Відновіть Windows 10 до попередньої версії. </h6> <p> 1. З <strong> Почніть </strong> меню <img src=\"images/image_thumb2_thumb_thumb-872.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> відчинено <strong> Налаштування </strong> <img src=\"images/image_thumb-66-969.png\" alt=\"image\" loading=\"lazy\"> а потім клацніть <strong> Оновлення та безпека. </strong></p> <p> 2. Виберіть <strong> Одужання </strong> зліва, а потім у розділі &quot;Повернутися до попередньої версії Windows 10&quot; натисніть <strong> Розпочати </strong> кнопку. </p> <p><img src=\"images/image_thumb-4-708.png\" alt=\"Restore Windows to earlier version\" loading=\"lazy\"></p> <p> 3. Дотримуйтесь підказок на екрані, щоб відновити Windows 10 до попередньої версії. <br> 4. Після повернення до попередньої версії Windows 10 ваш комп’ютер повинен знову працювати нормально і без затримок. </p> <p> </p> <h6> Спосіб 4. Відновлення Windows 10. </h6> <p> Наступним методом вирішення проблем із повільною продуктивністю в Windows 10 є відновлення Windows за допомогою команд SFC та DISM: </p> <p> 1. Відкрити <strong> Командний рядок як адміністратор </strong> . <br> 2. У командному рядку введіть таку команду dism і натисніть <strong> Введіть: </strong></p> <ul> <li><strong> DISM.exe / Online / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-175.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> </p> <p> 3. Після завершення операції DISM введіть таку команду та натисніть <strong> Введіть </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb31-316.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Тепер почекайте, поки перевірка системних файлів не відновить системні файли Windows. <br> 5. Коли це буде зроблено, <strong> перезапустити </strong> комп’ютера та подивіться, чи проблему вирішено. </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}