{"title":"ВИПРАВЛЕННЯ: Не вдається ввійти в програми для робочого столу Office - Вікно облікових даних не відображається (вирішено)","content":"<p> Кілька днів тому я вирішив таку проблему на комп’ютері з Windows 10, на якому працює Microsoft Office: користувач не може ввійти в жодну програму Office (Word, Outlook тощо), оскільки система ніколи не відображає вікно облікових даних для входу в Office 365 пароль. Отже, якщо ви не можете ввійти в Office Desktop Apps, оскільки вікно для введення пароля ніколи не з’являється, продовжуйте читати нижче. </p> <p> Опис проблеми: Після відкриття будь-якої програми для робочого столу Office (Word, Excel тощо) система пропонує вам увійти за допомогою облікових даних облікового запису Microsoft. Однак після введення вашого імені користувача вікно входу закривається, і запит на введення пароля ніколи не відображається. У результаті цього ви не можете користуватися програмою Office або стикаєтесь з іншими проблемами. Згадана проблема може з’явитися в Microsoft Office 2013 та Office 2016. </p> <p> Цей підручник містить вказівки щодо вирішення наведеної нижче проблеми в Windows 10: Не вдається ввійти в настільні програми Microsoft Office за допомогою облікових даних Office 365, оскільки вікно облікових даних не відображається. </p> <h4> Як виправити: неможливо ввійти за допомогою облікового запису MS до будь-якої настільної програми Office. (Офіс 2013/2016/2019). </h4> <h6> Спосіб 1. Видаліть збережені облікові дані Office із панелі керування. </h6> <p> Першим методом вирішення проблеми входу в настільних програмах Office є видалення збережених облікових даних Microsoft із ПК. Для цього: </p> <p> 1. Закрийте всі програми Office. <br> 2. Перейдіть до Windows <strong> Панель управління </strong> , і відкрийте <strong> Менеджер облікових даних </strong> . </p> <p><img src=\"images/image_thumb-23-297.png\" alt=\"Control Panel - Credential Manager\" loading=\"lazy\"></p> <p> 3. В <strong> Повноваження Windows </strong> , видалити всі облікові дані для Microsoft Office. </p> <p><img src=\"images/image_thumb-24-389.png\" alt=\"Remove Office Credentials\" loading=\"lazy\"></p> <p> </p> <p> 4. Відкрийте будь-яку програму Office і повторіть спробу входу за допомогою облікового запису Microsoft. Якщо ви все ще не можете увійти до свого облікового запису, застосуйте наведені нижче способи-2. </p> <p> </p> <h6> Спосіб 2. Вимкніть сучасну автентифікацію. </h6> <p> Другий спосіб вирішення проблеми входу в програму Office - це вимкнення сучасної автентифікації в Office. Для цього: </p> <p> 1. Відкрийте редактор реєстру та перейдіть до цієї клавіші: </p> <ul> <li> HKEY_CURRENT_USER \\ Software \\ Microsoft \\ Office \\ 16.0 \\ Common \\ Identity </li> </ul> <p> 2. На правій панелі перевірте, чи можна побачити значення з іменем: <strong> EnableADAL. </strong> Якщо ні, тоді ... </p> <blockquote> <p> a. Клацніть правою кнопкою миші на порожньому місці та виберіть <strong> Новий </strong> &gt; <strong> Значення DWORD (32-біт). </strong></p> </blockquote> <p><img src=\"images/image_thumb-25-384.png\" alt=\"Disable Modern Authentication\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Назвіть нове значення: <strong> EnableADAL </strong> та натисніть <strong> Введіть. </strong></p></blockquote> <p><img src=\"images/image_thumb-26-875.png\" alt=\"Turn Off Modern Authentication\" loading=\"lazy\"></p> <p> 3. Двічі клацніть на <strong> EnableADAL </strong> значення, встановіть для Значення даних значення <strong>0 </strong> і натисніть <strong> ГАРАЗД. </strong></p> <p><img src=\"images/image_thumb-27-612.png\" alt=\"EnableADAL \" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Закрити </strong> редактор реєстру та <strong> перезапустити </strong> ПК. <br> 5. Відкрийте будь-яку програму Office і повторіть спробу входу. </p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}