{"title":"ВИПРАВЛЕННЯ: Помилка HP Smart - стан принтера невідомий (вирішено)","content":"<p> Цей посібник містить інструкції щодо вирішення <a href=\"https://www.hpsmart.com/us/en\" target=\"_blank\" rel=\"nofollow noopener\"> HP Smart </a> помилка програми &quot;Статус принтера невідомий&quot; в ОС Windows 10. &quot;Невідомий стан принтера&quot; в програмі HP SMART може з&#39;явитися з невідомих причин і заважає користувачеві використовувати функцію сканування або друк на принтері. </p> <p> Проблема в деталях: На комп’ютері з ОС Windows 10 із встановленим принтером HP у програмі HP Smart з’являється помилка „Статус принтера невідомий”, незважаючи на те, що принтер друкує без проблем з Інтернету чи інших програм. Основною проблемою цієї помилки є те, що користувач не може скористатися опцією SCAN у програмі HP Smart для сканування документа. </p> <p> </p> <p> </p> <p><img src=\"images/image_thumb-23-787.png\" alt=\"FIX: HP Smart \" printer status unknown loading=\"lazy\"></p> <h4> ВИПРАВЛЕННЯ: &quot;Статус принтера невідомий&quot; у програмі HP Smart App. (Windows 10). </h4> <p> 1. З меню «Пуск» <img src=\"images/image_thumb2_thumb_thumb-697.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> натисніть Налаштування <img src=\"images/image_thumb-66-822.png\" alt=\"image\" loading=\"lazy\"> а потім відкрити <strong> Програми </strong> . </p> <p><img src=\"images/image_thumb-25-257.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Клацніть на <strong> Додаток HP Smart </strong> а потім клацніть <strong> Розширені опції </strong> . </p> <p><img src=\"images/image_thumb-26-912.png\" alt=\"FIX: Printer Status unknown on HP Smart app\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Клацніть на <strong> Скинути </strong> кнопку. </p> <p><img src=\"images/image_thumb-27-494.png\" alt=\"Fix Printer Status Unknow on HP Smart app\" loading=\"lazy\"></p> <p> 4. Після завершення скидання закрийте всі вікна та відкрийте <strong> HP Smart </strong> додаток. <br> 5. Зазвичай слід усунути помилку &quot;Статус принтера невідомий&quot;. Просто натисніть <strong> Налаштування </strong> , щоб увімкнути всі функції HP Smart, і все готово! * </p> <p><img src=\"images/image_thumb-28-849.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Примітка: Якщо помилка HP Smart &quot;Статус принтера невідомий&quot; не зникає, спробуйте наступне: </p> <blockquote><p> 1. <strong> Закрити </strong> комп&#39;ютер. <br> 2. <strong> Від&#39;єднати </strong> <strong> шнур живлення від принтера </strong> протягом 1 хвилини. <br> 3. Через 1 хвилину <strong> увімкнення </strong> ваш <strong> комп&#39;ютер </strong> . <br> 4. Після завантаження до Windows 10, <strong> підключіть шнур живлення принтера </strong> і перевірте, чи вирішено помилку &quot;Статус принтера невідомий&quot; у програмі HP Smart. Якщо помилка не зникає, перейдіть до видалення та перевстановлення принтера та програмного забезпечення принтера на вашому ПК. </p></blockquote> <p> Це все, шановні! Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}