{"title":"ВИПРАВЛЕННЯ: Не вдається підключитися до спільного доступу до файлів, оскільки це не безпечно, і для цього потрібен застарілий протокол SMB1. (Вирішено)","content":"<p> Якщо ви намагаєтеся підключитися до мережевої спільної папки з ПК з Windows 10, і з’являється повідомлення про помилку &quot;Ви не можете підключитися до спільного доступу до файлу, оскільки він не захищений. Для цього спільного доступу потрібен застарілий протокол SMB1, який небезпечний і може виявити Ваша система вимагає SMB2 або новішої версії. Для отримання додаткової інформації щодо вирішення цієї проблеми див. https://go.microsoft.com/fwlink/?linkid=852747 &quot;, а потім продовжте нижче, щоб вирішити проблему. </p> <p><img src=\"images/image_thumb-30-812.png\" alt=\"You can't connect to the file share because it's not secure. This share requires the obsolete SMB1 protocol, which is unsafe...\" loading=\"lazy\"></p> <p> У Windows 10 v1709 і пізніших версіях мережевий протокол Server Message Block версії 1 (SMBv1) не встановлений за замовчуванням, і його потрібно ввімкнути вручну, якщо ви хочете отримати доступ до спільної папки на робочій станції або сервері, який використовує протокол SMBv1 для Файлообмінник. </p> <p> Цей підручник містить інструкції щодо усунення таких помилок при спробі підключитися до спільної папки в Windows 10: </p> <ul> <li> <p><em> Ви не можете підключитися до спільного доступу до файлу, оскільки це не безпечно. Для цієї частки потрібен застарілий протокол SMB1, який небезпечний ... </em></p> </li> <li> <p><em> Вказане ім&#39;я мережі більше не доступне </em></p> </li> <li> <p><em> Невизначена помилка 0x80004005 </em></p> </li> <li> <p><em> Вказаний сервер не може виконати запитувану операцію. </em></p> </li> </ul> <h4> Як виправити: не вдається підключитися до спільного використання файлів, оскільки відсутній протокол SMBv1 (Windows 10) </h4> <p> 1. Перейдіть до <strong> Панель управління </strong> -&gt; <strong> Програми та функції </strong> . <br> 2. Клацніть <strong> Увімкніть або вимкніть функції Windows </strong> зліва. </p> <p> </p> <p><img src=\"images/image_thumb-68-359.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Розгорніть опцію «Підтримка спільного використання файлів SMB 1.0 / CIFS» та <strong> перевірити </strong> <strong> Клієнт SMB 1.0 / CIFS </strong> варіант. Клацніть <strong> гаразд </strong> коли закінчите. </p> <p><img src=\"images/image_thumb-29-360.png\" alt=\"Install SMBv1 Windows 10\" loading=\"lazy\"></p> <p> 4. Коли SMB 1.0 / CIFS встановлено, а потім клацніть на <strong> Перезапустіть зараз </strong> для перезавантаження ПК. </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}