{"title":"ВИПРАВЛЕННЯ: Сенсорна панель не працює або зависає в Windows 10 (вирішено)","content":"<p> За останні роки я вирішив багато проблем із сенсорною панеллю в Windows 10 на декількох ноутбуках (наприклад, сенсорна панель не працює, сенсорна панель зависає тощо), тому я вирішив написати навчальний посібник з усунення цих проблем. </p> <p> Якщо у вас є ноутбук, то час від часу у вас можуть виникати проблеми з пристроєм тачпада. Особливо, якщо у вас Windows 10, тачпад часто може перестати працювати або працювати неправильно після встановлення оновлення. Звичайно, проблеми з тачпадом можуть свідчити про апаратну проблему, але в багатьох випадках несправності тачпада виникають через проблеми з програмним забезпеченням. </p> <p> У Windows 10 сенсорна панель ноутбука може не працювати з різних причин, тому цей посібник охопить усі способи вирішення проблеми. </p> <h2> Як виправити проблеми сенсорної панелі в Windows 10. </h2> <p> Виконайте ці дії, перш ніж продовжувати наступні методи вирішення проблем із сенсорним екраном. </p> <ol> <li> Переконайтесь, що Windows 10 не заморожена, натиснувши ALT + CTRL + DEL і перевірте, чи відкривається диспетчер завдань. </li> <li> Якщо ваш ноутбук має комбінацію функціональних клавіш для вимкнення та увімкнення тачпада. (наприклад, Fn + F3), потім натисніть комбінацію клавіш Fn, щоб увімкнути тачпад. (На деяких ноутбуках тачпад можна вмикати / вимикати, двічі торкнувшись поверхні тачпада) </li> <li> Перезавантажте комп’ютер. </li> <li> Виконайте повне вимкнення Windows 10 і знову ввімкніть ноутбук. (Для повного вимкнення: натисніть і утримуйте кнопку <strong> SHIFT </strong> , а потім натисніть <strong> Почніть </strong> &gt; <strong> Потужність </strong> &gt; <strong> Закрити </strong> ). </li> </ol> <p><strong> </strong></p> <h3> Спосіб 1. Увімкніть сенсорну панель у Windows 10. </h3> <p> Windows 10 має можливість вимкнути або вимкнути тачпад, коли підключена зовнішня миша. Отже, продовжуйте і переконайтеся, що сенсорна панель увімкнена в налаштуваннях сенсорної панелі. </p> <p> 1. Перейдіть до <strong> Почніть </strong><img src=\"images/image_thumb2_thumb_thumb-670.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> меню -&gt; <strong> Налаштування </strong> <img src=\"images/image_thumb-66-512.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Пристрої. <br> </strong> 2. Виберіть <strong> Тачпад </strong> на лівій панелі, а на правій переконайтеся, що перемикач сенсорної панелі встановлений у положення <strong> УВІМК </strong> і також <strong> перевірити </strong> <strong> Залиште сенсорну панель увімкненою, коли підключена миша </strong> варіант. * </p> <p><img src=\"images/image_thumb-38-467.png\" alt=\"Disable Touchpad Windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Примітка: Якщо ви не можете знайти тут перемикач / перемикач сенсорної панелі ... </p> <p> 1. Відкрити <strong> Додаткові налаштування </strong> під <strong> Пов’язані налаштування </strong> розділ. </p> <ul> <li> Пов’язана стаття: <a href=\"https://www.repairwin.com/disable-touchpad-option-missing-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Вимкніть параметр сенсорної панелі, відсутній у Windows 10. </strong></a></li> </ul> <p><img src=\"images/image_thumb-39-742.png\" alt=\"touchpad additional settings\" loading=\"lazy\"></p> <p> 2. Увімкніть тачпад у параметрах Властивості миші. (Якщо тачпад вже ввімкнено, спробуйте вимкнути та ввімкнути його знову.) </p> <p><img src=\"images/image_thumb-31-122.png\" alt=\"enable touchpad windows 10\" loading=\"lazy\"></p> <h3> Спосіб 2. Скиньте налаштування сенсорної панелі в Windows 10. </h3> <p> Поширеним методом вирішення проблем сенсорної панелі в Windows 10 є скидання налаштувань сенсорної панелі до стандартних. </p> <p> 1. Перейдіть до <strong> Почніть </strong><img src=\"images/image_thumb2_thumb_thumb-596.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> меню -&gt; <strong> Налаштування </strong> <img src=\"images/image_thumb-66-851.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Пристрої. <br> </strong> 2. В <strong> Тачпад </strong> варіанти <strong> , </strong> прокрутіть вниз і натисніть <strong> Скинути </strong> під <strong> Скиньте сенсорну панель. * </strong></p> <p><img src=\"images/image_thumb-40-277.png\" alt=\"reset touchpad windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Примітка: Якщо ви не бачите <strong> Скинути </strong> кнопка ... </p> <p> 1. Відкрийте <strong> Додаткові налаштування </strong> . <br> 2. Клацніть <strong> Скинути налаштування пристроїв </strong> у параметрах Властивості миші. </p> <p><img src=\"images/image_thumb-33-928.png\" alt=\"reset touchpad settings windows 10\" loading=\"lazy\"></p> <h3> Спосіб 3. Видаліть та перевстановіть драйвер пристрою тачпада. </h3> <p> Іншим рішенням для вирішення проблем із тачпадом у Windows 10 є повне видалення та перевстановлення драйверів тачпада. </p> <p> 1. Відкрити <strong> Диспетчер пристроїв </strong> . Для цього: </p> <blockquote><p> 1. Натисніть Windows <img src=\"images/image_thumb8_thumb_thumb-140.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> Р </strong> клавіші, щоб відкрити поле команди запуску. <br> 2. У полі &quot;Відкрити&quot; введіть: <strong> devmgmt.msc </strong> &amp; натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb-5-568.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Розкрийте миші та інші вказівні пристрої. <br> 3. <strong> Клацніть правою кнопкою миші </strong> на <strong> Сенсорна панель </strong> пристрій і натисніть <strong> Видаліть. </strong></p> <blockquote> <p><img src=\"images/image_thumb-34-656.png\" alt=\"uninstall touchpad windows 10\" loading=\"lazy\"></p> </blockquote> <p> 4. Після перезапуску зачекайте 4-5 хвилин, поки Windows переінсталює драйвер тачпада та перевірте, чи працює тачпад. Якщо сенсорна панель не працює знову, спробуйте встановити її драйвер із веб-сайту підтримки виробника ноутбука. </p> <h3> Спосіб 4. Вимкнення та увімкнення сенсорної панелі в BIOS. * </h3> <p> * Примітка: Цей метод застосовується не до всіх моделей ноутбуків, але я знаю, що він працює на багатьох ноутбуках ASUS. </p> <p> 1. Повністю вимкніть ноутбук, натиснувши та утримуючи клавішу SHIFT, клацнувши <strong> Почніть </strong> &gt; <strong> Потужність </strong> &gt; <strong> Закрити </strong><br> 2. Увімкніть ноутбук і натисніть відповідну функціональну клавішу, щоб увійти в налаштування BIOS. (наприклад, F2, F10 тощо), <br> 3. У налаштуваннях BIOS перевірте, чи є налаштування для сенсорної панелі або внутрішнього вказівного пристрою або пристрою трекпада (зазвичай це налаштування можна знайти в <strong> Розширений </strong> &#39;розділ). Якщо так, <strong> Вимкнути </strong> <strong> пристрій тачпада </strong> і <strong> Зберегти та вийти </strong> з налаштувань BIOS. <br> 4. Нехай завантажується Windows 10. <br> 5. Знову вимкніть і ввімкніть ноутбук. <br> 6. Повторно введіть у налаштуваннях BIOS і повторно <strong> увімкнути сенсорну панель </strong> &amp; <strong> Зберегти та вийти </strong> . <br> 7. Після завантаження до Windows 10 тачпад повинен працювати. </p> <p><strong> Висновок: </strong> Якщо після вищевказаних кроків сенсорна панель все ще не працює, це вказує на апаратну проблему. У цьому випадку скористайтеся зовнішньою мишею або відвідайте майстерню з ремонту ноутбуків, щоб відремонтувати пристрій тачпада. </p> <p> Це все, шановні! Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}