{"title":"ВИПРАВЛЕННЯ: Ноутбук Dell Inspiron повільна швидкість процесора (вирішено)","content":"<p> Цей підручник містить інструкції щодо виправлення дуже повільної проблеми зі швидкістю процесора на ноутбуці Dell Inspiron 5558. Нещодавно мій друг приніс свій ноутбук Dell до моєї лабораторії, оскільки раптом він став занадто повільним. Справді, раніше ноутбук працював швидко, але зараз потрібно багато часу для завантаження операційної системи (Windows 10) та програм. </p> <p> Перевіривши ноутбук, і, як ви можете бачити на скріншоті нижче, я виявив, що центральний процесор працює завжди на 0,48 ГГц замість 2,20 ГГц. Отже, я розпочав усунення несправностей і, нарешті, знайшов наступні два методи вирішення проблеми повільної швидкості процесора ... </p> <p> (Швидкість процесора була зменшена приблизно на 85-87% на ноутбуці Dell) </p> <p><img src=\"images/image_thumb-16-354.png\" alt=\"FIX Dell Laptop Slow CPU Speed\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Як виправити проблему повільної швидкості процесора на ноутбуці Dell. </h4> <h6> Спосіб 1. Замініть адаптер змінного струму. </h6> <p> Проблема з повільною швидкістю процесора є відомою проблемою на ноутбуках Dell, коли адаптер змінного струму не розпізнається з комп&#39;ютера належним чином. У цьому випадку, і навіть якщо адаптер живлення здається добре працює, під час увімкнення ноутбука відображається таке попереджувальне повідомлення: &quot;Не можна визначити тип адаптера змінного струму. Це заважатиме оптимальній роботі системи&quot;. </p> <p> Отже, першим методом вирішення проблеми з низькою продуктивністю вашого ноутбука Dell є заміна адаптера живлення на новий сумісний адаптер змінного струму Dell. </p> <p> </p> <h6> Спосіб 2. СТОП Дротування процесора за допомогою ThrottleStop. </h6> <p> Якщо адаптер змінного струму працює належним чином, а ноутбук не перегрівається *, іншим методом вирішення проблеми повільної роботи системи на ноутбуці Dell є вимкнення невідомого дроселювання адаптера живлення за <strong><a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"> ThrottleStop </a></strong> корисність. Для цього: </p> <p> 1. Завантажте файл <a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> ThrottleStop </strong></a> та витягніть завантажений архів. <br> 2. З витягнутої папки двічі клацніть, щоб запустити програму &quot;ThorttleStop.exe&quot;. * <br> 3. <strong> Зніміть прапорець </strong> <strong> BD PROCHOT </strong> ***, а потім клацніть <strong> Зберегти </strong> . </p> <p> * Примітки: <br> 1. Щоб контролювати температуру процесора, ви можете використовувати <a href=\"https://www.alcpu.com/CoreTemp/\" target=\"_blank\" rel=\"nofollow noopener\"> CoreTemp </a> програма. <br> 2. Якщо ви отримали помилку &quot;MFC120U.dll не знайдено&quot; або &quot;MSVCR120.dll відсутній&quot;, після запуску ThrottleStop продовжте та встановіть <a title=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" href=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Пакети для розповсюдження Visual C ++ для Visual Studio 2013 </a> . ( <strong> Важливо: </strong> Якщо у вас є 64-розрядна версія Windows, вам потрібно встановити як 64-бітну, так і 32-бітну версію пакета Visual C ++). <br> 3. BD PROCHOT означає двонаправлений прохот. PROCHOT розшифровується як &quot;гарячий&quot; процесор, тобто сигнал, який активується в центральному процесорі, коли він досягає приблизно від 100 ° C до 105 ° C залежно від номера моделі. Цей сигнал ініціює теплове регулювання, щоб процесор міг сповільнитись і не перегріватися. Вимкнення PROCHOT дозволить вашому процесору продовжувати працювати на повній швидкості. (Джерело: <a href=\"http://forum.notebookreview.com/threads/the-throttlestop-guide.531329/\" target=\"_blank\" rel=\"nofollow noopener\"> Посібник ThrottleStop </a> ). </p> <p><img src=\"images/image_thumb-20-666.png\" alt=\"FIX Slow CPU Speed with ThrottleStop\" loading=\"lazy\"></p> <p> 4. Закрийте ThrottleStop і все готово. Тепер центральний процесор буде працювати на повній швидкості, доки ви не перезавантажите або не вимкнете ноутбук. * </p> <p> * Примітка: Ви повинні запустити <strong> ThrottleStop </strong> програму при кожному запуску комп&#39;ютера, якщо ви хочете працювати на повній швидкості процесора. Щоб полегшити своє життя, дотримуйтесь вказівок у цьому <a href=\"https://www.repairwin.com/how-to-start-throttlestop-at-windows-startup/\" target=\"_blank\" rel=\"nofollow noopener\"> путівник </a> для автоматичного запуску ThrottleStop під час запуску Windows. </p> <p><img src=\"images/image_thumb-21-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}