{"title":"ВИПРАВЛЕННЯ: Проблема із задніми шпалерами в Windows 7 (вирішено)","content":"<p> Цей підручник містить інструкції щодо виправлення проблеми з чорними шпалерами, коли для фонового зображення встановлено значення &quot;Розтягнути&quot; в ОС Windows 7. Проблема з чорними шпалерами може з’явитися на комп’ютерах під керуванням Windows 7 після інсталяції 14 січня 2020 р. - оновлення KB4534310. </p> <p><img src=\"images/image_thumb-16-423.png\" alt=\"FIX: Back Wallpaper issue in Windows 7\" loading=\"lazy\"></p> <p> Проблема з чорним фоном Windows 7 - це відома помилка після встановлення <a href=\"http://www.catalog.update.microsoft.com/Search.aspx?q=KB4534310\" target=\"_blank\" rel=\"nofollow noopener\"> оновити KB4534310 </a> і як Microsoft <a href=\"https://support.microsoft.com/en-us/help/4534310/windows-7-update-kb4534310\" target=\"_blank\" rel=\"nofollow noopener\"> каже </a> : &quot;Ми працюємо над вирішенням і надамо оновлення в майбутньому випуску, який буде випущений для всіх клієнтів під управлінням Windows 7 та Windows Server 2008 R2 SP1&quot;. </p> <p> Якщо ви хочете вирішити проблему &quot;чорних шпалер&quot;, доки Microsoft не випустить оновлення, щоб виправити це, дотримуйтесь інструкцій нижче. </p> <h4> Як виправити проблему з чорними шпалерами в Windows 7. </h4> <h6> Спосіб 1. Видаліть оновлення KB4534310. </h6> <p> Перший спосіб вирішити проблеми з чорними шпалерами в Windows 7 - це видалити оновлення KB4534310. * </p> <p> * Примітка. Оскільки оновлення KB4534310 містить покращення безпеки та виправлення для Windows 7, видаляти його недоцільно. Отже, ми пропонуємо усунути проблему, дотримуючись інструкцій на <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Метод-2 </a> нижче. </p> <p> Щоб видалити оновлення KB4534310: </p> <p> 1. Клацніть правою кнопкою миші на <strong> Почніть </strong> меню <img src=\"images/image_thumb-38-451.png\" alt=\"image\" loading=\"lazy\"> і вибрати <strong> Панель управління </strong> . <br> 2. Встановіть <strong> Переглянути за: до невеликих піктограм </strong> і натисніть <strong> Програма та функції. </strong></p> <p><img src=\"images/image_thumb-51-750.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 3. Клацніть <strong> Перегляньте встановлені оновлення </strong> на лівій панелі. </p> <p> </p> <p><img src=\"images/image_thumb-52-942.png\" alt=\"uninstall updates windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. У вікні пошуку введіть &quot; <strong> KB4534310 </strong> &quot;і натисніть Enter. <br> 5. Виділіть «Оновлення системи безпеки для Microsoft Windows (KB4534310)» та натисніть <strong> Видаліть </strong> . </p> <p><img src=\"images/image_thumb-12-776.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Спосіб 2. Змініть положення зображення на інше, ніж &quot;Розтягнути&quot;. </h6> <p> Проблема з чорними шпалерами у Windows 7 з’являється лише тоді, коли вибране фонове зображення розтягується. Отже, наступним методом вирішення проблеми є встановлення іншого положення зображення для фонового зображення. Для цього: </p> <p> 1. Клацніть правою кнопкою миші на робочому столі та натисніть <strong> Персоналізуйте </strong> . </p> <p><img src=\"images/image_thumb-17-501.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Клацніть <strong> Фон робочого столу </strong></p> <p><img src=\"images/image_thumb-14-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Тепер застосуйте такі дії: </p> <p> a. У меню Розташування зображення виберіть <strong> Бібліотека зображень. </strong><br> b. Виберіть зображення, яке ви хочете для фону, або будь-яке інше спеціальне зображення / фото, яке відповідає вашій роздільній здатності екрана. * </p> <blockquote> <p> * Порада. Щоб дізнатись поточну роздільну здатність екрана, клацніть правою кнопкою миші на робочому столі та натисніть <strong> Розширення екрану </strong> . </p> </blockquote> <p> c. В <strong> Положення зображення </strong> , виберіть будь-який інший варіант, крім &quot; <strong> Розтягування </strong> &quot;, наприклад,&quot; Заливка &quot;,&quot; Підгонка &quot;,&quot; Плитка &quot;або&quot; Центр &quot;. <br> d. Після закінчення натисніть Зберегти <strong> зміни </strong> . </p> <p><img src=\"images/image_thumb-15-519.png\" alt=\"image\" loading=\"lazy\"></p> <p> Це все! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}