{"title":"ВИПРАВЛЕННЯ: Параметр Інсталяція інструментів VMware встановлений сірим кольором. (Вирішено)","content":"<p> Якщо ви не можете встановити VMware Tools на гостьовій операційній системі, оскільки параметр &quot;Встановити VMware Tools&quot; неактивний, продовжуйте читати нижче. Інструменти VMware - це безкоштовний набір послуг та модулів, які забезпечують декілька функцій у гостьовій віртуальній машині, такі як швидша графічна продуктивність, покращена продуктивність миші та найважливіше: можливість копіювання та вставлення між хостом та гостьовою машиною. Отже, хоча гостьова операційна система може працювати без інструментів VMware, інструменти VMware повинні бути встановлені, якщо ви хочете активувати додаткові функції VMware. </p> <p> Звичайним способом встановлення VMware Tools є запуск гостьової машини, а потім у меню &quot;Гравець&quot; виберіть <strong> Управління </strong> &gt; <strong> Встановіть VMware Tools </strong> . Але якщо ви підключили віртуальний привід CD / DVD віртуальної машини до файлу образу ISO при встановленні операційної системи, параметр «Встановити інструменти VMware» буде неактивним. </p> <p><img src=\"images/image_thumb-45-164.png\" alt=\"FIX VMware Tools option is Grayed Out\" loading=\"lazy\"></p> <p> </p> <p> Цей підручник містить інструкції щодо виправлення наведеної нижче проблеми у програвачі VMware Workstation Player. Параметр &quot;Встановити інструменти VMware&quot; у гостьовій машині неактивний. </p> <h4> Як встановити VMware Tools, якщо параметр &quot;Встановити VMware Tools&quot; встановлений сірим кольором. </h4> <p> </p> <p> 1. Вимкніть віртуальну машину. <br> 2. Клацніть правою кнопкою миші на віртуальній машині та виберіть <strong> Налаштування </strong> . </p> <p><img src=\"images/image_thumb-39-377.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Виберіть <strong> CD / DVD </strong> диск, а потім натисніть <strong> Видалити </strong> . </p> <p><img src=\"images/image_thumb-43-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Потім виберіть <strong> Дискета </strong> диск, натисніть <strong> Видалити </strong> а потім клацніть <strong> гаразд </strong> , щоб закрити параметри налаштувань. </p> <p><img src=\"images/image_thumb-44-469.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Почніть </strong> віртуальна машина. <br> 6. У меню «Гравець» виберіть <strong> Управління </strong> і натисніть <strong> Встановіть VMware Tools. </strong></p> <p><img src=\"images/image_thumb-42-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> Це все! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}