{"title":"ВИПРАВЛЕННЯ: Недостатньо місця для обробки цієї команди - Не вдається отримати доступ до спільних папок або використовувати віддалений робочий стіл (вирішено)","content":"<p> Помилка &quot;Недостатньо пам’яті для обробки цієї команди&quot; може з’явитися під час спроби отримати доступ до спільних папок на іншій робочій станції Windows або сервері 2003, 2008, 2012 або 2016, або коли ви використовуєте підключення до віддаленого робочого столу (RDP ), для підключення до іншого комп’ютера Windows (робочої станції або сервера). </p> <p><img src=\"images/image_thumb-127.png\" alt=\"Not enough storage is available to process this command\" loading=\"lazy\"></p> <p> </p> <p> Цей посібник містить інструкції щодо вирішення таких проблем, які можуть з’являтися у всіх версіях Windows (Windows 10, 8 / 8.1, 7, Vista, XP та Windows Server 2003, 2008, 2012 або 2016): </p> <p> 1. При спробі отримати доступ до спільних папок на сервері, ви отримуєте повідомлення про помилку: &quot; <em> Спільна папка </em> не доступний. Можливо, у вас немає дозволу на використання цього мережевого ресурсу. Зв’яжіться з адміністратором цього сервера, щоб з’ясувати, чи маєте ви дозвіл на доступ. Недостатньо пам’яті сервера для обробки цієї команди. &quot; </p> <p> 2. При спробі віддаленого підключення (за допомогою RDP) до іншої машини на базі Windows, з&#39;являється повідомлення про помилку: &quot;Система не може увійти в систему з наступної причини. Недостатньо місця для обробки цієї команди&quot;. </p> <h4> ЯК ВИПРАВИТИ: повідомлення про помилку &quot;Недостатньо місця для обробки цієї команди&quot; на віддаленому робочому столі (RDP) або при спробі отримати доступ до спільних папок. </h4> <p> На машині &quot;сервера&quot; Windows, до якої ви хочете отримати доступ до її файлів або віддалено підключитися: </p> <p><strong> 1. </strong> Натисніть “ <strong> Windows </strong> ”+“ <strong> Р. </strong> Клавіші, щоб відкрити <em> БІГ </em> вікно. <br> <strong> 2. </strong> Тип <strong> regedit </strong> і натисніть <strong> Введіть </strong> щоб відкрити редактор реєстру. </p> <p><img src=\"images/image_thumb7-649.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Потім перейдіть до цієї клавіші: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ LanmanServer \\ Параметри </strong></li> </ul> <p><img src=\"images/image_thumb-1-198.png\" alt=\"fix Not enough storage - cannot access shared items\" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> На правій панелі двічі клацніть, щоб відкрити <strong> IRPStackSize </strong> значення <strong> . * </strong></p> <p><strong> * Примітка: </strong> Якщо ви не бачите <strong> IRPStackSize </strong> значення, то: </p> <p> </p> <blockquote><p> 1. Клацніть правою кнопкою миші на порожньому місці (на правій панелі), а потім виберіть <strong> Новий </strong> -&gt; <strong> Значення DWORD (32-біт) </strong></p> <p><img src=\"images/image_thumb-2-236.png\" alt=\"fix Not enough storage using RDP (Remote Desktop)\" loading=\"lazy\"></p> </blockquote> <blockquote><p> 2. Назвіть нове значення <strong> IRPStackSize </strong> і вдарив <strong> Введіть. </strong></p></blockquote> <p><strong> 5. </strong> Виберіть <strong> Десяткова </strong> , змініть значення значення на <strong> 50 </strong> і натисніть <strong> гаразд </strong> . * </p> <p> * Примітка: Діапазон (у десяткових цифрах) для параметра становить від 1 до 50. </p> <p><img src=\"images/image_thumb-3-255.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 6. </strong> <strong> Закрити </strong> редактор реєстру та <strong> перезапустити </strong> сервера. * </p> <p> * Важливе зауваження: Якщо після перезапуску ви отримуєте одне і те ж повідомлення про помилку, коли ви використовуєте підключення до віддаленого робочого столу або коли намагаєтесь отримати доступ до спільних файлів на іншому комп&#39;ютері, застосуйте зазначену вище модифікацію реєстру і до свого комп&#39;ютера. </p> <p> Це все! Вам це вдалося? </p> <p> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}