{"title":"ВИПРАВЛЕННЯ: Помилка Outlook Express 0x800c0133 через обмеження розміру 2 ГБ у файлі DBX (вирішено)","content":"<p> Цей посібник містить інструкції щодо виправлення помилки Outlook Express 0x800c0133 через обмеження в 2 ГБ. Помилка 0x800c0133 в OE виникає через те, що розмір однієї папки Outlook перевищує 2 Гб. </p> <p> Опис проблеми обмеження розміру .DBX на 2 Гб в Outlook Express. <br> Коли одна з основних папок Outlook Express (наприклад, &quot;Вхідні&quot; або &quot;Надіслане&quot;) перевищує 2 ГБ, OE повертає помилку 0x800c0133 під час операції надсилання / отримання, а іноді відповідна папка OE стає порожньою (пошкоджена). * Наприклад, якщо папка &quot;Вхідні&quot; (Inbox.dbx) перевищує 2 ГБ, то OE не може отримувати нові електронні листи і відображає помилку 0x800c0133. </p> <p> * Примітка: Якщо одна з папок OE порожня, то пов&#39;язаний файл DBX пошкоджений. У цьому випадку спробуйте відновити свої електронні листи з пошкодженої папки OE, дотримуючись інструкцій у цій статті: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Як відновити файл DBX Outlook Express БЕЗКОШТОВНО </a> . </p> <h4> Як виправити проблему з обмеженням Outlook Express 2 Гб (помилка надсилання / отримання 0x800c0133). </h4> <h6> Крок 1. Увімкніть перегляд прихованих файлів. </h6> <p> 1. Відкрийте Провідник Windows. <br> 2. З <strong> Інструменти </strong> меню вибрати <strong> Параметри папки </strong> . <br> 3. На вкладці Вид натисніть <strong> Показати приховані файли та папки </strong> і натисніть <strong> ГАРАЗД. </strong></p> <p><img src=\"images/image_thumb1_thumb-210.png\" alt=\"image_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Крок 2. Знайдіть на диску файл DBX Outlook Express 2 ГБ. </h6> <p> 1. Відкрийте папку магазину Outlook Express. Зазвичай ця папка знаходиться на наступному шляху на вашому диску: </p> <ul> <li> C: \\ Documents and Settings \\\\ Local Settings \\ Application Data \\ Identities \\ {} \\ Microsoft \\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> напр. “C: \\ Documents and Settings \\ Admin \\ Local Settings \\ Application Data \\ Identities \\ {D8F3C56D-965E-41AE-8A23-A58460ABAE00} \\ Microsoft \\ <strong> Outlook Express </strong> &quot; </p></blockquote> <p> 3. З Провідника <strong> Переглянути </strong> меню вибрати <strong> Деталі </strong> . <br> 4. Знайдіть, який файл DBX перевищує 2 Гб пам’яті. * </p> <p> * У цьому прикладі розмір файлу &quot;Inbox.dbx&quot; перевищує 2 ГБ. </p> <p><img src=\"images/image_thumb2_thumb-339.png\" alt=\"FIX Outlook Express Error 0x800c0133\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Крок 3. Перемістіть електронні листи з папки «Негабаритна пошта» у папку «Нова пошта». </h6> <p> 1. Відкрийте Outlook Express. <br> 2. Виберіть велику папку пошти (розміром понад 2 Гб, наприклад, папку &quot;Вхідні&quot; у цьому прикладі). <br> 3. Якщо ви бачите свої електронні листи в цій папці (папка не порожня), виконайте наступні дії: * </p> <p> * Примітка: Якщо папка здається порожньою (ви не бачите електронних листів у ній), то папка OE (і відповідний файл DBX) пошкоджена. У такому випадку вам доведеться відновити електронні листи з пошкодженої папки DBX, дотримуючись інструкцій у цій статті. </p> <p> 4. На лівій панелі програми OE клацніть правою кнопкою миші на великій папці та виберіть <strong> Нова папка </strong> (для того, щоб створити нову поштову папку) </p> <p><img src=\"images/image_thumb-6-403.png\" alt=\"outlook express 2gb limit\" loading=\"lazy\"></p> <p> </p> <p> 5. Введіть впізнаване ім’я для нової папки, а потім рік (наприклад, &quot;Вхідні-2016&quot;) </p> <p><img src=\"images/image_thumb-7-434.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Потім з великої папки (наприклад, із &quot;Вхідних&quot;) виберіть групу електронних листів (наприклад, усі електронні листи з 2016 року) і перетягніть (перемістіть) у нову папку пошти, яку ви створили раніше (наприклад, до Вхідні-2016 &quot;). </p> <p><img src=\"images/image_thumb-8-450.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Повторіть ті самі кроки (наприклад, створіть різні папки за роком та перемістіть повідомлення з великої папки в нові папки). * </p> <p> * Примітка: Якщо під час операції переміщення ви стикаєтесь із проблемами (наприклад, якщо не вдається перемістити деякі повідомлення до нової папки), виконайте наведені нижче дії. </p> <blockquote><p> 1. Закрийте Outlook Express. <br> 2. Скопіюйте (створіть резервну копію) папку &quot;Outlook Express&quot; з місця зберігання OE до іншого місця на вашому диску. <br> 3. Потім дотримуйтесь інструкцій на кроці 4, щоб видалити негабаритний файл .dbx. <br> 4. Відкрийте Outlook Express. <br> 5. Імпортуйте електронні листи з папки резервного копіювання OE (From <strong> Файл </strong> меню перейдіть до -&gt; <strong> Імпорт </strong> <strong> Повідомлення </strong> -&gt; <strong> Microsoft Outlook Express 6 </strong> -&gt; <strong> Імпортуйте пошту з каталогу магазину OE ... </strong> ). ** </p> <p> ** Якщо під час імпорту ви все ще стикаєтесь із проблемами, дотримуйтесь інструкцій у цій статті, щоб відновити пошкоджений файл DBX. </p></blockquote> <p> </p> <p> 8. Коли ви закінчите з передачею електронної пошти, і папка 2 Гб звільниться від електронних листів (наприклад, &quot;Вхідні&quot; в цьому прикладі), перейдіть до наступного кроку. </p> <p><img src=\"images/image_thumb-10-811.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Крок 4. Видаліть із диска великий файл DBX Outlook Express. </h6> <p> 1. Відкрийте папку сховища Outlook Express на диску. <br> 2. Видаліть великий DBX-файл (наприклад, &quot;Inbox.dbx&quot; у цьому прикладі). </p> <p><img src=\"images/image_thumb-9-996.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Запустіть Outlook Express. <br> 4. OE створить (автоматично) нову чисту та здорову поштову папку для зберігання електронних листів. * </p> <p> * Примітка: Якщо ви все одно отримуєте ту ж помилку, спробуйте відновити пошкоджену папку OE, дотримуючись інструкцій у цій статті: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Як відновити файл DBX Outlook Express БЕЗКОШТОВНО </a> . </p> <p> Це все, шановні! Вам це вдалося? </p> <p> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}