{"title":"ВИПРАВЛЕННЯ: Чорний екран камери Skype та інші проблеми з веб-камерою у Windows 10.","content":"<p> Проблема чорного / порожнього екрану камери Skype є однією з найпоширеніших проблем у Windows 10 і може бути спричинена низкою причин, тому ось покрокове керівництво щодо її усунення. </p> <p> У Windows 10 нове оновлення може спричинити багато проблем із вбудованою веб-камерою, і камера може не працювати або камера може не розпізнаватися в деяких програмах, а в інших вона працює належним чином. Наприклад, я бачив випадок, коли камера працювала без проблем у програмах Webex і Zoom, вона відображала чорний екран у Skype. </p> <p> Цей посібник містить покрокові інструкції щодо усунення кількох проблем із вбудованою камерою на ноутбуках з Windows 10: * </p> <ul> <li><em> Веб-камера / камера не працює у Windows 10 </em></li> <li><em><em> Веб-камера / камера </em> Припинив роботу після оновлення в Windows 10. </em></li> <li><em> Веб-камера не працює в деяких програмах (Skype, Windows Hello WebEx тощо). </em></li> <li><em> Веб-камера відображає чорний (або порожній) екран, коли використовується в Skype. </em></li> <li><em> Веб-камера працює у Skype, але у вікні попереднього перегляду камери відображається чорний екран </em> . </li> <li> Програми не можуть розпізнати або знайти Камеру / Веб-камеру </li> </ul> <p><strong> * Примітка для власників Lenovo ThinkPad: </strong> Якщо ви є власником однієї з моделей ThinkPad, перелічених у таблиці нижче, перейдіть до її завантаження та встановлення <a href=\"/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/DC8297800EA7/Integrated%20Camera%20Driver%20Registry%20Patch%20for%20Windows%2010%20(Version%201709%20or%20later)%20-%20ThinkPad\" target=\"_blank\" rel=\"nofollow noopener\"> виправлення реєстру від Lenovo. </a> Виправлення усуває проблему, через яку вбудований драйвер камери може не працювати належним чином після оновлення до Windows 10 версії 1709 або пізнішої. </p> <p><img src=\"images/image_thumb-30-725.png\" alt=\"THinkpad Registry Fix for Integrated Camera\" loading=\"lazy\"></p> <h2> Як виправити: проблеми з веб-камерою у Windows 10. </h2> <p> </p> <h3> Крок 1. Надайте камері доступ до програм. </h3> <p> У Windows 10 камера та мікрофон можуть бути недоступними для програм через налаштування конфіденційності, які могли застосовуватися. Отже, продовжуйте і дозвольте додатку з проблемою камери отримати доступ до вашої камери. Наприклад, якщо ви зіткнулися з проблемою камери в Skype, виконайте наступні дії: </p> <p> 1. Перейдіть, щоб перейти до <strong> Почніть </strong> меню <img src=\"images/image_thumb-12-696.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Налаштування </strong> -&gt; <strong> Конфіденційність </strong> . <br> 2. Виберіть <strong> Камера </strong> на лівій панелі та на правій: </p> <blockquote><p> a. Переконайтесь, що <strong> Доступ до камери для цього пристрою </strong> є <strong> на. </strong> Якщо ні, натисніть <strong> Зміна </strong> і встановити на <strong> УВІМК. </strong><br> b. Потім встановіть на <strong> Увімкнено </strong> <strong> Дозволити програмам доступ до перемикача камери </strong> . </p> <p><img src=\"images/image_thumb-20-105.png\" alt=\"Allow Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Тепер прокрутіть вниз і ... </p> <p> c. Якщо у вас виникає проблема з увімкненим чорним екраном камери <strong> Skype </strong> магазин, прокрутіть вниз і на <strong> Виберіть, які програми Microsoft Store можуть отримати доступ до вашої камери </strong> розділ, набір <strong> Skype </strong> до <strong> Увімкнено. </strong></p> <p><img src=\"images/image_thumb-21-826.png\" alt=\"Allow Store Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> d. Якщо ви бачите чорне вікно камери під час використання <strong> Skype для Windows </strong> (настільна програма), а потім переконайтеся, що <strong> Дозвольте настільним програмам отримувати доступ до вашої камери </strong> перемикач є <strong> Увімкнено </strong> . </p> <p><img src=\"images/image_thumb-22-558.png\" alt=\"Allow Applications to Access Camera Windows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h3> Крок 2. Перевірте, чи правильно працює камера. </h3> <p> Одним із перших кроків для усунення несправностей веб-камери є підтвердження її роботи у програмі Windows 10 Camera. </p> <p> 1. У полі пошуку введіть <strong> камери </strong> щоб відкрити програму Камера. <br> 2. Клацніть лупу та знайдіть &quot; <strong> камери </strong> &quot;. <br> 3. Відкрийте <strong> Камера </strong> застосування </p> <p><img src=\"images/image_thumb-23-730.png\" alt=\"Open Camera app Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Тепер, згідно з результатом, виконайте наступні дії: </p> <blockquote><p> А. Якщо ваша камера працює, ви повинні побачити своє зображення на екрані. У цьому випадку продовжте та перевірте свою камеру в Skype або в будь-якому іншому додатку, яким ви ним користуєтесь. Якщо веб-камера не працює або відображається чорний екран, виконайте наведені нижче дії в порядку: </p> <ol> <li> Спробуй <strong> видалити </strong> і <strong> перевстановити </strong> додаток із проблемою камери (наприклад, Skype). </li> <li> Перейдіть до Увімкнення або Вимкнення режиму Frame Server у реєстрі, дотримуючись інструкцій на <a href=\"#step-3\" target=\"_blank\" rel=\"nofollow noopener\"> крок-3 </a> . </li> </ol> <p> B. Якщо ваша камера не працює в програмі Camera, може статися одне з наступного: </p> <ol> <li> Драйвер пристрою камери неправильний або пошкоджений. У цьому випадку перейдіть до пошуку несправностей драйверів камери, дотримуючись вказівок на <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> крок-4 </a> . </li> <li> Камера пошкоджена і взагалі не працює. У цьому випадку зверніться до майстерні з ремонту комп’ютерів, щоб виправити веб-камеру, або скористайтеся зовнішньою камерою USB. </li> </ol> </blockquote> <h3></h3> <h3> Крок 3. Виправте проблему з чорним екраном веб-камери в реєстрі Windows 10. </h3> <p> Якщо камера розпізнана і працює без проблем у деяких програмах, але в інших не працює, або у Skype відображається чорний екран, спробуйте вимкнути або ввімкнути &quot;Режим кадрового сервера&quot; в реєстрі. </p> <p> 1. Відкрийте редактор реєстру: для цього: </p> <blockquote><p> 1. Натисніть Windows <img src=\"images/image_thumb41-284.png\" alt=\"image\" loading=\"lazy\"> + <strong> Р </strong> клавіші, щоб відкрити поле команди запуску. <br> 2. Тип <strong> regedit </strong> і натисніть <strong> Введіть </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-845.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> 3. У Редакторі реєстру перейдіть до наступної клавіші на лівій панелі: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows Media Foundation \\ Platform </li> </ul> <p> 4. <strong> Клацніть правою кнопкою миші </strong> на порожньому місці на правій панелі та виберіть <strong> Нове -&gt; Значення DWORD (32-біт). </strong></p> <p><img src=\"images/image_thumb-24-839.png\" alt=\"Fix Webcam black Screen Windows 10\" loading=\"lazy\"></p> <p> 5. Дайте ім’я <strong> EnableFrameServerMode </strong> до нового значення. <br> 6. Двічі клацніть на новоствореному значенні та переконайтеся, що дані про значення є <strong>0</strong> . (Нуль). Клацніть <strong> ГАРАЗД. </strong></p> <p><img src=\"images/image_thumb-25-764.png\" alt=\"Fix Webcam issues Windows 10\" loading=\"lazy\"></p> <p> 7. Тепер виконайте ті самі дії, описані вище (4,5 і 6), і внесіть ті самі зміни за допомогою цієї клавіші: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ WOW6432Node \\ Microsoft \\ Windows Media Foundation \\ Platform </li> </ul> <p> 8. Коли закінчите, <strong> закрити </strong> Редактор реєстру та <strong> перезапустити </strong> ПК. <br> 9. Після перезапуску запустіть Skype і перевірте, чи проблема з WebCam вирішена. Якщо ні, виконайте ті самі дії, але цього разу <strong> увімкнути </strong> <strong> EnableFrameServerMode </strong> змінивши його значення з <strong>0 </strong> до <strong> 1 </strong> і <strong> перезапустити </strong> ПК знову. </p> <p> </p> <h3> Крок 4. Вирішення проблем із драйвером веб-камери. </h3> <p> Наступним кроком, щоб вирішити проблеми з камерою в Windows 10, є відкат або видалення / перевстановлення драйверів Камери. 1. Відкрити <strong> Диспетчер пристроїв </strong> . Для цього: </p> <blockquote><p> 1. Натисніть Windows <img src=\"images/image_thumb8_thumb_thumb-696.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> Р </strong> клавіші, щоб відкрити поле команди запуску. <br> 2. У полі &quot;Відкрити&quot; введіть: <strong> devmgmt.msc </strong> &amp; натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb-5-837.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Розгорніть <strong> Уявіть собі пристрої </strong> (або <strong> Камери </strong> ) <br> 3. <strong> Клацніть правою кнопкою миші </strong> на тобі <strong> Камера </strong> і вибрати <strong> Властивості. </strong></p> <p><img src=\"images/image_thumb-26-673.png\" alt=\"Camera Properties\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 4. Виберіть <strong> Водій </strong> та виконайте наступні дії відповідно до вашого випадку: </p> <blockquote><p> A. Якщо ваша веб-камера працювала раніше, <strong> Відкат драйвера </strong> і <strong> перезапустіть </strong> t свого ПК. Потім перевірте, чи працює камера. </p> <p><img src=\"images/image_thumb-27-454.png\" alt=\"Roll Back Driver - Camera\" loading=\"lazy\"></p> <p> </p> <p> B. Якщо ваша камера ніколи раніше не працювала, або ви вперше пробуєте камеру (наприклад, після нової інсталяції Windows), спробуйте наступне в такому порядку: </p> <ol> <li> Клацніть на <strong> Оновити драйвер </strong> варіант, щоб перевірити наявність оновленого драйвера вашої камери. Якщо Windows знаходить новий драйвер, встановіть його, а потім перевірте веб-камеру. Інакше ... </li> <li> Клацніть <strong> Видаліть пристрій </strong> видалити веб-камеру, а потім <strong> перезапустити </strong> ПК. Після перезапуску перевірте, чи працює камера. Якщо ні… </li> <li> Перейдіть на сайт підтримки виробника ноутбуків, перевірте, чи є в ньому новий драйвер для веб-камери, та встановіть його. </li> </ol> </blockquote> <h3> Додаткова довідка щодо вирішення проблем із камерою у Windows 10. </h3> <p> Якщо після вищевказаних кроків у вас все ще виникають проблеми з веб-камерою, спробуйте наступне: </p> <ol> <li> <p> Встановіть усі доступні оновлення для Windows 10 ( <strong> Почніть </strong> -&gt; <strong> Налаштування </strong> -&gt; <strong> Оновлення та безпека </strong> і натисніть <strong> Перевірити наявність оновлень). </strong></p> </li> <li> <p> Оновіть Windows 10 до останньої версії за допомогою <strong> Помічник оновлення. </strong> (Для цього перейдіть до цього пункту <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"noopener\"><strong> посилання </strong></a> і натисніть на <strong> Оновити зараз </strong> кнопки). </p> </li> <li> <p><a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"noopener\"><strong> Оновіть Windows 10 </strong> . </a></p> </li> </ol> <p> Це все, шановні! Вам це вдалося? Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}