{"title":"ВИПРАВЛЕННЯ: Заряд акумулятора в Windows 10 (вирішено)","content":"<p> У Windows 10 багато користувачів скаржаться, що акумулятор ноутбука швидко розряджається навіть при низькому використанні або навіть при повному вимкненні. Ця проблема &quot;розряду батареї&quot; у Windows 10 трапляється з двох основних причин. Перша причина полягає в тому, що Windows 10 завантажує занадто багато фонових програм, які споживають заряд батареї, навіть якщо вони не використовуються. </p> <p> Наступною причиною, яка спричиняє розряд акумулятора, навіть при повному вимкненні, є функція &quot;Швидкий запуск&quot;. Windows 10 (і Windows 8 / 8.1) за замовчуванням увімкнула функцію &quot;Швидкий запуск&quot;, яка дозволяє системі швидше завантажуватися та запускатися. Фактично, коли ввімкнено функцію &quot;Швидкий запуск&quot;, Windows 10 не виконує повне вимкнення системи та переходить у режим глибокого сну. </p> <p> У цьому посібнику ви знайдете вказівки щодо запобігання розряду батареї в Windows 10. </p> <h4> Як виправити проблему з розрядом акумулятора в Windows 10. </h4> <p> </p> <h6> Крок 1. Запобігання запуску програм у фоновому режимі. </h6> <p> Першим кроком, щоб вирішити проблему розряду акумулятора в Windows 10, є уникнення запуску програм у фоновому режимі. Щоб вимкнути фонові програми: </p> <p> 1. Перейдіть до <strong> Почніть </strong> -&gt; <strong> Налаштування </strong> -&gt; <strong> Конфіденційність </strong> . <br> 2. Виберіть <strong> Фонові програми </strong> ліворуч, а потім праворуч, поставте &quot; <strong> Нехай програми працюють у фоновому режимі &quot; </strong> перейти до <strong> Вимкнено, </strong> або окремо виберіть програми, які ви не хочете запускати у фоновому режимі, і вимкніть їх. </p> <p><img src=\"images/image_thumb-8-676.png\" alt=\"Prevent Apps from Running in the Background - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Крок 2. Увімкніть заряд акумулятора. </h6> <p> Наступним кроком є ​​увімкнення режиму економії заряду, щоб продовжити час автономної роботи, обмежуючи фонову активність. </p> <p> 1. Перейдіть до <strong> Почніть </strong> -&gt; <strong> Налаштування </strong> -&gt; <strong> Система </strong> . <br> 2. В <strong> Акумулятор </strong> варіанти: </p> <blockquote> <p> a. Натисніть &quot;Переглянути, які програми впливають на час роботи від акумулятора&quot;, щоб дізнатися про використання батареї у відкритих програмах. <br> b. <strong> Перевірте </strong> &quot; <strong> Автоматично вмикайте заряд батареї, якщо батарея виходить із ладу нижче &quot; </strong> і пересуньте повзунок у відповідне положення. <br> c. Крім того, виберіть &quot;Знизити яскравість екрану, перебуваючи в режимі економії заряду. </p> </blockquote> <p><img src=\"images/image_thumb-9-289.png\" alt=\"turn on battery saver Windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Крок 3. Вимкніть швидкий запуск. </h6> <p> Наступним кроком є ​​примусити Windows 10 повністю вимкнутись, вимкнувши функцію швидкого запуску. </p> <p> 1. Перейдіть до <strong> Почніть </strong> -&gt; <strong> Налаштування </strong> -&gt; <strong> Система </strong> . <br> 2. В <strong> Потужність </strong> натисніть кнопку <strong> Додаткові налаштування живлення. </strong></p> <p><img src=\"images/image_thumb-10-405.png\" alt=\"FIX Battery Drain in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Виберіть <strong> Виберіть, що робити кнопками живлення </strong> зліва. </p> <p><img src=\"images/image_thumb-11-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Потім клацніть <strong> Змінити налаштування, які наразі недоступні </strong> . </p> <p><img src=\"images/image_thumb-12-235.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> Зніміть прапорець </strong> <strong> Увімкнути швидкий запуск (рекомендується) </strong> і натисніть <strong> Зберегти зміни. * </strong></p> <p> * Примітка. Якщо для параметра швидкого запуску вже не встановлено прапорець, перевірте його та перезавантажте комп&#39;ютер. Після перезапуску зніміть його та перезавантажте комп&#39;ютер знову. </p> <p><img src=\"images/image_thumb-13-410.png\" alt=\"Turn Off Fast Startup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Перезапустіть </strong> комп&#39;ютера. </p> <h6></h6> <h6> Крок 4. Вимкніть сплячий режим. </h6> <p> &quot;Гібернація&quot; - це функція живлення, яка споживає менше енергії, ніж режим сну, і коли ви знову запускаєте ПК, ви повертаєтесь туди, де зупинилися. У деяких випадках функція сплячого режиму призводить до того, що ПК з Windows 10 не вимикається повністю. Щоб вимкнути сплячий режим: </p> <p> </p> <p> 1. У полі пошуку введіть: <strong> командний рядок </strong> або <strong> cmd <br> </strong> 2. Клацніть правою кнопкою миші на <strong> Командний рядок і виберіть Запуск від імені адміністратора </strong></p> <p><img src=\"images/image_thumb-14-379.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. У командному рядку введіть таку команду та натисніть <strong> Введіть. </strong></p> <ul> <li><strong> powercfg -h вимкнено </strong></li> </ul> <p><img src=\"images/image_thumb-15-234.png\" alt=\"Disable Hibernate Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. <strong> Перезапустіть </strong> комп&#39;ютера. * </p> <p> * Примітка: Якщо ви хочете повторно ввімкнути функцію сплячого режиму, просто введіть цю команду в адміністративному командному рядку: </p> <ul> <li> <ul> <li> powercfg -h вимкнено </li> </ul> </li> </ul> <p> </p> <h6> Крок 5. Змініть налаштування живлення мережевого адаптера. </h6> <p> Наступним методом виправлення проблеми з розрядом акумулятора в Windows 10 є зміна налаштувань живлення мережевих адаптерів. </p> <p> 1. Відкрити <strong> Диспетчер пристроїв </strong> . <br> 2. Розгорніть <strong> Мережеві адаптери </strong> . <br> 3. Клацніть правою кнопкою миші на встановленому мережевому адаптері та виберіть <strong> Властивості </strong> . <br> 3. Виберіть <strong> Управління живленням </strong> вкладку. <br> 4. <strong> Зніміть прапорець </strong> <strong> &#39;Дозвольте цьому пристрою активувати комп&#39;ютер </strong> &#39;і натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb-7-574.png\" alt=\"modify power settings\" loading=\"lazy\"></p> <h6></h6> <h6> Крок 6. Поверніть драйвер інтерфейсу Intel Management Engine. </h6> <p> Якщо після встановлення оновлення для Windows 10 з’являється проблема з розрядом акумулятора, продовжте та відкачайте драйвер для інтерфейсу Intel Management Engine Interface. Для цього: </p> <p> 1. Натисніть Windows <img src=\"images/image_thumb8_thumb_thumb-592.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> Р. </strong> клавіші, щоб відкрити поле команди запуску. <br> 2. Тип: <strong> devmgmt.msc </strong> &amp; натисніть <strong> гаразд </strong> . <br> 3. Розгорніть <strong> Системні пристрої </strong> . <br> 4. Клацніть правою кнопкою миші <strong> Інтерфейс Intel Management Engine </strong> і виберіть <strong> Властивості </strong> . </p> <p><img src=\"images/image_thumb-5-532.png\" alt=\"device properties\" loading=\"lazy\"></p> <p> </p> <p> 5. Виберіть вкладку Драйвер та натисніть <strong> Відкат драйвера </strong> . * </p> <p> </p> <p> * Якщо <strong> Відкат драйвера </strong> кнопка сіра, а потім перейдіть на сайт підтримки виробника вашого ноутбука або материнської плати, щоб завантажити та встановити стару версію драйвера для інтерфейсу Intel Management Engine. </p> <p><img src=\"images/image_thumb-6-551.png\" alt=\"roll back driver\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Перезапустіть </strong> комп&#39;ютера. </p> <h6> Крок 7. Інші пропозиції щодо вирішення проблеми з розрядом акумулятора. </h6> <p> 1. Замініть зарядний пристрій ноутбука і завжди використовуйте фірмовий зарядний пристрій, щоб продовжити термін служби акумулятора. <br> 2. Якщо акумулятор вашого ноутбука застарів, можливо, його ємність впала і його слід замінити. Для діагностики стану акумулятора використовуйте <a href=\"http://www.nirsoft.net/utils/battery_information_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> BatteryInfoView </a> корисність. </p> <p><img src=\"images/image_thumb-16-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про цю проблему. </p>"}