{"title":"ВИПРАВЛЕННЯ: Outlook отримує повідомлення про помилку 0x80042108 (вирішено)","content":"<p> Цей посібник містить покрокові інструкції щодо виправлення помилки отримання повідомлення Outlook 0x80042108. Помилка Outlook 0x80042108 зазвичай виникає, якщо ви неправильно ввели ім&#39;я сервера електронної пошти POP3 або через відсутність доступу до Інтернету. </p> <p> Проблема в деталях. Outlook 2003, 2007, 2010 або Outlook 2013 відображає таку помилку під час процедури надсилання-отримання: «Отримання повідомленої помилки (0x80042108): Outlook не може підключитися до вхідного (POP3) сервера електронної пошти. Якщо ви продовжите отримувати це повідомлення , зверніться до адміністратора сервера або постачальника послуг Інтернету (ISP) &quot;. </p> <p><img src=\"images/outlookerror_0x80042108-505.png\" alt=\"Outlook Error 0x80042108\" loading=\"lazy\"></p> <p> Помилка Outlook &quot;0x80042108&quot; може виникати в будь-якій версії Outlook (2016, 2013, 2010 або 2007) і з&#39;являється, коли програма електронної пошти Outlook не може підключитися до сервера електронної пошти. </p> <h4> Як виправити помилку 0x80042108 в Outlook 2007, 2010, 2013 або 2016. </h4> <h6> Крок 1. Перевірте підключення до Інтернету. </h6> <p> Першим кроком для вирішення помилки отримання Outlook 80042108 є перевірка підключення до Інтернету. Отже, відкрийте свій Інтернет-браузер і відвідайте будь-який веб-сайт, щоб переконатися, що ваше Інтернет-з’єднання працює. </p> <h6> Крок 2. Перевірте налаштування поштового сервера POP3. </h6> <p> Другим кроком для виправлення помилки отримання Outlook 0x80042108 є перевірка, чи вказані правильні налаштування сервера електронної пошти. Отже, зв’яжіться зі своїм постачальником електронної пошти та перевірте з ним, що ви правильно ввели ім’я вхідного поштового сервера та номер порту. Щоб переглянути та змінити налаштування сервера електронної пошти: </p> <p> 1. Відкрийте Outlook. <br> 2. Перейти до <strong> Файл </strong> -&gt; <strong> Налаштування аккаунта </strong> . </p> <p><img src=\"images/image_thumb-7-811.png\" alt=\"switch Account Mail Merge \" loading=\"lazy\"></p> <p> </p> <p> 3. В <strong> Електронна пошта </strong> , двічі клацніть на своєму обліковому записі електронної пошти, щоб змінити / переглянути його налаштування. <br> 4. Переконайтеся, що ви встановили правильне ім&#39;я сервера вхідної пошти у відповідному полі. <br> 5. Після закінчення натисніть <strong> Додаткові налаштування </strong> . </p> <p><img src=\"images/image_thumb-31-256.png\" alt=\"FIX: Outlook Receiving reported error 0x80042108\" loading=\"lazy\"></p> <blockquote><p> </p></blockquote> <p> 6. Клацніть на <strong> Розширений </strong> та переконайтесь, що ви вказали правильний параметр порту та SSL для сервера вхідної пошти (POP3). </p> <p> </p> <p><img src=\"images/image_thumb-33-400.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Після закінчення натисніть <strong> гаразд </strong> а потім закрийте всі відкриті вікна. <br> 7. Перевірте Outlook ще раз. </p> <h6></h6> <h6> Крок 3. Перевірте налаштування антивірусу та брандмауера. </h6> <p> Якщо ви використовуєте антивірусну програму з функціями сканування електронної пошти, тоді <a href=\"https://www.repairwin.com/how-to-disable-add-ins-in-word-outlook-or-excel-2016-2013-2010-2007-or-2003/\" target=\"_blank\" rel=\"nofollow noopener\"> вимкнути антивірусну надбудову в Outlook </a> або тимчасово вимкнути антивірусний захист або видалити антивірусну програму. Крім того, перевірте налаштування брандмауера та переконайтеся, що порти сервера електронної пошти, які ви використовуєте, не блокуються програмою брандмауера. Більш конкретно, у налаштуваннях брандмауера: </p> <p> A. Увімкніть такі файли для доступу до Інтернету: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Увімкніть такі порти для доступу до Інтернету: </p> <ul> <li><strong> Порт 110 </strong> (Якщо ви використовуєте сервер вхідної пошти POP3 без зашифрованого з’єднання) * </li> <li><strong> Порт 995 </strong> (Якщо ви використовуєте сервер вхідної пошти POP3 із зашифрованим з’єднанням (SSL увімкнено) </li> </ul> <ul> <li><strong> Порт 143 </strong> (якщо ви використовуєте сервер вхідної пошти IMAP без зашифрованого з’єднання) </li> <li><strong> Порт 993 </strong> (якщо ви використовуєте сервер вхідної пошти IMAP із зашифрованим з’єднанням (SSL увімкнено) </li> </ul> <ul> <li><strong> Порт 25 </strong> Якщо ваш сервер вихідної пошти SMTP не використовує SSL. * </li> <li><strong> Порт 465 </strong> або <strong> 587 </strong> якщо ваш сервер вихідної пошти SMTP використовує SSL </li> </ul> <p> * Примітка: За замовчуванням порт 25 призначений для вихідного доступу, а порт 110 - для вхідного. Якщо ви не впевнені у портах, зверніться до свого провайдера або системного адміністратора. </p> <p> </p> <p><strong> Додаткова допомога: </strong> Якщо вищевказані методи вам не допомагають, спробуйте наступне: </p> <p><strong> А. </strong> Видаліть і знову додайте свій обліковий запис електронної пошти. <br> <strong> B. </strong><a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Виправте файл даних Outlook PST </a> . <br> <strong> C. </strong> Від&#39;єднайтеся від підключення VPN (якщо ви підключені до) <br> <strong> Д. </strong> Відремонтувати установку Office. Для цього: </p> <blockquote><p> 1. Перейдіть до Windows <strong> Панель управління </strong> &gt; <strong> Програми та функції </strong> . <br> 2. Знайдіть і виберіть програму MS Office, а потім натисніть <strong> Зміна </strong> . <br> 3. Потім виберіть <strong> Ремонт </strong> варіант. </p></blockquote> <p> </p> <p> </p> <p> Це все, шановні! Вам це вдалося? </p> <p> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}