{"title":"ВИПРАВЛЕННЯ: Файл не має потоків аудіо чи відео в Adobe Premiere.","content":"<p> Якщо під час імпортування відеофайлу MP4 може з’явитись повідомлення про помилку Adobe Premiere «Помилка імпорту файлу» з описом «У файлі немає звукових чи відеосигналів», продовжуйте читати нижче. Помилка &quot;Файл не має аудіо чи відео&quot; в Adobe Premiere, може з&#39;явитися, хоча відео відтворюється правильно в будь-яких інших медіаплеєрах (VLC, Windows Media Player тощо). </p> <p><img src=\"images/image_thumb-43-349.png\" alt=\"FIX: File has no audio or video streams on Adobe Premiere\" loading=\"lazy\"></p> <p> </p> <p> Помилки Adobe Premiere під час імпорту відеофайлу можуть з’являтися з кількох причин, тому в цьому посібнику ви знайдете всі доступні методи усунення проблеми. </p> <h4> Як виправити: &quot;У файлі немає звукових чи відеосигналів&quot; в Adobe Premiere. </h4> <h6> Спосіб 1. Встановіть QuickTime. </h6> <p> Перш за все, переконайтесь, що ви встановили останню версію <a href=\"https://support.apple.com/downloads/quicktime\" target=\"_blank\" rel=\"nofollow noopener\"> Швидкий час </a> версію на ПК, а потім спробуйте імпортувати файл mp4 у Adobe Premiere. </p> <p> </p> <h6> Спосіб 2. Перейменуйте відеофайл. </h6> <p> 1. Створіть копію відеофайлу mp4 в іншому місці на вашому ПК. (наприклад, на робочому столі) <br> 2. Перейменуйте відеофайл наступним чином: </p> <blockquote><p> a. Укажіть коротше ім’я файлу у відеофайлі та… <br> b. Видаліть зі свого імені будь-які спеціальні символи. (підкреслення, дужки тощо). </p></blockquote> <p> 3. Відкрийте відеофайл у Adobe Premiere. </p> <p> </p> <h6> Спосіб 3. Змініть розширення імені файлу з MP4 на MOV. </h6> <p> Наступним методом, щоб уникнути помилки Adobe Premiere &quot;Файл не має потоків аудіо чи відео&quot;, є зміна розширення відеофайлу з .mp4 на .mov (або навпаки). Для цього: </p> <p> 1. У Провіднику файлів натисніть <strong> Переглянути </strong> -&gt; <strong> Варіанти </strong> -&gt; <strong> Змінити папку та параметри пошуку </strong> . </p> <p><img src=\"images/image_thumb-45-776.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. В <strong> Переглянути </strong> вкладка, <strong> ясно </strong> вікно &quot;Приховати розширення для відомих типів файлів&quot; і натисніть <strong> гаразд </strong> . * </p> <p> * Примітка. Щоб зробити це налаштування постійним, натисніть кнопку &quot;Застосувати до папок&quot;, перш ніж клацнути OK. </p> <p><img src=\"images/image_thumb-46-490.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Тепер продовжте та перейменуйте / змініть розширення відеофайлу таким чином: </p> <ul> <li> Якщо відеофайл має формат MP4 (.mp4), змініть його розширення на .mov </li> <li> Якщо відеофайл має формат MOV (.mov), змініть його розширення на .mp4 </li> </ul> <p><img src=\"images/image_thumb-47-586.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Нарешті, відкрийте відеофайл у Adobe Premiere. </p> <p> </p> <p> </p> <h6> Спосіб 4. Очищення бази даних кеш-пам’яті та файлів кешу. </h6> <p> Під час імпорту мультимедійного файлу (відео чи аудіо) та під час роботи з цим файлом у Adobe Premiere програма створює файли кеш-медіа для швидшої роботи. Крім того, програма створює посилання для цих кеш-файлів у Базі даних кеш-пам’яті. З часом ці файли кеш-медіа та база даних кеш-медіа можуть стати занадто великими або пошкодженими, і їх потрібно очистити, щоб уникнути проблем. </p> <p> Отже, наступним методом вирішення проблеми &quot;Файл не має потоків аудіо чи відео&quot; в Premiere є очищення &quot;Бази даних медіа-кешу&quot; та видалення файлів кешу. Для цього: * </p> <p><strong> А. Як очистити базу даних кеш-пам’яті Adobe Premiere. </strong></p> <p> 1. Відкрийте Adobe Premiere. <br> 2. З меню перейдіть до <strong> Редагувати </strong> -&gt; <strong> Преференції </strong> -&gt; <strong> ЗМІ. <br> </strong> 3. У базі даних кеш-пам&#39;яті мультимедіа натисніть <strong> Чистий </strong> кнопку. </p> <p><img src=\"images/image_thumb-48-167.png\" alt=\"Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> 4. <strong> Перезапустіть </strong> Adobe Premiere та спробуйте відкрити відеофайл. якщо помилка &quot;Файл не має потоків аудіо чи відео&quot; не зникає, перейдіть до очищення кеш-файлів Adobe Premiere, дотримуючись інструкцій нижче: </p> <p><strong> B. Як очистити файли кеш-медіафайлів Adobe Premiere. </strong></p> <p> 1. <strong> відчинено </strong> Adobe Premiere. <br> 2. З меню перейдіть до <strong> Редагувати </strong> -&gt; <strong> Преференції </strong> -&gt; <strong> ЗМІ. <br> </strong> 3. На вкладці Файли кеш-медіа натисніть <strong> Перегляньте </strong> або зафіксуйте розташування файлів кеш-медіа. </p> <p><img src=\"images/image_thumb-49-331.png\" alt=\"FIX: Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Закрити </strong> Adobe Premiere. <br> 5. У Провіднику файлів <strong> видалити </strong> весь вміст папки &quot;Файли кеш-медіа&quot;. <br> 6. Імпортуйте відеофайл у Premiere. </p> <p> </p> <h6> Спосіб 5. Перекодуйте відеофайл. </h6> <p> Останнім методом вирішення проблеми &quot;Файл не має аудіо- чи відеопотоків&quot; в процесі імпортування Adobe Premiere є повторне кодування відеофайлу. Для цього: </p> <p> 1. Завантажте та встановіть <a href=\"https://handbrake.fr/downloads.php\" target=\"_blank\" rel=\"nofollow noopener\"> Ручне гальмо </a> . <br> 2. Відкрийте Ручне гальмо та натисніть <strong> Файл - Відкрийте один відеофайл </strong> . </p> <p><img src=\"images/image_thumb-50-634.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Виберіть відеофайл, який ви не можете імпортувати в Adobe Premiere, та натисніть <strong> відчинено </strong> . <br> 4. Встановіть вихідний формат на <strong> MP4, </strong> а потім клацніть <strong> Перегляньте </strong> і вкажіть місце зберігання та ім’я файлу вихідного (перекодованого) відеофайлу. </p> <p><img src=\"images/image_thumb-51-817.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. В <strong> Розміри </strong> , встановіть ті самі розміри, що й вихідний файл. <br> 6. Після закінчення натисніть <strong> Почніть кодування. </strong></p> <p><img src=\"images/image_thumb-52-713.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Коли процес кодування завершено, закрийте Handbrake. <br> 7. Відкрийте перекодований відеофайл у Adobe Premiere. </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}