{"title":"ВИПРАВЛЕННЯ: Надбудова Outlook встановлюється для всіх користувачів і не може бути видалена. (Вирішено)","content":"<p> Якщо ви не можете вимкнути або ввімкнути надбудову Outlook через помилку &quot; <em> Додаток встановлено для всіх користувачів на цьому комп’ютері, і його може підключати або від’єднувати лише адміністратор </em> &quot;, продовжуйте читати нижче, щоб вирішити проблему. </p> <p><img src=\"images/image_thumb-76-527.png\" alt=\"The add-is installed for all users on this computer, and can only be connected or disconnected by an administrator\" loading=\"lazy\"></p> <p> З&#39;являється помилка &quot;Надбудову може вимкнути лише адміністратор&quot;, оскільки при встановленні надбудови ви вирішили встановити її для всіх користувачів на комп&#39;ютері. У цьому випадку єдиним рішенням для усунення помилки є видалення надбудови за допомогою адміністративних привілеїв. </p> <h2> Як виправити: Неможливо ввімкнути або вимкнути надбудову, оскільки вона встановлена ​​для всіх користувачів у програмах Outlook, Word або Excel. </h2> <p> Якщо ви не можете видалити або активувати надбудову програми Microsoft Office через помилку &quot; <em> Додаток встановлений для всіх користувачів на цьому комп&#39;ютері, і його може підключати або відключати лише адміністратор &quot;, </em> запустіть відповідну програму як Адміністратор і приступайте до видалення Надбудови без проблем. Для цього: </p> <p><strong> 1. </strong> Клацніть правою кнопкою миші на програмі Office, де ви зіткнетеся з помилкою, згаданою вище (наприклад, Outlook), і виберіть <strong> Запустити від імені адміністратора. * </strong></p> <p> * Примітки: <strong><br> </strong> 1. Якщо ви не бачите опції &quot;Запустити адміністратора&quot;, натисніть і утримуйте <strong> SHIFT </strong> ключ і <strong> клацніть правою кнопкою миші </strong> у програмі Office ви стикаєтеся з помилкою. <br> 2. Якщо клацнути правою кнопкою миші на програмі Office із Windows 10 <strong> Почніть </strong> меню <img src=\"images/image_thumb2_thumb_thumb-340.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Програми </strong> , йти до <strong> Більше </strong> &gt; <strong> Запустити від імені адміністратора. </strong></p> <p><img src=\"images/image_thumb-77-661.png\" alt=\"FIX: Unable to Enable or Disable Add-in \" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Коли з’явиться запит дозволити цій програмі вносити зміни у ваш пристрій, виберіть <strong> Так. </strong></p> <p><img src=\"images/image_thumb-78-120.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Після відкриття програми Office перейдіть до вимкнення або ввімкнення потрібної надбудови. Цього разу надбудову буде видалено без проблем. </p> <p> Це воно! Повідомте мене, якщо цей посібник допоміг вам, залишивши коментар щодо вашого досвіду. Будь ласка, сподобайтеся і поділіться цим посібником, щоб допомогти іншим. </p>"}