{"title":"ВИПРАВЛЕННЯ: Сервер недоступний. Можливо, у вас немає дозволу на використання цього мережевого ресурсу. Дескриптор недійсний. (Вирішено)","content":"<p> Цей підручник містить інструкції щодо виправлення наступної помилки під час спроби отримати доступ до спільної папки в мережі: &quot;Сервер недоступний. Можливо, у вас немає дозволу на використання цього мережевого ресурсу. Зверніться до адміністратора цього сервера, щоб дізнатися, чи маєте ви доступ дозволи. Дескриптор недійсний. &quot; </p> <p><img src=\"images/image_thumb-5-437.png\" alt=\"You might not have permission to use this network resource\" loading=\"lazy\"></p> <p> </p> <h2> Як ВИПРАВИТИ: Не вдається отримати доступ до спільної папки. Можливо, у вас немає дозволу на використання цього мережевого ресурсу. Дескриптор недійсний. </h2> <p> Зазвичай проблема із підключенням спільного доступу до файлів &quot;Можливо, у вас немає дозволу на використання цього мережевого ресурсу&quot; з&#39;являється, коли користувач намагається отримати доступ до спільної папки мережі, не маючи необхідних дозволів. У цьому випадку і для вирішення проблеми потрібно забезпечити, щоб користувач мав відповідні дозволи на доступ до спільної папки. </p> <p> Однак якщо ви знаєте, що дозволи користувача на спільну папку правильні, а проблема з підключенням «Ви можете не мати дозволу на використання цього мережевого ресурсу» з’явилася раптово і без очевидної причини, то проблема, ймовірно, пов’язана з установкою Windows Оновлення. У цьому випадку продовжуйте читати нижче, щоб вирішити проблему. </p> <p> * Примітка. Якщо ви стикаєтеся з помилкою спільного використання в середині січня 2019 року, виною тому є таке оновлення безпеки Windows: <a href=\"https://support.microsoft.com/el-gr/help/4480970/windows-7-update-kb4480970\" target=\"_blank\" rel=\"nofollow noopener\"> 8 січня 2019 р. - KB4480970 (щомісячне зведення) </a> . </p> <h6> Спосіб 1. Видаліть останнє оновлення Windows. </h6> <p> На машині зі спільною папкою: </p> <p> 1. Клацніть правою кнопкою миші на піктограмі «Мій комп’ютер» і виберіть <strong> Властивості </strong> . <br> 2. Клацніть <strong> Windows Update </strong> . </p> <p><img src=\"images/image_thumb-6-686.png\" alt=\"fix Network Shared Folder is Not Accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. Клацніть <strong> Встановлені оновлення </strong> . </p> <p><img src=\"images/image_thumb-7-999.png\" alt=\"fix cannot access shared folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Відсортуйте оновлення за датою встановлення, клацнувши <strong> Встановлено увімкнено. </strong></p> <p><img src=\"images/image_thumb-8-158.png\" alt=\"uninstall windows update\" loading=\"lazy\"></p> <p> </p> <p> 5. Виділіть останнє встановлене оновлення для Windows і натисніть <strong> Видаліть. </strong> * </p> <p> * напр. Якщо у середині січня 2019 року ви зіткнулися з помилкою спільного доступу, продовжте та видаліть «Оновлення безпеки для Microsoft Windows KB4480970». </p> <p><img src=\"images/image_thumb-9-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Після завершення встановлення, <strong> перезапустити </strong> комп&#39;ютер. <br> 7. Після перезапуску спробуйте ще раз отримати доступ до спільної папки з клієнтської машини. Потім застосуйте запропоновані дії відповідно до вашого випадку: </p> <ul> <li><strong> Випадок A: </strong> Якщо проблема не зникне, видаліть усі останні встановлені оновлення або продовжте <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> метод 2 </a> нижче. </li> <li><strong> Випадок B: </strong> Якщо проблема вирішена, запобігайте інсталяції вилученого оновлення в майбутньому. Для цього: </li> </ul> <blockquote><p> 1. Перейдіть до Центру оновлення Windows і <strong> Перевірити наявність оновлень </strong> . <br> 2. Клацніть на <strong> Важливі оновлення </strong> . </p></blockquote> <p><img src=\"images/image_thumb-22-393.png\" alt=\"view important updates\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 3. Клацніть правою кнопкою миші на проблемному оновленні та натисніть <strong> Сховати оновлення </strong> . <br> 4. Нарешті клацніть <strong> гаразд </strong> а потім закрийте Центр оновлення Windows. </p></blockquote> <p><img src=\"images/image_thumb-23-795.png\" alt=\"hide update windows 7\" loading=\"lazy\"></p> <h6> Спосіб 2. Відновіть свій ПК до попереднього робочого стану. </h6> <p> На машині зі спільною папкою: </p> <p> 1. Натисніть Windows <img src=\"images/image_thumb8_thumb-632.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> Р. </strong> клавіші, щоб відкрити поле команди запуску. <br> 2. Тип <strong> rstrui </strong> &amp; натисніть <strong> гаразд </strong> для запуску відновлення системи. </p> <p><img src=\"images/rstui-1-300x148-611.png\" alt=\"rstui\" loading=\"lazy\"></p> <p> </p> <p> 3. Клацніть <strong> Далі </strong> на першому екрані. <br> 4. Виберіть попередній робочий стан (Дата / час) і натисніть <strong> Далі </strong> щоб розпочати процес відновлення. </p> <p><img src=\"images/image_thumb-50-355.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Після відновлення системи спробуйте ще раз отримати доступ до спільної папки з клієнтської машини. </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про цю проблему. </p>"}