{"title":"ВИПРАВЛЕННЯ: Thunderbird не реагує або не замерзає. (Вирішено)","content":"<p> Якщо Thunderbird не відповідає, продовжте нижче, щоб вирішити проблему. Thunderbird - популярний поштовий клієнт із відкритим кодом, доступний для всіх платформ. Але іноді Thunderbird взагалі перестає реагувати, або він замерзає на 4-5 хвилин, перш ніж знову буде використаний. </p> <p><img src=\"images/image_thumb-18-762.png\" alt=\"Thunderbird is not responding or freezing - fix\" loading=\"lazy\"></p> <p> Thunderbird може не працювати з наступних причин: </p> <ul> <li> Антивірусна програма може перешкодити Thunderbird підключатися до Інтернету. </li> <li> Функція пошуку Windows у повідомленнях Thunderbird може призвести до зависання Thunderbird. </li> <li> Проблемна настройка Thunderbird або доповнення. </li> <li> Файли індексації Thunderbird (файли MSF) можуть бути пошкоджені. </li> </ul> <p> Оскільки Thunderbird може не реагувати з різних причин, у цьому посібнику ми покажемо вам усі доступні способи вирішення проблеми. </p> <h2> Як виправити: Thunderbird не реагує або зависає в Windows 10. </h2> <h3> Спосіб 1. Скануйте комп’ютер на наявність вірусів. </h3> <p><strong> Важливо: </strong> Багато вірусів або шкідливих програм можуть спричинити проблеми з оновленням Windows. Тому, перш ніж продовжувати кроки з усунення несправностей нижче, скористайтеся цим <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Посібник із сканування та видалення шкідливих програм </a> перевірити та видалити віруси та / або шкідливі програми, які можуть працювати на вашому комп’ютері. </p> <h3></h3> <h3> Спосіб 2. Вимкніть пошук Windows у повідомленнях Thunderbird. </h3> <p> 1. У меню Thunderbird виберіть <strong> Інструменти </strong> &gt; <strong> Варіанти </strong> . </p> <p> 2. У загальних налаштуваннях <strong> зніміть прапорець </strong> варіант <strong> Дозволити пошуку Windows шукати повідомлення </strong> . </p> <p><img src=\"images/image_thumb-24-636.png\" alt=\"Disable Windows Search in Thunderbird Messages\" loading=\"lazy\"></p> <p> 3. <strong> Перезапустіть </strong> Громовий птах. </p> <p> </p> <h3> Спосіб 3. Додайте Thunderbird до антивірусних винятків. </h3> <p> Якщо ви знову використовуєте на своєму комп&#39;ютері сторонній антивірус, продовжте та додайте виконувану програму &quot;thunderbird.exe&quot; до винятків антивірусної програми. </p> <p> Наприклад, якщо ви є власником антивіруса AVG: </p> <p> 1. Перейти до <strong> Меню </strong> &gt; <strong> Налаштування </strong> . <br> 2. В <strong> Загальні </strong> , натисніть <strong> Винятки </strong> &gt; <strong> Додати виняток </strong> . <br> 3. Клацніть на <strong> Перегляньте </strong> і знайдіть <strong> thunderbird.exe </strong> файл, (або <strong> копіювати </strong> &amp; <strong> вставте нижній рядок) </strong> а потім клацніть <strong> Додати виняток. * </strong></p> <ul> <li> C: \\ Program Files (x86) \\ Mozilla Thunderbird \\ thunderbird.exe </li> </ul> <p><strong> * Примітка: </strong> Якщо після додавання файлу &quot;thunderbird.exe у ваші винятки AV проблема все ще залишається, <strong> додати </strong> також <strong> до винятків AV </strong> <strong> папку, де встановлено Thunderbird </strong> та <strong> Папка профілю Thunderbird </strong> . </p> <p><img src=\"images/image_thumb-19-734.png\" alt=\"add thunderbird to antivirus exceptions\" loading=\"lazy\"></p> <p> </p> <p> </p> <h3> Спосіб 4. Вимкнути - Видаліть свої антивірусні програми. </h3> <p> Оскільки проблема &quot;не відповідає&quot; у програмі Thunderbird, як правило, це пов&#39;язано з антивірусною програмою, я пропоную <strong> вимкнути </strong> або до <strong> повністю видалити </strong> антивірусної програми та перевірити, чи проблема не зникає. </p> <h3></h3> <p> </p> <h3> Спосіб 5. Запустіть Thunderbird у безпечному режимі. </h3> <p> Thunderbird може зависнути і не реагувати, якщо встановлене розширення викликає проблему або пошкоджено. Щоб вирішити проблеми з доповненнями Thunderbird, виконайте наступні дії. </p> <p> 1. Натисніть і <strong> постривай </strong> <strong> SHIFT </strong> клавішу на клавіатурі та відкрийте <strong> Громовий птах. </strong></p> <p> 2. У наступному вікні натисніть <strong> Продовжуйте в безпечному режимі. </strong></p> <p><img src=\"images/image_thumb-21-196.png\" alt=\"Strat Thunderbird in Safe Mode\" loading=\"lazy\"></p> <p> </p> <p> 3. Якщо Thunderbird не замерзає в безпечному режимі, то встановлена ​​надбудова може спричинити проблему. У цьому випадку: </p> <ol> <li> Закрийте Thunderbird. </li> <li> Натисніть клавішу SHIFT і знову запустіть Thunderbird. </li> <li> У наступному вікні, <strong> перевірити </strong> <strong> Вимкніть усі доповнення </strong> і натисніть <strong> Внесіть зміни та перезапустіть </strong> . </li> </ol> <p><img src=\"images/image_thumb-22-149.png\" alt=\"Disable Thunderbird add-ons\" loading=\"lazy\"></p> <p> 4. Якщо Thunderbird не реагує знову, перейдіть до наступного методу. </p> <h3> Спосіб 5. Скиньте панелі інструментів та елементи керування Thunderbird. </h3> <p> 1. Натисніть і <strong> постривай </strong> <strong> SHIFT </strong> клавішу на клавіатурі та відкрийте <strong> Громовий птах. </strong></p> <p> 2. У наступному вікні виберіть <strong> Скинути панелі інструментів та елементи керування </strong> і натисніть <strong> Внесіть зміни та перезапустіть. </strong></p> <p><img src=\"images/image_thumb-23-344.png\" alt=\"Reset Thunderbird Toolbars\" loading=\"lazy\"></p> <p> </p> <h3> Спосіб 6. Видаліть файли індексу Thunderbird (.msf). </h3> <p> У деяких випадках Thunderbird зависає, оскільки файли індексації (вони ж MSF-файли) пошкоджуються. Отже, остаточним методом вирішення проблеми &quot;Thunderbird не відповідає&quot; є видалення файлів .MSF. * </p> <p><strong> * ВАЖЛИВО: </strong> Хоча файли MSF (Mail Summary Files) можна безпечно видалити, оскільки вони містять лише заголовки електронної пошти та статус електронної пошти (прочитані, непрочитані тощо), а не фактичну електронну пошту, <a href=\"https://www.repairwin.com/how-to-transfer-thunderbird-email-and-settings-to-a-new-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> зробити резервну копію папки профілю Thunderbird </a> перед видаленням файлів MSF. </p> <p><strong> Крок 1. Закрийте Thunderbird. </strong></p> <p><strong> Крок 2. Увімкніть перегляд прихованих файлів. </strong></p> <p> 1. Перейдіть до Windows <strong> Панель управління </strong> і відкрийте <strong> Параметри папки </strong> . (або <strong> Параметри Провідника файлів </strong> у Windows 10). </p> <p> 2. Виберіть <strong> Переглянути </strong> і під <strong> &#39;Приховані файли та папки&#39; </strong> розділ, <strong> перевірити </strong> <strong> Показати приховані файли, папки та диски </strong> і натисніть <strong> ГАРАЗД. </strong></p> <p><img src=\"images/image_thumb-34-553.png\" alt=\"Show Hidden files\" loading=\"lazy\"></p> <p> </p> <p><strong> Крок 3. Видаліть файли .MSF </strong></p> <p> 1. Перейдіть до папки профілю Thunderbird на вашому диску та відкрийте <strong> Пошта </strong> папка: * </p> <ul> <li> C: \\ Users \\ username \\ AppData \\ Roaming \\ Thunderbird \\ Profiles \\ ProfileName <strong> .default \\ Mail </strong></li> </ul> <p> * Де ім’я користувача - це ваше ім’я користувача Windows, а ProfileName - ім’я профілю Mozilla, в якому зберігаються електронні листи. </p> <p> 2. Тепер вивчіть усі вміщені папки всередині <strong> Пошта </strong> , щоб побачити, яка з них містить файли .msf. (у установках за замовчуванням лише з одним обліковим записом електронної пошти файли MSF розміщуються в папці &quot;Локальні папки&quot;. </p> <p> 3. <strong> Видалити </strong> всі <strong> .msf </strong> файли, або-краще- <strong> рухатися </strong> їх до (нової) папки на робочому столі. </p> <p><img src=\"images/image_thumb-25-355.png\" alt=\"Delete Thunderbird MSF files\" loading=\"lazy\"></p> <p> 4. Закінчивши, відкрийте Thunderbird і зачекайте, поки Thunderbird відтворить файли індексації (файли MSF). </p> <p> Це все, шановні! Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}