{"title":"ВИПРАВЛЕННЯ: Диски відображаються двічі на панелі навігації Windows 10 (вирішено)","content":"<p> У цьому підручнику ви &quot;інструкції з виправлення такої дивної проблеми в Windows 10: Диски, що відображаються двічі в панелі навігації. Дубльований вигляд дисків у навігаційній панелі, це нова функція Windows 10, яка допомагає користувачеві легко досліджувати вміст приєднаний диск, не розширюючи меню &quot;Цей ПК&quot;. Але ця функція стає дратує, тому що якщо ви використовуєте, щоб меню &quot;Цей ПК&quot; залишалося відкритим, той самий диск два рази відображається на панелі навігації. </p> <p><img src=\"images/image_thumb-22-749.png\" alt=\"Drives Displayed Twice in Navigation Pane of Windows 10\" loading=\"lazy\"></p> <p> Якщо ви бачите повторювані записи підключених USB-накопичувачів або фіксованих дисків у Windows 10, виконайте наведені нижче інструкції, щоб вирішити проблему. </p> <h4> Як видалити повторювані літери диска в Провіднику Windows 10 (меню навігації). </h4> <p> Щоб запобігти Windows 10, щоб двічі відображати підключений або фіксований диск, застосуйте таку налаштування реєстру: </p> <p> 1. Відкрийте редактор реєстру. для цього: </p> <blockquote><p> 1. Натисніть Windows <img src=\"images/image_thumb8_thumb_thumb-493.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> Р. </strong> клавіші, щоб відкрити поле команди запуску. <br> 2. У полі пошуку введіть <strong> regedit </strong> і натисніть <strong> Введіть </strong> запустити редактор реєстру. </p></blockquote> <p><img src=\"images/image_thumb7-138.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Потім перейдіть до цього розділу реєстру: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows \\ CurrentVersion \\ Explorer \\ Desktop \\ NameSpace \\ DelegateFolders </li> </ul> <p> 3. Потім клацніть правою кнопкою миші та видаліть <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> ключ. </p> <p><img src=\"images/image_thumb-23-428.png\" alt=\"remove duplicate drive entries windows 10 navigation pane\" loading=\"lazy\"></p> <p> </p> <p> 4. Потім перейдіть до цієї клавіші: * </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ WOW6432Node \\ Microsoft \\ Windows \\ CurrentVersion \\ Explorer \\ Desktop \\ NameSpace \\ DelegateFolders </li> </ul> <p> 5. Видаліть <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> ключ. </p> <p> 6. Закрийте редактор реєстру. </p> <p> * Примітка: Якщо ви не бачите клавішу &quot;WOW6432Node&quot;, ігноруйте наведені вище кроки 4 і 5, оскільки вони стосуються лише 64-бітних версій Windows 10. </p> <p><strong> ПОРАДА: </strong> Якщо ви зміните своє рішення в майбутньому, просто клацніть правою кнопкою миші на &#39;DelegateFolders&#39; у вищевказаних місцях реєстру, виберіть <strong> Новий </strong> -&gt; <strong> Ключ </strong> та відтворіть видалене <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> ключ (и). </p> <p> Це все! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}