{"title":"ВИПРАВЛЕННЯ: HDMI немає звуку до телевізора або HDMI Не відображається на пристроях відтворення (вирішено).","content":"<p> Якщо ви підключили телевізор до ноутбука за допомогою кабелю HDMI і під час відтворення відео не виводиться звук, або HDMI не відображається як пристрій відтворення, продовжуйте читати цей посібник. </p> <p> Проблема в деталях: На ноутбуці з ОС Windows 10 пристрій цифрового виводу (HDMI) не значиться як пристрій відтворення, і при підключенні до телевізора за допомогою кабелю HDMI звук не виводиться. </p> <p> Проблема &quot;Відсутність звуку з HDMI&quot; у Windows 10 може з’являтися з кількох причин, тому в цьому посібнику ви знайдете покрокові інструкції щодо усунення проблеми. </p> <h2> Як виправити: відсутність звуку з HDMI та HDMI не відображається на пристроях відтворення в Windows 10 * </h2> <p> * Пропозиції: Перш ніж перейти до наступних кроків: </p> <ul> <li><strong> Клацніть правою кнопкою миші </strong> біля <strong> значок звуку </strong><img src=\"images/image_thumb-11-109.png\" alt=\"image\" loading=\"lazy\"> на панелі завдань <strong> Відкрийте змішувач гучності </strong> і переконайтесь, що <strong> Пристрій цифрового виводу </strong> не вимкнено. </li> <li> Переконайтесь, що кабель HDMI правильно підключений як на ноутбуці, так і на телевізорі. </li> <li> Після підключення кабелю HDMI <strong> перезапустити </strong> комп&#39;ютера. </li> <li> На телевізорі встановіть правильний порт HDMI як пристрій введення відео. </li> <li> Якщо у вас власний ноутбук, закрийте кришку або один раз натисніть кнопку живлення, щоб перевести ноутбук у режим сну. Потім знову натисніть кнопку живлення та ще раз перевірте звук із HDMI. </li> <li> Перевірте, чи проблема не зникає, за допомогою іншого кабелю HDMI. </li> </ul> <p> </p> <h3> Крок 1. Встановіть HDMI як пристрій відтворення за замовчуванням. </h3> <p> Першим кроком для вирішення проблем із HDMI Audio у Windows 10 є встановлення HDMI як аудіопристрою за замовчуванням. </p> <p> 1. Перейдіть до Windows <strong> Панель управління </strong> і відкрити <strong> Звук. </strong></p> <p><img src=\"images/image_thumb-14-686.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Переконайтеся, що <strong> Цифровий вихід </strong> (HDMI) є <strong> За замовчуванням </strong> пристрій відтворення, інакше виберіть <strong> Цифровий вихід </strong> пристрою та натисніть <strong> Встановити за замовчуванням </strong> кнопку. Завершивши, відтворіть відео, щоб перевірити звук HDMI, і якщо проблема не зникне, перейдіть до наступного кроку. * </p> <p><img src=\"images/image_thumb-43-106.png\" alt=\"FIX: HDMI No Sound Output \" loading=\"lazy\"></p> <p> </p> <p> * Примітки: Спробуйте наступне, відповідно до вашого випадку: </p> <p> 1. Якщо <strong> Цифровий вихід </strong> пристрій є <strong> інваліди </strong> , клацніть правою кнопкою миші та натисніть <strong> Увімкнути </strong> . Потім виділіть його та натисніть <strong> Встановити за замовчуванням </strong> . </p> <p><img src=\"images/image_thumb-44-233.png\" alt=\"FIX: HDMI Not Listed in Playback devices \" loading=\"lazy\"></p> <p> 2. Якщо пристрій цифрового виводу не відображається як пристрій відтворення: </p> <blockquote><p> a. Клацніть правою кнопкою миші на порожньому місці та переконайтеся, що обидва <strong> Показати відключені пристрої </strong> та <strong> Показати відключені пристрої </strong> параметри вибрані (позначені). Якщо жоден із наведених вище варіантів не вибраний, натисніть на нього, щоб вибрати його. </p></blockquote> <p><img src=\"images/image_thumb-45-410.png\" alt=\"Enable HDMI DIgital Output\" loading=\"lazy\"></p> <blockquote><p> b. Потім клацніть правою кнопкою миші на пристрої цифрового виводу та виберіть <strong> Увімкнути. <br> c. </strong> Після закінчення встановіть як <strong> за замовчуванням </strong> <strong> Цифровий вихід </strong> пристрою. </p> </blockquote> <h3><br clear=\"all\"> Крок 2. Поверніть драйвер звукової карти. </h3> <p> У деяких випадках після автоматичного оновлення драйвера проблема &quot;HDMI no sound to TV&quot; може з’являтися. Отже, продовжуйте і відкочуйте драйвер звуку. </p> <p> 1. Відкрити <strong> Диспетчер пристроїв </strong> . Для цього: </p> <blockquote><p> 1. Натисніть Windows <img src=\"images/image_thumb8_thumb_thumb-781.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> Р </strong> клавіші, щоб відкрити поле команди запуску. <br> 2. У полі &quot;Відкрити&quot; введіть: <strong> devmgmt.msc </strong> &amp; натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb-5-389.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Розгорнути </strong> <strong> Контролери звуку, відео та ігор. <br> 3. Клацніть правою кнопкою миші </strong> на <strong> Аудіопристрій високої чіткості </strong> і виберіть <strong> Властивості. </strong></p> <p><img src=\"images/image_thumb-17-970.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. На вкладці Драйвер натисніть <strong> Відкат драйвера </strong> кнопку. <strong> * </strong></p> <p> * Примітка: Якщо кнопка Відкат драйвера неактивна, перейдіть до наступного кроку. </p> <p><img src=\"images/image_thumb-18-921.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> 5. Виберіть причину відкоту пакета драйверів і натисніть <strong> Так. </strong></p> <p><img src=\"images/image_thumb-19-748.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Коли відкат драйвера завершено, <strong> перезапустити </strong> комп&#39;ютера. <br> 5. Після перезапуску продовжте та протестуйте звук із HDMI. Якщо ви все ще не можете почути звук на своєму телевізорі, перейдіть до наступного кроку. </p> <h3> Крок 3. Змініть драйвер звукової карти. </h3> <p> Відсутність звуку часто відбувається через неправильний драйвер звукової карти. Щоб вирішити цю проблему: </p> <p> 1. Відкрити <strong> Диспетчер пристроїв. </strong><br> 2. <strong> Розгорнути </strong> <strong> Контролери звуку, відео та ігор. <br> </strong> 3. <strong> Клацніть правою кнопкою миші </strong> в <strong> Realtek High Definition Audio </strong> пристрою та виберіть <strong> Оновити драйвер. <br> </strong></p> <p><img src=\"images/image_thumb-6-937.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Виберіть <strong> Знайдіть на моєму комп’ютері драйвери. </strong></p> <p><img src=\"images/image_thumb-7-874.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Виберіть <strong> Дозвольте мені вибрати зі списку доступних драйверів на моєму комп&#39;ютері </strong> . </p> <p><img src=\"images/image_thumb-8-498.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. На наступному екрані виберіть <strong> Аудіопристрій високої чіткості </strong> і натисніть <strong> Далі. </strong></p> <p><img src=\"images/image_thumb-20-756.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/07/image-10.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 8. Коли інсталяція драйвера завершена, <strong> перезапустити </strong> комп&#39;ютера. <br> 9. Після перезапуску продовжте та протестуйте звук із динаміків ноутбука. </p> <h3> Крок 4. Видаліть та встановіть заново драйвер звукової карти. </h3> <p> 1. Відкрити <strong> Диспетчер пристроїв. </strong><br> 2. <strong> Розгорнути </strong> <strong> Контролери звуку, відео та ігор. <br> </strong> 3. <strong> Клацніть правою кнопкою миші </strong> в <strong> Аудіо високої чіткості </strong> пристрою та виберіть <strong> Видаліть пристрій. </strong></p> <p><img src=\"images/image_thumb-21-678.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. Після видалення <strong> перезапустити </strong> комп&#39;ютера, і дозвольте Windows автоматично встановлювати драйвери звуку. Якщо цього не сталося, перейдіть до <strong> Налаштування </strong> &gt; <strong> Оновлення та безпека </strong> і змусити Windows <strong> Перевірити наявність оновлень. </strong></p> <p> </p> <h3> Крок 5. Видаліть та встановіть заново адаптер дисплея. </h3> <p> 1. Відкрити <strong> Диспетчер пристроїв. <br> </strong> 2. <strong> Розгорнути </strong> <strong> Відеоадаптери. <br> </strong> 3. <strong> Клацніть правою кнопкою миші </strong> на встановленому адаптері дисплея та виберіть <strong> Видаліть пристрій. </strong></p> <p><img src=\"images/image_thumb-46-871.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. Після видалення <strong> перезапустити </strong> комп’ютері та дозвольте Windows автоматично встановлювати драйвери дисплея. Якщо цього не трапиться, якщо ви все ще стикаєтесь із проблемою, перейдіть на сайт підтримки виробника вашого ноутбука та завантажте найновіші драйвери дисплея відповідно до вашої моделі ноутбука. </p> <p> Це все, шановні! Який метод працював у вас? Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}