{"title":"ВИПРАВЛЕННЯ: Chrome завжди запускає параметри &quot;Огляд як гість&quot; - перемикання особи.","content":"<p> Підручник містить інструкції про те, як запобігти Chrome відображати вікно &quot;Переключити особу - переглядати як гостя&quot; під час запуску. Проблема в деталях: На комп’ютері під керуванням Windows браузер Google Chrome завжди відкриває параметри «Огляд як гість» та «Додати особу» під час запуску, і користувач завжди повинен вибирати свій профіль, щоб користуватися браузером Chrome. </p> <p><img src=\"images/image_thumb-26-805.png\" alt=\"FIX Remove Chrome Browse as Guest\" loading=\"lazy\"></p> <p> </p> <h4> Як видалити вікно параметрів &quot;Браузер як гість - Додати особу&quot; під час запуску Chrome. </h4> <h6> Спосіб 1. Перевірте, чи встановлено Chrome завжди запускати в режимі гостьового перегляду. </h6> <p> Однією з найкорисніших функцій браузера Google Chrome є створення декількох профілів користувачів, особливо якщо ви ділитеся своїм комп’ютером з іншими або якщо хочете розділити закладки та налаштування між кількома обліковими записами. У цьому випадку ви завжди можете запустити Chrome за допомогою вікна &quot;Переключити особу&quot;, додавши один із таких перемикачів (текстових записів) у ярлик Chrome: </p> <ul> <li><strong> –Profile-directory = &quot;Профіль гостя&quot; </strong></li> <li><strong> –Bwsi </strong></li> </ul> <p> </p> <p> Отже, перш за все, перевірте, чи налаштовано Chrome завжди відкривати вікно &quot;Змінити особу / Переглядати як гостя&quot;. Для цього: </p> <p> 1. Закрийте Google Chrome. <br> 2. Клацніть правою кнопкою миші ярлик Chrome на робочому столі та виберіть <strong> Властивості </strong> . <br> 3. В <strong> Ярлик </strong> вкладку, подивіться на <strong> Цільова </strong> текстове поле та (якщо є) <strong> видалити </strong> вищезазначені текстові записи в кінці, а потім клацніть <strong> гаразд </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-27-916.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Запустіть Chrome і у вікні «Змінити особу» клацніть на піктограму / зображення вашого профілю («Ви»). <br> 5. <strong> Перезапустіть </strong> Chrome. </p> <p> </p> <h6> Спосіб 2. Створіть новий чистий профіль Google Chrome. </h6> <p> За замовчуванням Chrome зберігає всі налаштування профілю (закладки, паролі, розширення тощо) у папці &quot;Дані користувача&quot; у такому місці на вашому комп’ютері: </p> <ul> <li><strong> C: \\ Users \\% Ім&#39;я користувача% \\ AppData \\ Local \\ Google \\ Chrome \\ Дані користувача </strong></li> </ul> <p> Якщо з якихось причин папка профілю Chrome пошкоджена або неналежним чином модифікована шкідливим програмним забезпеченням, найкращим варіантом, який ви маєте, є примусити Chrome повторно створити нову (порожню *) папку профілю Chrome. Для цього: </p> <p><strong> * Увага: </strong> Майте на увазі, що, видаливши папку для зберігання профілю Chrome, ви видаляєте всі збережені дані (Закладки, Налаштування, Розширення, Історія тощо). Тому перед видаленням свого профілю Chrome візьміть <a href=\"https://www.repairwin.com/backup-restore-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> резервне копіювання ваших закладок Chrome </a> на випадок, якщо ви захочете знову встановити Chrome. </p> <h5> Крок 1: Увімкніть перегляд прихованих файлів і папок. </h5> <p> 1. Відкрити <strong> Параметри папки </strong> . <br> 2. В <strong> Переглянути </strong> вкладка, <strong> перевірити </strong> <strong> Показати приховані файли, папки та диски </strong> і натисніть <strong> ГАРАЗД. </strong></p> <p><img src=\"images/image_thumb-6-189.png\" alt=\"enable hidden files folders\" loading=\"lazy\"></p> <h6></h6> <h5> Крок 2. Примусити Chrome створити нову (чисту) папку профілю. </h5> <p> 1. <strong> Закрити </strong> Гугл хром. <br> 2. <strong> відчинено </strong> Провідник Windows і перейдіть до цього місця: </p> <ul> <li><strong> C: \\ Users \\% USERNAME% \\ AppData \\ Local \\ Google \\ Chrome \\ </strong></li> </ul> <p> * Де% USERNAME% = Ваше ім&#39;я користувача. (наприклад, якщо ваше ім&#39;я користувача &quot;Адміністратор&quot;, вам доведеться перейти до цього шляху: &quot;C: \\ Users \\ Admin \\ AppData \\ Local \\ Google \\ Chrome&quot;) </p> <p> 3. <strong> Перейменувати </strong> папку &quot;Дані користувача&quot; до &quot;Дані користувача.BAK&quot;. </p> <p><img src=\"images/image_thumb-28-373.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Тепер відкрийте Google Chrome. (Під час запуску Chrome автоматично створить нову чисту папку &quot;Дані користувача&quot; для зберігання ваших закладок та налаштувань). </p> <p> </p> <h6> Додаткові методи вирішення проблем Chrome. </h6> <p><strong> 1. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Перевірте свій комп’ютер на наявність вірусів, зловмисного програмного забезпечення тощо. </a></p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Повністю видаліть і перевстановіть Chrome. </a></p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}