{"title":"ВИПРАВЛЕННЯ: Не вдалося (вирішено) довірчих відносин між цією робочою станцією та основним доменом","content":"<p> Якщо під час спроби ввійти у свій домен або під час спроби отримати доступ до спільної папки на іншій машині в домені, з’являється повідомлення про помилку &quot;Зв&#39;язок довіри між цією робочою станцією та основним доменом&quot;, продовжте читання нижче, щоб вирішити проблему. </p> <p> Помилка &quot;Довірчі відносини між робочою станцією та основним доменом не вдалося&quot; може з&#39;явитися з таких причин: </p> <ul> <li> Комп’ютер має те саме ім’я, що й інший комп’ютер у Домені. </li> <li> Повноваження домену (ім’я користувача чи пароль) недійсні. </li> <li> Термін дії облікового запису комп’ютера закінчився. * </li> </ul> <p> * Примітка: Деякі організації попередньо збирають комп’ютери (або комп’ютерні клони) для подальшого використання. Якщо термін дії облікового запису комп’ютера закінчився, він більше не зможе автентифікуватися в домені. У таких випадках комп’ютери, які не можуть пройти автентифікацію в домені, повинні бути видалені з домену та знову приєднані до нього. (крок-4) </p> <p><img src=\"images/image_thumb-32-740.png\" alt=\"FIX: Trust Relationship Between this Workstation and the Primary Domain Failed \" loading=\"lazy\"></p> <h4> Як виправити: Помилка довірчих відносин між робочою станцією та доменом. </h4> <h6> Спосіб 1. Перевірте правильність облікових даних домену. </h6> <p> Перш за все переконайтесь, що дані облікового запису правильні, а особливо пароль. якщо ви клонували машину з комп&#39;ютерного зображення, зробленого в минулому, і з тих пір код змінився. </p> <h6> Спосіб 2. Перевірте наявність дублікатів назв комп’ютерів. </h6> <p> Переконайтесь, що ім’я комп’ютера є унікальним і в мережі немає іншого комп’ютера з таким іменем. </p> <h6> Спосіб 3. Перевірте наявність повторюваних IP-адрес. </h6> <p> Переконайтесь, що IP-адреса комп’ютера є унікальною та не суперечить іншій IP-адресі в мережі. </p> <h6> Спосіб 4. Вилучіть і знову приєднайте комп’ютер у домені. </h6> <p> Звичайним методом виправлення довірчих відносин між комп’ютером та доменом є видалення та повторне додавання ураженого комп’ютера до домену. </p> <h5> Крок 1. Видаліть обліковий запис комп’ютера з домену. </h5> <p> 1. Увійдіть на сервер Active Directory. <br> 2. Відкрити <strong> Користувачі та комп&#39;ютери Active Directory. <br> </strong> 3. Розгорніть <strong> Комп’ютери </strong> контейнер. <br> 4. Клацніть правою кнопкою миші на ураженому комп&#39;ютері та виберіть <strong> Видалити. </strong></p> <p><img src=\"images/image_thumb-39-366.png\" alt=\"Delete Computer Account from Domain\" loading=\"lazy\"></p> <h5> Крок 1. Вилучіть і повторно приєднайтесь до комп’ютера в домені. </h5> <p> 1. Увійдіть на уражений комп’ютер за допомогою облікового запису LOCAL Administrator (ім’я комп’ютера \\ адміністратор). </p> <p> 2. Натисніть Windows <img src=\"images/image_thumb8_thumb-480.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> Р </strong> клавіші, щоб відкрити поле команди запуску. </p> <p> 2а. Тип <strong> sysdm.cpl </strong> &amp; натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb7_thumb-169.png\" alt=\"system properties\" loading=\"lazy\"></p> <p> 3. На вкладці &quot;Назва комп&#39;ютера&quot; натисніть <strong> Зміна </strong> . </p> <p><img src=\"images/image_thumb-37-924.png\" alt=\"Remove Computer from Domain\" loading=\"lazy\"></p> <p> 4. У розділі Член, виберіть <strong> Робоча група </strong> , введіть назву робочої групи (наприклад, &quot;WORKGROUP&quot;) і натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb-34-169.png\" alt=\"Change Computer Name - Membership\" loading=\"lazy\"></p> <p> 5. Введіть облікові дані адміністратора та натисніть <strong> гаразд </strong> . <br> 6. <strong> Перезапустіть </strong> комп&#39;ютер. </p> <p> 7. Виконайте кроки 1-4 ще раз, але цього разу, на кроці 4, виберіть <strong> Домен, </strong> введіть доменне ім&#39;я та натисніть <strong> ГАРАЗД. </strong></p> <p><img src=\"images/image_thumb-38-928.png\" alt=\"Add computer to domain\" loading=\"lazy\"></p> <p> 8. Введіть облікові дані адміністратора домену та натисніть <strong> гаразд </strong> . <br> 9. <strong> Перезапустіть </strong> ПК та увійдіть у домен за допомогою облікового запису користувача домену. </p> <h6> Спосіб 5. Скиньте обліковий запис комп’ютера в домені. </h6> <p> 1. Увійдіть на сервер Active Directory. <br> 2. Відкрити <strong> Користувачі та комп&#39;ютери Active Directory. <br> </strong> 3. Розгорніть <strong> Комп’ютери </strong> контейнер. <br> 4. Клацніть правою кнопкою миші на ураженому комп&#39;ютері та виберіть <strong> Скинути рахунок. </strong></p> <p><img src=\"images/image_thumb-36-935.png\" alt=\"Reset Computer Account in Domain\" loading=\"lazy\"></p> <p> 5. Нарешті, <strong> перезапустити </strong> <strong> постраждала машина </strong> та увійдіть у домен. </p> <p> Це все, шановні! Який метод працював у вас? Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}