{"title":"ВИПРАВЛЕННЯ: Помилка DISM 1016 Під час спроби отримати доступ до зображення сталася помилка (вирішено)","content":"<p> Цей підручник містить інструкції щодо усунення такої помилки під час запуску команди DISM у Windows 10: &quot;Помилка 1016: сталася помилка під час спроби отримати доступ до зображення&quot;. Помилка DISM 1016 може з&#39;явитися під час спроби відновити пошкоджений образ Windows за допомогою однієї з таких команд DISM у командному рядку Windows 10: </p> <ul> <li> Dism / Online / Cleanup-Image / Restorehealth </li> <li> Dism / Online / Cleanup-image / Restorehealth /source:wim:X:\\sources\\install.wim:1 / LimitAccess </li> </ul> <p> … Або при використанні команди DISM у середовищі відновлення Windows (WinRE) </p> <ul> <li> Dism.exe / Зображення: X: \\ / Cleanup-Image / Restorehealth </li> </ul> <p> </p> <h4> Як виправити помилку DISM 1016: Під час спроби отримати доступ до зображення сталася помилка. </h4> <p><strong> Вимоги </strong> : Щоб усунути проблеми, згадані в цій статті, дотримуючись наведених нижче способів, вам потрібно буде завантажити комп’ютер із інсталяційного носія Windows (USB або DVD). Якщо ви не володієте інсталяційним носієм Windows, ви можете створити його за допомогою <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Інструмент створення медіа Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Як створити інсталяційний носій Windows 10 USB. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Як створити інсталяційний носій DVD для Windows 10. </a></li> </ul> <p> </p> <h6> Спосіб 1. Відновіть Windows 10, як це було до встановлення оновлень. </h6> <p> Помилка DISM 1016 зазвичай з’являється після невдалого встановлення Windows Update. Отже, перш за все скасуйте установку оновлень. Для цього: </p> <p> 1. Завантажте систему з інсталяційного носія Windows. <br> 2. На екрані нижче натисніть <strong> SHIFT </strong> + <strong> F10 </strong> клавіші для запуску командного рядка. (або натисніть <strong> Далі </strong> і перейти до <strong> Відремонтувати мій комп&#39;ютер </strong> &gt; <strong> Усунення несправностей </strong> &gt; <strong> Командний рядок </strong> ). </p> <p><img src=\"images/image_thumb17_thumb-172.png\" alt=\"FIX DISM Error 1016: An error occurred while attempting to access the image\" loading=\"lazy\"></p> <p> </p> <p> 3. У командному рядку отримайте список усіх дисків у вашій системі за допомогою цієї команди: </p> <ul> <li><strong> wmic логічний диск отримує ім&#39;я - </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-327.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> 4. Потім з’ясуйте, на якому диску міститься папка «Windows», набравши цю команду: * </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * напр. Щоб переглянути вміст диска C:, введіть: &quot; <strong> реж. C: </strong> &quot;(без лапок). Якщо ви не можете побачити папку&quot; Windows &quot;на диску C:, перейдіть до наступної букви диска (наприклад,&quot; dir D: &quot;,&quot; dir E: &quot;тощо), поки не побачите Папка &quot;Windows&quot; на одному з перелічених дисків (з наведеної вище команди). </p> <p> [Як ви можете бачити на знімку екрана нижче, папка Windows (у цьому випадку) знаходиться на диску D:]. </p> <p> </p> <p><img src=\"images/image_thumb13_thumb-1-454.png\" alt=\"image_thumb[13]\" loading=\"lazy\"></p> <p> </p> <p> 5. Коли ви знайдете, на якому диску знаходиться диск &quot;Windows&quot; (наприклад, на диску &quot;D:&quot; у цьому прикладі), перейдіть до цього диска, набравши DriveLetter <strong> : </strong> + <strong> Введіть </strong> . </p> <p> 6. Потім створіть скретч-папку на диску, набравши цю команду: </p> <ul> <li><strong> mkdir D: \\ Скретч </strong></li> </ul> <p><img src=\"images/image_thumb7_thumb-1-575.png\" alt=\"image_thumb[7]\" loading=\"lazy\"></p> <p> </p> <p> 7. Потім дайте наведену нижче команду для відкоту вашої системи після невдалого оновлення: </p> <ul> <li><strong> DISM / Image: D: \\ / ScratchDir: D: \\ Scratch / Cleanup-Image / RevertPendingActions </strong></li> </ul> <p> * Примітка: Змініть букву диска <strong> D </strong> відповідно до вашого випадку. </p> <p> 8. Після того, як вищезазначену команду DISM буде виконано, ви отримаєте таке повідомлення на екрані: </p> <p><em> &quot;Повернення очікуваних дій із зображення…. <br> Операція завершена. Буде здійснено спробу відновлення всіх очікуваних дій після перезавантаження <br> Операція завершена успішно &quot;. </em></p> <p><img src=\"images/image_thumb11_thumb-753.png\" alt=\"image_thumb[11]\" loading=\"lazy\"></p> <p> </p> <p> 9. <strong> Закрити </strong> командний рядок і <strong> перезапустити </strong> комп&#39;ютера. * </p> <p> 10. Якщо Windows завантажується нормально, перейдіть до роботи. Якщо Windows не завантажується і намагається знову встановити оновлення, то: </p> <blockquote><p> 1. Вимкніть ваш ПК. <br> 2. Повторно запустіть комп&#39;ютер із інсталяційного носія Windows. <br> 3. Запустіть командний рядок. <br> 4. У командному рядку введіть наступні команди по порядку (не забудьте змінити букву диска <strong> D </strong> відповідно до вашого випадку): </p></blockquote> <ul> <li> <ul> <li> del D: \\ Windows \\ SoftwareDistribution </li> <li> del D: \\ Windows \\ WinSxS \\ cleanup.xml </li> <li> del D: \\ Windows \\ WinSxS \\ pending.xml </li> </ul> </li> </ul> <blockquote><p> 5. Закінчивши, закрийте командний рядок та <strong> перезапустити </strong> ПК. * </p></blockquote> <p> * Примітка: Якщо завантаження знову не вдається, тоді завантаження знову виконується в командному рядку WinRE і дайте такі команди (не забудьте змінити букву диска <strong> D </strong> відповідно до вашого випадку): </p> <ul> <li> chkdsk / f D: </li> <li> sfc / scannow / offbootdir = D: \\ / offwindir = D: \\ windows </li> <li> dism / image: D: \\ / cleanup-image / restorehealth </li> </ul> <p> </p> <h6> Спосіб 2. Відновлення реєстру Windows із резервної копії. </h6> <p> Наступним методом виправлення помилки dism 1016 (під час спроби отримати доступ до зображення сталася помилка) є відновлення реєстру Windows із папки &#39;RegBack&#39;. * </p> <p> * Інформація: Папка &#39;RegBack&#39; (повний шлях = Windows \\ System32 \\ Config \\ RegBack) - це місце, де Windows автоматично зберігає резервну копію файлів реєстру при кожному запуску машини. </p> <p> Щоб відновити реєстр із папки RegBack: </p> <p> 1. Завантажте систему з інсталяційного носія Windows, а потім виконайте кроки 1-5 із методу-1 вище, щоб перейти до диска Windows. (наприклад, &quot;D:&quot; у цьому прикладі). </p> <p> 2. Перш за все, зробіть резервну копію поточних файлів реєстру, виконавши наступні команди по порядку. (Натисніть <strong> Введіть </strong> після введення кожної команди): </p> <ul> <li><strong> cd \\ windows \\ system32 \\ config </strong></li> <li><strong> md Резервне копіювання </strong></li> <li><strong> копія *. * Резервне копіювання </strong></li> </ul> <p><img src=\"images/image_thumb-26-867.png\" alt=\"infinite Automatic Repair loop windows 10 fix\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Тепер перейдіть до <strong> RegBack </strong> папку, давши цю команду: </p> <ul> <li><strong> cd RegBack </strong></li> </ul> <p> 4. Потім наберіть <strong> ДИР </strong> (для перегляду вмісту папки RegBack). </p> <p> 5. Тепер перевірте, чи є в будь-якому із перелічених файлів <strong> 0</strong> (нульові) байти у розмірі їх файлу, і перейдіть нижче відповідно до вашого випадку: </p> <ul> <li><strong> Справа А. </strong> Якщо будь-який із перелічених файлів має 0 (нульових) байтів, тоді <strong> Зупинись тут </strong> , і <strong> перейти до наступного методу </strong> , оскільки файли резервних копій реєстру марні або пошкоджені. </li> <li><strong> Справа Б. </strong> Якщо всі перелічені файли мають розмір, відмінний від нуля (як на знімку екрана нижче), перейдіть до наступного кроку. </li> </ul> <p><img src=\"images/image_thumb-27-314.png\" alt=\"restore registry from backup\" loading=\"lazy\"></p> <p> </p> <p> 6. Скопіюйте файли реєстру з <strong> Windows \\ System32 \\ Config \\ RegBack </strong> папку до <strong> Windows \\ System32 \\ Config \\ </strong> , вказавши цю команду: </p> <p> </p> <ul> <li><strong> скопіювати *. * .. </strong></li> </ul> <p> 7. Коли з&#39;явиться відповідний запит, натисніть <strong> A </strong> перезаписати цільові файли після команди копіювання. </p> <p><img src=\"images/image_thumb-28-604.png\" alt=\"fix startup repair loop\" loading=\"lazy\"></p> <p> </p> <p> 8. Після завершення копіювання введіть <strong> вихід </strong> і натисніть <strong> Введіть </strong> щоб закрити командний рядок. <br> 9. <strong> Перезапустіть </strong> комп’ютера та спробуйте завантажитись у Windows. </p> <p> * Примітка: Якщо Windows не вдається завантажитися знову, тоді завантаження повторюється за допомогою командного рядка WinRE і вводить такі команди (не забудьте змінити букву диска <strong> D </strong> відповідно до вашого випадку): </p> <ul> <li> chkdsk / f D: </li> <li> sfc / scannow / offbootdir = D: \\ / offwindir = D: \\ windows </li> <li> dism / image: D: \\ / cleanup-image / restorehealth </li> </ul> <p> </p> <h6> Спосіб 3. Відновлення Windows 10 до попереднього робочого стану. </h6> <p> Наступним методом усунення помилки DISM 1016 є відновлення системи до попереднього робочого стану. Для цього: </p> <p> 1. Завантажте систему з інсталяційного носія Windows. <br> 2. На екрані нижче натисніть <strong> Далі </strong> а потім клацніть <strong> Відремонтуйте свій комп’ютер </strong> &gt; <strong> Усунення несправностей. </strong></p> <p><img src=\"images/image_thumb20_thumb-815.png\" alt=\"image_thumb[20]\" loading=\"lazy\"></p> <p> </p> <p> 3. В <strong> Розширені опції </strong> натисніть <strong> Відновлення системи. * </strong></p> <p> * Примітка. Якщо <strong> Поверніться до попередньої збірки </strong> варіант, доступний на цьому екрані, потім виберіть цей варіант. </p> <p><img src=\"images/image_thumb28_thumb-863.png\" alt=\"image_thumb[28]\" loading=\"lazy\"></p> <p> </p> <p> 4. На наступному екрані натисніть свою операційну систему. </p> <p><img src=\"images/image_thumb29_thumb-664.png\" alt=\"image_thumb[29]\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 5. Потім у Майстрі відновлення системи натисніть <strong> Далі </strong> а потім виберіть попередній робочий стан (Дата / час) і натисніть <strong> Далі </strong> щоб розпочати процес відновлення. </p> <p><img src=\"images/image_thumb-50-619.png\" alt=\"system restore windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Спосіб 4. Відновлення Windows 10. </h6> <p> Останнім методом усунення помилки 1016 у DISM є <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> відновити Windows 10 за допомогою оновлення на місці </a> або для резервного копіювання файлів, а потім у <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> чиста інсталяція Windows 10 </a> . </p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}