{"title":"ВИПРАВЛЕННЯ: Помилка активації 0x80072EE7 у Windows 10. (Вирішено)","content":"<p> Якщо під час спроби активувати Windows 10 з’являється помилка активації 0x80072EE7, продовжуйте читати цей посібник, щоб вирішити проблему. Помилка активації &quot; <em> Ми не можемо активувати Windows на цьому пристрої, оскільки наші сервери активації зараз недоступні. Переконайтеся, що ви підключені до Інтернету, і ми автоматично спробуємо активувати Windows, коли послуга стане доступною &quot;з кодом помилки: 0x80072EE7, </em> зазвичай з’являється через проблеми з мережею. </p> <p><img src=\"images/image_thumb-5-942.png\" alt=\"FIX: We can’t activate Windows on this device - Error 0x80072EE7\" loading=\"lazy\"></p> <p> Цей підручник містить інструкції щодо виправлення помилки активації Windows 10 0x80072EE7: &quot;Ми не можемо активувати Windows на цьому пристрої, оскільки наші сервери активації зараз недоступні&quot;. </p> <h4> Як усунути помилку активації Windows 10 0x80072EE7 </h4> <h6> Крок 1. Переконайтеся, що ви підключені до Інтернету. </h6> <p> Якщо ви не можете активувати Windows 10 через помилку 0x80072EE7, перш за все, перевірте підключення до Інтернету. Для цього відкрийте свій Інтернет-браузер і відвідайте будь-який веб-сайт, щоб переконатися, що ваше Інтернет-з’єднання працює. </p> <p> </p> <h6> Крок 2. Використовуйте дійсний ключ продукту для Windows 10. </h6> <p> Помилка активації Windows 10 0x80072EE7 може з’явитися, якщо встановлений ключ продукту недійсний. Отже, переконайтеся, що ви використовуєте дійсний та законний ліцензійний ключ для активації Windows 10. Ліцензійний ключ повинен стосуватися встановленої версії Windows 10 (наприклад, Home або Pro) і повинен бути введений правильно. </p> <p> Щоб змінити ключ продукту Windows 10, перейдіть на <strong> Налаштування </strong> &gt; <strong> Оновлення та безпека </strong> &gt; <strong> Активація </strong> і натисніть <strong> Змінити ключ продукту </strong> . </p> <p><img src=\"images/image_thumb-6-424.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Крок 3. Змініть налаштування DNS </h6> <p> 1. <strong> Клацніть правою кнопкою миші </strong> на <strong> Мережа </strong> значок <img src=\"images/image_thumb-42-792.png\" alt=\"image\" loading=\"lazy\"> на панелі завдань і натисніть <strong> Відкрийте Центр мереж і спільного доступу. </strong> * </p> <p><img src=\"images/image_thumb-104-479.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Виберіть <strong> Ethernet </strong> (або Wi-Fi) ліворуч, а потім у розділі &quot;Пов’язані налаштування&quot; натисніть <strong> Змініть параметри адаптера </strong> . </p> <p><img src=\"images/image_thumb-43-166.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> 3. Клацніть правою кнопкою миші активний мережевий адаптер (Ethernet або Wi-Fi) і виберіть <strong> Властивості </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-44-500.png\" alt=\"network properties\" loading=\"lazy\"></p> <p> 4. Виберіть <strong> &#39;Інтернет-протокол версії 4 (TCP / IPv4) </strong> &#39;і натисніть <strong> Властивості </strong></p> <p><img src=\"images/image_thumb-106-472.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> 5. Властивості протоколу Інтернету версії 4 (TCP / IPv4): </p> <blockquote><p> a. <strong> Перевірте </strong> <strong> Використовуйте такі адреси DNS-серверів: </strong> радіо-кнопка. <br> b. Потім введіть такі адреси DNS-серверів (загальнодоступні DNS-сервери Google) і натисніть <strong> ГАРАЗД. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> </blockquote> <p><img src=\"images/image_thumb-109-991.png\" alt=\"google dns settings\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Перезапустіть </strong> комп&#39;ютера. </p> <p> </p> <p> Це все, шановні! Вам це вдалося? Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}