{"title":"ВИПРАВЛЕННЯ: Вже встановлено нову версію Adobe Acrobat Reader DC - Помилка 1722 (вирішено)","content":"<p> На комп’ютері під керуванням Windows виникла така проблема: Adobe Acrobat Reader DC не вдається інсталювати, оскільки „Нову версію вже встановлено”. Дивно, що ця проблема полягає в тому, що Adobe Reader DC не було встановлено на машині, оскільки не існує жодних слідів програми або файлів Adobe Reader ні на додаванні / видаленні програм, ні на жорсткому диску. </p> <p><img src=\"images/image_thumb-19-522.png\" alt=\"Adobe Acrobat Reader DC Newer Version already installed – Error 1722 - fix\" loading=\"lazy\"></p> <p> </p> <p> Крім того, під час вирішення проблеми встановлення програми &quot;Нова версія вже встановлена&quot; програми Adobe Reader DC, з&#39;явилося таке повідомлення про помилку під час спроби встановити програму за допомогою <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Пакет розповсюдження Adobe Acrobat Reader DC </a> : &quot;Помилка 1722. Виникла проблема з цим пакетом інсталятора Windows. Запуск програми в рамках інсталяції не завершився належним чином. Зверніться до персоналу служби підтримки або постачальника пакета ...&quot; </p> <p><img src=\"images/image_thumb-20-398.png\" alt=\"Acrobat reader Error 1722 There is a problem with this Windows Installer package\" loading=\"lazy\"></p> <p> </p> <p> Цей посібник містить докладні кроки та інструкції щодо усунення таких помилок під час встановлення Adobe Reader DC: &quot;Вже встановлена ​​нова версія&quot; та &quot;Помилка 1722. У цій системі Windows 10/8/7 існує проблема з цим пакетом інсталятора Windows&quot; </p> <h4> Як виправити проблеми з установкою Adobe Acrobat Reader DC: Встановлено нову версію - Помилка 1722 Проблема з інсталяційним пакетом. </h4> <h6> Спосіб 1. Видаліть продукти Adobe Acrobat за допомогою Acrobat Cleaner Tool. </h6> <p> Першим кроком для вирішення проблем встановлення Adobe Reader DC є видалення всіх попередніх установок Adobe Acrobat та Adobe Reader за допомогою <a href=\"https://labs.adobe.com/downloads/acrobatcleaner.html\" target=\"_blank\" rel=\"nofollow noopener\"> Утиліта Acrobat Reader DC та Adobe Acrobat DC Cleanup </a> * а потім встановити <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> Adobe Reader DC </a> . </p> <p> * Інструмент Adobe Reader та Acrobat Cleaner призначений для очищення пошкоджених інсталяцій Adobe Acrobat &amp; Adobe Reader, включаючи видалення або виправлення пошкоджених файлів, видалення або зміну записів реєстру дозволів тощо. </p> <p><img src=\"images/image_thumb-21-370.png\" alt=\"Acrobat Reader DC & Adobe Acrobat DC Cleanup tool\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Спосіб 2. Запустіть засіб вирішення проблем із встановленням та видаленням програм Microsoft. </h6> <p> 1. Завантажте файл <a href=\"https://support.microsoft.com/en-us/help/17588/fix-problems-that-block-programs-from-being-installed-or-removed\" target=\"_blank\" rel=\"nofollow noopener\"> Засіб вирішення проблем із встановленням та видаленням програми </a> від Microsoft. <br> 2. Запустіть завантажену програму та клацніть далі на першому екрані. <br> 3. За запитом клацніть <strong> Видалення </strong></p> <p><img src=\"images/image_thumb-22-965.png\" alt=\"Program Install & Uninstall Troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 4. Виберіть <strong> Adobe Acrobat Reader DC </strong> програму та виберіть <strong> Далі </strong> . * Потім дотримуйтесь вказівок на екрані, щоб усунути проблему. </p> <p> * Примітка: Якщо ви не бачите у списку &quot;Adobe Acrobat Reader DC&quot;, натисніть <strong> Скасувати </strong> і знову запустіть засіб усунення несправностей. Але цього разу виберіть &quot;Встановлення&quot;, коли буде запропоновано. </p> <p><img src=\"images/image_thumb-23-917.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Спосіб 3. Встановіть Adobe Reader, використовуючи повний пакет інсталятора Acrobat Reader DC. </h6> <p> Спробуйте встановити Adobe Reader DC за допомогою <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Пакет розповсюдження Adobe Acrobat Reader DC </a> . </p> <p> </p> <h6> Спосіб 4. Запустіть службу інсталяції Windows. </h6> <p> 1. Відкрийте панель керування Служб Windows: Для цього: </p> <ul> <li> Натисніть Windows <img src=\"images/image_thumb8_thumb_thumb-698.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> Р. </strong> клавіші, щоб відкрити поле команди запуску. </li> <li> У полі пошуку введіть: <strong> services.msc </strong> &amp; натисніть <strong> гаразд </strong> . </li> <li> (Прийміть попередження UAC, якщо воно з’явиться). </li> </ul> <p><img src=\"images/image_thumb-12-635.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. На панелі керування Службами клацніть правою кнопкою миші на <strong> Інсталятор Windows s </strong> і натисніть <strong> Почніть </strong> . * </p> <p> * Примітка: Якщо послугу запущено, натисніть <strong> Перезапустіть </strong> . </p> <p><img src=\"images/image_thumb-24-258.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Спосіб 5. Перереєструйте службу інсталятора Windows. </h6> <p> 1. Відкрити <strong> Командний рядок як адміністратор. <br> </strong> 2. Введіть наступні команди по порядку (натисніть клавішу Enter після введення кожної команди) </p> <ul> <li><strong> msiexec / скасувати реєстрацію </strong></li> <li><strong> msiexec / regserver </strong></li> </ul> <p><img src=\"images/image_thumb-25-162.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Закрийте вікно командного рядка та <strong> перезапустити </strong> комп&#39;ютера. <br> 4. Спробуйте встановити Acrobat Reader DC. </p> <p> </p> <h6> Спосіб 6. Встановіть оновлення Windows та Visual C ++. </h6> <p> 1. Встановіть усі доступні оновлення Windows. <br> 2. Встановіть обидві версії x86 і x64 <a href=\"https://www.microsoft.com/en-in/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Пакети для розповсюдження Visual C ++ для Visual Studio 2013 </a><br> 3. Встановіть обидві версії x86 і x64 <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48145\" target=\"_blank\" rel=\"nofollow noopener\"> Пакети для розповсюдження Visual C ++ для Visual Studio 2015 </a><br> 4. Спробуйте встановити Acrobat Reader DC. </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}