{"title":"ВИПРАВЛЕННЯ: Adobe Reader DC - Зберегти як порожній (вирішено)","content":"<p> Після автоматичного оновлення Adobe Reader DC виникла така проблема: Функція &quot;Зберегти як&quot; відображає порожнє (порожнє) вікно (порожнє), яке не дозволяє користувачеві зберігати PDF-документ. </p> <p><img src=\"images/image_thumb-38-290.png\" alt=\"Adobe Reader DC - Save As is blank - fix\" loading=\"lazy\"></p> <p> Цей посібник містить вказівки щодо вирішення наступної проблеми: Функція &quot;Зберегти як&quot; не працює в Adobe Reader DC в ОС Windows або MAC. </p> <h4> Як ВИПРАВИТИ: Зберегти як порожньо в Adobe Reader DC. </h4> <h6> Спосіб 1. Скануйте свою систему на наявність вірусів та шкідливих програм. </h6> <p> Першим кроком для вирішення проблеми &quot;відсутніх папок&quot; в Outlook є переконання, що у вашій системі немає вірусів та шкідливих програм. Для цього завдання дотримуйтесь інструкцій у цьому посібнику: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Як сканувати комп’ютер на наявність вірусів та інших шкідливих програм. </a></p> <p> </p> <h6> Спосіб 2. Вимкніть Інтернет-сховище під час збереження файлів. </h6> <p> 1. З Adobe Reader DC <strong> Редагувати </strong> натисніть меню <strong> Преференції </strong> . </p> <p><img src=\"images/image_thumb-39-749.png\" alt=\"save as not working fix in Adobe Reader DC\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Зніміть прапорець </strong> <strong> Показати мережеве сховище під час збереження файлів </strong> і натисніть <strong> ГАРАЗД. * </strong></p> <p> * Примітка: За бажанням, зніміть також прапорець біля опції &quot;Показати пам’ять в Інтернеті під час відкриття файлів&quot;. </p> <p><img src=\"images/image_thumb-40-312.png\" alt=\"save as blank - abobe reader DC - fix\" loading=\"lazy\"></p> <p> </p> <p> 3. Тепер спробуйте використати функцію Зберегти як у Adobe DC. Проблема повинна бути вирішена. </p> <p> </p> <h6> Спосіб 3. Видаліть та переінсталюйте Adobe Reader DC. </h6> <p> Останнім методом вирішення порожніх вікон у функції «Зберегти як» в Adobe DC є повне видалення Adobe Reader DC, а потім завантаження та повторна інсталяція останньої версії програми з <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> тут </a> . </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це. </p>"}