{"title":"ВИПРАВЛЕННЯ: Повторювані імена користувачів на екрані входу після оновлення Windows 10.","content":"<p> Цей підручник містить кілька методів, щоб вирішити проблему з дублікатами імен користувачів на екрані входу після оновлення Windows 10. Проблема &quot;Повторювані імена користувачів на екрані входу&quot; повідомляється багатьма користувачами та спричинена після встановлення оновлень у Windows 10. </p> <p><img src=\"images/image_thumb-44-494.png\" alt=\"FIX: Duplicate User Names in Sign-in Screen Windows 10\" loading=\"lazy\"></p> <p> Проблема в деталях: Після перейменування комп’ютера або після встановлення оновлень у Windows 10 система автоматично не входить у ваш обліковий запис користувача з помилкою «ім’я користувача або пароль неправильні. Спробуйте ще раз», і одночасно з’явиться ім’я двічі на екрані входу. </p> <h4> Як виправити: Екран входу в систему Windows 10 двічі відображає одного і того ж користувача. </h4> <h6> Спосіб 1. Вилучіть повторюваний обліковий запис із опцій облікового запису користувача. </h6> <p> Першим методом видалення дублікатів імен користувачів з екрана входу є видалення дубліката облікового запису з ПК. </p> <p> 1. Натисніть Windows <img src=\"images/image_thumb8_thumb_thumb-923.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> Р </strong> клавіші, щоб відкрити поле команди запуску. <br> 2. У полі &quot;Відкрити&quot; введіть: <strong> керувати паролями користувачів2 </strong> &amp; натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb-29-663.png\" alt=\"control userpasswords2 \" loading=\"lazy\"></p> <p> 3. У розділі Облікові записи користувачів виконайте такі дії відповідно до вашого випадку: </p> <ul> <li><strong> Справа А. </strong> Якщо ви бачите два облікові записи з однаковим іменем користувача: </li> </ul> <blockquote><p> a. Виберіть додатковий рахунок і натисніть <strong> Видалити </strong> . <br> b. Клацніть <strong> гаразд </strong> і <strong> перезапустити </strong> ПК. <br> c. Якщо після перезапуску ви все ще бачите своє ім&#39;я користувача двічі на екрані входу, перейдіть до способу 2. </p></blockquote> <p><img src=\"images/image_thumb-37-605.png\" alt=\"User Accounts Options\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Справа Б. </strong> Якщо ви бачите лише один рахунок: </li> </ul> <blockquote><p> a. Виберіть обліковий запис і натисніть <strong> Властивості </strong> . <br> b. Скопіюйте Повне ім&#39;я та вставте його в поле Ім&#39;я користувача для відповідності. * <br> c. Клацніть <strong> гаразд </strong> і <strong> перезапустити </strong> ПК. </p></blockquote> <p> * Примітка: Якщо ім’я користувача та повне ім’я вже збігаються, перейдіть до способу 2. </p> <p><img src=\"images/image_thumb-38-262.png\" alt=\"Remove Duplicate User Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Спосіб 2. Вимкніть вимогу до пароля під час входу. </h6> <p> 1. Виконайте кроки 1 та 2 з попереднього методу, щоб відкрити опції &quot;Облікові записи користувачів&quot;. <br> 2. <strong> Зніміть прапорець </strong> <strong> Користувач повинен ввести ім&#39;я користувача та пароль, щоб використовувати цей комп&#39;ютер </strong> і натисніть <strong> Подати заявку </strong></p> <p><img src=\"images/image_thumb-42-373.png\" alt=\"User must enter a user name and password to use this computer \" loading=\"lazy\"></p> <p> </p> <p> 3. Введіть свій пароль (двічі) і натисніть <strong> гаразд </strong> двічі, щоб закрити всі вікна. </p> <p><img src=\"images/image_thumb-43-970.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. <strong> Перезавантажте </strong> комп&#39;ютера. Якщо ваше ім’я користувача з’являється двічі, перейдіть до наступного способу. </p> <h6></h6> <h6> Спосіб 3. Змініть параметри входу. </h6> <p> </p> <p> 1. З початку <img src=\"images/image_thumb-39-183.png\" alt=\"image\" loading=\"lazy\"> меню, відкрити <strong> Налаштування </strong> <img src=\"images/image_thumb-50-520.png\" alt=\"image\" loading=\"lazy\"> а потім клацніть <strong> Рахунки </strong> . </p> <p><img src=\"images/image_thumb-43-892.png\" alt=\"How to Add a New User in Windows 10, 8.1.\" loading=\"lazy\"></p> <p> </p> <p> 2. Виберіть <strong> Параметри входу </strong> на лівій панелі та <strong> вимкнути </strong> <strong> Використовуйте мою інформацію для входу, щоб автоматично завершити налаштування мого пристрою та знову відкрити мої програми після оновлення або перезапуску </strong> . </p> <p><img src=\"images/image_thumb-40-207.png\" alt=\"Modify Sign in Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Перезапустіть </strong> ПК. </p> <p> </p> <h6> Спосіб 4. Перехід на місцевий рахунок. </h6> <p> Останнім методом вирішення проблеми &quot;дублювання імен користувачів&quot; є використання локального облікового запису для входу в Windows 10. Для цього: </p> <p> 1. З початку <img src=\"images/image_thumb-41-454.png\" alt=\"image\" loading=\"lazy\"> меню, відкрити <strong> Налаштування </strong> <img src=\"images/image_thumb-50-790.png\" alt=\"image\" loading=\"lazy\"> а потім клацніть <strong> Рахунки </strong> . <br> 2. Клацніть <strong> Електронна пошта та облікові записи </strong> на лівій панелі. <br> 3. Наступний клік <strong> Натомість увійдіть за допомогою локального облікового запису. </strong></p> <p> </p> <p><img src=\"images/image_thumb-37-653.png\" alt=\"sign-in with a local account instead windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Введіть пароль облікового запису Microsoft і натисніть <strong> Далі </strong> . <br> 5. Потім введіть ім’я користувача, пароль (необов’язково) для нового локального облікового запису та натисніть <strong> Далі </strong> . <br> 6. Після перезапуску введіть пароль для входу в систему з новим локальним обліковим записом. </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}