{"title":"ВИПРАВЛЕННЯ: На даний момент у вас немає дозволу на доступ до цієї папки на зовнішньому USB-накопичувачі (вирішено)","content":"<p> Цей підручник містить докладні вказівки щодо вирішення наведеної нижче проблеми під час спроби отримати доступ до зовнішнього USB-диска на ноутбуці HP під керуванням Windows 10: &quot;Наразі у вас немає дозволу на доступ до цієї папки. Натисніть&quot; Продовжити &quot;, щоб назавжди отримати доступ до цієї папки&quot; . Помилка не зникає навіть після натискання кнопки &quot;Продовжити&quot;, щоб отримати доступ до диска. </p> <p><img src=\"images/image_thumb-18-636.png\" alt=\"You don't have permission to access this folder\" loading=\"lazy\"></p> <p> Дивна помилка &quot;У вас немає дозволу на доступ до цієї папки&quot; з&#39;являється на абсолютно новій <a href=\"http://www8.hp.com/us/en/products/laptops/product-detail.html?oid=17047142\" target=\"_blank\" rel=\"nofollow noopener\"> HP ProBook 450 G5 </a> ноутбук, коли користувач намагається переглянути вміст підключеного USB-диска (накопичувач Pen, USB-привід тощо). </p> <p> Розслідувавши проблему, я виявив, що ця проблема спричинена дозволами безпеки, застосованими до <a href=\"http://www8.hp.com/us/en/solutions/computer-security.html\" target=\"_blank\" rel=\"nofollow noopener\"> HP Client Security Manager </a> програма. HP Client Security Manager - це програма, розроблена компанією Hewlett-Packard, яка дозволяє захищати ваші дані, пристрій та особисті дані за рахунок підвищення безпеки вашого комп&#39;ютера. </p> <h2> Як виправити: відсутність дозволу на доступ до USB-накопичувача на ноутбуці HP (Windows 10/8/7). </h2> <p> 1. Відкрити <strong> Менеджер безпеки клієнта HP </strong> . </p> <p><img src=\"images/image_thumb-13-716.png\" alt=\"HP Client Security manager\" loading=\"lazy\"></p> <p> </p> <p> 2. Потім натисніть на <strong> Безпека пристрою. </strong></p> <p><img src=\"images/image_thumb-14-712.png\" alt=\"fix You Don't have permission to access this folder windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. В <strong> Адміністратори </strong> , встановіть для параметра &quot;Видалення сховища&quot; значення <strong> Дозволити - повний доступ </strong> і натисніть <strong> Подати. </strong></p> <p><img src=\"images/image_thumb-15-364.png\" alt=\"fix You Don't have permission o access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Додатково (якщо хочете), дайте <strong> Повний доступ </strong> на знімний носій інформації - <strong> Стандартні користувачі </strong> . </p> <p><img src=\"images/image_thumb-19-269.png\" alt=\"no permission to access USB drive windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Нарешті, якщо ви не хочете, щоб програма керування доступом до пристрою HP контролювала доступ на диску, перейдіть до <strong> Налаштування диска </strong> і встановіть відповідний перемикач у положення OFF. </p> <p><img src=\"images/image_thumb-20-822.png\" alt=\"You don't have permission to access USB drive\" loading=\"lazy\"></p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про цю проблему. </p>"}