{"title":"ВИПРАВЛЕННЯ: Панель стовпців Outlook (панель заголовка) зникає в Outlook 2016/2019. (Вирішено)","content":"<p> Кілька днів тому один із моїх клієнтів зв’язався зі мною та повідомив, що в Outlook 2019 відсутня смужка із заголовками стовпців (Надіслати, Від, Тема, Отримано, Розмір тощо). Точніше, рядок із заголовки стовпців зникли після того, як користувач налаштував &quot;Параметри перегляду&quot; та збільшив розмір шрифта РЯДО. </p> <p><img src=\"images/image_thumb-567.png\" alt=\"FIX: Outlook Columns Bar (Header Bar) Disappear in Outlook 2016/2019\" loading=\"lazy\"></p> <p> Цей підручник містить вказівки щодо того, як виправити проблему &quot;Відсутня панель заголовка Outlook (рядок стовпців)&quot; у програмі Outlook 2016/2019. </p> <h4> Як виправити: у Outlook 2016/2019 відсутній рядок заголовка стовпця. </h4> <p> 1. На лівій панелі, за допомогою папок Outlook, виберіть папку, в якій не видно рядок зі стовпцями (заголовки). </p> <p> 2. У рядку меню виберіть <strong> Переглянути </strong> а потім клацніть <strong> Перегляд налаштувань </strong> . </p> <p><img src=\"images/image_thumb-1-535.png\" alt=\"FIX Column Heading Row is Missing Outlook 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. У параметрах «Додаткові параметри перегляду» натисніть <strong> Інші налаштування </strong> . </p> <p><img src=\"images/image_thumb-2-711.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. У параметрах &quot;Інші налаштування&quot; <strong> зніміть прапорець </strong> <strong> Використовуйте компактний макет із розміром менше 125 символів </strong> і натисніть <strong> гаразд </strong> двічі застосувати налаштування та закрити всі вікна. </p> <p><img src=\"images/image_thumb-3-736.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Перезапустіть Outlook (або перейдіть до іншої папки та поверніться знову до папки, до якої ви застосували зміну), щоб побачити рядок із заголовками стовпців на місці. </p> <p><img src=\"images/image_thumb-4-249.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Це все! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-5.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p>"}