{"title":"ВИПРАВЛЕННЯ: Проблема з використанням високої пам&#39;яті Chrome (вирішено)","content":"<p> Як ви вже могли помітити, Google Chrome відкриває багато фонових процесів, навіть коли ви відкрили лише кілька вікон / вкладок Chrome. Це трапляється, оскільки Google Chrome створений таким чином, щоб створити індивідуальний процес для кожного плагіна чи розширення, встановленого при відкритті нового вікна чи вкладки. </p> <p> Незважаючи на те, що відкриття декількох процесів із Google Chrome є нормальною поведінкою, насправді це проблема, оскільки ця поведінка спричиняє велике використання пам&#39;яті та робить комп’ютер неактивним. </p> <p><img src=\"images/image_thumb-17-610.png\" alt=\"FIX: Multiple Processes in Chrome with High Memory Usage\" loading=\"lazy\"></p> <p> </p> <p> Цей посібник містить покрокові вказівки щодо запобігання Chrome відкривати кілька процесів для кожного вікна чи вкладки, щоб вирішити проблему використання пам&#39;яті Chrome. </p> <h4> Як вимкнути кілька процесів Chrome у Windows 10. </h4> <h6> Крок 1. Скануйте свій комп’ютер на наявність шкідливих програм та вірусів. </h6> <p> Першим кроком перед усуненням помилки &quot;ERR_CONNECTION_CLOSED&quot; у Chrome є забезпечення того, щоб у вашій системі не було вірусів / шкідливих програм. Для цього завдання дотримуйтесь інструкцій у цьому посібнику: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Як сканувати комп’ютер на наявність вірусів та інших шкідливих програм. </a></p> <h6></h6> <h6> Крок 2. Вимкніть небажані розширення Chrome. </h6> <p> Перш за все, перевірте, чи потрібні вам усі встановлені розширення Chrome, і вимкніть ті, які вам не потрібні. Для цього: </p> <p> 1. З меню Chrome <img src=\"images/image_thumb-47-380.png\" alt=\"image\" loading=\"lazy\"> , йти до <strong> Інші інструменти </strong> -&gt; <strong> Розширення </strong></p> <p><img src=\"images/image_thumb-51-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Видаліть (або вимкніть) будь-яке розширення, яке вам не потрібне або яке ви не впізнаєте. </p> <p><img src=\"images/image_thumb-49-442.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Крок 3. Запобігання запуску Chrome у фоновому режимі, коли Chrome закрито. </h6> <p> 1. З меню Chrome <img src=\"images/image_thumb-78-665.png\" alt=\"image\" loading=\"lazy\"> виберіть <strong> Налаштування </strong> . </p> <p><img src=\"images/image_thumb-79-868.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> 2. В <strong> Налаштування </strong> сторінки, прокрутіть вниз і натисніть <strong> Розширений </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <p> 3. Установіть перемикач &quot;Продовжувати запускати фонові програми, коли Google Chrome закрито&quot; <strong> ВИМК </strong> . </p> <p><img src=\"images/image_thumb-18-557.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <p> </p> <h6> Крок 4. Запобігання Chrome відкривати кілька процесів для одного веб-сайту. </h6> <p> 1, <strong> Клацніть правою кнопкою миші </strong> на <strong> Гугл хром </strong> ярлик і виберіть <strong> Властивості </strong> . <br> 2. В <strong> Загальні </strong> вкладку, додайте перемикач &quot;–process-per-site&quot; (без лапок), у кінці цільового рядка та натисніть <strong> гаразд </strong> і <strong> Продовжуйте </strong> застосувати зміну <strong> . * </strong></p> <p> напр. &quot;C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; - процес на сайт </p> <p> Примітка: Існує пробіл до –process-per-site </p> <p><img src=\"images/image_thumb-19-818.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Крок 5. Вимкніть ізоляцію веб-сайтів Google Chrome. </h6> <p> У режимі ізоляції веб-сайтів Chrome завантажує кожен веб-сайт у своєму власному процесі. Це фактично додаткова функція безпеки, яка запобігає крадіжці веб-сайту ваших даних з іншого веб-сайту, відкритого для іншого вікна / вкладки. Але режим &quot;Ізоляція сайту&quot; збільшить використання пам&#39;яті Chrome приблизно на 10%. </p> <p> 1. Введіть в адресному рядку Chrome <a href=\"//flags/#site-isolation-trial-opt-out\" target=\"_blank\" rel=\"nofollow noopener\"> chrome: // flags / # site-isolation-trial-opt-out </a> і натисніть клавішу Enter. </p> <p> 2. Встановіть <strong> Вимкнути ізоляцію сайту </strong> режим до <strong> Інваліди </strong> а потім клацніть <strong> Перезапустити зараз </strong> . * </p> <p> * Примітка: </p> <p><img src=\"images/image_thumb-20-397.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Це все, шановні! Вам це вдалося? </p> <p> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}