{"title":"ВИПРАВЛЕННЯ: ВІДЕО DXGKRNL ФАТАЛЬНА ПОМИЛКА у Windows 10 (вирішено)","content":"<p> Якщо ви зіткнулися з помилкою синього екрану &quot;VIDEO DXGKRNL FATAL ERROR&quot; у Windows 10, виконайте вказівки нижче, щоб вирішити проблему. </p> <p> Помилка BSOD у Windows 10 &quot; <em> Ваш ПК зіткнувся з проблемою і потребує перезавантаження. Ми просто збираємо деяку інформацію про помилку, а потім перезапустимо для вас. Якщо ви хочете дізнатися більше, ви можете пізніше шукати в Інтернеті цю помилку: ВИДЕО DXGKRNL ФАТАЛЬНА ПОМИЛКА &quot; </em> зазвичай вказує на проблему з драйверами відео. </p> <p><img src=\"images/image_thumb-7-129.png\" alt=\"FIX: VIDEO DXGKRNL FATAL ERROR in Windows 10\" loading=\"lazy\"></p> <p> Цей посібник містить покрокові вказівки щодо усунення помилки синього екрана &quot;VIDEO DXGKRNL FATAL ERROR&quot; у Windows 10. </p> <h2> Як виправити: ВИДЕО ВИДЕО DXGKRNL ВІДЕО 10 ПОМИЛКА. </h2> <h3> Крок 1. Виправте VIDEO DXGKRNL FATAL ERROR, видаливши / перевстановивши відеодрайвери. </h3> <p> 1. Відкрити <strong> Диспетчер пристроїв </strong> . Для цього: </p> <ol> <li> <ol> <li> Натисніть Windows <img src=\"images/image_thumb8_thumb_thumb-153.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> Р </strong> клавіші, щоб відкрити поле команди запуску. </li> <li> У полі &quot;Відкрити&quot; введіть: <strong> devmgmt.msc </strong> &amp; натисніть <strong> гаразд </strong> . </li> </ol> </li> </ol> <blockquote> <p><img src=\"images/image_thumb-5-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p></blockquote> <p> 2. <strong> Розгорнути </strong> <strong> Відеоадаптери. <br> </strong> 3. <strong> Клацніть правою кнопкою миші </strong> на встановлених адаптерах дисплея та виберіть <strong> Видаліть пристрій. </strong></p> <p><img src=\"images/image_thumb-46-240.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. У наступному вікні, якщо у вас є можливість: &quot; <strong> Видаліть програмне забезпечення драйвера для цього пристрою </strong> &quot;, виберіть його, а потім натисніть <strong> гаразд </strong> видалити встановлені драйвери з комп&#39;ютера. </p> <p> 5. Після видалення, <strong> перезапустити </strong> комп&#39;ютер і перейдіть до <strong> Диспетчер пристроїв </strong> знову. <br> 6. Клацніть правою кнопкою миші на назві комп&#39;ютера (зверху) та виберіть <strong> Проведіть пошук апаратних змін. </strong></p> <p><img src=\"images/image_thumb-8-911.png\" alt=\"Scan for hardware changes\" loading=\"lazy\"></p> <p> </p> <p> 7. Дозвольте Windows виявити та встановити драйвери дисплея, а потім <strong> перезапустити </strong> знову перевірте свій комп’ютер і перевірте, чи не зникає &quot;VIDEO DXGKRNL FATAL ERROR&quot;. * </p> <p> * Примітка: Якщо Windows не може автоматично встановити драйвери дисплея автоматично, або якщо ви все ще стикаєтеся з помилкою синього екрану, перейдіть до наступного кроку. </p> <p> </p> <h3><br clear=\"all\"> Крок 2. Повторно встановіть відеодрайвери з сайту виробника. </h3> <p> 1. Перейдіть до <strong> Диспетчер пристроїв </strong> і <strong> видалити </strong> встановлений адаптер дисплея. * </p> <p> * Примітка: Якщо у вас є ноутбук із двома (2) адаптерами дисплея, видаліть обидва. </p> <p> 2. Зайдіть на сайт підтримки виробника вашого комп’ютера (або графічної карти) та завантажте найновіші драйвери для своєї графічної картки. </p> <ul> <li> <ul> <li> Для <strong> NVIDIA </strong> на основі графічних процесорів, перейдіть до <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Сторінка розширеного пошуку драйверів NVIDIA </a> . </li> <li> Для <strong> AMD </strong> на основі графічних процесорів, перейдіть до <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Центр завантаження драйверів AMD (ATI). </a></li> <li> Для <strong> Intel </strong> на основі графічних процесорів, перейдіть до <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Центр завантаження графіки Intel. </a></li> </ul> </li> </ul> <p> 3. Продовжте та встановіть завантажений драйвер. * </p> <p><strong> * Важлива примітка: </strong> Якщо у вас є ноутбук із двома (2) адаптерами дисплея, спершу приступайте до встановлення драйверів для AMD або адаптера NVIDIA та перезапустіть ноутбук. Після перезапуску продовжте та встановіть драйвери для адаптера дисплея INTEL, а потім перезапустіть ноутбук знову. </p> <p> 4. Після установки, <strong> перезапустити </strong> ПК та перевірте, чи вирішено ВИДЕО DXGKRNL FATAL ERROR. Якщо ні, перейдіть до наступного кроку. </p> <p> </p> <h3><br clear=\"all\"> Крок 3. Відремонтуйте DirectX, щоб виправити VIDEO DXGKRNL FATAL ERROR. </h3> <p> ВИДЕО DXGKRNL ФАТАЛЬНА ПОМИЛКА вказує на проблему з драйверами DirectX від Microsoft. Отже, приступайте до ремонту DirectX. </p> <p> 1. Завантажте файл <a href=\"https://www.microsoft.com/en-us/download/details.aspx?displaylang=en&id=35\" target=\"_blank\" rel=\"nofollow noopener\"> Веб-інсталятор середовища виконання DirectX для кінцевих користувачів </a> . <br> 2. Запустіть завантажений файл (dxwebsetup.exe) і дотримуйтесь інструкцій на екрані, щоб встановити додаткові компоненти середовища виконання DirectX. </p> <p><img src=\"images/image_thumb-9-847.png\" alt=\"Install DirectX Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Після завершення встановлення <strong> перезапустити </strong> ПК. </p> <p> 4. Після перезапуску перейдіть до <strong> Почніть <img src=\"images/image_thumb-55-571.png\" alt=\"image\" loading=\"lazy\"> -&gt; Налаштування </strong> -&gt; <strong> Оновлення та безпека -&gt; </strong> і натисніть <strong> Перевірити наявність оновлень. </strong></p> <p><img src=\"images/image_thumb-76-281.png\" alt=\"Windows 10 - Check For Updates \" loading=\"lazy\"></p> <p> 5. Після встановлення оновлень перезавантажте ПК ще раз і перевірте, чи помилка BSOD вирішена. Якщо ні, перейдіть до наступного кроку. </p> <p> </p> <h3><br clear=\"all\"> Крок 4. Відновлення системних файлів Windows 10. </h3> <p> 1. Відкрити <strong> Командний рядок як адміністратор </strong> . <br> 2. У командному рядку введіть таку команду та натисніть <strong> Введіть: </strong></p> <ul> <li><strong> DISM.exe / Online / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-176.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Після завершення операції DISM введіть таку команду та натисніть <strong> Введіть </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-464.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Тепер почекайте, поки перевірка системних файлів не відновить системні файли Windows. <br> 5. Коли це буде зроблено, <strong> перезапустити </strong> комп’ютера та перевірте, чи помилка не зникає. </p> <p> </p> <h3><br clear=\"all\"> Крок 5. Проаналізуйте файл журналу Minidump (BSOD). </h3> <p> Коли Windows аварійно завершує роботу із синім екраном, інформація про екран BSoD зберігається у невеликих файлах, які називаються &quot; <strong> MiniDump </strong> &quot;Аналіз <strong> Мінідумп </strong> Файли можуть допомогти вам вирішити та вирішити проблему на синьому екрані VIDEO DXGKRNL FATAL ERROR. Щоб виконати це завдання, дотримуйтесь інструкцій у цій статті: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Як аналізувати файли MiniDump за допомогою BlueScreenView </a> . </p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}