{"title":"ЯК: видалити історію Інтернету, паролі та файли cookie з веб-браузера (Chrome, Firefox, IE)","content":"<p> Коли ви відвідуєте веб-сайт із веб-браузером, веб-сайт надсилає деяку інформацію до браузера, і браузер зберігає цю інформацію до невеликих текстових файлів, що називаються <strong> печиво </strong> s. Файли cookie зберігають уподобання користувача щодо цього веб-сайту, наприклад дані для входу, тому користувачеві не потрібно повторно вводити дані для входу (ім’я користувача та / або пароль), коли він повертається на той самий веб-сайт. Файли cookie також можуть зберігати історію того, які сторінки веб-сайту відвідував користувач, тому користувачеві не потрібно їх запам&#39;ятовувати або здійснювати навігацію по всіх сторінках веб-сайту, поки він не знайде те, що хоче. </p> <p> У той же час, коли ви відвідуєте веб-сайт, браузер зберігає локальну копію всіх відвіданих вами веб-сторінок, щоб зберегти пропускну здатність з&#39;єднання та зменшити час завантаження веб-сторінок під час наступного їх відвідування. Ця &quot;локальна копія веб-сторінок&quot; відома як &quot; <strong> Тимчасові файли в Інтернеті </strong> &quot;з <strong> Кеш </strong> . </p> <p> Файли cookie та кеш через деякий час можуть вмістити значну кількість дискового простору, і їх потрібно очистити. В інших випадках вам може знадобитися видалити кеш-пам’ять браузера та файли cookie, щоб повністю перезавантажити вміст веб-сайту або з міркувань безпеки та конфіденційності: наприклад якщо ви не хочете, третя особа дізнається, які веб-сторінки ви відвідували (інакше: &quot; <strong> Історія перегляду </strong> &quot;) або які є вашими даними для входу на веб-сайт (наприклад, GMAIL). </p> <p> У цьому посібнику ви знайдете два (2) простих способи видалення історії перегляду, тимчасових файлів Інтернету (кеш-пам’яті) та файлів cookie з Internet Explorer, Chrome та Firefox. </p> <h4> Як очистити історію веб-перегляду, збережені паролі та файли cookie у Chrome, Firefox та Internet Explorer. </h4> <h5><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Спосіб 1. Очищення даних перегляду з певного браузера. </a></h5> <h5><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Спосіб 2. Видаліть дані перегляду з усіх веб-браузерів одним клацанням миші! </a></h5> <p> </p> <h5> Спосіб 1. Видалення історії, кеш-пам’яті та файлів cookie з певного браузера. </h5> <p> Загалом, кожен веб-браузер має опції для видалення збережених даних перегляду через меню Налаштування / Параметри, але якщо ви хочете легко отримати доступ до цих параметрів (без необхідності навігації мишею по меню браузера), натисніть <strong> Ctrl </strong> + <strong> Shift </strong> + <strong> Видалити </strong> клавіші разом у відкритому вікні браузера. Так… </p> <p><strong> Щоб видалити історію перегляду, кеш-пам’ять та файли cookie з Internet Explorer: </strong></p> <p> 1. Відкрийте Internet Explorer і натисніть <strong> Ctrl </strong> + <strong> Shift </strong> + <strong> Видалити. <br> </strong> 2. Виберіть тип інформації, яку потрібно видалити, і натисніть на <strong> Видалити </strong> кнопку. </p> <p><img src=\"images/image_thumb-18-750.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> Щоб видалити історію веб-перегляду, кеш-пам’ять та файли cookie з Chrome: </strong></p> <p> 1. Запустіть Chrome і натисніть <strong> Ctrl </strong> + <strong> Shift </strong> + <strong> Видалити. <br> </strong> 2. Виберіть тип інформації, яку потрібно очистити, а потім натисніть <strong> ОЧИСТИТИ ДАНІ </strong> . </p> <p><img src=\"images/image_thumb-19-667.png\" alt=\"clear chrome history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p><strong> Щоб видалити історію перегляду, кеш-пам’ять та файли cookie з Firefox: </strong></p> <p> 1. Відкрийте Firefox і одночасно натисніть <strong> Ctrl </strong> + <strong> Shift </strong> + <strong> Видалити. <br> </strong> 2. Виберіть дані, які ви хочете видалити з Firefox, та натисніть <strong> Ясно зараз. </strong></p> <p> </p> <p><img src=\"images/image_thumb-20-864.png\" alt=\"clear firefox history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> Спосіб 2. Видаліть історію браузера, кеш-пам’ять та файли cookie одночасно з усіх веб-браузерів. </h5> <p> Якщо ви хочете полегшити своє життя, тоді ви можете використовувати <a href=\"https://www.ccleaner.com/\" target=\"_blank\" rel=\"nofollow noopener\"> CCleaner </a> утиліта для легкого видалення тимчасових файлів Інтернету, історії та файлів cookie з усіх веб-браузерів, якими ви користуєтеся, одним клацанням миші. </p> <p> 1. <a href=\"https://www.ccleaner.com/ccleaner/download\" target=\"_blank\" rel=\"nofollow noopener\"> Завантажити </a> та встановіть безкоштовну версію утиліти CCleaner. </p> <p> 2. Запуск <strong> CCleaner </strong> і перейдіть до <strong> Windows </strong> та <strong> Програми </strong> на вкладці, щоб вибрати, яку інформацію ви хочете видалити з веб-браузерів. </p> <p> 3. Після закінчення натисніть <strong> Запустіть Cleaner </strong> . </p> <p><img src=\"images/image_thumb-21-173.png\" alt=\"clear internet history cache cookies - ccleaner\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Це все! Вам це вдалося? </p> <p> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}