{"title":"Як автоматично входити в Windows 10/8/7 (без введення пароля).","content":"<p> Цей підручник містить інструкції щодо автоматичного входу в Windows 10. Насправді ви дізнаєтесь, як автоматично входити у свій обліковий запис користувача (обліковий запис Microsoft, Local або Domain), не вводячи свої облікові дані під час входу або на екрані блокування. . Інструкція стосується ОС Windows 10/8/7. </p> <p> Коли ви виконуєте нову установку Windows 10, вам буде запропоновано вказати обліковий запис користувача та пароль для використання комп’ютера. На цьому кроці ви можете використовувати свій обліковий запис Microsoft (з паролем вашого облікового запису MS) або створити новий локальний обліковий запис і новий пароль для входу в систему Windows. В обох випадках (якщо ви не створюєте локальний обліковий запис із пустим паролем), вам буде запропоновано ввести пароль кожного разу під час запуску Windows. </p> <p> Захист власного комп&#39;ютера паролем є хорошим заходом безпеки, особливо якщо ви ділитеся своїм комп&#39;ютером з іншими, або коли подорожуєте з ноутбуком, або коли ваш ПК належить до ділового середовища. Але якщо ви єдиний користувач на вашому автономному настільному комп’ютері або якщо ви користуєтеся ноутбуком лише вдома, немає необхідності вводити свої облікові дані кожного разу, коли ви хочете ним користуватися. * </p> <p><strong> Увага: </strong> НЕ УВІМКНЮЙТЕ АВТОМАТИЧНИЙ ВХІД у Windows, якщо ви ділитеся своїм комп’ютером з іншими або подорожуєте з ноутбуком або планшетом, оскільки кожен, хто знайде ваш комп’ютер, матиме легкий доступ до ваших файлів. </p> <h4> Як автоматично входити у свій обліковий запис користувача в Windows 10/8/7 / Vista. (Увімкнути автоматичний вхід) </h4> <h6> Спосіб 1. Увімкніть автоматичний вхід за допомогою утиліти AUTOLOGON. </h6> <p> Microsoft розробила інструмент для автоматизації процесу входу в систему Windows. Інструмент отримав назву &quot;Autologon&quot; і дозволяє легко налаштувати Windows на автоматичний вхід без необхідності вводити свої облікові дані під час кожного запуску. Перевага цього інструменту полягає в тому, що пароль зберігається зашифровано в реєстрі. </p> <p> 1. Завантажити <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/autologon\" target=\"_blank\" rel=\"nofollow noopener\"> Автологін </a> корисність. <br> 2. Витягніть завантажений файл. <br> 3. Запустіть &quot;autologon.exe&quot; <br> 4. Введіть свій пароль і натисніть <strong> Увімкнути </strong> . </p> <p><img src=\"images/image_thumb-44-251.png\" alt=\"windows auto login\" loading=\"lazy\"></p> <p> * Примітка: Якщо ви хочете увімкнути автоматичний вхід, запустіть програму ще раз і натисніть <strong> Вимкнути </strong> . </p> <p> </p> <h6> Спосіб 2. Увімкніть автоматичний вхід із панелі керування обліковими записами користувачів. </h6> <p> Другим способом увімкнення автоматичного входу в Windows 10/8/7 є вимкнення параметра &quot;Користувачі повинні ввести ім&#39;я користувача та пароль, щоб використовувати цей комп&#39;ютер&quot; на панелі керування обліковими записами користувачів. Для цього: </p> <p> Примітка. Якщо ви використовуєте локальний обліковий запис, існує ще простіший спосіб змусити Windows автоматично входити: Просто вкажіть новий порожній (порожній) пароль у меню Параметри&gt; Облікові записи&gt; Параметри входу&gt; Змінити пароль. Потім введіть свій пароль один раз, а потім двічі натисніть Далі та Готово. </p> <p> 1. Натисніть Windows <img src=\"images/image_thumb8_thumb_thumb-738.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> Р. </strong> клавіші, щоб відкрити поле команди запуску. <br> 2. У полі &quot;Відкрити&quot; введіть: <strong> керувати паролями користувачів2 </strong> &amp; натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb-29-873.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. У параметрах Облікових записів користувачів (вкладка &quot;Користувачі&quot;) <strong> зніміть прапорець </strong> <strong> Користувачі повинні ввести ім’я користувача та пароль, щоб використовувати цей комп’ютер </strong> а потім клацніть <strong> Подати заявку. * </strong></p> <p> * Примітка. Якщо ви хочете у майбутньому вимкнути автоматичний вхід, просто поставте цей прапорець. </p> <p><img src=\"images/image_thumb-32-315.png\" alt=\"auto login windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Введіть (двічі) пароль свого облікового запису та натисніть <strong> гаразд </strong> двічі, щоб закрити властивості Облікового запису користувача. </p> <p><img src=\"images/image_thumb-31-509.png\" alt=\"Auto Login to Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Спосіб 3. Увімкніть автоматичний вхід у реєстрі (Windows 10/8/7 / Vista). </h6> <p> Останнім методом вимкнення входу до пароля в ОС Windows 10, 8 або 7 є увімкнення реєстру автоматичного входу. Для цього: </p> <p> 1. Натисніть Windows <img src=\"images/image_thumb8_thumb_thumb-512.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> Р. </strong> клавіші, щоб відкрити поле команди запуску. <br> 2. У полі &quot;Відкрити&quot; введіть: <strong> regedit </strong> &amp; натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb7-114.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Перейдіть до цієї клавіші з лівої панелі: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ ПРОГРАМНЕ ЗАБЕЗПЕЧЕННЯ \\ Microsoft \\ Windows NT \\ CurrentVersion \\ Winlogon </li> </ul> <p> 4. На правій панелі: </p> <blockquote><p> a. Клацніть правою кнопкою миші на порожньому місці та виберіть <strong> Новий </strong> &gt; <strong> Значення рядка. </strong></p> <p><img src=\"images/image_thumb-38-930.png\" alt=\"image\" loading=\"lazy\"></p> <p> b. Перейменуйте нове значення на <strong> DefaultUserName </strong> і натисніть <strong> Введіть </strong> . <br> c. Відкрийте значення REG_SZ &#39;DefaultUserName&#39;. <br> d. Введіть ім&#39;я свого локального облікового запису користувача або свого облікового запису Microsoft і натисніть <strong> гаразд </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-42-933.png\" alt=\"enable auto login registry\" loading=\"lazy\"></p> <p> </p> <p> 5а. Виконайте ті самі дії та створіть нове значення REG_SZ (String) та назвіть його <strong> Пароль за замовчуванням </strong> . <br> 5б. Двічі клацніть на &#39;DefaultPassword <strong> &#39; </strong> Значення REG_SZ, введіть пароль у полі Значення та натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb-43-192.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7а. Нарешті, створіть нове значення REG_SZ та назвіть його <b> AutoAdminLogon </b> . <br> 7б. Двічі клацніть на значення &quot;AutoAdminLogon&quot;, введіть <strong> 1 </strong> у полі Значення і натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb-41-705.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Закрийте редактор реєстру та перезавантажте ПК. * </p> <p> * Примітки: <br> 1. Якщо ваш комп&#39;ютер є частиною Домену, то вам доведеться створити ще одне значення REG_SZ з іменем <strong> DefaultDomainName </strong> а потім ввести у поле даних про значення значення вашого домену. <br> 2. Щоб у майбутньому вимкнути автоматичний вхід, просто видаліть щойно створені рядкові значення, згадані вище. </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}