{"title":"Як перевірити наявність оновлень в Office 2019, 2016 або 2013 в Windows 10.","content":"<p> У цьому підручнику ви дізнаєтесь, як вручну перевіряти наявність оновлень в Office 2019, 2016 та Office 2013. У всіх версіях Office є два способи встановити доступні оновлення Office: автоматично та вручну. </p> <h4> Як оновити Office 209/2016/2013/2010 вручну. </h4> <h6> Спосіб 1. Як перевірити наявність оновлень Office у Office 2019, 2016 та Office 2013 вручну. </h6> <p> Щоб вручну перевірити та встановити доступні оновлення Office у всіх версіях Office: </p> <p> 1. Відкрийте будь-яку програму Office (наприклад, Word). <br> 2. Від <strong> Файл </strong> меню, виберіть <strong> Рахунок </strong> . * </p> <p> * Примітка. У Office 2010 виберіть <strong> Допомога. </strong></p> <p> 3. Розгорніть <strong> Параметри оновлення </strong> і натисніть <strong> Оновити зараз </strong> . * </p> <p> * Примітка: Якщо &quot;Параметри оновлення&quot; недоступні, дотримуйтесь вказівок у Методі-2 нижче. </p> <p><img src=\"images/image_thumb-19-478.png\" alt=\"How to Check for Updates in Office 2019, 2016 or 2013 in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Спосіб 2. Як автоматично встановлювати оновлення Office для Office 2019, 2016 та Office 2013. </h6> <p> Якщо ви хочете, щоб Windows автоматично завантажувала та встановлювала доступні оновлення Office, перейдіть до налаштувань оновлення Windows і перевірте таке налаштування: </p> <ul> <li> Отримувати оновлення для інших продуктів Microsoft під час оновлення Windows (Windows 10) </li> <li> Надіслати мені оновлення для інших продуктів Microsoft під час оновлення Windows (Windows 7) </li> </ul> <h5> Щоб автоматично встановлювати оновлення Office у Windows 10. </h5> <p><strong> 1. </strong> Йти до <strong> Налаштування </strong> -&gt; <strong> Оновлення та безпека -&gt; Додаткові параметри. </strong></p> <p><img src=\"images/image_thumb-20-149.png\" alt=\"Change Update Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> У розділі Параметри оновлення перетягніть повзунок &quot;Отримувати оновлення для інших продуктів Microsoft під час оновлення Windows&quot; <strong> УВІМК. </strong></p> <p><img src=\"images/image_thumb-21-717.png\" alt=\"automatically install office updates windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Перейдіть до попереднього екрана та натисніть <strong> Перевірити наявність оновлень </strong> , щоб негайно встановити доступні оновлення Office. </p> <p> </p> <h5> Для автоматичного встановлення оновлень Office у Windows 7. </h5> <p> 1. Перейдіть до <strong> Панель управління </strong> -&gt; <strong> Windows Update </strong> і натисніть <strong> Змінити налаштування </strong> . </p> <p><img src=\"images/image_thumb-22-108.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Виберіть <strong> Дайте мені оновлення для інших продуктів Microsoft, коли я оновлюю Windows </strong> і натисніть <strong> Подати заявку </strong> . </p> <p> 3. Клацніть <strong> Перевірити наявність оновлень </strong> щоб встановити всі доступні оновлення. </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про цей посібник. </p> <p> </p>"}