{"title":"Як видалити КЛАЦНУТИ ТУТ, ЩОБ ПОДРОБИТИ БІЛЬШЕ НА ОПЦІЇ MICROSOFT EXCHANGE в Outlook.","content":"<p> Якщо ви не хочете кожного разу натискати гіперпосилання &quot;Клацніть тут, щоб переглянути більше на Exchange&quot; у програмі Outlook, щоб переглянути всі збережені електронні листи на Exchange, продовжуйте читати нижче. Гіперпосилання &quot;Натисніть тут, щоб переглянути більше на Exchange&quot; у програмі Outlook з’являється, оскільки в папках пошти відображаються лише нові елементи (електронні листи). Це поведінка за замовчуванням, оскільки при використанні Microsoft Outlook 2019, Outlook 2016, Outlook 2013 або Outlook для Office 365 для підключення до поштової скриньки Exchange Server Outlook відображає повідомлення електронної пошти минулого року. </p> <p><img src=\"images/image_thumb-19-421.png\" alt=\"How to Remove the \" click here to view more on exchange option in outlook. loading=\"lazy\"></p> <p> </p> <p> Щоб видалити гіперпосилання &quot;Клацніть тут, щоб переглянути додаткові відомості про Exchange&quot;, щоб переглянути всі ваші елементи електронної пошти, підключившись до поштової скриньки Exchange, виконайте наведені нижче дії. </p> <h4> Як змусити Outlook відображати всі електронні листи з поштової скриньки Exchange. </h4> <p> Щоб відобразити всі електронні листи Exchange у програмі Outlook: </p> <p> 1. Клацніть на <strong> Файл </strong> меню та перейдіть до <strong> Рахунок </strong> &gt; <strong> Налаштування аккаунта </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-1-139.png\" alt=\"How to Backup Outlook\" loading=\"lazy\"></p> <p> 2. Виділіть обліковий запис Exchange і натисніть <strong> Зміна </strong> . </p> <p><img src=\"images/image_thumb-20-777.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. У налаштуванні &quot;Завантажити електронну пошту за минуле&quot; перетягніть повзунок до кінця. </p> <p><img src=\"images/image_thumb-17-833.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Після закінчення натисніть <strong> Далі </strong> і <strong> Готово </strong> а потім закрийте Налаштування облікового запису. </p> <p><img src=\"images/image_thumb-18-585.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Перезапустіть </strong> Outlook. </p> <p> Це все, шановні! Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}