{"title":"Як видалити версію Edge Chromium у Windows 10.","content":"<p> Багато користувачів повідомляють, що після встановлення нової версії браузера Microsoft Edge на базі Chromium в Windows 10 система стає занадто повільною або зависає в випадкові моменти. Якщо ви зіткнулися з тією ж проблемою, продовжуйте читати нижче, щоб видалити версію Edge Chromium з вашого ПК. * </p> <p> * Примітка: Якщо версія Chromium Microsoft Edge ще не встановлена ​​у вашій системі, прочитайте інструкції з цього <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> статті </a> щоб запобігти автоматичній установці Microsoft Edge. </p> <p><img src=\"images/image_thumb-38-388.png\" alt=\"Remove Edge Chromium in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Нова версія браузера Microsoft Edge на основі Chromium автоматично встановлюється разом із <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> оновлення. Коли це трапляється, ви не можете видалити Microsoft Edge з <strong> Почніть </strong> меню <img src=\"images/image_thumb2_thumb_thumb-565.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Налаштування </strong><img src=\"images/image_thumb-66-219.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Програми </strong> -&gt; <strong> Програми та функції </strong> варіанти, оскільки <strong> Видаліть </strong> опція сіра. Щоб обійти це обмеження, застосуйте наведені нижче дії. </p> <p><img src=\"images/image_thumb-39-654.png\" alt=\"How to Uninstall Edge Chromium version in Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Як видалити Edge Chromium з Windows 10. </h4> <p> Щоб видалити новий Edge на базі Chromium у Windows 10: </p> <p> 1. Перейдіть до наступної папки на вашому ПК: * </p> <ul> <li> C: \\ Program Files (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </li> </ul> <p> * Примітка: Назва папки &quot;85.0.564.41&quot; вказує на встановлену версію нової версії Chromium і може відрізнятися на вашому ПК. </p> <p> 2. Виберіть шлях до папки в адресному рядку та клацніть правою кнопкою миші&gt; <strong> Копіювати. </strong></p> <p><img src=\"images/image_thumb35_thumb-738.png\" alt=\"image_thumb[35]\" loading=\"lazy\"></p> <p> </p> <p> 3. Відкрити <strong> Командний рядок як адміністратор, </strong> типу <strong> компакт-диск </strong> а потім натисніть <strong> CTRL + V </strong> вставити в скопійований шлях до папки. Після закінчення натисніть <strong> Введіть </strong> . * </p> <p> * наприклад: У поточному прикладі команда буде такою: </p> <p><em> cd C: \\ Program Files (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </em></p> <p><img src=\"images/image_thumb39_thumb-252.png\" alt=\"Uninstall Edge Chromium\" loading=\"lazy\"></p> <p> </p> <p> 4. Тепер у командному рядку дайте наведену нижче команду (Копіювати / Вставити), щоб видалити версію браузера Microsoft Edge Chromium з вашого ПК. </p> <ul> <li> setup.exe –установка –системний рівень –вербозове ведення журналу –силка-видалення </li> </ul> <p><img src=\"images/image_thumb47_thumb-506.png\" alt=\"Uninstall Edge Chromium command\" loading=\"lazy\"></p> <p> 5. Після виконання вищевказаної команди стара версія EDGE буде знову активована. Перезавантажте ПК, щоб застосувати зміни. <br> 6. Після перезапуску перейдіть до встановлення <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> новий браузер Edge на основі Chromium </a> на своєму ПК, щоб уникнути автоматичної доставки або запобігти подальшій установці Edge Chromium, дотримуючись інструкцій у цій статті: <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Як запобігти автоматичному встановленню Edge Chromium у Windows 10. </a></p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}