{"title":"Як створити тіньові копії файлів за допомогою планувальника завдань у Windows 10.","content":"<p> У попередньому підручнику я згадав спосіб резервного копіювання ваших особистих файлів за допомогою <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Історія файлів </a> у Windows 10. У цьому посібнику я покажу, як автоматично створювати тіньові копії ваших особистих файлів за допомогою планувальника завдань. Тіньові копії ваших файлів дозволять повернути певний файл або папку до попередньої версії (момент часу). </p> <p> Функція тіньового копіювання вперше була представлена ​​в Windows Server 2003, а потім додана до версій Windows Vista та 7 як частина функції відновлення системи. Процес &quot;Тіньової копії&quot; може робити резервні копії та знімки поточного стану системи та особистих файлів, навіть якщо вони використовуються. Процес відновлення файлів із Тіньових копій більш відомий як &quot;Відновити попередні версії&quot;. </p> <h4> Як щодня створювати тіньову копію файлів у Windows 10. * </h4> <p><strong> * Примітки: </strong><br> 1. Використовуючи інструкції нижче, ви зможете створювати щоденні тіньові копії (знімки) усього тому &quot;C: \\&quot;. (Системні файли Windows та особисті дані) <br> 2. Тіньові копії можна використовувати для відновлення ваших файлів до попереднього моменту часу, за допомогою функції «Відновити попередню версію» або за допомогою сторонньої утиліти, яка може отримати доступ до Тіньових копій, наприклад <a href=\"https://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowExplorer </a> або <a href=\"https://www.nirsoft.net/utils/shadow_copy_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowCopyView </a> . <br> 3. Тіньові копії <strong> не можна використовувати для відновлення системи </strong> до більш раннього моменту часу, використовуючи <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> Відновлення системи </a> інструмент. Якщо ви хочете мати можливість відновити систему за допомогою функції відновлення системи, продовжте та <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Увімкніть захист відновлення системи. </a> <br> 4. Нарешті, майте на увазі, що створені Тіньові копії не є надійною резервною копією, оскільки &quot;Тіньові копії&quot; зберігаються на вашому основному диску C: \\, і якщо диск вийде з ладу, ви втратите всі свої дані. Щоб створити надійну резервну копію даних, прочитайте інструкції в цій статті: <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Як створити резервну копію особистих файлів за допомогою історії файлів у Windows 10. </a></p> <p> </p> <p><strong> Щоб створити попередні версії ваших особистих файлів за допомогою тіньових копій: </strong></p> <p> 1. Відкрити <strong> Планувальник завдань </strong> . Якщо ви не знаєте, як це зробити, тоді ... </p> <blockquote><p> 1. У полі пошуку введіть <strong> Завдання </strong> або <strong> Планувальник завдань </strong> . <br> 2. Відкрийте &quot;Планувальник завдань&quot; у результатах пошуку. </p></blockquote> <p><img src=\"images/image_thumb-31-630.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Клацніть на Планувальнику завдань <strong> Створити завдання </strong> . </p> <p><img src=\"images/image_thumb-23-462.png\" alt=\"How to Start ThrottleStop at Windows Startup\" loading=\"lazy\"></p> <p> </p> <p> 3. В <strong> Загальні </strong> вкладка: </p> <blockquote><p> 1. Введіть &quot;Створити тіньову копію моїх файлів&quot; як назву завдання. <br> 2. <strong> Перевірте </strong> <strong> Бігайте з найвищими привілеями </strong> коробці. </p></blockquote> <p> Примітка. Якщо ви хочете запустити завдання у фоновому режимі, поставте крапку в <strong> Запустити, незалежно від того, ввійшов користувач чи ні </strong> , а потім введіть пароль для входу. </p> <p><img src=\"images/image_thumb-62-499.png\" alt=\"create shadow copies task windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Потім виберіть <strong> Тригери </strong> та натисніть <strong> Новий </strong> . <br> 4а. У вікні &quot;Новий тригер&quot; вкажіть, як часто потрібно створювати знімок ваших файлів і натискати <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb-63-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Потім виберіть <strong> Дії </strong> та натисніть <strong> Новий </strong> . <br> 5а. У вікні &quot;Нова дія&quot;: </p> <blockquote><p> 1. Виберіть <strong> Запустіть програму </strong> . <br> 2. У полі &quot;Програма / сценарій&quot; введіть: <strong> wmic </strong><br> 3. У полі &quot;Додати аргументи (необов’язково)&quot; введіть: </p> <ul> <li><strong> виклик shadowcopy create Volume = C: \\ </strong></li> </ul> <p> 4. Після закінчення натисніть <strong> ГАРАЗД. </strong></p></blockquote> <p><img src=\"images/image_thumb-66-640.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Клацніть <strong> гаразд </strong> ще раз, щоб закрити властивості запланованого завдання. </p> <p><img src=\"images/image_thumb-67-138.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Щоб створити свою першу резервну копію, клацніть правою кнопкою миші на завдання та виберіть <strong> Біжи </strong> . </p> <p><img src=\"images/image_thumb-68-388.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Готово! Відтепер, коли ви хочете відновити файл / папку до попередньої версії, клацніть правою кнопкою миші та виберіть <strong> Відновити попередні версії </strong> . </p> <p><img src=\"images/image_thumb-69-568.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Корисна інформація: <br> </strong> 1. Максимально виділений простір, який можна використовувати для зберігання тіньових копій, - це обсяг місця, який Система відновлення системи може використовувати для зберігання точок відновлення. <br> 2. Щоб дізнатись про використовуваний та максимально виділений простір для зберігання тіньових копій, введіть цю команду в командному рядку (адміністратор): </p> <ul> <li><strong> vssadmin list shadowstorage - - </strong></li> </ul> <p><img src=\"images/image_thumb-76-672.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Щоб змінити максимально виділений простір для Тіньових копій та Точок відновлення системи, перейдіть до <strong> Захист системи </strong> налаштування для <strong> Локальний диск (C :) </strong><br> 4. Якщо ви хочете видалити всі збережені тіньові копії, вам доведеться також стерти збережені точки відновлення. Якщо ви хочете це зробити, натисніть на <strong> Видалити всі точки відновлення </strong> у налаштуваннях захисту системи. </p> <p><img src=\"images/image_thumb-77-662.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Це все! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}