{"title":"Як видалити захист BitLocker із системного диска C: Без ключа відновлення BitLocker або пароля.","content":"<p> Ця стаття містить покрокові вказівки щодо видалення захисту BitLocker на системному диску C: щоб мати змогу очистити установку Windows 10 на захищеному від BitLocker комп’ютері, якщо у вас немає ключа відновлення BitLocker або пароля BitLocker якщо ви не можете розблокувати привід BitLocker з будь-якої причини. </p> <p><img src=\"images/image_thumb-51-648.png\" alt=\"Fix Refresh your PC error: Drive where windows is installed is locked\" loading=\"lazy\"></p> <p> </p> <p> Коли пристрій Windows 10 (ноутбук або ПК) захищений BitLocker, це єдиний спосіб отримати доступ до його вмісту або скинути налаштування пристрою (за допомогою функцій &quot;Скинути цей ПК&quot;, &quot;Оновити ПК&quot;) або перевстановити Windows, це розблокувати диск операційної системи C: за допомогою ключа відновлення BitLocker або пароля BitLocker. </p> <p> Якщо у вас немає ключа відновлення BitLocker або пароля BitLocker для розблокування системного диска C :, або ключ BitLocker не прийнятий, тоді єдиним варіантом, який ви залишили (на жаль), є повне стирання диска та виконання чиста інсталяція Windows. </p> <p> У цьому підручнику ви знайдете вказівки щодо вирішення наведеної нижче проблеми при спробі встановити Windows 10 або скинути пристрій Windows 10 у заводському стані: &quot;Диск, на якому встановлена ​​Windows, заблоковано. Розблокуйте диск і повторіть спробу &quot;. </p> <h4> Як очистити встановлення Windows 10 на захищеному від BitLocker комп’ютері (ВИПРАВЛЕННЯ: Не вдається встановити / оновити Windows 10 - диск заблоковано за допомогою BitLocker.) </h4> <p><strong> Вимога: </strong> <strong> Інсталяційний носій Windows 10 (USB або DVD). </strong><br> Якщо ви не володієте інсталяційним носієм Windows, ви можете створити його за допомогою <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Інструмент створення медіа Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Як створити інсталяційний носій Windows 10 USB. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Як створити інсталяційний носій DVD для Windows 10. </a></li> </ul> <p> Щоб виконати чисту інсталяцію Windows 10, на захищеному від BitLocker комп&#39;ютері / диску, дотримуйтесь інструкцій нижче: * </p> <p><strong> * ПОПЕРЕДЖЕННЯ: НИЖЧА ПРОЦЕДУРА ВИДАЛИТИ ВСІ ЗБЕРІГАНІ ДАНІ НА ЗАБЛОКОВАНОМ ДИСКІ ПРОДУЖУЄТЬСЯ ТІЛЬКИ ВИ, ЩО ВИ <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> НЕ МОЖНА РОЗБЛОКУВАТИ ЗАХИСТИЙ ПРИВОД / КОМП&#39;ЮТЕР BITLOCKER. </a></strong></p> <p> 1. Завантажте систему з інсталяційного носія Windows 10. * </p> <p> * Примітка: <strong> </strong> Для завантаження з Windows Media (USB або DVD) виконайте такі дії: </p> <ul> <li><strong> Спосіб 1: </strong> Після увімкнення живлення натисніть відповідну функціональну клавішу (зазвичай це &quot;F12&quot; або &quot;F8&quot;), щоб переглянути параметри &quot;Порядок завантаження&quot; або &quot;Меню завантаження&quot;. Потім виберіть пристрій USB (або DVD), який містить інсталяційний носій Windows (файли), і натисніть Enter. </li> <li><strong> Спосіб 2: </strong> Увійдіть у налаштування BIOS (Налаштування) та встановіть інсталяційний носій Windows як &quot;Перший завантажувальний пристрій&quot; у меню &quot;Порядок завантаження&quot;. Тоді <strong> Зберегти та вийти </strong> з налаштувань BIOS. </li> </ul> <p> 2. На екрані нижче натисніть <strong> SHIFT </strong> + <strong> F10 </strong> клавіші для запуску командного рядка. (або натисніть <strong> Далі </strong> &gt; <strong> Відремонтувати мій комп&#39;ютер </strong> &gt; <strong> Усунення несправностей </strong> &gt; <strong> Командний рядок </strong> ). * </p> <p> * Примітка. Якщо вам було запропоновано ввести ключ відновлення, натисніть <strong> ПРОПУСКАТИ цей диск </strong> . </p> <p><img src=\"images/image_thumb15_thumb-290.png\" alt=\"How to Remove Updates from the Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. У командному рядку введіть такі команди по порядку: </p> <ul> <li><strong> diskpart </strong></li> <li><strong> список дисків </strong></li> <li><strong> виберіть диск 0 </strong></li> <li><strong> обсяг списку </strong></li> </ul> <p> 4. Тепер знайдіть, який із перелічених томів має більший розмір у Гб. Зазвичай більший обсяг - це місце, де встановлена ​​Windows (заблокований диск). * </p> <p> * напр. На знімку екрана нижче &quot;Том 2&quot; має більший розмір. </p> <p> </p> <p><img src=\"images/image_thumb-10-992.png\" alt=\"fix drive is locked Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Потім виберіть більший том, набравши цю команду: * </p> <ul> <li><strong> виберіть номер гучності </strong></li> </ul> <p> * Примітка: Змініть номер гучності за наведеною вище командою відповідно до вашого випадку (наприклад, &quot;виберіть том 2&quot;) </p> <p> 5. Нарешті видаліть вибраний том, давши цю команду: </p> <p> </p> <ul> <li><strong> видалити перевизначення гучності - </strong></li> </ul> <p><img src=\"images/image_thumb-14-714.png\" alt=\"delete volume override\" loading=\"lazy\"></p> <p> </p> <p> 6. Тип <strong> вихід </strong> щоб закрити інструмент DISKPART, а потім закрити командний рядок. <br> 7. Вимкніть, а потім знову увімкніть пристрій. <br> 8. Завантажте з інсталяційного носія Windows. <br> 9. Клацніть <strong> Далі </strong> і потім <strong> Встановити зараз </strong> . <br> 10. Виберіть &quot;У мене немає ключа продукту&quot;, а потім прийміть Ліцензійну угоду. <br> 11. Виберіть &quot;Спеціальна інсталяція&quot;, а потім видаліть усі інші розділи / томи на диску. </p> <p><img src=\"images/image_thumb-12-362.png\" alt=\"cannot reset windows 10 drive locked with bitlocker\" loading=\"lazy\"></p> <p> </p> <p> 12. Закінчивши, виберіть «Нерозподілений простір» і натисніть <strong> Далі. <br> </strong> 13. Дотримуйтесь вказівок на екрані, щоб <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> чиста інсталяція Windows 10 </a> . </p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про цю проблему. </p>"}