{"title":"Як розшифрувати зашифровані файли EFS та видалити шифрування EFS у Windows 10.","content":"<p> У попередньому підручнику я описав шлях до <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> шифрувати файли за допомогою шифрування EFS </a> . У цьому посібнику ви дізнаєтесь, як видалити шифрування EFS та як розшифрувати зашифровані файли EFS після передачі їх на інший комп&#39;ютер. </p> <h4> Як розшифрувати зашифровані файли EFS та відключити шифрування EFS. </h4> <ul> <li> <p><a href=\"#part-1\"> Частина 1. Як вимкнути та видалити шифрування EFS на тому самому ПК. </a></p> </li> <li> <p><a href=\"#part-2\"> Частина 2. Як розшифрувати файли EFS на іншому ПК. </a></p> </li> </ul> <h6> Частина 1. Як вимкнути та видалити шифрування EFS. </h6> <p> Коли ви шифруєте свої файли за допомогою EFS, тоді ключ дешифрування (сертифікат) зберігається локально на вашому комп&#39;ютері, і файли вже розшифровані. Якщо ви хочете відключити шифрування EFS, щоб припинити шифрування файлів / папок: </p> <p> 1. Клацніть правою кнопкою миші зашифровану папку / файл і змініть файл <strong> Власник файлу </strong> до <strong> Особистий </strong> . </p> <p><img src=\"images/image_thumb-26-500.png\" alt=\"how to disable efs encryption\" loading=\"lazy\"></p> <p> 2. Завершивши, ви побачите, що папка / файл розблоковано. Просто виконайте ті самі дії, щоб видалити шифрування з усіх інших зашифрованих папок і файлів. </p> <p> 3. Тепер, якщо ви не використовуєте шифрування EFS для будь-якого іншого файлу / папки і хочете повністю видалити ключ відновлення EFS (він же &quot;ключ розшифровки - сертифікат&quot;) зі свого ПК: </p> <blockquote> <p> 1. Відкрийте Internet Explorer і з <strong> Інструменти </strong> меню <strong> Властивості Інтернету </strong> . (або відкрити <strong> Властивості Інтернету </strong> від <strong> Панель управління </strong> .) </p> <p> 2. В <strong> Зміст </strong> натисніть вкладку <strong> Сертифікати </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-27-186.png\" alt=\"how to remove efs certificate-recovery key\" loading=\"lazy\"></p> <blockquote> <p> 3. На вкладці Особисті виберіть сертифікат дешифрування та натисніть <strong> Видалити </strong> . * </p> <p><strong> * Увага: </strong> Переконайтеся, що ви видалили (зупинили) шифрування всіх зашифрованих файлів, перш ніж видаляти сертифікат (ключ дешифрування) </p> </blockquote> <p><img src=\"images/image_thumb-25-639.png\" alt=\"how to remove efs recovery key\" loading=\"lazy\"></p> <blockquote> <p> 4. <strong> Перезапустіть </strong> комп&#39;ютера. </p> </blockquote> <h6></h6> <h6> Частина 2: Як розшифрувати зашифровані файли EFS на іншому комп’ютері. </h6> <p> Якщо ви перенесли зашифровані файли EFS на інший комп&#39;ютер, єдиним способом перегляду (відкриття) файлів EFS є володіння ключем дешифрування. Ключем дешифрування є файл сертифіката .pfx, який ви експортували під час шифрування файлів. Якщо у вас немає ключа розшифровки EFS, неможливо розшифрувати файли EFS. </p> <p><strong> Щоб розшифрувати зашифровані файли EFS за допомогою ключа розшифровки - сертифікат: </strong></p> <p> 1. Двічі клацніть ключ розшифровки (файл .pfx сертифіката), щоб встановити його. <br> 2. На екрані привітання майстра імпорту сертифікатів натисніть <strong> Далі </strong> . <br> 3. Потім клацніть <strong> Далі </strong> знову. </p> <p><img src=\"images/image_thumb38_thumb-158.png\" alt=\"How to Decrypt EFS Encrypted files\" loading=\"lazy\"></p> <p> 4. Введіть пароль, який ви використовували під час експорту ключа сертифіката, та натисніть <strong> Далі </strong> . </p> <p><img src=\"images/image_thumb39_thumb-680.png\" alt=\"install efs .pfx certificate\" loading=\"lazy\"></p> <p> 5. Залиште налаштування за замовчуванням у Параметри сховища сертифікатів та натисніть <strong> Далі </strong> . </p> <p><img src=\"images/image_thumb40_thumb-629.png\" alt=\"image_thumb[40]\" loading=\"lazy\"></p> <p> 6. Нарешті клацніть <strong> Готово </strong> . </p> <p><img src=\"images/image_thumb41_thumb-225.png\" alt=\"image_thumb[41]\" loading=\"lazy\"></p> <p> </p> <p> 7. Тепер ви можете відкрити зашифровані файли. * </p> <p> * Примітка. Після розшифрування файлів дотримуйтесь інструкцій на <a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> частина 1 </a> вище, щоб повністю видалити шифрування, якщо хочете. </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або ще краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення </p>"}