{"title":"Як керувати мишею за допомогою клавіатури в Windows 10/8/7.","content":"<p> Цей підручник містить інструкції щодо управління мишею за допомогою клавіатури за допомогою функції &quot;Клавіші миші&quot; в Windows. Стаття може бути корисною людям, які не можуть керувати мишею, або в тих випадках, коли миша перестає працювати (або не існує) і ви хочете використовувати клавіатуру як мишу для роботи з комп’ютером, щоб закінчити термінову роботу. </p> <p> <strong> Клавіші миші </strong> Ця функція вбудована в операційні системи Windows 10, 7 або 7 і дозволяє використовувати цифрову клавіатуру для переміщення вказівника миші на екрані та здійснення всіх звичайних дій миші (клацання, подвійне клацання, клацання правою кнопкою миші). </p> <h4> Як використовувати клавіатуру як мишу. </h4> <h6> Спосіб 1. Увімкніть клавіші миші за допомогою комбінації клавіш. * </h6> <p> Перший спосіб переміщення курсору миші [без миші <img src=\"images/wlemoticon-openmouthedsmile-273.png\" alt=\"Open-mouthed smile\" loading=\"lazy\"> ], це увімкнути клавіші миші, використовуючи такий спосіб: </p> <p> 1. Натисніть <strong> зліва ALT </strong> + <strong> зліва SHIFT </strong> + <strong> Num Lock </strong></p> <p><img src=\"images/image_thumb-10-220.png\" alt=\"How to Control Mouse with Keyboard \" loading=\"lazy\"></p> <p> </p> <p> 2. Коли на екрані з’явиться вікно клавіш миші, натисніть <strong> ENTER </strong> щоб увімкнути клавіші MouseKeys. </p> <p><img src=\"images/image_thumb-2-595.png\" alt=\"turn on mouse keys\" loading=\"lazy\"></p> <p> 3. Увімкнувши клавіші миші, ви можете за допомогою клавіатури (цифрової клавіатури) виконувати всі дії миші (переміщення, клацання, клацання правою кнопкою миші, подвійне клацання), як показано на малюнку нижче. * </p> <p> * Примітка: Якщо ви хочете збільшити або зменшити швидкість вказівника, прочитайте інструкції в наступному способі. </p> <p><strong> Функції миші з цифрової клавіатури </strong></p> <p><img src=\"images/image_thumb-8-332.png\" alt=\"mouse functions numeric keypas\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Спосіб 2. Увімкніть клавіші миші з центру простоти доступу. </h6> <p> До другого методу, щоб мати можливість керувати вказівником миші за допомогою клавіатури, слід увімкнути та налаштувати функцію «Клавіші миші» з центру легкого доступу. Для цього: </p> <p> 1. Перейдіть до Панелі керування Windows, встановіть для параметра «Перегляд за» значення <strong> Маленькі іконки </strong> а потім відкрийте <strong> Центр простоти доступу. </strong></p> <p><img src=\"images/image_thumb-3-309.png\" alt=\"use keyboard as mouse\" loading=\"lazy\"></p> <p> </p> <p> 2. Клацніть <strong> Зробіть мишу простішою у використанні. </strong></p> <p><img src=\"images/image_thumb-4-518.png\" alt=\"enable mouse keys - ease of access\" loading=\"lazy\"></p> <p> </p> <p> 3. Потім клацніть <strong> Налаштування клавіш миші </strong> . </p> <p><img src=\"images/image_thumb-9-206.png\" alt=\"Configure Pointer Speed \" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Тепер перевірте <strong> Увімкніть клавіші миші </strong> і натисніть <strong> Подати заявку. </strong><br> <strong> 5. </strong> Тепер спробуйте перемістити курсор миші за допомогою цифрової клавіатури та налаштуйте <strong> Швидкість вказівника </strong> як хочеш. (Клацніть «Застосувати» при кожній зміні та «OK», щоб закрити параметри «Клавіші миші».) </p> <p><img src=\"images/image_thumb-7-340.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Це все! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}