{"title":"Як вимкнути Bitlocker в середовищі відновлення Windows (WinRE).","content":"<p> Цей підручник містить інструкції щодо вимкнення захисту BitLocker та розшифрування зашифрованого диска BitLocker у середовищі відновлення Windows. Інструкції можуть бути корисними, якщо ваш комп&#39;ютер захищений BitLocker і не приймає ключ відновлення Bitlocker або пароль BitLocker під час запуску системи, і ви не можете розблокувати захищений диск BitLocker. </p> <p><img src=\"images/image_thumb-52-511.png\" alt=\"Remove Bitlocker from Windows Recovery Environment \" loading=\"lazy\"></p> <h4></h4> <h4> Як видалити захист BitLocker та розшифрувати зашифрований диск BitLocker у середовищі відновлення Windows (WinRE). </h4> <p><strong> Вимоги: </strong><br> <strong> A </strong> . <strong> Інсталяційний носій Windows 10 (USB або DVD). </strong> Якщо ви не володієте інсталяційним носієм Windows, ви можете створити його за допомогою <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Інструмент створення медіа Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Як створити інсталяційний носій Windows 10 USB. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Як створити інсталяційний носій DVD для Windows 10. </a></li> </ul> <p><strong> B. Ключ відновлення BitLocker або пароль BitLocker: </strong> Щоб вимкнути захист Bitlocker, потрібно мати пароль Bitlocker або ключ відновлення Bitlocker, щоб спочатку розблокувати диск, а потім розшифрувати диск. * </p> <p> * Примітка. Якщо у вас немає ключа відновлення BitLocker, неможливо обійти захист BitLocker. Якщо диск захищений BitLocker, і у вас немає ключа відновлення BitLocker або пароля для розблокування диска, тоді єдиним варіантом (для повторного використання диска) є повне стирання диска за допомогою інструкцій у цій статті: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Як видалити захист BitLocker з диска без ключа відновлення BitLocker або пароля. </a></p> <p> Ключ відновлення Bitlocker - це 48-значний номер, який можна знайти в таких місцях: </p> <ul> <li> На роздруківці, яку ви зберегли, коли ви ввімкнули Bitlocker. </li> <li> На USB-накопичувачі, який ви використовували під час активації Bitlocker, щоб зберегти ключ відновлення Bitlocker. </li> <li> Біля <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Ключі для відновлення облікового запису Microsoft </a> , використовуючи обліковий запис MS, який ви використовуєте для входу на свій пристрій, або ви додали пристрій для завантаження програм із магазину Microsoft, або для активації MS Office або для електронної пошти. </li> <li> На тобі <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Обліковий запис Azure </a> для робочих ПК, які входять за допомогою облікового запису Azure Active Directory. </li> </ul> <p> Знайшовши ключ відновлення BitLocker або пароль ΒitLocker, перейдіть до розблокування зашифрованого диска Bitlocker та видалення шифрування Bitlocker у WinRE, дотримуючись інструкцій нижче. </p> <p> Щоб розблокувати та розшифрувати диск операційної системи C: з WinRE: </p> <p> 1. Завантажте систему з інсталяційного носія Windows 10. <br> 2. На екрані нижче натисніть <strong> SHIFT </strong> + <strong> F10 </strong> клавіші для запуску командного рядка. (або натисніть <strong> Далі </strong> &gt; <strong> Відремонтувати мій комп&#39;ютер </strong> &gt; <strong> Усунення несправностей </strong> &gt; <strong> Командний рядок </strong> ). * </p> <p> * Примітка. Якщо вам було запропоновано ввести ключ відновлення, натисніть <strong> ПРОПУСКАТИ цей диск </strong> . </p> <p><img src=\"images/image_thumb15_thumb-548.png\" alt=\"How to disable-unlock bitlocker from Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. У командному рядку введіть таку команду, щоб переглянути букву диска зашифрованого диска: </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p> </p> <p> 4. Потім приступайте до розблокування зашифрованого диска, використовуючи таку команду, відповідно до вашого випадку: </p> <p><strong> Справа А. </strong> Якщо ви знаєте ключ відновлення BitLocker, введіть цю команду: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -rp BitLocker-ключ відновлення </strong></li> </ul> <p> * наприклад: Якщо ви хочете розблокувати диск &quot;D:&quot;, а ключ відновлення bitlocker: &quot;123456-123456-123456-123456-123456-123456&quot;, введіть: </p> <ul> <li> <ul> <li> manage-bde -unlock <strong> D </strong> : -rp <strong> 123456-123456-123456-123456-123456-123456 </strong></li> </ul> </li> </ul> <p> </p> <p><strong> Справа Б. </strong> Якщо ви знаєте пароль BitLocker для розблокування диска, введіть цю команду: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -pw BitLocker-Password </strong></li> </ul> <p> * наприклад: Якщо ви хочете розблокувати диск &quot;D:&quot;, а пароль BitLocker: &quot;123qwerty&quot;, введіть: * </p> <ul> <li> <ul> <li> manage-bde -unlock <strong> D </strong> : -пароль <strong> 123qwerty </strong></li> </ul> </li> </ul> <p> </p> <p> 5. Потім розшифруйте накопичувач і вимкніть захист BitLocker за допомогою цієї команди: </p> <ul> <li><strong> manage-bde -off drive-letter: </strong></li> </ul> <p> * Наприклад: Якщо ви хочете розшифрувати диск &quot;D:&quot;, введіть: </p> <ul> <li> <ul> <li> manage-bde –off <strong> D </strong> : </li> </ul> </li> </ul> <p> 6. Процес дешифрування із запуском. Щоб знову перевірити стан розшифрування, введіть наступну команду та переконайтеся, що привід є <strong> Повністю розшифровано </strong> і <strong> Розблоковано </strong> : </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p><img src=\"images/image_thumb9_thumb-678.png\" alt=\"decrypt bitlocker encrypted drive windows removery environment\" loading=\"lazy\"></p> <p> </p> <p> 7. Закінчивши, вийміть інсталяційний носій Windows і перезавантажте комп&#39;ютер. * </p> <p> * Примітка. Якщо Windows не може запуститись, підключіть диск до іншого комп’ютера та зробіть резервну копію особистих даних на іншому носії. Тоді <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> діагностувати накопичувач на наявність проблем </a> і якщо все в порядку, покладіть диск назад на комп&#39;ютер і виконайте a <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> чиста інсталяція Windows 10 </a> . </p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про цю проблему. </p>"}