{"title":"Як перезапустити сервер HP із інтерфейсу iLO.","content":"<p> У цьому посібнику ми знайдемо покрокові інструкції щодо того, як перезапустити сервер HP віддалено за допомогою інтерфейсу iLO від HP. HP Integrated Lights-Out (iLO) - це апаратний компонент на серверах HP, який зазвичай інтегрується на системній платі. Компонент iLO має власне мережеве підключення, IP-адресу та веб-інтерфейс і може допомогти користувачеві отримати віддалений доступ до сервера та керувати ним. </p> <h4> Як перезавантажити сервер HP за допомогою веб-інтерфейсу iLO 5. </h4> <p> Щоб перезапустити сервер, якщо він зависає, з інтерфейсу iLO: </p> <p> 1. З іншого комп’ютера відкрийте веб-браузер і в адресному рядку введіть IP-адресу інтерфейсу iLO на сервері, який потрібно перезавантажити. <br> 2. Введіть ім’я користувача та пароль iLO та натисніть <strong> Увійдіть </strong> . </p> <p><img src=\"images/image_thumb-8-790.png\" alt=\"restart hp proliant server from ilo\" loading=\"lazy\"></p> <p> </p> <p> 3. Виберіть <strong> Потужність і тепло </strong> ліворуч. <br> 4. У розділі Кнопка віртуального живлення натисніть кнопку <strong> Скинути </strong> , щоб перезапустити сервер HP. * </p> <p> * Інформація: </p> <ul> <li> Віртуальний <strong> Скинути </strong> кнопка має ту саму функцію, що і кнопка <strong> Перезапустіть </strong> команда в операційній системі (тепле завантаження). </li> <li> Віртуальний <strong> Холодний завантаження </strong> кнопка має таку ж дію, як кнопка <strong> Закрити </strong> команда в операційній системі. Якщо натиснути кнопку «Холодне завантаження», сервер вимкнеться і перезапуститься приблизно через 8 секунд. </li> </ul> <p> <img src=\"images/image_thumb-9-784.png\" alt=\"How to Reboot an HP Server using iLO 5 web interface.\" loading=\"lazy\"></p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}