{"title":"Як завжди відкривати Chrome в режимі анонімного перегляду.","content":"<p> Якщо ви шукаєте спосіб зробити так, щоб Chrome завжди відкривався в режимі анонімного перегляду, продовжуйте читати нижче. Коли ви запускаєте Chrome в режимі анонімного перегляду, активність у веб-переглядачі залишається приватною для інших користувачів, які використовують той самий пристрій. У режимі анонімного перегляду Chrome не зберігає вашу історію перегляду, файли cookie та інформацію, введену у форми. </p> <p> Ручний спосіб розпочати новий сеанс Chrome у режимі анонімного переходу - це перейти в меню Chrome <img src=\"images/image_thumb10_thumb-963.png\" alt=\"image_thumb[10]\" loading=\"lazy\"> і вибрати &quot;Нове вікно анонімного перегляду&quot;, або натиснути CTRL + SHIFT + N. </p> <p><img src=\"images/image_thumb-42-832.png\" alt=\"Chrome New incognito window\" loading=\"lazy\"></p> <p> </p> <p> У цій статті ви знайдете інструкції щодо того, як завжди запускати Google Chrome в режимі анонімного перегляду. </p> <h4> Як завжди запускати Google Chrome в режимі анонімного перегляду. </h4> <p> Якщо ви хочете завжди запускати Chrome в режимі анонімного перегляду, створіть новий ярлик Chrome і змініть його властивості, як показано нижче: </p> <p> 1, <strong> Клацніть правою кнопкою миші </strong> на <strong> Гугл хром </strong> ярлик і виберіть <strong> Властивості </strong> . <br> 2. В <strong> Загальні </strong> на вкладці, додайте перемикач &quot;–incognito&quot; (без лапок), в кінці цільового рядка та натисніть <strong> гаразд </strong> : </p> <p> напр. &quot;C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; –інкогніто </p> <p><img src=\"images/image_thumb-43-798.png\" alt=\"How to Always Open Chrome in Incognito mode.\" loading=\"lazy\"></p> <p> 3. Відтепер, коли ви запускаєте Chrome із модифікованого ярлика, Chrome відкриватиметься в режимі анонімного перегляду. * </p> <p><strong> * ПОРАДА: </strong> Якщо ви хочете відкрити Chrome в режимі анонімного перегляду, відкриваючи гіперпосилання (URL) з електронної пошти чи іншої програми, вам доведеться змінити реєстр. Для цього: </p> <blockquote> <p> 1. Відкрийте <strong> Редактор реєстру </strong> . <br> 2. У реєстрі перейдіть до наступного ключа: </p> <ul> <li> <p> Команда HKEY_CLASSES_ROOT \\ ChromeHTML \\ shell \\ open \\ </p> </li> </ul> <p> 3. На правій панелі двічі клацніть на <strong> За замовчуванням </strong> Значення рядка REG_SZ. </p> </blockquote> <p><img src=\"images/image_thumb-44-612.png\" alt=\"open url in chrome incognito\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. Додайте перемикач, додайте слово &quot;інкогніто&quot; (без лапок), перед &quot;% 1&quot; та натисніть <strong> гаразд </strong> . </p></blockquote> <blockquote><p> напр. Змініть значення значення з: </p> <p> &quot;C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; - &quot;% 1&quot; </p> <p> до: </p> <p> &quot;C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; –інкогніто &quot;% 1&quot; </p></blockquote> <p><img src=\"images/image_thumb-45-148.png\" alt=\"open url chrome incognito - registry\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Відтепер, натискаючи URL-адресу (HTML), Chrome відкриватиме її в режимі анонімного перегляду. </p></blockquote> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}