{"title":"Як переглянути заголовки повідомлень, не відкриваючи повідомлення електронної пошти в Outlook 2016/2019.","content":"<p> Як вам можливо відомо, &quot;Заголовки повідомлень&quot; (вони ж &quot;Джерело повідомлень&quot; або &quot;Інтернет-заголовки&quot; в Outlook) містять усі технічні деталі отриманого повідомлення електронної пошти. Більш конкретно, &quot;Заголовки повідомлень&quot; повідомлення електронної пошти містять, крім звичайної інформації (відправник, час відправлення тощо), програмне забезпечення, що використовується для складання повідомлення, та сервери, які пройшли перед його доставкою вам . </p> <p> Щоб переглянути джерело / заголовки повідомлень у настільній програмі Microsoft Outlook, можна скористатися одним із таких способів: </p> <ol> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Як переглянути заголовки повідомлень у програмі Outlook 2016/2019 після відкриття повідомлення електронної пошти </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Як переглянути заголовки повідомлень у програмі Outlook 2016/2019, не відкриваючи повідомлення електронної пошти. </a></li> </ol> <p> </p> <h2> Як переглянути заголовки повідомлень у програмі Outlook 2016/2019 після відкриття електронної пошти. </h2> <p> Звичайний спосіб відобразити джерело повідомлення електронної пошти в Microsoft Outlook 2016/2019 - це відкрити повідомлення електронної пошти та переглянути його властивості: </p> <p> 1. Відкрийте повідомлення електронної пошти (у власному вікні) та натисніть <strong> Файл </strong> меню. </p> <p><img src=\"images/image_thumb-36-771.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Від <strong> Файл </strong> меню, натисніть <strong> Властивості </strong> . </p> <p><img src=\"images/image_thumb-37-974.png\" alt=\"View message headers outlook\" loading=\"lazy\"></p> <p> </p> <p> 3. Подивіться на <strong> Інтернет-заголовки, </strong> щоб переглянути джерело повідомлення електронної пошти (деталі). </p> <p> * Примітка: Виберіть та скопіюйте текст Інтернет-заголовків у Блокноті для зручнішого читання. </p> <p><img src=\"images/image_thumb-38-976.png\" alt=\"View Internet headers in Outlook\" loading=\"lazy\"></p> <p> </p> <h2> Як переглянути заголовки повідомлень в Outlook 2016/2019 без відкриття повідомлення електронної пошти. </h2> <p> Проблема перегляду джерела повідомлення (Інтернет-заголовків) після відкриття повідомлення електронної пошти полягає в тому, що якщо повідомлення містить шкідливе програмне забезпечення, ви можете піддати свій комп&#39;ютер ризику. Щоб цього уникнути, продовжуйте і дотримуйтесь наведених нижче вказівок, щоб мати змогу прочитати джерело повідомлення, не відкриваючи електронного листа. </p> <p> 1. У головному вікні Outlook виберіть <strong> Файл </strong> -&gt; <strong> Варіанти </strong> . <br> 2. Виберіть <strong> Налаштування стрічки </strong> ліворуч і праворуч: </p> <p> a. В <strong> Виберіть команди з </strong> випадаючий список, виберіть <strong> Команди не на стрічці. <br> </strong> b. Переконайтеся, що на головних вкладках <strong> Головна (пошта) </strong> вибрано і натисніть <strong> Нова група </strong> а потім клацніть <strong> Перейменувати. </strong></p> <p><img src=\"images/image_thumb-39-295.png\" alt=\"How to view the Message Headers in Outlook 2016-2019 \" loading=\"lazy\"></p> <p> c. <strong> Перейменувати </strong> &quot; <strong> Нова група </strong> &quot;до&quot; <strong> Інтернет-заголовки </strong> &quot;і натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb-40-856.png\" alt=\"image\" loading=\"lazy\"></p> <p> d. Тепер вибирай <strong> Параметри повідомлення </strong> зі списку команд і натисніть <strong> Додати </strong> . </p> <p><img src=\"images/image_thumb-41-344.png\" alt=\"image\" loading=\"lazy\"></p> <p> e. Тепер ви повинні побачити &quot;Параметри повідомлень&quot; під новою групою, яку ви створили (&quot;Інтернет-заголовки&quot;). Клацніть <strong> гаразд </strong> застосовувати зміни <strong> . </strong></p> <p><img src=\"images/image_thumb-42-209.png\" alt=\"view message source without opening email outlook\" loading=\"lazy\"></p> <p> 3. Тепер на вашому <strong> Додому </strong> на вкладці ви побачите нову кнопку з назвою &quot;Параметри повідомлень - Інтернет-заголовки&quot;. <br> 5. Відтепер просто виділіть повідомлення, яке хочете переглянути його джерело повідомлення, та натисніть кнопку «Параметри повідомлення», щоб переглянути джерело його повідомлення, не відкриваючи повідомлення у власному вікні. </p> <p><img src=\"images/image_thumb-43-460.png\" alt=\"view headers without opening email outlook\" loading=\"lazy\"></p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}