{"title":"Як захистити свій ПК за допомогою BitLocker у Windows 10.","content":"<p> Цей посібник містить покрокові вказівки щодо захисту паролем ПК за допомогою шифрування BitLocker. BitLocker - це повнофункціональна функція шифрування диска, включена до випусків Windows 10 Professional та Enterprise, і вона може допомогти вам захистити ваші особисті дані від несанкціонованого доступу. </p> <p> Уявіть такий сценарій: Ваш особистий ноутбук викрадений або загублений, а Ваші приватні дані доступні нескромним очам. Щоб цього не сталося, прочитайте цей посібник і дізнайтеся, як захистити свій ПК та цінні дані за допомогою надійного шифрування, щоб стати недоступним для всіх без пароля для розшифрування. </p> <ul> <li><strong> Пов’язана стаття: <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Як захистити папку за допомогою пароля. </a></strong></li> </ul> <h4> Як використовувати BitLocker для шифрування та захисту ПК з Windows 10. </h4> <p> Щоб захистити диск операційної системи за допомогою BitLocker у Windows 10 Pro або Enterprise: </p> <p> 1. З Windows <strong> Панель управління </strong> , натисніть <strong> Система та безпека </strong> а потім клацніть <strong> Шифрування накопичувача бітових шаф </strong> . </p> <p><img src=\"images/image_thumb-33-320.png\" alt=\"How to Protect your PC with BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Біля диска операційної системи C: натисніть <strong> Увімкніть BitLocker </strong> . * </p> <p> * Примітка. Якщо після натискання кнопки &quot;Увімкнути BitLocker&quot; з&#39;являється повідомлення про помилку &quot;Цей пристрій не може використовувати модуль надійної платформи ...&quot;, а потім прочитайте цю статтю, щоб вирішити проблему. </p> <p><img src=\"images/image_thumb-34-100.png\" alt=\"turn on bitlocker operating system drive\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. На наступному екрані виберіть спосіб розблокування диска під час запуску. </p> <blockquote><p> 1. Якщо ви хочете розблокувати свій ПК за допомогою пристрою USB, натисніть <strong> Вставте флешку. <br> </strong> 2. Якщо ви хочете розблокувати свій ПК, ввівши пароль, натисніть <strong> Введіть пароль </strong> . (як у цьому прикладі) </p></blockquote> <p><img src=\"images/image_thumb-35-212.png\" alt=\"enable bitlocker protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Тепер введіть дуже надійний пароль і натисніть <strong> Далі </strong> . </p> <p><img src=\"images/image_thumb-36-435.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Тепер виберіть, де ви хочете зберегти * ключ відновлення, і натисніть <strong> Далі </strong> . * </p> <p> * Наприклад: якщо ви входите в Windows 10 за допомогою облікового запису Microsoft, натисніть <strong> Збережіть у своєму обліковому записі Microsoft. </strong> Якщо ви входите в Windows 10 за допомогою локального облікового запису, виберіть один із інших варіантів. </p> <p> Примітки: <br> 1. Якщо ви збережете ключ відновлення BitLocker у своєму обліковому записі Microsoft, тоді ви зможете переглянути його після входу в систему <a title=\"https://onedrive.live.com/recoverykey.\" href=\"https://onedrive.live.com/recoverykey.\" target=\"_blank\" rel=\"nofollow noopener\"> https://onedrive.live.com/recoverykey. </a><br> 2. Я завжди вважаю за краще зберігати ключ відновлення на USB-накопичувачі, щоб бути готовим до вирішення проблем із BitLocker. </p> <p> </p> <p><img src=\"images/image_thumb-37-801.png\" alt=\"save bitlocker recovery key\" loading=\"lazy\"></p> <p> </p> <p> 6. На наступному екрані залиште налаштування за замовчуванням, якщо ваш ПК та / або диск новий, а потім натисніть <strong> Далі </strong> знову. </p> <p><img src=\"images/image_thumb-38-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. У параметрах режиму шифрування залиште налаштування за замовчуванням та натисніть <strong> Далі </strong> . </p> <p><img src=\"images/image_thumb-39-785.png\" alt=\"bitlocker encryption mode\" loading=\"lazy\"></p> <p> </p> <p> 8. На останньому екрані натисніть <strong> Продовжуйте </strong> , щоб перезапустити та перевірити систему перед увімкненням захисту BitLocker. </p> <p><img src=\"images/image_thumb-40-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Під час перезапуску вам буде запропоновано ввести пароль BitLocker. Введіть свій пароль і натисніть <strong> Введіть </strong> . * </p> <p> * Примітка: Якщо BitLocker не може прийняти пароль або якщо у вас виникли інші проблеми, спробуйте виконати одну з таких дій для входу в Windows: </p> <blockquote><p> 1. Натисніть клавішу ESC на екрані Пароль BitLocker, щоб отримати доступ до опцій відновлення. <br> 2. Натисніть кілька разів клавішу ESC після увімкнення ПК, щоб обійти тест BitLocker. </p></blockquote> <p> 10. Якщо тести BitLocker пройшли, після завантаження до Windows 10 BitLocker почне шифрувати диск вашої операційної системи. Щоб переглянути стан процесу шифрування, клацніть сповіщення BitLocker на панелі завдань або перейдіть до Панелі керування&gt; Шифрування диска BitLocker. </p> <p><img src=\"images/image_thumb-41-171.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}