{"title":"Як увімкнути захист відновлення системи в ОС Windows 10/8/7.","content":"<p> Цей підручник містить інструкції щодо ввімкнення захисту системи в ОС Windows 10, 8 та 7. Захист відновлення системи (загальновідомий як &quot;Захист системи&quot;) - це функція Windows, яка дозволяє вам це робити <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> відновлювати </a> якщо система не працює належним чином після значних змін у системних файлах (наприклад, після оновлення Windows або після вірусної атаки). </p> <p> Інструмент відновлення системи використовує службу Volume Shadow Copy для створення знімків системних файлів та реєстру Windows та зберігає їх як точки відновлення. Ці &quot;Точки відновлення&quot; можна використовувати для відновлення системи до попереднього робочого стану, якщо Windows не завантажується або стає нестабільною, без необхідності переінсталювати операційну систему. </p> <h4> Як увімкнути захист відновлення системи в Windows 10. </h4> <p> 1. Відкрийте провідник Windows, клацніть правою кнопкою миші на піктограмі &quot;Цей ПК&quot; і виберіть <strong> Властивості </strong> . </p> <p><img src=\"images/image_thumb-70-672.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Виберіть <strong> Захист системи </strong> зліва. </p> <p><img src=\"images/image_thumb-71-762.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Виділіть <strong> Локальний диск C: (система) </strong> і натисніть <strong> Налаштуйте. </strong></p> <p><img src=\"images/image_thumb-72-782.png\" alt=\"turn on system restore protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. У меню Параметри захисту виберіть <strong> Увімкніть захист системи </strong> і натисніть <strong> ГАРАЗД. * </strong></p> <p> * Примітка: Якщо &quot;Захист системи: вже ввімкнено, то з вами все гаразд. </p> <p><img src=\"images/image_thumb-73-192.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 5. Нарешті, у меню Параметри захисту натисніть <strong> Створити </strong> створити знімок (Точка відновлення) поточного стану системи. </p> <p><img src=\"images/image_thumb-75-308.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Це все! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}