{"title":"Як вимкнути BitLocker у Windows 10.","content":"<p> Цей підручник містить вказівки щодо вимкнення захисту Bitlocker та шифрування дисків у Windows 10. Як ви вже знаєте, функція шифрування BitLocker, яка доступна у Windows 10 pro та для корпоративних версій, може допомогти вам захистити вміст ПК від несанкціонованого доступу. Але іноді виникає необхідність вимкнути Bitlocker у Windows 10, тому в цьому посібнику ви знайдете, як це зробити. </p> <p> Якщо ваш комп&#39;ютер захищений BitLocker, то під час запуску системи вам буде запропоновано підключити USB-накопичувач, який ви використовували під час активації BitLocker, або ввести свій пароль BitLocker для розблокування диска C: для продовження завантаження. Якщо у вас немає жодного з них, натисніть <strong> ВИХІД </strong> , щоб ввести ключ відновлення BitLocker. * </p> <blockquote><p> * Примітки: <br> 1. Якщо ключ або пароль для відновлення Bitlocker не приймаються під час запуску системи, спробуйте розблокувати та розшифрувати жорсткий диск на інший комп’ютер Windows 10 або спробуйте: <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-recovery-environment-winre/\" target=\"_blank\" rel=\"nofollow noopener\"> Розблокуйте та розшифруйте захищений диск у середовищі відновлення Windows (WinRE). </a><br> 2. Якщо ви не можете розблокувати диск (наприклад, якщо вам не належить ключ відновлення BitLocker або тому, що ключ BitLocker не прийнятий), і ви хочете видалити шифрування BitLocker, щоб знову використовувати захищений диск, прочитайте цей посібник: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Як видалити захист BitLocker з диска без ключа відновлення BitLocker або пароля </a> . </p></blockquote> <p><img src=\"images/image_thumb-53-752.png\" alt=\"How to Disable BitLocker in Windows 10 GUI - PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Після завантаження до Windows виконайте наведені нижче вказівки, щоб вимкнути захист Bitlocker та розшифрувати диск. </p> <h4> Як вимкнути захист BitLocker та розшифрувати зашифрований диск Bitlocker у Windows 10. </h4> <p> Для того, щоб вимкнути захист Bitlocker, потрібно мати пароль Bitlocker або ключ відновлення Bitlocker, щоб спочатку розблокувати диск, а потім розшифрувати диск. </p> <p> Ключ відновлення Bitlocker - це 48-значний цифровий ключ, який можна знайти в таких місцях: </p> <ul> <li> На роздруківці, яку ви зберегли, коли ви ввімкнули Bitlocker. </li> <li> На USB-накопичувачі, який ви використовували під час активації Bitlocker, щоб зберегти ключ відновлення Bitlocker. </li> <li> Біля <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Ключі для відновлення облікового запису Microsoft </a> , використовуючи обліковий запис MS, який ви використовуєте для входу на свій пристрій, або ви додали пристрій для завантаження програм із магазину Microsoft, або для активації MS Office або для електронної пошти. </li> <li> На тобі <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Обліковий запис Azure </a> для робочих ПК, які входять за допомогою облікового запису Azure Active Directory. </li> </ul> <p> Коли ви знайдете ключ відновлення Bitlocker або пароль Bitlocker, перейдіть до розблокування зашифрованого диска Bitlocker та видалення шифрування Bitlocker, використовуючи один із наступних способів: </p> <ul> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Спосіб 1. Вимкніть захист BitLocker із графічного інтерфейсу Windows. </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Спосіб 2. Вимкніть BitLocker і розшифруйте зашифрований диск Bitlocker із PowerShell. </a></li> </ul> <p> </p> <h6> Спосіб 1. Як вимкнути захист Bitlocker в графічному інтерфейсі Windows 10. </h6> <p> Щоб вимкнути захист на системному диску C: </p> <p> 1. Перейдіть до Windows <strong> Панель управління </strong> -&gt; <strong> Система та безпека </strong> а потім клацніть <strong> Шифрування накопичувача бітових шаф </strong> . </p> <p><img src=\"images/image_thumb-33-233.png\" alt=\"How to turn off or Turn Onn BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Біля диска операційної системи C: натисніть <strong> Вимкніть BitLocker </strong> . * </p> <p> * Примітки: <br> 1. Якщо опція &quot;Вимкнути BitLocker&quot; недоступна, відкрийте <strong> командний рядок як адміністратор </strong> і дайте наступну команду: </p> <ul> <li> manage-bde -off C: </li> </ul> <p> 2. Щоб побачити стан дешифрування (прогрес) накопичувача C:, дайте цю команду: </p> <ul> <li> manage-bde -status C: </li> </ul> <p> </p> <p> </p> <p><img src=\"images/image_thumb-43-236.png\" alt=\"turn off bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Після вимкнення Bitlocker натисніть кнопку Bitlocker на панелі завдань, щоб переглянути процес дешифрування. </p> <p><img src=\"images/image_thumb-41-694.png\" alt=\"remove bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Щоб вимкнути захист будь-якого іншого захищеного диска BitLocker із графічного інтерфейсу Windows: </p> <p> 1. Відкрийте Провідник Windows, а потім двічі клацніть на заблокованому диску. <br> 2. Введіть пароль Bitlocker або натисніть <strong> Більше варіантів </strong> щоб ввести ключ відновлення Bitlocker, щоб розблокувати диск. </p> <p><img src=\"images/image_thumb-47-646.png\" alt=\"unlock bitlocker windows 10\" loading=\"lazy\"></p> <p> 2. Після розблокування диска перейдіть до <strong> Панель управління </strong> -&gt; <strong> Система та безпека </strong> -&gt; <strong> Шифрування накопичувача бітових шаф </strong> і після вибору приводу натисніть <strong> Вимкніть BitLocker </strong> для розшифровки диска. (див. скріншоти вище) </p> <p> </p> <h6> Спосіб 2. Як вимкнути захист BitLocker та розшифрувати зашифрований диск Bitlocker із PowerShell у Windows 10. </h6> <p> 1. Відкрийте PowerShell від імені адміністратора. Для цього: </p> <ol> <li> <ol> <li> В <strong> Кортана </strong> Вікно пошуку, введіть <strong> PowerShell </strong></li> <li> Клацніть правою кнопкою миші <strong> Windows PowerShell </strong> результат і виберіть <strong> Запустити від імені адміністратора. </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb_thumb-1-316.png\" alt=\"disable bitlocker powershell windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Потім перевірте стан шифрування кожного диска на вашому комп’ютері, ввівши цю команду: </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p> </p> <p> 3. Зверніть увагу, на якій букві диска відображається статус блокування <strong> Заблоковано </strong> , а потім перейдіть до розблокування цього диска, ввівши цю команду: * </p> <ul> <li><strong> manage-bde -unlock drive-letter: -rp BitLocker-ключ відновлення </strong></li> </ul> <p> * наприклад: Якщо ви хочете розблокувати диск &quot;D:&quot;, а ключ відновлення bitlocker: &quot;123456-123456-123456-123456-123456-123456&quot;, введіть: </p> <ul> <li> <ul> <li> manage-bde -unlock D: -rp 123456-123456-123456-123456-123456-123456 </li> </ul> </li> </ul> <p> </p> <p> * Примітка: Якщо ви знаєте пароль Bitlocker, введіть цю команду: </p> <ul> <li><strong> manage-bde -unlock drive-letter: -pw BitLocker-Password </strong></li> </ul> <p> * наприклад: Якщо ви хочете розблокувати диск &quot;D:&quot;, а пароль BitLocker: &quot;123qwerty&quot;, введіть: * </p> <ul> <li> <ul> <li> manage-bde -unlock D: -пароль 123qwerty </li> </ul> </li> </ul> <p> </p> <p> 4. Потім вимкніть шифрування bitlocker і розшифруйте зашифрований диск, використовуючи одну з наступних команд: </p> <ul> <li><strong> Disable-BitLocker -MountPoint &quot;буква-диск:&quot; </strong></li> <li><strong> manage-bde -off drive-letter: </strong></li> </ul> <p> * наприклад: Якщо ви хочете відключити шифрування bitlocker на диску &quot;D:&quot;, введіть: </p> <ul> <li> <ul> <li> Disable-BitLocker -MountPoint &quot;D:&quot; </li> </ul> </li> </ul> <blockquote> <p> АБО наберіть… </p> </blockquote> <ul> <li> <ul> <li> manage-bde –off D: </li> </ul> </li> </ul> <p> 5. Коли процес дешифрування завершено, перейдіть до повторної перевірки стану шифрування, давши цю команду: </p> <ul> <li><strong> manage-bde -status </strong></li> </ul> <p> 6. Якщо відображається &quot;Статус блокування&quot; <strong> Розблоковано </strong> і відображається &quot;Статус перетворення&quot; <strong> Повністю розшифровано, </strong> готово! </p> <p><img src=\"images/image_thumb-50-868.png\" alt=\"view bitlocker status\" loading=\"lazy\"></p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про цю проблему. </p>"}