{"title":"Як перевстановити Windows 10, якщо Windows не завантажується.","content":"<p> У цьому посібнику ви знайдете детальну інструкцію щодо перевстановлення Windows 10, якщо Windows не завантажується. У попередньому підручнику я згадав шлях до <a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"nofollow noopener\"> переінсталюйте Windows 10 за допомогою функції «СКИНАТИ цю функцію ПК </a> . Але функція &quot;СКИДАТИ цей ПК&quot; доступна лише в тому випадку, якщо Windows 10 може нормально завантажуватися або якщо ви можете запустити меню &quot;Розширений запуск&quot; після завантаження в Windows. (Параметр &quot;СКИДАТИ цей ПК&quot; недоступний під час завантаження з USB). </p> <p> Цей підручник містить інструкції щодо перевстановлення Windows 10, якщо Windows не завантажується, не втрачаючи файли. </p> <h2> Як перевстановити пару Windows 10, якщо Windows не може запуститися. </h2> <p><strong> Вимоги </strong> : Для того, щоб перевстановити Windows 10, якщо Windows не запускається нормально, вам потрібно буде завантажити комп’ютер із інсталяційного носія Windows (USB або DVD) і ввімкнути меню Додаткові параметри (меню клавіші F8). Якщо ви не є власником інсталяційного носія Windows, ви можете створити його за допомогою <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Інструмент створення медіа Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Як створити інсталяційний носій Windows 10 USB. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Як створити інсталяційний носій DVD для Windows 10. </a></li> </ul> <p> 1. Завантажте комп&#39;ютер із інсталяційного носія Windows. <br> 3. Натисніть <strong> Далі </strong> на екрані Мовні параметри. <br> 4. Виберіть <strong> Відремонтуйте комп’ютер </strong> . <br> 5. Тоді вибирай <strong> Усунення несправностей -&gt; </strong><strong> Додаткові параметри -&gt; Командний рядок. </strong></p> <p> 6. У вікні командного рядка введіть таку команду та натисніть <strong> Введіть: </strong></p> <ul> <li><strong> bcdedit / set {default} bootmenupolicy legacy </strong></li> </ul> <p><img src=\"images/image_thumb-33-821.png\" alt=\"advanced boot options\" loading=\"lazy\"></p> <p> 7. Тип <strong> вихід </strong> щоб закрити вікно командного рядка. <br> 8. Вийміть інсталяційний носій Windows. <br> 9. Закрийте всі вікна, щоб перезавантажити або вимкнути ПК. </p> <p> 10. <strong> Натисніть </strong> <strong> F8 </strong> ключ <strong> неодноразово </strong> під час увімкнення комп&#39;ютера. </p> <p> 11. У &quot;Меню додаткових параметрів&quot; виділіть &quot; <strong> Відремонтуйте комп’ютер </strong> &quot;, а потім натисніть <strong> ENTER </strong> . </p> <p><img src=\"images/image_thumb-13-334.png\" alt=\"Repair your Computer in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 12. На екрані &quot;Виберіть варіант&quot; виберіть <strong> Усунення несправностей </strong> а потім клацніть <strong> Скинути цей ПК -&gt; Зберігати мої файли. </strong> * </p> <p> Примітки: <br> 1. &quot; <strong> Зберігати мої файли &quot; </strong> параметр, видалить усі ваші програми та налаштування, але збереже ваші особисті файли. <br> 2. <strong> &quot;Видалити все&quot; </strong> параметр, видалить усі програми, налаштування та файли. Вибравши цю опцію, ваш ПК буде відновлено до чистого стану. <br> 3. Якщо ви вирішите &quot;Видалити все&quot;, переконайтеся, що у вас нещодавно було зроблено резервну копію ваших особистих файлів на інший носій (наприклад, на USB-диск), інакше всі ваші файли будуть втрачені. </p> <p><img src=\"images/image_thumb-14-296.png\" alt=\"How to Reinstall Windows 10 if Windows Won't Boot.\" loading=\"lazy\"></p> <p> </p> <p> 13. На наступному екрані виберіть обліковий запис із правами адміністратора. ) і на наступному екрані введіть свій пароль і натисніть <strong> Далі </strong> . </p> <p><img src=\"images/image_thumb-15-869.png\" alt=\"How to Reinstall Windows 10 if Windows cannot Boot.\" loading=\"lazy\"></p> <p> 14. Введіть пароль для вибраного облікового запису та натисніть <strong> Продовжуйте. </strong></p> <p><img src=\"images/image_thumb-16-692.png\" alt=\"How to Reinstall Windows 10 if Windows fails to boot.\" loading=\"lazy\"></p> <p> </p> <p> 15. Зачекайте, поки встановлення буде завершено. </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про цей посібник. </p>"}