{"title":"Як запобігти Windows 10 автоматично встановлювати мережеві принтери.","content":"<p> Як ви вже могли помітити, Windows 10 автоматично встановлює драйвери для будь-якого підключеного до мережі принтера або іншого пристрою. Але, хоча це дуже корисна функція, вона також дуже дратує, особливо в бізнес-середовищі, де ви можете не хотіти, щоб усі принтери використовувались усіма користувачами мережі. </p> <p> Звичайно, якщо ви не хочете мережевий пристрій та програми його виробника, ви можете видалити його зі своєї системи. Але Windows 10 автоматично встановить його знову. Щоб цього уникнути, потрібно заборонити Windows автоматично встановлювати підключені до мережі пристрої (принтери, сканери, камери тощо), а також їх програми та митні значки від виробника. </p> <h3> Як ЗУПИНИТИ Windows 10 для автоматичного встановлення мережевих пристроїв та програм. </h3> <p> 1. Перейдіть до <strong> Панель управління </strong> . Для цього: </p> <blockquote><p> a. Введіть &quot;панель управління&quot; у вікні пошуку Windows <br> b. Клацніть <strong> Панель управління </strong> з результатів. </p></blockquote> <p><img src=\"images/image_thumb-53-862.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Встановіть <strong> Переглянути </strong> до <strong> Маленькі іконки </strong> , щоб переглянути всі елементи панелі керування, а потім клацніть <strong> Центр мереж та спільного використання. </strong></p> <p><img src=\"images/image_thumb-37-625.png\" alt=\"control panel network and sharing center\" loading=\"lazy\"></p> <p> </p> <p> 3. Виберіть <strong> Розширені налаштування спільного доступу </strong> ліворуч <strong> . </strong></p> <p><img src=\"images/image_thumb-38-656.png\" alt=\"Prevent Windows 10 to Install Network Printers Automatically\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Зніміть &quot; <strong> Увімкнути автоматичне налаштування підключених до мережі пристроїв &quot; </strong> і натисніть <strong> Зберегти зміни. </strong></p> <p><img src=\"images/image_thumb-39-992.png\" alt=\"Turn Off automatic setup of network connected devices \" loading=\"lazy\"></p> <p> </p> <p><strong> Необов’язково: </strong> Якщо ви хочете заборонити Windows 10 автоматично завантажувати та встановлювати програми виробника та власні піктограми для будь-якого підключеного пристрою на вашому ПК, тоді: </p> <blockquote><p> 1. Перейдіть до <strong> Панель управління </strong> -&gt; <strong> Система </strong> . <br> 2. Клацніть <strong> Захист системи </strong> ліворуч. <br> 3. На вкладці Обладнання натисніть <strong> Налаштування установки пристрою </strong> . </p></blockquote> <p><img src=\"images/image_thumb-40-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. У розділі &quot;Налаштування установки пристрою&quot; виберіть &quot; <strong> Ні (пристрій може не працювати належним чином) &quot; </strong> і натисніть <strong> Зберегти зміни </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-728.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про цей посібник. </p>"}