{"title":"Як заблокувати YouTube у Windows 10.","content":"<p> Оскільки дистанційне навчання стало частиною життя дітей протягом останніх років, багато батьків шукають спосіб заблокувати відео на YouTube під час електронного навчання або зменшити кількість часу, який діти проводять за комп’ютером, переглядаючи відео, замість того, щоб займатися іншими справами. </p> <p> Окрім звикання до YouTube, яке турбує батьків, за останні роки було випущено багато відео YouTube із неприйнятним або небезпечним вмістом для дітей, і з цієї причини необхідно обмежити доступ до YouTube, особливо коли батьківський нагляд відсутній. </p> <p> У цьому посібнику ви дізнаєтесь, як заборонити доступ до веб-сайту YouTube у всіх браузерах. * </p> <p> * Примітка. Якщо ви хочете заблокувати веб-сайт лише в Chrome або у Firefox, прочитайте цю статтю: <a href=\"https://www.repairwin.com/block-websites-on-chrome-firefox/\" target=\"_blank\" rel=\"nofollow noopener\"> Як блокувати веб-сайти в Chrome і Firefox. </a></p> <h2> Як заблокувати YouTube у будь-якому браузері в ОС Windows 10, 8 або 7. </h2> <p> Найбільш надійним способом блокування будь-якого веб-сайту в будь-якому браузері на ПК з Windows є використання файлу &quot;hosts&quot;. <strong> господарі </strong> файл - це файл операційної системи, який відображає імена хостів (імена доменів) на IP-адреси. Простими словами, коли ви вводите адресу веб-сайту у своєму браузері, комп’ютер спочатку дивиться на локальний <strong> господарі </strong> файл для вирішення його IP-адреси. Якщо ім&#39;я сайту не відображається у файлі хоста, він намагається знайти його IP-адресу в службі DNS, яку ви використовуєте на своєму пристрої. </p> <p> Щоб заблокувати YouTube у будь-якому веб-браузері (наприклад, Chrome, Firefox, Edge тощо) у Windows за допомогою файлу hosts: </p> <p> 1. Відкрити <strong> Блокнот </strong> застосування <strong> як адміністратор </strong> . Для цього: </p> <blockquote><p> a. Тип <strong> блокнот </strong> у вікні пошуку </p> <p> b. <strong> Клацніть правою кнопкою миші </strong> на <strong> Блокнот </strong> і виберіть <strong> Запустити від імені адміністратора </strong> . </p> <p><img src=\"images/image_thumb-584.png\" alt=\"run notepad as administrator\" loading=\"lazy\"></p></blockquote> <p> </p> <p> 2. Від <strong> Файл </strong> меню, виберіть <strong> Відчинено. <br> </strong> 3. Перейдіть до цього місця на диску: </p> <ul> <li> C: \\ Windows \\ System32 \\ drivers \\ тощо </li> </ul> <p> 4. Змініть &quot;Тип файлу&quot; на <strong> Усі файли </strong> а потім відкрийте <strong> господарі </strong> файл </p> <p><img src=\"images/image_thumb-1-968.png\" alt=\"block sites hosts file\" loading=\"lazy\"></p> <p> </p> <p> 5. В кінці додайте наступні рядки: * </p> <ul> <li> 127.0.0.1 youtube.com </li> <li> 127.0.0.1 www.youtube.com </li> <li> 127.0.0.1 m.youtube.com </li> </ul> <p> * Примітка: Натисніть TAB, набравши 127.0.0.1 </p> <p><img src=\"images/image_thumb-2-460.png\" alt=\"block youtube hosts\" loading=\"lazy\"></p> <p> </p> <p> 6. Після закінчення натисніть <strong> Файл </strong> &gt; <strong> Зберегти </strong> і закрийте блокнот. </p> <p> 7. Нарешті відкрийте браузер і спробуйте відвідати YouTube. Зазвичай ви повинні отримати повідомлення: &quot;Підключіться до Інтернету. Ви в автономному режимі. Перевірте з’єднання&quot;. </p> <p><img src=\"images/image_thumb-3-490.png\" alt=\"block youtube.com hosts\" loading=\"lazy\"></p> <p> </p> <p> 8. Ви закінчили. Якщо ви хочете розблокувати YouTube у майбутньому, просто виконайте ті самі дії. але цього разу видаліть три (3) додані рядки у файлі hosts, або введіть символ <strong> # </strong> перед кожним доданим рядком. </p> <p> Це все, шановні! Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}