{"title":"Як відкрити PowerShell як адміністратор у поточній папці у Провіднику файлів (Windows 10)","content":"<p> Якщо ви хочете відкрити PowerShell або PowerShell як адміністратор, у будь-якому місці / папці у Провіднику файлів, продовжуйте читати цей посібник. Як ви знаєте, звичайними способами відкрити PowerShell у Windows 10 є пошук за допомогою пошуку Cortana або (швидший) натискання кнопки <strong> Виграй <img src=\"images/image_thumb8_thumb_thumb-479.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"></strong> + <strong> X </strong> клавіші, щоб відкрити &quot;Меню досвідченого користувача&quot; та запустити звідти Windows PowerShell. </p> <p><img src=\"images/image_thumb-54-350.png\" alt=\"PoweShell Admin (Win + X menu)\" loading=\"lazy\"></p> <p> </p> <p> Хоча ці методи корисні, іноді виникає потреба відкрити PowerShell у певному місці / папці. Для цього дотримуйтесь інструкцій нижче. </p> <h4> Як відкрити оболонку Windows PowerShell у певному місці в Windows 10. </h4> <p> 1. Перейдіть до папки, де ви хочете відкрити PowerShell. <br> 2. <strong> Постривай </strong> <strong> SHIFT </strong> ключ і <strong> клацніть правою кнопкою миші </strong> в будь-якому місці всередині папки. <br> 3. У меню правою кнопкою миші виберіть <strong> Відкрийте тут вікно PowerShell </strong> до <strong> </strong> відкрити нове вікно PowerShell у цій папці. </p> <p> </p> <p><img src=\"images/image_thumb-55-793.png\" alt=\"Open PoweShell at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Якщо ви хочете відкрити &quot;PowerShell As Admin&quot; у будь-якій папці, натисніть кнопку <strong> Файл </strong> меню та виберіть <strong> Відкрийте Windows PowerShell як адміністратор </strong> . * </p> <p> * Примітка. Як ви можете бачити з меню &quot;Файл&quot;, ви також можете відкрити &quot;просте&quot; вікно PowerShell. </p> <p><img src=\"images/image_thumb-56-830.png\" alt=\"Open PoweShell As Administrator at any Location-Folder\" loading=\"lazy\"></p> <p> </p> <p><strong> Додаткова допомога: </strong> Якщо ви любитель комбінацій клавіш, інший спосіб відкрити PowerShell (адміністратор) - натиснути <strong> Alt </strong> + <strong> F </strong> + <strong> S </strong> + <strong> A </strong> ключі по порядку. </p> <p> Це все, шановні! Вам це вдалося? Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}