{"title":"Як створити резервну копію особистих файлів за допомогою історії файлів у Windows 10.","content":"<p> У цьому посібнику я покажу вам, як налаштувати Windows 10 для автоматичного створення копій та знімків ваших файлів за допомогою інструмента резервного копіювання історії файлів, щоб мати можливість їх відновити (за потреби) за допомогою &quot;Відновити попередні версії&quot; особливість. </p> <p> Як ви вже могли помітити, за замовчуванням Windows 10 не зберігає попередні версії ваших файлів або папок, як у Windows 7. Це відбувається, оскільки Windows 10 більше не використовує послугу &quot;Volume Shadow Copy&quot; робити знімки ваших файлів, але замість цього він використовує лише інструмент резервного копіювання &quot;Історія файлів&quot;. </p> <p> &quot;Історія файлів&quot; - це чудовий вбудований інструмент резервного копіювання в Windows 10, який можна налаштувати для передачі копій та знімків ваших файлів в інше місце зберігання, ніж основний диск (наприклад, на USB-пристрій, мережу тощо) . * </p> <p> * Примітка: Єдиним обмеженням інструмента &quot;Історія файлів&quot; є те, що не дозволяє вибрати диск C: як альтернативне місце резервного копіювання. якщо у вас немає вторинного накопичувача, доступного для резервного копіювання, продовжуйте читати цей посібник, щоб дізнатися, як обійти це обмеження ... </p> <ul> <li><strong> Пов’язана стаття: </strong> <a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Як створити тіньові копії ваших файлів за допомогою планувальника завдань у Windows 10. </a></li> </ul> <h4> Як створити резервну копію особистих файлів за допомогою інструмента резервного копіювання історії файлів у Windows 10. </h4> <p> 1. Як я вже згадував вище, для резервного копіювання файлів за допомогою інструмента резервного копіювання історії файлів потрібно мати доступний накопичувач, підключений до ПК (наприклад, USB-накопичувач), або мережеве розташування (наприклад, інший комп’ютер у мережі , або накопичувач NAS). * </p> <p> * Примітка. Якщо у вас немає іншого запам&#39;ятовуючого пристрою, у вас є такі варіанти: </p> <blockquote><p> А. До <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> зменшити розмір основного диска C: \\ </a> і з наявним вільним простором створити новий диск для зберігання резервної копії або… </p> <p> B. Для збереження резервної копії на головному диску C: \\. У цьому випадку створіть нову папку на диску C: і назвіть її &quot;FileHistory&quot; (або що завгодно) і продовжуйте нижче ... </p></blockquote> <p> 2. Перейдіть до Windows <strong> Панель управління </strong> і під <strong> Система та безпека, </strong> натисніть <strong> Зберегти резервну копію </strong><strong> копії ваших файлів за допомогою історії файлів. </strong></p> <p><img src=\"images/image_thumb-42-924.png\" alt=\"How to Backup & Keep Previous Versions of Files in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 3. Тепер, відповідно до вашої справи, виконайте наступне: </p> <ul> <li><strong> Справа А. </strong> Якщо у вас є вільний диск для резервної копії, тоді: </li> </ul> <blockquote><p> a. Клацніть на <strong> Ввімкнути </strong> на екрані, щоб увімкнути &quot;Історію файлів&quot;. <br> b. Продовжувати <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> крок-4 </a> нижче, щоб налаштувати параметри резервного копіювання &quot;Історія файлів&quot;. </p></blockquote> <p><img src=\"images/image_thumb-44-788.png\" alt=\"Turn On File History Windows 10\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Випадок B: </strong> Якщо у вас немає вільного диска для резервної копії історії файлів або якщо ви хочете зберегти резервну копію в мережі, тоді: </li> </ul> <blockquote><p> a. Клацніть <strong> Виберіть мережеве розташування. </strong></p></blockquote> <p><img src=\"images/image_thumb-56-796.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. На наступному екрані: </p> <p> 1. Якщо ви хочете зберегти резервну копію в Мережі, введіть повний мережевий шлях до місця зберігання резервної копії та натисніть <strong> Виберіть папку </strong> . </p> <p> 2. Якщо ви хочете зберегти резервну копію на основному диску C: \\, введіть повний мережевий шлях до локальної папки резервного копіювання на диску C: \\, за такою формою: * </p> <ul> <li> <strong> \\\\ Ім&#39;я комп&#39;ютера \\ C $ \\ FileHistory </strong></li> </ul> <p> * Примітки: <br> 1. Замініть значення &quot;Computer-Name&quot; на ім&#39;я вашого ПК. (Щоб знайти назву свого комп&#39;ютера, клацніть правою кнопкою миші на піктограмі &quot;Цей ПК&quot; у Провіднику Windows). <br> 2. Майте на увазі, що збереження резервної копії ваших особистих файлів на тому самому диску, де вони вже зберігались <strong> не є надійним рішенням </strong> . Щоб бути в безпеці, завжди зберігайте резервну копію на іншому накопичувачі. </p></blockquote> <p> наприклад: якщо ім&#39;я комп&#39;ютера &quot;Pegasus&quot;, введіть: &quot;\\\\ Pegasus \\ C $ \\ FileHistory&quot; </p> <p><img src=\"images/image_thumb-53-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> c. На наступному екрані натисніть <strong> гаразд </strong> . </p></blockquote> <p><img src=\"images/image_thumb-54-349.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> d. Тепер натисніть <strong> Ввімкнути </strong> кнопку, щоб увімкнути інструмент резервного копіювання історії файлів, а потім продовжуйте, щоб налаштувати параметри резервного копіювання. </p></blockquote> <p><img src=\"images/image_thumb-48-620.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Щоб налаштувати параметри резервного копіювання &quot;Історія файлів&quot;, натисніть <strong> Розширені налаштування </strong> ліворуч. </p> <p><img src=\"images/image_thumb-49-919.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4а. Потім о <strong> Розширені налаштування </strong> параметри, встановіть, як часто робити резервні копії файлів і як довго зберігати збережені версії. Після закінчення натисніть <strong> Зберегти зміни </strong> . </p> <p><img src=\"images/image_thumb-61-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Нарешті клацніть <strong> Біжи зараз </strong> взяти свою першу резервну копію. * </p> <p><img src=\"images/image_thumb-55-463.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Додаткова довідка - Примітки: <br> 1. За замовчуванням «Історія файлів» робить резервну копію папок «Бібліотеки» (Робочий стіл, Документи, Вибране, Музика, OneDrive, Картинки та Відео). Якщо ви хочете виключити одну з цих папок із резервної копії, включити інші папки або переглянути всі параметри резервної копії історії файлів, перейдіть до: </p> <ul> <li> <p><strong> Налаштування <img src=\"images/image_thumb-58-467.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Оновлення та безпека </strong> &gt; <strong> Резервне копіювання </strong> &gt; <strong> Більше варіантів. </strong></p> </li> </ul> <p><img src=\"images/image_thumb-57-938.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Щоб відновити файли із резервної копії &quot;Історія файлів&quot;, перейдіть до одного з таких місць: </p> <ul> <li><strong> Панель управління </strong> &gt; <strong> Історія файлів </strong> &gt; <strong> Відновити особисті файли. </strong></li> <li><strong> Налаштування <img src=\"images/image_thumb-59-275.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Оновлення та безпека </strong> &gt; <strong> Резервне копіювання </strong> &gt; <strong> Більше варіантів </strong> &gt; <strong> Відновлення файлів із поточної резервної копії. </strong></li> </ul> <p> 3. Щоб вибірково відновити файл або папку до попередньої версії, клацніть правою кнопкою миші на файлі (або папці) та виберіть <strong> Відновити попередні версії </strong> . </p> <p><img src=\"images/image_thumb-60-867.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Це все! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}