{"title":"Як ділитися файлами та папками в ОС Windows 10, 8.1 або 7.","content":"<p> Функція спільного використання файлів у Windows дає вам можливість легко обмінюватися папками та файлами між користувачами у вашій мережі. Спільно використовуючи свої файли з іншими користувачами в одній мережі, ви зможете переглядати та працювати з тими самими файлами / папками. </p> <p> Цей підручник містить інструкції щодо спільного використання папок та / або файлів в операційних системах Windows 10, 8, 8.1 або 7. </p> <h4> Як увімкнути спільний доступ до файлів у Windows. </h4> <h5> Крок 1. Додайте потрібних користувачів на свій ПК. </h5> <p> Перш ніж продовжувати ділитися своїми файлами з іншими, додайте користувачів, які матимуть доступ до спільної папки на комп&#39;ютері. Щоб виконати це завдання, дотримуйтесь інструкцій у наступних статтях відповідно до вашої версії Windows. </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-create-a-new-user-in-windows-7\" target=\"_blank\" rel=\"nofollow noopener\"> Як додати нового користувача в Windows 7. </a></li> <li><a href=\"https://www.repairwin.com/how-to-add-a-new-user-account-in-windows-10-8/\" target=\"_blank\" rel=\"nofollow noopener\"> Як додати нового користувача в Windows 10 / 8.1 </a></li> </ul> <p> </p> <h5> Крок 2. Як надати спільний доступ до папки або файлу іншим. </h5> <p> 1. Клацніть правою кнопкою миші папку (або файл), до якої ви хочете поділитися, та виберіть її <strong> Надати доступ до </strong> -&gt; <strong> Конкретні люди. </strong></p> <p><img src=\"images/image_thumb-56-411.png\" alt=\"How to Share Files and Folders in Windows 10, 8.1, 7\" loading=\"lazy\"></p> <p> </p> <p> 2. За допомогою випадаючого меню виберіть користувача, з яким ви хочете поділитися своїми файлами, а потім натисніть <strong> Додати </strong> . </p> <p><img src=\"images/image_thumb-57-274.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Тепер натисніть на стрілку вниз поруч із доданим користувачем і вкажіть його дозволи на доступ (Рівень дозволу) </p> <p><img src=\"images/image_thumb-58-517.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Після закінчення натисніть <strong> Поділитися </strong> кнопка, </p> <p><img src=\"images/image_thumb-59-431.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Зверніть увагу на вказане посилання на спільну папку * та натисніть <strong> Готово </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-60-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. На цьому етапі ви ввімкнули спільний доступ до файлів на своєму комп’ютері. Щоб отримати доступ до спільної папки з іншого ПК: </p> <blockquote><p> a. В адресному рядку Провідника введіть посилання на спільну папку, як показано на попередньому кроці. (наприклад, &quot;\\\\ DESKTOP-HMG31RD \\ 2Share&quot; без лапок) <br> b. Натисніть <strong> Введіть </strong> . <br> c. Введіть ім&#39;я користувача та пароль користувача, якому ви надали доступ, і натисніть <strong> гаразд </strong> . </p></blockquote> <p><img src=\"images/image_thumb-61-512.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Додаткова інформація: <br> 1.Щоб змінити дозволи користувача, просто повторіть описану вище процедуру та змініть рівень дозволу користувача. <br> 2. Якщо ви хочете припинити спільний доступ до файлів, клацніть правою кнопкою миші спільну папку / файл і перейдіть до <strong> Надати доступ до </strong> -&gt; та виберіть <strong> Скасувати доступ </strong> . </p> <p><img src=\"images/image_thumb-62-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про цю проблему. </p>"}