{"title":"Як знайти програвач Windows Media у Windows 10.","content":"<p> Протягом багатьох років програвач Windows Media був програмою за замовчуванням для відтворення музики та відео. У Windows 10 програвач Windows більше не є програвачем за замовчуванням для медіа-файлів і замінений програмою &quot;Фільми та ТБ&quot;. </p> <p> Ця стаття написана для всіх користувачів, які хочуть знайти та використовувати класичний медіапрогравач Windows як програвач за замовчуванням для відтворення своєї музики та відео. </p> <h4> Як знайти програвач Windows Media у Windows 10. </h4> <p> Найшвидший спосіб дізнатися, чи встановлений на вашому комп’ютері програвач Windows Media, - це здійснити його пошук. Для цього: </p> <p> 1. У полі пошуку Cortana введіть <strong> Медіапрогравач Windows </strong> . <br> 2. Якщо програвач Windows Media вказаний у результатах, натисніть на нього, щоб запустити програму. (Якщо немає в списку, продовжуйте нижче ...) </p> <p><img src=\"images/image_thumb-66-377.png\" alt=\"How to Find Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> ПОРАДА: </strong> Щоб встановити програвач Windows Media як програвач за замовчуванням для ваших відео та музики: </p> <blockquote><p> 1. Перейдіть до <strong> Почніть </strong> -&gt; <strong> Налаштування </strong> -&gt; <strong> Програми </strong> і виберіть <strong> Програми за замовчуванням </strong> зліва. <br> 2. В <strong> Музичний програвач </strong> , натисніть на <strong> Музика Groove </strong> а потім виберіть <strong> Медіаплеєр Windows </strong> . <br> 3. <strong> У параметрах Video Player </strong> , натисніть <strong> Фільми та ТБ </strong> а потім виберіть <strong> Медіаплеєр Windows </strong> . </p> <p><img src=\"images/image_thumb-72-358.png\" alt=\"set windows media player default widnows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h4> Як встановити програвач Windows Media у Windows 10 Home, Pro. </h4> <p> Якщо медіапрогравача Windows немає у списку, ви можете встановити його, перейшовши до: </p> <p> 1. <strong> Панель управління </strong> -&gt; <strong> Програми та функції </strong> . <br> 2. Клацніть <strong> Увімкніть або вимкніть функції Windows </strong> зліва. </p> <p><img src=\"images/image_thumb-68-342.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. В <strong> Медіа-функції </strong> , виберіть <strong> Медіапрогравач Windows </strong> і натисніть <strong> гаразд </strong> . * </p> <p> * Примітка: Якщо ви є власником Windows 10 N або KN, або ви не можете встановити програвач Windows Media з &quot;функцій Windows&quot;, продовжуйте читати нижче ... </p> <p><img src=\"images/image_thumb-69-565.png\" alt=\"How to Install Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Як завантажити та встановити програвач Windows Media у версіях Windows 10 Home, Pro, N &amp; KN. </h4> <p> Якщо ви не можете встановити програвач Windows, використовуючи наведені вище інструкції, або якщо у вас є Windows 10 N або KN, тоді ви можете завантажити програвач Windows Media Player для Windows 10, дотримуючись інструкцій нижче: </p> <p> 1. Завантажте файл <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48231\" target=\"_blank\" rel=\"nofollow noopener\"> Медіа-пакет функцій для версій N і KN для Windows 10 </a> . </p> <p> * Примітка: Завантажте <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package.msu </strong> для <strong> 32-розрядна ОС, </strong> та <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package_x64.msu </strong> для <strong> 64-розрядна ОС. </strong></p> <p> 2. Запустіть завантажений файл і натисніть <strong> Так </strong> на першому екрані. </p> <p><img src=\"images/image_thumb-70-480.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Прийняти </strong> ліцензійної угоди, а потім дочекайтеся завершення встановлення. </p> <p><img src=\"images/image_thumb-71-400.png\" alt=\"download windows media player windows 10\" loading=\"lazy\"></p> <p> </p> <p> Це все, шановні! Вам це вдалося? Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}