{"title":"Як захистити папку паролем у Windows 10 (Заблокувати папку за допомогою пароля).","content":"<p> Цей підручник містить два різні безкоштовні та безпечні методи захисту папки в ОС Windows 10/8/7 за допомогою пароля. Якщо ви заблокуєте папку за допомогою пароля, вона буде недоступна нікому, крім вас. Захист папки за допомогою пароля корисний у випадках, коли ви ділитеся своїм комп&#39;ютером з іншими, і ви не хочете, щоб хтось інший отримував доступ до ваших приватних файлів і читав їх. </p> <ul> <li><strong> Пов’язана стаття: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Як захистити паролем ПК з Windows 10 за допомогою BitLocker </a> . </strong></li> </ul> <h4> Як заблокувати папку за допомогою пароля в Windows 10. </h4> <h6> Спосіб 1. Як заблокувати та зашифрувати файли за допомогою 7-zip (Windows All Versions). </h6> <p> Найпростіший і найбезпечніший спосіб захисту папки за допомогою пароля в Windows - це використання утиліти архіватора 7-Zip, яка також підтримує шифрування. Щоб зашифрувати та захистити паролем папку / файл за допомогою 7-zip: </p> <p> 1. Завантажте та встановіть <a href=\"https://www.7-zip.org/\" target=\"_blank\" rel=\"nofollow noopener\"> 7-Zip </a> програма-архіватор. <br> 2. Клацніть правою кнопкою миші папку (або файл), яку ви хочете захистити паролем, і виберіть: <strong> 7-Zip </strong> &gt; <strong> Додати до архіву </strong> . </p> <p><img src=\"images/image_thumb-28-978.png\" alt=\"How to Password Protect a Folder\" loading=\"lazy\"></p> <p> </p> <p> 3. У опції &quot;Додати в архів&quot; вкажіть надійний пароль і натисніть <strong> гаразд </strong> . </p> <p><img src=\"images/image_thumb-29-728.png\" alt=\"set password to archive with 7-zip\" loading=\"lazy\"></p> <p> </p> <p> 4. Потім видаліть нестиснуту папку (або файл) і все готово! </p> <h6> Спосіб 2. Як зашифрувати папку із захистом EFS (Windows Pro &amp; Enterprise). </h6> <p> EFS Protection - це вбудований інструмент шифрування у виданнях Windows 10 Professional та Enterprise. Якщо ви захищаєте папку або файл за допомогою шифрування EFS, іншим дуже важко отримати доступ до зашифрованих файлів, не маючи ключа дешифрування (сертифіката ключа PFX). </p> <p> Єдиним недоліком шифрування EFS є те, що шифрування буде видалено, якщо ви скопіюєте зашифровані файли на інший мережевий комп&#39;ютер або якщо ви надішлете зашифровані файли електронною поштою. </p> <p> Крім того, під час шифрування ваших файлів EFS ключ дешифрування (сертифікат) зберігається локально на вашому комп’ютері. Це означає, що кожен, хто має ваш пароль, також матиме доступ до ваших зашифрованих файлів. З цієї причини, якщо ви шифруєте свої файли за допомогою шифрування EFS, вкажіть надійний пароль для входу та не повідомляйте його іншим. </p> <ul> <li><strong> Пов’язана стаття: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> Як розшифрувати зашифровані файли EFS та видалити шифрування EFS. </a></strong></li> </ul> <p><strong> Щоб зашифрувати папку або файл за допомогою EFS: </strong><br> 1. Клацніть правою кнопкою миші папку (або файл), яку потрібно захистити, та виберіть <strong> Властивості </strong> . <br> 2. На вкладці Загальні натисніть <strong> Розширений </strong> . </p> <p><img src=\"images/image_thumb-13-582.png\" alt=\"enable efs protection\" loading=\"lazy\"></p> <p> </p> <p> 3. Виберіть <strong> Зашифруйте файли для захисту даних </strong> а потім клацніть <strong> ГАРАЗД. </strong></p> <p><img src=\"images/image_thumb-14-983.png\" alt=\"How to Lock Folder with Password - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Потім клацніть <strong> Подати заявку </strong> і <strong> гаразд </strong> ще раз, щоб зберегти зміни та вийти. <br> 5. На цьому етапі Windows запропонує зробити резервну копію ключа відновлення. Клацніть <strong> Створіть резервну копію ключа шифрування файлу. </strong></p> <p><img src=\"images/image_thumb-2-823.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Потім клацніть <strong> Створити резервну копію зараз (рекомендується) </strong> та збережіть ключ сертифіката розшифровки на USB-накопичувач. </p> <p><img src=\"images/image_thumb-15-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. У майстрі експорту сертифікатів натисніть <strong> Далі </strong> на екрані привітання. <br> 8. Потім клацніть <strong> Далі </strong> знову на екрані Експортувати формат файлу. </p> <p><img src=\"images/image_thumb-4-842.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. У параметрах безпеки: </p> <blockquote> <p> 1. <strong> Перевірте </strong> <strong> Пароль </strong> коробці. <br> 2. Введіть пароль для експортованого ключа сертифіката. <br> 3. Виберіть <strong> AES256-SHA256 </strong> шифрування <br> 4. Клацніть <strong> Далі </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-16-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. Клацніть <strong> Перегляньте </strong> і <strong> Зберегти </strong> файл сертифіката (.pfx) на вашому комп’ютері. <br> 11. Після закінчення натисніть <strong> Далі </strong> продовжувати. </p> <p><img src=\"images/image_thumb-17-804.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. Нарешті клацніть <strong> Готово </strong> . </p> <p><img src=\"images/image_thumb-18-449.png\" alt=\"image\" loading=\"lazy\"></p> <p> 13. Після завершення експорту збережіть експортований ключ сертифіката (файл .pfx) в інше безпечне місце (наприклад, на USB-диск). </p> <p><strong> ПОРАДА: </strong> Коли ви шифруєте папку (або файли) за допомогою EFS, ключ розшифровки (сертифікат) зберігається у вашій папці профілю користувача. Отже, якщо інший користувач має ваш пароль для входу в Windows, він може відкривати та читати зашифровані файли. Щоб цього не сталося, не повідомляйте свій пароль для входу або вилучіть (видаліть) сертифікат дешифрування зі свого профілю, коли залишаєте ПК, і перевстановлюйте його, коли повернетесь. * </p> <p> * Примітка. Щоб видалити та повторно імпортувати ключ відновлення (сертифікат), перейдіть за посиланням: </p> <blockquote> <p> a. <strong> Панель управління </strong> &gt; <strong> Властивості Інтернету. <br> </strong> b. На вкладці &quot;Властивості браузера&quot; натисніть <strong> Зміст </strong> , а потім натисніть <strong> Сертифікат </strong> s. <br> c. На вкладці &quot;Особисте&quot; натисніть <strong> Видалити </strong> , щоб видалити ключ розшифровки (сертифікат), або натисніть <strong> Імпорт </strong> , щоб переінсталювати сертифікат дешифрування з USB-накопичувача. </p> </blockquote> <ul> <li> <p><strong> Пов’язана стаття: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"noopener noreferrer\"> Як розшифрувати зашифровані файли EFS та видалити шифрування EFS. </a></strong></p> </li> </ul> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або ще краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення </p>"}