{"title":"Як відновити файл DBX Outlook Express БЕЗКОШТОВНО.","content":"<p> Outlook Express - це програма для роботи з електронною поштою, вперше побачена в Windows XP. Але навіть сьогодні (2018 рік) деякі клієнти все ще використовують його як свою основну програму електронної пошти. Однією з основних проблем Outlook Express є проблема з обмеженням у 2 Гб. </p> <p> Опис проблеми з обмеженням розміру 2 ГБ в Outlook Express. <br> Коли одна з основних папок Outlook Express (наприклад, &quot;Вхідні&quot; або &quot;Надіслане&quot;) перевищує 2 ГБ, відповідний файл сховища OE DBX може бути пошкоджений, а папка OE може здатися порожньою. В результаті проблеми Outlook Express не може надсилати або отримувати електронні листи та відображає помилку <a href=\"https://www.repairwin.com/fix-outlook-express-error-0x800c0133-due-to-2gb-size-limit/\" target=\"_blank\" rel=\"nofollow noopener\"> 0x800c0133 </a> під час операції надсилання / отримання. </p> <p> У цьому підручнику я покажу вам, як відновити пошкоджений файл DBX з Outlook Express та повернути свої електронні листи! </p> <h4> Як виправити пошкоджений файл DBX Outlook Express. </h4> <p> Якщо одна з папок Outlook Express (папка &quot;Вхідні&quot;, &quot;Надіслати&quot; тощо) пошкоджена, виконайте наведені нижче вказівки, щоб відновити папку магазину DBX та повернути свої електронні листи. </p> <h6> Крок 1. Увімкніть перегляд прихованих файлів. </h6> <p> 1. Відкрийте Провідник Windows. <br> 2. З <strong> Інструменти </strong> меню вибрати <strong> Параметри папки </strong> . <br> 3. На вкладці Вид натисніть <strong> Показати приховані файли та папки </strong> і натисніть <strong> ГАРАЗД. </strong></p> <p><img src=\"images/image_thumb-2-290.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Крок 2. Знайдіть на своєму диску пошкоджений файл DBX Outlook Express. </h6> <p> 1. Відкрийте папку магазину Outlook Express. Зазвичай ця папка знаходиться на наступному шляху на вашому диску: </p> <ul> <li> C: \\ Documents and Settings \\\\ Local Settings \\ Application Data \\ Identities \\ {} \\ Microsoft \\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> напр. “C: \\ Documents and Settings \\ User \\ Local Settings \\ Application Data \\ Identities \\ {D8F3C56D-965E-41AE-8A23-A58460ABAE00} \\ Microsoft \\ <strong> Outlook Express </strong> &quot; </p></blockquote> <p> 3. З Провідника <strong> Переглянути </strong> меню вибрати <strong> Деталі </strong> . <br> 4. Знайдіть, який файл DBX перевищує 2 ГБ, або знайдіть пошкоджений файл DBX. (пошкоджений файл DBX - це папка MAIL, яка здається порожньою в програмі Outlook Express). </p> <p><img src=\"images/image_thumb-3-887.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Скопіюйте цей файл DBX в інше місце на вашому диску (наприклад, у нову папку на робочому столі з назвою &quot;CorruptedDBX&quot;). </p> <p> </p> <h6> Крок 3. Завантажте UnDBX - безкоштовну утиліту відновлення DBX Outlook Express. </h6> <p> UnDBX - це чудовий і безкоштовний засіб відновлення DBX Outlook Express, який може витягти всі електронні листи Outlook Express у форматі .eml. Крім того, він має можливість виправити та відновити пошкоджений файл .DBX Outlook Express. </p> <p> Ви можете завантажити UnDBX з <a href=\"https://sourceforge.net/projects/undbx/\" target=\"_blank\" rel=\"nofollow noopener\"> тут </a> . </p> <p> </p> <h6> Крок 4. Відновіть електронні листи з пошкодженого файлу Outlook Express DBX. </h6> <p> 1. Щоб відновити електронні листи з пошкодженого файлу DBX, двічі клацніть, щоб запустити утиліту UnDBX. <br> 2. У утиліті UnDBX: </p> <blockquote><p> 1. Виберіть папку, яка містить файли .dbx Outlook Express, а потім <strong> перевірити </strong> &quot; <strong> увімкнути режим відновлення </strong> &quot;варіант нижче. <br> 2. <strong> Виберіть папку призначення </strong> на своєму комп’ютері для зберігання (витягування) файлів .eml. (наприклад, у папку на робочому столі з назвою &quot;RecoveredInbox&quot;) <br> 3. Нарешті клацніть <strong> Одужайте </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-645.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Коли відновлення UnDBX буде завершено, відкрийте Outlook Express. <br> 4. Перейдіть до папки, де UnDBX зберігав витягнуті файли .eml. <br> 5. Перетягніть витягнуті електронні листи до відповідної папки (в Outlook Express). * </p> <p><strong> * Пропозиція: </strong> Щоб уникнути повторного пошкодження папок Outlook Express (або обходу обмеження 2 ГБ), пропоную перетягувати електронні листи групами (наприклад, за роками) та розміщувати їх у різних папках в OE. Наприклад, виберіть лише електронні листи поточного року та перетягніть їх у нову папку OE, названу з поточним роком (наприклад, &quot;Вхідні 2018&quot;). Потім повторіть ті самі кроки з усіх інших електронних листів попередніх років. </p> <p> Це все, шановні! Вам це вдалося? <br> Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}