{"title":"Як заблокувати веб-сайти в Chrome або Firefox.","content":"<p> Якщо ви шукаєте простий спосіб заблокувати веб-сайт у Chrome або Firefox, продовжуйте читати нижче. </p> <p> Хоча Інтернет для більшості з нас став необхідним у повсякденному житті для роботи чи розваг, з іншого боку, часом корисно мати можливість блокувати деякі сайти, щоб уникнути відволікання. Наприклад, ніхто не хоче, щоб їх дитина відволікалася на перегляд відео на YouTube, коли вона читає свої уроки. </p> <p> У цьому посібнику ви дізнаєтесь, як блокувати веб-сайти в Chrome і <a href=\"#firefox\" target=\"_blank\" rel=\"nofollow noopener\"> Firefox </a> браузери. </p> <p> * Примітка. Якщо ви хочете заблокувати веб-сайт у всіх браузерах, прочитайте цю статтю: <a href=\"https://www.repairwin.com/block-youtube-on-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Як заблокувати YouTube у Windows 10. </a></p> <h2> Як блокувати веб-сайти в Google Chrome. </h2> <p> Найпростіший спосіб заблокувати веб-сайт у Chrome - це використовувати відоме розширення BlockSite. Встановлення надбудови BlockSite подібне до будь-якого іншого розширення. </p> <p> 1. Перейдіть до <a href=\"https://chrome.google.com/webstore/detail/blocksite-stay-focused-co/eiimnmioipafcokbfikbljfdeojpcgbh\" target=\"_blank\" rel=\"nofollow noopener\"> Розширення BlockSite </a> у веб-магазині Chrome і натисніть <strong> Додати в Chrome </strong> кнопку. </p> <p><img src=\"images/image_thumb-4-439.png\" alt=\"how to block websites chrome\" loading=\"lazy\"></p> <p> 2. Коли з’явиться відповідний запит, натисніть <strong> Додати розширення </strong> . </p> <p><img src=\"images/image_thumb-5-782.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Після завершення встановлення перейдіть до меню Chrome&gt; Інші інструменти&gt; Розширення </p> <p><img src=\"images/image_thumb-6-830.png\" alt=\"chrome tools extensions\" loading=\"lazy\"></p> <p> 4. Знайдіть <strong> BlockSite </strong> розширення та натисніть <strong> Деталі. </strong></p> <p><img src=\"images/image_thumb-7-415.png\" alt=\"Blocksite details\" loading=\"lazy\"></p> <p> 5. <strong> відчинено </strong> <strong> Варіанти розширення </strong> . </p> <p><img src=\"images/image_thumb-8-135.png\" alt=\"How to Block sites chrome\" loading=\"lazy\"></p> <p> 6. Введіть назву сайту, який ви хочете заблокувати (наприклад, <a href=\"http://www.youtube.com\" target=\"_blank\" rel=\"nofollow noopener\"> www.youtube.com </a> ) та натисніть символ плюса (+), щоб додати веб-сайт до списку заблокованих. </p> <p><img src=\"images/image_thumb-9-298.png\" alt=\"blocked sites chrome\" loading=\"lazy\"></p> <p> 7. Ось і все! Відтепер, при спробі відвідати заблокований сайт, ви отримаєте повідомлення про те, що сайт заблоковано за допомогою розширення BlockSite. Щоб змінити список заблокованих сайтів, натисніть <strong> Відредагуйте свій список </strong> , щоб внести будь-які потрібні зміни або видалити заблокований сайт зі списку. </p> <p><img src=\"images/image_thumb-10-951.png\" alt=\"image\" loading=\"lazy\"></p> <h3> Як захистити паролем заблоковані сайти в розширенні BlockSite. </h3> <p> Якщо ви хочете заборонити користувачам розблокувати заблокований сайт: </p> <p> 1. Відкрийте <strong> BlockSite </strong> варіанти розширення. <br> 2. Перейдіть до <strong> Захист паролем </strong> налаштування. <br> 3. <strong> Увімкнути </strong> опція Захистити <strong> вибрані вами параметри BlockSite та сторінка розширення Chrome із паролем </strong> а потім введіть електронну адресу та пароль і натисніть <strong> Зберегти. </strong></p> <p><img src=\"images/image_thumb-11-711.png\" alt=\"password protect blocked sites\" loading=\"lazy\"></p> <p> 4. BlockSite надішле вам електронний лист із посиланням для підтвердження вашої адреси електронної пошти. Після підтвердження електронної пошти захист паролем буде активним. </p> <h2> Як заблокувати веб-сайти в Mozilla Firefox. </h2> <p> 1. Перейдіть до <a href=\"https://addons.mozilla.org/en-US/firefox/addon/blocksite/\" target=\"_blank\" rel=\"nofollow noopener\"> Розширення BlockSite </a> у доповненнях Firefox. <br> 2. Клацніть на <strong> Додати до Firefox </strong> кнопку. </p> <p><img src=\"images/image_thumb-12-999.png\" alt=\"block websites firefox\" loading=\"lazy\"></p> <p> 2. Коли з’явиться запит дозволити встановлення розширення, натисніть <strong> Додати. </strong></p> <p><img src=\"images/image_thumb-13-588.png\" alt=\"Blocksite firefox\" loading=\"lazy\"></p> <p> 3. Коли встановлення буде завершено, виберіть, чи хочете ви заблокувати веб-сайти у приватних (анонімних) вікнах, і натисніть <strong> Гаразд </strong> . </p> <p><img src=\"images/image_thumb-14-173.png\" alt=\"how to block site\" loading=\"lazy\"></p> <p> 4. Якщо ви хочете запобігти розширення BlockSite для читання даних на веб-сайтах, які ви відвідуєте, натисніть Можливо, лист. </p> <p><img src=\"images/image_thumb-15-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Тепер клацніть піктограму BlockSite і <strong> Редагувати список блоків </strong> щоб вказати, які веб-сайти ви хочете заблокувати. </p> <p><img src=\"images/image_thumb-16-657.png\" alt=\"block sites firefox\" loading=\"lazy\"></p> <p> 6. На вкладці Блокувати сайти введіть назву веб-сайту, який потрібно заблокувати (наприклад, &quot;facebook.com&quot;), а потім додайте його до списку заблокованих веб-сайтів. </p> <p><img src=\"images/image_thumb-17-817.png\" alt=\"How to block site Firefox\" loading=\"lazy\"></p> <p> 7. Додавши сайти, які потрібно заблокувати, закрийте налаштування BlockSite і все готово. </p> <p> Окрім основної функції, розширення BlockSite також має деякі інші корисні функції, такі як: </p> <ul> <li> <p><strong> Режим фокусування </strong> : Блокувати сайти на певний час (наприклад, 25 хвилин) </p> </li> <li> <p><strong> Захист паролем: </strong> Захистіть налаштування BlockSite від модифікацій. </p> </li> <li> <p><strong> Блок за словами: </strong> Блокувати URL-адреси, що містять конкретні слова. </p> </li> </ul> <p> Це все, шановні! Будь ласка, залиште коментар у розділі коментарів нижче або навіть краще: поставіть лайк і поділіться цим повідомленням у блозі в соціальних мережах, щоб допомогти поширити інформацію про це рішення. </p>"}