{"title":"Biểu mẫu liên hệ 7 Không hoạt động: Đã xảy ra lỗi khi gửi tin nhắn của bạn. Vui lòng thử lại sau. (Đã giải quyết)","content":"<p> Nếu biểu mẫu Liên hệ 7 trên trang web WordPress của bạn không hoạt động, hãy tiếp tục đọc bên dưới để khắc phục sự cố. Contact Form 7, là một trong những plugin WordPress miễn phí nổi tiếng nhất, giúp bạn tạo, quản lý và tùy chỉnh biểu mẫu liên hệ trong trang web WordPress của mình. Gần đây, tôi phát hiện ra rằng plugin &quot;Biểu mẫu liên hệ 7&quot; trên trang web của tôi (và trên nhiều trang khác), đã ngừng hoạt động với lỗi &quot;Đã xảy ra lỗi khi gửi thư của bạn. Vui lòng thử lại sau&quot;, được bao quanh bởi một hình chữ nhật màu cam , sau khi gửi biểu mẫu. </p> <p><img src=\"images/image_thumb-14-729.png\" alt=\"Contact Form 7: There was an error to send your message. Please try again later\" loading=\"lazy\"></p> <p> Hướng dẫn này chứa các hướng dẫn để sửa lỗi &quot;Đã xảy ra lỗi khi gửi tin nhắn của bạn. Vui lòng thử lại sau&quot; bên trong hộp màu cam, sau khi gửi biểu mẫu liên hệ. </p> <h4> Cách khắc phục: Biểu mẫu liên hệ Không hoạt động với lỗi &quot;Đã xảy ra lỗi khi gửi tin nhắn của bạn&quot;. </h4> <p> Nếu Biểu mẫu liên hệ 7 của bạn trên WordPress, trang web không hoạt động nữa, hãy làm theo các bước bên dưới: </p> <h6> Bước 1. Xác thực Mẫu liên hệ 7. </h6> <p> 1. Điều hướng đến bảng điều khiển quản trị WordPress của bạn và nhấp vào <strong> Tiếp xúc </strong> &gt; <strong> Biểu mẫu liên hệ. </strong><br> 2. Trên đầu trang, hãy kiểm tra xem có thông báo lỗi cho biết &quot;Định cấu hình sai dẫn đến không gửi được thư hoặc các sự cố khác không. Hãy xác thực biểu mẫu liên hệ của bạn ngay bây giờ&quot;. <br> 3. Nếu bạn thấy thông báo đó, * thì <strong> nhấp chuột </strong> các <strong> Xác thực cấu hình biểu mẫu liên hệ 7 </strong> liên kết. </p> <p> * Lưu ý: Nếu bạn không thấy thông báo đó, hãy chuyển sang bước 2. </p> <p><img src=\"images/image_thumb-813.png\" alt=\"Validate Contact Form 7 Configuration \" loading=\"lazy\"></p> <p> 4. Ở màn hình tiếp theo, hãy nhấp vào <strong> Xác thực 2 biểu mẫu liên hệ ngay bây giờ </strong> cái nút. </p> <p><img src=\"images/image_thumb-1-270.png\" alt=\"Validate Contact Form\" loading=\"lazy\"></p> <p> 5. Khi xác thực cấu hình hoàn tất, bạn sẽ nhận được thông báo &quot;Không tìm thấy biểu mẫu liên hệ không hợp lệ&quot;. </p> <p><img src=\"images/image_thumb-17-318.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Kiểm tra biểu mẫu liên hệ của bạn và nếu lỗi vẫn còn, hãy tiếp tục bước 2 bên dưới. </p> <h6> Bước 2. Thiết lập Biểu mẫu Liên hệ 7 bằng các khóa reCAPTCHA V3. </h6> <p> Trong quá trình nghiên cứu của mình, tôi đã phát hiện ra rằng các phiên bản mới nhất của Biểu mẫu liên hệ 7 (v5.1 trở lên) sử dụng API reCAPTCHA v3 để bảo vệ bạn khỏi spam và các loại lạm dụng tự động khác. Vì vậy, dựa trên điều này, bạn có hai tùy chọn sau để giải quyết lỗi biểu mẫu liên hệ &quot;Đã xảy ra lỗi khi gửi tin nhắn của bạn. Vui lòng thử lại sau.&quot;: * </p> <ul> <li> <p><strong> Lựa chọn 1. </strong> Để thiết lập Biểu mẫu liên hệ 7 với các khóa reCAPTCHA V3. </p> </li> <li> <p><strong> Lựa chọn 2. </strong> Để sử dụng <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"noopener noreferrer\"> Biểu mẫu liên hệ 7 - reCaptcha v2 </a> plugin cho các biểu mẫu liên hệ của bạn. </p> </li> </ul> <p> * Lưu ý: Trong bài viết này, tôi sẽ hướng dẫn các bạn cách thiết lập Contact Form 7 với các phím reCAPTCHA V3. Nếu bạn không muốn sử dụng bảo vệ reCAPTCHA V3, hãy gỡ cài đặt plugin &#39;Biểu mẫu liên hệ 7&#39; và cài đặt <a href=\"https://wordpress.org/plugins/wpcf7-recaptcha/\" target=\"_blank\" rel=\"nofollow noopener\"> Biểu mẫu liên hệ 7 - reCaptcha v2 </a> cắm vào. </p> <p><strong> Để thiết lập Biểu mẫu liên hệ 7 với các khóa reCAPTCHA V3: </strong></p> <p> 1. Đăng nhập vào Tài khoản Google của bạn, bạn đã sử dụng để thiết lập reCAPTCHA trên trang web của mình và điều hướng đến <a href=\"https://www.google.com/recaptcha/admin\" target=\"_blank\" rel=\"nofollow noopener\"> Bảng điều khiển quản trị reCAPTCHA của Google. </a></p> <p> 2. Nhấp vào Cài đặt <img src=\"images/image_thumb-2-494.png\" alt=\"image\" loading=\"lazy\"> biểu tượng. </p> <p><img src=\"images/image_thumb-3-786.png\" alt=\"Setup Contact Form 7 with recaptcha v3\" loading=\"lazy\"></p> <p> 3. Nhấp vào <strong> Thùng rác </strong> biểu tượng <img src=\"images/image_thumb-4-167.png\" alt=\"image\" loading=\"lazy\"> và <strong> xóa bỏ </strong> các <strong> các phím reCAPTCHA V2. </strong></p> <p><img src=\"images/image_thumb-5-757.png\" alt=\"Recaptcha v3\" loading=\"lazy\"></p> <p> 4. Nhấp vào biểu tượng Dấu cộng <img src=\"images/image_thumb-6-851.png\" alt=\"image\" loading=\"lazy\"> để đăng ký lại trang web của bạn. </p> <p><img src=\"images/image_thumb-7-337.png\" alt=\"Register Site with Recaptcha\" loading=\"lazy\"></p> <p> 5. Tại màn hình &#39;Đăng ký trang web mới&#39;: </p> <blockquote> <p> a. <strong> Nhập tên </strong> để xác định trang web của bạn trong tương lai, <br> b. <strong> Chọn </strong> các <strong> reCAPTCHA v3 </strong> kiểu. <br> c. <strong> Kiểu </strong> các <strong> tên miền </strong> của trang web của bạn. <br> d. <strong> Chấp nhận </strong> các <strong> Điều khoản Dịch vụ của reCAPTCHA. </strong><br> e. Nhấp chuột <strong> GỬI ĐI. </strong></p> </blockquote> <p><img src=\"images/image_thumb-8-227.png\" alt=\"Register Site with Recaptcha V3\" loading=\"lazy\"></p> <p> 6. Sau khi đăng ký, bạn sẽ thấy một màn hình với <strong> CHÌA KHOÁ WEBSITE </strong> và <strong> CHÌA KHOÁ BÍ MẬT </strong> . <br> 7. Nhấp vào <strong> SAO CHÉP KHÓA TRANG WEB </strong> và <strong> KHÔNG ĐÓNG </strong> cửa sổ này. </p> <p><img src=\"images/image_thumb-9-995.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. Trong một cửa sổ trình duyệt khác, điều hướng đến bảng điều khiển quản trị WordPress của bạn và nhấp vào <strong> Tiếp xúc </strong> &gt; <strong> Hội nhập. </strong></p> <p> 9. Nhấp vào <strong> Thiết lập Tích hợp </strong> cái nút. </p> <p><img src=\"images/image_thumb-10-834.png\" alt=\"Integrate Recaptcha in Contact Form 7\" loading=\"lazy\"></p> <p> 10. Nhấp vào <strong> Xóa chìa khóa </strong> để xóa các khóa reCAPTCHA V2. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"image\" loading=\"lazy\"></p> <p> 11. <strong> Dán </strong> cái mới <strong> Chìa khoá website </strong> và sau đó Sao chép &amp; Dán <strong> Chìa khoá bí mật </strong> từ bảng điều khiển quản trị reCAPTCHA và nhấp vào <strong> Lưu thay đổi. </strong></p> <p><img src=\"images/image_thumb-12-147.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. <strong> Xóa bỏ </strong> các <strong> Bộ nhớ đệm </strong> trên trang web của bạn. <br> 13. Mở cửa sổ trình duyệt mới và kiểm tra biểu mẫu liên hệ của bạn. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}