{"title":"Khắc phục: Sự cố cài đặt Windows 10 21H1.","content":"<p> Microsoft đã phát hành vào ngày 18 tháng 5 năm 2021 bản cập nhật lớn mới nhất cho Windows 10 (hay còn gọi là: &quot;Bản cập nhật nổi bật cho Windows 10, phiên bản 21H1&quot;), chủ yếu với các cải tiến bảo mật khi làm việc từ xa và khi mở tài liệu, trong khi Windows Defender Application Guard bảo vệ bạn khỏi nguy cơ các mối đe dọa an ninh. </p> <p> Vào thời điểm bài viết này được viết, Microsoft chỉ thông báo các vấn đề sau với Bản cập nhật Windows 21H1: </p> <ul> <li><b><a href=\"https://docs.microsoft.com/en-us/windows/release-health/status-windows-10-21h1#1605msgdesc\" target=\"_blank\" rel=\"nofollow noopener\"> Có thể nghe thấy tiếng ồn cao khi sử dụng âm thanh 5.1 với một số cài đặt nhất định </a></b><br> Một số kết hợp ứng dụng, thiết bị âm thanh và cài đặt Windows nhất định có thể tạo ra tiếng ồn cao khi sử dụng âm thanh 5.1 <br> HĐH Bản dựng 19043.906. </li> <li><b><a href=\"https://docs.microsoft.com/en-us/windows/release-health/status-windows-10-21h1#1528msgdesc\" target=\"_blank\" rel=\"nofollow noopener\"> Tự động nhập Furigana có thể không hoạt động như mong đợi </a></b><br> Trong một số trường hợp nhất định, tính năng nhập / chuyển đổi Furigana tự động có thể không hoạt động như mong đợi trong các ứng dụng. </li> </ul> <p> * Lưu ý: Lỗi này được phát hiện lần đầu tiên sau khi cài đặt sau khi cài đặt <a href=\"https://support.microsoft.com/help/5000842\" target=\"_blank\" rel=\"nofollow noopener\"> KB5000842 </a> cập nhật. Để giảm thiểu vấn đề này, bạn có thể thử một hoặc nhiều cách sau: </p> <ol> <li> Truyền video hoặc âm thanh trong trình duyệt web hoặc ứng dụng khác, thay vì ứng dụng bị ảnh hưởng bởi sự cố này. </li> <li> Kích hoạt <b> Âm thanh không gian </b> cài đặt bằng cách nhấp chuột phải hoặc nhấn và giữ <b> biểu tượng âm lượng </b> bên trong <b> khu vực thông báo </b> , lựa chọn <b> Âm thanh không gian (Tắt) </b> và chọn bất kỳ tùy chọn nào có sẵn. </li> </ol> <h5> Cách tải bản cập nhật Windows 10 tháng 5 năm 2021 (21H1). </h5> <p> Để cập nhật hệ thống của bạn lên Windows 10, phiên bản 21H1, bạn phải chạy Windows 10, phiên bản 2004 hoặc 20H2. Để tìm hiểu phiên bản Windows 10 đã cài đặt, hãy truy cập <strong> Khởi đầu </strong> -&gt; <strong> Cài đặt </strong> -&gt; <strong> Hệ thống </strong> -&gt; <strong> Trong khoảng. </strong></p> <p><img src=\"images/image_thumb-64-863.png\" alt=\"Find Out Windows 10 version\" loading=\"lazy\"></p> <p> </p> <p> Để cài đặt Bản cập nhật tính năng cho Windows 10, phiên bản 21H1, hãy truy cập <strong> Khởi đầu </strong> -&gt; <strong> Cài đặt </strong> -&gt; <strong> Cập nhật &amp; Bảo mật </strong> và bấm vào <strong> Kiểm tra cập nhật. </strong> Nếu bản cập nhật có sẵn cho thiết bị của bạn, nó sẽ xuất hiện sau khi kiểm tra bản cập nhật. </p> <p> Nếu bạn muốn cài đặt bản cập nhật Windows 10 21H1 mà không gặp sự cố, <strong> không bấm </strong> các <strong> Tải xuống và cài đặt </strong> liên kết ngay bây giờ và làm theo hướng dẫn bên dưới để tránh hoặc giải quyết các sự cố cài đặt. </p> <p><img src=\"images/image_thumb-61-537.png\" alt=\"How to Install Windows 10 21H1 Update\" loading=\"lazy\"></p> <h2> Cách tránh sự cố cài đặt bản cập nhật Windows 10 21H1. </h2> <p> Trước khi cài đặt bản cập nhật Windows 10 21H1, hãy thực hiện các tác vụ sau: </p> <ul> <li><strong> Bước 1. </strong> Đảm bảo rằng bạn có <strong> đủ không gian trống </strong> trên đĩa của bạn. Windows 10 yêu cầu ít nhất 32 GB dung lượng trống để nâng cấp. </li> <li><strong> Bước 2. </strong> Chạy <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Dọn dẹp đĩa </a> và xóa tất cả các tệp vô dụng. </li> <li><strong> Bước 3. </strong> Tải xuống và <strong> Tải về </strong> muộn nhất <a href=\"https://portal.msrc.microsoft.com/en-us/security-guidance/advisory/ADV990001\" target=\"_blank\" rel=\"nofollow noopener\"> Ngăn xếp dịch vụ </a> cập nhật theo phiên bản Windows 10 của bạn. </li> <li><strong> Bước 4. </strong> <strong> Ngắt kết nối tất cả các ổ USB và thẻ SD bên ngoài </strong> và bất kỳ thiết bị USB nào khác không cần thiết để cài đặt Windows. </li> <li><strong> Bước 5. </strong> <strong> Gỡ cài đặt tạm thời </strong> bất kì <strong> Không phải của Microsoft Antivirus / Security </strong> phần mềm. </li> <li><strong> Bước 6. </strong> <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Tắt BitLocker </a> mã hóa ổ đĩa (nếu nó được bật). </li> <li><strong> Bước 7 </strong> . <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Tạo điểm khôi phục hệ thống </a> của trạng thái Windows hiện tại, để khôi phục hệ thống của bạn về trạng thái đó nếu cập nhật không thành công. </li> <li><strong> Bước 8. </strong> <strong> Tắt chương trình khởi động </strong> . Để làm điều đó, hãy nhấn <strong> CTRL </strong> + <strong> SHIFT </strong> + <strong> ESC </strong> để mở Trình quản lý tác vụ. Trong Trình quản lý Tác vụ, hãy chọn <strong> Khởi động </strong> tab và <strong> vô hiệu hóa </strong> tất cả các chương trình chạy khi Windows khởi động. </li> </ul> <p><img src=\"images/image_thumb-62-351.png\" alt=\"image\" loading=\"lazy\"></p> <p> Sau khi thực hiện các thao tác trên, hãy điều hướng đến <strong> Khởi đầu </strong> -&gt; <strong> Cài đặt </strong> -&gt; <strong> Cập nhật &amp; Bảo mật </strong> và nhấp vào <strong> Tải xuống và cài đặt </strong> để cài đặt <strong> Cập nhật tính năng lên Windows 10, phiên bản 21H1. </strong> Bây giờ, hãy đợi (khoảng 20-30 phút), cho đến khi Windows nhắc bạn <strong> Khởi động lại ngay bây giờ </strong> hệ thống của bạn để hoàn tất cài đặt bản cập nhật. </p> <p><img src=\"images/image_thumb-63-447.png\" alt=\"FIX Windows 10 21H1 Installation Problems.\" loading=\"lazy\"></p> <p> </p> <p> Sau một vài lần khởi động lại và nếu mọi thứ diễn ra suôn sẻ, bản cập nhật 21H1 sẽ được cài đặt trên hệ thống của bạn mà không gặp sự cố. Nếu điều này không xảy ra và Bản cập nhật Windows 10 21H1 không thành công kèm theo lỗi (ví dụ: &quot;Cập nhật tính năng lên Windows 10, phiên bản 21H1 Không cài đặt được - Mã lỗi: 0x800f0984&quot;), hãy tiếp tục đọc bên dưới để giải quyết sự cố. </p> <h2> Cách khắc phục sự cố cài đặt Cập nhật Windows 10 21H1. </h2> <p> Nếu Windows 10 21H1 Update không cài đặt được, hãy làm theo các phương pháp bên dưới để giải quyết sự cố. </p> <h3> Phương pháp 1. Cập nhật lên Windows 10 21H1 bằng cách sử dụng Hỗ trợ cập nhật. </h3> <p> 1. Điều hướng đến <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Trang web tải xuống Windows 10 </a> và nhấp vào <strong> Cập nhật bây giờ </strong> cái nút. </p> <p><img src=\"images/image_thumb-65-764.png\" alt=\"Download Windows 10 21H1 \" loading=\"lazy\"></p> <p> 2. Lưu tệp &quot;Windows10Upgrade9252.exe&quot; trên màn hình của bạn. <br> 3. Nhấp đúp vào tệp đã tải xuống để mở <strong> Hỗ trợ nâng cấp Windows </strong> . <br> 4. Nhấp vào <strong> Cập nhật bây giờ </strong> để bắt đầu cập nhật. </p> <p><img src=\"images/image_thumb-61-394.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Để Windows kết thúc quá trình tải xuống và giai đoạn xác minh. <br> 6. Khi xác minh đạt 100%, <strong> ngắt kết nối máy tính của bạn khỏi Internet </strong> , (hoặc đặt thành &quot; <strong> Chế độ máy bay </strong> &quot;nếu bạn sở hữu một máy tính xách tay). <br> 7. Sau đó, đợi cho đến khi bản cập nhật Windows 10 21H1 được cài đặt trên hệ thống của bạn. <br> 8. Cuối cùng, khi được nhắc, <strong> khởi động lại </strong> hệ thống của bạn để cài đặt bản cập nhật. </p> <p> </p> <h3> Phương pháp 2. Cập nhật lên Windows 10 21H1 từ ISO hoặc USB. </h3> <p> Phương pháp tiếp theo để vượt qua sự cố khi cài đặt bản cập nhật 21H1 trong Windows 10 là cập nhật Windows từ tệp ISO. Để làm việc đó: </p> <p><strong> Bước 1. Tải xuống Windows 10 trong tệp ISO. </strong></p> <p> 1. Điều hướng đến <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Trang tải xuống Windows 10 </a> và bấm vào <strong> Tải xuống công cụ ngay bây giờ </strong> để tải xuống <strong> Công cụ tạo phương tiện </strong> . </p> <p><img src=\"images/image_thumb-66-613.png\" alt=\"Update to Windows 10 21H1 \" loading=\"lazy\"></p> <p> 2. Chạy &#39;Công cụ tạo phương tiện&#39; và <strong> Chấp nhận </strong> Điều khoản cấp phép ở màn hình đầu tiên. <br> 3. Chọn <strong> Tạo phương tiện cài đặt cho một PC khác </strong> . </p> <p><img src=\"images/image_thumb1_thumb-386.png\" alt=\"create Windows 10 DVD\" loading=\"lazy\"></p> <p> 4. Tại màn hình &#39;Ngôn ngữ, kiến ​​trúc và phiên bản&#39;, nhấp vào <strong> Kế tiếp. <br> </strong> 5. Chọn <strong> Tệp tin ISO </strong> và bấm vào <strong> Kế tiếp </strong> . </p> <p><img src=\"images/image_thumb-30-314.png\" alt=\"download windows 10 iso\" loading=\"lazy\"></p> <p> 6. <strong> Tiết kiệm </strong> tệp &#39;Windows.iso&#39; vào màn hình của bạn. <br> 7. Công cụ Tạo phương tiện bây giờ sẽ bắt đầu tải xuống Windows 10 ở định dạng ISO. <br> 8. Khi quá trình tải xuống hoàn tất, <strong> đóng </strong> Công cụ tạo phương tiện. </p> <p><strong> Bước 2. Cập nhật Windows 10 từ tệp ISO. </strong></p> <p> 1. <strong> Nhấn đúp chuột </strong> tại <strong> Windows.ISO </strong> tệp trên màn hình của bạn. <br> 2. Mở File Explorer và khám phá nội dung của ký tự ổ đĩa mới được tạo sau khi mở tệp ISO. <br> 3. <strong> Nhấn đúp chuột </strong> tại <strong> setup.exe </strong> và sau đó nhấp vào <strong> Kế tiếp </strong> để cài đặt Windows 10. </p> <p><img src=\"images/image_thumb-58-627.png\" alt=\"FIX Error 0x8007025D-0x2000C Windows 10 Update\" loading=\"lazy\"></p> <p> 4. <strong> Chấp nhận </strong> Điều khoản cấp phép và sau đó nhấp vào <strong> Tải về. </strong></p> <p><img src=\"images/image_thumb-59-853.png\" alt=\"Install Windows from ISO file\" loading=\"lazy\"></p> <p> 5. Bây giờ hãy đợi quá trình cập nhật hoàn tất. * </p> <p> * Lưu ý: Nếu cập nhật lại không thành công, <a href=\"https://www.repairwin.com/create-windows-usb-with-rufus-iso-to-usb/\" target=\"_blank\" rel=\"nofollow noopener\"> ghi tệp Windows ISO vào ổ USB </a> và sau đó cố gắng <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> sửa chữa và nâng cấp Windows 10 từ USB. </a></p> <p> </p> <h3> Phương pháp 3. Sửa chữa Windows Component Store &amp; System Files. </h3> <p> 1. Mở <strong> Command Prompt với tư cách là quản trị viên </strong> . <br> 2. Trong dấu nhắc lệnh, đưa ra lệnh sau và nhấn <strong> Đi vào: </strong></p> <ul> <li><strong> DISM / Trực tuyến / Cleanup-Image / StartComponentCleanup </strong></li> </ul> <p><img src=\"images/image_thumb6_thumb-396.png\" alt=\"image_thumb[6]\" loading=\"lazy\"></p> <p> 3. Khi quá trình hoàn tất, hãy đưa ra lệnh sau: </p> <ul> <li><strong> DISM.exe / Trực tuyến / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-789.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Khi thao tác DISM hoàn tất, hãy gõ lệnh sau và nhấn <strong> Đi vào </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-729.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Bây giờ, hãy đợi cho đến khi Trình kiểm tra Tệp Hệ thống sửa chữa Tệp Hệ thống Windows. <br> 6. Khi điều này hoàn thành, <strong> khởi động lại </strong> máy tính của bạn. <br> 7. Sau khi khởi động lại, hãy mở <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Dọn dẹp đĩa </a> và mở ra <strong> Dọn dẹp các tập tin hệ thống. </strong> Chọn để xóa các tệp sau và nhấp vào <strong> ĐỒNG Ý: </strong></p> <ul> <li> Tệp cài đặt Windows tạm thời </li> <li> Dọn dẹp Windows Update </li> <li> Tệp nhật ký nâng cấp Windows. </li> </ul> <p><img src=\"images/image_thumb-60-389.png\" alt=\"image\" loading=\"lazy\"></p> <p> 8. Khi hoàn tất, hãy sử dụng hướng dẫn ở phương pháp-1 ở trên để cập nhật Windows bằng Windows 10 21H1 Update Assistant </p> <p> </p> <h3> Phương pháp 4. Dọn dẹp cài đặt Windows 10. </h3> <p> Phương pháp cuối cùng để khắc phục sự cố cập nhật Windows 10 21H1 là thực hiện cài đặt Windows 10 sạch trên hệ thống của bạn. * Để làm điều đó, hãy đọc hướng dẫn trên bài viết này: <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Cách dọn dẹp cài đặt Windows 10 </strong></a> . </p> <p><strong> * Quan trọng: </strong> Việc cài đặt Windows 10 sạch sẽ có nghĩa là tất cả các tệp và cài đặt của bạn sẽ bị mất trong quá trình cài đặt. Vì vậy, hãy tiến hành và <strong> sao lưu tất cả các tệp và cài đặt quan trọng của bạn vào một phương tiện lưu trữ khác </strong> (ví dụ: vào ổ USB bên ngoài) trước khi tiếp tục xóa cài đặt Windows 10. </p> <p> Đó là tất cả mọi người! Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}