{"title":"Khắc phục: Lỗi ứng dụng máy ảnh 0xA00F424F (0x8004005) trong Windows 10. (Đã giải quyết)","content":"<p> Lỗi ứng dụng Máy ảnh 0xA00F424F trong Windows 10, khi cố chụp ảnh hoặc quay video, có nghĩa là ứng dụng Máy ảnh không thể lưu ảnh hoặc tệp video vào vị trí lưu trữ được chỉ định trên máy tính của bạn. Lỗi 0xA00F424F (0x8004005) có thể xuất hiện vì nhiều lý do, vì vậy hãy làm theo các phương pháp bên dưới để khắc phục. </p> <p><img src=\"images/image_thumb-9-592.png\" alt=\"FIX: Camera App Error 0xA00F424F in Windows 10\" loading=\"lazy\"></p> <p> Hướng dẫn này bao gồm các hướng dẫn từng bước để giải quyết lỗi &quot;Đã xảy ra lỗi. Xin lỗi, chúng tôi không thể lưu ảnh&quot; với lỗi: &quot;0xA00F424F (0x80004005)&quot; hoặc &quot;PhotoCaptureFileCreationFailed (0x80131500)&quot; </p> <h4> Cách khắc phục: Ứng dụng máy ảnh - Lưu lỗi 0xA00F424F (0x8004005) trong Windows 10. </h4> <h6> Phương pháp 1. Cho phép Ứng dụng Máy ảnh truy cập Máy ảnh. </h6> <p> Phương pháp đầu tiên để khắc phục lỗi Máy ảnh 0xA00F424F là đảm bảo rằng ứng dụng Máy ảnh có quyền truy cập vào máy ảnh của bạn. Để làm việc đó: </p> <p> 1. Điều hướng đến <strong> Cài đặt </strong> &gt; <strong> Riêng tư. <br> </strong> 2. Chọn <strong> Máy ảnh </strong> ứng dụng trên ngăn bên trái và ở ngăn bên phải thực hiện các cài đặt sau: </p> <p> a. Chuyển đổi <strong> Cho phép các ứng dụng truy cập vào máy ảnh của bạn </strong> chuyển sang <strong> TRÊN </strong> . <br> b. Cuộn xuống và bên dưới <strong> &#39;Chọn ứng dụng Microsoft Store nào có thể truy cập vào máy ảnh của bạn&#39; </strong> , chuyển đổi <strong> Máy ảnh </strong> ứng dụng chuyển sang <strong> TRÊN </strong> . * </p> <p><img src=\"images/image_thumb-4-435.png\" alt=\"Allow apps to access your camera in Windows 10\" loading=\"lazy\"></p> <h6> Phương pháp 2. Đặt lại Cài đặt Ứng dụng Máy ảnh. </h6> <p> 1. Điều hướng đến <strong> Cài đặt </strong> &gt; <strong> Ứng dụng </strong> . <br> 2. Tại danh sách &quot;Ứng dụng và tính năng&quot;, chọn ứng dụng Máy ảnh rồi nhấp vào <strong> Tùy chọn nâng cao </strong> . </p> <p><img src=\"images/image_thumb-5-262.png\" alt=\"Reset Camera App Settings - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Cuộn xuống và nhấp vào <strong> Cài lại. </strong></p> <p><img src=\"images/image_thumb-6-318.png\" alt=\"Reset app settings Windows 10\" loading=\"lazy\"></p> <h6></h6> <h6> Phương pháp 3. Xóa và tạo lại thư mục &#39;Camera Roll&#39;. </h6> <p> Phương pháp tiếp theo để sửa mã lỗi 0xA00F424F (0x80004005) trong ứng dụng Máy ảnh, là đảm bảo rằng thư mục &#39;Camera Roll&#39; (C: \\ Users \\% Username% \\ Pictures \\ Camera Roll), là vị trí lưu mặc định cho ảnh và video, tồn tại và có quyền chính xác để lưu ảnh và video. Để làm việc đó: </p> <p> 1. Mở Windows Explorer và trong thanh địa chỉ, nhập địa chỉ sau và nhấn <strong> Đi vào </strong> : </p> <ul> <li> % APPDATA% \\ Microsoft \\ Windows \\ Libraries \\ Pictures </li> </ul> <p><img src=\"images/image_thumb-10-952.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Mở thư mục &quot;Camera Roll&quot; * và đảm bảo rằng nó không có tệp. (Nếu không, hãy di chuyển tất cả các tệp của nó sang một vị trí khác trên đĩa của bạn.). </p> <p> * Lưu ý: Nếu thư mục Camera Roll không tồn tại, hãy chuyển sang bước 4. </p> <p> 3. Bây giờ, <strong> xóa bỏ </strong> các <strong> Thư viện ảnh </strong> thư mục. </p> <p><img src=\"images/image_thumb-11-440.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Cuối cùng, tạo một thư mục mới và đặt tên là &quot; <strong> Thư viện ảnh </strong> &quot; <br> 5. Khi hoàn tất, hãy mở Ứng dụng Máy ảnh và thử chụp ảnh hoặc quay video để xem sự cố đã được khắc phục chưa. </p> <p> </p> <h6> Phương pháp 4. Thêm thư mục Camera Roll vào Thư viện Ảnh. </h6> <p> Phương pháp cuối cùng để khắc phục Lỗi ứng dụng máy ảnh 0xA00F424F, là chỉ định một vị trí khác để lưu trữ ảnh / video. Để làm việc đó: </p> <p> 1. Mở Windows Explorer và trong thanh Địa chỉ, nhập địa chỉ sau và nhấn <strong> Đi vào </strong> : </p> <ul> <li> % APPDATA% \\ Microsoft \\ Windows \\ Libraries </li> </ul> <p> 2. Nhấp chuột phải vào <strong> Thư viện ảnh </strong> thư mục và chọn <strong> Tính chất </strong> . </p> <p><img src=\"images/image_thumb-8-686.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Bây giờ, hãy thực hiện một trong những thao tác sau: </p> <p> a. Nếu &#39;Thư viện ảnh&#39; không được liệt kê trong &#39;Vị trí thư viện, hãy nhấp vào <strong> Thêm vào </strong> nút, mở <strong> Những bức ảnh </strong> thư mục và sau đó chọn <strong> Thư viện ảnh </strong> thư mục làm vị trí lưu mặc định cho ảnh và video. </p> <p> b. Nếu thư mục &#39;Camera Roll&#39; được liệt kê trong &#39;Vị trí thư viện&#39;, hãy nhấp vào <strong> Thêm vào </strong> và chỉ định một thư mục lưu trữ mới cho Ứng dụng Máy ảnh. Khi hoàn tất, hãy nhấp vào <strong> Đặt vị trí lưu </strong> và bấm vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-12-180.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Cuối cùng, mở Ứng dụng Máy ảnh và thử chụp ảnh hoặc quay video. </p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}