{"title":"Khắc phục: Máy tính xách tay Lenovo bị kẹt màn hình LOGO. (Đã giải quyết)","content":"<p> Nếu máy tính xách tay Lenovo của bạn bị kẹt ở màn hình logo thì hãy tiếp tục đọc. Hướng dẫn này bao gồm các hướng dẫn từng bước để khắc phục sự cố sau trên máy tính xách tay Lenovo: Sau khi bật, máy tính xách tay không khởi động được và bị treo ở màn hình giật gân logo Lenovo. (Sự cố vẫn tiếp diễn ngay cả khi bạn cố gắng khởi động từ thiết bị có khả năng khởi động USB). </p> <p><img src=\"images/image_thumb-17-276.png\" alt=\"FIX: Lenovo laptop is stuck at LOGO screen.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> CÁCH SỬA: Laptop bị kẹt màn hình LOGO LENOVO. * </h4> <p> * Quan trọng: Trước khi khắc phục sự cố máy tính, hãy ngắt kết nối tất cả các thiết bị ngoại vi để đảm bảo rằng sự cố không phải do thiết bị được kết nối. </p> <p> </p> <h6> Bước 1. Đặt lại BIOS về cài đặt mặc định. </h6> <p> Bước đầu tiên để giải quyết tình trạng laptop bị treo logo Lenovo là đặt lại BIOS về cài đặt mặc định. Để làm việc đó: </p> <p> 1. <strong> Tắt </strong> máy tính xách tay bằng cách liên tục nhấn nút nguồn trong 5-7 giây. <br> 2. Bây giờ hãy làm theo hướng dẫn bên dưới theo kiểu máy của bạn, để vào BIOS: </p> <ul> <li> Nếu hệ thống của bạn là <strong> ThinkPad </strong> , nhấn nút Nguồn và sau đó nhấn nhanh và liên tục phím (Fn +) F2 hoặc (Fn +) F1. </li> <li> Nếu hệ thống của bạn là <strong> ý tưởng </strong> máy tính xách tay, định vị và <strong> nhấn </strong> các <a href=\"https://support.lenovo.com/us/en/solutions/HT104038\" target=\"_blank\" rel=\"nofollow noopener\"> NOVO </a> , thường nằm bên cạnh nút Nguồn, sau đó chọn <strong> Vào Menu BIOS </strong> . </li> </ul> <p> 3. Tại <strong> Lối ra </strong> chọn tab <strong> Tải Thiết lập mặc định </strong> hoặc &quot;Tải cài đặt được Tối ưu hóa&quot;. <br> 4. <strong> Lưu và thoát khỏi BIOS </strong> và xem liệu bạn có thể khởi động vào Windows hay không. <br> 5. Nếu máy tính xách tay vẫn bị treo ở màn hình logo Lenovo, hãy tiếp tục bước tiếp theo. </p> <p> </p> <h6> Bước 2. Vô hiệu hóa Lenovo Service Engine. </h6> <p> Trong một số máy tính xách tay Lenovo (và máy tính để bàn), hệ thống bị treo ở &quot;Logo Lenovo&quot; trong khi khởi động, khi &quot;Lenovo Service Engine&quot; được bật. Để tắt dịch vụ: </p> <p> 1. Nhập vào menu BIOS. <br> 2. Tại <strong> Bảo vệ </strong> , đánh dấu và tắt &quot;Lenovo Service Engine&quot;. </p> <p><img src=\"images/image_thumb-19-834.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Lưu và thoát </strong> từ menu BIOS. <br> 4. Nếu máy tính xách tay vẫn bị treo ở màn hình giật logo Lenovo, hãy tiếp tục bước tiếp theo. </p> <p> </p> <h6> Bước 3: Thực hiện Thiết lập lại nguồn. </h6> <p> Phương pháp tiếp theo để giải quyết vấn đề &quot;Logo Lenovo bị kẹt&quot; là thực hiện thiết lập lại nguồn. Để làm việc đó: </p> <p> 1. <strong> Ngắt kết nối </strong> tất cả các thiết bị ngoại vi được kết nối. <br> 2. <strong> Tẩy </strong> các <strong> Bộ chuyển điện xoay chiêu </strong> . <br> 3. <strong> Tẩy </strong> các <strong> Ắc quy </strong> . * </p> <p> * Lưu ý: Nếu bạn không thể tháo pin, hãy để máy tính xách tay mở cho đến khi hết pin. </p> <p> 4. <strong> nhấn </strong> và <strong> giữ lại </strong> các <strong> Quyền lực </strong> trong ít nhất 50-60 giây và sau đó nhả nút Nguồn. <br> 5. Chỉ kết nối Bộ đổi nguồn AC và bật máy tính xách tay. <br> 6. Nếu Windows khởi động bình thường, hãy tắt máy tính xách tay của bạn và kết nối lại pin và các thiết bị ngoại vi. </p> <h6> Bước 4. Tháo pin CMOS. </h6> <p> 1. <strong> Tẩy </strong> các <strong> Ắc quy </strong> và <strong> bộ chuyển điện xoay chiêu </strong> . <br> 2. Lật ngược máy tính xách tay và <strong> tẩy </strong> các <strong> cover lại </strong> . * </p> <p> * Lưu ý: Cách tháo nắp lưng khác nhau tùy theo kiểu máy tính xách tay. Vì vậy, hãy thực hiện tìm kiếm trên Google về cách tháo rời mẫu máy tính xách tay Lenovo của riêng bạn. </p> <p> 3. Xác định vị trí và <strong> tẩy </strong> các <strong> Pin CMOS </strong> . * </p> <p> * Lưu ý: Pin CMOS có hình tròn và bạn có thể tháo pin ra bằng cách dùng tuốc nơ vít nhỏ, đầu dẹt để lấy pin ra. </p> <p> 4. <strong> nhấn </strong> và <strong> giữ lại </strong> các <strong> Quyền lực </strong> trong ít nhất 50-60 giây và sau đó thả nó ra. </p> <p> 5. Đầu tiên kết nối Bộ đổi nguồn AC và sau đó lắp lại pin CMOS. <br> 5. Bật máy tính xách tay. * </p> <p> * Lưu ý: Nếu sự cố vẫn tiếp diễn, hãy tháo và cắm pin CMOS trong ít nhất 30 phút. Sau đó, lắp pin CMOS trở lại, kết nối Bộ chuyển đổi AC và bật máy tính xách tay. </p> <p> </p> <h6> Bước 5. Tháo đơn vị DVD. * </h6> <p><strong> * Quan trọng: </strong> Tắt máy tính của bạn và tháo Bộ điều hợp nguồn trước khi thêm hoặc bớt các bộ phận. </p> <p> Nếu bạn sở hữu một máy tính xách tay có ổ đĩa DVD, hãy tháo nó ra và bật lại máy tính xách tay của bạn. (Điều này nghe có vẻ kỳ lạ, nhưng trong một số trường hợp có hiệu quả.) </p> <p> </p> <h6> Bước 6. Tháo và gắn lại RAM &amp; Ổ cứng. </h6> <p> Khi máy tính (máy tính để bàn hoặc máy tính xách tay) bị treo ở màn hình LOGO (ĐĂNG), thường có nghĩa là có vấn đề với ổ cứng (HDD) hoặc bộ nhớ (RAM). Vì vậy, hãy tiến hành như sau: </p> <p><strong> * Quan trọng: </strong> Tắt máy tính của bạn và tháo Bộ điều hợp nguồn trước khi thêm hoặc tháo các bộ phận của nó. </p> <p> 1. Tháo và lắp lại (các) Mô-đun RAM. <br> 2. Bật máy tính xách tay và xem sự cố vẫn tiếp diễn. Nếu có, thì… <br> 3. Tắt máy tính xách tay và tháo (ngắt kết nối) ổ cứng (HDD). <br> 4. Sau khi tháo ổ cứng, bật lại máy tính xách tay. <br> 5. Nếu ổ cứng là nguyên nhân gây ra sự cố, thì màn hình giật gân LOGO của Lenovo sẽ biến mất và bạn sẽ nhận được thông báo &quot;Không tìm thấy thiết bị khởi động được&quot; hoặc tương tự như vậy. Nếu điều này xảy ra: * </p> <blockquote><p> a. Tắt máy tính xách tay. <br> b. Làm sạch các điểm tiếp xúc trên cả ổ cứng và ổ cắm HDD bằng bình xịt làm sạch tiếp điểm. <br> c. Kết nối lại ổ cứng và tiếp tục đọc bên dưới (6). </p></blockquote> <p> * Lưu ý: Nếu điều này không xảy ra, điều này cho thấy sự cố BIOS hoặc sự cố bo mạch chủ, chỉ có kỹ thuật viên máy tính chuyên dụng mới có thể sửa chữa được. </p> <p> 6. Bật máy tính xách tay và xem sự cố đã được giải quyết chưa. Nếu không, hãy tiến hành sao lưu các tệp của bạn và sau đó thực hiện cài đặt Windows sạch sẽ bằng cách làm theo các bước bên dưới: </p> <blockquote><p> a. Tháo và kết nối ổ cứng với một máy tính đang hoạt động khác (ví dụ: bằng cách sử dụng Bộ điều hợp ổ cứng USB sang SATA). <br> b. Nếu bạn có thể đọc nội dung của ổ đĩa, hãy tiếp tục và <strong> sao lưu các tệp của bạn </strong> . * </p> <p> * Lưu ý: Nếu ổ cứng không nhận được từ máy tính phụ thì ổ cứng này đã bị lỗi và bạn phải thay thế ổ cứng mới. </p> <p> c. Sau khi sao lưu các tệp của bạn, hãy tiếp tục và <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> chẩn đoán sự cố của ổ cứng </a> và theo kết quả, hãy thay thế ổ cứng (nếu nó bị lỗi), hoặc (nếu nó ổn) và tiến hành <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> xóa tất cả các phân vùng trên ổ cứng </a> . </p></blockquote> <p> 7. Sau khi làm sạch các phân vùng, hãy đặt lại ổ cứng HDD trên máy tính xách tay và tiến hành <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> cài đặt sạch Windows </a> . </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}