{"title":"Khắc phục: Outlook 0x80042112 - Nhận được báo cáo lỗi (Đã giải quyết)","content":"<p> Outlook 0x80042112 Lỗi nhận được báo cáo, thường xảy ra khi Outlook đang cố gắng nhận email có kích thước rất lớn (ví dụ: email có tệp đính kèm lớn). Trong trường hợp này, Outlook hiển thị lỗi sau trong &#39;Tiến trình Gửi / Nhận&#39;: Lỗi được báo cáo &quot;Tác vụ &#39;% Email-Tài khoản% - Đang nhận&#39; (0x80042112): &#39;Không thể tải xuống các thư e-mail sau trên máy chủ thư. Hãy liên hệ với nhà cung cấp dịch vụ Internet (ISP) hoặc quản trị viên thư của bạn nếu bạn tiếp tục nhận được lỗi này. &quot; </p> <p><img src=\"images/image_thumb-7-121.png\" alt=\"FIX: Outlook 0x80042112 Receiving reported error. \" loading=\"lazy\"></p> <p> Hướng dẫn này chứa các hướng dẫn chi tiết để giải quyết lỗi nhận Outlook 0x80042112. </p> <h4> Cách sửa lỗi Outlook nhận được báo cáo 0x80042112. </h4> <h6> Bước 1. Đảm bảo rằng bạn đã kết nối Internet. </h6> <p> Đôi khi lỗi nhận Outlook 0x80042112, xảy ra do kết nối Internet bị dừng. Vì vậy, trước hết, hãy xác minh rằng kết nối Internet của bạn đang hoạt động. Để làm điều đó, hãy mở trình duyệt Internet của bạn và truy cập bất kỳ trang web nào, để kiểm tra kết nối của bạn. </p> <p> </p> <h6> Bước 2. Xóa Tin nhắn Email Hộp thư đi. </h6> <p> Phương pháp thứ hai để giải quyết lỗi 0x80042112 trong Outlook, là xóa hoặc chuyển sang thư nháp, tất cả các thư email đã bị kẹt trong Hộp thư đi. Để làm việc đó: </p> <p> 1. Trong Outlook, hãy nhấp vào <strong> Gửi đi nhận lại </strong> tab, sau đó bấm <strong> Làm việc ngoại tuyến </strong> . </p> <p><img src=\"images/image_thumb-8-737.png\" alt=\"Move Outbox Emails to Drafts folder\" loading=\"lazy\"></p> <p> 2. <strong> Khởi động lại </strong> Quan điểm. <br> 3. Chọn <strong> Hộp thư đi </strong> thư mục (ở bên trái) và sau đó nhấn <strong> CTRL </strong> + <strong> A </strong> để chọn tất cả các email (ở bên phải). <br> 4. Nhấp chuột phải vào các email đã chọn và chuyển chúng đến <strong> Bản nháp </strong> thư mục, bằng cách nhấp vào <strong> Di chuyển -&gt; Thư mục Khác </strong> , và sau đó chọn <strong> Bản nháp </strong> thư mục từ danh sách. </p> <p><img src=\"images/image_thumb-10-352.png\" alt=\"FIX Outlook error 0x80042112\" loading=\"lazy\"></p> <p> </p> <p> 5. Khi hoàn tất, hãy nhấp vào <strong> Gửi đi nhận lại </strong> và nhấp vào <strong> Làm việc trực tuyến. <br> </strong> 6. <strong> Khởi động lại </strong> Outlook và thực hiện Gửi / Nhận. </p> <h6></h6> <h6> Bước 3. Chạy Outlook mà không cần bổ trợ. </h6> <p> Một phương pháp khác để khắc phục lỗi Outlook 0x80042112 khi nhận, là khởi động ứng dụng Outlook ở Chế độ An toàn và tắt bất kỳ Phần bổ trợ nào có thể gây ra lỗi. </p> <p> 1. Để khởi động Outlook ở Chế độ An toàn, hãy giữ <strong> CTRL </strong> (trên bàn phím của bạn) rồi bấm đúp vào lối tắt Microsoft Outlook hoặc: </p> <blockquote><p> a. Nhấn đồng thời Windows <img src=\"images/image_thumb36-371.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> b. Kiểu: <strong> triển vọng / an toàn </strong> và bấm vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-14-671.png\" alt=\"outlook safe mode\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. Trong Chế độ An toàn của Outlook, điều hướng đến các tùy chọn Bổ trợ và <strong> vô hiệu hóa tất cả các Bổ trợ </strong> . Để làm việc đó: </p> <ul> <li> Để tắt Phần bổ trợ trong <strong> Outlook 2007 </strong> : </li> </ul> <blockquote><p> 1. <strong> Trên </strong> các <strong> Công cụ </strong> menu, bấm vào <strong> Trung tâm Tin tưởng. </strong><br> 2. Chọn <strong> Thêm vào </strong> trên ngăn bên trái. <br> 3. Ở ngăn bên phải, chọn <strong> COM Add-in </strong> và bấm vào <strong> Đi… <br> </strong> 4. <strong> Bỏ chọn </strong> tất cả các hộp kiểm, để tắt tất cả các phần bổ trợ và nhấp vào <strong> ĐỒNG Ý. </strong></p></blockquote> <ul> <li> Để tắt Phần bổ trợ trong <strong> Triển vọng 2016, 2013 </strong> hoặc là <strong> 2010 </strong> : </li> </ul> <blockquote><p> 1. Nhấp vào <strong> Tập tin </strong> menu và chọn <strong> Tùy chọn </strong> . <br> 2. Chọn <strong> Bổ trợ tại </strong> ngăn bên trái. <br> 3. Ở ngăn bên phải, chọn <strong> COM Add-in </strong> và bấm vào <strong> Đi… </strong></p></blockquote> <p><img src=\"images/image_thumb-20-411.png\" alt=\"disable outlook add-ins\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. <strong> Bỏ chọn </strong> <strong> tất cả </strong> các hộp kiểm và nhấp vào <strong> đồng ý </strong> để tắt tất cả các Bổ trợ. </p> <p><strong><img src=\"images/image_thumb-21-683.png\" alt=\"turn off outlook add-ins\" loading=\"lazy\"><strong><br> </strong></strong></p> </blockquote> <p> 3. <strong> Khởi động lại </strong> Quan điểm. <br> 4. Cố gắng Gửi / Nhận. Nếu tiến trình gửi / nhận kết thúc bình thường và không hiển thị lỗi 0x80042112, thì hãy tiếp tục và bật lại từng plugin đã bị vô hiệu hóa và khởi động lại Outlook, cho đến khi bạn tìm thấy plugin nào gây ra sự cố. </p> <p> </p> <h6> Bước 4. Kiểm tra cài đặt Chống vi-rút &amp; Tường lửa của bạn. </h6> <p> Nếu bạn đang sử dụng chương trình chống vi-rút có tính năng quét email, hãy tắt Phần bổ trợ Chống vi-rút trong Outlook, (xem hướng dẫn ở bước 3 ở trên), hoặc tạm thời tắt tính năng Bảo vệ chống vi-rút hoặc gỡ cài đặt chương trình Chống vi-rút. Ngoài ra, hãy kiểm tra cài đặt Tường lửa của bạn và đảm bảo rằng các cổng máy chủ email mà bạn đang sử dụng không bị chặn khỏi chương trình Tường lửa. Cụ thể hơn, tại cài đặt Tường lửa của bạn: </p> <p> A. Cho phép các tệp sau để truy cập Internet: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Bật các cổng sau trong Tường lửa: </p> <ul> <li><strong> Cổng 110 </strong> (Nếu bạn đang sử dụng Máy chủ Thư đến POP3 mà không có kết nối được mã hóa) * </li> <li><strong> Cổng 995 </strong> (Nếu bạn đang sử dụng Máy chủ Thư đến POP3 có kết nối được mã hóa (Đã bật SSL) </li> </ul> <ul> <li><strong> Cổng 143 </strong> (nếu bạn đang sử dụng Máy chủ Thư đến IMAP mà không có kết nối được mã hóa) </li> <li><strong> Cổng 993 </strong> (nếu bạn đang sử dụng Máy chủ Thư đến IMAP với kết nối được mã hóa (Đã bật SSL) </li> </ul> <ul> <li><strong> Cổng 25 </strong> Nếu máy chủ Thư đi SMTP của bạn không sử dụng SSL. * </li> <li><strong> Cổng 465 </strong> hoặc là <strong> 587 </strong> nếu máy chủ Thư đi SMTP của bạn sử dụng SSL </li> </ul> <p> * Lưu ý: Theo mặc định, cổng 25 dành cho truy cập đi và cổng 110 dành cho truy cập đến. Nếu bạn không chắc chắn về các cổng, hãy liên hệ với ISP hoặc quản trị viên hệ thống của bạn. </p> <p> </p> <h6> Bước 5. Sửa chữa tệp Dữ liệu Outlook PST. </h6> <p> Bước tiếp theo để sửa lỗi Outlook nhận được báo cáo 0x80042112 là chạy Công cụ sửa chữa hộp thư đến để sửa tệp .pst của bạn. Hướng dẫn chi tiết để làm điều đó có thể được tìm thấy trong hướng dẫn này: <a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách sửa chữa tệp dữ liệu Outlook PST </a> . </p> <p> </p> <h6> Bước 6. Kiểm tra Kích thước của (các) Thư Email từ WEB. </h6> <p> Nếu bạn có quyền truy cập vào tài khoản email của mình qua web, hãy đăng nhập vào tài khoản email của bạn bằng trình duyệt web và kiểm tra xem kích thước của email có phải là vấn đề hay không. Ví dụ: nếu bạn tìm thấy một email lớn trên Hộp thư đến của mình, thì hãy tải xuống tệp đính kèm và sau đó xóa email đó. * </p> <p> * Lưu ý: Nếu bạn không có quyền truy cập vào tài khoản email của mình thông qua web, hãy liên hệ với nhà cung cấp email của bạn để báo cáo sự cố. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}