{"title":"KHẮC PHỤC: Không thể mở liên kết từ email Windows 10 hoặc Outlook trong Windows 10. (Đã giải quyết)","content":"<p> Nếu bạn không thể mở liên kết từ email trong ứng dụng Thư &amp; Outlook của Windows 10, hãy tiếp tục đọc phần bên dưới để khắc phục sự cố. Nhiều người dùng đã báo cáo rằng sau khi cập nhật Windows 10, họ sẽ không thể mở các liên kết nhúng từ email trong trình duyệt web và nhận được lỗi không xác định. </p> <p> Chi tiết vấn đề: Trên máy tính chạy Windows 10, các siêu liên kết từ email của Outlook hoặc ứng dụng Thư của Windows 10, không mở trong trình duyệt web, đặc biệt nếu bạn đang sử dụng làm trình duyệt mặc định là Chrome hoặc Firefox chứ không phải Microsoft Edge . </p> <h4> Cách khắc phục: Không thể mở liên kết HTML từ email sau khi cập nhật Windows 10. </h4> <h6> Phương pháp 1. Đặt lại các ứng dụng mặc định. </h6> <p> 1. Đóng tất cả các trình duyệt web đang mở. <br> 2. Đóng ứng dụng email bạn đang sử dụng (ví dụ: Windows 10 Mail, Outlook) </p> <p> 3. Từ menu Bắt đầu <img src=\"images/image_thumb2_thumb_thumb-709.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> nhấp chuột <strong> Cài đặt </strong><img src=\"images/image_thumb-66-594.png\" alt=\"image\" loading=\"lazy\"> và bấm vào <strong> Ứng dụng </strong></p> <p><img src=\"images/image_thumb-72-875.png\" alt=\"Windows 10 Apps\" loading=\"lazy\"></p> <p> 4. Chọn <strong> Ứng dụng mặc định </strong> từ ngăn bên trái và sau đó nhấp vào <strong> Cài lại </strong> để đặt lại các ứng dụng đề xuất của Microsoft. </p> <p><img src=\"images/image_thumb-73-622.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 5. Bây giờ hãy mở chương trình email của bạn và mở một siêu liên kết từ một email. Thông thường liên kết sẽ mở trong trình duyệt Microsoft Edge mà không có vấn đề gì. </p> <p> 6. Bây giờ, <strong> đóng </strong> ứng dụng thư một lần nữa. </p> <p> 7. Mở trình duyệt web và đặt nó làm mặc định hoặc điều hướng đến <strong> Cài đặt&gt; </strong> <strong> Ứng dụng&gt; Ứng dụng mặc định </strong> và tại <strong> Trình duyệt web </strong> tùy chọn, nhấp vào <strong> Microsoft Edge </strong> và chọn trình duyệt yêu thích của bạn làm trình duyệt web mặc định. </p> <p><img src=\"images/image_thumb-75-384.png\" alt=\"Set Default Web Browser - WIndows 10\" loading=\"lazy\"></p> <p> 8. Mở lại ứng dụng Thư và thử mở một siêu liên kết. Nếu sự cố vẫn tiếp diễn, hãy làm theo các bước trong phương pháp-2. </p> <h6> Phương pháp 2. Thay đổi liên kết HTML trong sổ đăng ký. </h6> <p> 1. Nhấn đồng thời Windows <img src=\"images/image_thumb36-617.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại <strong> regedit </strong> &amp; nhấn <strong> Đi vào. </strong></p> <p><img src=\"images/image_thumb7-779.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2. Tại ngăn bên trái, điều hướng đến khóa con này: </p> <ul> <li><strong> HKEY_CURRENT_USER \\ Software \\ Classes \\ .html </strong></li> </ul> <p> 3. Bây giờ <em> nhấn đúp chuột </em> tại <strong> (Mặc định) </strong> Chuỗi ở ngăn bên phải và đặt dữ liệu giá trị thành <strong> htmlfile </strong></p> <p><img src=\"images/image_thumb2-467.png\" alt=\"Cannot Open Links from Windows 10 Email or Outlook in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 4. Thực hiện cùng một hoạt động và sửa đổi <em><strong> Mặc định </strong></em> chuỗi giá trị thành <strong> htmlfile </strong> trong các khóa con này: </p> <ul> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .htm </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .shtml </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .xhtml </em></li> <li><em> HKEY_CURRENT_USER \\ Software \\ Classes \\ .xht <br> </em></li> </ul> <p> 5. Đóng trình chỉnh sửa Registry và <strong> khởi động lại </strong> máy tính của bạn. <br> 6. Cố gắng mở các siêu liên kết từ chương trình email của bạn. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về điều này. </p>"}