{"title":"KHẮC PHỤC: LỖI VI PHẠM CỦA DPC WATCHDOG BSOD. (Đã giải quyết)","content":"<p> Trên máy tính chạy Windows 10, 8 hoặc 7, lỗi BSOD sau có thể xuất hiện: &quot;DPC_WATCHDOG_VIOLATION&quot;. Sự cố màn hình xanh &quot;DPC WATCHDOG VIOLATION&quot; thường xảy ra ngay cả khi hệ thống không hoạt động và thường là do trình điều khiển thiết bị không hợp lệ hoặc bị hỏng và trong một số trường hợp khác có liên quan đến sự cố phần cứng, đặc biệt là với cạc đồ họa. </p> <p><img src=\"images/image_thumb-2-618.png\" alt=\"FIX DPC WATCHDOG VIOLATION BLUE SCREEN ERROR\" loading=\"lazy\"></p> <p> </p> <p> Hướng dẫn khắc phục sự cố này chứa một số phương pháp để giải quyết <strong> DPC XEM VI PHẠM </strong> Sự cố BSOD trên HĐH Windows 10, 8 / 8.1 hoặc 7. </p> <p> </p> <h2> Cách khắc phục sự cố BoSD VI PHẠM DPC WATCHDOG trên Windows 10/8/7. </h2> <p> Sự cố màn hình xanh DPC WATCHDOG VIOLATION có thể do một số lý do, ví dụ: trình điều khiển thiết bị hoặc phần mềm bị lỗi, RAM hoặc ổ đĩa bị hỏng, v.v. Vì vậy, để giải quyết vấn đề &quot;DPC WATCHDOG VIOLATION&quot; BSOD, hãy làm theo các bước dưới đây: </p> <h6> Phương pháp 1. Quét hệ thống của bạn để tìm Virus và Phần mềm độc hại. </h6> <p> Bước đầu tiên để giải quyết sự cố màn hình xanh &quot;DPC WATCHDOG VIOLATION&quot; là đảm bảo rằng hệ thống của bạn không có vi rút / phần mềm độc hại. Đối với nhiệm vụ đó, hãy làm theo hướng dẫn trong hướng dẫn này: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách quét vi rút và các chương trình độc hại khác trên máy tính của bạn. </a></p> <p> </p> <h6> Phương pháp 2. Gỡ cài đặt Phần mềm Bảo mật / Chống vi-rút của bạn. </h6> <p> Sự cố màn hình xanh &quot;DPC WATCHDOG VIOLATION&quot; có thể gây ra sau khi tự động cập nhật chương trình Chống vi-rút / Bảo mật của bạn (đặc biệt nếu bạn đang sử dụng AVAST hoặc AVG). Vì vậy, hãy tiếp tục và gỡ cài đặt hoàn toàn chương trình chống vi-rút khỏi hệ thống và khởi động lại máy tính của bạn. <br> - Nếu sự cố BSOD không xảy ra sau khi diệt vi-rút, hãy tiến hành tải xuống và cài đặt lại phiên bản mới nhất của phần mềm bảo mật trên hệ thống của bạn. </p> <p> </p> <h6> Phương pháp 3. Khởi động Windows ở trạng thái khởi động sạch. </h6> <p> Phương pháp tiếp theo, để giải quyết vấn đề BSOD &quot;DPC WATCHDOG VIOLATION&quot;, là khởi động Windows trong <a href=\"https://www.repairwin.com/how-to-start-windows-in-clean-boot-state/\" target=\"_blank\" rel=\"nofollow noopener\"> &quot;khởi động sạch sẽ </a> &quot;để xác định chương trình nào khiến hệ thống của bạn gặp sự cố. </p> <p> Để khởi động Windows ở trạng thái Khởi động sạch: </p> <p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại <strong> msconfig </strong> và hãy nhấn <strong> Đi vào </strong> . </p> <p><img src=\"images/image_thumb-47-307.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. Tại tab Dịch vụ, <strong> Ẩn tất cả các Dịch vụ của Microsoft </strong> hộp kiểm và sau đó nhấn <strong> Vô hiệu hóa tất cả </strong> , để ngăn tất cả các dịch vụ không phải của Microsoft khởi động khi khởi động Windows. </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-257.png\" alt=\"clean boot state\" loading=\"lazy\"></p> <p> 4. Sau đó chọn <strong> Khởi động </strong> tab và <strong> Vô hiệu hóa </strong> tất cả các chương trình khác khởi động trong quá trình khởi động Windows và chạy trên nền. * </p> <p> * Lưu ý: Bật <strong> Windows 10 </strong> hoặc là <strong> số 8 </strong> , lựa chọn <strong> Mở trình quản lý tác vụ </strong> để tắt các chương trình khởi động. </p> <p><img src=\"images/image_thumb-29-129.png\" alt=\"Windows clean boot\" loading=\"lazy\"></p> <p> </p> <p> 5. Khi hoàn tất, hãy nhấp vào <strong> đồng ý </strong> và <strong> Khởi động lại </strong> máy tính của bạn. <br> 6. Nếu sau khi khởi động lại, máy tính của bạn hoạt động tốt và không có sự cố BSOD, hãy khởi chạy lại tiện ích Cấu hình Hệ thống và bật từng mục đã tắt và khởi động lại hệ thống của bạn, cho đến khi bạn tìm ra cái nào gây ra sự cố BSoD. * </p> <p> * Lưu ý đến <strong> lối ra </strong> từ <strong> Khởi động sạch </strong> trạng thái, khởi chạy tiện ích Cấu hình Hệ thống và tại <strong> Chung </strong> Chọn tab <strong> Khởi động bình thường. </strong></p> <p> </p> <h6> Phương pháp 4. Kiểm tra Bộ nhớ (RAM) và Đĩa cứng (HDD) xem có vấn đề gì không. </h6> <p> Sự cố màn hình xanh, có thể do mô-đun RAM bị hỏng hoặc ổ cứng bị hỏng. Để kiểm tra và chẩn đoán các thành phần RAM và HDD của bạn xem có vấn đề gì không, hãy làm theo hướng dẫn trong các hướng dẫn sau: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách chẩn đoán sự cố bộ nhớ máy tính với Memtest86 + </a></li> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Công cụ chẩn đoán &amp; kiểm tra ổ cứng tốt nhất để kiểm tra tình trạng ổ cứng </a></li> </ul> <p> </p> <p> </p> <h6> Phương pháp 5. Cập nhật Trình điều khiển Mạng &amp; Hiển thị. </h6> <p> Trong một số trường hợp, sự cố BSOD &quot;DPC WATCHDOG VIOLATION&quot;, xảy ra do trình điều khiển thiết bị không hợp lệ hoặc bị hỏng. Vì vậy, hãy tiến hành và cập nhật trình điều khiển của các thiết bị sau trên máy tính của bạn: * </p> <p> 1. Bộ điều hợp đồ họa (VGA). <br> 2. Bộ điều hợp Ethernet &amp; bộ điều hợp Wi-Fi (nếu có). </p> <p> * Ghi chú: <br> 1. nếu sự cố BSOD vẫn tiếp diễn, sau khi cập nhật các trình điều khiển ở trên, hãy tiếp tục và cập nhật tất cả các trình điều khiển khác trên hệ thống của bạn (Chipset, Trình điều khiển âm thanh, v.v.). <br> 2. Trong một số trường hợp, lỗi &quot;DPC_WATCHDOG_VIOLATION&quot; có thể xảy ra nếu bạn có Ổ đĩa thể rắn (SSD). Vì vậy, nếu bạn sở hữu ổ SSD, hãy tiến hành và cập nhật firmware trên ổ. Để biết hướng dẫn về cách cập nhật chương trình cơ sở SSD, hãy xem trang web của nhà sản xuất SSD của bạn. </p> <p> </p> <h6> Phương pháp 6. Cập nhật Trình điều khiển iaStor.sys. </h6> <p> 1. Điều hướng đến Trình quản lý thiết bị. <br> 2. Mở rộng Bộ điều khiển IDE ATA / ATAPI. <br> 3. Nhấp đúp vào <strong> Bộ điều khiển SATA / AHCI </strong> . </p> <p><img src=\"images/image_thumb-3-252.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Chọn <strong> Người lái xe </strong> tab và nhấp vào <strong> Các chi tiết về trình điều khiển </strong> . </p> <p><img src=\"images/image_thumb-4-105.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Nếu bạn đang sử dụng <strong> Trình điều khiển iaStor.sys </strong> , sau đó nhấn vào <strong> đồng ý </strong> và tiến hành thay đổi trình điều khiển như đề cập bên dưới, nếu không thì bỏ qua các bước còn lại. </p> <p><img src=\"images/image_thumb-5-421.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Nhấp vào <strong> Cập nhật driver </strong> . </p> <p><img src=\"images/image_thumb-6-840.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Chọn <strong> Duyệt máy tính của tôi để tìm phần mềm trình điều khiển </strong> . </p> <p><img src=\"images/image_thumb-7-251.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Nhấp vào <strong> Hãy để tôi chọn từ danh sách trình điều khiển thiết bị trên máy tính của tôi </strong> . </p> <p><img src=\"images/image_thumb-8-330.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Đánh dấu <strong> Bộ điều khiển SATA AHCI tiêu chuẩn </strong> và bấm vào <strong> Kế tiếp </strong> . <br> 10. Khi quá trình cài đặt trình điều khiển hoàn tất, <strong> đóng </strong> tất cả các cửa sổ đang mở và <strong> khởi động lại </strong> máy tính của bạn. </p> <p> </p> <h6> Phương pháp 7. <strong> Phân tích Minidump. </strong></h6> <p> Khi Windows gặp sự cố với màn hình xanh lam, hãy lưu trữ các chi tiết của màn hình BSoD vào (các) tệp nhỏ, được gọi là &quot; <strong> MiniDump </strong> &quot;. Phân tích của <strong> Minidump </strong> (các) tệp có thể giúp bạn khắc phục sự cố và giải quyết sự cố màn hình xanh. Để hoàn thành tác vụ này, hãy làm theo hướng dẫn trong bài viết này: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách phân tích tệp MiniDump với BlueScreenView </a> . </p> <p> Đó là tất cả! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}