{"title":"Khắc phục: Không thể thay đổi chủ đề - Chủ đề Aero Greyed Out trong Windows 7 (Đã giải quyết)","content":"<p> Sự cố sau đã xảy ra trong máy tính chạy Windows 7: Windows đã thay đổi thành chủ đề cơ bản và người dùng không thể thay đổi chủ đề vì khi cài đặt cá nhân hóa được mở, tất cả các chủ đề aero sẽ chuyển sang màu xám. Thay vào đó, tất cả các cài đặt khác trong bảng cá nhân hóa được bật (Nền màn hình, Màu Windows, Trình bảo vệ màn hình, v.v.), hãy chọn một chủ đề khác. </p> <p><img src=\"images/image_thumb-28-129.png\" alt=\"Cannot Change Theme – Themes Greyed Out\" loading=\"lazy\"></p> <p> </p> <p> Hướng dẫn này bao gồm các hướng dẫn để khắc phục sự cố sau trong Windows 7: Không thể thay đổi chủ đề - Chủ đề Greyed Out. </p> <h4> Cách khắc phục: Không thể thay đổi chủ đề - Chủ đề hàng không bị xám. </h4> <h6> Phương pháp 1. Quét hệ thống của bạn để tìm Virus và Phần mềm độc hại. </h6> <p> Bước đầu tiên để giải quyết vấn đề &quot;không thể thay đổi chủ đề cơ bản&quot; là đảm bảo rằng hệ thống của bạn không có vi-rút / phần mềm độc hại. Đối với nhiệm vụ đó, hãy làm theo hướng dẫn trong hướng dẫn này: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách quét vi rút và các chương trình độc hại khác trên máy tính của bạn. </a></p> <h6> Phương pháp 2. Khởi động lại Dịch vụ Chủ đề. </h6> <p> 1. Mở bảng điều khiển Windows Services: Để làm điều đó: </p> <ul> <li> Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-720.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. </li> <li> Trong hộp Tìm kiếm, nhập: <strong><em> services.msc </em></strong> &amp; nhấp chuột <strong> đồng ý </strong> . </li> <li> (Chấp nhận cảnh báo UAC nếu xuất hiện). </li> </ul> <p><img src=\"images/image_thumb-12-580.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. Trong bảng điều khiển Dịch vụ, nhấp chuột phải vào <strong> Chủ đề </strong> dịch vụ và lựa chọn <strong> Khởi động lại </strong> . * </p> <p> * Lưu ý: Nếu dịch vụ bị Dừng thì hãy nhấp vào <strong> Khởi đầu </strong> . </p> <p><img src=\"images/image_thumb-29-242.png\" alt=\"Themes Greyed Out - restart theme service\" loading=\"lazy\"></p> <p> </p> <h6> Phương pháp 3. Bật Kiểu trực quan trên các cửa sổ và nút. </h6> <p> 1. Nhấp vào <strong> Khởi đầu </strong> nút, nhấp chuột phải vào <strong> Máy tính a </strong> và chọn <strong> Tính chất </strong> . </p> <p><img src=\"images/image_thumb-30-382.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Nhấp vào <strong> Thiết lập hệ thống nâng cao </strong> bên trái. </p> <p><img src=\"images/image_thumb-31-876.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Tại tab &#39;Nâng cao&#39;, nhấp vào <strong> Cài đặt </strong> tại phần &#39;Hiệu suất&#39;. </p> <p><img src=\"images/image_thumb-15-696.png\" alt=\"fix High CPU and DISK Usage Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Tại <strong> Hiệu ứng hình ảnh </strong> , chọn tùy chọn &quot;Sử dụng kiểu trực quan trên cửa sổ và nút&quot; và nhấp vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-32-631.png\" alt=\"fix Theme cannot be changed - themes greyed out\" loading=\"lazy\"></p> <p> </p> <h6> Phương pháp 4. Cài đặt Trình điều khiển hiển thị mới nhất. </h6> <p><strong> 1. </strong> Hướng đến <strong> Bảng điều khiển </strong> &gt; <strong> Chương trình và các tính năng </strong> và <strong> gỡ cài đặt </strong> trình điều khiển VGA hiện được cài đặt. </p> <p><strong> 2. </strong> Khi hoạt động gỡ cài đặt hoàn tất <strong> khởi động lại </strong> máy tính của bạn. </p> <p><strong> 3. </strong> Sau khi khởi động lại, điều hướng đến trang web hỗ trợ của nhà sản xuất máy tính của bạn để tải xuống và cài đặt trình điều khiển mới nhất cho cạc đồ họa của bạn. Nếu bạn sở hữu máy tính để bàn hoặc máy tính xách tay * có card màn hình AMD / ATI hoặc NVIDIA, hãy làm theo các bước bên dưới để tìm, tải xuống và cài đặt phiên bản trình điều khiển mới nhất cho card màn hình của bạn. </p> <p><strong> * Ghi chú: </strong> Nếu bạn không thể tìm thấy trình điều khiển từ các liên kết bên dưới, hãy điều hướng đến trang web hỗ trợ của nhà sản xuất máy tính của bạn. </p> <p> </p> <p><strong> Đối với GPU dựa trên NVIDIA. </strong></p> <ol> <li> <ol> <li> Đi đến <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Trang tìm kiếm trình điều khiển nâng cao NVIDIA </a> và tìm kiếm trình điều khiển tương ứng cho bộ điều hợp màn hình của bạn. </li> <li> Trong trang kết quả tìm kiếm, hãy tải xuống phiên bản trình điều khiển trước đó. </li> <li> Cài đặt trình điều khiển bạn đã tải xuống và khởi động lại máy tính của bạn. </li> </ol> </li> </ol> <p> </p> <p><strong> Đối với GPU dựa trên AMD. </strong></p> <ul> <li> <ol> <li> Đi đến <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Tải xuống trình điều khiển AMD (ATI) </a> và tìm kiếm trình điều khiển tương ứng cho bộ điều hợp màn hình của bạn. </li> <li> Trong trang kết quả tìm kiếm, nhấn <strong> Trình điều khiển và phần mềm trước đó </strong> liên kết ở bên phải. </li> <li> Cài đặt trình điều khiển bạn đã tải xuống và khởi động lại máy tính của bạn. </li> </ol> </li> </ul> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}