{"title":"KHẮC PHỤC: VIDEO DXGKRNL FATAL ERROR trong Windows 10 (Đã giải quyết)","content":"<p> Nếu bạn gặp phải lỗi màn hình xanh &quot;VIDEO DXGKRNL FATAL ERROR&quot; trong Windows 10, hãy làm theo hướng dẫn bên dưới để khắc phục sự cố. </p> <p> Lỗi BSOD của Windows 10 &quot; <em> PC của bạn đã gặp sự cố và cần khởi động lại. Chúng tôi chỉ đang thu thập một số thông tin lỗi và sau đó chúng tôi sẽ khởi động lại cho bạn. Nếu bạn muốn biết thêm, bạn có thể tìm kiếm trực tuyến sau lỗi này: VIDEO DXGKRNL FATAL ERROR &quot;, </em> thường chỉ ra sự cố với trình điều khiển Video. </p> <p><img src=\"images/image_thumb-7-129.png\" alt=\"FIX: VIDEO DXGKRNL FATAL ERROR in Windows 10\" loading=\"lazy\"></p> <p> Hướng dẫn này bao gồm các hướng dẫn từng bước để giải quyết lỗi màn hình xanh &quot;VIDEO DXGKRNL FATAL ERROR&quot; trong Windows 10. </p> <h2> Cách khắc phục: Windows 10 VIDEO DXGKRNL FATAL ERROR. </h2> <h3> Bước 1. Sửa lỗi VIDEO DXGKRNL FATAL ERROR bằng cách Gỡ cài đặt / Cài đặt lại Trình điều khiển Video. </h3> <p> 1. Mở <strong> Quản lý thiết bị </strong> . Để làm việc đó: </p> <ol> <li> <ol> <li> Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-153.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. </li> <li> Trong hộp &quot;Mở&quot;, nhập: <strong> devmgmt.msc </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </li> </ol> </li> </ol> <blockquote> <p><img src=\"images/image_thumb-5-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p></blockquote> <p> 2. <strong> Mở rộng </strong> các <strong> Bộ điều hợp hiển thị. <br> </strong> 3. <strong> Nhấp chuột phải </strong> trên (các) bộ điều hợp hiển thị đã cài đặt và chọn <strong> Gỡ cài đặt thiết bị. </strong></p> <p><img src=\"images/image_thumb-46-240.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. Ở cửa sổ tiếp theo, nếu bạn có tùy chọn: &quot; <strong> Xóa phần mềm trình điều khiển cho thiết bị này </strong> &quot;, chọn nó và sau đó nhấp vào <strong> đồng ý </strong> để gỡ bỏ các trình điều khiển đã cài đặt khỏi máy tính. </p> <p> 5. Sau khi gỡ cài đặt, <strong> khởi động lại </strong> máy tính của bạn và điều hướng đến <strong> Quản lý thiết bị </strong> lần nữa. <br> 6. Nhấp chuột phải vào Tên máy tính (ở trên cùng) và chọn <strong> Quét các thay đổi phần cứng. </strong></p> <p><img src=\"images/image_thumb-8-911.png\" alt=\"Scan for hardware changes\" loading=\"lazy\"></p> <p> </p> <p> 7. Để Windows phát hiện và cài đặt trình điều khiển màn hình, sau đó <strong> khởi động lại </strong> máy tính của bạn một lần nữa và kiểm tra xem &quot;VIDEO DXGKRNL FATAL ERROR&quot; vẫn còn. * </p> <p> * Lưu ý: Nếu Windows không thể tự động cài đặt trình điều khiển hiển thị tự động hoặc nếu bạn vẫn gặp lỗi màn hình xanh, hãy chuyển sang bước tiếp theo. </p> <p> </p> <h3><br clear=\"all\"> Bước 2. Cài đặt lại Trình điều khiển Video từ Trang web của Nhà sản xuất. </h3> <p> 1. Điều hướng đến <strong> Quản lý thiết bị </strong> và <strong> gỡ cài đặt </strong> bộ điều hợp hiển thị đã cài đặt. * </p> <p> * Lưu ý: Nếu bạn sở hữu một máy tính xách tay có hai (2) bộ điều hợp màn hình thì hãy gỡ cài đặt cả hai bộ điều hợp đó. </p> <p> 2. Truy cập trang web hỗ trợ của nhà sản xuất máy tính (hoặc cạc đồ họa) và tải xuống trình điều khiển mới nhất cho (các) cạc đồ họa của bạn. </p> <ul> <li> <ul> <li> Đối với <strong> NVIDIA </strong> dựa trên GPU, điều hướng đến <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Trang Tìm kiếm Trình điều khiển Nâng cao của NVIDIA </a> . </li> <li> Đối với <strong> AMD </strong> dựa trên GPU, điều hướng đến <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Trung tâm Tải xuống Trình điều khiển AMD (ATI). </a></li> <li> Đối với <strong> Intel </strong> dựa trên GPU, điều hướng đến <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Trung tâm tải xuống đồ họa Intel. </a></li> </ul> </li> </ul> <p> 3. Tiến hành và cài đặt trình điều khiển đã tải xuống. * </p> <p><strong> * Lưu ý quan trọng: </strong> Nếu bạn sở hữu máy tính xách tay có hai (2) bộ điều hợp màn hình, trước tiên hãy tiến hành cài đặt trình điều khiển cho bộ điều hợp AMD hoặc NVIDIA và khởi động lại máy tính xách tay của bạn. Sau khi khởi động lại, hãy tiếp tục và cài đặt trình điều khiển cho bộ điều hợp hiển thị INTEL và sau đó khởi động lại máy tính xách tay của bạn. </p> <p> 4. Sau khi cài đặt, <strong> khởi động lại </strong> PC của bạn và kiểm tra xem lỗi VIDEO DXGKRNL FATAL ERROR đã được giải quyết chưa. Nếu không, hãy chuyển sang bước tiếp theo. </p> <p> </p> <h3><br clear=\"all\"> Bước 3. Sửa chữa DirectX để sửa lỗi VIDEO DXGKRNL FATAL. </h3> <p> VIDEO DXGKRNL FATAL ERROR, chỉ ra sự cố trên trình điều khiển DirectX của Microsoft. Vì vậy, hãy tiến hành sửa chữa DirectX. </p> <p> 1. Tải xuống <a href=\"https://www.microsoft.com/en-us/download/details.aspx?displaylang=en&id=35\" target=\"_blank\" rel=\"nofollow noopener\"> Trình cài đặt web thời gian chạy của người dùng cuối DirectX </a> . <br> 2. Chạy tệp đã tải xuống (dxwebsetup.exe) và làm theo lời nhắc trên màn hình để cài đặt các thành phần tùy chọn DirectX Runtime. </p> <p><img src=\"images/image_thumb-9-847.png\" alt=\"Install DirectX Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Khi cài đặt hoàn tất <strong> khởi động lại </strong> PC của bạn. </p> <p> 4. Sau khi khởi động lại, đi tới <strong> Khởi đầu <img src=\"images/image_thumb-55-571.png\" alt=\"image\" loading=\"lazy\"> -&gt; Cài đặt </strong> -&gt; <strong> Cập nhật và Bảo mật -&gt; </strong> và bấm vào <strong> Kiểm tra cập nhật. </strong></p> <p><img src=\"images/image_thumb-76-281.png\" alt=\"Windows 10 - Check For Updates \" loading=\"lazy\"></p> <p> 5. Sau khi cài đặt bản cập nhật, hãy khởi động lại PC của bạn và kiểm tra xem lỗi BSOD đã được giải quyết chưa. Nếu không, hãy chuyển sang bước tiếp theo. </p> <p> </p> <h3><br clear=\"all\"> Bước 4. Sửa chữa các tập tin hệ thống Windows 10. </h3> <p> 1. Mở <strong> Command Prompt với tư cách là quản trị viên </strong> . <br> 2. Trong dấu nhắc lệnh, đưa ra lệnh sau và nhấn <strong> Đi vào: </strong></p> <ul> <li><strong> DISM.exe / Trực tuyến / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-176.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Khi thao tác DISM hoàn tất, hãy nhập lệnh sau và nhấn <strong> Đi vào </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-464.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Bây giờ hãy đợi cho đến khi Trình kiểm tra Tệp Hệ thống sửa chữa Tệp Hệ thống Windows. <br> 5. Khi điều này hoàn thành, <strong> khởi động lại </strong> máy tính của bạn và kiểm tra xem lỗi vẫn còn. </p> <p> </p> <h3><br clear=\"all\"> Bước 5. Phân tích tệp nhật ký Minidump (BSOD). </h3> <p> Khi Windows gặp sự cố với màn hình xanh lam, hãy lưu trữ các chi tiết của màn hình BSoD vào (các) tệp nhỏ, được gọi là &quot; <strong> MiniDump </strong> &quot;. Phân tích của <strong> Minidump </strong> (các) tệp có thể giúp bạn khắc phục sự cố và giải quyết sự cố LỖI BẤT LỰC VIDEO DXGKRNL màn hình xanh. Để hoàn thành tác vụ này, hãy làm theo hướng dẫn trong bài viết này: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách phân tích tệp MiniDump với BlueScreenView </a> . </p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}