{"title":"Khắc phục: HDMI Không có âm thanh với TV hoặc HDMI Không hiển thị trong thiết bị phát lại (Đã giải quyết).","content":"<p> Nếu bạn đã kết nối TV với máy tính xách tay của mình bằng cáp HDMI và không có đầu ra âm thanh khi phát video hoặc HDMI không được hiển thị dưới dạng thiết bị Phát lại, hãy tiếp tục đọc hướng dẫn này. </p> <p> Chi tiết vấn đề: Trên máy tính xách tay chạy Windows 10, thiết bị Đầu ra Kỹ thuật số (HDMI) không được liệt kê là thiết bị Phát lại và không có đầu ra âm thanh khi kết nối với TV bằng cáp HDMI. </p> <p> Sự cố &quot;Không có đầu ra âm thanh từ HDMI&quot; trong Windows 10 có thể xuất hiện vì một số lý do, vì vậy trong hướng dẫn này, bạn sẽ tìm thấy hướng dẫn từng bước để khắc phục sự cố. </p> <h2> Cách khắc phục: Không có đầu ra âm thanh từ HDMI &amp; HDMI Không hiển thị trong thiết bị phát lại trong Windows 10 * </h2> <p> * Gợi ý: Trước khi bạn tiếp tục các bước bên dưới: </p> <ul> <li><strong> Nhấp chuột phải </strong> tại <strong> biểu tượng âm thanh </strong><img src=\"images/image_thumb-11-109.png\" alt=\"image\" loading=\"lazy\"> trên thanh tác vụ để <strong> Mở Bộ trộn âm lượng </strong> và đảm bảo rằng <strong> Thiết bị đầu ra kỹ thuật số </strong> không bị tắt tiếng. </li> <li> Đảm bảo cáp HDMI được kết nối đúng cách cả trên máy tính xách tay và TV. </li> <li> Sau khi kết nối cáp HDMI, <strong> khởi động lại </strong> máy tính của bạn. </li> <li> Trong TV, hãy đặt đúng Cổng HDMI làm thiết bị đầu vào video. </li> <li> Nếu bạn sở hữu máy tính xách tay, hãy đóng nắp hoặc nhấn nút Nguồn một lần để đặt máy tính xách tay của bạn ở chế độ ngủ. Sau đó nhấn lại nút nguồn và kiểm tra lại âm thanh từ HDMI. </li> <li> Kiểm tra xem sự cố vẫn tiếp diễn bằng một cáp HDMI khác. </li> </ul> <p> </p> <h3> Bước 1. Đặt HDMI làm Thiết bị phát lại mặc định. </h3> <p> Bước đầu tiên để giải quyết sự cố Âm thanh HDMI trên Windows 10 là đặt HDMI làm thiết bị Âm thanh Mặc định. </p> <p> 1. Điều hướng đến Windows <strong> Bảng điều khiển </strong> và mở ra <strong> Âm thanh. </strong></p> <p><img src=\"images/image_thumb-14-686.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Hãy chắc chắn rằng <strong> Đầu ra kỹ thuật số </strong> (HDMI) là <strong> Mặc định </strong> thiết bị phát lại, nếu không, hãy chọn <strong> Đầu ra kỹ thuật số </strong> thiết bị và nhấp vào <strong> Đặt mặc định </strong> cái nút. Khi hoàn tất, hãy phát video để kiểm tra âm thanh HDMI và nếu sự cố vẫn tiếp diễn, hãy tiếp tục bước tiếp theo. * </p> <p><img src=\"images/image_thumb-43-106.png\" alt=\"FIX: HDMI No Sound Output \" loading=\"lazy\"></p> <p> </p> <p> * Lưu ý: Hãy thử những cách sau, tùy theo trường hợp của bạn: </p> <p> 1. Nếu <strong> Đầu ra kỹ thuật số </strong> thiết bị là <strong> tàn tật </strong> , nhấp chuột phải vào nó và nhấp vào <strong> Kích hoạt </strong> . Sau đó đánh dấu nó và nhấn <strong> Đặt mặc định </strong> . </p> <p><img src=\"images/image_thumb-44-233.png\" alt=\"FIX: HDMI Not Listed in Playback devices \" loading=\"lazy\"></p> <p> 2. Nếu thiết bị Đầu ra Kỹ thuật số không hiển thị dưới dạng thiết bị Phát lại: </p> <blockquote><p> a. Nhấp chuột phải vào một khoảng trống và đảm bảo rằng cả hai <strong> Hiển thị các thiết bị bị vô hiệu hóa </strong> và <strong> Hiển thị các thiết bị đã ngắt kết nối </strong> các tùy chọn được chọn (đã chọn). Nếu bất kỳ tùy chọn nào ở trên không được chọn, hãy nhấp vào nó để chọn nó. </p></blockquote> <p><img src=\"images/image_thumb-45-410.png\" alt=\"Enable HDMI DIgital Output\" loading=\"lazy\"></p> <blockquote><p> b. Sau đó nhấp chuột phải vào Thiết bị đầu ra kỹ thuật số và chọn <strong> Kích hoạt. <br> c. </strong> Khi hoàn tất, hãy đặt là <strong> mặc định </strong> các <strong> Đầu ra kỹ thuật số </strong> thiết bị. </p> </blockquote> <h3><br clear=\"all\"> Bước 2. Cuộn lại Trình điều khiển Card âm thanh. </h3> <p> Trong một số trường hợp, sự cố &quot;HDMI không có âm thanh với TV&quot;, có thể xuất hiện sau khi cập nhật trình điều khiển tự động. Vì vậy, hãy tiếp tục và khôi phục trình điều khiển âm thanh. </p> <p> 1. Mở <strong> Quản lý thiết bị </strong> . Để làm việc đó: </p> <blockquote><p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-781.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Trong hộp &quot;Mở&quot;, nhập: <strong> devmgmt.msc </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-5-389.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Mở rộng </strong> các <strong> Bộ điều khiển âm thanh, video và trò chơi. <br> 3. Nhấp chuột phải </strong> trên <strong> Thiết bị âm thanh độ nét cao </strong> và chọn <strong> Tính chất. </strong></p> <p><img src=\"images/image_thumb-17-970.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. Tại tab Driver, nhấp vào <strong> Quay lại trình điều khiển </strong> cái nút. <strong> * </strong></p> <p> * Lưu ý: Nếu nút Roll Back Driver không hoạt động, hãy tiếp tục bước tiếp theo. </p> <p><img src=\"images/image_thumb-18-921.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> 5. Chọn lý do cho việc khôi phục gói trình điều khiển và nhấp vào <strong> Đúng. </strong></p> <p><img src=\"images/image_thumb-19-748.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Khi hoàn tất việc khôi phục trình điều khiển, <strong> khởi động lại </strong> máy tính của bạn. <br> 5. Sau khi khởi động lại, hãy tiến hành và kiểm tra âm thanh từ HDMI. Nếu bạn vẫn không thể nghe thấy âm thanh trên TV, hãy tiếp tục bước tiếp theo. </p> <h3> Bước 3. Thay đổi Trình điều khiển Card âm thanh. </h3> <p> Sự vắng mặt của âm thanh thường là do trình điều khiển card âm thanh sai. Để khắc phục, sự cố này: </p> <p> 1. Mở <strong> Quản lý thiết bị. </strong><br> 2. <strong> Mở rộng </strong> các <strong> Bộ điều khiển âm thanh, video và trò chơi. <br> </strong> 3. <strong> Nhấp chuột phải </strong> tại <strong> âm thanh chất lượng cao Realtek </strong> thiết bị và chọn <strong> Cập nhật driver. <br> </strong></p> <p><img src=\"images/image_thumb-6-937.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Chọn <strong> Duyệt máy tính của tôi để tìm trình điều khiển. </strong></p> <p><img src=\"images/image_thumb-7-874.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Chọn <strong> Hãy để tôi chọn từ danh sách các trình điều khiển có sẵn trên máy tính của tôi </strong> . </p> <p><img src=\"images/image_thumb-8-498.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. Ở màn hình tiếp theo, hãy chọn <strong> Thiết bị âm thanh độ nét cao </strong> và bấm vào <strong> Kế tiếp. </strong></p> <p><img src=\"images/image_thumb-20-756.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/07/image-10.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 8. Khi hoàn tất cài đặt trình điều khiển, <strong> khởi động lại </strong> máy tính của bạn. <br> 9. Sau khi khởi động lại, hãy tiến hành và kiểm tra âm thanh từ loa của máy tính xách tay. </p> <h3> Bước 4. Gỡ cài đặt và cài đặt lại trình điều khiển Card âm thanh. </h3> <p> 1. Mở <strong> Quản lý thiết bị. </strong><br> 2. <strong> Mở rộng </strong> các <strong> Bộ điều khiển âm thanh, video và trò chơi. <br> </strong> 3. <strong> Nhấp chuột phải </strong> tại <strong> Âm thanh độ nét cao </strong> thiết bị và chọn <strong> Gỡ cài đặt thiết bị. </strong></p> <p><img src=\"images/image_thumb-21-678.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. Sau khi gỡ cài đặt, <strong> khởi động lại </strong> máy tính của bạn và để Windows tự động cài đặt trình điều khiển âm thanh. Nếu điều này không xảy ra, hãy điều hướng đến <strong> Cài đặt </strong> &gt; <strong> Cập nhật và bảo mật </strong> và buộc Windows phải <strong> Kiểm tra cập nhật. </strong></p> <p> </p> <h3> Bước 5. Gỡ cài đặt và cài đặt lại bộ điều hợp hiển thị. </h3> <p> 1. Mở <strong> Quản lý thiết bị. <br> </strong> 2. <strong> Mở rộng </strong> các <strong> Bộ điều hợp hiển thị. <br> </strong> 3. <strong> Nhấp chuột phải </strong> trên bộ điều hợp hiển thị đã cài đặt và chọn <strong> Gỡ cài đặt thiết bị. </strong></p> <p><img src=\"images/image_thumb-46-871.png\" alt=\"Uninstall Display Adapter\" loading=\"lazy\"></p> <p> 4. Sau khi gỡ cài đặt, <strong> khởi động lại </strong> máy tính của bạn và để Windows tự động cài đặt trình điều khiển màn hình. Nếu điều này không xảy ra, nếu bạn vẫn gặp sự cố, hãy điều hướng đến trang web hỗ trợ của nhà sản xuất máy tính xách tay của bạn và tải xuống trình điều khiển màn hình mới nhất theo kiểu máy tính xách tay của bạn. </p> <p> Đó là tất cả mọi người! Phương pháp nào hiệu quả với bạn? Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}