{"title":"Khắc phục: Kết nối Máy tính Từ xa Không thể Kết nối vì đã có một phiên bảng điều khiển đang diễn ra (Đã giải quyết).","content":"<p> Thông báo lỗi trên Kết nối Máy tính Từ xa &quot;Máy tính của bạn không thể kết nối với một phiên bảng điều khiển khác trên máy tính từ xa vì bạn đã có một phiên bảng điều khiển đang diễn ra&quot;, xuất hiện vì máy tính cục bộ và máy tính từ xa có cùng Địa chỉ IP. Sự cố thường xảy ra khi bạn cố gắng kết nối từ xa với một máy tính khác thông qua kết nối VPN và bạn đã &quot;nhận&quot; cùng một địa chỉ IP từ bộ định tuyến cục bộ của mình, làm máy tính từ xa. Để khắc phục sự cố, hãy làm theo hướng dẫn bên dưới. </p> <p> </p> <p><img src=\"images/image_thumb-7-243.png\" alt=\"Remote Desktop Connection Could Not Connect because already have a console session in progress\" loading=\"lazy\"></p> <h4> Cách khắc phục lỗi RDP: Máy tính từ xa không thể kết nối với phiên bảng điều khiển khác vì đã có phiên bảng điều khiển đang diễn ra. </h4> <p> Sự cố trong Kết nối Máy tính Từ xa &quot;Không thể Kết nối với một phiên bảng điều khiển khác vì bạn đã có một phiên bảng điều khiển đang diễn ra&quot; thường xảy ra khi máy tính cục bộ nhận ngẫu nhiên (từ máy chủ DHCP), cùng một địa chỉ IP với Địa chỉ IP của điều khiển từ xa máy tính mà bạn muốn kết nối thông qua RDP. </p> <p> Cách duy nhất để khắc phục sự cố trên là tắt Tự động Gán Địa chỉ IP từ Máy chủ DHCP, trong máy tính cục bộ và chỉ định Địa chỉ IP theo cách thủ công. Để làm việc đó: </p> <p> 1. <strong> Nhấp chuột phải </strong> trên <strong> Mạng lưới </strong> biểu tượng <img src=\"images/image_thumb-42-527.png\" alt=\"image\" loading=\"lazy\"> trong Thanh tác vụ và nhấp vào <strong> Mở Trung tâm Mạng và Chia sẻ. </strong> * </p> <p><img src=\"images/image_thumb-104-485.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> 2. Chọn <strong> Ethernet </strong> (hoặc Wi-Fi) ở bên trái, sau đó tại phần &#39;Cài đặt liên quan&#39;, hãy nhấp vào <strong> Thay đổi các tùy chọn bộ điều hợp </strong> . </p> <p><img src=\"images/image_thumb-43-117.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Nhấn đúp chuột </strong> tại Bộ điều hợp mạng đang hoạt động (Ethernet hoặc Wi-Fi) và nhấp vào <strong> Chi tiết </strong> . </p> <p><img src=\"images/image_thumb-8-177.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Ghi lại chi tiết Địa chỉ IP trên các trường sau và sau đó nhấp vào <strong> Đóng </strong> : </p> <ul> <li> Địa chỉ IPv4 </li> <li> Mặt nạ mạng con IPv4 </li> <li> Cổng mặc định IPv4 </li> <li> Máy chủ DNS IPv4 </li> </ul> <p><img src=\"images/image_thumb-9-793.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Bây giờ, hãy nhấp vào <strong> Tính chất </strong> . </p> <p><img src=\"images/image_thumb-10-628.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Chọn <strong> &#39;Giao thức Internet Phiên bản 4 (TCP / IPv4) </strong> &#39;và nhấp vào <strong> Tính chất </strong></p> <p><img src=\"images/image_thumb-106-954.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 7. Tại thuộc tính Giao thức Internet Phiên bản 4 (TCP / IPv4), hãy áp dụng các cài đặt sau: </p> <p> A. Chọn <strong> Sử dụng Địa chỉ IP sau: </strong></p> <blockquote><p> 1. Tại trường Địa chỉ IP, nhập a <strong> Địa chỉ IP khác với Địa chỉ IP bạn đã nhận thấy trước đây </strong> . (Chỉ thay đổi số cuối cùng thành giá trị cao hơn). <br> 2. Tại Subnet mask được đệ trình, hãy nhập Địa chỉ IP Subnet giống như địa chỉ mà bạn đã nhận thấy trước đó. <br> 3. Tại Cổng mặc định, hãy nhập Cổng mặc định giống như Cổng mà bạn đã thấy trước đó. </p></blockquote> <p> B. Chọn <strong> Sử dụng các địa chỉ máy chủ DNS sau </strong> : </p> <blockquote><p> 1. Tại Máy chủ DNS Ưu tiên, hãy nhập Địa chỉ DNS mà bạn đã thấy trước đó. </p></blockquote> <p> C. Khi hoàn tất, hãy nhấp vào <strong> đồng ý </strong> hai lần và <strong> Đóng </strong> để đóng các thuộc tính của Bộ điều hợp. </p> <blockquote> <p><img src=\"images/image_thumb-11-850.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 8. Bây giờ, hãy thử kết nối với máy tính Remote Desktop. Vấn đề cần được giải quyết. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}