{"title":"Khắc phục: Windows 10 đang chạy Cực kỳ chậm sau khi cài đặt v2004 hoặc Edge Chromιum (Đã giải quyết)","content":"<p> Nhiều người dùng đã báo cáo rằng PC của họ chạy cực kỳ chậm sau khi cài đặt bản cập nhật Windows 10 2004 hoặc sau khi cài đặt phiên bản mới dựa trên Chromium của trình duyệt Microsoft Edge. Nếu bạn đang gặp phải một trong những vấn đề được đề cập ở trên, hãy làm theo hướng dẫn trong bài viết này để giải quyết chúng. </p> <p> Chi tiết sự cố: Sau khi bạn nâng cấp Windows 10 lên phiên bản 2004 hoặc sau khi bạn cài đặt <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> cập nhật, tự động cài đặt trình duyệt Edge mới (phiên bản Chromium), Windows mất nhiều thời gian khi khởi động hoặc chạy rất chậm. </p> <h4> Cách khắc phục: Sự cố khởi động chậm và hiệu suất chậm trong Windows 10 2004. </h4> <h6> Phương pháp 1. Cài đặt các bản cập nhật Windows có sẵn và cập nhật trình điều khiển thiết bị. </h6> <p> Phương pháp đầu tiên để giải quyết vấn đề hiệu suất chậm trong Windows 10 là thực hiện các bước sau: </p> <ul> <li><strong> Bước 1. </strong> Tải xuống và cài đặt tất cả các Bản cập nhật Windows có sẵn. </li> <li><strong> Bước 2. </strong> Tải xuống và cài đặt trình điều khiển Windows 10 mới nhất cho Bộ điều hợp hiển thị. </li> <li><strong> Bước 3. </strong> Nếu bạn đang sử dụng chương trình chống vi-rút của bên thứ ba, hãy gỡ cài đặt chương trình đó và kiểm tra xem sự cố hiệu suất chậm vẫn còn. Nếu không, hãy cài đặt phiên bản mới nhất của chương trình AV. </li> </ul> <p> </p> <h6> Phương pháp 2. Gỡ cài đặt phiên bản Microsoft Edge Chromium. </h6> <p> Phương pháp thứ hai để khắc phục sự cố hiệu suất chậm trong Windows 10 là gỡ cài đặt phiên bản Microsoft Edge Chromium (nếu nó đã được cài đặt). </p> <h5> Bước 1. Kiểm tra xem phiên bản Microsoft Edge dựa trên Chromium đã được cài đặt chưa. </h5> <p> 1. Từ menu Bắt đầu <img src=\"images/image_thumb2_thumb_thumb-381.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> nhấp chuột <strong> Cài đặt </strong><img src=\"images/image_thumb-66-515.png\" alt=\"image\" loading=\"lazy\"> và bấm vào <strong> Ứng dụng. <br> </strong> 2. Nếu <strong> Ứng dụng &amp; Tính năng </strong> xác định vị trí ứng dụng Microsoft Edge và theo biểu tượng của nó, hãy tiến hành như sau: </p> <ul> <li> Nếu bạn thấy hình ảnh biểu tượng này <img src=\"images/image_thumb-32-976.png\" alt=\"image\" loading=\"lazy\"> , điều đó có nghĩa là phiên bản Microsoft Edge mới dựa trên Chromium đã được cài đặt trên máy tính của bạn. Trong trường hợp này, hãy chuyển đến <strong> <a href=\"#step-2\" target=\"_blank\" rel=\"nofollow noopener\"> bước 2 </a></strong> để gỡ cài đặt Edge Chromium khỏi PC của bạn. </li> <li> Nếu bạn thấy hình ảnh biểu tượng này <img src=\"images/image_thumb-33-372.png\" alt=\"image\" loading=\"lazy\"> , có nghĩa là phiên bản dựa trên Chromium mới chưa được cài đặt trên máy tính của bạn. Trong trường hợp này, hãy chuyển đến <a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"><strong> phương pháp-3 </strong></a> . </li> </ul> <p><img src=\"images/image_thumb-71-268.png\" alt=\"FIX: Windows 10 Running Extremely Slow after 2004 Update\" loading=\"lazy\"></p> <p> </p> <h5> Bước 2. Xóa Edge Chromium khỏi PC. </h5> <p> Để gỡ cài đặt Edge dựa trên Chromium mới trong Windows 10: </p> <p> 1. Điều hướng đến thư mục sau trên PC của bạn: * </p> <ul> <li> C: \\ Program Files (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </li> </ul> <p> * Lưu ý: Tên thư mục &quot;85.0.564.41&quot; cho biết phiên bản đã cài đặt của phiên bản Chromium mới và có thể khác ở PC của bạn. </p> <p> 2. Chọn đường dẫn thư mục trong thanh địa chỉ và nhấp chuột phải vào&gt; <strong> Sao chép. </strong></p> <p><img src=\"images/image_thumb-35-379.png\" alt=\"Uninstall Edge Chromiun\" loading=\"lazy\"></p> <p> </p> <p> 3. Mở <strong> Command Prompt với tư cách là quản trị viên, </strong> kiểu <strong> CD </strong> và sau đó nhấn <strong> CTRL + V </strong> để dán vào đường dẫn thư mục đã sao chép. Khi hoàn tất, nhấn <strong> Đi vào </strong> . * </p> <p> * ví dụ: Ở ví dụ hiện tại, lệnh sẽ là: </p> <p><em> cd C: \\ Program Files (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </em></p> <p><img src=\"images/image_thumb-36-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Bây giờ, đưa lệnh dưới đây (Sao chép / Dán) trong dấu nhắc lệnh để xóa phiên bản Chromium của trình duyệt Microsoft Edge khỏi PC của bạn. </p> <ul> <li> setup.exe –uninstall –system-level –verbose-logging –force-uninstall </li> </ul> <p><img src=\"images/image_thumb-37-229.png\" alt=\"Remove Edge Chromiun\" loading=\"lazy\"></p> <p> 5. Sau khi lệnh trên được thực thi, phiên bản EDGE cũ sẽ được kích hoạt trở lại. Khởi động lại PC của bạn để áp dụng các thay đổi. <br> 6. Sau khi khởi động lại, hãy tiến hành cài đặt thủ công <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> trình duyệt Edge dựa trên Chromium mới </a> trên PC của bạn, để tránh cài đặt lại bản cập nhật KB4559309 có vấn đề. </p> <p> </p> <h6> Phương pháp 3. Khôi phục Windows 10 về phiên bản trước của nó. </h6> <p> 1. Từ <strong> Khởi đầu </strong> thực đơn <img src=\"images/image_thumb2_thumb_thumb-872.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> mở <strong> Cài đặt </strong> <img src=\"images/image_thumb-66-969.png\" alt=\"image\" loading=\"lazy\"> và sau đó nhấp vào <strong> Cập nhật &amp; Bảo mật. </strong></p> <p> 2. Chọn <strong> Hồi phục </strong> ở bên trái và sau đó, trong phần &#39;Quay lại phiên bản trước của Windows 10&#39;, hãy nhấp vào <strong> Bắt đầu </strong> cái nút. </p> <p><img src=\"images/image_thumb-4-708.png\" alt=\"Restore Windows to earlier version\" loading=\"lazy\"></p> <p> 3. Làm theo lời nhắc trên màn hình để khôi phục Windows 10 về phiên bản trước. <br> 4. Sau khi bạn quay lại phiên bản Windows 10 trước đó, máy tính của bạn sẽ chạy bình thường trở lại và không bị chậm trễ. </p> <p> </p> <h6> Phương pháp 4. Sửa chữa Windows 10. </h6> <p> Phương pháp tiếp theo để giải quyết vấn đề hiệu suất chậm trong Windows 10, là sửa chữa Windows bằng cách sử dụng lệnh SFC và DISM: </p> <p> 1. Mở <strong> Command Prompt với tư cách là quản trị viên </strong> . <br> 2. Trong dấu nhắc lệnh, hãy đưa ra lệnh xuống dưới đây và nhấn <strong> Đi vào: </strong></p> <ul> <li><strong> DISM.exe / Trực tuyến / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-175.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> </p> <p> 3. Khi thao tác DISM hoàn tất, hãy nhập lệnh sau và nhấn <strong> Đi vào </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb31-316.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Bây giờ hãy đợi cho đến khi Trình kiểm tra Tệp Hệ thống sửa chữa Tệp Hệ thống Windows. <br> 5. Khi điều này hoàn thành, <strong> khởi động lại </strong> máy tính của bạn và xem sự cố đã được giải quyết chưa. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}