{"title":"Khắc phục: Vấn đề sử dụng bộ nhớ cao của Chrome (Đã giải quyết)","content":"<p> Như bạn có thể đã nhận thấy, Google Chrome mở nhiều quy trình nền, ngay cả khi bạn chỉ mở một vài cửa sổ / tab Chrome. Điều này xảy ra vì Google Chrome được thiết kế theo cách để tạo một quy trình riêng lẻ cho mọi plugin hoặc tiện ích mở rộng được cài đặt khi bạn mở một cửa sổ hoặc tab mới. </p> <p> Mặc dù việc mở nhiều tiến trình từ Google Chrome là một hành vi bình thường, nhưng nó thực sự là một vấn đề, bởi vì, hành vi này gây ra sử dụng nhiều bộ nhớ và khiến máy tính không phản hồi. </p> <p><img src=\"images/image_thumb-17-610.png\" alt=\"FIX: Multiple Processes in Chrome with High Memory Usage\" loading=\"lazy\"></p> <p> </p> <p> Hướng dẫn này bao gồm hướng dẫn từng bước về cách ngăn Chrome mở nhiều quy trình cho mọi cửa sổ hoặc tab, để giải quyết vấn đề sử dụng bộ nhớ cao của Chrome. </p> <h4> Cách tắt nhiều quy trình của Chrome trong Windows 10. </h4> <h6> Bước 1. Quét máy tính của bạn để tìm Phần mềm độc hại và Vi rút. </h6> <p> Bước đầu tiên trước khi khắc phục lỗi &quot;ERR_CONNECTION_CLOSED&quot; trong Chrome, là đảm bảo rằng hệ thống của bạn không có vi rút / phần mềm độc hại. Đối với nhiệm vụ đó, hãy làm theo hướng dẫn trong hướng dẫn này: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách quét vi rút và các chương trình độc hại khác trên máy tính của bạn. </a></p> <h6></h6> <h6> Bước 2. Tắt các Tiện ích mở rộng không mong muốn của Chrome. </h6> <p> Trước hết, hãy kiểm tra xem bạn có cần tất cả các tiện ích mở rộng Chrome đã cài đặt hay không và tắt những tiện ích mở rộng bạn không cần. Để làm việc đó: </p> <p> 1. Từ menu của Chrome <img src=\"images/image_thumb-47-380.png\" alt=\"image\" loading=\"lazy\"> , đi đến <strong> Thêm công cụ </strong> -&gt; <strong> Tiện ích mở rộng </strong></p> <p><img src=\"images/image_thumb-51-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Xóa (hoặc vô hiệu hóa) bất kỳ tiện ích mở rộng nào mà bạn không cần hoặc bạn không nhận ra. </p> <p><img src=\"images/image_thumb-49-442.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Bước 3. Ngăn Chrome chạy trong nền khi Chrome bị đóng. </h6> <p> 1. Từ menu Chrome <img src=\"images/image_thumb-78-665.png\" alt=\"image\" loading=\"lazy\"> lựa chọn <strong> Cài đặt </strong> . </p> <p><img src=\"images/image_thumb-79-868.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> 2. Tại <strong> Cài đặt </strong> trang, cuộn xuống và nhấp vào <strong> Nâng cao </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <p> 3. Đặt nút chuyển &quot;Tiếp tục chạy ứng dụng nền khi Google Chrome bị đóng&quot; thành <strong> TẮT </strong> . </p> <p><img src=\"images/image_thumb-18-557.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <p> </p> <h6> Bước 4. Ngăn Chrome mở nhiều quy trình cho cùng một trang web. </h6> <p> 1, <strong> Nhấp chuột phải </strong> trên <strong> Google Chrome </strong> phím tắt và chọn <strong> Tính chất </strong> . <br> 2. Tại <strong> Chung </strong> , thêm nút chuyển &quot;–process-per-site&quot; (không có dấu ngoặc kép), ở cuối dòng mục tiêu và nhấp vào <strong> đồng ý </strong> và <strong> Tiếp tục </strong> để áp dụng thay đổi <strong> . * </strong></p> <p> ví dụ. &quot;C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; –process-per-site </p> <p> Lưu ý: Có một khoảng trắng trước –process-per-site </p> <p><img src=\"images/image_thumb-19-818.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Bước 5. Tắt tính năng Cách ly Trang web của Google Chrome. </h6> <p> Ở chế độ Cách ly Trang web, Chrome sẽ tải từng trang web trong quy trình riêng của nó. Trên thực tế, đây là một tính năng bảo mật bổ sung để ngăn một trang web lấy cắp dữ liệu của bạn từ một trang web khác đang mở đến một cửa sổ / tab khác. Tuy nhiên, chế độ &quot;Cách ly trang web&quot; sẽ tăng mức sử dụng bộ nhớ của Chrome lên khoảng 10%. </p> <p> 1. Trên thanh địa chỉ Chrome, nhập <a href=\"//flags/#site-isolation-trial-opt-out\" target=\"_blank\" rel=\"nofollow noopener\"> chrome: // flags / # site-isol-trial-opt-out </a> và bấm enter. </p> <p> 2. Đặt <strong> Tắt tính năng cô lập trang web </strong> chế độ để <strong> Tàn tật </strong> và sau đó nhấp vào <strong> Khởi chạy lại ngay bây giờ </strong> . * </p> <p> * Ghi chú: </p> <p><img src=\"images/image_thumb-20-397.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? </p> <p> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}