{"title":"Khắc phục: Không thể cài đặt Công cụ soát lỗi Office 2016 (Đã giải quyết)","content":"<p> Nếu bạn không thể cài đặt Công cụ soát lỗi Office 2016 với lỗi &quot;Rất tiếc! Cần có phiên bản Microsoft Office tương thích trước khi bạn có thể cài đặt các công cụ soát lỗi bổ sung.&quot;, Thì hãy tiếp tục đọc bên dưới để giải quyết sự cố. </p> <p> </p> <p><img src=\"images/image_thumb-23-190.png\" alt=\"Couldn't Install Office 2016 Proofing Tools - Oops! A compatible version of Microsoft Office is required \" loading=\"lazy\"></p> <p> </p> <p> Lỗi cài đặt Microsoft Office Proofing Tools 2016 &quot;Cần có phiên bản Microsoft Office tương thích trước khi bạn có thể cài đặt công cụ soát lỗi bổ sung&quot;, thường xuất hiện nếu bạn cố gắng cài đặt phiên bản không tương thích của công cụ soát lỗi cho phiên bản và kiến ​​trúc Office đã cài đặt hoặc nếu bạn đã cài đặt phiên bản 32-bit của Office 2016 trên hệ điều hành Windows 64-bit. </p> <h4> Cách khắc phục: Không thể cài đặt Công cụ soát lỗi trong Office 2016 hoặc Office 2019. </h4> <p> </p> <h6> Phương pháp 1. Tải xuống các công cụ Soát lỗi chính xác. </h6> <p> Trước hết, hãy đảm bảo rằng bạn đã tải xuống đúng tệp trình cài đặt công cụ soát lỗi, theo phiên bản và kiến ​​trúc Office đã cài đặt (32 hoặc 64bit). Để làm việc đó: </p> <p> 1. Mở bất kỳ ứng dụng Office nào (ví dụ: Word). <br> 2. Từ <strong> Tập tin </strong> nhấp chuột vào menu <strong> Tài khoản </strong> (hoặc là <strong> Cứu giúp </strong> ). <br> 3. Bây giờ hãy nhấp vào <strong> Giới thiệu về Word </strong> ở ngăn bên phải. <br> 4. Lưu ý phiên bản Office đã cài đặt (ví dụ: &quot;2016&quot;) và kiến ​​trúc (ví dụ: &quot;64-bit&quot;). </p> <p><img src=\"images/image_thumb-24-106.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Bây giờ theo phiên bản Office: </p> <ul> <li> Đối với <strong> Office 2016 </strong> tải xuống các công cụ soát lỗi từ đây: <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=52668\" target=\"_blank\" rel=\"nofollow noopener\"> Công cụ soát lỗi Office 2016 </a> . </li> <li> Đối với <strong> Văn phòng 2019 </strong> tải xuống các công cụ soát lỗi từ đây: <a href=\"https://support.office.com/en-us/article/language-accessory-pack-for-office-82ee1236-0f9a-45ee-9c72-05b026ee809f?ui=en-US&rs=en-US&ad=US\" target=\"_blank\" rel=\"nofollow noopener\"> Công cụ soát lỗi Office 2019 </a></li> </ul> <p> 6. Sau đó, chọn ngôn ngữ mong muốn cho các công cụ soát lỗi. <br> 7. Cuối cùng, theo kiến ​​trúc Office (32 hoặc 64 bit): </p> <ul> <li> Đối với Office 32 bit, hãy tải xuống tệp trình cài đặt x86. (ví dụ: &quot;proofingtools2016_en-us-x86.exe) </li> <li> Đối với Office 64 bit, hãy tải xuống tệp trình cài đặt x64. (ví dụ: &quot;proofingtools2016_en-us-x64.exe) </li> </ul> <p> 8. Nhấp đúp vào tệp .exe đã tải xuống để cài đặt các công cụ soát lỗi. </p> <p> </p> <h6> Phương pháp 2. Sửa chữa Cài đặt Office. </h6> <p> 1. Điều hướng đến <strong> Chương trình và </strong><strong> Đặc trưng. </strong> Để làm việc đó: </p> <blockquote><p> 1. Nhấn đồng thời Windows <img src=\"images/image_thumb36-318.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại: <strong> appwiz.cpl </strong> và bấm vào <strong> đồng ý </strong> . </p></blockquote> <p><img src=\"images/image_thumb-24-189.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Trong Chương trình và Tính năng, hãy chọn sản phẩm Microsoft Office được cài đặt trên hệ thống của bạn và nhấp vào <strong> Thay đổi </strong> . </p> <p><img src=\"images/image_thumb-2-328.png\" alt=\"repair office 2016 and office 2019\" loading=\"lazy\"></p> <p> </p> <p> 3. Cuối cùng bấm <strong> Sửa </strong> và làm theo các bước còn lại để sửa chữa Microsoft Office. * </p> <p> * Thông báo: Nếu sau khi nhấp vào Sửa chữa, bạn nhận được &quot; <strong> Bạn muốn sửa chữa các Chương trình Office của mình như thế nào </strong> &quot;, hãy chọn <strong> Sửa chữa nhanh </strong> tùy chọn kiểm tra và thay thế các tệp bị thiếu hoặc bị hỏng. Nếu sau khi &quot;Sửa chữa nhanh&quot;, sự cố vẫn chưa được khắc phục, hãy chọn <strong> Sửa chữa trực tuyến </strong> để cài đặt lại sản phẩm Office của bạn. (yêu cầu kết nối Internet). </p> <p><img src=\"images/image_thumb-26-143.png\" alt=\"Repair Office\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Khi quá trình sửa chữa hoàn tất, hãy khởi động lại PC của bạn. <br> 5. Cài đặt các công cụ soát lỗi. </p> <p> </p> <h6> Phương pháp 3. Gỡ cài đặt và cài đặt lại Office 2016 64-bit. </h6> <p> Phương pháp tiếp theo để giải quyết các sự cố cài đặt công cụ soát lỗi Office là gỡ bỏ và cài đặt lại Office 2016 trên hệ thống của bạn. Để làm việc đó: </p> <h2> Bước 1. Gỡ cài đặt Office khỏi hệ thống của bạn. </h2> <p> 1. Tải xuống <a href=\"http://go.microsoft.com/?linkid=9815935\" target=\"_blank\" rel=\"nofollow noopener\"> Gỡ cài đặt Microsoft Office Fix </a> công cụ để tự động gỡ cài đặt Office 365, Office 2016 hoặc Office 2013. <br> 2. Chạy &quot;Gỡ cài đặt Microsoft Office Fix&quot; và nhấn <strong> Kế tiếp </strong> ở màn hình đầu tiên. </p> <p><img src=\"images/image_thumb-19-681.png\" alt=\"office uninstall tool\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Thực hiện quy trình giải quyết sự cố với Office Uninstall và gỡ bỏ phần mềm Office khỏi máy tính của bạn. </p> <p><img src=\"images/image_thumb-20-361.png\" alt=\"cannot uninstall office\" loading=\"lazy\"></p> <p> </p> <h2> Bước 2. Tải xuống và cài đặt Office 2016. </h2> <p> 1. Điều hướng đến <a href=\"https://www.heidoc.net/joomla/technology-science/microsoft/67-microsoft-windows-iso-download-tool\" target=\"_blank\" rel=\"nofollow noopener\"> HeiDoc.net </a> và tải xuống <strong><a href=\"https://www.heidoc.net/php/Windows-ISO-Downloader.exe\" target=\"_blank\" rel=\"nofollow noopener\"> Công cụ tải xuống Windows ISO </a></strong> . <br> 2. Nhấp đúp để chạy tệp đã tải xuống &quot;Windows-ISO-Downloader.exe&quot;. <br> 3. Tại Windows ISO downloader tool: </p> <blockquote><p> a. Chọn <strong> Văn phòng </strong> ở ngăn bên phải. <br> b. <strong> Lựa chọn </strong> các <strong> Phiên bản Office </strong> mà bạn muốn tải xuống. (ví dụ: &quot;Office 2016&quot;). <br> c. Sau đó, ở bên trái, chọn <strong> Phiên bản </strong> của Office và mong muốn <strong> ngôn ngữ </strong> phía dưới. <br> d. Khi hoàn tất, hãy nhấp vào <strong> Tải xuống </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-595.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Khi quá trình tải xuống hoàn tất, hãy nhấp đúp vào tệp hình ảnh đã tải xuống (ProPlusRetail.img), để gắn nó vào Explorer. <br> 5. Khám phá nội dung của ảnh (ổ đĩa) được gắn kết và mở thư mục &quot;Office&quot;. <br> 6. Nhấp đúp vào &quot;setup32.exe&quot; để cài đặt phiên bản Office 32-bit hoặc &quot;setup64.exe&quot; để cài đặt phiên bản Office 64-bit. * </p> <p> * Lưu ý: Tôi đề nghị, nếu bạn có phiên bản Windows 64 bit, hãy cài đặt phiên bản Office 64 bit (setup64.exe). </p> <p><img src=\"images/image_thumb-25-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Khi quá trình cài đặt hoàn tất, hãy sử dụng khóa cấp phép của bạn để kích hoạt Office. <br> 8. Làm theo hướng dẫn tại phương pháp-1 ở trên để cài đặt Công cụ soát lỗi. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}