{"title":"Khắc phục: Không phát hiện micrô hoặc không hoạt động trong Windows 10 (Đã giải quyết)","content":"<p> Hướng dẫn này chứa các hướng dẫn để khắc phục sự cố &quot;micrô không được phát hiện&quot; hoặc &quot;micrô không hoạt động&quot;, trong Windows 10. Nếu bạn đang gặp sự cố với micrô của mình trong Windows 10, thì điều này có thể do một số lý do. Sự cố &quot;micrô không hoạt động&quot; là một vấn đề đối với nhiều người dùng Windows 10 và thường xuất hiện sau khi cập nhật Windows. </p> <p> Hướng dẫn này bao gồm một số giải pháp để giải quyết các sự cố micrô trong Windows 10. </p> <h4> Cách khắc phục: Micrô Windows 10 không hoạt động hoặc không được phát hiện. * </h4> <p> * Lưu ý: Nếu bạn gặp sự cố với micrô của mình, trong một ứng dụng cụ thể, hãy thử các cách sau: </p> <blockquote><p> 1. Đảm bảo rằng ứng dụng cụ thể được phép sử dụng micrô bằng cách sử dụng các hướng dẫn trong phương pháp-1 bên dưới. <br> 2. Đảm bảo rằng micrô được chọn làm thiết bị đầu vào mặc định trong cài đặt ứng dụng. (ví dụ: trong Skype, hãy truy cập <strong> Cài đặt </strong> và đảm bảo rằng micrô hoặc tai nghe của bạn được chọn). <br> 3. Đóng bất kỳ ứng dụng nào khác có thể sử dụng micrô của bạn. <br> 4. Khởi động lại PC của bạn và kiểm tra lại MIC của bạn. </p></blockquote> <h6> Giải pháp 1. Cho phép các ứng dụng truy cập vào micrô của bạn. </h6> <p> Phương pháp đầu tiên để giải quyết vấn đề với micrô của bạn trong Windows 10 là đảm bảo rằng tất cả các ứng dụng đều có quyền truy cập vào micrô của bạn. Để làm việc đó: </p> <p> 1.. Từ menu Bắt đầu <img src=\"images/image_thumb2_thumb_thumb-856.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> nhấp chuột <strong> Cài đặt </strong><img src=\"images/image_thumb-66-804.png\" alt=\"image\" loading=\"lazy\"> và sau đó mở <strong> Riêng tư </strong> . <br> 2. Chọn <strong> Cái mic cờ rô </strong> trên ngăn bên trái và sau đó <strong> Bật </strong> các <strong> Cho phép các ứng dụng truy cập micrô của bạn. </strong></p> <p><img src=\"images/image_thumb-34-268.png\" alt=\"How to FIX: Windows 10 Microphone Not Detected or Not Working\" loading=\"lazy\"></p> <p> 3. Sau đó, cuộn xuống và đảm bảo rằng Ứng dụng bạn muốn sử dụng Micrô của mình có thể truy cập vào ứng dụng đó. * </p> <p> * Đề xuất: Vì sự riêng tư của bạn, hãy tắt quyền truy cập micrô vào bất kỳ ứng dụng nào bạn không muốn micrô của mình sử dụng. </p> <p><img src=\"images/image_thumb-35-517.png\" alt=\" FIX Windows 10 Microphone Not Working\" loading=\"lazy\"></p> <p> 4. Khi hoàn tất, hãy kiểm tra Micrô của bạn. </p> <h6> Giải pháp 2. Kiểm tra xem Micrô của bạn có phải là Thiết bị đầu vào mặc định (Thiết bị ghi âm) hay không. </h6> <p> 1.. Từ menu Bắt đầu <img src=\"images/image_thumb2_thumb_thumb-930.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> nhấp chuột <strong> Cài đặt </strong><img src=\"images/image_thumb-66-142.png\" alt=\"image\" loading=\"lazy\"> và sau đó mở <strong> Hệ thống </strong> . <br> 2. Nhấp vào <strong> Âm thanh </strong> trên ngăn bên trái, sau đó nói để kiểm tra micrô của bạn. Nếu micrô của bạn đang hoạt động, bạn sẽ thấy thanh trượt di chuyển bên dưới. Nếu không, hãy nhấp vào <strong> Quản lý thiết bị âm thanh. </strong></p> <p><img src=\"images/image_thumb-36-254.png\" alt=\"Test Microphone Windows 10\" loading=\"lazy\"></p> <p> 3. Tại tùy chọn &#39;Quản lý thiết bị âm thanh, đảm bảo rằng Micrô của bạn được liệt kê trong&#39; Thiết bị đầu vào &#39;làm thiết bị đầu vào mặc định và <strong> Đã bật </strong> . Nếu không, hãy nhấp vào Micrô của bạn và nhấp vào <strong> Kích hoạt. </strong></p> <p><img src=\"images/image_thumb-37-753.png\" alt=\"Enable Microphone Windows 10\" loading=\"lazy\"></p> <h6> Giải pháp 3. Kiểm tra Cài đặt micrô trong Bảng điều khiển. </h6> <p> 1. Điều hướng đến Windows <strong> Bảng điều khiển </strong> và mở ra <strong> Âm thanh. </strong></p> <p><img src=\"images/image_thumb-14-511.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Tại <strong> ghi âm </strong> , chọn Micrô của bạn và nhấp vào <strong> Tính chất. </strong></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"Microphone Properties\" loading=\"lazy\"></p> <p> 3. Tại <strong> Cấp độ </strong> chuyển hướng, <strong> kéo </strong> thanh trượt đến <strong> đúng </strong> , để tăng âm lượng micrô và đảm bảo rằng micrô của bạn được bật tiếng (Trong trường hợp micrô của bạn bị tắt tiếng, biểu tượng âm lượng của micrô <img src=\"images/image_thumb-39-434.png\" alt=\"image\" loading=\"lazy\"> , sẽ được hiển thị với một biểu tượng màu đỏ <img src=\"images/image_thumb-40-819.png\" alt=\"image\" loading=\"lazy\"> ). Khi hoàn thành bấm <strong> đồng ý </strong> và <strong> đồng ý </strong> để đóng Thuộc tính âm thanh. </p> <p><img src=\"images/image_thumb-41-896.png\" alt=\"Microphone Levels\" loading=\"lazy\"></p> <h6> Giải pháp 4. Thay đổi Trình điều khiển Card âm thanh. </h6> <p> Phương pháp cuối cùng để giải quyết vấn đề micrô trong Windows 10 là thay đổi Trình điều khiển âm thanh, đặc biệt nếu thiết bị Âm thanh Realtek của riêng bạn. Để làm việc đó: </p> <p> 1. Mở <strong> Quản lý thiết bị </strong> . Để làm việc đó: </p> <blockquote><p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-918.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Trong hộp &quot;Mở&quot;, nhập: <strong> devmgmt.msc </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-5-732.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Mở rộng </strong> các <strong> Bộ điều khiển âm thanh, video và trò chơi. </strong></p> <p> 3. <strong> Nhấp chuột phải </strong> trên <strong> âm thanh chất lượng cao Realtek </strong> thiết bị và chọn <strong> Cập nhật driver. <br> </strong></p> <p><img src=\"images/image_thumb-6-629.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Chọn <strong> Duyệt máy tính của tôi để tìm trình điều khiển. </strong></p> <p><img src=\"images/image_thumb-7-637.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Chọn <strong> Hãy để tôi chọn từ danh sách các trình điều khiển có sẵn trên máy tính của tôi </strong> . </p> <p><img src=\"images/image_thumb-8-118.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> 6. Ở màn hình tiếp theo, hãy chọn <strong> Thiết bị âm thanh độ nét cao </strong> và bấm vào <strong> Kế tiếp. </strong></p> <p><img src=\"images/image_thumb-20-989.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p> 8. Trên cửa sổ &#39;Cảnh báo Trình điều khiển Cập nhật&#39;, nhấp vào &quot;Có&quot; để cài đặt trình điều khiển mới. <br> 9. Khi quá trình cài đặt trình điều khiển hoàn tất, <strong> khởi động lại </strong> máy tính của bạn. <br> 10. Sau khi khởi động lại, hãy tiến hành và kiểm tra micrô của bạn. </p> <h6></h6> <h6> Giải pháp 5. Gỡ cài đặt và cài đặt lại Trình điều khiển Card âm thanh. </h6> <p> Giải pháp cuối cùng để khắc phục sự cố micrô không hoạt động trong Windows 10 là gỡ cài đặt hoàn toàn và cài đặt lại trình điều khiển của Card âm thanh. </p> <p> 1. Điều hướng đến <strong> Bảng điều khiển </strong> &gt; <strong> Chương trình và những tính năng </strong> và <strong> gỡ cài đặt </strong> bất kỳ phần mềm nào liên quan đến Card âm thanh của bạn. <br> 2. Mở <strong> Quản lý thiết bị </strong> và <strong> mở rộng </strong> các <strong> Bộ điều khiển âm thanh, video và trò chơi. <br> </strong> 3. <strong> Nhấp chuột phải </strong> trên cài đặt <strong> Thiết bị âm thanh </strong> và bấm vào <strong> Gỡ cài đặt thiết bị. </strong></p> <p><img src=\"images/image_thumb-42-701.png\" alt=\"Uninstall Sound Card Device\" loading=\"lazy\"></p> <p> </p> <p> 4. Khi hoàn tất, hãy điều hướng đến trang web hỗ trợ của nhà sản xuất máy tính hoặc máy tính xách tay của bạn và tải xuống và cài đặt trình điều khiển mới nhất cho card âm thanh của bạn. <br> 5. Sau khi cài đặt, <strong> khởi động lại </strong> máy tính của bạn và kiểm tra xem micrô của bạn có hoạt động không. </p> <p><strong> Trợ giúp bổ sung: </strong> Nếu sau khi áp dụng các giải pháp trên mà mic của bạn vẫn không hoạt động thì rất có thể mic của bạn đã bị hư. Để đảm bảo, nếu bạn sở hữu máy tính xách tay, hãy cắm micrô bên ngoài hoặc sử dụng micrô khác nếu bạn sở hữu máy tính để bàn. </p> <p> Đó là tất cả mọi người! Phương pháp nào hiệu quả với bạn? Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}