{"title":"Khắc phục: BSPlayer Không có âm thanh trong phim và video (đã giải quyết)","content":"<p> Gần đây, tôi đã gặp phải sự cố sau khi phát phim bằng BSPlayer: trong khi video đang phát, không có âm thanh. Đồng thời, phim và âm thanh, phát hoàn hảo trong bất kỳ trình phát nào khác. (ví dụ: VLC, Windows Media Player, v.v.). Vấn đề &quot;không có âm thanh&quot; trong BSPlayer, xuất hiện đột ngột, bởi vì, trước đây, trình phát BS hoạt động tốt. </p> <p><img src=\"images/image_thumb-70-953.png\" alt=\"FIX: BSPlayer No Sound in Movies - Videos\" loading=\"lazy\"></p> <p> Nếu bạn gặp sự cố &quot;không có âm thanh&quot; khi phát tệp video trong BS Player, hãy làm theo các bước bên dưới để khắc phục sự cố. </p> <h4> Cách khắc phục: Không có đầu ra âm thanh trong BS.Player khi phát video và phim. </h4> <p> Để giải quyết &quot;không có đầu ra âm thanh&quot; trong BSPlayer, hãy gỡ cài đặt hoàn toàn và cài đặt lại BS-Player bằng cách làm theo hướng dẫn bên dưới. </p> <h5> Bước 1. Gỡ cài đặt BSPlayer. </h5> <p> 1. Điều hướng đến Bảng điều khiển Windows và mở <strong> Chương trình và các tính năng </strong> . <br> 2. Chọn <strong> Người chơi bs </strong> từ danh sách và nhấp vào <strong> Gỡ cài đặt </strong> . </p> <p><img src=\"images/image_thumb-65-608.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> Bước 2. Loại bỏ thức ăn thừa của BSPlayer. </h5> <p> 1. Điều hướng đến: <strong> C: \\ Users \\% Username% \\ AppData \\ Roaming </strong> thư mục. Để làm việc đó: </p> <blockquote><p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-846.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Trong hộp Tìm kiếm, nhập: <strong> %dữ liệu chương trình% </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p></blockquote> <p><img src=\"images/image_thumb-66-304.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Xóa các thư mục sau (nếu chúng tồn tại): </p> <ul> <li><strong> Người chơi bs </strong></li> <li><strong> BSplayer Pro </strong></li> </ul> <p><img src=\"images/image_thumb-67-329.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Sau đó điều hướng đến <strong> C: \\ Program Files (x86) \\ Webteh </strong> và cũng xóa <strong> Người chơi bs </strong> thư mục. </p> <p><img src=\"images/image_thumb-68-415.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> Bước 3. Cài đặt BS.Player. </h5> <p> 1. Tải xuống và cài đặt phiên bản mới nhất của <strong><a href=\"http://www.bsplayer.com/bsplayer-english/download-free.html/\" target=\"_blank\" rel=\"nofollow noopener\"> Người chơi bs </a> . <br> </strong> 2. Sau khi cài đặt, hãy mở một tệp video và kiểm tra xem âm thanh có hoạt động hay không. Nếu bạn vẫn không nghe thấy âm thanh, hãy chuyển sang bước tiếp theo. </p> <p> </p> <h5> Bước 4. Tải xuống Codec phương tiện bị thiếu. </h5> <p> 1. Tải xuống và cài đặt <a href=\"https://www.codecguide.com/download_k-lite_codec_pack_standard.htm\" target=\"_blank\" rel=\"nofollow noopener\"> K-Lite Codec Pack (Chuẩn). </a></p> <p> 2. Sau khi cài đặt, hãy kiểm tra âm thanh trong BS.Player. Nếu bạn vẫn không có âm thanh thì: </p> <ul> <li><strong> Nhấp chuột phải </strong> trên video / phim và chọn <strong> Mở với </strong> -&gt; <strong> MPC-HC </strong> (Phương tiện truyền thông máy nghe nhạc cổ điển) </li> </ul> <p> * Lưu ý: Media Player Classic (MPC) là một trình phát đa phương tiện mã nguồn mở cực kỳ nhẹ dành cho Windows và nó hỗ trợ tất cả các định dạng tệp video và âm thanh phổ biến. </p> <p><img src=\"images/image_thumb-69-626.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}