{"title":"Khắc phục: 2147219196 Lỗi hệ thống tệp trong ứng dụng Ảnh trong Windows 10 (Đã giải quyết)","content":"<p> Trên máy tính chạy Windows 10 có ứng dụng &#39;Ảnh&#39; làm ứng dụng mặc định để mở ảnh, sẽ xuất hiện &quot;Lỗi hệ thống tệp&quot; -2147219196 &quot;khi người dùng cố gắng mở ảnh .JPG hoặc .PNG (với &#39;ẢNH&#39; ứng dụng). </p> <p><img src=\"images/image_thumb-73-456.png\" alt=\"FIX: 2147219196 File system error in Photos app \" loading=\"lazy\"></p> <p> </p> <p> Hướng dẫn này bao gồm các hướng dẫn để giải quyết &quot;Lỗi hệ thống tệp 2147219196&quot; khi mở ảnh trong ứng dụng Ảnh trong Windows 10. </p> <h4> Cách khắc phục: Không thể mở ảnh bằng ứng dụng &#39;Ảnh&#39; trong Windows 10 với lỗi &quot;Lỗi hệ thống tệp 2147219196&quot;. </h4> <p> Lưu ý: Trước khi bạn tiếp tục bên dưới, hãy đảm bảo rằng hệ thống của bạn đã được cập nhật đầy đủ. </p> <h6> Bước 1. Chạy Trình gỡ rối ứng dụng Windows Store. </h6> <p> 1. Điều hướng đến <strong> Khởi đầu </strong> -&gt; <strong> Cài đặt </strong> -&gt; <strong> Cập nhật và bảo mật </strong> . <br> 2. Chọn <strong> Khắc phục sự cố </strong> từ bên trái, và sau đó nhấp vào <strong> Trình gỡ rối ứng dụng Windows Store </strong> ở bên phải và nhấp vào <strong> Chạy trình gỡ rối </strong> . </p> <p><img src=\"images/image_thumb-74-400.png\" alt=\"windows store apps troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 3. Làm theo hướng dẫn trên màn hình và để trình khắc phục sự cố khắc phục sự cố. <br> 4. Khi việc khắc phục sự cố hoàn tất, hãy đóng trình khắc phục sự cố và cố gắng mở một tệp hình ảnh. Nếu lỗi vẫn còn, hãy chuyển sang bước tiếp theo. </p> <p><img src=\"images/image_thumb-75-371.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Bước 2. Sửa chữa hoặc Đặt lại ứng dụng Ảnh. </h6> <p> Nếu bạn nhận được &quot;2147219196&quot;, khi bạn cố gắng mở tệp .JPG hoặc .PNG bằng ứng dụng Ảnh, sau đó cố gắng sửa chữa ứng dụng. Để làm việc đó: </p> <p> 1. Điều hướng đến <strong> Khởi đầu </strong> -&gt; <strong> Cài đặt </strong> -&gt; <strong> Ứng dụng. <br> </strong> 2. Tại <strong> Ứng dụng và tính năng, </strong> xác định vị trí và chọn <strong> Ảnh của Microsoft </strong> và bấm vào <strong> Tùy chọn nâng cao. </strong></p> <p><img src=\"images/image_thumb-76-358.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Tại Tùy chọn nâng cao, hãy nhấp vào <strong> Sửa </strong> cái nút. <br> 4. Khi quá trình hoàn tất, bạn sẽ thấy một dấu kiểm <img src=\"images/image_thumb-77-553.png\" alt=\"image\" loading=\"lazy\"> bên cạnh nút &#39;Sửa chữa&#39;. Tiến hành và kiểm tra xem &quot;Lỗi hệ thống tệp 2147219196&quot; đã được giải quyết chưa bằng cách mở ảnh. <br> 5. Nếu sự cố vẫn tiếp diễn, hãy nhấp vào <strong> Cài lại </strong> để đặt lại cài đặt của ứng dụng Ảnh. </p> <p><img src=\"images/image_thumb-78-665.png\" alt=\"repair - reset photos app\" loading=\"lazy\"></p> <p> </p> <h6> Bước 3. Xóa hoàn toàn và cài đặt lại ứng dụng Ảnh. </h6> <p> Bước tiếp theo để khắc phục &quot;Lỗi hệ thống tệp&quot; -2147219196 &quot;trong ứng dụng Ảnh, là hoàn tất quá trình xóa khỏi hệ thống của bạn và cài đặt lại ứng dụng Ảnh. Để thực hiện điều đó: </p> <p> 1. Mở <strong> PowerShell </strong> như <strong> Người quản lý </strong> . <br> 2. Tại PowerShell, đưa ra lệnh sau và nhấn <strong> Đi vào </strong> , để xóa hoàn toàn ứng dụng Ảnh: * </p> <ul> <li><strong> Get-AppxPackage * ảnh * | Remove-AppxPackage -allusers </strong></li> </ul> <p> * Thông tin: Lệnh trên sẽ gỡ cài đặt ứng dụng Ảnh khỏi Windows 10, đồng thời cũng sẽ xóa các tệp cài đặt và phần còn lại của ứng dụng Ảnh khỏi thư mục &quot;C: \\ Program Files \\ WindowsApps \\&quot;. </p> <p><img src=\"images/image_thumb-95-600.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Khi lệnh được hoàn thành, <strong> khởi động lại </strong> máy tính của bạn. <br> 4. Mở Microsoft Store và cài đặt <a href=\"https://www.microsoft.com/en-us/p/microsoft-photos/9wzdncrfjbh4#activetab=pivot:overviewtab\" target=\"_blank\" rel=\"nofollow noopener\"> Ảnh của Microsoft </a> . </p> <p><img src=\"images/image_thumb-89-238.png\" alt=\"reinstall photos app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Nhấp vào <strong> Tải về, </strong> để cài đặt lại ứng dụng Ảnh trên hệ thống của bạn. </p> <p><img src=\"images/image_thumb-90-948.png\" alt=\"install photos app windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Khi ứng dụng Ảnh được cài đặt, hãy mở một hình ảnh. Lỗi &quot;Lỗi hệ thống tệp 2147219196&quot; đã được giải quyết. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}