{"title":"Khắc phục: Tùy chọn Cài đặt Công cụ VMware bị Xám. (Đã giải quyết)","content":"<p> Nếu bạn không thể cài đặt VMware Tools trên máy khách do tùy chọn &quot;Install VMware Tools&quot; chuyển sang màu xám thì hãy tiếp tục đọc phần bên dưới. VMware Tools là một tập hợp các dịch vụ và mô-đun miễn phí cho phép một số tính năng trong máy ảo khách như hiệu suất đồ họa nhanh hơn, cải thiện hiệu suất chuột và đáng kể nhất: khả năng sao chép và dán giữa Máy chủ và máy Khách. Vì vậy, mặc dù hệ điều hành khách có thể chạy mà không cần Công cụ VMware, các công cụ VMware vẫn được yêu cầu cài đặt nếu bạn muốn kích hoạt các tính năng bổ sung của VMware. </p> <p> Theo cách thông thường để cài đặt VMware Tools, là khởi động máy khách và sau đó từ menu &quot;Player&quot;, chọn <strong> Quản lý </strong> &gt; <strong> Cài đặt Công cụ VMware </strong> . Tuy nhiên, nếu bạn đã kết nối ổ CD / DVD ảo của máy ảo với tệp ảnh ISO khi bạn cài đặt hệ điều hành, tùy chọn &quot;Install VMware Tools&quot; sẽ chuyển sang màu xám. </p> <p><img src=\"images/image_thumb-45-164.png\" alt=\"FIX VMware Tools option is Grayed Out\" loading=\"lazy\"></p> <p> </p> <p> Hướng dẫn này bao gồm các hướng dẫn để khắc phục sự cố sau trong VMware Workstation Player. Tùy chọn &quot;Cài đặt Công cụ VMware&quot; chuyển sang màu xám trong máy Khách. </p> <h4> Cách Cài đặt Công cụ VMware nếu tùy chọn &#39;Cài đặt Công cụ VMware&#39; bị Xám. </h4> <p> </p> <p> 1. Tắt Máy ảo. <br> 2. Nhấp chuột phải vào máy ảo và chọn <strong> Cài đặt </strong> . </p> <p><img src=\"images/image_thumb-39-377.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Chọn <strong> CD / DVD </strong> lái xe và sau đó nhấp vào <strong> Tẩy </strong> . </p> <p><img src=\"images/image_thumb-43-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Sau đó chọn <strong> Đĩa mềm </strong> lái xe, nhấp chuột <strong> Tẩy </strong> và sau đó nhấp vào <strong> đồng ý </strong> để đóng các tùy chọn cài đặt. </p> <p><img src=\"images/image_thumb-44-469.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Khởi đầu </strong> Máy ảo. <br> 6. Từ menu &#39;Trình phát&#39;, chọn <strong> Quản lý </strong> và bấm vào <strong> Cài đặt VMware Tools. </strong></p> <p><img src=\"images/image_thumb-42-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> Đó là tất cả! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}