{"title":"KHẮC PHỤC: VeraCrypt không phản hồi (đóng băng) khi không đạt được số lượng trong Windows 10 (đã giải quyết)","content":"<p> Hướng dẫn này bao gồm các hướng dẫn để khắc phục sự cố sau với VeraCrypt trên máy tính chạy Windows 10: VeraCrypt không phản hồi và bị treo (treo) khi tháo ổ đĩa được mã hóa. </p> <p> Chi tiết về vấn đề VeraCrypt Không phản hồi (Đóng băng): Khi bạn cố gắng gỡ bỏ một ổ đĩa (với tất cả các tệp đã đóng khỏi ổ đĩa được gắn kết), VeraCrypt bị treo và hiển thị &quot;Không phản hồi&quot;. Khi sự cố này xuất hiện, cách duy nhất để khôi phục Windows về trạng thái bình thường là kết thúc quá trình VeraCrypt từ Trình quản lý tác vụ. </p> <p> Theo <a href=\"https://www.veracrypt.fr/en/Issues%20and%20Limitations.html\" target=\"_blank\" rel=\"nofollow noopener\"> VeraCrypt </a> sự cố đóng băng là do xung đột giữa hộp thoại chờ VeraCrypt được hiển thị trong các hoạt động gắn kết / tháo gỡ và phần mềm khác được cài đặt trên máy (ví dụ: Chống vi-rút hoặc Tường lửa). </p> <h4> Cách khắc phục: VeraCrypt không phản hồi khi tháo gỡ / gắn ổ đĩa. </h4> <p> Sự cố này là do xung đột giữa hộp thoại chờ VeraCrypt được hiển thị trong các hoạt động gắn kết / tháo gỡ và phần mềm khác được cài đặt trên máy (ví dụ: Outpost Firewall Pro). </p> <p> 1. Từ VeraCrypt&#39;s <strong> Cài đặt </strong> menu, chọn <strong> Sở thích </strong> . </p> <p><img src=\"images/image_thumb-63-122.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Kiểm tra </strong> các <strong> Không hiển thị hộp thoại thông báo chờ khi thực hiện các thao tác </strong> nhấp chuột tùy chọn <strong> ĐỒNG Ý. </strong></p> <p><img src=\"images/image_thumb-64-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Bây giờ tiến hành gắn / tháo ổ đĩa mà không bị đóng băng! </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}