{"title":"Khắc phục: Bàn di chuột không hoạt động hoặc bị treo trong Windows 10 (Đã giải quyết)","content":"<p> Trong những năm qua, tôi đã khắc phục nhiều sự cố bàn di chuột trong Windows 10 trên một số máy tính xách tay (ví dụ: bàn di chuột không hoạt động, bàn di chuột bị treo, v.v.), vì vậy tôi quyết định viết một hướng dẫn để khắc phục những sự cố này. </p> <p> Nếu bạn sở hữu một chiếc máy tính xách tay, thì đôi khi bạn có thể gặp vấn đề với thiết bị bàn di chuột. Đặc biệt nếu bạn có Windows 10, bàn di chuột thường có thể ngừng hoạt động hoặc không hoạt động bình thường sau khi bạn cài đặt bản cập nhật. Tất nhiên sự cố bàn di chuột có thể chỉ ra sự cố phần cứng, nhưng trong nhiều trường hợp, sự cố bàn di chuột là do vấn đề phần mềm. </p> <p> Trên Windows 10, bàn di chuột của máy tính xách tay có thể không hoạt động vì nhiều lý do khác nhau, vì vậy hướng dẫn này sẽ bao gồm tất cả các phương pháp để giải quyết vấn đề. </p> <h2> Cách khắc phục sự cố bàn di chuột trong Windows 10. </h2> <p> Làm theo các bước sau trước khi tiếp tục các phương pháp sau để giải quyết các vấn đề về màn hình cảm ứng. </p> <ol> <li> Đảm bảo Windows 10 không bị đóng băng, bằng cách nhấn ALT + CTRL + DEL và xem Trình quản lý tác vụ có mở hay không. </li> <li> Nếu máy tính xách tay của bạn có tổ hợp phím Chức năng để tắt và bật bàn di chuột. (ví dụ: Fn + F3), sau đó nhấn tổ hợp phím Fn để bật bàn di chuột. (Trên một số máy tính xách tay, bàn di chuột có thể được bật / tắt bằng cách nhấn đúp vào bề mặt của bàn di chuột) </li> <li> Khởi động lại máy tính của bạn. </li> <li> Thực hiện tắt hoàn toàn Windows 10 và sau đó bật lại máy tính xách tay của bạn. (Để thực hiện tắt hoàn toàn: nhấn và giữ <strong> SHIFT </strong> phím và sau đó nhấp vào <strong> Khởi đầu </strong> &gt; <strong> Quyền lực </strong> &gt; <strong> Tắt </strong> ). </li> </ol> <p><strong> </strong></p> <h3> Phương pháp 1. Bật Touchpad trong Windows 10. </h3> <p> Windows 10 có khả năng vô hiệu hóa hoặc tắt bàn di chuột khi kết nối chuột ngoài. Vì vậy, hãy tiến hành và đảm bảo rằng Touchpad đã được bật trong cài đặt Touchpad. </p> <p> 1. Điều hướng đến <strong> Khởi đầu </strong><img src=\"images/image_thumb2_thumb_thumb-670.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menu -&gt; <strong> Cài đặt </strong> <img src=\"images/image_thumb-66-512.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Các thiết bị. <br> </strong> 2. Chọn <strong> Bàn di chuột </strong> trên bảng điều khiển bên trái và ở bên phải, hãy đảm bảo rằng công tắc Bàn di chuột được đặt thành <strong> TRÊN </strong> và cả <strong> kiểm tra </strong> các <strong> Để bàn di chuột bật khi chuột được kết nối </strong> Lựa chọn. * </p> <p><img src=\"images/image_thumb-38-467.png\" alt=\"Disable Touchpad Windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Lưu ý: Nếu bạn không thể tìm thấy ở đây, chuyển đổi / chuyển đổi Touchpad… </p> <p> 1. Mở <strong> Cài đặt thêm </strong> phía dưới cái <strong> Cài đặt liên quan </strong> phần. </p> <ul> <li> Bài viết liên quan: <a href=\"https://www.repairwin.com/disable-touchpad-option-missing-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"><strong> Tắt tùy chọn bàn di chuột bị thiếu trên Windows 10. </strong></a></li> </ul> <p><img src=\"images/image_thumb-39-742.png\" alt=\"touchpad additional settings\" loading=\"lazy\"></p> <p> 2. Bật bàn di chuột trong tùy chọn Thuộc tính chuột. (Nếu bàn di chuột đã được bật, hãy thử tắt và bật lại.) </p> <p><img src=\"images/image_thumb-31-122.png\" alt=\"enable touchpad windows 10\" loading=\"lazy\"></p> <h3> Phương pháp 2. Đặt lại cài đặt Bàn di chuột trong Windows 10. </h3> <p> Phương pháp phổ biến để giải quyết các vấn đề về bàn di chuột trong Windows 10 là đặt lại cài đặt bàn di chuột về mặc định. </p> <p> 1. Điều hướng đến <strong> Khởi đầu </strong><img src=\"images/image_thumb2_thumb_thumb-596.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> menu -&gt; <strong> Cài đặt </strong> <img src=\"images/image_thumb-66-851.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Các thiết bị. <br> </strong> 2. Tại <strong> Bàn di chuột </strong> các tùy chọn <strong> , </strong> cuộn xuống và nhấp vào <strong> Cài lại </strong> Dưới <strong> Đặt lại bàn di chuột của bạn. * </strong></p> <p><img src=\"images/image_thumb-40-277.png\" alt=\"reset touchpad windows 10\" loading=\"lazy\"></p> <p> </p> <p> * Lưu ý: Nếu bạn không thể nhìn thấy <strong> Cài lại </strong> cái nút… </p> <p> 1. Mở <strong> Cài đặt thêm </strong> . <br> 2. Nhấp vào <strong> Đặt lại thiết bị </strong> trong các tùy chọn Thuộc tính Chuột. </p> <p><img src=\"images/image_thumb-33-928.png\" alt=\"reset touchpad settings windows 10\" loading=\"lazy\"></p> <h3> Phương pháp 3. Gỡ cài đặt và cài đặt lại trình điều khiển thiết bị Touchpad. </h3> <p> Một giải pháp khác để khắc phục sự cố bàn di chuột trong Windows 10 là gỡ cài đặt hoàn toàn và cài đặt lại trình điều khiển bàn di chuột. </p> <p> 1. Mở <strong> Quản lý thiết bị </strong> . Để làm việc đó: </p> <blockquote><p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-140.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Trong hộp &quot;Mở&quot;, nhập: <strong> devmgmt.msc </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-5-568.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Mở rộng Chuột và các thiết bị trỏ khác. <br> 3. <strong> Nhấp chuột phải </strong> trên <strong> TouchPad </strong> thiết bị và nhấp chuột <strong> Gỡ cài đặt. </strong></p> <blockquote> <p><img src=\"images/image_thumb-34-656.png\" alt=\"uninstall touchpad windows 10\" loading=\"lazy\"></p> </blockquote> <p> 4. Sau khi khởi động lại, hãy đợi 4-5 phút để Windows cài đặt lại trình điều khiển bàn di chuột và kiểm tra xem bàn di chuột của bạn có hoạt động hay không. Nếu bàn di chuột của bạn không hoạt động trở lại, hãy thử cài đặt trình điều khiển của bàn di chuột từ trang web hỗ trợ của nhà sản xuất máy tính xách tay của bạn. </p> <h3> Phương pháp 4. Tắt và Bật Bàn di chuột trong BIOS. * </h3> <p> * Lưu ý: Phương pháp này không áp dụng cho tất cả các kiểu máy tính xách tay, nhưng tôi biết nó hoạt động trên nhiều máy tính xách tay ASUS. </p> <p> 1. Tắt hoàn toàn máy tính xách tay của bạn bằng cách nhấn và giữ phím SHIFT trong khi nhấp <strong> Khởi đầu </strong> &gt; <strong> Quyền lực </strong> &gt; <strong> Tắt </strong><br> 2. Bật nguồn máy tính xách tay và nhấn phím Chức năng tương ứng để vào cài đặt BIOS. (ví dụ: F2, F10, v.v.), <br> 3. Trong cài đặt BIOS, hãy kiểm tra xem có cài đặt nào cho Bàn di chuột hoặc Thiết bị trỏ bên trong hoặc thiết bị Bàn di chuột không (thông thường bạn có thể tìm thấy cài đặt này trong &#39; <strong> Nâng cao </strong> &#39; phần). Nếu vậy, <strong> Vô hiệu hóa </strong> các <strong> thiết bị bàn di chuột </strong> và <strong> Lưu và thoát </strong> từ cài đặt BIOS. <br> 4. Để Windows 10 tải. <br> 5. Tắt và bật lại máy tính xách tay của bạn. <br> 6. Vào lại cài đặt BIOS và nhập lại <strong> bật Bàn di chuột </strong> &amp; <strong> Cứu thoát </strong> . <br> 7. Sau khi khởi động lên Windows 10, bàn di chuột sẽ hoạt động. </p> <p><strong> Phần kết luận: </strong> Nếu sau các bước trên, bàn di chuột của bạn vẫn không hoạt động, điều này cho thấy sự cố phần cứng. Trường hợp này bạn hãy sử dụng chuột ngoài hoặc đến cửa hàng sửa chữa laptop để sửa chữa thiết bị touchpad. </p> <p> Đó là tất cả mọi người! Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}