{"title":"Khắc phục: Trình cài đặt Microsoft Office gặp sự cố do Nhấp để chạy các chương trình Office dựa trên trình cài đặt (Đã giải quyết).","content":"<p> Hướng dẫn này bao gồm các hướng dẫn để giải quyết lỗi thiết lập Office &quot;Chúng tôi đã tìm thấy sự cố! Rất tiếc, trình cài đặt Microsoft Office đã gặp sự cố vì bạn đã cài đặt các chương trình Office dựa trên trình cài đặt Click-to-run này trên máy tính: Microsoft Office Professional&quot;. </p> <p> Lỗi trên thường xuất hiện khi bạn cố gắng cài đặt Visio, Project, Skype for Business hoặc OneDrive for Business, trong khi bạn đã cài đặt Microsoft Office 2019, 2016 hoặc 2013 Professional Plus hoặc Standard trên máy tính của mình </p> <p><img src=\"images/image_thumb-12-962.png\" alt=\"FIX: Microsoft Office Installer encountered a problem because of Click to Run installer based Office programs \" loading=\"lazy\"></p> <p> Lỗi &quot;Rất tiếc, trình cài đặt Office Click-to-Run đã gặp sự cố do bạn đã cài đặt các chương trình Office dựa trên trình cài đặt Windows này trên máy tính của mình&quot;, xuất hiện do các phiên bản Office mới nhất (2013, 2016, 2019, 365) sử dụng công nghệ &quot;Click-to-Run&quot; để cài đặt, trong khi các phiên bản số lượng lớn của các phiên bản này sử dụng &quot;công nghệ Windows Installer (MSI)&quot;. Điều này có nghĩa là bạn chỉ có thể cài đặt một loại trình cài đặt tại một thời điểm. </p> <h4> Cách khắc phục: Trình cài đặt Microsoft Office gặp sự cố do Nhấp để chạy các chương trình Office dựa trên trình cài đặt. </h4> <h6> Phương pháp 1. Gỡ cài đặt Nhấp để chạy (các) trình cài đặt. </h6> <p> 1. Nhấn <strong> các cửa sổ </strong> <img src=\"images/image_thumb41-136.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại <strong> người cài đặt </strong> và hãy nhấn <strong> Đi vào </strong> để điều hướng đến thư mục &quot;C: \\ Windows \\ Installer&quot;. </p> <p><img src=\"images/image_thumb5_thumb-550.png\" alt=\"image_thumb[5]\" loading=\"lazy\"></p> <p> 3. Từ <strong> Lượt xem </strong> menu, bấm vào <strong> Thêm cột </strong> và sau đó nhấp vào <strong> Chọn cột </strong></p> <p><img src=\"images/image_thumb9_thumb-870.png\" alt=\"image_thumb[9]\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Kiểm tra </strong> các <strong> Môn học </strong> và bấm vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb13_thumb-850.png\" alt=\"image_thumb[13]\" loading=\"lazy\"></p> <p><a href=\"file:///C:/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/supfiles10B8394/image%5B20%5D.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 5. Sắp xếp kết quả theo Chủ đề và sau đó cuộn xuống cho đến khi bạn tìm thấy &quot; <em> Thành phần bản địa hóa Office 16 Click-to-Run &quot; </em> . </p> <p><img src=\"images/image_thumb-16-433.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Khi bạn tìm thấy nó, hãy nhấp chuột phải vào nó và chọn <strong> Gỡ cài đặt </strong> . * </p> <p> * Lưu ý: Nếu sử dụng xem nhiều hơn một &quot; <em> Các thành phần bản địa hóa Click-to-Run của Office 16 &quot;, </em> sau đó tiếp tục và gỡ cài đặt tất cả chúng. </p> <p><img src=\"images/image_thumb-17-609.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7. Khi quá trình Gỡ cài đặt hoàn tất, sau đó tiến hành cài đặt lại Microsoft Office. * </p> <p> * Lưu ý: Nếu bạn vẫn nhận được lỗi tương tự, hãy tiếp tục và gỡ cài đặt tất cả &quot;Thành phần Office 16 Click-to-Run&quot; và thử thiết lập lại Office. </p> <h6></h6> <h6> Phương pháp 2. Tải xuống và cài đặt phiên bản bán lẻ của sản phẩm Microsoft Office. </h6> <p> 1. Điều hướng đến <a href=\"https://www.heidoc.net/joomla/technology-science/microsoft/67-microsoft-windows-iso-download-tool\" target=\"_blank\" rel=\"nofollow noopener\"> HeiDoc.net </a> và tải xuống <strong><a href=\"https://www.heidoc.net/php/Windows-ISO-Downloader.exe\" target=\"_blank\" rel=\"nofollow noopener\"> Windows ISO Downloader Tool </a></strong> . <br> 2. Nhấp đúp để chạy tệp đã tải xuống &quot;Windows-ISO-Downloader.exe&quot;. <br> 3. Ở ngăn bên phải, hãy chọn <strong> Văn phòng </strong> rồi chọn Phiên bản &amp; Ngôn ngữ của sản phẩm Office mà bạn muốn cài đặt. <br> 4. Khi hoàn tất, hãy nhấp vào <strong> Tải xuống. </strong></p> <p><img src=\"images/image_thumb-13-868.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Khi quá trình tải xuống hoàn tất, hãy nhấp chuột phải vào tệp hình ảnh đã tải xuống và nhấp vào <strong> Gắn kết. </strong></p> <p><img src=\"images/image_thumb-18-609.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Nhấp đúp vào <strong> Setup.exe </strong> để cài đặt sản phẩm Office. </p> <p><img src=\"images/image_thumb-15-851.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Phương pháp 3. Hoàn tất Gỡ cài đặt Phiên bản Office đã Cài đặt. </h6> <p> 1. Tải xuống <a href=\"http://go.microsoft.com/?linkid=9815935\" target=\"_blank\" rel=\"nofollow noopener\"> Gỡ cài đặt Microsoft Office Fix </a> công cụ để tự động loại bỏ phiên bản Windows Installer của Office Office 365, Office 2019, Office 2016 hoặc Office 2013. </p> <p> 2. Chạy &quot;Gỡ cài đặt Microsoft Office Fix&quot; và nhấn <strong> Kế tiếp </strong> ở màn hình đầu tiên. </p> <p><img src=\"images/image_thumb-19-947.png\" alt=\"office uninstall tool\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Thực hiện quy trình giải quyết các sự cố với Office Uninstall và gỡ bỏ phần mềm Office khỏi máy tính của bạn. </p> <p><img src=\"images/image_thumb-20-436.png\" alt=\"cannot uninstall office\" loading=\"lazy\"></p> <p> 4. Khi quá trình gỡ cài đặt hoàn tất, hãy khởi động lại máy của bạn và thử cài đặt lại Microsoft Office. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về điều này. </p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-22.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p>"}