{"title":"Khắc phục: Máy tính xách tay Dell Inspiron Tốc độ CPU chậm (Đã giải quyết)","content":"<p> Hướng dẫn này bao gồm các hướng dẫn để khắc phục sự cố tốc độ CPU rất chậm trên máy tính xách tay Dell Inspiron 5558. Gần đây, một người bạn của tôi đã mang máy tính xách tay Dell của anh ấy đến phòng thí nghiệm của tôi vì nó đột nhiên trở nên quá chậm. Trên thực tế, trước đây máy tính xách tay hoạt động nhanh, nhưng bây giờ phải mất nhiều thời gian để tải hệ điều hành (Windows 10) và các ứng dụng. </p> <p> Sau khi kiểm tra máy tính xách tay, và như bạn có thể thấy ở ảnh chụp màn hình bên dưới, tôi thấy rằng CPU luôn chạy ở tốc độ 0,48GHz thay vì 2,20GHz. Vì vậy, tôi đã bắt đầu khắc phục sự cố và cuối cùng tôi đã tìm thấy hai phương pháp sau để giải quyết vấn đề tốc độ CPU chậm… </p> <p> (Tốc độ CPU đã giảm xuống khoảng 85-87% trên máy tính xách tay Dell) </p> <p><img src=\"images/image_thumb-16-354.png\" alt=\"FIX Dell Laptop Slow CPU Speed\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cách khắc phục sự cố tốc độ CPU chậm trên máy tính xách tay Dell. </h4> <h6> Phương pháp 1. Thay bộ đổi nguồn AC. </h6> <p> Sự cố tốc độ CPU chậm, là một sự cố đã biết trên máy tính xách tay Dell, khi bộ chuyển đổi nguồn AC không được nhận dạng chính xác từ máy tính. Trong trường hợp này, và ngay cả khi bộ điều hợp nguồn dường như hoạt động tốt, thông báo cảnh báo sau sẽ hiển thị khi bạn bật nguồn máy tính xách tay &quot;Không thể xác định loại Bộ đổi nguồn AC. Điều này sẽ ngăn cản hiệu suất hệ thống tối ưu&quot;. </p> <p> Vì vậy, phương pháp đầu tiên để giải quyết vấn đề hiệu suất chậm trên máy tính xách tay Dell của bạn là thay thế bộ chuyển đổi nguồn bằng bộ chuyển đổi nguồn AC Dell tương thích mới. </p> <p> </p> <h6> Phương pháp 2. DỪNG Điều chỉnh CPU bằng ThrottleStop. </h6> <p> Nếu bộ điều hợp AC của bạn hoạt động tốt và máy tính xách tay của bạn không quá nóng, * thì một phương pháp khác để khắc phục sự cố hiệu suất hệ thống chậm trên máy tính xách tay Dell của bạn là tắt điều chỉnh bộ điều hợp nguồn không xác định, với <strong><a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"> ThrottleStop </a></strong> tiện ích. Để làm việc đó: </p> <p> 1. Tải xuống <a href=\"https://www.techpowerup.com/download/techpowerup-throttlestop/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> ThrottleStop </strong></a> tiện ích và giải nén kho lưu trữ bạn đã tải xuống. <br> 2. Từ thư mục đã giải nén, nhấp đúp để chạy ứng dụng &quot;ThorttleStop.exe&quot;. * <br> 3. <strong> Bỏ chọn </strong> các <strong> KHUYẾN MÃI BD </strong> *** hộp kiểm và sau đó nhấp vào <strong> Tiết kiệm </strong> . </p> <p> * Ghi chú: <br> 1. Để theo dõi nhiệt độ CPU, bạn có thể sử dụng <a href=\"https://www.alcpu.com/CoreTemp/\" target=\"_blank\" rel=\"nofollow noopener\"> CoreTemp </a> chương trình. <br> 2. Nếu bạn nhận được lỗi &quot;Không tìm thấy MFC120U.dll&quot; hoặc &quot;Thiếu MSVCR120.dll&quot;, sau khi chạy ThrottleStop, hãy tiếp tục và cài đặt <a title=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" href=\"https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Gói có thể phân phối lại Visual C ++ cho Visual Studio 2013 </a> . ( <strong> Quan trọng: </strong> Nếu bạn sở hữu Windows 64-bit, bạn cần cài đặt cả phiên bản 64-bit &amp; 32-bit của gói Visual C ++). <br> 3. BD PROCHOT là viết tắt của prochot hai chiều. PROCHOT là viết tắt của bộ xử lý nóng là tín hiệu được kích hoạt bên trong CPU khi nó đạt khoảng 100C đến 105C tùy thuộc vào số kiểu máy. Tín hiệu này là tín hiệu bắt đầu điều chỉnh nhiệt để CPU có thể chạy chậm lại và tránh quá nóng. Tắt PROCHOT sẽ cho phép CPU của bạn tiếp tục chạy ở tốc độ tối đa. (Nguồn: <a href=\"http://forum.notebookreview.com/threads/the-throttlestop-guide.531329/\" target=\"_blank\" rel=\"nofollow noopener\"> Hướng dẫn về ThrottleStop </a> ). </p> <p><img src=\"images/image_thumb-20-666.png\" alt=\"FIX Slow CPU Speed with ThrottleStop\" loading=\"lazy\"></p> <p> 4. Đóng ThrottleStop và bạn đã hoàn tất. Bây giờ CPU sẽ chạy ở tốc độ tối đa, cho đến khi bạn khởi động lại hoặc tắt nguồn máy tính xách tay. * </p> <p> * Lưu ý: Bạn phải chạy <strong> ThrottleStop </strong> chương trình mỗi khi bạn khởi động máy tính, nếu bạn muốn chạy ở tốc độ tối đa của CPU. Để làm cho cuộc sống của bạn dễ dàng hơn, hãy làm theo các bước trong phần này <a href=\"https://www.repairwin.com/how-to-start-throttlestop-at-windows-startup/\" target=\"_blank\" rel=\"nofollow noopener\"> hướng dẫn </a> để tự động khởi động ThrottleStop khi khởi động Windows. </p> <p><img src=\"images/image_thumb-21-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}