{"title":"Khắc phục: Lỗi cài đặt bản cập nhật Windows 10 không thành công 0x800711C7 - 0x2000A (Đã giải quyết)","content":"<p> Hướng dẫn này chứa các hướng dẫn để khắc phục Lỗi nâng cấp Windows 10 0x800711C7 - 0x2000A: &quot;Cài đặt không thành công trong giai đoạn SAFE_OS với lỗi trong PREPARE_FIRST_BOOT&quot;. </p> <p> </p> <p><img src=\"images/image_thumb-51-797.png\" alt=\"FIX Error 0x800711C7 - 0x2000A installation failed in the SAFE_OS phase during PREPARE_FIRST_BOOT\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Chi tiết về vấn đề nâng cấp Windows 10 0x800711C7 - 0x2000A: Khi bạn cố gắng nâng cấp Windows 10 lên phiên bản mới nhất (bản dựng), quá trình cài đặt dừng lại với lỗi &quot;Chúng tôi không thể cài đặt Windows 10 - 0x800711C7 - 0x2000A - Cài đặt không thành công trong giai đoạn SAFE_OS với lỗi trong PREPARE_FIRST_BOOT &quot;, sau đó hoàn nguyên về phiên bản Windows trước. </p> <h4> Cách sửa lỗi cài đặt bản cập nhật Windows 10 v1809 0x800711C7 - 0x2000A </h4> <p> </p> <h6> Phương pháp 1. Tắt bảo vệ thiết bị khỏi PowerShell. </h6> <p> Lỗi 0x800711C7 - 0x2000A trong nâng cấp Windows 10, xuất hiện trong hệ thống có &quot; <a href=\"https://techcommunity.microsoft.com/t5/iis-support-blog/windows-10-device-guard-and-credential-guard-demystified/ba-p/376419\" target=\"_blank\" rel=\"nofollow noopener\"> Bảo vệ thiết bị </a> &quot;được kích hoạt, Vì vậy, phương pháp đầu tiên để giải quyết lỗi 0x800711C7 - 0x2000A trong bản cập nhật Windows 10, là tắt Device Guard trên hệ thống của bạn. </p> <p> 1. Tiến hành và tải xuống <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=53337\" target=\"_blank\" rel=\"nofollow noopener\"> Công cụ sẵn sàng cho phần cứng Device Guard và Credential Guard </a> từ Microsoft. <br> 2. Khi quá trình tải xuống hoàn tất, hãy giải nén tệp &quot;dgreadiness&quot; _v3.6.zip. <br> 3. Mở thư mục đã giải nén và từ menu Tệp, chọn Mở Windows PowerShell với tư cách quản trị viên. </p> <p><img src=\"images/image_thumb-52-765.png\" alt=\"FIX Error 0x800711C7 - 0x2000A Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Tại PowerShell, gõ lệnh sau để <strong> cho phép (thiết lập) Chính sách Thực thi để chạy các tập lệnh </strong> (Nhấn <strong> A </strong> khi được yêu cầu thay đổi chính sách thực thi). </p> <ul> <li> Set-ExecutionPolicy Không hạn chế </li> </ul> <p> 5. Sau đó đưa lệnh này cho <strong> vô hiệu hóa </strong> các <strong> Bảo vệ thiết bị </strong> và <strong> Bảo vệ thông tin xác thực </strong> : </p> <ul> <li> . \\ DG_Readiness_Tool_v3.6-Vô hiệu hóa </li> </ul> <p><img src=\"images/image_thumb-53-648.png\" alt=\"Disable Device Guard and Credential Guard Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Sau khi thực hiện lệnh, <strong> khởi động lại </strong> máy tính. <br> 7. Cố gắng cập nhật Windows 10. * </p> <p> * Lưu ý: Sau khi cập nhật Windows 10, hãy làm theo quy trình tương tự để bật Device Guard và Credential Guard, với các lệnh sau: </p> <ul> <li> Set-ExecutionPolicy Không hạn chế </li> <li> . \\ DG_Readiness_Tool_v3.6 -Enable </li> </ul> <p> </p> <h6> Phương pháp 2. Tắt Hyper-V từ Command Prompt. </h6> <p> Phương pháp tiếp theo để giải quyết lỗi 0x800711C7 - 0x2000A trong nâng cấp Windows 10 là vô hiệu hóa siêu giám sát khi khởi động Windows. </p> <p> 1. Mở <strong> dấu nhắc lệnh với tư cách là Quản trị viên </strong> . <br> 2. Gõ lệnh sau để tắt Hyper-V khi khởi động Windows. </p> <ul> <li> bcdedit / tắt hypervisorlaunchtype </li> </ul> <p><img src=\"images/image_thumb-50-768.png\" alt=\"Disable Hyper-V Command Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Khởi động lại </strong> PC của bạn. <br> 4. Cố gắng cài đặt bản cập nhật. * </p> <p> * Lưu ý: Sau khi cập nhật Windows 10, hãy đưa ra lệnh sau để tự động khởi động Hypervisor khi máy tính khởi động: </p> <ul> <li> bcdedit / đặt hypervisorlaunchtype auto </li> </ul> <p> </p> <h6> Phương pháp 3. Vô hiệu hóa Khởi động An toàn từ cài đặt BIOS. </h6> <p> Một nguyên nhân khác gây ra lỗi cập nhật Windows 10 0x800711C7 - 0x2000A là Khởi động an toàn. Vì vậy, hãy tiếp tục và vô hiệu hóa Khởi động an toàn từ cài đặt BIOS. Để làm việc đó: </p> <p> 1. Bật nguồn hệ thống của bạn và nhấn ngay phím tương ứng * để truy cập <strong> THIẾT LẬP BIOS. </strong></p> <p> </p> <p> * Lưu ý: Thông thường để vào BIOS, bạn phải nhấn nút <strong> DEL </strong> hoặc là <strong> F1 </strong> hoặc là <strong> F2 </strong> hoặc là <strong> F10 </strong> Chìa khóa. (phụ thuộc vào nhà sản xuất) </p> <p> 2. Nhìn vào <strong> Bảo vệ </strong> hoặc tại <strong> Tùy chọn khởi động, </strong> hoặc tại <strong> Xác thực </strong> cài đặt, * để tìm <strong> Khởi động an toàn </strong> tùy chọn và <strong> Vô hiệu hóa </strong> nó <strong> . </strong></p> <p> * Ghi chú: <br> 1. Vị trí của cài đặt &#39;Khởi động an toàn&#39; trong BIOS, tùy thuộc vào nhà sản xuất thiết bị. <br> 2. Nếu bạn không thể tìm thấy cài đặt &#39;Khởi động An toàn&#39;, thì <strong> Vô hiệu hóa </strong> các <strong> Hỗ trợ CSM </strong> và sau đó <strong> Lưu và thoát </strong> hình thành thiết lập BIOS. Sau đó vào lại thiết lập BIOS để tìm Khởi động an toàn. </p> <p><img src=\"images/image_thumb-23-385.png\" alt=\"Disable Secure Boot\" loading=\"lazy\"></p> <p> 3. <strong> Tiết kiệm </strong> cài đặt và <strong> LỐI RA </strong> Thiết lập BIOS. <br> 4. Để Windows khởi động bình thường và thử cài đặt bản cập nhật. Nếu cập nhật lại không thành công, hãy bật lại &#39;Khởi động an toàn&#39; và tiếp tục phương pháp tiếp theo. </p> <p> </p> <h6> Phương pháp 4. Cập nhật Windows 10 bằng cách sử dụng Trợ lý cập nhật </h6> <p> 1. Điều hướng đến <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Trang web tải xuống Windows 10 </a> và nhấp vào <strong> Cập nhật bây giờ </strong> cái nút. </p> <p><img src=\"images/image_thumb_thumb-680.png\" alt=\"Update Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Lưu tệp &quot;Windows10Upgrade9252.exe&quot; trên màn hình của bạn. <br> 3. Nhấp đúp vào tệp đã tải xuống để mở <strong> Hỗ trợ nâng cấp Windows </strong> . <br> 4. Nhấp vào <strong> Cập nhật bây giờ </strong> để bắt đầu cập nhật. </p> <p><img src=\"images/image_thumb4_thumb-918.png\" alt=\"Windows 10 Update Assistant\" loading=\"lazy\"></p> <p> 5. Để Windows hoàn tất quá trình tải xuống và xác minh. <br> 6. Khi xác minh đạt 100%, <strong> ngắt kết nối máy tính của bạn khỏi Internet </strong> hoặc đặt nó thành &quot; <strong> Chế độ máy bay </strong> &quot;. <br> 7. Chờ cho đến khi Windows cập nhật hệ thống của bạn. <br> 8. Khi được nhắc, hãy khởi động lại hệ thống của bạn để cài đặt bản cập nhật. </p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}