{"title":"Khắc phục: Tệp không có luồng âm thanh hoặc video trên Adobe Premiere.","content":"<p> Nếu bạn nhận được lỗi Adobe Premiere &#39;File Import Failure&#39; với mô tả &quot;Tệp không có âm thanh hoặc video hơi&quot; có thể xuất hiện trong khi nhập tệp video MP4, sau đó tiếp tục đọc bên dưới. Lỗi &quot;Tệp không có âm thanh hoặc video hơi&quot; trong Adobe Premiere, có thể xuất hiện mặc dù video phát chính xác trong bất kỳ trình phát đa phương tiện nào khác (VLC, Windows Media Player, v.v.). </p> <p><img src=\"images/image_thumb-43-349.png\" alt=\"FIX: File has no audio or video streams on Adobe Premiere\" loading=\"lazy\"></p> <p> </p> <p> Lỗi Adobe Premiere trong khi nhập tệp video có thể xuất hiện vì một số lý do, vì vậy trong hướng dẫn này, bạn sẽ tìm thấy tất cả các phương pháp có sẵn để khắc phục sự cố. </p> <h4> Cách khắc phục: &quot;Tệp không có âm thanh hoặc video hơi&quot; trong Adobe Premiere. </h4> <h6> Phương pháp 1. Cài đặt QuickTime. </h6> <p> Trước hết, hãy đảm bảo rằng bạn đã cài đặt phiên bản mới nhất <a href=\"https://support.apple.com/downloads/quicktime\" target=\"_blank\" rel=\"nofollow noopener\"> Thời gian nhanh chóng </a> phiên bản trên PC của bạn và sau đó cố gắng nhập tệp mp4 trong Adobe Premiere. </p> <p> </p> <h6> Phương pháp 2. Đổi tên tệp Video. </h6> <p> 1. Tạo bản sao của tệp video mp4 trên một vị trí khác trên PC của bạn. (ví dụ: trên Máy tính để bàn của bạn) <br> 2. Đổi tên tệp video như sau: </p> <blockquote><p> a. Đặt tên tệp ngắn hơn trên tệp video và… <br> b. Xóa bất kỳ ký tự đặc biệt nào khỏi tên của nó. (dấu gạch dưới, dấu ngoặc đơn, v.v.). </p></blockquote> <p> 3. Mở tệp video trong Adobe Premiere. </p> <p> </p> <h6> Phương pháp 3. Thay đổi Phần mở rộng tên tệp từ MP4 thành MOV. </h6> <p> Phương pháp tiếp theo để bỏ qua lỗi &quot;Tệp không có luồng âm thanh hoặc video&quot; của Adobe Premiere là thay đổi phần mở rộng của tệp video, từ .mp4 thành .mov (hoặc ngược lại). Để làm việc đó: </p> <p> 1. Trong File Explorer, hãy nhấp vào <strong> Lượt xem </strong> -&gt; <strong> Tùy chọn </strong> -&gt; <strong> Thay đổi tùy chọn thư mục và tìm kiếm </strong> . </p> <p><img src=\"images/image_thumb-45-776.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Tại <strong> Lượt xem </strong> chuyển hướng, <strong> thông thoáng </strong> hộp &quot;Ẩn tiện ích mở rộng cho các loại tệp đã biết&quot; và nhấp vào <strong> đồng ý </strong> . * </p> <p> * Lưu ý: Để đặt cài đặt này vĩnh viễn, hãy nhấp vào &#39;Áp dụng cho thư mục&#39;, trước khi nhấp vào OK. </p> <p><img src=\"images/image_thumb-46-490.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Bây giờ, hãy tiến hành và đổi tên / thay đổi phần mở rộng của tệp video, như sau: </p> <ul> <li> Nếu tệp video có định dạng MP4 (.mp4), hãy thay đổi phần mở rộng của nó thành .mov </li> <li> Nếu tệp video có định dạng MOV (.mov), hãy thay đổi phần mở rộng của nó thành .mp4 </li> </ul> <p><img src=\"images/image_thumb-47-586.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Cuối cùng, mở tệp video trong Adobe Premiere. </p> <p> </p> <p> </p> <h6> Phương pháp 4. Xóa cơ sở dữ liệu bộ nhớ đệm phương tiện và các tệp bộ nhớ đệm. </h6> <p> Khi bạn nhập tệp phương tiện (Video hoặc Âm thanh) và trong khi làm việc với tệp này trong Adobe Premiere, chương trình sẽ tạo tệp bộ đệm phương tiện để có hiệu suất nhanh hơn. Ngoài ra, chương trình tạo liên kết cho các tệp bộ nhớ cache này trong Cơ sở dữ liệu bộ nhớ đệm phương tiện. Trong thời gian đó, các tệp bộ nhớ cache phương tiện này và cơ sở dữ liệu bộ nhớ cache phương tiện có thể trở nên quá lớn hoặc bị hỏng và cần được làm sạch để tránh sự cố. </p> <p> Vì vậy, phương pháp tiếp theo để giải quyết &quot;Tệp không có luồng âm thanh hoặc video&quot; trong Premiere, là làm sạch &quot;Cơ sở dữ liệu bộ nhớ đệm phương tiện&quot; và xóa các tệp bộ nhớ cache. Để làm việc đó: * </p> <p><strong> A. Cách làm sạch Cơ sở dữ liệu Cache Phương tiện của Adobe Premiere. </strong></p> <p> 1. Mở Adobe Premiere. <br> 2. Từ menu đi đến <strong> Biên tập </strong> -&gt; <strong> Sở thích </strong> -&gt; <strong> Phương tiện truyền thông. <br> </strong> 3. Tại Cơ sở dữ liệu bộ nhớ đệm phương tiện, hãy nhấp vào <strong> Dọn dẹp </strong> cái nút. </p> <p><img src=\"images/image_thumb-48-167.png\" alt=\"Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> 4. <strong> Khởi động lại </strong> Adobe Premiere và cố gắng mở tệp video. nếu lỗi &quot;Tệp không có luồng âm thanh hoặc video&quot; vẫn còn, hãy tiến hành xóa các tệp trong bộ nhớ cache của Adobe Premiere bằng cách làm theo hướng dẫn bên dưới: </p> <p><strong> B. Cách xóa các tệp trong bộ nhớ đệm phương tiện của Adobe Premiere. </strong></p> <p> 1. <strong> Mở </strong> Adobe Premiere. <br> 2. Từ menu đi đến <strong> Biên tập </strong> -&gt; <strong> Sở thích </strong> -&gt; <strong> Phương tiện truyền thông. <br> </strong> 3. Tại Media Cache Files, nhấp vào <strong> Duyệt qua </strong> hoặc ghi chú vị trí của các tệp bộ đệm ẩn đa phương tiện. </p> <p><img src=\"images/image_thumb-49-331.png\" alt=\"FIX: Adobe Premiere Import Failure\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Đóng </strong> Adobe Premiere. <br> 5. Trong File Explorer, <strong> xóa bỏ </strong> tất cả nội dung của thư mục &quot;Tệp trong bộ nhớ đệm phương tiện&quot;. <br> 6. Nhập tệp video trong Premiere. </p> <p> </p> <h6> Phương pháp 5. Mã hóa lại tệp video. </h6> <p> Phương pháp cuối cùng để giải quyết &quot;Tệp không có luồng âm thanh hoặc video&quot; trong quá trình nhập Adobe Premiere là mã hóa lại tệp video. Để làm việc đó: </p> <p> 1. Tải xuống và cài đặt <a href=\"https://handbrake.fr/downloads.php\" target=\"_blank\" rel=\"nofollow noopener\"> Phanh tay </a> . <br> 2. Mở Handbrake và nhấp vào <strong> Tệp - Mở một tệp video </strong> . </p> <p><img src=\"images/image_thumb-50-634.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Chọn tệp video mà bạn không thể nhập trong Adobe Premiere và nhấp vào <strong> Mở </strong> . <br> 4. Đặt định dạng đầu ra thành <strong> MP4, </strong> và sau đó nhấp vào <strong> Duyệt qua </strong> và chỉ định vị trí lưu trữ và tên tệp của tệp video đầu ra (được mã hóa lại). </p> <p><img src=\"images/image_thumb-51-817.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Tại <strong> Kích thước </strong> , đặt các kích thước giống như tệp nguồn. <br> 6. Khi hoàn tất, hãy nhấp vào <strong> Bắt đầu mã hóa. </strong></p> <p><img src=\"images/image_thumb-52-713.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Khi quá trình mã hóa hoàn tất, đóng Phanh tay. <br> 7. Mở tệp video được mã hóa lại trong Adobe Premiere. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}