{"title":"Khắc phục: Lỗi Khôi phục Hệ thống 0x8100010B (Đã giải quyết)","content":"<p> Hướng dẫn này chứa các hướng dẫn để giải quyết lỗi khôi phục hệ thống 0x8100010B trong Windows 10. Lỗi 0x8100010B, có thể xuất hiện khi bạn cố gắng tăng mức sử dụng dung lượng tối đa để bảo vệ hệ thống hoặc khi bạn cố gắng xóa tất cả các điểm khôi phục trước đó. </p> <p><img src=\"images/image_thumb-19-393.png\" alt=\"FIX System Restore Error 0x8100010B\" loading=\"lazy\"></p> <p> Cụ thể hơn, bài viết này chứa các hướng dẫn để giải quyết sự cố sau trong Khôi phục Hệ thống: </p> <p><strong> 1. Không thể tăng dung lượng ổ đĩa tối đa để bảo vệ hệ thống </strong> với lỗi: &quot;Có một <strong> lỗi không mong muốn trong trang thuộc tính </strong> : Tên tệp, tên thư mục hoặc cú pháp nhãn ổ đĩa không chính xác. (0x8007007B)). </p> <p><strong> 2. Không thể xóa các điểm khôi phục </strong> trên Windows 10 có lỗi: &quot;Không thể xóa các điểm khôi phục vì lý do sau: Windows không thể xóa tất cả các ảnh chụp nhanh. Vui lòng thử lại hoặc xem nhật ký sự kiện để biết thêm thông tin. (0x8100010B).&quot; </p> <h2> Cách khắc phục: Lỗi 0x8100010B trong Bảo vệ Khôi phục Hệ thống. </h2> <p> 1. <strong> Khởi động lại </strong> PC của bạn. </p> <p> 2. Điều hướng đến <strong> Bảo vệ hệ thống </strong> cài đặt: </p> <ul> <li><b> Bảng điều khiển&gt; Hệ thống&gt; Cài đặt hệ thống nâng cao&gt; Thuộc tính hệ thống&gt; Bảo vệ hệ thống </b></li> </ul> <p> 3. Đánh dấu <strong> Đĩa cục bộ C: (Hệ thống) </strong> và bấm vào <strong> Định cấu hình. </strong></p> <p><img src=\"images/image_thumb-22-902.png\" alt=\"0x8100010B System Protection\" loading=\"lazy\"></p> <p> </p> <p> 4. Chọn <strong> Tắt bảo vệ hệ thống </strong> và bấm vào <strong> Áp dụng&gt; OK. </strong> * </p> <p> * Lưu ý: Thao tác này sẽ xóa vĩnh viễn tất cả các điểm khôi phục trước đó. Nếu bạn muốn tăng mức sử dụng không gian tối đa để bảo vệ hệ thống mà không làm mất điểm khôi phục, hãy đưa ra lệnh dưới đây trong dấu nhắc lệnh nâng cao, sau đó xem sự cố đã được khắc phục chưa. </p> <ul> <li> vssadmin thay đổi kích thước shadowstorage / For = C: / On = C: / MaxSize = 15% </li> </ul> <p><img src=\"images/image_thumb-23-863.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Đóng </strong> và <strong> mở lại </strong> cài đặt bảo vệ hệ thống. </p> <p> 6. Bây giờ hãy chọn <strong> Bật bảo vệ hệ thống </strong> , định cấu hình Mức sử dụng tối đa và nhấp vào <strong> đồng ý </strong> . </p> <p> 7. Tại tùy chọn Bảo vệ Hệ thống, hãy chọn <strong> Bật bảo vệ hệ thống </strong> và bấm vào <strong> ĐỒNG Ý. </strong></p> <p><img src=\"images/image_thumb-73-430.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}