{"title":"Khắc phục: Chương trình không thể bắt đầu vì MSVCP100.dll hoặc MSVCR100.dll bị thiếu (Đã giải quyết)","content":"<p> Lỗi sau có thể gặp phải khi khởi động Windows hoặc khi cố khởi chạy chương trình: &quot;Chương trình không thể khởi động do máy tính của bạn bị thiếu MSVCP100.dll. Hãy thử cài đặt lại chương trình để khắc phục sự cố này.&quot;. </p> <p><img src=\"images/image_thumb-14-145.png\" alt=\"MSVCP100.dll is Missing - fix\" loading=\"lazy\"></p> <p> </p> <p> Sự cố &quot;MSVCP100.dll bị thiếu&quot; hoặc &quot;MSVCR100.dll bị thiếu&quot; thường xảy ra sau khi cập nhật hệ thống của bạn lên phiên bản Windows mới nhất (ví dụ: sau khi di chuyển hệ thống của bạn từ Windows 8.1 sang Windows 10) hoặc sau khi khôi phục hệ thống của bạn điểm khôi phục trước đó bằng cách sử dụng tính năng &quot;Khôi phục Hệ thống&quot; của Windows. </p> <p> Trong hướng dẫn này, bạn sẽ tìm thấy hướng dẫn để giải quyết lỗi &quot;msvcr100.dll bị thiếu&quot; hoặc &quot;msvcp100.dll bị thiếu&quot; trong Windows 10, 8 / 8.1 hoặc 7 OS. </p> <h4> Cách khắc phục: &quot;Chương trình không thể bắt đầu vì MSVCP100.DLL hoặc MSVCR100.DLL bị thiếu&quot;. </h4> <h6> Phương pháp 1. Gỡ cài đặt và cài đặt lại Adobe Acrobat Reader DC. </h6> <p> Phương pháp đầu tiên để giải quyết vấn đề &quot;MSVCP100.dll bị thiếu&quot; là xóa và sau đó cài đặt lại chương trình &#39;Acrobat Reader DC&#39; trên hệ thống của bạn. </p> <p><strong> 1. </strong> Điều hướng đến Windows <strong> Bảng điều khiển </strong> và mở ra <strong> Chương trình và các tính năng </strong> . <br> <strong> 2. </strong> Chọn <strong> Adobe Acrobat Reader DC </strong> và bấm vào <strong> Gỡ cài đặt </strong> Để loại bỏ nó. </p> <p><img src=\"images/image_thumb-9-944.png\" alt=\"fix MSVCP100.dll is Missing \" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Làm theo lời nhắc trên màn hình để xóa Acrobat Reader và sau đó <strong> khởi động lại </strong> bạn máy tính. <br> <strong> 4. </strong> Sau khi khởi động lại, hãy mở trình duyệt Web của bạn và điều hướng đến <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> Trang tải xuống Acrobat Reader DC </a> và nhấp vào <strong> Cài đặt ngay </strong> , để tải xuống và cài đặt phiên bản Acrobat Reader mới nhất cho hệ thống của bạn. </p> <p><img src=\"images/image_thumb-10-958.png\" alt=\"fix MSVCR100.dll is Missing \" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Phương pháp 2. Sửa chữa tất cả các phiên bản của Microsoft Visual C ++ Redistributable Package. </h6> <p> Phương pháp thứ hai để khắc phục sự cố &quot;MSVCR100.dll - MSVCp100.dll lộn xộn&quot;, là sửa chữa tất cả các phiên bản đã cài đặt * của Microsoft Visual C ++ Redistributable Package. ** </p> <p><strong> 1. </strong> Điều hướng đến Windows <strong> Bảng điều khiển </strong> và mở ra <strong> Chương trình và các tính năng </strong> . <br> <strong> 2. </strong> Tìm và sửa chữa từng cái một * tất cả các phiên bản đã cài đặt của &quot;Microsoft Visual C ++ Redistributable Package&quot;. </p> <p> * ví dụ. Chọn &quot;Microsoft Visual C ++ 2013 Redistributable Package (x86)&quot;, nhấp vào <strong> Thay đổi </strong> và sau đó nhấp vào <strong> Sửa chữa </strong> nút r. Khi quá trình sửa chữa hoàn tất, đánh dấu &quot;Microsoft Visual C ++ 2013 Redistributable Package (x64)&quot; và thực hiện các bước tương tự ( <strong> Thay đổi </strong> &gt; <strong> Sửa </strong> ). </p> <p> ** Lưu ý: Nếu bạn không thể tìm thấy (bất kỳ phiên bản nào của) &quot;Microsoft Visual C ++ Redistributable Package&quot; trên các chương trình đã cài đặt, hãy chuyển đến phương pháp-3 bên dưới để cài đặt nó. </p> <p><img src=\"images/image_thumb-11-929.png\" alt=\"Program Can't Start MSVCr100.dll is Missing \" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> 3. </strong> Khi sửa chữa xong, <strong> khởi động lại </strong> máy tính của bạn. </p> <p> </p> <h6> Phương pháp 3. Gỡ cài đặt và cài đặt lại Gói Microsoft Visual C ++ Redistributable mới nhất. </h6> <p> Phương pháp tiếp theo để giải quyết vấn đề &quot;Chương trình không thể bắt đầu vì thiếu MSVCP100.dll&quot;, là xóa tất cả các phiên bản đã cài đặt của Microsoft Visual C ++ Redistributable Package, sau đó tải xuống và cài đặt phiên bản mới nhất. </p> <p><strong> 1. </strong> Điều hướng đến Windows <strong> Bảng điều khiển </strong> và mở ra <strong> Chương trình và các tính năng </strong> . <br> <strong> 2. </strong> Tìm và loại bỏ (từng cái một) tất cả các phiên bản đã cài đặt của &quot;Microsoft Visual C ++ Redistributable Package&quot;. </p> <p><img src=\"images/image_thumb-12-326.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Sau khi gỡ cài đặt, <strong> khởi động lại </strong> máy tính của bạn. <br> <strong> 4. </strong> Sau khi khởi động lại, hãy mở trình duyệt Web của bạn và điều hướng đến <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48145\" target=\"_blank\" rel=\"nofollow noopener\"> Trang tải xuống Visual C ++ Redistributable cho Visual Studio 2015 </a> để tải xuống và cài đặt phiên bản mới nhất của Gói Microsoft Visual C ++ Redistributable. * </p> <p><strong> * Lưu ý quan trọng: </strong> Tải xuống và cài đặt cả hai phiên bản. (&quot;vc_redist.x86.exe&quot; &amp; &quot;vc_redist.x64.exe&quot;) </p> <p> </p> <h6> Phương pháp 4. Sao chép các tệp còn thiếu vào đúng vị trí. </h6> <p> Trong một số trường hợp, sự cố &quot;MSVCR100.dll bị thiếu&quot; và &quot;MSVCP100.dll bị thiếu&quot;, thường xuất hiện sau khi nâng cấp Windows (ví dụ: từ Windows 8.1 lên Windows 10). Trong những trường hợp này, hãy thực hiện các bước sau để giải quyết sự cố của bạn: </p> <p><strong> 1. </strong> Sao chép tệp &quot; <strong> msvcp100.dll </strong> &quot;&amp;&quot; <strong> msvcr100.dll </strong> &quot; từ &quot; <strong> C: \\ Windows.old \\ WINDOWS \\ SysWOW64 </strong> &quot;thư mục vào&quot; <strong> C: \\ Windows \\ SysWOW64 </strong> &quot; thư mục. <br> <strong> 2. </strong> <strong> Khởi động lại </strong> máy tính của bạn. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}