{"title":"Khắc phục: Lỗi Outlook Express 0x800c0133 Do giới hạn kích thước 2GB trong tệp DBX (Đã giải quyết)","content":"<p> Hướng dẫn này chứa các hướng dẫn để sửa lỗi Outlook Express 0x800c0133 do giới hạn kích thước 2GB. Lỗi 0x800c0133 trong OE, xảy ra do một trong các thư mục Outlook vượt quá giới hạn 2GB về kích thước. </p> <p> Mô tả vấn đề giới hạn kích thước .DBX 2GB trong Outlook Express. <br> Khi một trong các thư mục Outlook Express chính (ví dụ: &quot;Hộp thư đến&quot; hoặc &quot;Đã gửi&quot;) vượt quá kích thước 2GB, OE trả về lỗi 0x800c0133 trong hoạt động Gửi / Nhận và đôi khi thư mục OE tương ứng trở nên trống (Bị hỏng). * Ví dụ: nếu thư mục &quot;Hộp thư đến&quot; (Inbox.dbx), vượt quá kích thước 2GB, thì OE không thể nhận email mới và hiển thị lỗi 0x800c0133. </p> <p> * Lưu ý: Nếu một trong các thư mục OE trống, thì tệp DBX liên quan bị hỏng. Trong trường hợp đó, hãy thử khôi phục Email của bạn từ thư mục OE bị hỏng bằng cách làm theo hướng dẫn trong bài viết này: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách khôi phục tệp Outlook Express DBX MIỄN PHÍ </a> . </p> <h4> Cách khắc phục sự cố giới hạn 2GB của Outlook Express (Lỗi gửi / nhận 0x800c0133). </h4> <h6> Bước 1. Bật Chế độ xem tệp ẩn. </h6> <p> 1. Mở Windows Explorer. <br> 2. Từ <strong> Công cụ </strong> menu chọn <strong> Tùy chọn thư mục </strong> . <br> 3. Tại tab View, nhấp vào <strong> Hiển thị các tệp và thư mục ẩn </strong> và bấm vào <strong> ĐỒNG Ý. </strong></p> <p><img src=\"images/image_thumb1_thumb-210.png\" alt=\"image_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Bước 2. Định vị tệp Outlook Express 2GB DBX trên đĩa của bạn. </h6> <p> 1. Mở thư mục cửa hàng Outlook Express. Thường thì thư mục này nằm ở đường dẫn sau trên đĩa của bạn: </p> <ul> <li> C: \\ Documents and Settings \\\\ Local Settings \\ Application Data \\ Identities \\ {} \\ Microsoft \\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> ví dụ. “C: \\ Documents and Settings \\ Admin \\ Local Settings \\ Application Data \\ Identities \\ {D8F3C56D-965E-41AE-8A23-A58460ABAE00} \\ Microsoft \\ <strong> Outlook Express </strong> ” </p></blockquote> <p> 3. Từ Explorer&#39;s <strong> Lượt xem </strong> menu chọn <strong> Chi tiết </strong> . <br> 4. Định vị tệp DBX nào, vượt quá giới hạn lưu trữ 2GB. * </p> <p> * Trong ví dụ này, tệp &quot;Inbox.dbx&quot; vượt quá kích thước 2GB. </p> <p><img src=\"images/image_thumb2_thumb-339.png\" alt=\"FIX Outlook Express Error 0x800c0133\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Bước 3. Di chuyển các Email từ thư mục Thư quá khổ sang thư mục Thư mới. </h6> <p> 1. Mở Outlook Express. <br> 2. Chọn thư mục thư quá khổ (có kích thước trên 2GB, ví dụ: thư mục &quot;Hộp thư đến&quot; tại ví dụ này). <br> 3. Nếu bạn có thể nhìn thấy email của mình trên thư mục đó (thư mục không trống), hãy tiếp tục như sau: * </p> <p> * Lưu ý: Nếu thư mục có vẻ trống (bạn không thấy bất kỳ email nào trên đó), thì thư mục OE (và tệp DBX được liên kết) đã bị hỏng. Trong trường hợp đó, bạn phải khôi phục email của mình từ thư mục DBX bị hỏng bằng cách làm theo các hướng dẫn trong bài viết này. </p> <p> 4. Tại ngăn bên trái, của chương trình OE, nhấp chuột phải vào thư mục quá khổ và chọn <strong> Thư mục mới </strong> (để tạo một thư mục thư mới) </p> <p><img src=\"images/image_thumb-6-403.png\" alt=\"outlook express 2gb limit\" loading=\"lazy\"></p> <p> </p> <p> 5. Nhập tên dễ nhận biết cho thư mục mới theo sau là năm (ví dụ: &quot;Inbox-2016&quot;) </p> <p><img src=\"images/image_thumb-7-434.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Sau đó, từ thư mục quá khổ (ví dụ: từ &quot;Hộp thư đến&quot;), chọn một nhóm email (ví dụ: tất cả các email từ năm 2016) và kéo và thả (di chuyển) chúng vào thư mục Thư mới mà bạn đã tạo trước đó (ví dụ: tới &quot; Hộp thư đến-2016 &quot;). </p> <p><img src=\"images/image_thumb-8-450.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Lặp lại các bước tương tự (ví dụ: tạo các thư mục khác nhau theo năm và di chuyển các thư từ thư mục quá khổ sang thư mục mới). * </p> <p> * Lưu ý: Nếu bạn gặp sự cố trong quá trình di chuyển (ví dụ: nếu bạn không thể di chuyển một số thư sang thư mục mới), thì: </p> <blockquote><p> 1. Đóng Outlook Express. <br> 2. Sao chép (sao lưu) thư mục &quot;Outlook Express&quot; từ vị trí Cửa hàng OE sang một điểm đến khác trên đĩa của bạn. <br> 3. Sau đó, làm theo hướng dẫn ở bước 4 để xóa tệp .dbx quá khổ. <br> 4. Mở Outlook Express. <br> 5. Nhập email từ thư mục sao lưu OE (Từ <strong> Tập tin </strong> menu đi tới -&gt; <strong> Nhập khẩu </strong> <strong> Tin nhắn </strong> -&gt; <strong> Microsoft Outlook Express 6 </strong> -&gt; <strong> Nhập thư từ thư mục lưu trữ OE… </strong> ). ** </p> <p> ** Nếu bạn vẫn gặp sự cố trong khi nhập, hãy làm theo hướng dẫn trong bài viết này để sửa tệp DBX bị hỏng. </p></blockquote> <p> </p> <p> 8. Khi bạn hoàn tất quá trình chuyển email và thư mục 2GB trở nên trống trong email (ví dụ: &quot;Hộp thư đến&quot; trong ví dụ này), hãy tiếp tục bước tiếp theo. </p> <p><img src=\"images/image_thumb-10-811.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Bước 4. Xóa tệp Outlook Express DBX quá khổ khỏi đĩa của bạn. </h6> <p> 1. Mở thư mục lưu trữ Outlook Express trên đĩa của bạn. <br> 2. Xóa tệp DBX quá khổ (ví dụ: &quot;Inbox.dbx&quot; trong ví dụ này). </p> <p><img src=\"images/image_thumb-9-996.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Khởi chạy Outlook Express. <br> 4. OE sẽ tạo (tự động) một thư mục thư sạch và lành mạnh mới để lưu trữ email. * </p> <p> * Lưu ý: Nếu bạn vẫn nhận được lỗi tương tự, hãy thử sửa thư mục OE bị hỏng bằng cách làm theo hướng dẫn trong bài viết này: <a href=\"https://www.repairwin.com/how-to-recover-outlook-express-dbx-file/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách khôi phục tệp Outlook Express DBX MIỄN PHÍ </a> . </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? </p> <p> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}