{"title":"Khắc phục: Adobe Acrobat Reader DC Phiên bản mới hơn đã được cài đặt - Lỗi 1722 (Đã giải quyết)","content":"<p> Sự cố sau đã gặp phải trên máy tính chạy Windows: Không cài đặt được Adobe Acrobat Reader DC vì &quot;Đã cài đặt phiên bản mới hơn&quot;. Điều kỳ lạ với vấn đề này là Adobe Reader DC chưa được cài đặt trên máy vì không tồn tại bất kỳ dấu vết nào của chương trình Adobe Reader hoặc các tệp trên chương trình Add / Remove hoặc trong ổ cứng. </p> <p><img src=\"images/image_thumb-19-522.png\" alt=\"Adobe Acrobat Reader DC Newer Version already installed – Error 1722 - fix\" loading=\"lazy\"></p> <p> </p> <p> Ngoài ra, khi khắc phục sự cố cài đặt &quot;một phiên bản mới đã được cài đặt&quot; của chương trình Adobe Reader DC, thông báo lỗi sau xảy ra khi cố gắng cài đặt chương trình bằng <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Gói Adobe Acrobat Reader DC Distribution </a> : &quot;Lỗi 1722. Đã xảy ra sự cố với gói Windows Installer này. Chương trình chạy như một phần của quá trình thiết lập không hoàn tất như mong đợi. Hãy liên hệ với nhân viên hỗ trợ của bạn hoặc nhà cung cấp gói….&quot; </p> <p><img src=\"images/image_thumb-20-398.png\" alt=\"Acrobat reader Error 1722 There is a problem with this Windows Installer package\" loading=\"lazy\"></p> <p> </p> <p> Hướng dẫn này bao gồm các bước và hướng dẫn chi tiết để giải quyết các lỗi sau khi cài đặt Adobe Reader DC: &quot;Phiên bản mới đã được cài đặt&quot; &amp; &quot;Lỗi 1722. Đã xảy ra sự cố với gói Windows Installer này&quot; trong HĐH Windows 10/8/7. </p> <h4> Cách khắc phục sự cố cài đặt Adobe Acrobat Reader DC: Phiên bản mới hơn đã được cài đặt - Lỗi 1722 Sự cố với gói trình cài đặt. </h4> <h6> Phương pháp 1. Loại bỏ các Sản phẩm Adobe Acrobat bằng Công cụ Acrobat Cleaner. </h6> <p> Bước đầu tiên để khắc phục sự cố cài đặt của Adobe Reader DC, là xóa tất cả các bản cài đặt trước của Adobe Acrobat &amp; Adobe Reader, bằng cách sử dụng <a href=\"https://labs.adobe.com/downloads/acrobatcleaner.html\" target=\"_blank\" rel=\"nofollow noopener\"> Acrobat Reader DC &amp; Adobe Acrobat DC Cleanup tiện ích </a> * và sau đó để cài đặt <a href=\"https://get.adobe.com/reader/\" target=\"_blank\" rel=\"nofollow noopener\"> Adobe Reader DC </a> . </p> <p> * Công cụ Adobe Reader và Acrobat Cleaner được thiết kế để làm sạch các cài đặt bị lỗi của Adobe Acrobat &amp; Adobe Reader, bao gồm việc xóa hoặc sửa các tệp bị hỏng, xóa hoặc thay đổi các mục đăng ký quyền, v.v. </p> <p><img src=\"images/image_thumb-21-370.png\" alt=\"Acrobat Reader DC & Adobe Acrobat DC Cleanup tool\" loading=\"lazy\"></p> <p> </p> <h6></h6> <h6> Phương pháp 2. Chạy Trình gỡ rối cài đặt &amp; gỡ cài đặt chương trình của Microsoft. </h6> <p> 1. Tải xuống <a href=\"https://support.microsoft.com/en-us/help/17588/fix-problems-that-block-programs-from-being-installed-or-removed\" target=\"_blank\" rel=\"nofollow noopener\"> Trình gỡ rối cài đặt &amp; gỡ cài đặt chương trình </a> từ Microsoft. <br> 2. Chạy chương trình đã tải xuống và nhấp vào tiếp theo ở màn hình đầu tiên. <br> 3. Khi được nhắc, hãy nhấp vào <strong> Gỡ cài đặt </strong></p> <p><img src=\"images/image_thumb-22-965.png\" alt=\"Program Install & Uninstall Troubleshooter\" loading=\"lazy\"></p> <p> </p> <p> 4. Chọn <strong> Adobe Acrobat Reader DC </strong> chương trình và chọn <strong> Kế tiếp </strong> . * Sau đó làm theo hướng dẫn trên màn hình để khắc phục sự cố. </p> <p> * Lưu ý: Nếu bạn không thấy &#39;Adobe Acrobat Reader DC&#39; trong danh sách, hãy nhấp vào <strong> Huỷ bỏ </strong> và chạy lại trình khắc phục sự cố. Tuy nhiên, lần này hãy chọn &quot;Cài đặt&quot; khi được nhắc. </p> <p><img src=\"images/image_thumb-23-917.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Phương pháp 3. Cài đặt Adobe Reader bằng Gói trình cài đặt Acrobat Reader DC đầy đủ. </h6> <p> Cố gắng cài đặt Adobe Reader DC bằng cách sử dụng <a href=\"https://get.adobe.com/reader/enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Gói Adobe Acrobat Reader DC Distribution </a> . </p> <p> </p> <h6> Phương pháp 4. Khởi động Dịch vụ Trình cài đặt Windows. </h6> <p> 1. Mở bảng điều khiển Windows Services: Để làm điều đó: </p> <ul> <li> Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-698.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. </li> <li> Trong hộp Tìm kiếm, nhập: <strong> services.msc </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </li> <li> (Chấp nhận cảnh báo UAC nếu xuất hiện). </li> </ul> <p><img src=\"images/image_thumb-12-635.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 2. Trong bảng điều khiển Dịch vụ, nhấp chuột phải vào <strong> Windows Installer s </strong> ervice và nhấp chuột <strong> Khởi đầu </strong> . * </p> <p> * Lưu ý: Nếu dịch vụ được bắt đầu thì hãy nhấp vào <strong> Khởi động lại </strong> . </p> <p><img src=\"images/image_thumb-24-258.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Phương pháp 5. Đăng ký lại Dịch vụ trình cài đặt Windows. </h6> <p> 1. Mở <strong> Command Prompt với tư cách là quản trị viên. <br> </strong> 2. Nhập các lệnh sau theo thứ tự (nhấn Enter sau khi nhập từng lệnh) </p> <ul> <li><strong> msiexec / hủy đăng ký </strong></li> <li><strong> msiexec / regserver </strong></li> </ul> <p><img src=\"images/image_thumb-25-162.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Đóng cửa sổ nhắc lệnh và <strong> khởi động lại </strong> máy tính của bạn. <br> 4. Cố gắng cài đặt Acrobat Reader DC. </p> <p> </p> <h6> Phương pháp 6. Cài đặt Windows Updates và Visual C ++. </h6> <p> 1. Cài đặt tất cả các Bản cập nhật Windows có sẵn. <br> 2. Cài đặt cả hai vesrions x86 &amp; x64 của <a href=\"https://www.microsoft.com/en-in/download/details.aspx?id=40784\" target=\"_blank\" rel=\"nofollow noopener\"> Gói có thể phân phối lại Visual C ++ cho Visual Studio 2013 </a><br> 3. Cài đặt cả hai vesrions x86 &amp; x64 của <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48145\" target=\"_blank\" rel=\"nofollow noopener\"> Gói có thể phân phối lại Visual C ++ cho Visual Studio 2015 </a><br> 4. Cố gắng cài đặt Acrobat Reader DC. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}