{"title":"Khắc phục: Thunderbird không phản hồi hoặc đóng băng. (Đã giải quyết)","content":"<p> Nếu Thunderbird không phản hồi, hãy tiếp tục bên dưới để giải quyết vấn đề. Thunderbird là một ứng dụng email mã nguồn mở phổ biến có sẵn cho tất cả các nền tảng. Nhưng đôi khi Thunderbird ngừng phản hồi hoặc đóng băng trong 4-5 phút trước khi có thể sử dụng lại được. </p> <p><img src=\"images/image_thumb-18-762.png\" alt=\"Thunderbird is not responding or freezing - fix\" loading=\"lazy\"></p> <p> Thunderbird có thể không hoạt động vì những lý do sau: </p> <ul> <li> Chương trình Chống vi-rút có thể ngăn Thunderbird kết nối với Internet. </li> <li> Tính năng Windows Search trong tin nhắn Thunderbird có thể khiến Thunderbird bị treo. </li> <li> Cài đặt Thunderbird hoặc Tiện ích bổ sung có vấn đề. </li> <li> Các tệp lập chỉ mục Thunderbird (tệp MSF) có thể bị hỏng. </li> </ul> <p> Vì Thunderbird có thể không phản hồi vì nhiều lý do, trong hướng dẫn này, chúng tôi sẽ chỉ cho bạn tất cả các cách hiện có để giải quyết vấn đề. </p> <h2> Cách khắc phục: Thunderbird không phản hồi hoặc bị treo trong Windows 10. </h2> <h3> Phương pháp 1. Quét vi-rút máy tính của bạn. </h3> <p><strong> Quan trọng: </strong> Nhiều vi-rút hoặc chương trình độc hại có thể gây ra sự cố với bản cập nhật Windows. Vì vậy, trước khi bạn tiếp tục các bước khắc phục sự cố bên dưới, hãy sử dụng <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Hướng dẫn Quét và Loại bỏ Phần mềm độc hại </a> để kiểm tra và loại bỏ vi-rút hoặc / và các chương trình độc hại có thể đang chạy trên máy tính của bạn. </p> <h3></h3> <h3> Phương pháp 2. Tắt tính năng Tìm kiếm của Windows trong tin nhắn Thunderbird. </h3> <p> 1. Từ menu của Thunderbird, chọn <strong> Công cụ </strong> &gt; <strong> Tùy chọn </strong> . </p> <p> 2. Trong Cài đặt chung, <strong> bỏ chọn </strong> sự lựa chọn <strong> Cho phép Windows Search tìm kiếm thư </strong> . </p> <p><img src=\"images/image_thumb-24-636.png\" alt=\"Disable Windows Search in Thunderbird Messages\" loading=\"lazy\"></p> <p> 3. <strong> Khởi động lại </strong> Chim sấm. </p> <p> </p> <h3> Phương pháp 3. Thêm Thunderbird vào các ngoại lệ Antivirus. </h3> <p> Nếu bạn đang sử dụng phần mềm chống vi-rút của bên thứ ba trên máy của mình, hãy tiếp tục và thêm chương trình thực thi &quot;thunderbird.exe&quot; vào các trường hợp ngoại lệ của chương trình Chống vi-rút của bạn. </p> <p> Ví dụ: nếu bạn sở hữu AVG Antivirus: </p> <p> 1. Đi tới <strong> Thực đơn </strong> &gt; <strong> Cài đặt </strong> . <br> 2 trong <strong> Chung </strong> tab, nhấp vào <strong> Ngoại lệ </strong> &gt; <strong> Thêm ngoại lệ </strong> . <br> 3. Nhấp vào <strong> Duyệt qua </strong> nút và xác định vị trí <strong> Thunderbird.exe </strong> tệp, (hoặc <strong> sao chép </strong> &amp; <strong> dán dòng dưới đây) </strong> và sau đó nhấp vào <strong> Thêm ngoại lệ. * </strong></p> <ul> <li> C: \\ Program Files (x86) \\ Mozilla Thunderbird \\ thunderbird.exe </li> </ul> <p><strong> * Ghi chú: </strong> Nếu sau khi thêm tệp &quot;thunderbird.exe vào ngoại lệ AV của bạn, sự cố vẫn tiếp diễn, <strong> thêm vào </strong> cũng thế <strong> đối với các trường hợp ngoại lệ AV </strong> các <strong> thư mục nơi Thunderbird đã được cài đặt </strong> và <strong> Thư mục hồ sơ Thunderbird </strong> . </p> <p><img src=\"images/image_thumb-19-734.png\" alt=\"add thunderbird to antivirus exceptions\" loading=\"lazy\"></p> <p> </p> <p> </p> <h3> Phương pháp 4. Tắt - Gỡ cài đặt Chương trình Chống vi-rút của bạn. </h3> <p> Vì sự cố &quot;không phản hồi&quot; trong chương trình Thunderbird, thường là do chương trình Chống vi-rút, tôi khuyên bạn nên <strong> vô hiệu hóa </strong> hoặc để <strong> gỡ cài đặt hoàn toàn </strong> chương trình Chống vi-rút của bạn và để xem liệu sự cố vẫn tiếp diễn. </p> <h3></h3> <p> </p> <h3> Phương pháp 5. Khởi động Thunderbird ở Chế độ An toàn. </h3> <p> Thunderbird có thể đóng băng và không phản hồi, nếu một tiện ích mở rộng đã cài đặt gây ra sự cố hoặc bị hỏng. Để khắc phục sự cố với Tiện ích bổ sung của Thunderbird, hãy tiến hành như sau. </p> <p> 1. Nhấn và <strong> giữ lại </strong> các <strong> SHIFT </strong> gõ phím trên bàn phím của bạn và mở <strong> Chim sấm. </strong></p> <p> 2. Tại cửa sổ tiếp theo, hãy nhấp vào <strong> Tiếp tục ở Chế độ An toàn. </strong></p> <p><img src=\"images/image_thumb-21-196.png\" alt=\"Strat Thunderbird in Safe Mode\" loading=\"lazy\"></p> <p> </p> <p> 3. Nếu Thunderbird không đóng băng ở Chế độ An toàn, thì một tiện ích bổ sung đã cài đặt có thể gây ra sự cố. Trong trường hợp này: </p> <ol> <li> Đóng Thunderbird. </li> <li> Nhấn phím SHIFT và khởi động lại Thunderbird. </li> <li> Ở cửa sổ tiếp theo, <strong> kiểm tra </strong> <strong> Tắt tất cả các tiện ích bổ sung </strong> và bấm vào <strong> Thực hiện thay đổi và khởi động lại </strong> . </li> </ol> <p><img src=\"images/image_thumb-22-149.png\" alt=\"Disable Thunderbird add-ons\" loading=\"lazy\"></p> <p> 4. Nếu Thunderbird không phản hồi lại, hãy tiếp tục phương pháp tiếp theo. </p> <h3> Phương pháp 5. Đặt lại Thanh công cụ Thunderbird và các điều khiển. </h3> <p> 1. Nhấn và <strong> giữ lại </strong> các <strong> SHIFT </strong> gõ phím trên bàn phím của bạn và mở <strong> Chim sấm. </strong></p> <p> 2. Tại cửa sổ tiếp theo, hãy chọn <strong> Đặt lại Thanh công cụ và điều khiển </strong> và bấm vào <strong> Thực hiện thay đổi và khởi động lại. </strong></p> <p><img src=\"images/image_thumb-23-344.png\" alt=\"Reset Thunderbird Toolbars\" loading=\"lazy\"></p> <p> </p> <h3> Phương pháp 6. Xóa các tệp Chỉ mục của Thunderbird (.msf). </h3> <p> Trong một số trường hợp, Thunderbird bị đóng băng do các tệp lập chỉ mục (còn gọi là tệp MSF), bị hỏng. Vì vậy, phương pháp cuối cùng để giải quyết vấn đề &quot;Thunderbird không phản hồi&quot; là xóa các tệp .MSF. * </p> <p><strong> * QUAN TRỌNG: </strong> Mặc dù các tệp MSF (Tệp Tóm tắt Thư) có thể được xóa một cách an toàn vì chúng chỉ chứa tiêu đề email và trạng thái email (đã đọc, chưa đọc, v.v.), chứ không phải email thực, bạn nên <a href=\"https://www.repairwin.com/how-to-transfer-thunderbird-email-and-settings-to-a-new-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> sao lưu thư mục hồ sơ Thunderbird </a> trước khi xóa các tệp MSF. </p> <p><strong> Bước 1. Đóng Thunderbird. </strong></p> <p><strong> Bước 2. Bật chế độ xem Tệp ẩn. </strong></p> <p> 1. Điều hướng đến Windows <strong> Bảng điều khiển </strong> và mở <strong> Tùy chọn thư mục </strong> . (hoặc là <strong> Tùy chọn trình khám phá tệp </strong> trong Windows 10). </p> <p> 2. Chọn <strong> Lượt xem </strong> và bên dưới <strong> &#39;Các tập tin và thư mục ẩn&#39; </strong> phần, <strong> kiểm tra </strong> các <strong> Hiển thị các tệp, thư mục và ổ đĩa ẩn </strong> tùy chọn và nhấp vào <strong> ĐỒNG Ý. </strong></p> <p><img src=\"images/image_thumb-34-553.png\" alt=\"Show Hidden files\" loading=\"lazy\"></p> <p> </p> <p><strong> Bước 3. Xóa các tệp .MSF </strong></p> <p> 1. Điều hướng đến thư mục hồ sơ Thunderbird trên đĩa của bạn và mở <strong> Thư </strong> thư mục: * </p> <ul> <li> C: \\ Users \\ username \\ AppData \\ Roaming \\ Thunderbird \\ Profiles \\ ProfileName <strong> .default \\ Mail </strong></li> </ul> <p> * Trong đó tên người dùng là tên người dùng Windows của bạn và ProfileName là tên hồ sơ Mozilla mà trong đó các email được lưu trữ. </p> <p> 2. Bây giờ khám phá tất cả các thư mục chứa bên trong <strong> Thư </strong> để xem thư mục nào chứa các tệp .msf. (trong cài đặt mặc định, chỉ với một tài khoản email, các tệp MSF được đặt trong thư mục &quot;Thư mục Cục bộ&quot;. </p> <p> 3. <strong> Xóa bỏ </strong> tất cả <strong> .msf </strong> tệp, hoặc -tốt hơn- <strong> di chuyển </strong> chúng vào một thư mục (mới) trên màn hình của bạn. </p> <p><img src=\"images/image_thumb-25-355.png\" alt=\"Delete Thunderbird MSF files\" loading=\"lazy\"></p> <p> 4. Khi hoàn tất, hãy mở Thunderbird và đợi Thunderbird tạo lại các tệp lập chỉ mục (tệp MSF). </p> <p> Đó là tất cả mọi người! Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}