{"title":"Khắc phục: Lỗi nâng cấp Windows 10 0XC1900101 - 0x20017. Cài đặt không thành công trong giai đoạn SAFE_OS trong quá trình hoạt động BOOT.","content":"<p> </p><div id=\"body\" class=\"clearfix\"> <div id=\"layout\" class=\"pagewidth clearfix\"> <div id=\"content\" class=\"clearfix\"> <div id=\"loops-wrapper\" class=\"loops-wrapper sidebar1 list-thumb-image\"> <div class=\"post-content\"> <div class=\"entry-content\"> <div id=\"8817bc62-7927-473e-ae46-7000d673a519\" class=\"postBody\"> <p> Hướng dẫn này chứa các hướng dẫn để khắc phục Lỗi nâng cấp Windows 10 0XC1900101 - 0x20017: &quot;Cài đặt không thành công trong giai đoạn SAFE_OS với lỗi trong quá trình hoạt động BOOT&quot;. Lỗi 0XC1900101 - 0x20017 có thể xuất hiện khi cập nhật Windows 10 lên bản dựng mới nhất hoặc khi bạn nâng cấp hệ thống của mình từ Windows 7 hoặc 8 lên Windows 10. Khi xảy ra lỗi, quá trình nâng cấp sẽ dừng lại và sau đó hệ thống trở lại phiên bản trước đó của Windows. </p> </div> </div> </div> </div> </div> </div> </div>  <p><img src=\"images/image_thumb-68-870.png\" alt=\"fix Windows 10 Update Error 0XC1900101 – 0x20017\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cách khắc phục lỗi cập nhật Windows 10 0XC1900101 - 0x20017 &quot;Cài đặt không thành công trong giai đoạn SAFE_OS với lỗi trong hoạt động BOOT&quot; </h4> <p> Thông thường, lỗi cập nhật 0XC1900101 - 0x20017 trong Windows 10, cho biết sự cố với trình điều khiển thiết bị và trong hầu hết các trường hợp với trình điều khiển của bộ điều hợp mạng. Vì vậy, trước khi bạn tiếp tục áp dụng các phương pháp bên dưới, hãy kiểm tra và thử những cách sau: </p> <p> 1. Trước hết, hãy đảm bảo rằng cài đặt Ngày &amp; Giờ là chính xác. <br> 2. Sau đó, đảm bảo rằng bạn có đủ dung lượng trống. Thiết bị của bạn yêu cầu ít nhất 20GB dung lượng trống để nâng cấp HĐH 32 bit hoặc 32GB đối với HĐH 64 bit. Để giải phóng dung lượng ổ đĩa, sử dụng <a href=\"https://www.repairwin.com/how-to-use-disk-cleanup-to-delete-useless-files-on-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Dọn dẹp đĩa </a> . <br> 3. Cài đặt trình điều khiển mới nhất cho tất cả các thiết bị trên hệ thống của bạn, đặc biệt là cho Ethernet &amp; Bộ điều hợp không dây (nếu có). * <br> 4. Tạm thời gỡ cài đặt bất kỳ phần mềm bảo mật nào không phải của Microsoft (Antivirus, Tường lửa). <br> 5. Tắt Mã hóa Ổ cứng (Nếu được bật). <br> 6. Sau khi khởi động lại hệ thống đầu tiên và trước khi khởi động Windows: </p> <p> </p><div id=\"body\" class=\"clearfix\"> <div id=\"layout\" class=\"pagewidth clearfix\"> <div id=\"content\" class=\"clearfix\"> <div id=\"loops-wrapper\" class=\"loops-wrapper sidebar1 list-thumb-image\"> <div class=\"post-content\"> <div class=\"entry-content\"> <div id=\"8817bc62-7927-473e-ae46-7000d673a519\" class=\"postBody\"> <blockquote><p> a. Ngắt kết nối bất kỳ thiết bị bên ngoài nào không cần thiết trong quá trình cài đặt (ví dụ: ổ USB, Máy in, v.v.). <br> b. Tắt Bộ điều hợp không dây và Bluetooth khỏi cài đặt BIOS. </p></blockquote> <p><strong> * Ghi chú: </strong> Nếu sau khi áp dụng tất cả các đề xuất trên và các phương pháp bên dưới, cài đặt Windows 10 Update vẫn không thành công, hãy tiếp tục và cập nhật BIOS (Phần vững) trên hệ thống của bạn. </p> </div> </div> </div> </div> </div> </div> </div>  <p> </p> <h6> Phương pháp 1. <strong> Tắt khởi động an toàn. </strong></h6> <p> 1. Bật nguồn hệ thống của bạn và nhấn phím tương ứng * để truy cập <strong> THIẾT LẬP BIOS. </strong></p> <p> * Lưu ý: Thông thường để vào BIOS, bạn phải nhấn nút <strong> DEL </strong> hoặc là <strong> F1 </strong> hoặc là <strong> F2 </strong> hoặc là <strong> F10 </strong> Chìa khóa. (phụ thuộc vào nhà sản xuất) </p> <p> 2. Nhìn vào <strong> Bảo vệ </strong> hoặc tại <strong> Tùy chọn khởi động </strong> cài đặt, * để tìm <strong> Khởi động an toàn </strong> tùy chọn và <strong> Vô hiệu hóa </strong> nó <strong> . </strong></p> <p> * Lưu ý: Vị trí của cài đặt &#39;Khởi động an toàn&#39; trong BIOS, tùy thuộc vào nhà sản xuất thiết bị. </p> <p> 3. <strong> Tiết kiệm </strong> cài đặt và <strong> LỐI RA </strong> Thiết lập BIOS. <br> 4. Để Windows khởi động bình thường và thử cài đặt bản cập nhật. Nếu cập nhật không thành công một lần nữa, hãy tiếp tục phương pháp tiếp theo. </p> <h6></h6> <h6> Phương pháp 2. Chạy Trình gỡ rối Windows Update. </h6> <p> Phương pháp đầu tiên để khắc phục lỗi cập nhật Windows 10 0XC1900101 - 0x20017 là chạy Trình gỡ rối Windows Update. </p> <p> 1. Điều hướng đến Windows <strong> Bảng điều khiển </strong> , đặt &#39;View By&#39; thành <strong> Biểu tượng nhỏ </strong> và mở ra <strong> Xử lý sự cố. </strong></p> <p><img src=\"images/image_thumb-5-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Trong tùy chọn Khắc phục sự cố, hãy nhấp vào <strong> Khắc phục sự cố với Windows Update. </strong></p> <p><img src=\"images/image_thumb-9-899.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Nhấp vào <strong> Kế tiếp </strong> để khắc phục sự cố cập nhật Windows. </p> <p><img src=\"images/image_thumb-8-236.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Khi quá trình khắc phục sự cố hoàn tất, <strong> đóng </strong> trình gỡ rối và <strong> khởi động lại </strong> PC của bạn. <br> 6. Kiểm tra các bản cập nhật. </p> <h6></h6> <h6> Phương pháp 3. <strong> Xóa Thư mục Phân phối Phần mềm. </strong></h6> <p> “C: \\ Windows \\ SoftwareDistribution”, là vị trí mà Windows lưu trữ các Bản cập nhật Windows. Nhiều khi thư mục này bị hỏng và bạn phải tạo lại nó để tải xuống các bản cập nhật và cài đặt từ đầu. Để xây dựng lại (tạo lại) thư mục “SoftwareDistribution”, hãy làm theo các bước bên dưới: </p> <p><strong> Bước 1: Dừng Dịch vụ Cập nhật Windows. </strong></p> <p> 1. Mở bảng điều khiển Windows Services: Để làm điều đó: </p> <ul> <li> Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-515.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. </li> <li> Trong hộp Tìm kiếm, nhập: <strong><em> services.msc </em></strong> &amp; nhấp chuột <strong> đồng ý </strong> . </li> <li> (Chấp nhận cảnh báo UAC nếu xuất hiện). </li> </ul> <p><img src=\"images/image_thumb-12-902.png\" alt=\"services\" loading=\"lazy\"></p> <p> 2. Trong bảng điều khiển Dịch vụ, xác định vị trí <strong><em> cập nhật hệ điều hành Window </em></strong> dịch vụ. <br> 3. Nhấp chuột phải vào <strong> cập nhật hệ điều hành Window </strong> dịch vụ và chọn “ <strong> Dừng lại </strong> ”. </p> <p><img src=\"images/image_thumb-9-281.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Bước 2: Xóa thư mục SoftwareDistribution. </strong></p> <p> 1. Mở Windows Explorer và điều hướng đến: <strong> C: \\ Windows </strong> thư mục. <br> 2. Tìm và <strong> Xóa bỏ </strong> các &quot; <strong><em> Phân phối phần mềm </em></strong> ”(Hoặc đổi tên nó. Ví dụ: thành“ SoftwareDistributionOLD ”). </p> <p><img src=\"images/image_thumb-10-498.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p><strong> Bước 3: Khởi động Windows Update Service. </strong></p> <p> 1. Mở bảng điều khiển Windows Services. <br> 2. Nhấp chuột phải vào <strong> cập nhật hệ điều hành Window </strong> dịch vụ và chọn “ <strong> Khởi đầu </strong> ”. </p> <p><img src=\"images/image_thumb-11-792.png\" alt=\"start windows update service\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Bước 4: Kiểm tra và cài đặt Windows 10 Update. </strong></p> <p> 1. Điều hướng đến <strong> Cài đặt </strong> -&gt; <strong> Cập nhật và bảo mật </strong> và bấm vào <strong> Kiểm tra cập nhật </strong> . </p> <p> </p> <h6> Phương pháp 4. Tắt Công nghệ ảo hóa Intel. </h6> <p> Trong một số trường hợp, lỗi cập nhật Windows 10 0XC1900101 - 0x20017, xuất hiện nếu Công nghệ ảo Intel được bật trên hệ thống của bạn. Vì vậy, hãy tiếp tục và tắt công nghệ Intel_VT từ cài đặt Bios. Để làm việc đó: </p> <p> 1. Nhập cài đặt BIOS. <br> 2. <strong> Vô hiệu hóa </strong> các <strong> Intel </strong> <strong> VT-d </strong> các tính năng trong <strong> Nâng cao </strong> cài đặt -&gt; <strong> Chipset </strong> . <br> 3. <strong> Lưu và thoát </strong> từ cài đặt BIOS. <br> 4. Cố gắng cài đặt bản cập nhật. </p> <p> </p> <h6> Phương pháp 5. Sửa chữa Windows 10. </h6> <p> Phương pháp cuối cùng để giải quyết sự cố cài đặt Windows 10 Update là <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> sửa chữa Windows 10 với Nâng cấp Tại chỗ </a> . </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}