{"title":"Khắc phục: Sử dụng CPU cao DWM.EXE trong khi kết nối thông qua RDP trong Windows 10 (Đã giải quyết)","content":"<p> Sự cố sau có thể xuất hiện trên máy tính chạy Windows 10, trong khi các ứng dụng khách khác được kết nối với nó, thông qua RDP (Kết nối Máy tính Từ xa): Quá trình &quot;DWM.EXE&quot;, gây ra việc sử dụng CPU cao trên máy chủ từ xa hoặc gặp sự cố và chấm dứt phiên máy tính từ xa. Sự cố thường xuất hiện nếu máy chủ để bàn từ xa, chạy Windows 10 v1903 và sở hữu bộ điều hợp hiển thị dựa trên Intel (GPU). </p> <p><img src=\"images/image_thumb-35-158.png\" alt=\"FIX: Event 1000, Application error dwm.exe\" loading=\"lazy\"></p> <p> </p> <p> Chi tiết vấn đề: Khi máy khách được kết nối qua RDP với máy chủ Windows 10 (đích), máy chủ sẽ ngắt kết nối máy khách từ xa vì quá trình Trình quản lý Windows trên máy tính để bàn (dwm.exe) sử dụng 100% CPU. Khi sự cố xảy ra, sự kiện sau được ghi lại trong Trình xem sự kiện: </p> <p><em> &quot;Tên ứng dụng bị lỗi: dwm.exe, phiên bản: 10.0.17134.1, dấu thời gian: 0xf5178e97 <br> Tên mô-đun lỗi: không xác định, phiên bản: 0.0.0.0, dấu thời gian: 0x00000000 <br> Mã ngoại lệ: 0x8898009b <br> Bù lỗi: 0x0000000000000000 <br> Id quy trình lỗi: 0x3a8 <br> Thời gian bắt đầu ứng dụng bị lỗi: 0x01d51ae025b941b3 <br> Đường dẫn ứng dụng bị lỗi: C: \\ WINDOWS \\ system32 \\ dwm.exe <br> Đường dẫn mô-đun bị lỗi: không xác định <br> Id báo cáo: fba8573a-ee4e-4430-b40c-3627888dbfd9 &quot; </em></p> <p> </p> <p> Hướng dẫn này bao gồm các hướng dẫn để giải quyết việc sử dụng DWM.EXE High CPU trên máy tính Windows 10 máy chủ từ xa, sau khi kết nối với máy tính để bàn từ xa (RDP). </p> <h4> Cách sửa lỗi DWM.EXE Sử dụng CPU cao trên máy chủ Windows 10 Máy tính Từ xa. </h4> <p> Để giải quyết tình trạng CPU cao DWM.EXE, hãy áp dụng hướng dẫn về các phương pháp sau cho máy tính Windows 10 mà bạn kết nối qua kết nối máy tính để bàn từ xa (Máy tính chủ): </p> <h6> Phương pháp 1. Buộc kết nối máy tính từ xa để sử dụng trình điều khiển hiển thị đồ họa XDDM. </h6> <p> 1. Nhấn đồng thời Windows <img src=\"images/image_thumb36-341.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại <strong> gpedit.msc </strong> &amp; Nhấn <strong> Đi vào. </strong></p> <p><img src=\"images/image_thumb-78-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Ở ngăn bên trái, điều hướng đến: </p> <ul> <li><strong> cấu hình máy tính </strong> &gt; <strong> mẫu hành chính </strong> &gt; <strong> Các thành phần Windows </strong> &gt; <strong> Dịch vụ Máy tính Từ xa </strong> &gt; <strong> Máy chủ phiên máy tính từ xa </strong> &gt; <strong> Môi trường phiên từ xa </strong></li> </ul> <p> 4. Tại ngăn bên phải, nhấp đúp vào <strong> Sử dụng trình điều khiển hiển thị đồ họa WDDM cho Kết nối Máy tính Từ xa </strong></p> <p><img src=\"images/image_thumb-24-327.png\" alt=\"FIX: DWM.EXE High CPU Usage while using RDP \" loading=\"lazy\"></p> <p> </p> <p> 5. Đặt cài đặt chính thể thành <strong> Tàn tật </strong> và bấm vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-25-498.png\" alt=\"FIX: DWM.EXE High CPU Usage while connecting through RDP in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Đóng trình chỉnh sửa chính sách nhóm và <strong> khởi động lại </strong> máy tính. </p> <p> </p> <p> </p> <h6> Phương pháp 2. Cài đặt Trình điều khiển Hiển thị Cơ bản của Microsoft. </h6> <p> 1. Điều hướng đến Trình quản lý thiết bị. Để làm việc đó: </p> <blockquote><p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-301.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại: <strong> devmgmt.msc </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-26-428.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> </p> <p> 2. Mở rộng <strong> Bộ điều hợp hiển thị </strong> . <br> 3. Nhấp chuột phải vào bộ điều hợp hiển thị đã cài đặt và chọn <strong> Tính chất </strong> . <br> 4. Chọn <strong> Người lái xe </strong> tab và sau đó nhấp vào <strong> Cập nhật driver </strong> . </p> <p><img src=\"images/image_thumb-27-371.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Nhấp vào <strong> Duyệt máy tính của tôi để tìm phần mềm trình điều khiển </strong> . </p> <p><img src=\"images/image_thumb-28-269.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Chọn <strong> Hãy để tôi chọn từ danh sách các trình điều khiển có sẵn trên máy tính của tôi </strong> . </p> <p><img src=\"images/image_thumb-29-401.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Chọn <strong> Bộ điều hợp hiển thị cơ bản của Microsoft </strong> và bấm vào <strong> Kế tiếp </strong> . </p> <p><img src=\"images/image_thumb-30-520.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Khi quá trình cài đặt hoàn tất, hãy đóng tất cả các cửa sổ đang mở và bạn đã hoàn tất. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trong các mạng xã hội để giúp lan truyền về vấn đề này. </p>"}