{"title":"Khắc phục: Outlook nhận được báo cáo lỗi 0x80042108 (Đã giải quyết)","content":"<p> Hướng dẫn này bao gồm các hướng dẫn từng bước để khắc phục lỗi Outlook nhận được báo cáo 0x80042108. Lỗi Outlook 0x80042108 thường xảy ra khi bạn nhập sai tên của máy chủ email POP3 hoặc do bạn không có quyền truy cập Internet. </p> <p> Vấn đề là chi tiết. Outlook 2003, 2007, 2010 hoặc Outlook 2013, hiển thị lỗi sau trong quy trình Gửi-Nhận: &quot;Lỗi Nhận được Báo cáo (0x80042108): Outlook không thể kết nối với máy chủ email đến (POP3) của bạn. Nếu bạn tiếp tục nhận được thông báo này , hãy liên hệ với quản trị viên máy chủ của bạn hoặc nhà cung cấp dịch vụ Internet (ISP) &quot;. </p> <p><img src=\"images/outlookerror_0x80042108-505.png\" alt=\"Outlook Error 0x80042108\" loading=\"lazy\"></p> <p> Lỗi Outlook &quot;0x80042108&quot; có thể xảy ra trong bất kỳ phiên bản nào của Outlook (2016, 2013, 2010 hoặc 2007) và xuất hiện khi chương trình ứng dụng email Outlook không thể kết nối với máy chủ email. </p> <h4> Cách sửa lỗi 0x80042108 trong Outlook 2007, 2010, 2013 hoặc 2016. </h4> <h6> Bước 1. Kiểm tra kết nối Internet của bạn. </h6> <p> Bước đầu tiên để giải quyết lỗi nhận Outlook 80042108 là kiểm tra kết nối Internet của bạn. Vì vậy, hãy mở trình duyệt Internet của bạn và truy cập bất kỳ trang web nào để đảm bảo rằng kết nối Internet của bạn đang hoạt động. </p> <h6> Bước 2. Xác minh cài đặt Máy chủ Thư POP3. </h6> <p> Bước thứ hai để khắc phục lỗi nhận Outlook 0x80042108, là kiểm tra xem bạn đã chỉ định đúng cài đặt máy chủ email chưa. Vì vậy, hãy liên hệ với nhà cung cấp Email của bạn và xác minh với họ rằng bạn đã nhập chính xác Tên máy chủ thư đến và số Cổng. Để xem và sửa đổi cài đặt máy chủ email: </p> <p> 1. Mở Outlook. <br> 2. Đi tới <strong> Tập tin </strong> -&gt; <strong> Cài đặt tài khoản </strong> . </p> <p><img src=\"images/image_thumb-7-811.png\" alt=\"switch Account Mail Merge \" loading=\"lazy\"></p> <p> </p> <p> 3 trong <strong> E-mail </strong> , nhấp đúp vào tài khoản email của bạn, để sửa đổi / xem cài đặt của nó. <br> 4. Xác minh rằng bạn đã đặt đúng tên Máy chủ Thư đến tại hộp tương ứng. <br> 5. Khi hoàn tất, hãy nhấp vào <strong> Cài đặt khác </strong> . </p> <p><img src=\"images/image_thumb-31-256.png\" alt=\"FIX: Outlook Receiving reported error 0x80042108\" loading=\"lazy\"></p> <blockquote><p> </p></blockquote> <p> 6. Nhấp vào <strong> Nâng cao </strong> và xác minh rằng bạn đã chỉ định đúng cổng và cài đặt SSL cho máy chủ Đến (POP3). </p> <p> </p> <p><img src=\"images/image_thumb-33-400.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Khi hoàn tất, hãy nhấp vào <strong> đồng ý </strong> và sau đó đóng tất cả các cửa sổ đang mở. <br> 7. Kiểm tra lại Outlook. </p> <h6></h6> <h6> Bước 3. Kiểm tra cài đặt Chống vi-rút &amp; Tường lửa của bạn. </h6> <p> Nếu bạn đang sử dụng một chương trình chống vi-rút có tính năng quét email, thì <a href=\"https://www.repairwin.com/how-to-disable-add-ins-in-word-outlook-or-excel-2016-2013-2010-2007-or-2003/\" target=\"_blank\" rel=\"nofollow noopener\"> vô hiệu hóa Phần bổ trợ chống vi-rút trong Outlook </a> hoặc tạm thời vô hiệu hóa tính năng Bảo vệ chống vi-rút hoặc gỡ cài đặt chương trình Chống vi-rút. Ngoài ra, hãy kiểm tra cài đặt Tường lửa của bạn và đảm bảo rằng các cổng máy chủ email mà bạn đang sử dụng không bị chặn khỏi chương trình Tường lửa. Cụ thể hơn, tại cài đặt Tường lửa của bạn: </p> <p> A. Cho phép các tệp sau để truy cập Internet: </p> <p> </p> <ul> <li><strong> Outlook.exe </strong></li> </ul> <p> B. Bật các cổng sau để truy cập Internet: </p> <ul> <li><strong> Cổng 110 </strong> (Nếu bạn đang sử dụng Máy chủ Thư đến POP3 mà không có kết nối được mã hóa) * </li> <li><strong> Cổng 995 </strong> (Nếu bạn đang sử dụng Máy chủ Thư đến POP3 có kết nối được mã hóa (Đã bật SSL) </li> </ul> <ul> <li><strong> Cổng 143 </strong> (nếu bạn đang sử dụng Máy chủ Thư đến IMAP mà không có kết nối được mã hóa) </li> <li><strong> Cổng 993 </strong> (nếu bạn đang sử dụng Máy chủ Thư đến IMAP với kết nối được mã hóa (Đã bật SSL) </li> </ul> <ul> <li><strong> Cổng 25 </strong> Nếu máy chủ Thư đi SMTP của bạn không sử dụng SSL. * </li> <li><strong> Cổng 465 </strong> hoặc là <strong> 587 </strong> nếu máy chủ Thư đi SMTP của bạn sử dụng SSL </li> </ul> <p> * Lưu ý: Theo mặc định, cổng 25 dành cho truy cập đi và cổng 110 dành cho truy cập đến. Nếu bạn không chắc chắn về các cổng, hãy liên hệ với ISP hoặc quản trị viên hệ thống của bạn. </p> <p> </p> <p><strong> Trợ giúp bổ sung: </strong> Nếu các phương pháp trên không hữu ích cho bạn, hãy thử các cách sau: </p> <p><strong> A. </strong> Xóa và Thêm lại tài khoản Email của bạn. <br> <strong> B. </strong><a href=\"https://www.repairwin.com/how-to-use-scanpst-exe-inbox-repair-tool-to-repair-outlook-pst-data-files/\" target=\"_blank\" rel=\"nofollow noopener\"> Sửa chữa tệp dữ liệu Outlook PST </a> . <br> <strong> C. </strong> Ngắt kết nối khỏi Kết nối VPN (nếu bạn đã kết nối với) <br> <strong> D. </strong> Sửa chữa Cài đặt Văn phòng. Để làm việc đó: </p> <blockquote><p> 1. Điều hướng đến Windows <strong> Bảng điều khiển </strong> &gt; <strong> Chương trình và các tính năng </strong> . <br> 2. Định vị và chọn ứng dụng MS Office, sau đó nhấp vào <strong> Thay đổi </strong> . <br> 3. Sau đó chọn <strong> Sửa </strong> Lựa chọn. </p></blockquote> <p> </p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? </p> <p> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}