{"title":"Khắc phục: Vấn đề sử dụng CPU cao của Chrome (Đã giải quyết)","content":"<p> Nếu hệ thống của bạn hoạt động với mức sử dụng CPU cao khi bạn mở Chrome, thì có thể một tiện ích mở rộng Chrome đã cài đặt hoặc một chương trình phần mềm độc hại là thủ phạm. Để dễ dàng khắc phục sự cố sử dụng CPU cao trên Google Chrome, hãy làm theo các bước bên dưới. </p> <p><img src=\"images/image_thumb-46-593.png\" alt=\"FIX Chrome High CPU Usage\" loading=\"lazy\"></p> <p> </p> <h4> Cách khắc phục tình trạng sử dụng CPU cao trong Google Chrome. </h4> <h6> Bước 1. Quét máy tính của bạn để tìm Phần mềm độc hại và Vi rút. </h6> <p> Bước đầu tiên trước khi khắc phục lỗi &quot;ERR_CONNECTION_CLOSED&quot; trong Chrome, là đảm bảo rằng hệ thống của bạn không có vi rút / phần mềm độc hại. Đối với nhiệm vụ đó, hãy làm theo hướng dẫn trong hướng dẫn này: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách quét vi rút và các chương trình độc hại khác trên máy tính của bạn. </a></p> <p> </p> <h6> Bước 2. Tắt các Tiện ích mở rộng không mong muốn của Chrome. </h6> <p> 1. Từ menu của Chrome <img src=\"images/image_thumb-47-125.png\" alt=\"image\" loading=\"lazy\"> , đi đến <strong> Thêm công cụ </strong> -&gt; <strong> Tiện ích mở rộng </strong></p> <p><img src=\"images/image_thumb-51-680.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Xóa (hoặc vô hiệu hóa) bất kỳ tiện ích mở rộng nào mà bạn không cần hoặc bạn không nhận ra. </p> <p><img src=\"images/image_thumb-49-396.png\" alt=\"disable - remove chrome extension\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Khởi động lại </strong> Google Chrome và xem sự cố sử dụng CPU cao khi chạy Chrome đã được giải quyết chưa. Nếu sự cố vẫn tiếp diễn, hãy tắt hoặc - tốt hơn - hãy xóa tất cả các tiện ích mở rộng đã cài đặt và khởi động lại Chrome. </p> <p> </p> <h6> Bước 3. Tạo hồ sơ Chrome mới. </h6> <p> 1. <strong> Đóng </strong> Trình duyệt Chrome. <br> 2. Điều hướng đến vị trí bên dưới (theo hệ điều hành của bạn). </p> <blockquote><p> A. Nếu bạn sử dụng <strong> Windows 10, 8, 7 </strong> hoặc là <strong> Vista </strong> hướng đến: </p> <ul> <li><strong> C: \\ Users \\% Username% \\ AppData \\ Local \\ Google \\ Chrome \\ </strong></li> </ul> <p> </p> <p> * ví dụ. Nếu tên người dùng của bạn là “User1” thì thư mục hồ sơ Chrome &quot; <strong> Dữ liệu người dùng </strong> &quot;, được lưu trữ tại&quot; C: \\ Users \\ User1 \\ AppData \\ Local \\ Google \\ Chrome \\ <strong> Dữ liệu người dùng </strong> &quot; </p> <p> B. Nếu bạn sử dụng <strong> Windows XP </strong> hướng đến <strong> : </strong></p> <ul> <li><strong> C: \\ Documents and Settings \\\\% Username% \\ Local Settings \\ Application Data \\ Google \\ Chrome \\ </strong></li> </ul> <p> * ví dụ. ‘Nếu tên người dùng của bạn là“ User1 ”thì thư mục hồ sơ Chrome&quot; <strong> Dữ liệu người dùng </strong> &quot;được lưu trữ tại&quot; C: \\ Documents and Settings \\ User1 \\ Local Settings \\ Application Data \\ Google \\ Chrome \\ <strong> Dữ liệu người dùng&quot; </strong></p></blockquote> <p> 3. <strong> Đổi tên </strong> các &quot; <strong> Dữ liệu người dùng </strong> &quot;thư mục vào&quot; <strong> Dữ liệu người dùng.OLD </strong> &quot;. </p> <p><img src=\"images/image_thumb-50-745.png\" alt=\"create new chrome profile\" loading=\"lazy\"></p> <p> 4. Mở Google Chrome và kiểm tra xem sự cố vẫn tiếp diễn. Nếu Chrome hoạt động bình thường * và không khiến CPU chạy ở mức cao, hãy đóng Chrome và sao chép tệp &quot;Dấu trang&quot; từ thư mục &quot;User Data.OLD \\ Default&quot; vào thư mục &quot; <strong> Dữ liệu người dùng \\ Mặc định </strong> \\ &quot;thư mục, để khôi phục dấu trang của bạn. </p> <p> * Lưu ý: Nếu Google Chrome vẫn khiến CPU hoạt động ở mức 100% thì <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> gỡ cài đặt hoàn toàn và cài đặt lại Chrome. </a></p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}