{"title":"Khắc phục: Sự cố Back Wallpaper trong Windows 7 (Đã giải quyết)","content":"<p> Hướng dẫn này chứa các hướng dẫn để khắc phục sự cố Hình nền màu đen khi hình nền được đặt thành &#39;Kéo dài&#39; trong Hệ điều hành Windows 7. Sự cố Hình nền màu đen, có thể xuất hiện trong máy tính chạy Windows 7 sau khi cài đặt bản cập nhật ngày 14 tháng 1 năm 2020 — KB4534310. </p> <p><img src=\"images/image_thumb-16-423.png\" alt=\"FIX: Back Wallpaper issue in Windows 7\" loading=\"lazy\"></p> <p> Sự cố nền đen của Windows 7, là một lỗi đã biết sau khi cài đặt <a href=\"http://www.catalog.update.microsoft.com/Search.aspx?q=KB4534310\" target=\"_blank\" rel=\"nofollow noopener\"> cập nhật KB4534310 </a> và với tư cách là Microsoft <a href=\"https://support.microsoft.com/en-us/help/4534310/windows-7-update-kb4534310\" target=\"_blank\" rel=\"nofollow noopener\"> nói </a> : &quot;Chúng tôi đang nghiên cứu giải pháp và sẽ cung cấp bản cập nhật trong bản phát hành sắp tới, bản cập nhật này sẽ được phát hành cho tất cả khách hàng đang chạy Windows 7 và Windows Server 2008 R2 SP1.&quot; </p> <p> Nếu bạn muốn giải quyết vấn đề &quot;hình nền đen&quot;, cho đến khi Microsoft phát hành bản cập nhật để khắc phục, hãy làm theo hướng dẫn bên dưới. </p> <h4> Cách khắc phục sự cố Hình nền đen trong Windows 7. </h4> <h6> Phương pháp 1. Gỡ cài đặt bản cập nhật KB4534310. </h6> <p> Phương pháp đầu tiên để khắc phục sự cố hình nền màu đen trong Windows 7 là xóa bản cập nhật KB4534310. * </p> <p> * Lưu ý: Vì bản cập nhật KB4534310, bao gồm các bản sửa lỗi và nâng cao bảo mật cho Windows 7, bạn không nên gỡ cài đặt nó. Vì vậy, chúng tôi khuyên bạn nên khắc phục sự cố bằng cách làm theo các hướng dẫn tại <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Phương pháp-2 </a> phía dưới. </p> <p> Để gỡ cài đặt bản cập nhật KB4534310: </p> <p> 1. Nhấp chuột phải vào <strong> Khởi đầu </strong> thực đơn <img src=\"images/image_thumb-38-451.png\" alt=\"image\" loading=\"lazy\"> và lựa chọn <strong> Bảng điều khiển </strong> . <br> 2. Đặt <strong> Xem Theo: đến các biểu tượng Nhỏ </strong> và bấm vào <strong> Tính năng chương trình. </strong></p> <p><img src=\"images/image_thumb-51-750.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 3. Nhấp vào <strong> Xem các bản cập nhật đã cài đặt </strong> trên ngăn bên trái. </p> <p> </p> <p><img src=\"images/image_thumb-52-942.png\" alt=\"uninstall updates windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Tại hộp tìm kiếm, nhập &quot; <strong> KB4534310 </strong> &quot;và nhấn Enter. <br> 5. Đánh dấu &quot;Bản cập nhật bảo mật cho Microsoft Windows (KB4534310)&quot; và nhấp vào <strong> Gỡ cài đặt </strong> . </p> <p><img src=\"images/image_thumb-12-776.png\" alt=\"image\" loading=\"lazy\"></p> <h6></h6> <h6> Phương pháp 2. Thay đổi vị trí hình ảnh khác &quot;Kéo dài&quot;. </h6> <p> Sự cố Hình nền đen trong Windows 7, chỉ xuất hiện khi ảnh nền đã chọn bị kéo căng. Vì vậy, phương pháp tiếp theo để khắc phục sự cố, là đặt một vị trí hình ảnh khác cho hình nền. Để làm việc đó: </p> <p> 1. Nhấp chuột phải vào màn hình của bạn và nhấp vào <strong> Cá nhân hóa </strong> . </p> <p><img src=\"images/image_thumb-17-501.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Nhấp vào <strong> Nền desktop </strong></p> <p><img src=\"images/image_thumb-14-866.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Bây giờ, hãy áp dụng các hành động sau: </p> <p> a. Tại Vị trí hình ảnh, hãy chọn <strong> Thư viện ảnh. </strong><br> b. Chọn hình ảnh bạn muốn làm nền hoặc bất kỳ hình ảnh / ảnh tùy chỉnh nào khác phù hợp với độ phân giải màn hình của bạn. * </p> <blockquote> <p> * Mẹo: Để tìm ra độ phân giải màn hình hiện tại, hãy nhấp chuột phải vào Màn hình và nhấp vào <strong> Độ phân giải màn hình </strong> . </p> </blockquote> <p> c. Tại <strong> Vị trí hình ảnh </strong> , hãy chọn bất kỳ tùy chọn nào khác ngoại trừ &quot; <strong> Căng ra </strong> &quot;, chẳng hạn như&quot; Tô &quot;,&quot; Vừa vặn &quot;,&quot; Ngói &quot;hoặc&quot; Trung tâm &quot;. <br> d. Khi hoàn tất, hãy nhấp vào Lưu <strong> thay đổi </strong> . </p> <p><img src=\"images/image_thumb-15-519.png\" alt=\"image\" loading=\"lazy\"></p> <p> Đó là tất cả! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}