{"title":"Khắc phục: Thiếu tab Trang tính Excel ở cuối Sổ làm việc. (Đã giải quyết)","content":"<p> Một vài ngày trước, một trong những khách hàng của tôi đã đề cập với tôi rằng các tab trang tính bị thiếu trong một trong các sổ làm việc Excel. Sau khi giải quyết vấn đề &quot;thiếu tab Excel&quot; trên máy tính của anh ấy, tôi quyết định viết một hướng dẫn với các bước chi tiết mà tôi đã làm theo để khôi phục các tab trang tính bị thiếu từ tệp Excel. </p> <p><img src=\"images/image_thumb-52-600.png\" alt=\"FIX: Excel Sheets are Missing at the bottom of a Workbook\" loading=\"lazy\"></p> <p> Bài viết này cung cấp hướng dẫn chi tiết để giải quyết vấn đề &quot;thiếu trang tính&quot; trên Sổ làm việc Excel. </p> <h4> Cách khắc phục: Tab Trang tính Excel không hiển thị. </h4> <p> Nếu bạn không thể thấy các tab trong Sổ làm việc Excel, hãy thử cách sau: </p> <h6> Phương pháp 1. Sắp xếp tất cả các cửa sổ của sổ làm việc đang hoạt động. </h6> <p> 1. Đi tới <strong> Lượt xem </strong> tab và nhấp vào <strong> Sắp xếp tất cả. </strong></p> <p><img src=\"images/image_thumb-47-872.png\" alt=\"Fix missing excel tabs\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Chọn <strong> Lát gạch </strong> và <strong> Windows của sổ làm việc đang hoạt động </strong> và bấm vào <strong> ĐỒNG Ý. </strong></p> <p><img src=\"images/image_thumb-48-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Nếu bạn thấy các tab bị thiếu, hãy nhấp vào <strong> Tiết kiệm </strong> để lưu chế độ xem hiện tại, nếu không, hãy tiếp tục bên dưới. </p> <p> </p> <h6> Phương pháp 2. Tiết lộ các bảng tính Excel ẩn. </h6> <p> 1. Để hiển thị các Bảng tính Excel ẩn, hãy đặt chuột vào <strong> 3 chấm </strong><img src=\"images/image_thumb-41-979.png\" alt=\"image\" loading=\"lazy\"> ở thanh dưới cùng cho đến khi bạn thấy <strong> mũi tên hai đầu </strong><img src=\"images/image_thumb-42-990.png\" alt=\"image\" loading=\"lazy\"> . </p> <p><img src=\"images/image_thumb-49-473.png\" alt=\"reveal hidden sheets excel\" loading=\"lazy\"></p> <p> </p> <p> 2. <strong> Nhấp chuột </strong> trên mũi tên hai đầu <img src=\"images/image_thumb-44-186.png\" alt=\"image\" loading=\"lazy\"> và <strong> kéo chuột của bạn sang bên phải </strong> cho đến khi bạn thấy tất cả các tab của sổ làm việc Excel của mình. </p> <p><img src=\"images/image_thumb-50-847.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Nếu các tab bị ẩn lại hiển thị, hãy nhấp vào <strong> Tiết kiệm </strong> để lưu chế độ xem này, nếu không, hãy tiếp tục bên dưới. </p> <p> </p> <h6> Phương pháp 3. Kích hoạt tùy chọn &#39;Hiển thị tab trang tính&#39;. </h6> <p> Nếu trang tính Excel không hiển thị sau khi áp dụng cách trên, hãy kiểm tra cài đặt &quot;Hiển thị tab trang tính&quot; trong tùy chọn Excel. Để làm việc đó: </p> <p> 1. Đi tới <strong> Tập tin </strong> menu và chọn <strong> Tùy chọn </strong> . </p> <p> 2. Chọn <strong> Nâng cao </strong> tab ở bên trái và bên phải, bên dưới <b> Tùy chọn hiển thị cho sổ làm việc này, hãy kiểm tra </b> các <b> Hiển thị các tab trang tính </b> hộp và nhấp vào <strong> ĐỒNG Ý. </strong></p> <p><img src=\"images/image_thumb-51-664.png\" alt=\"show sheet tabs excel\" loading=\"lazy\"></p> <p> 3. Nhấp vào <strong> Tiết kiệm </strong> để lưu chế độ xem này. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về điều này. </p>"}