{"title":"Khắc phục: Menu Bắt đầu của Windows 10, Cài đặt, Cortana hoặc Thanh tác vụ không hoạt động. (Đã giải quyết)","content":"<p> Hướng dẫn này bao gồm các hướng dẫn để khắc phục các sự cố sau trong Windows 10: Menu Bắt đầu không mở, Tìm kiếm Cortana không hoạt động, ứng dụng Cài đặt không khởi chạy, các biểu tượng trên Thanh tác vụ sẽ không mở. </p> <p> Nhiều người dùng Windows 10 đã báo cáo sự cố với menu Bắt đầu, Thanh tác vụ, Cortana và Cài đặt, vì vậy trong hướng dẫn này, tôi liệt kê các phương pháp phổ biến nhất để giải quyết các vấn đề trên. </p> <h2> Cách khắc phục: Các vấn đề về Thanh tác vụ Windows 10, Menu Bắt đầu, Cài đặt hoặc Cortana. </h2> <h3> Phương pháp 1. Gỡ cài đặt Bản cập nhật Windows 10 mới nhất. </h3> <p> Nhiều người dùng đã báo cáo rằng các vấn đề được đề cập trong bài viết này đã được giải quyết sau khi gỡ cài đặt <strong><a href=\"https://support.microsoft.com/en-us/topic/august-11-2020-kb4566782-os-build-19041-450-ec5cf4b6-86ed-b0d3-539c-5fbe1b17f56a\" target=\"_blank\" rel=\"nofollow noopener\"> KB4566782 </a></strong> Cập nhật. </p> <p> Nếu bạn không thể tìm thấy bản cập nhật KB4566782 trong danh sách các bản cập nhật đã cài đặt, hãy kiểm tra và cài đặt tất cả các bản cập nhật có sẵn và nếu sự cố vẫn tiếp diễn, hãy thử <strong><a href=\"https://www.repairwin.com/how-to-uninstall-updates-in-windows-10/#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> gỡ cài đặt (các) bản cập nhật đã cài đặt mới nhất. </a></strong></p> <h3> Phương pháp 2. Khởi động lại Windows 10 ở Chế độ An toàn. </h3> <p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-268.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại <strong> msconfig </strong> và hãy nhấn <strong> Đi vào </strong> . </p> <p><img src=\"images/image_thumb-47-537.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. Tại <strong> Khởi động </strong> chọn tab <strong> Khởi động an toàn </strong> tùy chọn, sau đó nhấp vào <strong> đồng ý </strong> và khởi động lại máy tính của bạn. </p> <p><img src=\"images/image_thumb-48-665.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 4. Sau khi khởi động lại và trong khi ở Chế độ An toàn, hãy kiểm tra xem sự cố của bạn có tiếp diễn hay không. <br> 5. Sau đó, chạy lại công cụ &#39;msconfig&#39; và tại <strong> Chung </strong> tab, kiểm tra <strong> Khởi động bình thường </strong> và bấm vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-859.png\" alt=\"normal startup windows\" loading=\"lazy\"></p> <p> 6. <strong> Khởi động lại </strong> máy tính của bạn. <br> 7. Sau khi khởi động lại, hãy kiểm tra xem sự cố vẫn còn, nếu không, hãy tiếp tục phương pháp tiếp theo. </p> <p> </p> <h2> Phương pháp 3. Thực hiện Khởi động sạch. </h2> <p> 1. Chạy công cụ &#39;msconfig&#39;. <br> 2. Tại tab Dịch vụ, <strong> kiểm tra </strong> các <strong> Ẩn tất cả các Dịch vụ của Microsoft </strong> hộp kiểm và sau đó nhấn <strong> Vô hiệu hóa tất cả </strong> . </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-333.png\" alt=\"clean boot windows\" loading=\"lazy\"></p> <p> </p> <p> 3. Sau đó chọn <strong> Khởi động </strong> tab và nhấp vào <strong> Mở Trình quản lý Tác vụ. <br> </strong> 4. <strong> </strong> Chọn lần lượt tất cả các chương trình được liệt kê và nhấp vào <strong> Vô hiệu hóa. </strong></p> <p><img src=\"images/image_thumb-1-399.png\" alt=\"clean boot windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Khi hoàn tất, hãy đóng cửa sổ đó và sau đó nhấp vào <strong> đồng ý </strong> tại tiện ích &#39;Cấu hình Hệ thống&#39; để <strong> Khởi động lại </strong> máy tính của bạn. <br> 6. Sau khi khởi động lại, nếu máy tính của bạn hoạt động tốt và không gặp sự cố, * sau đó mở lại tiện ích &#39;Cấu hình Hệ thống&#39; (msconfig) và bật từng chương trình đã tắt và khởi động lại PC của bạn, cho đến khi bạn tìm ra chương trình nào gây ra lỗi vấn đề. </p> <p> * Lưu ý: Nếu sự cố vẫn tiếp diễn, ngay cả trong trạng thái Khởi động sạch, thì hãy tiếp tục phương pháp tiếp theo. </p> <h3> Phương pháp 4. Cài đặt lại và đăng ký lại tất cả các Ứng dụng cài sẵn của Windows 10. </h3> <p> Phương pháp tiếp theo để giải quyết sự cố với Thanh tác vụ, menu Bắt đầu, Cortana, v.v. trong Windows 10, là cài đặt lại và đăng ký lại tất cả các ứng dụng được tích hợp sẵn. </p> <p> 1. Mở PowerShell với tư cách Quản trị viên. Để làm việc đó: </p> <blockquote><p> 1. Tại <strong> Cortana </strong> hộp tìm kiếm của, nhập <strong> quyền hạn <br> </strong> 2. Nhấp chuột phải vào <strong> Windows PowerShell </strong> kết quả và chọn <strong> Chạy như quản trị viên. </strong></p></blockquote> <p><img src=\"images/image_thumb-51-691.png\" alt=\"FIX: Windows 10 Start Menu, Settings, Cortana or Taskbar icons Not Working.\" loading=\"lazy\"></p> <p> </p> <p> 3. Trong PowerShell Type (sao chép &amp; dán) lệnh sau và nhấn <strong> Đi vào </strong> : </p> <ul> <li> Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register &quot;$ ($ _. InstallLocation) \\ AppXManifest.xml&quot;} </li> </ul> <p><img src=\"images/image_thumb-2-985.png\" alt=\"register re-install windows 10 apps\" loading=\"lazy\"></p> <p> 4. Chờ lệnh chạy và bỏ qua các lỗi (bằng chữ đỏ). <br> 5. <strong> Khởi động lại </strong> máy tính của bạn và sau đó kiểm tra xem sự cố của bạn đã được khắc phục chưa. </p> <p> </p> <h3> Phương pháp 5. Tạo một tài khoản mới. </h3> <p> Một phương pháp khác để khắc phục một số sự cố trong Windows 10 là tạo tài khoản mới và chuyển các tệp và dữ liệu cá nhân của bạn sang tài khoản mới. Để làm việc đó: </p> <p> 1. Mở <strong> Command Prompt với tư cách là quản trị viên </strong> . <br> 2. Tại dấu nhắc lệnh, gõ lệnh sau và nhấn <strong> Đi vào </strong> : </p> <ul> <li><strong> mật khẩu / thêm tài khoản người dùng net </strong></li> </ul> <p> * Lưu ý: Tại lệnh trên, thay thế các trường &quot;tài khoản&quot; &amp; &quot;mật khẩu&quot;, tùy theo lựa chọn của bạn. </p> <p> ví dụ. nếu bạn muốn tạo một tài khoản mới với tên người dùng &quot;Admin1&quot; và mật khẩu &quot;Admin123&quot;, hãy nhập: <em> người dùng net Admin1 Admin123 / add </em></p> <p><img src=\"images/image_thumb-3-388.png\" alt=\"add user windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Sau đó, tiếp tục và thêm tài khoản mới, vào nhóm Quản trị viên, bằng lệnh này: </p> <ul> <li><strong> net localgroup quản trị viên tài khoản / thêm </strong></li> </ul> <p> ví dụ. Trong ví dụ của chúng tôi, lệnh là: <em> net localgroup quản trị viên Admin1 / add </em></p> <p><img src=\"images/image_thumb-4-429.png\" alt=\"fix windows 10 start menu, cortana, settings\" loading=\"lazy\"></p> <p> </p> <p> 4. Đóng cửa sổ nhắc lệnh và <strong> khởi động lại </strong> máy tính của bạn. <br> 5. Sau khi khởi động lại đăng nhập với tài khoản mới. <br> 6. Kiểm tra xem sự cố vẫn tiếp diễn. Nếu sự cố đã được khắc phục, hãy chuyển dữ liệu và tệp của bạn sang tài khoản mới và bạn đã hoàn tất. </p> <p> </p> <h3> Phương pháp 6. Sửa chữa Windows 10. </h3> <p> Phương pháp cuối cùng để giải quyết sự cố Windows 10 là <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> sửa chữa Windows 10 với Nâng cấp Tại chỗ </a> . </p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}