{"title":"Khắc phục: Không thể kết nối với chia sẻ tệp vì nó không an toàn và nó yêu cầu giao thức SMB1 lỗi thời. (Đã giải quyết)","content":"<p> Nếu bạn cố gắng kết nối với thư mục chia sẻ mạng từ PC chạy Windows 10 và bạn nhận được lỗi &quot;Bạn không thể kết nối với phần chia sẻ tệp vì nó không an toàn. Chia sẻ này yêu cầu giao thức SMB1 lỗi thời, không an toàn và có thể bị lộ hệ thống của bạn để tấn công. Hệ thống của bạn yêu cầu SMB2 trở lên. Để biết thêm thông tin về cách giải quyết sự cố này, hãy xem: https://go.microsoft.com/fwlink/?linkid=852747 &quot;, sau đó tiếp tục bên dưới để khắc phục sự cố. </p> <p><img src=\"images/image_thumb-30-812.png\" alt=\"You can't connect to the file share because it's not secure. This share requires the obsolete SMB1 protocol, which is unsafe...\" loading=\"lazy\"></p> <p> Trong Windows 10 v1709 và các phiên bản mới hơn, giao thức mạng Server Message Block phiên bản 1 (SMBv1) không được cài đặt theo mặc định và phải được kích hoạt theo cách thủ công nếu bạn muốn truy cập thư mục chia sẻ trên máy trạm hoặc máy chủ sử dụng giao thức SMBv1 cho chia sẻ file. </p> <p> Hướng dẫn này bao gồm các hướng dẫn để giải quyết các lỗi sau khi cố gắng kết nối với một thư mục được chia sẻ trong Windows 10: </p> <ul> <li> <p><em> Bạn không thể kết nối với phần chia sẻ tệp vì nó không an toàn. Chia sẻ này yêu cầu giao thức SMB1 lỗi thời, không an toàn… </em></p> </li> <li> <p><em> Tên mạng xác định không còn nữa </em></p> </li> <li> <p><em> Lỗi không xác định 0x80004005 </em></p> </li> <li> <p><em> Máy chủ được chỉ định không thể thực hiện hoạt động được yêu cầu. </em></p> </li> </ul> <h4> Cách khắc phục: Không thể kết nối với Chia sẻ tệp vì Thiếu giao thức SMBv1 (Windows 10) </h4> <p> 1. Điều hướng đến <strong> Bảng điều khiển </strong> -&gt; <strong> Chương trình và các tính năng </strong> . <br> 2. Nhấp vào <strong> Bật hoặc tắt các tính năng của Windows </strong> từ bên trái. </p> <p> </p> <p><img src=\"images/image_thumb-68-359.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Mở rộng tùy chọn &#39;Hỗ trợ Chia sẻ Tệp SMB 1.0 / CIFS&#39; và <strong> kiểm tra </strong> các <strong> Máy khách SMB 1.0 / CIFS </strong> Lựa chọn. Nhấp chuột <strong> đồng ý </strong> khi hoàn thành. </p> <p><img src=\"images/image_thumb-29-360.png\" alt=\"Install SMBv1 Windows 10\" loading=\"lazy\"></p> <p> 4. Khi SMB 1.0 / CIFS được cài đặt và sau đó nhấp vào <strong> Khởi động lại ngay bây giờ </strong> để khởi động lại PC của bạn. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}