{"title":"Khắc phục: Tên người dùng trùng lặp trong màn hình đăng nhập sau khi cập nhật Windows 10.","content":"<p> Hướng dẫn này chứa một số phương pháp để khắc phục sự cố trùng lặp tên người dùng trong màn hình đăng nhập sau khi cập nhật Windows 10. Sự cố &quot;trùng lặp tên người dùng trong màn hình đăng nhập&quot; được nhiều người dùng báo cáo và gây ra sau khi cài đặt bản cập nhật trên Windows 10. </p> <p><img src=\"images/image_thumb-44-494.png\" alt=\"FIX: Duplicate User Names in Sign-in Screen Windows 10\" loading=\"lazy\"></p> <p> Chi tiết vấn đề: Sau khi bạn đổi tên máy tính của mình hoặc sau khi cài đặt các bản cập nhật trong Windows 10, hệ thống không tự động đăng nhập vào tài khoản người dùng của bạn với lỗi &quot;tên người dùng hoặc mật khẩu không chính xác. Hãy thử lại&quot; và đồng thời tên người dùng của bạn xuất hiện hai lần trong màn hình đăng nhập. </p> <h4> Cách khắc phục: Màn hình đăng nhập Windows 10 hiển thị cùng một người dùng hai lần. </h4> <h6> Phương pháp 1. Loại bỏ Tài khoản trùng lặp khỏi các tùy chọn Tài khoản Người dùng. </h6> <p> Phương pháp đầu tiên để xóa tên người dùng trùng lặp khỏi màn hình đăng nhập là xóa tài khoản trùng lặp khỏi PC của bạn. </p> <p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-923.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Trong hộp &quot;Mở&quot;, nhập: <strong> kiểm soát userpasswords2 </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-29-663.png\" alt=\"control userpasswords2 \" loading=\"lazy\"></p> <p> 3. Tại tùy chọn Tài khoản Người dùng, hãy thực hiện các hành động sau theo trường hợp của bạn: </p> <ul> <li><strong> Trường hợp A. </strong> Nếu bạn thấy hai tài khoản có cùng tên người dùng: </li> </ul> <blockquote><p> a. Chọn tài khoản phụ và nhấp vào <strong> Tẩy </strong> . <br> b. Nhấp chuột <strong> đồng ý </strong> và <strong> khởi động lại </strong> PC của bạn. <br> c. Nếu sau khi khởi động lại, bạn vẫn thấy tên người dùng của mình hai lần trên màn hình đăng nhập, hãy tiếp tục sang Phương pháp 2. </p></blockquote> <p><img src=\"images/image_thumb-37-605.png\" alt=\"User Accounts Options\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Trường hợp B. </strong> Nếu bạn chỉ thấy một tài khoản: </li> </ul> <blockquote><p> a. Chọn tài khoản và nhấp vào <strong> Tính chất </strong> . <br> b. Sao chép Họ và dán vào trường Tên người dùng, để khớp. * <br> c. Nhấp chuột <strong> đồng ý </strong> và <strong> khởi động lại </strong> PC của bạn. </p></blockquote> <p> * Lưu ý: Nếu Tên người dùng và tên đầy đủ đã khớp, hãy chuyển sang phương pháp 2. </p> <p><img src=\"images/image_thumb-38-262.png\" alt=\"Remove Duplicate User Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Phương pháp 2. Tắt yêu cầu Mật khẩu khi Đăng nhập. </h6> <p> 1. Làm theo các bước 1 &amp; 2 từ phương pháp trước đó để mở các tùy chọn &#39;Tài khoản Người dùng&#39;. <br> 2. <strong> Bỏ chọn </strong> các <strong> Người dùng phải nhập tên người dùng và mật khẩu để sử dụng máy tính này </strong> và bấm vào <strong> Ứng dụng </strong></p> <p><img src=\"images/image_thumb-42-373.png\" alt=\"User must enter a user name and password to use this computer \" loading=\"lazy\"></p> <p> </p> <p> 3. Nhập mật khẩu của bạn (hai lần) và nhấp vào <strong> đồng ý </strong> hai lần để đóng tất cả các cửa sổ. </p> <p><img src=\"images/image_thumb-43-970.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. <strong> Khởi động lại </strong> máy tính của bạn. Nếu tên người dùng của bạn xuất hiện lại hai lần, hãy tiếp tục với phương pháp tiếp theo. </p> <h6></h6> <h6> Phương pháp 3. Sửa đổi các tùy chọn Đăng nhập. </h6> <p> </p> <p> 1. Từ đầu <img src=\"images/image_thumb-39-183.png\" alt=\"image\" loading=\"lazy\"> menu, mở <strong> Cài đặt </strong> <img src=\"images/image_thumb-50-520.png\" alt=\"image\" loading=\"lazy\"> và sau đó nhấp vào <strong> Tài khoản </strong> . </p> <p><img src=\"images/image_thumb-43-892.png\" alt=\"How to Add a New User in Windows 10, 8.1.\" loading=\"lazy\"></p> <p> </p> <p> 2. Chọn <strong> Tùy chọn đăng nhập </strong> trên ngăn bên trái, và <strong> tắt </strong> các <strong> Sử dụng thông tin đăng nhập của tôi để tự động hoàn tất thiết lập thiết bị của tôi và mở lại ứng dụng của tôi sau khi cập nhật hoặc khởi động lại </strong> . </p> <p><img src=\"images/image_thumb-40-207.png\" alt=\"Modify Sign in Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Khởi động lại </strong> PC của bạn. </p> <p> </p> <h6> Phương pháp 4. Thay đổi thành Tài khoản cục bộ. </h6> <p> Phương pháp cuối cùng để giải quyết vấn đề &quot;trùng lặp tên người dùng&quot; là sử dụng tài khoản cục bộ để đăng nhập trong Windows 10. Để thực hiện điều đó: </p> <p> 1. Từ đầu <img src=\"images/image_thumb-41-454.png\" alt=\"image\" loading=\"lazy\"> menu, mở <strong> Cài đặt </strong> <img src=\"images/image_thumb-50-790.png\" alt=\"image\" loading=\"lazy\"> và sau đó nhấp vào <strong> Tài khoản </strong> . <br> 2. Nhấp vào <strong> Email và tài khoản </strong> trên ngăn bên trái. <br> 3. Nhấp chuột tiếp theo <strong> Đăng nhập bằng tài khoản cục bộ thay thế. </strong></p> <p> </p> <p><img src=\"images/image_thumb-37-653.png\" alt=\"sign-in with a local account instead windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Nhập mật khẩu tài khoản Microsoft của bạn và nhấp vào <strong> Kế tiếp </strong> . <br> 5. Sau đó nhập tên người dùng, mật khẩu (tùy chọn) cho tài khoản cục bộ mới và nhấp vào <strong> Kế tiếp </strong> . <br> 6. Sau khi khởi động lại, hãy nhập mật khẩu của bạn để đăng nhập bằng tài khoản cục bộ mới. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}