{"title":"Khắc phục: Khoảng thời gian chờ Semaphore đã Hết hạn khi sao chép tệp (Đã giải quyết)","content":"<p> Lỗi &quot;Thời gian chờ semaphore đã hết hạn&quot; có thể hiển thị khi bạn cố gắng sao chép các tệp lớn qua mạng hoặc khi chuyển tệp từ ổ USB bên ngoài sang máy tính của bạn. Trong các trường hợp khác, &quot;Lỗi 0x80070079: Khoảng thời gian chờ semaphore đã hết hạn&quot;, xuất hiện khi bạn cố gắng sao chép tệp từ thiết bị được kết nối USB (ví dụ: từ máy ảnh, điện thoại di động của bạn, v.v.). </p> <p><img src=\"images/image_thumb-4-812.png\" alt=\"Semaphore Timeout Period has Expired\" loading=\"lazy\"></p> <p> </p> <p> Trong hướng dẫn này, bạn sẽ tìm thấy một số cách để giải quyết &quot;khoảng thời gian chờ semaphore đã hết hạn. Lỗi 0x80070079&quot; khi sao chép tệp từ / sang Mạng hoặc USB, trong Windows 10, 8, 8.1, 7 hoặc Vista. </p> <h4> Cách khắc phục: Lỗi khi sao chép tệp hoặc thư mục. Thời hạn semaphore đã hết hạn. </h4> <p><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> PHẦN 1. KHẮC PHỤC &#39;Thời hạn Semaphore đã hết hạn&#39; khi sao chép tệp từ USB. </a></p> <p><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> PHẦN 2. KHẮC PHỤC &#39;Thời hạn Semaphore đã Hết hạn&#39; khi Sao chép Tập tin từ Mạng. </a></p> <p> </p> <h6> PHẦN 1. KHẮC PHỤC &#39;Thời hạn Semaphore đã hết hạn&#39; khi sao chép tệp từ USB. </h6> <p> Nếu bạn nhận được lỗi &#39;Thời hạn Semaphore đã hết hạn&#39; khi bạn sao chép tệp từ thiết bị USB (ví dụ: từ đĩa USB bên ngoài hoặc từ máy ảnh kỹ thuật số của bạn), hãy thử các cách sau để khắc phục sự cố: </p> <p><strong> 1. </strong> Đóng tất cả các chương trình đang mở và <strong> khởi động lại </strong> máy tính của bạn. <br> <strong> 2. </strong> Kết nối thiết bị USB với <strong> một cổng USB khác </strong> . Nếu máy tính của bạn sở hữu cổng USB 2.0 thì hãy kết nối thiết bị USB trong cổng đó. <br> <strong> 3. </strong> Sử dụng một <strong> cáp USB khác nhau </strong> để kết nối thiết bị USB với máy tính của bạn. <br> <strong> 4. </strong> Nếu bạn muốn sao chép tệp từ thiết bị USB (ví dụ: điện thoại di động hoặc máy ảnh kỹ thuật số của bạn) sở hữu thẻ SD, thì <strong> tẩy </strong> và <strong> lắp lại </strong> các <strong> thẻ SD </strong> . Ngoài ra, hãy tháo thẻ SD khỏi thiết bị USB và gắn nó vào <strong> đầu đọc thẻ </strong> (nếu bạn sở hữu một cái). <br> <strong> 5. </strong> <strong> Kiểm tra </strong> và <strong> sửa chữa lỗi </strong> trên ổ USB bằng cách sử dụng &#39; <strong> chkdsk </strong> &#39; chỉ huy. Để làm việc đó: </p> <blockquote><p> 1. Khởi chạy <strong> Command Prompt với tư cách là quản trị viên </strong> . </p></blockquote> <p><img src=\"images/image_thumb-30-765.png\" alt=\"command prompt administrator\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 2. Trong cửa sổ nhắc lệnh, nhập lệnh sau và nhấn <strong> Đi vào </strong> : * </p></blockquote> <ul> <li> <ul> <li> <ul> <li><strong> chkdsk X: / F / R </strong></li> </ul> </li> </ul> </li> </ul> <p><strong> * Ghi chú: </strong> Thay thế ký tự ổ đĩa X theo ký tự ổ đĩa USB. </p> <p> </p> <p> </p> <h6> PHẦN 2. KHẮC PHỤC &#39;Thời hạn Semaphore đã hết hạn&#39; khi sao chép tệp qua mạng. </h6> <p> Nếu bạn nhận được lỗi &#39;Thời hạn Semaphore đã Hết hạn&#39; khi bạn cố gắng sao chép tệp qua Mạng, hãy thử các cách sau: </p> <h2> Phương pháp 1. Sử dụng địa chỉ IP tĩnh. </h2> <p> Nếu bạn đang sử dụng DHCP, hãy tắt nó và chỉ định một địa chỉ IP tĩnh trên cả hai máy tính mạng. </p> <p> </p> <h2> Phương pháp 2. Cập nhật Trình điều khiển mạng trên cả hai máy tính. </h2> <ul> <li> Nếu bạn sở hữu một máy tính xách tay, hãy thử các cách sau: <ul> <li> Nếu bạn đang kết nối qua Wi-Fi, hãy thử sao chép các tệp bằng kết nối Ethernet (LAN) hoặc… </li> <li> Điều hướng đến trang web hỗ trợ của nhà sản xuất máy tính xách tay của bạn để tải xuống và cài đặt trình điều khiển mạng mới nhất. </li> </ul> </li> <li> Nếu bạn sở hữu một máy tính để bàn, hãy tải xuống trình điều khiển mới nhất cho card mạng của bạn từ trang web hỗ trợ của nhà sản xuất bo mạch chủ. </li> </ul> <p><strong> TIỀN BOA: </strong> Nếu bạn không thể tìm thấy kiểu máy tính xách tay hoặc bo mạch chủ của mình, hãy làm như sau: </p> <blockquote><p> 1. Nhấn nút <strong> các cửa sổ </strong> <img src=\"images/image_thumb8_thumb_thumb-904.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại: <strong> devmgmt.msc </strong> &amp; nhấp chuột <strong> đồng ý </strong> để mở &#39;Trình quản lý Thiết bị&#39; <strong> . </strong></p></blockquote> <p><img src=\"images/image_thumb-1-166.png\" alt=\"device manager\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> </p> <p> 3. Trong Trình quản lý Thiết bị, hãy mở rộng <strong> Bộ điều hợp mạng. <br> </strong> 4. Nhấp chuột phải vào Bộ điều hợp mạng của bạn và nhấp vào <strong> Cập nhật driver </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-946.png\" alt=\"update driver\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Để Windows tự động tìm kiếm trình điều khiển cập nhật cho bộ điều hợp mạng. * </p></blockquote> <p><strong> *Ghi chú: </strong> Nếu Windows không thể tìm thấy trình điều khiển được cập nhật, hãy sử dụng tên của bộ điều hợp (ví dụ: &quot;Bộ điều hợp mạng Broadcom 802.11g&quot;) và tìm kiếm trình điều khiển được cập nhật theo cách thủ công. </p> <p><img src=\"images/image_thumb-6-471.png\" alt=\"search for drivers\" loading=\"lazy\"></p> <p> </p> <p> </p> <h2> Phương pháp 3. Tạm thời vô hiệu hóa Antivirus hoặc Firewall. </h2> <p> Phương pháp tiếp theo để khắc phục sự cố &#39;Semaphore period đã hết hạn&#39; là tạm thời vô hiệu hóa Tường lửa Windows và chương trình Chống vi-rút của bạn. Để tắt Tường lửa Windows: </p> <p> 1. Nhấn nút <strong> các cửa sổ </strong> <img src=\"images/image_thumb8_thumb_thumb-462.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại: <strong> điều khiển </strong> &amp; nhấp chuột <strong> đồng ý </strong><strong> . </strong></p> <p><img src=\"images/image_thumb7-807.png\" alt=\"control panel command\" loading=\"lazy\"></p> <p> </p> <p> 3. Đặt &quot;Xem theo:&quot; thành <strong> Biểu tượng nhỏ </strong> để hiển thị tất cả các mục trong bảng điều khiển. </p> <p> </p> <p><img src=\"images/image_thumb8-567.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Mở <strong> Tường lửa Windows </strong> (hoặc &quot;Tường lửa của Bộ bảo vệ Windows&quot; trong Windows 10). </p> <p><img src=\"images/image_thumb-7-921.png\" alt=\"disable firewall wiindows\" loading=\"lazy\"></p> <p> </p> <p> 5. Nhấp vào <strong> Bật hoặc tắt Tường lửa của Windows </strong> . </p> <p><img src=\"images/image_thumb-8-655.png\" alt=\"turn off windows defender firewall\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Kiểm tra </strong> các &quot; <strong> Tắt Tường lửa của Windows (không được khuyến nghị) </strong> &quot;và nhấp vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-9-907.png\" alt=\"turn off windows firewall\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Khởi động lại </strong> máy tính của bạn và sau đó sao chép các tệp. * </p> <p> * Lưu ý: Sau khi sao chép tệp, hãy làm theo các bước trên để kích hoạt lại Tường lửa của Windows. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}