{"title":"Khắc phục: Không có âm thanh từ loa trong trên máy tính xách tay HP OMEN (Đã giải quyết)","content":"<p> Hướng dẫn này bao gồm các hướng dẫn từng bước để giải quyết vấn đề &quot;không có âm thanh từ loa trong&quot;, trên <a href=\"https://support.hp.com/ph-en/document/c05576170\" target=\"_blank\" rel=\"nofollow noopener\"> Máy tính xách tay Omen của HP - 17-an009nv </a> . Sự cố &quot;không có âm thanh từ loa của máy tính xách tay&quot;, có thể xảy ra trên bất kỳ kiểu máy tính xách tay HP nào và thường xảy ra sau khi cài đặt bản cập nhật trình điều khiển Windows cho thiết bị Âm thanh độ nét cao Realtek. </p> <p> Chi tiết vấn đề: Trên máy tính xách tay HP chạy Windows 10, không có âm thanh từ loa trong khi phát nhạc hoặc video, nhưng loa hoạt động bình thường khi chạy kiểm tra chẩn đoán HP bên ngoài Hệ điều hành. Ngoài ra, vấn đề &quot;không có âm thanh&quot;, chỉ xảy ra với loa của máy tính xách tay chứ không phải với loa ngoài hoặc tai nghe. </p> <h4> Cách khắc phục: Loa của máy tính xách tay không có âm thanh trong Windows 10. </h4> <h6> Bước 1. Tăng âm lượng </h6> <p> 1. <strong> Nhấp chuột phải </strong> tại <strong> biểu tượng âm thanh </strong><img src=\"images/image_thumb-11-503.png\" alt=\"image\" loading=\"lazy\"> trên thanh tác vụ và chọn <strong> Mở Bộ trộn âm lượng. </strong></p> <p><img src=\"images/image_thumb-12-807.png\" alt=\"Open Volume Mixer\" loading=\"lazy\"></p> <p> 2. Kéo thanh trượt Loa đến <strong> Hàng đầu </strong> và kiểm tra xem bạn có thể nghe thấy âm thanh không. </p> <p><img src=\"images/image_thumb-13-813.png\" alt=\"Adjust Sound Volume\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Bước 2. Đặt Loa làm Thiết bị Phát lại Mặc định. </h6> <p> 1. Điều hướng đến Windows <strong> Bảng điều khiển </strong> và mở ra <strong> Âm thanh. </strong></p> <p><img src=\"images/image_thumb-14-315.png\" alt=\"Control Panel - Sound\" loading=\"lazy\"></p> <p> 2. Hãy chắc chắn rằng <strong> Diễn giả </strong> là <strong> Mặc định </strong> thiết bị phát lại, nếu không, hãy chọn loa và nhấp vào <strong> Đặt mặc định </strong> cái nút. Khi hoàn tất, hãy kiểm tra loa của bạn và nếu sự cố vẫn tiếp diễn, hãy tiếp tục bước tiếp theo. </p> <p><img src=\"images/image_thumb-15-993.png\" alt=\"Set Speakers as Default Playback Device\" loading=\"lazy\"></p> <h6><br clear=\"all\"> Bước 3. Kiểm tra loa trong bên ngoài Windows. </h6> <p> Bước tiếp theo để giải quyết vấn đề &quot;không có âm thanh trên loa trong&quot; trên máy tính xách tay của bạn là kiểm tra xem loa có hoạt động hay không khi chạy các bài kiểm tra chẩn đoán phần cứng của HP. Để làm việc đó: </p> <p> 1. <strong> Tắt </strong> máy tính xách tay của bạn. <br> 2. Bật máy tính xách tay của bạn và ngay lập tức nhấn <strong> ESC </strong> phím nhiều lần. <br> 3. Khi menu xuất hiện, hãy bấm <strong> F2 </strong> Chìa khóa. <br> 4. Trên menu chính, nhấp vào <strong> Kiểm tra thành phần </strong> và sau đó nhấp vào <strong> ÂM THANH. <br> </strong> 5. Nếu bạn nghe thấy âm thanh từ loa trong quá trình kiểm tra âm thanh, hãy tiếp tục bước 3 bên dưới. * </p> <p><strong> * Ghi chú: </strong> Nếu bạn không nghe thấy âm thanh từ loa, thì hãy dừng lại ở đây vì có sự cố phần cứng mà chỉ có kỹ thuật viên (dịch vụ) máy tính xách tay chuyên dụng mới có thể khắc phục được. </p> <p><img src=\"images/image_thumb-22-211.png\" alt=\"HP Diagnostics - Component Test\" loading=\"lazy\"></p> <p> </p> <h6><br clear=\"all\"> Bước 4. Cuộn lại Trình điều khiển Card âm thanh. </h6> <p> 1. Mở <strong> Quản lý thiết bị </strong> . Để làm việc đó: </p> <blockquote><p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-958.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Trong hộp &quot;Mở&quot;, nhập: <strong> devmgmt.msc </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-5-510.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. <strong> Mở rộng </strong> các <strong> Bộ điều khiển âm thanh, video và trò chơi. </strong></p> <p> 3. <strong> Nhấp chuột phải </strong> trên <strong> âm thanh chất lượng cao Realtek </strong> thiết bị và chọn <strong> Tính chất. </strong></p> <p><img src=\"images/image_thumb-17-678.png\" alt=\"High Definition Audio Properties\" loading=\"lazy\"></p> <p> 4. Tại tab Driver, nhấp vào <strong> Quay lại trình điều khiển </strong> cái nút. <strong> * </strong></p> <p><strong> * Ghi chú: </strong> Nếu nút Roll Back Driver không hoạt động, hãy tiếp tục bước tiếp theo. </p> <p><img src=\"images/image_thumb-18-178.png\" alt=\"RollBack Driver\" loading=\"lazy\"></p> <p> </p> <p> 5. Chọn lý do cho việc khôi phục gói trình điều khiển và nhấp vào <strong> Đúng. </strong></p> <p><img src=\"images/image_thumb-19-167.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Khi hoàn tất việc khôi phục trình điều khiển, <strong> khởi động lại </strong> máy tính của bạn. <br> 5. Sau khi khởi động lại, hãy tiến hành và kiểm tra âm thanh từ loa của máy tính xách tay. Nếu bạn vẫn không thể nghe thấy âm thanh từ loa của máy tính xách tay, hãy tiếp tục bước tiếp theo. </p> <p> </p> <h6><br clear=\"all\"> Bước 5. Thay đổi Trình điều khiển Card âm thanh. </h6> <p> 1. Mở <strong> Quản lý thiết bị. </strong><br> 2. <strong> Mở rộng </strong> các <strong> Bộ điều khiển âm thanh, video và trò chơi. <br> </strong> 3. <strong> Nhấp chuột phải </strong> tại <strong> âm thanh chất lượng cao Realtek </strong> thiết bị, {hoặc tại <strong> &#39;Âm thanh độ nét cao Realtek (SST) </strong> device} và chọn <strong> Cập nhật driver. <br> </strong></p> <p><img src=\"images/image_thumb-6-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Chọn <strong> Duyệt máy tính của tôi để tìm trình điều khiển. </strong></p> <p><img src=\"images/image_thumb-7-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Chọn <strong> Hãy để tôi chọn từ danh sách các trình điều khiển có sẵn trên máy tính của tôi </strong> . </p> <p><img src=\"images/image_thumb-8-771.png\" alt=\"FIX No Sound From Laptop Speakers\" loading=\"lazy\"></p> <p> </p> <p> 6. Ở màn hình tiếp theo, hãy áp dụng một trong các thao tác sau, tùy theo trường hợp của bạn: </p> <p><strong> Trường hợp A. </strong> Nếu trong hộp &#39;Hiển thị phần cứng tương thích&#39;, bạn thấy &quot;Thiết bị âm thanh độ nét cao&quot; và thiết bị &quot;Âm thanh độ nét cao Realtek&quot; được liệt kê, sau đó chọn <strong> Thiết bị âm thanh độ nét cao </strong> và bấm vào <strong> Kế tiếp. </strong></p> <p><img src=\"images/image_thumb-20-130.png\" alt=\"Change Sound Card Driver\" loading=\"lazy\"></p> <p> </p> <p><strong> Trường hợp B. </strong> Nếu trong hộp &#39;Hiển thị phần cứng tương thích&#39;, bạn chỉ thấy <strong> &#39;Âm thanh độ nét cao Realtek (SST) </strong> thiết bị, sau đó: </p> <blockquote><p> a. <strong> Bỏ chọn </strong> các <strong> Hiển thị hộp kiểm phần cứng tương thích. </strong></p></blockquote> <p><img src=\"images/image_thumb-9-565.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Chọn <strong> âm thanh chất lượng cao Realtek </strong> trình điều khiển và nhấp chuột <strong> Kế tiếp. </strong></p></blockquote> <p><img src=\"images/image_thumb-10-248.png\" alt=\"FIX No Sound from Internal Speakers on Laptop\" loading=\"lazy\"></p> <p> </p> <p> 8. Khi hoàn tất cài đặt trình điều khiển, <strong> khởi động lại </strong> máy tính của bạn. <br> 9. Sau khi khởi động lại, hãy tiến hành và kiểm tra âm thanh từ loa của máy tính xách tay. </p> <p> </p> <h6><br clear=\"all\"> Bước 6. Gỡ cài đặt và cài đặt lại trình điều khiển Card âm thanh. </h6> <p> 1. Mở <strong> Quản lý thiết bị. </strong><br> 2. <strong> Mở rộng </strong> các <strong> Bộ điều khiển âm thanh, video và trò chơi. <br> </strong> 3. <strong> Nhấp chuột phải </strong> tại <strong> âm thanh chất lượng cao Realtek </strong> thiết bị và chọn <strong> Gỡ cài đặt thiết bị. </strong></p> <p><img src=\"images/image_thumb-21-889.png\" alt=\"Uninstall Sound Card\" loading=\"lazy\"></p> <p> 4. Sau khi gỡ cài đặt, <strong> khởi động lại </strong> máy tính của bạn và để Windows tự động cài đặt trình điều khiển âm thanh. Nếu điều này không xảy ra, hãy điều hướng đến <strong> Cài đặt </strong> &gt; <strong> Cập nhật và bảo mật </strong> và buộc Windows phải <strong> Kiểm tra cập nhật, </strong> hoặc tiếp tục bước-7 bên dưới. </p> <p> </p> <h6><br clear=\"all\"> Bước 7. Cập nhật Trình điều khiển Card âm thanh. </h6> <p> Điều hướng đến trang web hỗ trợ của nhà sản xuất máy tính xách tay của bạn và tải xuống và cài đặt trình điều khiển mới nhất cho card âm thanh của bạn. Nếu bạn không thể tìm thấy trình điều khiển cho card âm thanh trên trang web hỗ trợ của nhà sản xuất hoặc nếu bạn vẫn gặp sự cố &quot;không có âm thanh từ loa trong&quot; sau khi cài đặt trình điều khiển mới, hãy thử các cách sau nếu bạn sở hữu thiết bị Realtek HD Audio. </p> <p> 1. Đọc hướng dẫn về điều này <a href=\"https://www.repairwin.com/how-to-download-realtek-audio-manager-realtek-audio-drivers-windows-10-8-1-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"><strong> bài báo </strong></a> đến <strong> Tải xuống </strong> các <strong> Trình điều khiển âm thanh Realtek HD v2.82. <br> </strong> 2. Sau khi tải xuống, hãy tiếp tục và <strong> Tải về </strong> các <strong> Trình điều khiển âm thanh Realtek HD. <br> </strong> 3. Sau khi cài đặt <strong> khởi động lại </strong> PC của bạn và kiểm tra âm thanh từ loa. * </p> <p><strong> Lưu ý cuối cùng: </strong> Nếu sự cố âm thanh của loa vẫn tiếp diễn, hãy xem trong Trình quản lý thiết bị và nếu thiết bị âm thanh được liệt kê là &quot;Âm thanh độ nét cao Realtek (SST)&quot;, hãy làm theo hướng dẫn ở bước 5 ở trên và thay đổi &quot;Âm thanh độ nét cao Realtek (SST) &quot;trình điều khiển cho&quot; Âm thanh độ nét cao Realtek &quot;. </p> <p> Đó là tất cả mọi người! Phương pháp nào hiệu quả với bạn? Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}