{"title":"Khắc phục: Chúng tôi không thể kết nối với dịch vụ cập nhật. Đảm bảo rằng bạn đã kết nối Internet trong Windows 10 (Đã giải quyết)","content":"<p> Hướng dẫn này bao gồm các hướng dẫn để khắc phục lỗi sau trong bản cập nhật Windows 10: &quot;Chúng tôi không thể kết nối với dịch vụ cập nhật. Chúng tôi sẽ thử lại sau hoặc bạn có thể kiểm tra ngay bây giờ. Nếu nó vẫn không hoạt động, hãy đảm bảo bạn &#39; lại kết nối với Internet. &quot; </p> <p><img src=\"images/image_thumb-46-713.png\" alt=\"We couldn't connect to the update service. Make sure you're connected to the Internet in Windows 10 update\" loading=\"lazy\"></p> <p> </p> <p> Microsoft đã biết về vấn đề cập nhật ở trên và <a href=\"https://support.microsoft.com/en-us/help/4464619/windows-10-update-history\" target=\"_blank\" rel=\"nofollow noopener\"> công bố vào ngày 4 tháng 2 năm 2019 </a> : &quot;Dịch vụ Windows Update bị ảnh hưởng bởi sự cố hỏng dữ liệu khi nhà cung cấp dịch vụ DNS bên ngoài ngừng hoạt động toàn cầu vào ngày 29 tháng 1 năm 2019. Sự cố đã được giải quyết vào cùng ngày và Windows Update hiện đang hoạt động bình thường, nhưng một số khách hàng vẫn tiếp tục báo cáo sự cố khi kết nối với dịch vụ Windows Update. Chúng tôi hy vọng những sự cố này sẽ biến mất khi các máy chủ DNS hạ lưu được cập nhật bằng các mục nhập DNS Windows Update đã sửa &quot;. </p> <p> Do nhiều người dùng đã báo cáo rằng sự cố vẫn chưa được khắc phục và cũng ảnh hưởng đến Bộ bảo vệ Windows (không thể cập nhật định nghĩa của Bộ bảo vệ) và Microsoft Store (Store không hoạt động), hãy đọc hướng dẫn bên dưới để giải quyết mọi sự cố cập nhật trong Windows 10, hoặc trong Bộ bảo vệ Windows và trong Windows Store. </p> <h2> Cách khắc phục: Không thể kết nối với Dịch vụ cập nhật trong Windows 10. </h2> <h6> Phương pháp 1. Thay đổi cài đặt DNS </h6> <p> 1. <strong> Nhấp chuột phải </strong> trên <strong> Mạng lưới </strong> biểu tượng <img src=\"images/image_thumb-42-546.png\" alt=\"image\" loading=\"lazy\"> trong Thanh tác vụ và nhấp vào <strong> Mở Trung tâm Mạng và Chia sẻ. </strong> * </p> <p><img src=\"images/image_thumb-104-256.png\" alt=\"change dns network settings \" loading=\"lazy\"></p> <p> </p> <p> 2. Chọn <strong> Ethernet </strong> (hoặc Wi-Fi) ở bên trái, sau đó tại phần &#39;Cài đặt liên quan&#39;, hãy nhấp vào <strong> Thay đổi các tùy chọn bộ điều hợp </strong> . </p> <p><img src=\"images/image_thumb-43-363.png\" alt=\"change adapter options\" loading=\"lazy\"></p> <p> </p> <p> 3. Nhấp chuột phải vào Bộ điều hợp mạng đang hoạt động (Ethernet hoặc Wi-Fi) và chọn <strong> Tính chất </strong> . </p> <p><img src=\"images/image_thumb-44-396.png\" alt=\"network properties\" loading=\"lazy\"></p> <p> 4. Chọn <strong> ‘Giao thức Internet Phiên bản 4 (TCP / IPv4) </strong> &#39;Và nhấp vào <strong> Tính chất </strong></p> <p><img src=\"images/image_thumb-106-941.png\" alt=\"change tcp-ip v4\" loading=\"lazy\"></p> <p> </p> <p> 5. Tại thuộc tính Giao thức Internet Phiên bản 4 (TCP / IPv4): </p> <blockquote><p> a. <strong> Kiểm tra </strong> các <strong> Sử dụng các địa chỉ máy chủ DNS sau: </strong> nút radio. <br> b. Sau đó, nhập các địa chỉ máy chủ DNS sau (Máy chủ DNS công cộng của Google) và nhấp vào <strong> ĐỒNG Ý. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> </blockquote> <p><img src=\"images/image_thumb-109-998.png\" alt=\"google dns settings\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Khởi động lại </strong> máy tính của bạn. </p> <p> </p> <h6> Phương pháp 2. Chạy Trình gỡ rối Windows Update. </h6> <h6> Phương pháp 2. Chạy Trình gỡ rối Windows Update. </h6> <p> 1. Điều hướng đến Windows <strong> Bảng điều khiển </strong> , đặt &#39;View By&#39; thành <strong> Biểu tượng nhỏ </strong> và mở ra <strong> Xử lý sự cố. </strong></p> <p><img src=\"images/image_thumb-5-213.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Trong tùy chọn Khắc phục sự cố, hãy nhấp vào <strong> Khắc phục sự cố với Windows Update. </strong></p> <p><img src=\"images/image_thumb-9-911.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Nhấp vào <strong> Kế tiếp </strong> để khắc phục sự cố cập nhật Windows. </p> <p><img src=\"images/image_thumb-8-372.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Khi quá trình khắc phục sự cố hoàn tất, <strong> đóng </strong> trình gỡ rối và <strong> khởi động lại </strong> PC của bạn. <br> 6. Kiểm tra các bản cập nhật. </p> <h6> Phương pháp 3. <strong> Xóa Thư mục Cửa hàng Cập nhật. </strong></h6> <p> “C: \\ Windows \\ SoftwareDistribution”, là vị trí mà Windows lưu trữ các Bản cập nhật Windows. Nhiều khi thư mục này bị hỏng và bạn phải tạo lại nó để tải xuống các bản cập nhật và cài đặt từ đầu. Để xây dựng lại (tạo lại) thư mục “SoftwareDistribution”, hãy làm theo các bước bên dưới: </p> <p><strong> Bước 1: Dừng Dịch vụ Windows Update. </strong></p> <p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-610.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Trong hộp Tìm kiếm, nhập: <strong> services.msc </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-12-860.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> 3. Bảng điều khiển Trong Dịch vụ xác định vị trí <strong> cập nhật hệ điều hành Window </strong> dịch vụ. <br> 4. Nhấp chuột phải vào <strong> cập nhật hệ điều hành Window </strong> dịch vụ và chọn <strong> Dừng lại </strong> . </p> <p><img src=\"images/image_thumb-9-707.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> Bước 2: Xóa thư mục SoftwareDistribution. </strong></p> <p> 1. Mở Windows Explorer và điều hướng đến: <strong> C: \\ Windows </strong> thư mục. <br> 2. Tìm và <strong> Xóa bỏ </strong> các <strong> Phân phối phần mềm </strong> thư mục (hoặc đổi tên nó. ví dụ: thành “SoftwareDistributionOLD”). </p> <p> </p> <p><img src=\"images/image_thumb-10-148.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p><strong> Bước 3: Khởi động Windows Update Service. </strong></p> <p> 1. Mở bảng điều khiển Windows Services. <br> 2. Nhấp chuột phải vào <strong> cập nhật hệ điều hành Window </strong> dịch vụ và chọn <strong> Khởi đầu </strong> . </p> <p><img src=\"images/image_thumb-11-233.png\" alt=\"start windows update service\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Bước 4: Kiểm tra và cài đặt Windows 10 Update. </strong></p> <p> 1. Điều hướng đến <strong> Cài đặt </strong> -&gt; <strong> Cập nhật và bảo mật </strong> và bấm vào <strong> Kiểm tra cập nhật </strong> . </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}