{"title":"Khắc phục: YouTube không hoạt động trên Chrome (Đã giải quyết)","content":"<p> Vài ngày trước, tôi gặp phải sự cố sau trên máy tính Windows: YouTube không hoạt động trong Chrome (Video không phát). Nếu bạn không thể xem video trên YouTube hoặc các trang web khác bằng Google Chrome do cửa sổ video có màu đen thì hãy đọc hướng dẫn này để khắc phục sự cố. </p> <p><img src=\"images/image_thumb-19-778.png\" alt=\"FIX YouTube Not Working on Chrome \" loading=\"lazy\"></p> <h4> Cách khắc phục: YouTube hoặc video trực tuyến không tải trong trình duyệt Chrome. </h4> <p> Khi video YouTube không tải trong Chrome, hãy tiếp tục giải quyết sự cố bằng cách làm theo các bước bên dưới. </p> <h6> Bước 1. Kiểm tra xem bạn có thể xem video bằng trình duyệt khác không. </h6> <p> Bước đầu tiên là xác định xem vấn đề &quot;YouTube không hoạt động&quot; chỉ xảy ra trên Google Chrome hay trong tất cả các trình duyệt được cài đặt khác. Vì vậy, hãy mở bất kỳ trình duyệt web nào khác (ví dụ: &#39;Internet Explorer&#39;) và kiểm tra xem bạn có thể xem video YouTube hay không. Nếu bạn gặp phải vấn đề tương tự, hãy kiểm tra Kết nối Internet của bạn và nếu nó ổn, hãy cập nhật trình điều khiển trên Bộ điều hợp hiển thị của bạn. Nếu bạn có thể xem video YouTube bằng trình duyệt khác, thì hãy tiếp tục bước tiếp theo. </p> <p> </p> <h6> Bước 2. Tắt Tăng tốc phần cứng trong Chrome. </h6> <p> Bước tiếp theo để giải quyết vấn đề &quot;Video YouTube không tải trong Chrome&quot; là tắt tính năng tăng tốc phần cứng trong trình duyệt Chrome. Để làm việc đó: </p> <p> 1. Từ menu Chrome <img src=\"images/image_thumb-78-483.png\" alt=\"image\" loading=\"lazy\"> lựa chọn <strong> Cài đặt </strong> . </p> <p><img src=\"images/image_thumb-79-661.png\" alt=\"How to View and Export Chrome Passwords.\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Tại <strong> Cài đặt </strong> trang, cuộn xuống và nhấp vào <strong> Nâng cao </strong><strong> . </strong></p> <p><img src=\"images/image_thumb-15-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Kéo <strong> Sử dụng tính năng tăng tốc phần cứng khi có sẵn </strong> chuyển sang <strong> TẮT </strong> và sau đó nhấp vào <strong> Khởi động lại. </strong></p> <p><img src=\"images/image_thumb-16-156.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Kiểm tra xem bạn có thể xem video YouTube ngay bây giờ không. Nếu không, sau đó tiếp tục bước 3. </p> <p> </p> <h6> Bước 3. Xóa dữ liệu duyệt web (Cookie, Cache, v.v.). </h6> <p> Bước tiếp theo để giải quyết sự cố &#39;video YouTube không tải &quot;trong Chrome là xóa dữ liệu duyệt web. Để thực hiện điều đó: </p> <p> 1. Từ menu Chrome <img src=\"images/image_thumb-78-896.png\" alt=\"image\" loading=\"lazy\"> lựa chọn <strong> Thêm công cụ </strong> &gt; <strong> Xóa dữ liệu truy cập </strong> . </p> <p><img src=\"images/image_thumb-17-593.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Tại tùy chọn Xóa dữ liệu duyệt web, chọn <strong> Mọi lúc </strong> (tại &#39;Phạm vi thời gian&#39;) và sau đó nhấp vào <strong> Xóa dữ liệu </strong> . </p> <p><img src=\"images/image_thumb-18-321.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Khởi động lại Chrome và thử xem video trên YouTube. Nếu sự cố vẫn tiếp diễn thì hãy tiếp tục giải pháp tiếp theo. </p> <p> </p> <h6> Bước 4: Xóa dữ liệu và cài đặt được lưu trữ trong Hồ sơ trên Chrome của bạn. </h6> <p> Đôi khi, trình duyệt Chrome không hoạt động bình thường nếu cấu hình Chrome bị hỏng. Vì vậy, một phương pháp dễ dàng để giải quyết các sự cố của Chrome là tạo lại thư mục hồ sơ Chrome. Để làm việc đó: </p> <p><strong> 1. </strong> <strong> Đồng thời </strong> nhấn &quot; <strong> các cửa sổ </strong> &quot;+&quot; <strong> R </strong> ”Chìa khóa để mở <em> CHẠY </em> cửa sổ. </p> <p><strong> 2. </strong> Trong <em> CHẠY </em> cửa sổ sao chép và dán lệnh sau theo Hệ điều hành Windows của bạn và nhấn <strong> đồng ý </strong> : </p> <ul> <li><strong> Windows 10, 8, 7 hoặc Vista: </strong> <ul> <li><strong> % LOCALAPPDATA% \\ Google \\ Chrome \\ </strong></li> </ul> </li> </ul> <p><img src=\"images/image_thumb4-325.png\" alt=\"chrome profile data\" loading=\"lazy\"></p> <ul> <li><strong> Windows XP: </strong> <ul> <li><strong> % USERPROFILE% \\ Cài đặt cục bộ \\ Dữ liệu ứng dụng \\ Google \\ Chrome \\ </strong></li> </ul> </li> </ul> <p> </p> <p> 3. <strong> Đổi tên </strong> thư mục &#39;Dữ liệu Người dùng&#39; thành &quot;Dữ liệu Người dùng.OLD&quot;, hoặc <strong> xóa bỏ* </strong> thư mục &#39;Dữ liệu Người dùng&#39;. </p> <p><strong> * Lưu ý quan trọng: </strong> Hãy nhớ rằng bằng cách xóa thư mục lưu trữ hồ sơ trên Chrome, bạn sẽ xóa tất cả dữ liệu được lưu trữ (Dấu trang, Mật khẩu, Cài đặt, Tiện ích mở rộng, Lịch sử, v.v.). Vì vậy, trước khi xóa hồ sơ của bạn, hãy <a href=\"https://www.repairwin.com/how-to-backup-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> sao lưu các dấu trang Chrome của bạn </a> và <a href=\"https://www.repairwin.com/how-to-view-and-export-chrome-passwords/\" target=\"_blank\" rel=\"nofollow noopener\"> lưu trữ Mật khẩu Chrome của bạn. </a></p> <p> </p> <p><img src=\"images/image_thumb11_thumb-690.png\" alt=\"chrome profile storage folder\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Mở </strong> Google Chrome, hãy thử xem video YouTube. </p> <h6></h6> <h6> Các giải pháp khác để giải quyết vấn đề &quot;Video YouTube không mở trong Chrome&quot;. </h6> <blockquote><p><strong> 1. </strong> Cập nhật Google Chrome. (Từ menu Chrome <img src=\"images/image_thumb-78-732.png\" alt=\"image\" loading=\"lazy\"> nhấp chuột <strong> Cứu giúp </strong> và sau đó chọn <strong> Về Google Chrome </strong> .) </p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Kiểm tra máy tính của bạn để tìm vi rút, phần mềm độc hại, v.v. </a></p> <p><strong> 3. </strong> Cập nhật trình điều khiển của Bộ điều hợp hiển thị. </p> <p><strong> 4. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Gỡ cài đặt hoàn toàn và cài đặt lại Chrome </a> . </p> <p><strong> 5. </strong> Sử dụng trình duyệt Web khác. </p></blockquote> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}