{"title":"Khắc phục: Thanh cột Outlook (Thanh tiêu đề) Biến mất trong Outlook 2016/2019. (Đã giải quyết)","content":"<p> Một vài ngày trước, một trong những khách hàng của tôi đã liên hệ với tôi để báo cáo rằng thanh có (các) tiêu đề cột (Gửi, Từ, Chủ đề, Đã nhận, Kích thước, v.v.) bị thiếu trong Outlook 2019. Cụ thể hơn, hàng có tiêu đề cột đã biến mất sau khi người dùng tùy chỉnh &#39;Cài đặt xem&#39; và tăng kích thước phông chữ ROW. </p> <p><img src=\"images/image_thumb-567.png\" alt=\"FIX: Outlook Columns Bar (Header Bar) Disappear in Outlook 2016/2019\" loading=\"lazy\"></p> <p> Hướng dẫn này chứa các hướng dẫn về cách khắc phục sự cố &quot;Thiếu thanh tiêu đề Outlook (Hàng cột)&quot; trong Outlook 2016/2019. </p> <h4> Cách khắc phục: Thiếu hàng tiêu đề cột trong Outlook 2016/2019. </h4> <p> 1. Trên ngăn bên trái, với các thư mục Outlook, hãy chọn thư mục mà bạn không thể nhìn thấy Hàng có Cột (tiêu đề). </p> <p> 2. Trên thanh menu, chọn <strong> Lượt xem </strong> và sau đó nhấp vào <strong> Giao diện cài đặt </strong> . </p> <p><img src=\"images/image_thumb-1-535.png\" alt=\"FIX Column Heading Row is Missing Outlook 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Trong các tùy chọn &#39;Cài đặt Chế độ xem Nâng cao&#39;, hãy nhấp vào <strong> Các thiết lập khác </strong> . </p> <p><img src=\"images/image_thumb-2-711.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Trong các tùy chọn &#39;Cài đặt Khác&#39;, <strong> bỏ chọn </strong> các <strong> Sử dụng bố cục nhỏ gọn với nhỏ hơn 125 ký tự </strong> hộp kiểm và nhấp vào <strong> đồng ý </strong> hai lần để áp dụng cài đặt và để đóng tất cả các cửa sổ. </p> <p><img src=\"images/image_thumb-3-736.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Khởi động lại Outlook (hoặc điều hướng đến một thư mục khác và quay lại thư mục bạn đã áp dụng thay đổi), để xem thanh có tiêu đề cột trở lại vị trí cũ. </p> <p><img src=\"images/image_thumb-4-249.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-5.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p>"}