{"title":"Khắc phục: Bản cập nhật Windows 10 không thể gỡ cài đặt Avira AntiVir (Solved)","content":"<p> Trên máy tính Windows 10, thông báo sau xuất hiện khi cố gắng cập nhật Windows 10 lên phiên bản 1803 hoặc 1809: &quot;Một số Ứng dụng cần được gỡ cài đặt: Các chương trình này cần được gỡ cài đặt vì chúng không tương thích với Bản nâng cấp: Avira Antivirus&quot; và khi nhấn nút &quot;Gỡ cài đặt và tiếp tục&quot;, lỗi sau xuất hiện: &quot;Chúng tôi không thể gỡ cài đặt các ứng dụng này: Avira AntiVir&quot;. Điều buồn cười với vấn đề này là Avira Antivir (Antivirus) nó không được cài đặt trên PC (không được liệt kê trong các chương trình đã cài đặt). </p> <p><img src=\"images/image_thumb-10-929.png\" alt=\"Windows 10 Update Couldn't uninstall Avira AntiVir\" loading=\"lazy\"></p> <p> Sự cố &quot;Không thể gỡ cài đặt Avira AntiVir&quot; trong quá trình nâng cấp Windows 10 v1803, xảy ra do chương trình cập nhật tìm thấy một số tệp trên PC của bạn được liên kết với Avira Antivirus và chúng chưa được gỡ bỏ trong quá trình Gỡ cài đặt Avira. * </p> <p> * Lưu ý: Nếu bạn thực sự đã cài đặt chương trình &quot;Avira Antivirus&quot; trên máy của mình, hãy gỡ cài đặt chương trình này bằng cách sử dụng tùy chọn &quot;Chương trình và Tính năng&quot; trong bảng điều khiển và sau đó tiến hành cập nhật hệ thống của bạn lên Windows 10 v1803 (hoặc 1809). Sau khi nâng cấp, hãy tải xuống và cài đặt phiên bản Avira Antivirus mới nhất trong hệ thống của bạn. </p> <h4> Cách khắc phục lỗi cập nhật Windows 10: Không thể gỡ cài đặt Avira AntiVir. </h4> <p> </p> <p> 1. Khởi động Windows trong <strong> Chế độ an toàn </strong> . Để làm việc đó: </p> <ul> <li> <ul> <li> Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-432.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. </li> <li> Kiểu <strong> msconfig </strong> và hãy nhấn <strong> Đi vào </strong> . </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-47-667.png\" alt=\"msconfig\" loading=\"lazy\"></p> <ul> <li> <ul> <li> Tại <strong> Khởi động </strong> chọn tab <strong> Khởi động an toàn </strong> tùy chọn, sau đó nhấp vào <strong> đồng ý </strong> và khởi động lại máy tính của bạn. </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-48-342.png\" alt=\"safe boot windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Sau khi khởi động lại, hãy mở trình khám phá tệp và xóa <strong> avipbb.sys </strong> gửi từ các vị trí sau: </p> <ul> <li> C: \\ Windows \\ System32 \\ driver </li> <li> C: \\ Windows \\ SysWOW64 \\ driver </li> </ul> <p> </p> <p> 3. Tiến hành xóa khỏi các vị trí trên mọi tệp khác có tên <strong> avipbb </strong> mặc dù phần mở rộng của nó. </p> <p> 4. Sau đó xóa <strong> Avira </strong> thư mục từ vị trí sau: </p> <ul> <li> (Windows 64-bit): C: \\ Program Files (x86) \\ <strong> Avira \\ Antivirus </strong></li> <li> (Windows 32-bit): C: \\ Program Files \\ <strong> Avira \\ Antivirus </strong></li> </ul> <p> 5. Chạy <strong> msconfig </strong> lần nữa. <br> 6. Tại tab Chung, bấm Khởi động bình thường và bấm <strong> đồng ý </strong> , để khởi động lại máy tính của bạn một cách bình thường. </p> <p><img src=\"images/image_thumb-11-949.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Kiểm tra và cài đặt các bản cập nhật. * </p> <p> * Lưu ý: Nếu bạn vẫn gặp lỗi &quot;Không thể gỡ cài đặt Avira AntiVir&quot; trong quá trình cập nhật, hãy tải xuống và chạy <a href=\"https://www.avira.com/en/support-download-avira-registrycleaner/1//\" target=\"_blank\" rel=\"nofollow noopener\"> Avira Registry Cleaner </a> . </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}