{"title":"Khắc phục: Máy tính của bạn không thể kết nối với một phiên bảng điều khiển khác vì bạn đã có một phiên bảng điều khiển đang diễn ra. (Đã giải quyết)","content":"<p> Trên máy tính chạy Windows, xuất hiện lỗi sau trong Kết nối Máy tính Từ xa: &quot;Máy tính của bạn không thể kết nối với phiên bảng điều khiển trên máy tính từ xa vì bạn đã có một phiên bảng điều khiển đang diễn ra&quot;. </p> <p> </p> <p><img src=\"images/image_thumb-3-627.png\" alt=\"Your computer could no connect to console session on the remote computer because you already have a console session in progress.\" loading=\"lazy\"></p> <p> </p> <p> Hướng dẫn này chứa các hướng dẫn để giải quyết lỗi Kết nối Máy tính Từ xa sau: &quot;Máy tính của bạn không thể kết nối với phiên bảng điều khiển trên máy tính từ xa vì bạn đã có một phiên bảng điều khiển đang diễn ra&quot;. </p> <h4> Cách khắc phục: Kết nối Máy tính Từ xa Không thể Kết nối vì bạn đã có một Phiên điều khiển đang được tiến hành. </h4> <p> Lỗi &quot;Máy tính của bạn không thể kết nối với phiên bảng điều khiển trên máy tính từ xa vì bạn đã có phiên bảng điều khiển đang diễn ra&quot;, nguyên nhân là do một trong các bộ điều hợp mạng trên máy tính của bạn (từ RDP), có cùng địa chỉ IP với máy tính mà bạn đang cố gắng kết nối, thông qua màn hình từ xa. </p> <p> Ví dụ: nếu máy tính từ xa có địa chỉ IP: &quot;192.168.1.157&quot;, hãy làm theo các bước bên dưới: </p> <p> 1. Mở <strong> Command Prompt với tư cách là quản trị viên </strong> trên máy tính của bạn (từ RDP). <br> 2. Đưa ra lệnh sau để xem Địa chỉ IPv4 được chỉ định trên PC của bạn. </p> <ul> <li><strong> ipconfig </strong></li> </ul> <p> </p> <p> 3. Bây giờ xác định bộ điều hợp mạng nào trên máy tính cục bộ của bạn (RDP từ), có cùng địa chỉ IP với máy tính từ xa (RDP tới). <br> 4. Khi bạn tìm thấy bộ điều hợp mạng LAN nào trên máy tính cục bộ của mình, có cùng địa chỉ IP với máy tính từ xa, hãy tiếp tục và thay đổi địa chỉ IP trên bộ điều hợp đó thành một địa chỉ khác. * </p> <p> ví dụ. Tại ví dụ này, IP của máy tính từ xa là: &quot;192.168.1.157&quot;, vì vậy chúng ta phải thay đổi Địa chỉ IP của bộ điều hợp Ethernet (trên máy tính cục bộ) thành một địa chỉ khác: ví dụ: thành: &quot;192.168.1.160&quot;. </p> <p><img src=\"images/image_thumb-5-946.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> * Lưu ý: Nếu địa chỉ IP trên mạng cục bộ của bạn được máy chủ DHCP chỉ định, thì bạn có các tùy chọn sau để vượt qua sự cố: </p> <blockquote><p> a. Để chỉ định thủ công một địa chỉ IP tĩnh khác. <br> b. Để khởi động lại bộ định tuyến của bạn (máy chủ DHCP), để &quot;lấy&quot; một Địa chỉ IP khác từ máy chủ DHCP. <br> c. Để cấu hình máy chủ DHCP (ví dụ: trên bộ định tuyến), cung cấp địa chỉ IP cho một dải không bao gồm địa chỉ IP của máy tính từ xa. (ví dụ: &quot;192.168.1.200-192.168.1.250&quot; </p></blockquote> <p> </p> <p> 5. Sau khi thay đổi địa chỉ IP trên máy tính cục bộ của bạn (từ RDP), hãy mở kết nối Máy tính Từ xa và cố gắng kết nối với Máy tính từ xa. Lỗi &quot;Máy tính của bạn không thể kết nối với một phiên bảng điều khiển khác vì bạn đã có một phiên bảng điều khiển đang diễn ra&quot; sẽ được giải quyết. </p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? </p> <p> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}