{"title":"Khắc phục: Phần bổ trợ Outlook được Cài đặt cho tất cả người dùng và không thể gỡ bỏ. (Đã giải quyết)","content":"<p> Nếu bạn không thể tắt hoặc bật Phần bổ trợ Outlook do lỗi &quot; <em> Tiện ích bổ sung được cài đặt cho tất cả người dùng trên máy tính này và chỉ quản trị viên mới có thể kết nối hoặc ngắt kết nối </em> &quot;, hãy tiếp tục đọc bên dưới để giải quyết vấn đề. </p> <p><img src=\"images/image_thumb-76-527.png\" alt=\"The add-is installed for all users on this computer, and can only be connected or disconnected by an administrator\" loading=\"lazy\"></p> <p> Lỗi &quot;Chỉ có thể bị vô hiệu hóa bởi Quản trị viên&quot; xuất hiện bởi vì khi bạn cài đặt bổ trợ, bạn chọn cài đặt nó cho tất cả người dùng trên máy tính. Trong trường hợp này, giải pháp duy nhất để giải quyết lỗi là gỡ cài đặt bổ trợ bằng cách sử dụng đặc quyền quản trị. </p> <h2> Cách khắc phục: Không thể bật hoặc tắt bổ trợ vì được cài đặt cho tất cả người dùng trong Outlook, Word hoặc Excel. </h2> <p> Nếu bạn không thể xóa hoặc kích hoạt Phần bổ trợ trong ứng dụng Microsoft Office do lỗi &quot; <em> Tiện ích bổ sung được cài đặt cho tất cả người dùng trên máy tính này và chỉ quản trị viên mới có thể kết nối hoặc ngắt kết nối &quot;, </em> khởi chạy ứng dụng tương ứng với tư cách Quản trị viên và tiến hành gỡ bỏ Bổ trợ mà không gặp sự cố. Để làm việc đó: </p> <p><strong> 1. </strong> Bấm chuột phải vào ứng dụng Office, nơi bạn gặp lỗi được đề cập ở trên (ví dụ: Outlook) và chọn <strong> Chạy như quản trị viên. * </strong></p> <p> * Ghi chú: <strong><br> </strong> 1. Nếu bạn không thấy tùy chọn &quot;Run Administrator&quot;, hãy nhấn và giữ <strong> SHIFT </strong> chìa khóa và <strong> nhấp chuột phải </strong> tại ứng dụng Office, bạn phải đối mặt với lỗi. <br> 2. Nếu bạn nhấp chuột phải vào ứng dụng Office từ Windows 10 <strong> Khởi đầu </strong> thực đơn <img src=\"images/image_thumb2_thumb_thumb-340.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Các chương trình </strong> , đi đến <strong> Hơn </strong> &gt; <strong> Chạy như quản trị viên. </strong></p> <p><img src=\"images/image_thumb-77-661.png\" alt=\"FIX: Unable to Enable or Disable Add-in \" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Khi được yêu cầu cho phép ứng dụng này thực hiện các thay đổi đối với thiết bị của bạn, hãy chọn <strong> Đúng. </strong></p> <p><img src=\"images/image_thumb-78-120.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Sau khi mở ứng dụng Office, hãy tiến hành tắt hoặc bật Phần bổ trợ bạn muốn. Lần này bổ trợ sẽ bị xóa mà không có vấn đề gì. </p> <p> Đó là nó! Hãy cho tôi biết nếu hướng dẫn này đã giúp bạn bằng cách để lại nhận xét của bạn về trải nghiệm của bạn. Hãy thích và chia sẻ hướng dẫn này để giúp đỡ những người khác. </p>"}