{"title":"Khắc phục: Đặt lại Thời gian gia hạn 120 ngày trên Máy chủ RDS 2016/2012.","content":"<p> Nếu bạn đã cài đặt RDS Server 2016 cho mục đích thử nghiệm và thời gian gia hạn cấp phép RDS đã hết hạn, thì hãy tiếp tục đọc phần bên dưới để tìm hiểu cách đặt lại thời gian gia hạn 120 ngày. Như bạn có thể biết khi cài đặt RDS Server 2016, bạn có 120 ngày để cài đặt giấy phép truy cập máy khách RD (RD CAL), nếu không người dùng sẽ không thể thiết lập phiên RDP trên máy chủ Máy chủ phiên RD nữa, với lỗi &quot;Điều khiển từ xa phiên máy tính để bàn đã bị ngắt kết nối vì không có máy chủ Giấy phép Máy tính Từ xa nào có sẵn để cung cấp giấy phép &quot;. </p> <p><img src=\"images/image_thumb-32-368.png\" alt=\"Reset 120 Days Grace Period on RDS Server 2012/2016\" loading=\"lazy\"></p> <p> </p> <h4> Cách Đặt lại Thời gian Gia hạn Cấp phép RDS trên Máy chủ 2012 hoặc 2016. * </h4> <p><strong> * Quan trọng: </strong> Chỉ áp dụng các hướng dẫn bên dưới khi bạn đang sử dụng RDS Server 2016 trên môi trường thử nghiệm. Nếu bạn muốn sử dụng Máy chủ RDS trên môi trường sản xuất thì hãy tiếp tục và mua RD CAL. </p> <p> Để kéo dài Thời gian Gia hạn 120 ngày trên Máy chủ Cấp phép RDS: </p> <p> 1. Mở Registry Editor và điều hướng theo phím sau: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Control \\ Terminal Server \\ RCM \\ GracePeriod </li> </ul> <p> 2. Nhấp chuột phải vào phím &#39;GracePeriod&#39; và chọn <strong> Quyền hạn. </strong></p> <p><img src=\"images/image_thumb-33-473.png\" alt=\"Reset Grace Period RDS 2016\" loading=\"lazy\"></p> <p> </p> <p> 3. Sau đó nhấp vào <strong> Nâng cao </strong> . </p> <p><img src=\"images/image_thumb-34-585.png\" alt=\"Reset RDS Grace Period\" loading=\"lazy\"></p> <p> </p> <p> 4. Chọn <strong> Quản trị viên </strong> đối tượng và nhấp chuột <strong> Biên tập </strong> . </p> <p><img src=\"images/image_thumb-18-417.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Thay đổi quyền thành <strong> Kiểm soát hoàn toàn </strong> và bấm vào <strong> ĐỒNG Ý. </strong></p> <p><img src=\"images/image_thumb-19-737.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Nhấp chuột phải vào giá trị &quot;L $ RTMTIMEBOMB…&quot; và chọn <strong> Xóa bỏ </strong> . </p> <p><img src=\"images/image_thumb-35-208.png\" alt=\"Reset RDS Licensing Grace Pariod\" loading=\"lazy\"></p> <p> </p> <p> 7. Đóng Registry Editor và khởi động lại RDS Server. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}