{"title":"Khắc phục: Windows không thể cài đặt các tệp được yêu cầu - Mã lỗi 0x80070570 (Đã giải quyết)","content":"<p> Hướng dẫn này chứa các hướng dẫn để khắc phục lỗi cài đặt Windows 0x80070570: &quot;Windows không thể cài đặt các tệp được yêu cầu. Tệp có thể bị hỏng hoặc bị thiếu. Đảm bảo rằng tất cả các tệp cần thiết để cài đặt đều có sẵn và khởi động lại cài đặt&quot;. Lỗi cài đặt Windows 0x80070570 thường xuất hiện khi cài đặt HĐH Windows 10, 8 hoặc 7 từ phương tiện cài đặt USB 3.0. </p> <p><img src=\"images/image_thumb-17-309.png\" alt=\"FIX: Windows Cannot Install Required Files 0x80070570\" loading=\"lazy\"></p> <p> </p> <h4> Cách khắc phục Windows không thể cài đặt tệp được yêu cầu - Mã lỗi 0x80070570 (Windows 10/8/7) </h4> <h6> Bước 1. Ngắt kết nối bất kỳ thiết bị được kết nối nào. </h6> <p> Bước đầu tiên để giải quyết lỗi 0x80070570 &quot;Windows không thể cài đặt tệp được yêu cầu&quot; là ngắt kết nối bất kỳ thiết bị nào khác (ví dụ: ổ đĩa cứng, Ổ cứng USB, thẻ USB Wireless) không cần thiết để cài đặt Windows. </p> <p> </p> <h6> Bước 2. Tắt <strong> Thiết bị bảo mật được nhúng </strong> . </h6> <p> Lỗi cài đặt Windows 10 &quot;Windows Không thể Cài đặt Tệp Yêu cầu&quot;, thường xuất hiện trên HP PC nơi &#39;Thiết bị Bảo mật Nhúng&#39; được bật theo mặc định. Để vượt qua lỗi, hãy tiến hành và tắt thiết bị bảo mật trong cài đặt BIOS. Để làm việc đó: </p> <p> 1. <strong> Bật nguồn </strong> PC và <strong> nhấn </strong> các <strong> F10 </strong> phím để nhập trong cài đặt BIOS. <br> 2. Sử dụng các phím mũi tên của bạn, điều hướng đến <strong> Bảo vệ </strong> -&gt; <strong> Bảo mật thiết bị </strong> và hãy nhấn <strong> Đi vào. <br> </strong> 3. Đặt <strong> Thiết bị bảo mật được nhúng </strong> từ &#39;Thiết bị khả dụng&#39; sang <strong> Thiết bị bị ẩn. </strong></p> <p><img src=\"images/image_thumb-23-480.png\" alt=\"FIX: HP SLOW RESTART\" loading=\"lazy\"></p> <p> </p> <p> 4. Nhấn nút <strong> F10 </strong> phím để áp dụng thay đổi. <br> 5. <b> Lưu các thay đổi và thoát f </b> cài đặt rom bios. <br> 6. Cài đặt Windows 10. </p> <h6> Bước 3. Sử dụng Cổng USB hoặc Phương tiện Cài đặt khác. </h6> <p> Lỗi &quot;Windows Cannot Install Required Files&quot;, thường xảy ra nếu bạn thiết lập Windows 10 từ phương tiện USB được kết nối với cổng USB 3.0. Vì vậy, hãy thử những cách sau: </p> <ol> <li> Kiểm tra xem bạn có thể tắt hỗ trợ USB 3.0 từ cài đặt BIOS hay không. </li> <li> Kết nối ổ USB với cổng USB 2.0 (hoặc với cổng USB khác). </li> <li> Nếu PC của bạn không có cổng USB 2.0, hãy cài đặt Windows 10 từ ổ đĩa flash USB 2.0 hoặc từ đĩa DVD. </li> <li> Nếu bạn muốn cài đặt Windows 10 vào hệ thống dựa trên UEFI, hãy sử dụng tiện ích RUFUS và tạo Phương tiện cài đặt USB cho &quot;UEFI&quot;. Nếu hệ thống của bạn không hỗ trợ UEFI, hãy tạo Phương tiện cài đặt USB cho hệ thống dựa trên &quot;Kế thừa&quot;. (Hướng dẫn chi tiết để làm điều đó, có thể được tìm thấy tại đây: <a href=\"https://www.repairwin.com/create-windows-usb-with-rufus-iso-to-usb/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách tạo Ổ đĩa khởi động Windows USB bằng tiện ích Rufus. </a></li> <li> Re- <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> tải xuống tệp ISO Windows </a> và tạo Phương tiện cài đặt Windows USB mới, sử dụng RUFUS. </li> </ol> <p> </p> <h6> Bước 4. Cài đặt Windows 10 từ thiết bị USB cũ. </h6> <p> Nếu bạn nhận được lỗi &quot;Windows Cannot Install Required Files&quot;, khi bạn thiết lập Windows 10 từ USB Media được tạo cho hệ thống UEFI, sau đó tạo USB Media mới cho hệ thống cũ và khởi động từ thiết bị USB cũ để cài đặt Windows 10. </p> <p> </p> <h6> Bước 5. Chẩn đoán sự cố của bộ nhớ. </h6> <p> Bước thứ ba để giải quyết lỗi thiết lập Windows 0x80070570 là chẩn đoán RAM của bạn có vấn đề gì không. Để hoàn thành tác vụ này, hãy làm theo hướng dẫn từ bài viết sau: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách chẩn đoán sự cố bộ nhớ máy tính với Memtest86 + </a></li> </ul> <p> </p> <h6> Bước 6. Kiểm tra ổ cứng xem có vấn đề gì không. </h6> <p> Lỗi Cài đặt Windows 0x80070570 có thể xảy ra nếu ổ cứng bị hỏng. Vì vậy, hãy tiến hành và chẩn đoán lỗi HDD và thay thế ổ cứng nếu cần, bằng cách làm theo các hướng dẫn trong hướng dẫn này: </p> <ul> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Các công cụ chẩn đoán &amp; kiểm tra ổ cứng tốt nhất để kiểm tra tình trạng ổ cứng </a></li> </ul> <h5></h5> <h6> Bước 7. Kiểm tra kết nối cáp và phần cứng. </h6> <p> Nếu sau khi thực hiện các bước trên, lỗi cài đặt Windows 0x80070570 vẫn xuất hiện, thì: </p> <p> 1. Kiểm tra tất cả các kết nối cáp và đảm bảo rằng ổ cứng đã được kết nối đúng cách. Ngoài ra, nếu bạn sở hữu một máy tính để bàn, hãy thay thế cáp dữ liệu của ổ cứng. <br> 2. Cố gắng cài đặt Windows bằng cách sử dụng một card màn hình (VGA) khác nếu bạn có thể. <br> 3. Cập nhật BIOS của bạn. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trong các mạng xã hội để giúp lan truyền rộng rãi về vấn đề này. </p>"}