{"title":"Khắc phục: Không thể cài đặt XPS Viewer trong Windows 10 (Đã giải quyết)","content":"<p> Trong hướng dẫn trước, tôi đã đề cập đến các bước cần thiết để <a href=\"https://www.repairwin.com/how-to-install-xps-viewer-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> cài đặt XPS Viewer trên Windows 10 </a> . Tuy nhiên, một số người dùng phàn nàn rằng họ không thể cài đặt XPS Viewer vì trình xem XPS không được liệt kê sau khi nhấn nút &#39;Thêm tính năng&#39; (Ứng dụng&gt; Quản lý tính năng tùy chọn&gt; Thêm tính năng) hoặc không thể cài đặt. </p> <p> Hướng dẫn này bao gồm các hướng dẫn về cách khắc phục sự cố cài đặt trình xem XPS trong các phiên bản Windows 10 1803 &amp; 1809. </p> <h4> Cách giải quyết sự cố cài đặt XPS Viewer trong Windows 10. </h4> <h6> Phương pháp 1. Gỡ cài đặt và cài đặt lại Microsoft XPS Document Writer. </h6> <p> 1. Mở <strong> Chương trình và các tính năng </strong> và sau đó nhấp vào <strong> Bật hoặc tắt các tính năng của Windows </strong> . </p> <p><img src=\"images/image_thumb-61-948.png\" alt=\"FIX: Cannot Install XPS Viewer - Windows 10\" loading=\"lazy\"></p> <p> 2. <strong> Bỏ chọn </strong> các <strong> Hộp Microsoft XPS Document Writer </strong> va đanh <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-62-338.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Bây giờ hãy nhấp vào <strong> Bật hoặc tắt các tính năng của Windows </strong> một lần nữa và <strong> kiểm tra </strong> các <strong> Microsoft XPS Document Writer </strong> hộp và nhấp vào <strong> ĐỒNG Ý. <br> </strong> 4. <strong> Khởi động lại </strong> PC của bạn. <br> 5. Cố gắng cài đặt XPS Viewer. </p> <p> </p> <h6> Phương pháp 2. Cài đặt XPS Viewer bằng lệnh DISM. </h6> <p> 1. Mở <strong> Command Prompt với tư cách là quản trị viên </strong> . <br> 2. Trong dấu nhắc lệnh, đưa ra lệnh sau và nhấn <strong> Đi vào </strong> . </p> <ul> <li><strong> dism / Online / Add-Capability /CapabilityName:XPS.Viewer~~~~0.0.1.0 </strong></li> </ul> <p><img src=\"images/image_thumb-65-661.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Phương pháp 3. Tải xuống XPS Viewer từ Windows Update thay vì WSUS. (Windows 10 Pro &amp; Enterprise). </h6> <p> Nếu bạn đang sử dụng Windows 10 Pro hoặc Enterprise, hãy áp dụng các bước sau trong Group Policy Editor. * </p> <p> * Lưu ý: Nếu máy tính thuộc về Miền, bạn cần sửa đổi cài đặt chính sách nhóm miền (GPO) và sau đó chạy lệnh &quot;gpupdate / force&quot; trước khi cài đặt XPS Viewer. </p> <p> 1. Open Group Policy Editor. Để làm việc đó: </p> <blockquote><p> 1. Nhấn đồng thời Windows <img src=\"images/image_thumb36-656.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại <strong> gpedit.msc </strong> &amp; Nhấn <strong> Đi vào. </strong></p></blockquote> <p><img src=\"images/image_thumb-78-514.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Ở ngăn bên trái, điều hướng đến: </p> <ul> <li><strong> cấu hình máy tính </strong> -&gt; <strong> mẫu hành chính </strong> -&gt; <strong> Hệ thống </strong></li> </ul> <p> 3. Tại ngăn bên phải, nhấp đúp vào <strong> Chỉ định cài đặt để cài đặt thành phần tùy chọn và sửa chữa thành phần </strong></p> <p><img src=\"images/image_thumb-63-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Đặt chính sách thành <strong> Đã bật </strong> và sau đó kiểm tra <strong> Tải xuống nội dung sửa chữa và các tính năng tùy chọn trực tiếp từ Windows Update thay vì Windows Server Update Services (WSUS) </strong> cái hộp. </p> <p> 5. Khi hoàn tất, hãy nhấp vào <strong> Ứng dụng </strong> và <strong> đồng ý </strong> và <strong> khởi động lại </strong> PC của bạn. </p> <p><img src=\"images/image_thumb-64-264.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Sau khi khởi động lại, hãy thử <a href=\"#install-xps-viewer-dism\" target=\"_blank\" rel=\"nofollow noopener\"> cài đặt Trình xem XPS bằng phương pháp DISM </a> ở trên. <br> 7. Sau khi cài đặt trình xem XPS, hãy mở Trình chỉnh sửa chính sách nhóm và hoàn nguyên các thay đổi. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}