{"title":"Khắc phục: Outlook Tập hợp các thư mục không thể mở được. (GIẢI QUYẾT)","content":"<p> Hướng dẫn này chứa các hướng dẫn để giải quyết lỗi sau trong Microsoft Outlook: &quot;Không thể khởi động Microsoft Outlook. Không thể mở cửa sổ Outlook. Không thể mở tập hợp thư mục. Máy chủ không khả dụng. Hãy liên hệ với quản trị viên của bạn nếu tình trạng này vẫn tiếp diễn&quot;. </p> <p><img src=\"images/image_thumb-404.png\" alt=\"FIX: Cannot start Outlook. The set of folders cannot be opened\" loading=\"lazy\"></p> <p> Lỗi &quot;Không thể mở bộ thư mục&quot; trong Outlook, có thể xuất hiện trong tất cả các phiên bản Outlook và xảy ra khi tệp dữ liệu Outlook PST bị hỏng. Để khắc phục sự cố, hãy tiến hành và sửa chữa tệp dữ liệu Outlook theo hướng dẫn bên dưới. </p> <h4> Cách khắc phục: Không thể mở Bộ thư mục trong Microsoft Outlook 2013, 2019, 2019. </h4> <p> 1. Điều hướng đến Bảng điều khiển Windows. Để làm việc đó: </p> <blockquote><p> a. Nhập &quot;bảng điều khiển&quot; vào hộp tìm kiếm của Windows <br> b. Nhấp chuột <strong> Bảng điều khiển </strong> từ các kết quả. </p></blockquote> <p><img src=\"images/image_thumb-53-338.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> 2. Đặt <strong> Xem bởi </strong> đến <strong> Biểu tượng nhỏ </strong> để xem tất cả các mục trong bảng điều khiển và sau đó nhấp vào <strong> Thư </strong> . </p> <p><img src=\"images/image_thumb-54-403.png\" alt=\"control panel mail options\" loading=\"lazy\"></p> <p> 3. Nhấp vào <strong> Hồ sơ dữ liệu </strong> cái nút. </p> <p><img src=\"images/image_thumb-1-310.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Lưu ý tên và vị trí của tệp dữ liệu &quot;Outlook.pst&quot; và đóng tất cả các cửa sổ đang mở. * </p> <p> * Lưu ý: Nếu bạn có Exchange (tài khoản IMAP) thì bạn sẽ thấy tệp dữ liệu .OST (ví dụ: &quot;Outlook.ost&quot;). Trong trường hợp này, buộc Outlook tạo lại &quot;tệp Outlook .OST bị hỏng, bằng cách thực hiện như sau: </p> <blockquote><p> 1. Nhấp vào <strong> Mở vị trí file </strong> . <br> 2. <strong> Đổi tên </strong> dữ liệu OST cho tài khoản đang gây ra sự cố (nếu bạn có nhiều tài khoản IMAP). <br> 3. Mở Outlook để tạo lại tệp OST… </p> <p><img src=\"images/image_thumb-2-778.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 5. Mở Windows explorer và xác định vị trí <strong> scanpst.exe </strong> công cụ sửa chữa tại địa điểm này: * </p> <ul> <li> C: \\ Program Files \\ Microsoft Office \\% OfficeVersion% \\ SCANPST.EXE </li> </ul> <p> * Lưu ý: Dưới đây là đề cập đến (các) vị trí của tệp &quot;SCANPST.EXE&quot; theo phiên bản Office đã cài đặt. Nếu bạn không thể tìm thấy &quot;scanpst.exe&quot; tại (các) vị trí trên, hãy xem: </p> <ul> <li> <ul> <li> C: \\ Program Files (x86) \\ Microsoft Office \\ root \\ Office16. </li> </ul> </li> </ul> <blockquote><p><strong> Outlook 2013 </strong><br> Windows 32 bit&gt; C: \\ Program Files \\ Microsoft Office \\ Office15 <br> Windows 64-bit&gt; C: \\ Program Files (x86) \\ Microsoft Office \\ Office15 <br> Outlook 64-bit&gt; C: \\ Program Files \\ Microsoft Office \\ Office15 <br> Click-to-Run&gt; C: \\ Program Files \\ Microsoft Office 15 \\ root \\ office15 <br> <strong><br> Outlook 2010 </strong><br> Windows 32 bit&gt; C: \\ Program Files \\ Microsoft Office \\ Office14 <br> Windows 64-bit&gt; C: \\ Program Files (x86) \\ Microsoft Office \\ Office14 <br> Outlook 64-bit&gt; C: \\ Program Files \\ Microsoft Office \\ Office14 <br> <strong><br> Outlook 2007 </strong><br> Windows 32 bit&gt; C: \\ Program Files \\ Microsoft Office \\ Office12 <br> Windows 64-bit&gt; C: \\ Program Files (x86) \\ Microsoft Office \\ Office12 </p></blockquote> <p> 6. Nhấp đúp vào <strong> mở </strong> SCANPST.EXE <br> 7. Nhấp vào <strong> Duyệt qua </strong> . </p> <p><img src=\"images/image_thumb-55-538.png\" alt=\"scanpst.exe\" loading=\"lazy\"></p> <p> </p> <p> 8. Định vị và chọn tệp dữ liệu Outlook bị hỏng (ví dụ: Outlook.pst) và nhấp vào <strong> ĐỒNG Ý. </strong></p> <p> 9. Nhấn nút <strong> Quét </strong> và kiên nhẫn cho đến khi Công cụ sửa chữa hộp thư đến sửa chữa tệp bị hỏng. * </p> <p> * Lưu ý: Ở giai đoạn sửa chữa cuối cùng, bạn sẽ được hỏi có muốn tạo bản sao lưu hay không. Câu trả lời &quot; <strong> Đúng </strong> &quot;để tiếp tục hoạt động sửa chữa. </p> <p><img src=\"images/image_thumb-56-257.png\" alt=\"Outlook Inbox Repair Tool\" loading=\"lazy\"></p> <p> </p> <p> 10. Khi quá trình sửa chữa hoàn tất, hãy mở Outlook. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}