{"title":"Khắc phục: Màn hình đen Máy ảnh Skype và các sự cố Webcam khác trên Windows 10.","content":"<p> Sự cố máy ảnh Skype đen / màn hình trống, là một trong những sự cố phổ biến nhất trên Windows 10 và có thể do một số nguyên nhân gây ra, vì vậy đây là hướng dẫn từng bước để khắc phục. </p> <p> Trong Windows 10, bản cập nhật mới có thể gây ra nhiều sự cố với webcam tích hợp của bạn và máy ảnh có thể không hoạt động hoặc máy ảnh có thể không được nhận dạng trong một số ứng dụng trong khi nó hoạt động bình thường ở một số ứng dụng khác. Ví dụ: tôi đã gặp trường hợp trong khi máy ảnh hoạt động mà không gặp bất kỳ sự cố nào trong ứng dụng Webex và Zoom, nó lại hiển thị màn hình đen trong Skype. </p> <p> Hướng dẫn này bao gồm các hướng dẫn từng bước để khắc phục một số sự cố với máy ảnh tích hợp trên máy tính xách tay chạy Windows 10: * </p> <ul> <li><em> Webcam / Camera không hoạt động trên Windows 10 </em></li> <li><em><em> Webcam / Máy ảnh </em> Đã ngừng hoạt động sau khi Cập nhật trong Windows 10. </em></li> <li><em> Webcam không hoạt động trên một số ứng dụng (Skype, Windows Hello WebEx, v.v.). </em></li> <li><em> Webcam hiển thị màn hình đen (hoặc trống) khi được sử dụng trên Skype. </em></li> <li><em> Webcam đang hoạt động trên Skype nhưng hiển thị màn hình đen trong cửa sổ xem trước camera </em> . </li> <li> Các ứng dụng không thể nhận dạng hoặc tìm thấy Camera / Webcam </li> </ul> <p><strong> * Thông báo dành cho chủ sở hữu Lenovo ThinkPad: </strong> Nếu bạn sở hữu một trong các mẫu ThinkPad được liệt kê trong bảng dưới đây, hãy tiến hành tải xuống và cài đặt <a href=\"/Users/Admin/AppData/Local/Temp/OpenLiveWriter-1068186081/DC8297800EA7/Integrated%20Camera%20Driver%20Registry%20Patch%20for%20Windows%2010%20(Version%201709%20or%20later)%20-%20ThinkPad\" target=\"_blank\" rel=\"nofollow noopener\"> bản vá đăng ký từ Lenovo. </a> Bản vá khắc phục sự cố trong đó trình điều khiển máy ảnh tích hợp có thể không hoạt động bình thường sau khi nâng cấp lên Windows 10 phiên bản 1709 trở lên. </p> <p><img src=\"images/image_thumb-30-725.png\" alt=\"THinkpad Registry Fix for Integrated Camera\" loading=\"lazy\"></p> <h2> Cách khắc phục: Sự cố webcam trên Windows 10. </h2> <p> </p> <h3> Bước 1. Cho phép máy ảnh truy cập vào ứng dụng. </h3> <p> Trên Windows 10, Máy ảnh và Micrô có thể không khả dụng với các ứng dụng do cài đặt Quyền riêng tư có thể đã được áp dụng. Vì vậy, hãy tiến hành và cho phép ứng dụng có vấn đề về camera truy cập vào camera của bạn. Ví dụ: nếu bạn gặp sự cố máy ảnh trên Skype, hãy tiến hành như sau: </p> <p> 1. Điều hướng để đi đến <strong> Khởi đầu </strong> thực đơn <img src=\"images/image_thumb-12-696.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Cài đặt </strong> -&gt; <strong> Riêng tư </strong> . <br> 2. Chọn <strong> Máy ảnh </strong> trên ngăn bên trái và ở bên phải: </p> <blockquote><p> a. Đảm bảo rằng <strong> Quyền truy cập máy ảnh cho thiết bị này </strong> Là <strong> trên. </strong> Nếu không, hãy nhấp vào <strong> Thay đổi </strong> và đặt thành <strong> TRÊN. </strong><br> b. Sau đó đặt thành <strong> Trên </strong> các <strong> Cho phép các ứng dụng truy cập công tắc máy ảnh của bạn </strong> . </p> <p><img src=\"images/image_thumb-20-105.png\" alt=\"Allow Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Bây giờ, hãy cuộn xuống và… </p> <p> c. Nếu bạn đang gặp sự cố màn hình máy ảnh màu đen đang bật <strong> Ứng dụng trò chuyện </strong> cửa hàng ứng dụng, cuộn xuống và tại <strong> Chọn ứng dụng Microsoft Store nào có thể truy cập máy ảnh của bạn </strong> phần, thiết lập <strong> Ứng dụng trò chuyện </strong> đến <strong> Trên. </strong></p> <p><img src=\"images/image_thumb-21-826.png\" alt=\"Allow Store Apps to Access Camera Windows 10\" loading=\"lazy\"></p> <p> </p> <p> d. Nếu bạn thấy cửa sổ màn hình đen của máy ảnh khi sử dụng <strong> Skype dành cho Windows </strong> (ứng dụng máy tính để bàn), sau đó đảm bảo rằng <strong> Cho phép các ứng dụng dành cho máy tính để bàn truy cập vào máy ảnh của bạn </strong> chuyển đổi là <strong> Trên </strong> . </p> <p><img src=\"images/image_thumb-22-558.png\" alt=\"Allow Applications to Access Camera Windows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h3> Bước 2. Kiểm tra xem Camera của bạn có hoạt động bình thường không. </h3> <p> Một trong những bước đầu tiên để khắc phục sự cố webcam của bạn là xác nhận rằng nó hoạt động trong ứng dụng Máy ảnh của Windows 10. </p> <p> 1. Tại hộp Tìm kiếm, nhập <strong> Máy ảnh </strong> để mở ứng dụng Máy ảnh. <br> 2. Nhấp vào Kính lúp và tìm kiếm &quot; <strong> Máy ảnh </strong> &quot;. <br> 3. Mở <strong> Máy ảnh </strong> ứng dụng </p> <p><img src=\"images/image_thumb-23-730.png\" alt=\"Open Camera app Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Bây giờ, theo kết quả, hãy tiến hành như sau: </p> <blockquote><p> A. Nếu máy ảnh của bạn đang hoạt động, bạn sẽ thấy hình ảnh của mình trên màn hình. Trong trường hợp này, hãy tiếp tục và kiểm tra máy ảnh của bạn trên Skype hoặc trong bất kỳ ứng dụng nào khác mà bạn sử dụng. Nếu Webcam không hoạt động hoặc hiển thị màn hình đen, hãy áp dụng các bước dưới đây theo thứ tự: </p> <ol> <li> Cố gắng lên <strong> gỡ cài đặt </strong> và <strong> cài đặt lại </strong> ứng dụng gặp sự cố máy ảnh (ví dụ: Skype). </li> <li> Tiến hành Bật hoặc Tắt Chế độ Máy chủ Khung trong Sổ đăng ký bằng cách làm theo hướng dẫn trên <a href=\"#step-3\" target=\"_blank\" rel=\"nofollow noopener\"> bước 3 </a> . </li> </ol> <p> B. Nếu máy ảnh của bạn không hoạt động trong ứng dụng Máy ảnh, một trong những điều sau có thể xảy ra: </p> <ol> <li> Trình điều khiển thiết bị camera không chính xác hoặc bị hỏng. Trong trường hợp này, hãy tiến hành khắc phục sự cố trình điều khiển máy ảnh bằng cách làm theo các hướng dẫn trên <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> bước 4 </a> . </li> <li> Máy ảnh bị hỏng và hoàn toàn không hoạt động. Trong trường hợp này, hãy đến cửa hàng sửa chữa máy tính để sửa webcam của bạn hoặc sử dụng máy ảnh USB bên ngoài. </li> </ol> </blockquote> <h3></h3> <h3> Bước 3. Khắc phục sự cố màn hình đen của Webcam trong Windows 10 Registry. </h3> <p> Nếu máy ảnh được nhận dạng và hoạt động mà không có sự cố trong một số ứng dụng, nhưng nó không hoạt động ở những ứng dụng khác hoặc hiển thị màn hình đen trên Skype, hãy thử tắt hoặc bật &quot;Chế độ máy chủ khung&quot; trong sổ đăng ký. </p> <p> 1. Mở Registry Editor: để làm điều đó: </p> <blockquote><p> 1. Nhấn Windows <img src=\"images/image_thumb41-284.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại <strong> regedit </strong> và hãy nhấn <strong> Đi vào </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-845.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> 3. Trong Registry Editor, điều hướng đến khóa sau ở ngăn bên trái: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows Media Foundation \\ Platform </li> </ul> <p> 4. <strong> Nhấp chuột phải </strong> tại một không gian trống trên ngăn bên phải và chọn <strong> Mới -&gt; Giá trị DWORD (32-bit). </strong></p> <p><img src=\"images/image_thumb-24-839.png\" alt=\"Fix Webcam black Screen Windows 10\" loading=\"lazy\"></p> <p> 5. Cho biết tên <strong> EnableFrameServerMode </strong> sang giá trị mới. <br> 6. Nhấp đúp vào giá trị mới được tạo và đảm bảo rằng dữ liệu giá trị là <strong>0</strong> . (Số không). Nhấp chuột <strong> ĐỒNG Ý. </strong></p> <p><img src=\"images/image_thumb-25-764.png\" alt=\"Fix Webcam issues Windows 10\" loading=\"lazy\"></p> <p> 7. Bây giờ, hãy làm theo các bước tương tự ở trên (4,5 &amp; 6) và thực hiện các thay đổi tương tự tại phím này: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ WOW6432Node \\ Microsoft \\ Windows Media Foundation \\ Platform </li> </ul> <p> 8. Khi hoàn thành, <strong> đóng </strong> Registry Editor và <strong> khởi động lại </strong> PC của bạn. <br> 9. Sau khi khởi động lại, khởi chạy Skype và kiểm tra xem sự cố với WebCam đã được giải quyết chưa. Nếu không, hãy làm theo các bước tương tự, nhưng lần này <strong> kích hoạt </strong> các <strong> EnableFrameServerMode </strong> bằng cách thay đổi giá trị của nó từ <strong>0 </strong> đến <strong> 1 </strong> và <strong> khởi động lại </strong> PC của bạn một lần nữa. </p> <p> </p> <h3> Bước 4. Khắc phục sự cố Trình điều khiển Webcam. </h3> <p> Bước tiếp theo, để khắc phục sự cố Máy ảnh trong Windows 10, là quay trở lại hoặc gỡ cài đặt / cài đặt lại trình điều khiển của Máy ảnh. 1. Mở <strong> Quản lý thiết bị </strong> . Để làm việc đó: </p> <blockquote><p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-696.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Trong hộp &quot;Mở&quot;, nhập: <strong> devmgmt.msc </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-5-837.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Mở rộng <strong> Tưởng tượng thiết bị </strong> (hoặc là <strong> Máy ảnh </strong> ) <br> 3. <strong> Nhấp chuột phải </strong> về bạn <strong> Máy ảnh </strong> và lựa chọn <strong> Tính chất. </strong></p> <p><img src=\"images/image_thumb-26-673.png\" alt=\"Camera Properties\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 4. Chọn <strong> Người lái xe </strong> và tiến hành như sau theo trường hợp của bạn: </p> <blockquote><p> A. Nếu Webcam của bạn hoạt động trước đây, <strong> Quay lại trình điều khiển </strong> và <strong> phục hồi </strong> t PC của bạn. Sau đó, kiểm tra xem máy ảnh của bạn có đang hoạt động hay không. </p> <p><img src=\"images/image_thumb-27-454.png\" alt=\"Roll Back Driver - Camera\" loading=\"lazy\"></p> <p> </p> <p> B. Nếu máy ảnh của bạn chưa từng hoạt động trước đây hoặc nếu đây là lần đầu tiên bạn thử máy ảnh của mình (ví dụ: sau khi cài đặt Windows mới), hãy thử các bước sau theo thứ tự sau: </p> <ol> <li> Nhấn vào <strong> Cập nhật driver </strong> để kiểm tra trình điều khiển được cập nhật cho máy ảnh của bạn. Nếu Windows tìm thấy trình điều khiển mới, hãy cài đặt trình điều khiển đó, sau đó kiểm tra Webcam của bạn. Nếu không thì… </li> <li> Nhấp chuột <strong> Gỡ cài đặt thiết bị </strong> để gỡ cài đặt Webcam và sau đó <strong> khởi động lại </strong> PC của bạn. Sau khi khởi động lại, hãy kiểm tra xem máy ảnh của bạn có hoạt động không. Nếu không… </li> <li> Điều hướng đến trang web hỗ trợ của nhà sản xuất máy tính xách tay của bạn và kiểm tra xem nó có sẵn trình điều khiển mới cho Webcam của bạn hay không và cài đặt nó. </li> </ol> </blockquote> <h3> Trợ giúp bổ sung để khắc phục sự cố máy ảnh trên Windows 10. </h3> <p> Nếu bạn vẫn gặp sự cố với webcam của mình sau các bước trên, hãy thử các cách sau: </p> <ol> <li> <p> Cài đặt tất cả các bản cập nhật Windows 10 có sẵn ( <strong> Khởi đầu </strong> -&gt; <strong> Cài đặt </strong> -&gt; <strong> Cập nhật &amp; Bảo mật </strong> và bấm vào <strong> Kiểm tra cập nhật). </strong></p> </li> <li> <p> Cập nhật Windows 10 lên phiên bản mới nhất bằng cách sử dụng <strong> Cập nhật Trợ lý. </strong> (Để làm điều đó, hãy điều hướng đến <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"noopener\"><strong> liên kết </strong></a> và nhấp vào <strong> Cập nhật bây giờ </strong> cái nút). </p> </li> <li> <p><a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"noopener\"><strong> Làm mới Windows 10 </strong> . </a></p> </li> </ol> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}