{"title":"Khắc phục: Không thể truy cập trang web này trong Chrome (Đã giải quyết)","content":"<p> Hướng dẫn này bao gồm các hướng dẫn để sửa lỗi Chrome: &quot;Không thể truy cập trang web này&quot;. Lỗi &quot;Không thể truy cập trang web này&quot; trong Chrome, có nghĩa là trình duyệt của bạn không thể thiết lập kết nối với trang web mà bạn cố gắng truy cập, do kết nối Internet của bạn bị mất hoặc do trang web bạn muốn truy cập không tồn tại. </p> <p> </p> <p><img src=\"images/image_thumb-14-568.png\" alt=\"FIX: This site can't be reached in Chrome \" loading=\"lazy\"></p> <p> Để giải quyết lỗi Chrome &quot;Không thể truy cập trang web này&quot;, hãy làm theo hướng dẫn bên dưới: </p> <h4> Cách khắc phục lỗi Google Chrome: Không thể truy cập trang web này. </h4> <p><strong> Khuyên bảo: </strong> Trước khi tiếp tục các phương pháp bên dưới, hãy áp dụng các bước sau: <br> 1. Đảm bảo rằng bạn nhập chính xác địa chỉ của trang web. <br> 2. Khởi động lại Bộ định tuyến Internet của bạn. <br> 3. Cố gắng truy cập các trang web khác để đảm bảo rằng kết nối Internet của bạn đang hoạt động. <br> 4. Nếu bạn sở hữu một máy tính / thiết bị khác ở vị trí của mình, hãy cố gắng truy cập trang web mà bạn nhận được lỗi &quot;Không thể truy cập trang web này&quot;, để đảm bảo rằng trang web bạn đang cố truy cập không bị chặn từ ISP của bạn. <br> 5. Nếu bạn đã thiết lập kết nối VPN, hãy ngắt kết nối khỏi kết nối đó. </p> <p> </p> <h6> Phương pháp 1. Thay đổi cài đặt DNS. </h6> <p> Phương pháp tiếp theo để giải quyết lỗi Google Chrome &quot;Không thể truy cập trang web này&quot; là thay đổi Cài đặt DNS và sử dụng Máy chủ DNS Công cộng của Google. Để làm việc đó: </p> <p> 1. <strong> Nhấp chuột phải </strong> trên biểu tượng Mạng đang hoạt động trong Thanh tác vụ (hoặc đi tới Bảng điều khiển Windows) và nhấp vào <strong> Trung tâm kết nối và chia sẻ </strong></p> <p><img src=\"images/image_thumb14_thumb-1-913.png\" alt=\"image_thumb[14]\" loading=\"lazy\"></p> <p> </p> <p> 2. Chọn Card mạng đang hoạt động và sau đó nhấp vào <strong> Thay đổi các tùy chọn bộ điều hợp. </strong></p> <p><img src=\"images/image_thumb17_thumb-1-994.png\" alt=\"FIX CHROME ERR_CONNECTION_CLOSED\" loading=\"lazy\"></p> <p> 3. Nhấp chuột phải vào Bộ điều hợp mạng đang hoạt động của bạn và chọn <strong> Tính chất </strong> . <br> 4. Chọn <strong> &#39;Giao thức Internet Phiên bản 4 (TCP / IPv4) </strong> &#39;và nhấp vào <strong> Tính chất </strong></p> <p><img src=\"images/image_thumb18_thumb-1-801.png\" alt=\"image_thumb[18]\" loading=\"lazy\"></p> <p> 5a. Kiểm tra &quot; <strong> Sử dụng các địa chỉ máy chủ DNS sau: </strong> &quot; nút radio. <br> 5b. Nhập các địa chỉ máy chủ DNS sau (Máy chủ DNS công cộng của Google) và nhấp vào <strong> ĐỒNG Ý. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> <p><img src=\"images/image_thumb20_thumb-1-963.png\" alt=\"image_thumb[20]\" loading=\"lazy\"></p> <p> 6. <strong> Khởi động lại </strong> máy tính của bạn. </p> <p> </p> <h6> Phương pháp 2. Đặt lại Cài đặt TCP / IP &amp; WINSOCK. </h6> <p> 1. Mở Command Prompt ở chế độ Quản trị. Để làm việc đó: </p> <blockquote><p> 1. Tại hộp Tìm kiếm, nhập <strong> cmd </strong> hoặc là <strong> dấu nhắc lệnh </strong></p> <p> 2. Nhấp chuột phải vào <strong> Dấu nhắc lệnh </strong> kết quả và chọn <strong> Chạy như quản trị viên. </strong></p></blockquote> <p><img src=\"images/image_thumb-38-528.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Trong Command Prompt, gõ lệnh sau và nhấn <strong> Đi vào </strong> . </p> <ul> <li> ipconfig / phát hành </li> </ul> <p><img src=\"images/image_thumb11_thumb-364.png\" alt=\"image_thumb[11]\" loading=\"lazy\"></p> <p> </p> <p> 3. Bây giờ gõ các lệnh sau theo thứ tự (nhấn <strong> Đi vào </strong> sau mỗi lệnh): </p> <ul> <li> ipconfig / flushdns </li> <li> ipconfig / gia hạn </li> <li> cài lại netsh winock </li> </ul> <p><img src=\"images/image_thumb12_thumb-449.png\" alt=\"image_thumb[12]\" loading=\"lazy\"></p> <p> 3. <strong> Khởi động lại </strong> máy tính của bạn. </p> <p> </p> <h6> Phương pháp 3. Đặt lại Cài đặt Chrome. </h6> <p> Để đặt lại Chrome về cài đặt đã cài đặt mặc định: </p> <p> 1. Nhấp vào menu của Chrome <img src=\"images/image_thumb_thumb_thumb_thumb-979.png\" alt=\"image_thumb_thumb_thumb\" loading=\"lazy\"> ở góc trên bên phải) và chọn <strong> Cài đặt </strong> . </p> <p><img src=\"images/image_thumb31-186.png\" alt=\"chrome-options\" loading=\"lazy\"></p> <p> 2. Tại <strong> Cài đặt </strong> trang, cuộn xuống và nhấp vào <strong> Hiển thị cài đặt nâng cao. </strong></p> <p><img src=\"images/image_thumb2_thumb-809.png\" alt=\"FIX ERR_CONNECTION_CLOSED CHROME\" loading=\"lazy\"></p> <p> </p> <p> 3. Ở cuối trang, nhấp vào <strong> Khôi phục cài đặt về mặc định ban đầu </strong> . </p> <p><img src=\"images/image_thumb5_thumb-192.png\" alt=\"image_thumb[5]\" loading=\"lazy\"></p> <p> 4. Cuối cùng bấm <strong> Đặt lại cài đặt </strong> . </p> <p><img src=\"images/image_thumb6_thumb-812.png\" alt=\"CHROME ERR_CONNECTION_CLOSED - FIX\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Khởi động lại </strong> Trình duyệt Chrome. </p> <p> </p> <h6> Phương pháp 4. Quét máy tính của bạn để tìm Phần mềm độc hại và Vi rút. </h6> <p> Phương pháp cuối cùng để khắc phục lỗi &quot;Không thể truy cập trang web này&quot; trong Chrome là đảm bảo rằng hệ thống của bạn không có vi rút / phần mềm độc hại. Đối với nhiệm vụ đó, hãy làm theo hướng dẫn trong hướng dẫn này: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Làm thế nào để quét máy tính của bạn để tìm vi rút và các chương trình độc hại khác. </a></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}