{"title":"Khắc phục: Lexmark In chậm Nhiều trang trên Windows 10 (Đã giải quyết)","content":"<p> Trên PC chạy Windows 10 có cài đặt máy in Lexmark, việc in chậm khi in nhiều trang. Sự cố in chậm Lexmark trong Windows 10, thường là do trình điều khiển máy in không chính xác hoặc cài đặt máy in không chính xác (Tùy chọn). Để giải quyết vấn đề, hãy tiếp tục đọc bên dưới. </p> <p><img src=\"images/image_thumb-29-115.png\" alt=\"FIX: Lexmark Slow Printing in Multiple Pages on Windows 10 \" loading=\"lazy\"></p> <p> Chi tiết vấn đề Lexmark In chậm: Trong Windows 10, máy in Lexmark của bạn in nhanh khi in một trang, nhưng khi bạn muốn in nhiều trang, quá trình in chậm do quá trình in mất quá nhiều thời gian để bắt đầu và sau đó máy in sẽ in một trang. mỗi trang 1-2 phút một lần. </p> <p> Hướng dẫn này bao gồm các hướng dẫn để giải quyết vấn đề in chậm nhiều trang Lexmark trong Windows 10. </p> <ul> <li><strong> Bài viết liên quan: </strong> <a href=\"https://www.repairwin.com/fix-slow-pdf-printing-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Khắc phục: In PDF chậm trong Windows 10 </a></li> </ul> <h4> Cách khắc phục: In chậm nhiều trang trong máy in Lexmark trên Windows 10. </h4> <h6> Phương pháp 1. Sửa đổi Cài đặt Máy in. </h6> <p> 1. Điều hướng đến <strong> Bảng điều khiển </strong> -&gt; <strong> Các thiết bị và máy in. </strong><br> 2. Nhấp chuột phải vào Máy in của bạn và chọn <strong> Tính chất. </strong></p> <p><img src=\"images/image_thumb-30-253.png\" alt=\"Printer Properties\" loading=\"lazy\"></p> <p> 3. Tại tab &#39;Chung&#39;, <strong> nhấp vào Thay đổi thuộc tính. </strong></p> <p><img src=\"images/image_thumb-31-900.png\" alt=\"Change Printer Properties\" loading=\"lazy\"></p> <p> 4. Tại Lexmark Printing Preferences, hãy đặt <strong> Loại giấy </strong> đến <strong> Trơn </strong> và bấm vào <strong> ĐỒNG Ý. * </strong></p> <p> * Lưu ý: Các cài đặt khác có thể áp dụng trên máy in của bạn để cải thiện tốc độ in: </p> <ul> <li><strong> Độ phân giải in </strong><strong> : </strong> 600 dpi sẽ làm chậm máy in. </li> <li><strong> Chế độ yên lặng </strong><strong> : </strong> Tắt </li> </ul> <p><img src=\"images/image_thumb-32-858.png\" alt=\"FIX Slow Lexmark Printing Lexmark - Windows 10\" loading=\"lazy\"></p> <p> 5. Bây giờ, hãy nhấp vào <strong> Ứng dụng </strong> và <strong> đồng ý </strong> trong cửa sổ &#39;Thuộc tính máy in&#39; để áp dụng thay đổi. <br> 6. Mở tài liệu có nhiều trang và kiểm tra xem sự cố đã được khắc phục chưa. Nếu không, hãy tiếp tục đến phương pháp-2 bên dưới. </p> <h6> Phương pháp 2. Thay đổi Trình điều khiển Máy in. </h6> <p> 1. Điều hướng đến <strong> Bảng điều khiển </strong> -&gt; <strong> Các thiết bị và máy in. </strong><br> 2. Nhấp chuột phải vào Máy in của bạn và chọn <strong> Gỡ bỏ thiết bị. </strong></p> <p><img src=\"images/image_thumb-33-755.png\" alt=\"Uninstall Printer Windows 10\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 2. Sau khi tháo máy in, điều hướng đến <strong> Chương trình và các tính năng </strong> trong Bảng điều khiển và <strong> gỡ cài đặt </strong> các <strong> Phần mềm Lexmark </strong> (của bất kỳ). </p> <p> 3. Điều hướng đến <a href=\"https://www.lexmark.com/en_us/support/download-search.html\" target=\"_blank\" rel=\"nofollow noopener\"> Trình điều khiển và tải xuống Lexmark </a> và tìm kiếm các trình điều khiển có sẵn cho Kiểu máy in và Hệ điều hành của bạn. <br> 4. Từ danh sách các trình điều khiển có sẵn, tải xuống và cài đặt một trong các trình điều khiển sau: * </p> <ul> <li> <p> Trình điều khiển In Đa năng. </p> </li> <li> <p> Trình điều khiển in giả lập PCL5e phổ quát. </p> </li> <li> <p> Trình điều khiển in mô phỏng PostScript 3 phổ quát. </p> </li> </ul> <p> * Lưu ý: Tôi khuyên bạn nên thử các trình điều khiển in theo thứ tự được liệt kê ở trên. </p> <p> 5. Khi quá trình cài đặt trình điều khiển máy in hoàn tất, <strong> khởi động lại </strong> PC của bạn. <br> 6. Sau khi khởi động lại, hãy thử in một tài liệu dài. Sự cố in chậm, cần được khắc phục. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trong các mạng xã hội để giúp lan truyền rộng rãi về vấn đề này. </p>"}