{"title":"Khắc phục: Chế độ này của Windows chỉ chạy các ứng dụng đã được xác minh từ Cửa hàng trên Windows 10.","content":"<p> Lỗi &quot;Để bảo mật và hiệu suất, chế độ này của Windows chỉ chạy các ứng dụng đã được xác minh từ Cửa hàng&quot; xuất hiện khi Windows 10 đang chạy ở Chế độ S hoặc do cài đặt trên máy tính của bạn hạn chế cài đặt ứng dụng và phần mềm của bên thứ ba . </p> <p><img src=\"images/image_thumb-19-156.png\" alt=\"FIX: For security and performance, this mode of Windows only runs verified apps from the Store in Windows 10.\" loading=\"lazy\"></p> <p> Hướng dẫn này chứa các hướng dẫn để giải quyết lỗi &quot;Để bảo mật và hiệu suất, chế độ này của Windows chỉ chạy các ứng dụng đã được xác minh từ Cửa hàng&quot;, khi cố gắng cài đặt ứng dụng của bên thứ ba trong Windows 10. </p> <h2> Cách cho phép cài đặt các ứng dụng của bên thứ ba trong Windows 10. </h2> <h5> Bước 1. Tìm phiên bản Windows 10 đã cài đặt. </h5> <p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb-1-482.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Gõ lệnh sau và nhấn <strong> Đi vào: </strong></p> <ul> <li><strong> người thắng cuộc </strong></li> </ul> <p><img src=\"images/image_thumb-13-360.png\" alt=\"See Windows 10 Installed Version\" loading=\"lazy\"></p> <p> 3. Bây giờ, nếu bạn thấy trong Windows Edition rằng bạn đang chạy Windows 10 Home hoặc Pro, hãy làm theo hướng dẫn trong <a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Phương pháp-1 </a> , ngược lại, nếu bạn có <strong> Windows 10 Home S </strong> , hãy làm theo hướng dẫn trong <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Phương pháp-2 </a> . </p> <p><img src=\"images/image_thumb-14-709.png\" alt=\"See Installed Windows 10 Edition\" loading=\"lazy\"></p> <p><strong> </strong></p> <p><strong> </strong></p> <h3> Phương pháp 1. Cho phép Windows 10 cài đặt ứng dụng từ mọi nơi. </h3> <p> 1. Từ menu Bắt đầu <img src=\"images/image_thumb2_thumb_thumb-909.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> bấm vào Cài đặt <img src=\"images/image_thumb-66-797.png\" alt=\"image\" loading=\"lazy\"> và sau đó mở <strong> Ứng dụng </strong> . </p> <p><img src=\"images/image_thumb-15-604.png\" alt=\"Windows Settings - Apps\" loading=\"lazy\"></p> <p> </p> <p> 2. Tại Cài đặt ứng dụng &amp; tính năng, chọn cài đặt ứng dụng từ <strong> Bất cứ nơi nào </strong> . </p> <p><img src=\"images/image_thumb-16-670.png\" alt=\"Install Apps from Anywhere - Windows 10\" loading=\"lazy\"></p> <h3> Phương pháp 2. Chuyển ra khỏi Windows 10 S Mode. </h3> <p> Windows 10 ở chế độ S mode được thiết kế để bảo mật và hiệu suất và vì lý do đó không cho phép chạy các ứng dụng bên ngoài Microsoft Store. Để khắc phục hạn chế này, bạn cần thoát khỏi chế độ S mode, đây là một cách rất dễ dàng, nhưng hãy nhớ rằng sau khi thoát khỏi chế độ S mode, bạn sẽ không thể quay lại Windows 10 ở chế độ S. </p> <p> Để đăng xuất khỏi Windows 10 S Mode sang Windows 10 Home: </p> <p> 1. Từ menu Bắt đầu <img src=\"images/image_thumb2_thumb_thumb-829.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> bấm vào Cài đặt <img src=\"images/image_thumb-66-853.png\" alt=\"image\" loading=\"lazy\"> và sau đó mở <strong> Cập nhật và Bảo mật. </strong></p> <p> 2. Chọn <strong> Kích hoạt </strong> ở bên trái và sau đó nhấp vào <a href=\"//switchwindows\" target=\"_blank\" rel=\"nofollow noopener\"> Đi đến cửa hàng </a><strong> . </strong></p> <p><img src=\"images/image_thumb-17-920.png\" alt=\"Switch Out S Mode Windows 10\" loading=\"lazy\"></p> <p> 3. Trong trang Chuyển ra khỏi Chế độ S, hãy nhấp vào <strong> Được </strong> và sau đó nhấp vào <strong> Tải về. </strong> * <br> 4. Cuối cùng bấm <strong> Vâng, hãy đi </strong> để chuyển khỏi Chế độ S. </p> <p> * Lưu ý: Nếu sau khi nhấp vào nút &#39;Cài đặt&#39;, bạn nhận được lỗi &quot;Đã xảy ra sự cố và chúng tôi không thể bắt đầu nâng cấp&quot;, hãy tiếp tục và <strong> cài đặt tất cả các bản cập nhật Windows 10 có sẵn </strong> , <strong> khởi động lại PC của bạn </strong> và thử lại. </p> <p><img src=\"images/image_thumb-18-502.png\" alt=\"Switch Out S Mode\" loading=\"lazy\"></p> <p> </p> <p> 4. Khi quá trình cài đặt hoàn tất, bạn sẽ được thông báo rằng bạn có thể cài đặt các ứng dụng từ bên ngoài Microsoft Store. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}