{"title":"Khắc phục: Màn hình PNP chung trên Windows 10 (Đã giải quyết)","content":"<p> Sự cố Màn hình PNP Chung trong Windows 10 xảy ra do màn hình được kết nối không được hệ thống nhận dạng đúng cách. Sự cố &quot;Màn hình PNP chung&quot; xuất hiện trên máy tính để bàn hoặc khi bạn đang sử dụng màn hình bên ngoài với máy tính xách tay của mình và được gây ra bởi một trong ba (3) lý do sau: </p> <ol> <li> <ol> <li> <p> Trình điều khiển cho bộ điều hợp màn hình (VGA) không chính xác hoặc không được cài đặt. </p> </li> <li> <p> Trình điều khiển cho Màn hình không được cài đặt đúng cách. </p> </li> <li> <p> Cáp Video có vấn đề. </p> </li> </ol> </li> </ol> <p><img src=\"images/image_thumb-71-767.png\" alt=\"FIX Generic PNP Monitor on Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Hướng dẫn này bao gồm hướng dẫn từng bước về cách giải quyết sự cố &#39;Màn hình PNP chung&#39; trên Windows 10. </p> <h4> Cách khắc phục: Màn hình PNP chung trong Windows 10. </h4> <h6> Phương pháp 1. Cài đặt tất cả các Bản cập nhật Windows 10 có sẵn. </h6> <p> Nếu sự cố màn hình PNP Chung, xuất hiện sau khi cài đặt hoặc sau khi cập nhật Windows 10, hãy tiếp tục và cài đặt tất cả các bản cập nhật có sẵn. Để làm việc đó, </p> <p> 1. Đi tới <strong> Khởi đầu <img src=\"images/image_thumb-55-849.png\" alt=\"image\" loading=\"lazy\"> -&gt; Cài đặt </strong> -&gt; <strong> Cập nhật và Bảo mật -&gt; </strong> và bấm vào <strong> Kiểm tra cập nhật. </strong></p> <p><img src=\"images/image_thumb-76-951.png\" alt=\"Windows 10 - Check For Updates \" loading=\"lazy\"></p> <p> 2. Tải xuống và cài đặt tất cả các bản cập nhật Windows và sau đó <strong> khởi động lại </strong> PC của bạn. </p> <h6><br clear=\"all\"> Phương pháp 2. Cài đặt hoặc khôi phục trình điều khiển của Bộ điều hợp hiển thị. </h6> <p> Bước thứ hai để khắc phục sự cố Generic PNP Monitor, là cài đặt (hoặc khôi phục), trình điều khiển của bộ điều hợp đồ họa. Để làm việc đó: </p> <p> 1. Mở <strong> Quản lý thiết bị </strong> . Để làm việc đó: </p> <ol> <li> <ol> <li> Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-458.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. </li> <li> Trong hộp &quot;Mở&quot;, nhập: <strong> devmgmt.msc </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </li> </ol> </li> </ol> <blockquote> <p><img src=\"images/image_thumb-5-538.png\" alt=\"image\" loading=\"lazy\"></p> </blockquote> <p> 2. Trong Trình quản lý Thiết bị, hãy mở rộng <strong> Bộ điều hợp hiển thị. <br> </strong> 3. Bây giờ thực hiện hành động tương ứng, theo trường hợp của bạn: </p> <p><strong> Trường hợp A. </strong> Nếu bộ điều hợp hiển thị đã cài đặt được liệt kê là &quot; <strong> Bộ điều hợp hiển thị cơ bản của Microsoft </strong> &quot;(như trong ảnh chụp màn hình bên dưới), điều này có nghĩa là trình điều khiển cho cạc đồ họa của bạn chưa được cài đặt. </p> <p><img src=\"images/image_thumb-61-521.png\" alt=\"image\" loading=\"lazy\"></p> <p> Trong trường hợp này, để khắc phục sự cố &#39;Màn hình PNP chung&#39;: </p> <blockquote> <p> a. <strong> Nhấp chuột phải </strong> trên <strong> Bộ điều hợp hiển thị cơ bản của Microsoft </strong> và chọn <strong> Cập nhật driver. </strong></p> </blockquote> <p><img src=\"images/image_thumb-62-511.png\" alt=\"image\" loading=\"lazy\"></p> <blockquote> <p> b. Ở màn hình tiếp theo, hãy nhấp vào <strong> Tự động tìm kiếm trình điều khiển </strong> và cho phép Windows tải xuống và cài đặt trình điều khiển cho thiết bị hiển thị. * </p> </blockquote> <p><img src=\"images/image_thumb-69-707.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Lưu ý: Nếu Windows không thể tìm thấy trình điều khiển khác cho bộ điều hợp đồ họa của bạn, hãy điều hướng đến trang web hỗ trợ của nhà sản xuất máy tính (hoặc cạc đồ họa), tải xuống và cài đặt trình điều khiển mới nhất cho cạc đồ họa của bạn. </p> <ul> <li> <ul> <li> Đối với <strong> NVIDIA </strong> dựa trên GPU, điều hướng đến <a href=\"http://www.nvidia.com/download/find.aspx\" target=\"_blank\" rel=\"nofollow noopener\"> Trang Tìm kiếm Trình điều khiển Nâng cao của NVIDIA </a> . </li> <li> Đối với <strong> AMD </strong> dựa trên GPU, điều hướng đến <a href=\"http://support.amd.com/en-us/download\" target=\"_blank\" rel=\"nofollow noopener\"> Trung tâm Tải xuống Trình điều khiển AMD (ATI). </a></li> <li> Đối với <strong> Intel </strong> dựa trên GPU, điều hướng đến <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Trung tâm tải xuống đồ họa Intel. </a></li> </ul> </li> </ul> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/07/image-56.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p><strong> Trường hợp B. </strong> Nếu bạn thấy rằng bộ điều hợp đồ họa của mình được nhận dạng đúng từ Windows 10, thì có thể trình điều khiển đồ họa đã cài đặt không chính xác. </p> <p> Trong trường hợp này, hãy tiếp tục và cài đặt trình điều khiển mới nhất cho cạc đồ họa của bạn từ trang web hỗ trợ của nhà sản xuất hoặc nếu sự cố &quot;Màn hình PNP chung&quot; xuất hiện sau khi cập nhật Windows 10, hãy tiếp tục và khôi phục trình điều khiển video. </p> <p> Để khôi phục trình điều khiển đồ họa: </p> <blockquote> <p> a. Nhấp chuột phải vào bộ điều hợp hiển thị đã cài đặt và nhấp vào <strong> Tính chất. </strong></p> </blockquote> <p><img src=\"images/image_thumb-64-665.png\" alt=\"image\" loading=\"lazy\"></p> <blockquote> <p> b. Chọn <strong> Người lái xe </strong> tab và sau đó nhấp vào <strong> Quay lại trình điều khiển </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-58-555.png\" alt=\"Roll Back Driver\" loading=\"lazy\"></p> <blockquote><p> c. Chọn lý do cho việc khôi phục gói trình điều khiển và nhấp vào <strong> Đúng. </strong></p></blockquote> <p><img src=\"images/image_thumb-19-797.png\" alt=\"image\" loading=\"lazy\"></p> <blockquote><p> d. Khi hoàn tất quá trình khôi phục trình điều khiển, <strong> khởi động lại </strong> máy tính của bạn. </p></blockquote> <h6> Phương pháp 3. Gỡ cài đặt thiết bị Màn hình PNP Chung &amp; Kết nối lại Màn hình. </h6> <p> 1. Điều hướng đến <strong> Quản lý thiết bị </strong> . <br> 2. Mở rộng <strong> Màn hình. </strong><br> 3. <strong> Nhấp chuột phải </strong> tại <strong> Màn hình PnP chung </strong> và chọn <strong> Gỡ cài đặt thiết bị. </strong></p> <p><img src=\"images/image_thumb-59-687.png\" alt=\"Generic PNP Monitor\" loading=\"lazy\"></p> <p> </p> <p> 4. Nhấp vào <strong> Gỡ cài đặt </strong> để xác nhận quyết định của bạn. </p> <p><img src=\"images/image_thumb-60-394.png\" alt=\"Unisntall Generic PNP Monitor\" loading=\"lazy\"></p> <p> 5. <strong> Tắt </strong> máy tính của bạn. <br> 6. <strong> Tắt </strong> của bạn <strong> giám sát </strong> và <strong> tháo dây nguồn của nó </strong> từ phích cắm. <br> 7. <strong> Ngắt kết nối </strong> các <strong> cáp video </strong> từ máy tính. <br> 8. Để các dây rút phích cắm trong 2-3 phút và sau đó kết nối lại tất cả các dây cáp. <br> 9. Bật nguồn PC của bạn và kiểm tra xem sự cố đã được giải quyết chưa. </p> <h6><br clear=\"all\"> Phương pháp 4. Cài đặt trình điều khiển màn hình chung không phải PNP. </h6> <p> 1. Điều hướng đến <strong> Quản lý thiết bị </strong> . <br> 2. Mở rộng <strong> Màn hình. <br> </strong> 3. <strong> Nhấp chuột phải </strong> trên <strong> Màn hình PNP chung </strong> và chọn <strong> Cập nhật driver. </strong></p> <p><img src=\"images/image_thumb-65-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Nhấp vào <strong> Duyệt máy tính của tôi để tìm trình điều khiển. </strong></p> <p><img src=\"images/image_thumb-66-706.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Chọn <strong> Hãy để tôi chọn từ danh sách các trình điều khiển có sẵn trên máy tính của tôi </strong> . </p> <p><img src=\"images/image_thumb-67-249.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. <strong> Kiểm tra </strong> các <strong> Hiển thị phần cứng tương thích </strong> hộp kiểm, và chọn và cài đặt một trong các trình điều khiển tương thích khác, hoặc trình điều khiển &#39;Màn hình chung không phải PNP&#39;. </p> <p><img src=\"images/image_thumb-68-287.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Phương pháp 5. Thử với một cáp Video khác. </h6> <p> Phương pháp cuối cùng để giải quyết vấn đề &#39;Màn hình PNP chung&#39; trong Windows 10 là kết nối PC với màn hình bằng cáp khác. Để làm việc đó: </p> <p> * Lưu ý: Phương pháp này chỉ áp dụng cho máy tính để bàn hoặc khi bạn sử dụng màn hình ngoài với máy tính xách tay của mình. </p> <p> 1. <strong> Tắt </strong> PC của bạn. <br> 2. <strong> Thay thế </strong> các <strong> cáp video </strong> với một sản phẩm tương tự, nhưng từ một nhà sản xuất khác. <br> 3. <strong> Bật nguồn </strong> PC của bạn. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}