{"title":"KHẮC PHỤC: Viber, Yahoo và các Ứng dụng khác đang gặp sự cố trên thiết bị Android - Tháng 3 năm 2021 (Đã giải quyết).","content":"<p> Một số người dùng trong vài giờ qua đã báo cáo rằng nhiều ứng dụng Android đang gặp sự cố (ngày 22 tháng 3 năm 2021). Đặc biệt, Gmail, Viber, Google Chrome và các ứng dụng quan trọng khác không mở và đóng ngay sau khi mở. Sự cố ảnh hưởng đến nhiều thiết bị Android và đặc biệt là thiết bị của Samsung. Nếu bạn gặp phải sự cố tương tự, hãy tiếp tục đọc phần bên dưới để tìm hiểu cách khắc phục. </p> <p> Cập nhật (ngày 23 tháng 3 năm 2021): Google nhanh chóng xác định sự cố và nhận thấy rằng <strong> Android WebView </strong> ứng dụng là thủ phạm và đã khắc phục bằng cách đẩy các bản cập nhật cho ứng dụng đó và các ứng dụng Chrome khác. </p> <h4> Cách khắc phục: Android Google Apps, Viber, v.v. Sự cố (ngày 22 tháng 3 năm 2021). </h4> <p> 1. Mở Android <strong> Cài đặt. </strong></p> <p> 2. Nhấn <strong> Quản lý ứng dụng </strong> (hoặc là <strong> Ứng dụng và thông báo </strong> hoặc là <strong> Các ứng dụng </strong> trên một số thiết bị Android). </p> <p><img src=\"images/image_thumb-27-815.png\" alt=\"FIX: Android Apps are Crashing on Samsung or other Devices.\" loading=\"lazy\"></p> <p> </p> <p> 3. Nhấp vào menu có <strong> Ba chấm </strong><img src=\"images/image_thumb-28-382.png\" alt=\"image\" loading=\"lazy\"> ở góc trên bên phải và chọn <strong> Hiển thị tất cả các ứng dụng </strong> (hoặc là <strong> Hiển thị các ứng dụng hệ thống </strong> ). </p> <p><img src=\"images/image_thumb-29-272.png\" alt=\"FIX Android GMAIL or Viber Crash \" loading=\"lazy\"></p> <p> </p> <p> 3. Tìm <strong> WebView hệ thống Android </strong> ứng dụng (hoặc <strong> Android WebView </strong> ) trong danh sách và mở nó. </p> <p><img src=\"images/image_thumb-30-842.png\" alt=\"FIX GMAIL Chrome or Viber Crash on Android - March 2021\" loading=\"lazy\"></p> <p> </p> <p> 4. Nhấp vào <strong> Gỡ cài đặt bản cập nhật. </strong></p> <p><img src=\"images/image_thumb-31-471.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Nhấn <strong> đồng ý </strong> ở thông báo cảnh báo. </p> <p> 6. <strong> Khởi động lại </strong> thiết bị của bạn và sự cố sẽ biến mất. </p> <p> Đó là tất cả mọi người! Phương pháp nào hiệu quả với bạn? Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}