{"title":"Khắc phục: Chrome Luôn mở tùy chọn Duyệt với tư cách khách - Chuyển đổi người khi khởi động.","content":"<p> Hướng dẫn bao gồm các hướng dẫn về cách ngăn Chrome hiển thị cửa sổ &quot;Chuyển đổi người - Duyệt với tư cách khách&quot; khi khởi động. Chi tiết vấn đề: Trên máy tính chạy Windows, trình duyệt Google Chrome luôn mở các tùy chọn &quot;Duyệt với tư cách khách&quot; và &quot;Thêm người&quot; khi khởi động và người dùng luôn phải chọn hồ sơ của mình để sử dụng trình duyệt Chrome. </p> <p><img src=\"images/image_thumb-26-805.png\" alt=\"FIX Remove Chrome Browse as Guest\" loading=\"lazy\"></p> <p> </p> <h4> Cách Xóa cửa sổ tùy chọn &quot;Trình duyệt với tư cách khách - Thêm người&quot; tại Khởi động Chrome. </h4> <h6> Phương pháp 1. Kiểm tra xem Chrome có được đặt thành Luôn khởi động trong Chế độ duyệt với tư cách khách hay không. </h6> <p> Một trong những tính năng hữu ích nhất của trình duyệt Google Chrome là tạo nhiều hồ sơ người dùng, đặc biệt nếu bạn chia sẻ máy tính của mình với người khác hoặc nếu bạn muốn tách dấu trang và cài đặt giữa nhiều tài khoản của mình. Trong trường hợp này, bạn luôn có thể khởi động Chrome bằng cửa sổ &quot;Chuyển đổi người&quot; bằng cách thêm một trong các công tắc sau (mục nhập văn bản) vào lối tắt Chrome: </p> <ul> <li><strong> –Profile-directory = &quot;Hồ sơ khách&quot; </strong></li> <li><strong> –Bwsi </strong></li> </ul> <p> </p> <p> Vì vậy, trước hết, hãy kiểm tra xem Chrome có được đặt để luôn mở cửa sổ &quot;Chuyển đổi người / Duyệt với tư cách khách&quot; hay không. Để làm việc đó: </p> <p> 1. Đóng Google Chrome. <br> 2. Nhấp chuột phải vào Phím tắt Chrome trên màn hình của bạn và chọn <strong> Tính chất </strong> . <br> 3. Tại <strong> Đường tắt </strong> tab, nhìn vào <strong> Mục tiêu </strong> hộp văn bản và (nếu có) <strong> tẩy </strong> các mục nhập văn bản ở trên ở cuối và sau đó nhấp vào <strong> đồng ý </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-27-916.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Khởi chạy Chrome và tại cửa sổ &quot;Chuyển đổi người&quot;, nhấp vào biểu tượng / ảnh hồ sơ của bạn (&quot;Bạn&quot;). <br> 5. <strong> Khởi động lại </strong> Trình duyệt Chrome. </p> <p> </p> <h6> Phương pháp 2. Tạo cấu hình Google Chrome sạch mới. </h6> <p> Theo mặc định, Chrome lưu trữ tất cả cài đặt Hồ sơ (dấu trang, mật khẩu, tiện ích mở rộng, v.v.) bên trong thư mục &quot;Dữ liệu người dùng&quot; tại vị trí sau trên máy tính của bạn: </p> <ul> <li><strong> C: \\ Users \\% Username% \\ AppData \\ Local \\ Google \\ Chrome \\ User Data </strong></li> </ul> <p> Nếu vì lý do nào đó, thư mục Hồ sơ Chrome bị hỏng hoặc bị phần mềm độc hại sửa đổi không đúng cách, thì tùy chọn tốt nhất mà bạn có là buộc Chrome tạo lại thư mục hồ sơ Chrome mới (trống *). Để làm việc đó: </p> <p><strong> * Chú ý: </strong> Hãy nhớ rằng bằng cách xóa thư mục lưu trữ hồ sơ trên Chrome, bạn sẽ xóa tất cả dữ liệu được lưu trữ (Dấu trang, Cài đặt, Tiện ích mở rộng, Lịch sử, v.v.). Vì vậy, trước khi xóa hồ sơ Chrome của bạn, hãy thực hiện <a href=\"https://www.repairwin.com/backup-restore-chrome-bookmarks/\" target=\"_blank\" rel=\"nofollow noopener\"> sao lưu các dấu trang Chrome của bạn </a> trong trường hợp bạn muốn cài đặt lại Chrome. </p> <h5> Bước 1: Bật chế độ xem Tệp &amp; thư mục ẩn. </h5> <p> 1. Mở <strong> Tùy chọn thư mục </strong> . <br> 2. Tại <strong> Lượt xem </strong> chuyển hướng, <strong> kiểm tra </strong> các <strong> Hiển thị các tệp, thư mục và ổ đĩa ẩn </strong> hộp kiểm và nhấp vào <strong> ĐỒNG Ý. </strong></p> <p><img src=\"images/image_thumb-6-189.png\" alt=\"enable hidden files folders\" loading=\"lazy\"></p> <h6></h6> <h5> Bước 2. Buộc Chrome tạo một thư mục hồ sơ mới (sạch). </h5> <p> 1. <strong> Đóng </strong> Google Chrome. <br> 2. <strong> Mở </strong> Windows Explorer và điều hướng đến vị trí này: </p> <ul> <li><strong> C: \\ Users \\% USERNAME% \\ AppData \\ Local \\ Google \\ Chrome \\ </strong></li> </ul> <p> * Trong đó% USERNAME% = Tên người dùng của bạn. (ví dụ: nếu tên người dùng của bạn là &quot;Quản trị viên&quot;, thì bạn phải điều hướng đến đường dẫn này: &quot;C: \\ Users \\ Admin \\ AppData \\ Local \\ Google \\ Chrome&quot;) </p> <p> 3. <strong> Đổi tên </strong> thư mục &quot;Dữ liệu Người dùng&quot; thành &quot;Dữ liệu Người dùng.BAK&quot;. </p> <p><img src=\"images/image_thumb-28-373.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Bây giờ hãy mở Google Chrome. (Trong khi khởi động, Chrome sẽ tự động tạo một thư mục &quot;Dữ liệu người dùng&quot; sạch mới để lưu trữ các dấu trang và cài đặt của bạn). </p> <p> </p> <h6> Các phương pháp bổ sung để giải quyết sự cố của Chrome. </h6> <p><strong> 1. </strong> <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Kiểm tra máy tính của bạn để tìm vi rút, phần mềm độc hại, v.v. </a></p> <p><strong> 2. </strong> <a href=\"https://www.repairwin.com/how-to-remove-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> Gỡ cài đặt hoàn toàn và cài đặt lại Chrome. </a></p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}