{"title":"KHẮC PHỤC: ERR_CONNECTION_CLOSED trong Google Chrome (Đã giải quyết)","content":"<p> Hướng dẫn này bao gồm các hướng dẫn để sửa lỗi Chrome: &quot;ERR_CONNECTION_CLOSED&quot;. Lỗi &quot;ERR_CONNECTION_CLOSED&quot; trong Google Chrome, có nghĩa là trình duyệt của bạn không thể thiết lập kết nối với trang web mà bạn cố truy cập, do kết nối Internet của bạn bị gián đoạn hoặc do nhà cung cấp dịch vụ internet của bạn đã chặn quyền truy cập vào trang web. </p> <h4> Cách khắc phục: lỗi CHROME ERR_CONNECTION_CLOSED. </h4> <p><strong> Khuyên bảo: </strong> Trước khi tiếp tục giải quyết lỗi Chrome: &quot;ERR_CONNECTION_CLOSED&quot;, bằng cách áp dụng các phương pháp bên dưới, hãy thử các cách sau: <br> 1. Khởi động lại Bộ định tuyến Internet của bạn. <br> 2. Cố gắng truy cập các trang web khác để đảm bảo rằng kết nối Internet của bạn đang hoạt động. <br> 3. Nếu bạn sở hữu một máy tính / thiết bị khác ở vị trí của mình, hãy thử truy cập trang web mà bạn nhận được lỗi &quot;ERR_CONNECTION_CLOSED&quot;, để đảm bảo rằng trang web bạn đang cố truy cập không bị chặn khỏi ISP của bạn. <br> 4. Nếu bạn đã thiết lập kết nối VPN, hãy ngắt kết nối khỏi kết nối đó. <br> 5. Tạm thời vô hiệu hóa ứng dụng Tường lửa (nếu bạn có). </p> <p> </p> <h6> Phương pháp 1. Quét máy tính của bạn để tìm Phần mềm độc hại và Vi rút. </h6> <p> Bước đầu tiên trước khi khắc phục lỗi &quot;ERR_CONNECTION_CLOSED&quot; trong Chrome, là đảm bảo rằng hệ thống của bạn không có vi rút / phần mềm độc hại. Đối với nhiệm vụ đó, hãy làm theo hướng dẫn trong hướng dẫn này: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách quét vi rút và các chương trình độc hại khác trên máy tính của bạn. </a></p> <p> </p> <h6> Phương pháp 2. Đặt lại Cài đặt Chrome về Mặc định. </h6> <p> Để đặt lại Chrome về cài đặt đã cài đặt mặc định: </p> <p> 1. Nhấp vào menu của Chrome <img src=\"images/image_thumb_thumb_thumb_thumb-657.png\" alt=\"image_thumb_thumb_thumb\" loading=\"lazy\"> ở góc trên bên phải) và chọn <strong> Cài đặt </strong> . </p> <p><img src=\"images/image_thumb31-256.png\" alt=\"chrome-options\" loading=\"lazy\"></p> <p> </p> <p> 2. Tại <strong> Cài đặt </strong> trang, cuộn xuống và nhấp vào <strong> Hiển thị cài đặt nâng cao. </strong></p> <p><img src=\"images/image_thumb2_thumb-894.png\" alt=\"FIX ERR_CONNECTION_CLOSED CHROME\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Ở cuối trang, nhấp vào <strong> Khôi phục cài đặt về mặc định ban đầu </strong> . </p> <p><img src=\"images/image_thumb5_thumb-475.png\" alt=\"image_thumb[5]\" loading=\"lazy\"></p> <p> </p> <p> 4. Cuối cùng bấm <strong> Đặt lại cài đặt </strong> . </p> <p><img src=\"images/image_thumb6_thumb-389.png\" alt=\"CHROME ERR_CONNECTION_CLOSED - FIX\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Khởi động lại </strong> Trình duyệt Chrome. </p> <p> </p> <h6> Phương pháp 3. Đặt lại giao thức Winsock. </h6> <p> 1. Mở Command Prompt ở chế độ Quản trị. Để làm việc đó: </p> <blockquote><p> 1. Tại hộp Tìm kiếm, nhập <strong> cmd </strong> hoặc là <strong> dấu nhắc lệnh </strong></p> <p> </p> <p> 2. Nhấp chuột phải vào <strong> Dấu nhắc lệnh </strong> kết quả và chọn <strong> Chạy như quản trị viên. </strong></p></blockquote> <p><img src=\"images/image_thumb-38-412.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Trong Command Prompt, gõ lệnh sau và nhấn <strong> Đi vào </strong> . </p> <ul> <li><strong> danh mục thiết lập lại netsh winock </strong></li> </ul> <p><img src=\"images/image_thumb_thumb-865.png\" alt=\"netsh winsock reset catalog\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Khởi động lại </strong> máy tính của bạn. </p> <p> </p> <h6> Phương pháp 4. Thay đổi cài đặt DNS. </h6> <p> - Sử dụng Máy chủ DNS Công cộng của Google để giải quyết lỗi &quot;ERR_CONNECTION_CLOSED&quot; trong Chrome. </p> <p> </p> <p><strong> Để thay đổi cài đặt DNS: </strong></p> <p> 1. <strong> Nhấp chuột phải </strong> trên biểu tượng Mạng đang hoạt động trong Thanh tác vụ (hoặc đi tới Bảng điều khiển Windows) và nhấp vào <strong> Trung tâm kết nối và chia sẻ </strong></p> <p><img src=\"images/image_thumb14_thumb-1-229.png\" alt=\"image_thumb[14]\" loading=\"lazy\"></p> <p> </p> <p> 2. Chọn Card mạng đang hoạt động và sau đó nhấp vào <strong> Thay đổi các tùy chọn bộ điều hợp. </strong></p> <p><img src=\"images/image_thumb17_thumb-1-221.png\" alt=\"FIX CHROME ERR_CONNECTION_CLOSED\" loading=\"lazy\"></p> <p> </p> <p> 3. Nhấp chuột phải vào Bộ điều hợp mạng đang hoạt động của bạn và chọn <strong> Tính chất </strong> . <br> 4. Chọn <strong> ‘Giao thức Internet Phiên bản 4 (TCP / IPv4) </strong> &#39;Và nhấp vào <strong> Tính chất </strong></p> <p><img src=\"images/image_thumb18_thumb-1-963.png\" alt=\"image_thumb[18]\" loading=\"lazy\"></p> <p> </p> <p> 5a. Kiểm tra &quot; <strong> Sử dụng các địa chỉ máy chủ DNS sau: </strong> &quot; nút radio. <br> 5b. Nhập các địa chỉ máy chủ DNS sau (Máy chủ DNS công cộng của Google) và nhấp vào <strong> ĐỒNG Ý. </strong></p> <ul> <li> 8.8.8.8 </li> <li> 8.8.4.4 </li> </ul> <p><img src=\"images/image_thumb20_thumb-1-904.png\" alt=\"image_thumb[20]\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> Khởi động lại </strong> máy tính của bạn. </p> <p> </p> <h6> Phương pháp 5. Kết nối Internet thông qua Opera VPN. </h6> <p> Nếu Nhà cung cấp dịch vụ Internet (ISP) của bạn, đã chặn quyền truy cập vào (các) trang web mà bạn cố gắng truy cập, thì bạn có thể cố gắng kết nối với (các) trang web đó bằng cách sử dụng Mạng riêng ảo miễn phí (hoặc trả phí) ( VPN) nhà cung cấp dịch vụ hoặc đơn giản bằng cách sử dụng trình duyệt Opera có tích hợp tính năng VPN. * </p> <p> * Lưu ý: Kết nối Internet bằng dịch vụ VPN cho phép bạn &quot;che&quot; Địa chỉ IP thực của thiết bị để trông giống như bạn đang trực tuyến từ một quốc gia khác. </p> <p> Để bật tính năng VPN trong trình duyệt Opera: </p> <p> 1. Mở Opera Menu rồi chọn <strong> Cài đặt </strong> . </p> <p><img src=\"images/image_thumb10_thumb-360.png\" alt=\"image_thumb[10]\" loading=\"lazy\"></p> <p> </p> <p> 2. Nhấp vào <strong> Nâng cao </strong> ở bên trái và sau đó nhấp vào <strong> Đặc trưng </strong> . <br> 3. Kéo <strong> Bật VPN </strong> chuyển sang <strong> TRÊN </strong> . </p> <p><img src=\"images/image_thumb13_thumb-171.png\" alt=\"image_thumb[13]\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Khởi động lại </strong> Opera. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}