{"title":"Khắc phục: Kết nối Máy tính Từ xa Mac OS không thể xác minh danh tính của máy tính mà bạn muốn kết nối. (Đã giải quyết)","content":"<p> Trong hướng dẫn này, bạn sẽ tìm thấy hướng dẫn để giải quyết sự cố &quot;Kết nối Máy tính Từ xa không thể xác minh danh tính của máy tính mà bạn muốn kết nối. Hãy thử kết nối lại với máy tính chạy Windows hoặc liên hệ với quản trị viên của chúng tôi.&quot;, Khi bạn cố gắng kết nối thông qua RDP từ máy tính chạy Mac OS với Windows RDSH Server 2016. </p> <p><img src=\"images/image_thumb-32-846.png\" alt=\"FIX: MAC OS Remote Desktop Connection cannot verify the identity of the computer that you want to connect to.\" loading=\"lazy\"></p> <p> </p> <h4> Cách khắc phục: Kết nối Máy tính từ xa MacOSX không thể xác minh danh tính của máy tính mà bạn muốn kết nối. </h4> <h6> Phương pháp 1. Tải xuống RDP Client mới nhất từ ​​MAC App Store. </h6> <p> 1. Tải xuống và cài đặt và mới nhất <a href=\"https://itunes.apple.com/us/app/microsoft-remote-desktop/id715768417?mt=12&ign-mpt=uo%3D4\" target=\"_blank\" rel=\"nofollow noopener\"> Máy khách Microsoft Remote Desktop </a> trên máy MAC của bạn. (Nếu bạn đang sử dụng thiết bị IOS, hãy tải xuống ứng dụng khách RDP từ <a href=\"https://itunes.apple.com/us/app/microsoft-remote-desktop/id714464092?mt=8&ign-mpt=uo%3D4\" target=\"_blank\" rel=\"nofollow noopener\"> đây </a> .) <br> 2. Sau khi cài đặt, hãy thử kết nối lại với Máy chủ Windows RDP. Nếu sự cố vẫn tiếp diễn, hãy tiếp tục đến phương pháp-2 bên dưới. </p> <p> </p> <h6> Phương pháp 2. Sửa đổi Thiết đặt Chính sách Nhóm trên Máy chủ Windows RDSH. </h6> <p> Trên Máy chủ Lưu trữ Phiên Máy tính Từ xa (RDSH) 2016, sửa đổi chính sách nhóm như sau: </p> <p> 1. Nhấn đồng thời Windows <img src=\"images/image_thumb36-211.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại <strong> gpedit.msc </strong> &amp; Nhấn <strong> Đi vào. </strong></p> <p><img src=\"images/image_thumb-78-784.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Ở ngăn bên trái, điều hướng đến: </p> <ul> <li><strong> cấu hình máy tính </strong> &gt; <strong> mẫu hành chính </strong> &gt; <strong> Các thành phần Windows </strong> &gt; <strong> Dịch vụ Máy tính Từ xa </strong> &gt; <strong> Máy chủ phiên máy tính từ xa </strong> &gt; <strong> Bảo vệ </strong></li> </ul> <p> 4. Tại ngăn bên phải, mở <strong> Yêu cầu sử dụng lớp bảo mật cụ thể cho các kết nối từ xa (RDP) </strong> cài đặt. </p> <p><img src=\"images/image_thumb-36-865.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4a. Kiểm tra <strong> Đã bật </strong> , đặt &#39;Lớp bảo mật&#39; thành <strong> RDP </strong> và bấm vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-37-183.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Bây giờ, hãy mở <strong> Yêu cầu xác thực người dùng cho các kết nối từ xa bằng cách sử dụng Xác thực cấp độ mạng </strong> cài đặt, đặt nó thành <strong> Tàn tật </strong> và bấm vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-38-109.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Đóng </strong> Trình chỉnh sửa chính sách Nhóm. <br> 7. <strong> Khởi động lại </strong> máy tính để áp dụng các thay đổi hoặc mở dấu nhắc lệnh nâng cao và đưa ra lệnh sau: </p> <ul> <li><strong> gpupdate / force </strong></li> </ul> <p> Đó là nó! Phương pháp nào hiệu quả với bạn? <br> Hãy cho tôi biết nếu hướng dẫn này đã giúp bạn bằng cách để lại nhận xét của bạn về trải nghiệm của bạn. Hãy thích và chia sẻ hướng dẫn này để giúp đỡ những người khác. </p>"}