{"title":"Khắc phục: Ổ đĩa được hiển thị hai lần trong ngăn điều hướng của Windows 10 (Đã giải quyết)","content":"<p> Trong hướng dẫn này, bạn sẽ hướng dẫn cách khắc phục sự cố kỳ lạ sau trong Windows 10: Ổ đĩa hiển thị hai lần trong Ngăn dẫn hướng. Sự xuất hiện trùng lặp của các ổ đĩa trong ngăn điều hướng, là một tính năng mới của Windows 10, giúp người dùng dễ dàng khám phá nội dung của ổ đĩa được đính kèm mà không cần phải mở rộng menu &quot;Máy tính này&quot;. Nhưng tính năng này trở nên khó chịu, vì nếu bạn sử dụng để giữ menu &quot;Máy tính này&quot; mở, cùng một ổ đĩa được hiển thị hai lần trong ngăn điều hướng. </p> <p><img src=\"images/image_thumb-22-749.png\" alt=\"Drives Displayed Twice in Navigation Pane of Windows 10\" loading=\"lazy\"></p> <p> Nếu bạn thấy các mục nhập trùng lặp của ổ USB đính kèm hoặc ổ cố định trong Windows 10, hãy làm theo hướng dẫn bên dưới để giải quyết sự cố. </p> <h4> Cách xóa các chữ cái ổ đĩa trùng lặp trong Windows 10 Explorer (Menu điều hướng). </h4> <p> Để ngăn Windows 10, để hiển thị hai lần ổ đĩa được đính kèm hoặc cố định, hãy áp dụng chỉnh sửa sổ đăng ký sau: </p> <p> 1. Mở Registry Editor. Để làm việc đó: </p> <blockquote><p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-493.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Trong hộp Tìm kiếm, nhập <strong> regedit </strong> và hãy nhấn <strong> Đi vào </strong> để khởi chạy Trình chỉnh sửa sổ đăng ký. </p></blockquote> <p><img src=\"images/image_thumb7-138.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Sau đó điều hướng đến khóa đăng ký này: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows \\ CurrentVersion \\ Explorer \\ Desktop \\ NameSpace \\ DelegateFolders </li> </ul> <p> 3. Sau đó nhấp chuột phải và xóa <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> Chìa khóa. </p> <p><img src=\"images/image_thumb-23-428.png\" alt=\"remove duplicate drive entries windows 10 navigation pane\" loading=\"lazy\"></p> <p> </p> <p> 4. Sau đó điều hướng đến phím này: * </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ WOW6432Node \\ Microsoft \\ Windows \\ CurrentVersion \\ Explorer \\ Desktop \\ NameSpace \\ DelegateFolders </li> </ul> <p> 5. Xóa <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> Chìa khóa. </p> <p> 6. Đóng Registry Editor. </p> <p> * Lưu ý: Nếu bạn không thể nhìn thấy khóa &quot;WOW6432Node&quot; thì hãy bỏ qua các bước 4 &amp; 5 ở trên, vì chúng chỉ áp dụng cho phiên bản Windows 10 64bit. </p> <p><strong> TIỀN BOA: </strong> Nếu bạn thay đổi quyết định của mình trong tương lai, chỉ cần nhấp chuột phải vào &#39;Thư mục đại biểu&#39; tại các vị trí đăng ký ở trên, chọn <strong> Mới </strong> -&gt; <strong> Chìa khóa </strong> và tạo lại <strong> {F5FB2C77-0E2F-4A16-A381-3E560C68BC83} </strong> (các) phím. </p> <p> Đó là tất cả! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}