{"title":"Khắc phục: Lỗi HP Smart - Trạng thái máy in không xác định (Đã giải quyết)","content":"<p> Hướng dẫn này bao gồm các hướng dẫn để giải quyết <a href=\"https://www.hpsmart.com/us/en\" target=\"_blank\" rel=\"nofollow noopener\"> HP Smart </a> lỗi ứng dụng &quot;Trạng thái máy in không xác định&quot; trên HĐH Windows 10. &quot;Trạng thái máy in không xác định&quot; trên ứng dụng HP SMART, có thể xuất hiện vì những lý do không xác định và ngăn người dùng sử dụng để Quét hoặc chức năng In trên máy in. </p> <p> Chi tiết sự cố: Trên máy tính Windows 10 có cài đặt máy in HP, lỗi &quot;Trạng thái máy in không xác định&quot; xuất hiện trong ứng dụng HP Smart, mặc dù thực tế là máy in in mà không gặp bất kỳ sự cố nào từ Web hoặc các ứng dụng khác. Vấn đề chính của lỗi này là người dùng không thể sử dụng tùy chọn QUÉT trong ứng dụng HP Smart để quét tài liệu. </p> <p> </p> <p> </p> <p><img src=\"images/image_thumb-23-787.png\" alt=\"FIX: HP Smart \" printer status unknown loading=\"lazy\"></p> <h4> KHẮC PHỤC: &quot;Trạng thái máy in không xác định&quot; trên HP Smart App. (Windows 10). </h4> <p> 1. Từ menu Bắt đầu <img src=\"images/image_thumb2_thumb_thumb-697.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> bấm vào Cài đặt <img src=\"images/image_thumb-66-822.png\" alt=\"image\" loading=\"lazy\"> và sau đó mở <strong> Ứng dụng </strong> . </p> <p><img src=\"images/image_thumb-25-257.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Nhấp vào <strong> Ứng dụng HP Smart </strong> và sau đó nhấp vào <strong> Tùy chọn nâng cao </strong> . </p> <p><img src=\"images/image_thumb-26-912.png\" alt=\"FIX: Printer Status unknown on HP Smart app\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Nhấp vào <strong> Cài lại </strong> cái nút. </p> <p><img src=\"images/image_thumb-27-494.png\" alt=\"Fix Printer Status Unknow on HP Smart app\" loading=\"lazy\"></p> <p> 4. Khi quá trình Đặt lại hoàn tất, hãy đóng tất cả các cửa sổ và mở <strong> HP Smart </strong> ứng dụng. <br> 5. Thông thường, lỗi &quot;Trạng thái máy in không xác định&quot; sẽ được giải quyết. Chỉ cần nhấp vào <strong> Thiết lập </strong> để bật tất cả các tính năng HP Smart và bạn đã hoàn tất! * </p> <p><img src=\"images/image_thumb-28-849.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Lưu ý: Nếu lỗi HP Smart &quot;Tình trạng máy in không xác định&quot; vẫn tiếp diễn, hãy thử các cách sau: </p> <blockquote><p> 1. <strong> Tắt </strong> máy tính. <br> 2. <strong> Ngắt kết nối </strong> các <strong> dây nguồn từ máy in </strong> trong 1 phút. <br> 3. Sau 1 phút, <strong> bật nguồn </strong> của bạn <strong> máy vi tính </strong> . <br> 4. Sau khi khởi động lên Windows 10, <strong> kết nối lại dây nguồn của máy in </strong> và kiểm tra xem lỗi &quot;Trạng thái máy in không xác định&quot; trên ứng dụng HP Smart có được giải quyết hay không. Nếu lỗi vẫn còn, hãy tiến hành gỡ cài đặt và cài đặt lại máy in cũng như phần mềm của máy in trên PC của bạn. </p></blockquote> <p> Đó là tất cả mọi người! Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}