{"title":"Khắc phục: Lỗi DISM 1016 Đã xảy ra lỗi khi cố gắng truy cập hình ảnh (Đã giải quyết)","content":"<p> Hướng dẫn này bao gồm các hướng dẫn để giải quyết lỗi sau khi chạy lệnh DISM trong Windows 10: &quot;Lỗi 1016: Đã xảy ra lỗi khi cố gắng truy cập hình ảnh&quot;. Lỗi DISM 1016 có thể xuất hiện khi bạn cố gắng sửa ảnh Windows bị hỏng bằng cách sử dụng một trong các lệnh DISM sau trong dấu nhắc lệnh Windows 10: </p> <ul> <li> Dism / Online / Cleanup-Image / Restorehealth </li> <li> Dism / Online / Cleanup-image / Restorehealth /source:wim:X:\\sources\\install.wim:1 / LimitAccess </li> </ul> <p> … Hoặc khi sử dụng lệnh DISM trong Windows Recovery Environment (WinRE) </p> <ul> <li> Dism.exe / Hình ảnh: X: \\ / Cleanup-Image / Restorehealth </li> </ul> <p> </p> <h4> Cách khắc phục Lỗi DISM 1016: Đã xảy ra lỗi khi cố gắng truy cập hình ảnh. </h4> <p><strong> Yêu cầu </strong> : Để khắc phục các sự cố được đề cập trong bài viết này, bằng cách làm theo các phương pháp bên dưới, bạn sẽ cần khởi động máy tính của mình từ phương tiện cài đặt Windows (USB hoặc DVD). Nếu bạn không sở hữu Phương tiện cài đặt Windows thì bạn có thể tạo một Phương tiện cài đặt bằng cách sử dụng <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Công cụ tạo phương tiện của Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách tạo phương tiện cài đặt Windows 10 USB. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách tạo phương tiện cài đặt Windows 10 DVD. </a></li> </ul> <p> </p> <h6> Phương pháp 1. Khôi phục Windows 10 như ban đầu trước khi cài đặt các bản cập nhật. </h6> <p> Lỗi DISM 1016, thường xuất hiện sau khi cài đặt Windows Update không thành công. Vì vậy, trước hết hãy hủy cài đặt các bản cập nhật. Để làm việc đó: </p> <p> 1. Khởi động hệ thống của bạn từ phương tiện cài đặt Windows. <br> 2. Ở màn hình bên dưới, nhấn nút <strong> SHIFT </strong> + <strong> F10 </strong> phím để khởi chạy dấu nhắc lệnh. (hoặc bấm vào <strong> Kế tiếp </strong> và đi đến <strong> Sửa chữa máy tính của tôi </strong> &gt; <strong> Khắc phục sự cố </strong> &gt; <strong> Dấu nhắc lệnh </strong> ). </p> <p><img src=\"images/image_thumb17_thumb-172.png\" alt=\"FIX DISM Error 1016: An error occurred while attempting to access the image\" loading=\"lazy\"></p> <p> </p> <p> 3. Tại dấu nhắc lệnh, lấy danh sách tất cả các ổ đĩa trên hệ thống của bạn bằng lệnh sau: </p> <ul> <li><strong> wmic logicdisk lấy tên </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-327.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> 4. Sau đó, tìm ra ổ đĩa nào chứa thư mục &quot;Windows&quot;, bằng cách gõ lệnh sau: * </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * ví dụ. Để xem nội dung của ổ C:, hãy nhập: &quot; <strong> dir C: </strong> &quot;(không có dấu ngoặc kép). Nếu bạn không thể thấy thư mục&quot; Windows &quot;trên ổ C: thì hãy tiếp tục đến ký tự ổ đĩa tiếp theo (ví dụ:&quot; dir D: &quot;,&quot; dir E: &quot;, v.v.), cho đến khi bạn thấy Thư mục &quot;Windows&quot; trên một trong các ổ đĩa được liệt kê (từ lệnh trên). </p> <p> [Như bạn có thể thấy ở ảnh chụp màn hình bên dưới, thư mục Windows (trong trường hợp này) nằm ở ổ đĩa D: \\.] </p> <p> </p> <p><img src=\"images/image_thumb13_thumb-1-454.png\" alt=\"image_thumb[13]\" loading=\"lazy\"></p> <p> </p> <p> 5. Sau khi bạn tìm thấy ổ đĩa &quot;Windows&quot; nằm trên ổ nào (ví dụ: tại ổ &quot;D:&quot; trong ví dụ này), hãy điều hướng đến ổ đó bằng cách nhập DriveLetter <strong> : </strong> + <strong> Đi vào </strong> . </p> <p> 6. Sau đó, tạo một thư mục đầu trên ổ đĩa bằng cách gõ lệnh này: </p> <ul> <li><strong> mkdir D: \\ Scratch </strong></li> </ul> <p><img src=\"images/image_thumb7_thumb-1-575.png\" alt=\"image_thumb[7]\" loading=\"lazy\"></p> <p> </p> <p> 7. Sau đó đưa ra lệnh dưới đây để khôi phục hệ thống của bạn sau khi cập nhật không thành công: </p> <ul> <li><strong> DISM / Hình ảnh: D: \\ / ScratchDir: D: \\ Scratch / Cleanup-Image / RevertPendingActions </strong></li> </ul> <p> * Lưu ý: Thay đổi ký tự ổ đĩa <strong> D </strong> theo trường hợp của bạn. </p> <p> 8. Khi lệnh DISM trên được thực thi, bạn sẽ nhận được thông báo sau trên màn hình: </p> <p><em> &quot;Đang hoàn nguyên các hành động đang chờ xử lý khỏi hình ảnh…. <br> Hoạt động đã hoàn thành. Mọi hành động đang chờ hoàn nguyên sẽ được thực hiện sau khi khởi động lại <br> Hoạt động đã hoàn tất thành công. &quot; </em></p> <p><img src=\"images/image_thumb11_thumb-753.png\" alt=\"image_thumb[11]\" loading=\"lazy\"></p> <p> </p> <p> 9. <strong> Đóng </strong> dấu nhắc lệnh và <strong> khởi động lại </strong> máy tính của bạn. * </p> <p> 10. Nếu Windows khởi động bình thường, hãy tiếp tục công việc của bạn. Nếu Windows không khởi động và cố gắng cài đặt lại các bản cập nhật lần nữa, thì: </p> <blockquote><p> 1. Tắt nguồn PC của bạn. <br> 2. Khởi động lại máy tính của bạn từ phương tiện cài đặt Windows. <br> 3. Khởi chạy dấu nhắc lệnh. <br> 4. Tại dấu nhắc lệnh, đưa ra các lệnh sau theo thứ tự (đừng quên thay đổi ký tự ổ đĩa <strong> D </strong> theo trường hợp của bạn): </p></blockquote> <ul> <li> <ul> <li> del D: \\ Windows \\ SoftwareDistribution </li> <li> del D: \\ Windows \\ WinSxS \\ cleanup.xml </li> <li> del D: \\ Windows \\ WinSxS \\ pending.xml </li> </ul> </li> </ul> <blockquote><p> 5. Khi hoàn tất, đóng dấu nhắc lệnh và <strong> khởi động lại </strong> PC của bạn. * </p></blockquote> <p> * Lưu ý: Nếu khởi động lại không thành công thì khởi động lại là dấu nhắc lệnh của WinRE và đưa ra các lệnh sau (đừng quên thay đổi ký tự ổ đĩa <strong> D </strong> theo trường hợp của bạn): </p> <ul> <li> chkdsk / f D: </li> <li> sfc / scannow / offbootdir = D: \\ / offwindir = D: \\ windows </li> <li> dism / image: D: \\ / cleanup-image / restorehealth </li> </ul> <p> </p> <h6> Phương pháp 2. Khôi phục Windows Registry từ bản sao lưu. </h6> <p> Phương pháp tiếp theo để khắc phục lỗi lỗi 1016 (Đã xảy ra lỗi khi cố gắng truy cập hình ảnh), là khôi phục sổ đăng ký Windows từ thư mục &#39;RegBack&#39;. * </p> <p> * Thông tin: Thư mục &#39;RegBack&#39;, (đường dẫn đầy đủ = Windows \\ System32 \\ Config \\ RegBack), là nơi Windows tự động lưu trữ bản sao lưu các tệp đăng ký bất cứ khi nào máy khởi động. </p> <p> Để khôi phục sổ đăng ký từ thư mục RegBack: </p> <p> 1. Khởi động hệ thống của bạn từ phương tiện cài đặt Windows và sau đó làm theo các bước 1-5 từ phương pháp-1 ở trên để điều hướng đến ổ đĩa Windows. (ví dụ: &quot;D:&quot; trong ví dụ này). </p> <p> 2. Trước hết, hãy sao lưu các tệp đăng ký hiện tại, bằng cách đưa ra các lệnh sau theo thứ tự. (Nhấn <strong> Đi vào </strong> sau khi gõ từng lệnh): </p> <ul> <li><strong> cd \\ windows \\ system32 \\ config </strong></li> <li><strong> md sao lưu </strong></li> <li><strong> sao chép *. * sao lưu </strong></li> </ul> <p><img src=\"images/image_thumb-26-867.png\" alt=\"infinite Automatic Repair loop windows 10 fix\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Bây giờ điều hướng đến <strong> RegBack </strong> thư mục bằng cách đưa ra lệnh này: </p> <ul> <li><strong> cd RegBack </strong></li> </ul> <p> 4. Sau đó gõ <strong> DIR </strong> (để xem nội dung của thư mục RegBack). </p> <p> 5. Bây giờ hãy xem liệu có bất kỳ tệp nào được liệt kê có <strong> 0</strong> (không) byte trong kích thước tệp của chúng và tiếp tục bên dưới tùy theo trường hợp của bạn: </p> <ul> <li><strong> Trường hợp A. </strong> Nếu bất kỳ tệp nào được liệt kê có kích thước bằng 0 (0) byte, thì <strong> dừng ở đây </strong> và <strong> tiếp tục phương pháp tiếp theo </strong> , bởi vì các tệp sao lưu sổ đăng ký là vô dụng hoặc bị hỏng. </li> <li><strong> Trường hợp B. </strong> Nếu tất cả các tệp được liệt kê, có kích thước khác 0 (như trong ảnh chụp màn hình bên dưới), thì hãy chuyển sang bước tiếp theo. </li> </ul> <p><img src=\"images/image_thumb-27-314.png\" alt=\"restore registry from backup\" loading=\"lazy\"></p> <p> </p> <p> 6. Sao chép các tệp đăng ký từ <strong> Windows \\ System32 \\ Config \\ RegBack </strong> thư mục để <strong> Windows \\ System32 \\ Config \\ </strong> thư mục, bằng cách đưa ra lệnh này: </p> <p> </p> <ul> <li><strong> sao chép *. * .. </strong></li> </ul> <p> 7. Khi được nhắc, hãy nhấn <strong> A </strong> để ghi đè lên các tệp trong đích sau khi đưa ra lệnh sao chép. </p> <p><img src=\"images/image_thumb-28-604.png\" alt=\"fix startup repair loop\" loading=\"lazy\"></p> <p> </p> <p> 8. Khi sao chép hoàn tất, hãy nhập <strong> lối ra </strong> và hãy nhấn <strong> Đi vào </strong> để đóng dấu nhắc lệnh. <br> 9. <strong> Khởi động lại </strong> máy tính của bạn và cố gắng khởi động vào Windows. </p> <p> * Lưu ý: Nếu Windows không khởi động lại được thì khởi động lại là dấu nhắc lệnh của WinRE và đưa ra các lệnh sau (đừng quên thay đổi ký tự ổ đĩa <strong> D </strong> theo trường hợp của bạn): </p> <ul> <li> chkdsk / f D: </li> <li> sfc / scannow / offbootdir = D: \\ / offwindir = D: \\ windows </li> <li> dism / image: D: \\ / cleanup-image / restorehealth </li> </ul> <p> </p> <h6> Phương pháp 3. Khôi phục Windows 10 về Trạng thái làm việc trước đó. </h6> <p> Phương pháp tiếp theo để giải quyết lỗi DISM 1016 là khôi phục hệ thống của bạn về trạng thái hoạt động trước đó. Để làm việc đó: </p> <p> 1. Khởi động hệ thống của bạn từ phương tiện cài đặt Windows. <br> 2. Ở màn hình bên dưới, hãy nhấp vào <strong> Kế tiếp </strong> và sau đó nhấp vào <strong> Sửa máy tính của bạn </strong> &gt; <strong> Khắc phục sự cố. </strong></p> <p><img src=\"images/image_thumb20_thumb-815.png\" alt=\"image_thumb[20]\" loading=\"lazy\"></p> <p> </p> <p> 3. Tại <strong> Tùy chọn nâng cao </strong> nhấp chuột <strong> Khôi phục hệ thống. * </strong></p> <p> * Lưu ý: Nếu <strong> Quay lại bản dựng trước </strong> tùy chọn, có sẵn trên màn hình này, sau đó chọn tùy chọn đó. </p> <p><img src=\"images/image_thumb28_thumb-863.png\" alt=\"image_thumb[28]\" loading=\"lazy\"></p> <p> </p> <p> 4. Ở màn hình tiếp theo, hãy nhấp vào Hệ điều hành của bạn. </p> <p><img src=\"images/image_thumb29_thumb-664.png\" alt=\"image_thumb[29]\" loading=\"lazy\"></p> <p><strong> </strong></p> <p> 5. Sau đó, tại Trình hướng dẫn Khôi phục Hệ thống, hãy nhấp vào <strong> Kế tiếp </strong> và sau đó chọn một trạng thái làm việc sớm hơn (Ngày / Giờ) và nhấp vào <strong> Kế tiếp </strong> để bắt đầu quá trình khôi phục. </p> <p><img src=\"images/image_thumb-50-619.png\" alt=\"system restore windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Phương pháp 4. Sửa chữa Windows 10. </h6> <p> Phương pháp cuối cùng để giải quyết lỗi 1016 trong DISM, là <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> sửa chữa Windows 10 với Nâng cấp Tại chỗ </a> hoặc để sao lưu các tệp của bạn và sau đó <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> cài đặt sạch Windows 10 </a> . </p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}