{"title":"Khắc phục: Truy cập nhanh không hoạt động &amp; không thể nhập vào hộp Tìm kiếm trong Windows 10 (Đã giải quyết)","content":"<p> Nếu <strong> Acces nhanh </strong> menu s không hoạt động trong Windows 10, sau đó đọc hướng dẫn này để khắc phục sự cố. Tùy chọn Truy cập nhanh trong File Explorer, cho phép người dùng dễ dàng điều hướng đến các tệp và thư mục đã mở gần đây. Nhưng đôi khi, đặc biệt là khi trước đó bạn đã mở tệp / thư mục từ ổ đĩa ngoài (ví dụ: Đĩa USB của bạn), hiện đang ngoại tuyến, Truy cập nhanh không hiển thị các tệp gần đây hoặc bạn không thể nhập vào thanh &#39;Tìm kiếm&#39;. </p> <p><img src=\"images/image_thumb-2-490.png\" alt=\"FIX: Quick Access Not Working in Windows 10 (Solved)\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cách khắc phục: Tính năng Truy cập nhanh và chức năng Tìm kiếm không hoạt động trong Windows 10. </h4> <p> </p> <h6> Phương pháp 1. Khởi động lại Windows Explorer. </h6> <p> Phương pháp đầu tiên để khắc phục sự cố Truy cập nhanh là khởi động lại quá trình Windows Explorer từ Trình quản lý tác vụ. Để làm việc đó: </p> <p> 1. Nhấn <strong> Ctrl </strong> + <strong> Alt </strong> + <strong> Del </strong> mở <strong> Quản lý công việc </strong> . <br> 2. Tại <strong> Quy trình </strong> *, đánh dấu <strong> Windows Explorer </strong> xử lý và nhấp chuột <strong> Khởi động lại </strong> . </p> <p> * Lưu ý: Nếu bạn không thấy tab &#39;Xử lý&#39;, hãy nhấp vào <strong> Thêm chi tiết. </strong></p> <p><img src=\"images/image_thumb-951.png\" alt=\"restart windows explorer\" loading=\"lazy\"></p> <p><strong> </strong></p> <h6> Phương pháp 2. Bật truy cập nhanh Các mục gần đây &amp; Xóa lịch sử File Explorer. </h6> <p> 1. Mở <strong> Tùy chọn thư mục. </strong> Để làm điều đó, hãy mở Windows Explorer và từ menu, đi tới <strong> Lượt xem </strong> &gt; <strong> Tùy chọn </strong> . </p> <p><img src=\"images/image_thumb-3-949.png\" alt=\"enable quick access windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2 trong <strong> Chung </strong> , hãy đảm bảo rằng các hộp kiểm sau được chọn. </p> <ul> <li><strong> Hiển thị các tệp được sử dụng gần đây trong Truy cập nhanh </strong></li> <li><strong> Hiển thị các thư mục thường dùng trong Truy cập nhanh. </strong></li> </ul> <p> 3. Sau đó nhấp vào <strong> Thông thoáng </strong> để xóa lịch sử File Explorer. </p> <p><img src=\"images/image_thumb-4-329.png\" alt=\"clear quick access history\" loading=\"lazy\"></p> <p> </p> <p> 3. Nhấp vào <strong> đồng ý </strong> và kiểm tra xem Truy cập nhanh và chức năng tìm kiếm có hoạt động không. Nếu không, hãy khởi động lại &#39;File Explorer&#39; bằng cách sử dụng Trình quản lý tác vụ (xem phương pháp-1 ở trên) và kiểm tra lại. Nếu sự cố vẫn tiếp tục đến phương pháp tiếp theo. </p> <h6> Phương pháp 3. Xóa lịch sử các mục gần đây theo cách thủ công. </h6> <p> Phương pháp tiếp theo để giải quyết sự cố với các mục gần đây của Truy cập nhanh hoặc với chức năng &#39;Tìm kiếm&#39; trong Windows 10, là xóa lịch sử các mục gần đây theo cách thủ công. Để làm việc đó: </p> <p> 1. Mở Windows Explorer. <br> 2. Sao chép và dán địa chỉ sau vào thanh địa chỉ và nhấn <strong> Đi vào </strong> : </p> <p> % AppData% \\ Microsoft \\ Windows \\ Recent \\ AutomaticDestination </p> <p><img src=\"images/image_thumb-1-410.png\" alt=\"clear recent items windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Nhấn <strong> Ctrl </strong> + <strong> A </strong> (để chọn tất cả các mục) và nhấn <strong> Xóa bỏ </strong> (hoặc nhấp chuột phải&gt; <strong> Xóa bỏ </strong> ). </p> <p><img src=\"images/image_thumb-5-834.png\" alt=\"Delete Quick Access History\" loading=\"lazy\"></p> <p> </p> <p> 4. Sau đó sao chép / dán địa chỉ sau vào thanh địa chỉ và nhấn <strong> Đi vào </strong> . </p> <p> % AppData% \\ Microsoft \\ Windows \\ Recent \\ CustomDestination </p> <p><img src=\"images/image_thumb-6-259.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Nhấn <strong> Ctrl </strong> + <strong> A </strong> một lần nữa (để chọn tất cả các mục) và nhấn <strong> Xóa bỏ. <br> </strong> 6. Bây giờ nhấn <strong> Ctrl + Alt + Del </strong> mở <strong> Quản lý công việc </strong> . <br> 7. Tại <strong> Quy trình </strong> tab, đánh dấu <strong> Windows Explorer </strong> xử lý và nhấp chuột <strong> Khởi động lại </strong> . <br> 8. Thông thường, các vấn đề với tính năng &quot;Truy cập nhanh&quot; hoặc với chức năng &quot;Tìm kiếm&quot; &quot;, phải được giải quyết. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}