{"title":"Khắc phục: Bảo vệ chống vi-rút và mối đe dọa được Tổ chức của bạn quản lý trong Windows 10. (Đã giải quyết)","content":"<p> Hướng dẫn này bao gồm các hướng dẫn để giải quyết sự cố sau trong Trung tâm Bảo mật của Bộ bảo vệ Windows: &quot;Bảo vệ chống vi-rút và mối đe dọa do tổ chức của bạn quản lý&quot; trong Hệ điều hành Windows 10. </p> <p> Thông báo của Bộ bảo vệ Windows (lỗi): &quot;Bảo vệ chống vi-rút và mối đe dọa do tổ chức của bạn quản lý&quot;, &quot;Một số cài đặt do tổ chức của bạn quản lý&quot; &amp; <br> &quot;Bảo vệ theo thời gian thực do quản trị viên của bạn quản lý&quot;, thường xuất hiện trên các máy tính doanh nghiệp có Bảo vệ chống vi-rút do Quản trị viên miền quản lý. Nếu máy tính không thuộc Miền, thì (các) lỗi trên sẽ xuất hiện sau khi cài đặt phần mềm chống vi-rút của bên thứ ba hoặc sau khi bị vi-rút tấn công. </p> <p><img src=\"images/image_thumb-25-853.png\" alt=\"FIX: Virus & Threat Protection is Managed by your Organization - Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Cách khắc phục: Tính năng bảo vệ chống vi-rút và mối đe dọa do tổ chức của bạn quản lý trong Windows 10. </h4> <h6> Bước 1. Gỡ cài đặt bất kỳ phần mềm chống vi rút không phải của Microsoft. </h6> <p> Bước đầu tiên để giải quyết lỗi Windows Defender &quot;Bảo vệ chống vi-rút và mối đe dọa do tổ chức của bạn quản lý&quot; là gỡ cài đặt bất kỳ phần mềm chống vi-rút của bên thứ ba nào khác (ví dụ: Avast, MacAfee, MalwareBytes, v.v.) khỏi hệ thống của bạn. </p> <p> </p> <h6> Bước 2. Quét hệ thống của bạn để tìm Virus và Phần mềm độc hại. </h6> <p> Bước thứ hai để giải quyết lỗi Windows Defender &quot;Một số cài đặt do tổ chức của bạn quản lý&quot; là đảm bảo rằng hệ thống của bạn không có vi-rút / phần mềm độc hại. Đối với nhiệm vụ đó, hãy làm theo hướng dẫn trong hướng dẫn này: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách quét vi rút và các chương trình độc hại khác trên máy tính của bạn. </a></p> <p> </p> <h6> Bước 3. Khôi phục Cài đặt Bộ bảo vệ Windows về Giá trị Mặc định. </h6> <p> Tiếp tục và bật Bảo vệ thời gian thực trong Bộ bảo vệ Windows bằng cách sử dụng một trong các phương pháp bên dưới: </p> <h4> Phương pháp 1. BẬT Bảo vệ chống vi-rút của Bộ bảo vệ trong Sổ đăng ký. </h4> <p> 1. Mở <strong> Trình chỉnh sửa sổ đăng ký </strong> : Để làm việc đó: </p> <ul> <li> Nhấn đồng thời Windows <img src=\"images/image_thumb36-979.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. </li> <li> Kiểu <strong> regedit </strong> &amp; nhấn <strong> Đi vào. </strong></li> </ul> <p><img src=\"images/image_thumb7-229.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 2 .. Điều hướng đến phím sau ở ngăn bên trái: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Policies \\ Microsoft \\ Windows Defender </strong></li> </ul> <p> 3. Tại ngăn bên phải, nhấp đúp vào <strong> DisableAntiSpyware </strong> Giá trị REG_DWORD và thay đổi dữ liệu giá trị từ 1 thành <strong> 0. </strong></p> <p><img src=\"images/image_thumb-26-852.png\" alt=\"enable defender antivirus protection - registry\" loading=\"lazy\"></p> <p> </p> <p> 4. Nhấp vào <strong> đồng ý </strong> và <strong> đóng </strong> Trình chỉnh sửa sổ đăng ký. <br> 5. <strong> Khởi động lại </strong> PC của bạn. Thông thường sau khi khởi động lại, Windows Defender sẽ được bật. * </p> <p> * Lưu ý: Nếu sau khi khởi động lại PC của bạn, Bộ bảo vệ Windows vẫn bị tắt, với trạng thái &quot;Bảo vệ chống vi-rút &amp; mối đe dọa do tổ chức của bạn quản lý&quot;, hãy tiếp tục và sửa đổi <br> <strong> Khởi đầu </strong> Giá trị REG_DWORD từ 4 đến <strong> 2 </strong> tại các khóa đăng ký sau: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ SecurityHealthService </li> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ WinDefend </li> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ WdNisSvc </li> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ MpsSvc </li> </ul> <p> </p> <h5> Phương pháp 2. Xóa <strong> DisableAntiSpyware </strong> Giá trị đăng ký từ Dấu nhắc lệnh. </h5> <p> 1. Mở <strong> Command Prompt với tư cách là quản trị viên </strong> . Để làm việc đó: </p> <ul> <li> Tại hộp tìm kiếm, gõ: <strong> dấu nhắc lệnh </strong> hoặc là <strong> cmd </strong></li> <li> Nhấp chuột phải vào <strong> cmd </strong> hoặc là <strong> Dấu nhắc lệnh </strong> kết quả và chọn <strong> Chạy như quản trị viên. </strong></li> </ul> <p><img src=\"images/image_thumb-10-243.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. Trong Dấu nhắc lệnh, nhập (Sao chép / Dán) lệnh sau và nhấn <strong> Đi vào: </strong></p> <ul> <li> ĐĂNG KÝ XÓA &quot;HKLM \\ SOFTWARE \\ Policies \\ Microsoft \\ Windows Defender&quot; / v DisableAntiSpyware </li> </ul> <p> 3. Sau đó nhấn <strong> Y </strong> để xác nhận quyết định của bạn. </p> <p><img src=\"images/image_thumb-28-288.png\" alt=\"enable defender antivirus protection command\" loading=\"lazy\"></p> <p> </p> <p> 4. Đóng dấu nhắc lệnh và <strong> khởi động lại </strong> máy tính của bạn. </p> <p> </p> <h5> Phương pháp 3. BẬT Bảo vệ thời gian thực của Bộ bảo vệ Windows trong Chính sách Nhóm. </h5> <p> Nếu bạn sở hữu phiên bản Windows 10 Professional, Enterprise hoặc Education, hãy tiếp tục và bật tính năng bảo vệ Chống vi-rút của Bộ bảo vệ Windows trong Chính sách Nhóm. Để làm việc đó: </p> <p> 1. Nhấn đồng thời Windows <img src=\"images/image_thumb36-102.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại <strong> gpedit.msc </strong> &amp; Nhấn <strong> Đi vào. </strong></p> <p><img src=\"images/image_thumb-78-343.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Ở ngăn bên trái, điều hướng đến: </p> <ul> <li><strong> Cấu hình máy tính \\ Mẫu quản trị \\ Cấu phần Windows \\ Bộ bảo vệ Windows Antivirus </strong></li> </ul> <p> 4. Tại ngăn bên phải, mở <strong> Tắt tính năng chống vi-rút của Bộ bảo vệ Windows </strong> cài đặt. </p> <p><img src=\"images/image14_thumb-207.png\" alt=\"turn on defender antivirus protection- group policy\" loading=\"lazy\"></p> <p> </p> <p> 5. Đặt cài đặt chính sách thành <strong> Không được định cấu hình </strong> hoặc là <strong> Tàn tật </strong> để kích hoạt tính năng bảo vệ thời gian thực và nhấp vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-29-337.png\" alt=\"enable defender antivirus protection group policy\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Khởi động lại </strong> máy tính. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trong các mạng xã hội để giúp lan truyền về vấn đề này. </p>"}