{"title":"Khắc phục: Không có đủ bộ nhớ để xử lý lệnh này - Không thể truy cập Thư mục được chia sẻ hoặc Sử dụng Máy tính Từ xa (Đã giải quyết)","content":"<p> Lỗi &quot;Không có đủ bộ nhớ để xử lý lệnh này&quot;, có thể xuất hiện khi bạn cố gắng truy cập các thư mục được chia sẻ trên một máy trạm Windows khác hoặc Server 2003, 2008, 2012 hoặc 2016 hoặc khi bạn đang sử dụng Kết nối Máy tính Từ xa (RDP ), để kết nối với một máy tính Windows khác (Máy trạm hoặc Máy chủ). </p> <p><img src=\"images/image_thumb-127.png\" alt=\"Not enough storage is available to process this command\" loading=\"lazy\"></p> <p> </p> <p> Hướng dẫn này bao gồm các hướng dẫn để giải quyết các sự cố sau, có thể xuất hiện trên tất cả các phiên bản Windows (Windows 10, 8 / 8.1, 7, Vista, XP &amp; Windows Server 2003, 2008, 2012 hoặc 2016): </p> <p> 1. Khi bạn cố gắng truy cập các thư mục được chia sẻ trên máy chủ, bạn nhận được thông báo lỗi: &quot; <em> Thư mục được chia sẻ </em> không thể truy cập được. Bạn có thể không được phép sử dụng tài nguyên mạng này. Liên hệ với quản trị viên của máy chủ này để tìm hiểu xem bạn có quyền truy cập hay không. Không có đủ bộ nhớ máy chủ để xử lý lệnh này. &quot; </p> <p> 2. Khi bạn cố gắng kết nối từ xa (sử dụng RDP) với một máy chạy Windows khác, bạn nhận được thông báo lỗi: &quot;Hệ thống không thể đăng nhập bạn do lý do sau. Không có đủ bộ nhớ để xử lý lệnh này&quot;. </p> <h4> CÁCH KHẮC PHỤC: Thông báo lỗi &quot;Không có đủ bộ nhớ để xử lý lệnh này&quot; trong Máy tính Từ xa (RDP) hoặc khi cố gắng truy cập Thư mục được chia sẻ. </h4> <p> Trên máy &quot;máy chủ&quot; Windows mà bạn muốn truy cập các tệp của nó hoặc kết nối từ xa: </p> <p><strong> 1. </strong> Nhấn &quot; <strong> các cửa sổ </strong> &quot;+&quot; <strong> R </strong> ”Chìa khóa để mở <em> CHẠY </em> cửa sổ. <br> <strong> 2. </strong> Kiểu <strong> regedit </strong> và hãy nhấn <strong> Đi vào </strong> để mở Registry Editor. </p> <p><img src=\"images/image_thumb7-649.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Sau đó, điều hướng đến phím này: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ LanmanServer \\ Parameters </strong></li> </ul> <p><img src=\"images/image_thumb-1-198.png\" alt=\"fix Not enough storage - cannot access shared items\" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Tại ngăn bên phải, nhấp đúp để mở <strong> IRPStackSize </strong> giá trị <strong> . * </strong></p> <p><strong> * Ghi chú: </strong> Nếu bạn không thấy <strong> IRPStackSize </strong> giá trị, sau đó: </p> <p> </p> <blockquote><p> 1. Nhấp chuột phải vào không gian trống (ở khung bên phải) và sau đó chọn <strong> Mới </strong> -&gt; <strong> Giá trị DWORD (32-bit) </strong></p> <p><img src=\"images/image_thumb-2-236.png\" alt=\"fix Not enough storage using RDP (Remote Desktop)\" loading=\"lazy\"></p> </blockquote> <blockquote><p> 2. Đặt tên cho giá trị mới <strong> IRPStackSize </strong> va đanh <strong> Đi vào. </strong></p></blockquote> <p><strong> 5. </strong> Lựa chọn <strong> Thập phân </strong> , thay đổi dữ liệu giá trị thành <strong> 50 </strong> và bấm vào <strong> đồng ý </strong> . * </p> <p> * Lưu ý: Phạm vi (ở dạng thập phân) cho tham số, là từ 1 đến 50. </p> <p><img src=\"images/image_thumb-3-255.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 6. </strong> <strong> Đóng </strong> biên tập viên đăng ký và <strong> khởi động lại </strong> Máy chủ. * </p> <p> * Lưu ý quan trọng: Nếu sau khi khởi động lại, bạn nhận được thông báo lỗi tương tự, khi bạn đang sử dụng Kết nối Máy tính Từ xa hoặc khi bạn cố gắng truy cập các tệp được chia sẻ trên một máy tính khác, thì hãy áp dụng sửa đổi sổ đăng ký trên cho máy tính của bạn. </p> <p> Đó là tất cả! Nó đã làm việc cho bạn? </p> <p> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}