{"title":"Khắc phục: sppsvc.exe sử dụng CPU cao trong Windows 10. (Đã giải quyết)","content":"<p> Trên máy tính Windows 10, quá trình &quot;sppsvc&quot; khiến CPU sử dụng nhiều. Quy trình &quot;sppsvc&quot;, thuộc về dịch vụ &quot;Nền tảng bảo vệ phần mềm&quot; chịu trách nhiệm tải xuống, cài đặt và thực thi giấy phép kỹ thuật số cho Windows và các ứng dụng Windows. </p> <p> Trong hướng dẫn này, bạn sẽ tìm thấy các hướng dẫn để giải quyết vấn đề sử dụng CPU cao của Nền tảng Bảo vệ Phần mềm (sppsvc.exe) trên Windows 10. </p> <h2> Cách khắc phục: Sử dụng CPU cao do sppsvc.exe trong Windows 10. </h2> <h6> Phương pháp 1. Loại bỏ bất kỳ Trình kích hoạt / Crack Phần mềm Microsoft nào. </h6> <p> Thông thường, vấn đề sử dụng CPU cao của dịch vụ nền tảng Bảo vệ Phần mềm (sppsvc. Exe) là do bạn không sử dụng phiên bản hợp pháp của phần mềm Microsoft và bạn đang sử dụng trình kích hoạt (crack) để &quot;tạo&quot; phần mềm chính hãng. </p> <p> Ví dụ: nếu bạn đang chạy phiên bản Windows hoặc Office vi phạm bản quyền, với trình kích hoạt KMS, thì trình kích hoạt KMS sẽ cố gắng ngăn dịch vụ kích hoạt Windows kiểm tra giấy phép của sản phẩm MS và đó là lý do tại sao quá trình &quot;SPPSVC&quot; gây ra CPU hoạt động ở mức 100%. </p> <p> Vì vậy, nếu bạn đang sử dụng phần mềm MS lậu có trình kích hoạt, hãy gỡ cài đặt trình kích hoạt (crack) và kiểm tra xem sự cố đã được khắc phục chưa. </p> <p> </p> <h6> Phương pháp 2. Quét hệ thống của bạn để tìm Virus và Phần mềm độc hại. </h6> <p> Bước thứ hai để giải quyết vấn đề sử dụng CPU cao của dịch vụ “Nền tảng bảo vệ phần mềm” là đảm bảo rằng hệ thống của bạn không có vi rút / phần mềm độc hại. Đối với nhiệm vụ đó, hãy làm theo hướng dẫn trong hướng dẫn này: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách quét vi rút và các chương trình độc hại khác trên máy tính của bạn. </a></p> <p> </p> <h6> Phương pháp 3. Cài đặt tất cả các Bản cập nhật có sẵn. </h6> <p> Phương pháp tiếp theo để khắc phục tình trạng sử dụng CPU cao &quot;sppsvc.exe&quot; trong Windows 10 là cài đặt tất cả các bản cập nhật Windows có sẵn. Để làm việc đó: </p> <p> 1. Đi tới <strong> Khởi đầu </strong> thực đơn <img src=\"images/image_thumb2_thumb_thumb-650.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Cài đặt </strong> <img src=\"images/image_thumb-66-295.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Cập nhật &amp; Bảo mật </strong> -&gt; và <strong> Kiểm tra cập nhật </strong> . </p> <p><img src=\"images/image_thumb-1-263.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Phương pháp 4. Chạy Bảo trì Hệ thống. </h6> <p> 1. Điều hướng đến <strong> Bảng điều khiển </strong> -&gt; <strong> Hệ thống và Bảo mật </strong> -&gt; <strong> Bảo mật và Bảo trì </strong><br> 2. Tại phần &#39;Bảo trì&#39;, nhấp vào <strong> Bắt đầu bảo trì </strong> . </p> <p><img src=\"images/image_thumb-2-498.png\" alt=\"Fix Software Protection Platform high cpu usage windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Khi quá trình bảo trì hoàn tất, hãy khởi động lại máy tính của bạn và kiểm tra xem sự cố sử dụng CPU cao do sppsvc.exe gây ra đã được giải quyết chưa. </p> <p> </p> <h6> Phương pháp 5. Tắt dịch vụ Bảo vệ phần mềm. </h6> <p> Giải pháp cuối cùng để giải quyết vấn đề &quot;sppsvc.exe Sử dụng CPU cao&quot; là tắt hoàn toàn dịch vụ &quot;Bảo vệ phần mềm&quot;, nhưng tôi không khuyên bạn nên làm điều đó, vì bạn có thể gặp phải sự cố khi kích hoạt Windows của mình. </p> <p><strong> Để tắt dịch vụ Bảo vệ phần mềm (SPPSVC): </strong></p> <p> 1. Nhấn Windows <img src=\"images/image_thumb41-130.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại <strong> regedit </strong> và hãy nhấn <strong> Đi vào </strong> . </p> <p><img src=\"images/image_thumb42-664.png\" alt=\"registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Trong trình chỉnh sửa sổ đăng ký Windows, xác định vị trí khóa sau: </p> <ul> <li><strong> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ sppsvc </strong></li> </ul> <p> 4. Tại ngăn bên phải, nhấp đúp vào <strong> Khởi đầu </strong> Giá trị REG_DWORD. </p> <p><img src=\"images/image_thumb-3-736.png\" alt=\"FIX: sppsvc.exe High CPU usage in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 5. Thay đổi dữ liệu giá trị từ 2 thành <strong> 4 </strong> để tắt dịch vụ &quot;Bảo vệ phần mềm&quot; và nhấp vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-4-758.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Đóng Registry Editor và <strong> khởi động lại </strong> PC của bạn và kiểm tra xem sự cố đã được giải quyết chưa. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}