{"title":"Khắc phục: Không thể phát trực tuyến lỗi Office trong khi Cài đặt hoặc Gỡ cài đặt Office. (Đã giải quyết)","content":"<p> Trong hướng dẫn này, bạn sẽ tìm thấy hướng dẫn từng bước để giải quyết lỗi &quot;Không thể phát trực tuyến Office&quot; khi bạn cố gắng cập nhật, cài đặt hoặc gỡ cài đặt Office 2013, Office 2016, Office 2019 hoặc Office 365 trên PC chạy Windows. </p> <p> Chi tiết sự cố: Khi bạn cố gắng cập nhật, cài đặt hoặc loại bỏ Office 365, 2016 hoặc 2013, bằng cách sử dụng &quot; <em> Chương trình và những tính năng </em> &quot;trong Control Panel, bạn nhận được thông báo lỗi sau:&quot; <em> Không thể phát trực tuyến Office. Xin lỗi, chúng tôi đã gặp sự cố khi phát trực tuyến Office. Vui lòng thử lại sau. (Các) mã lỗi: 30015-25 (1006) hoặc 30182–1 (2) hoặc 30183-39 (-2147014790) hoặc Mã lỗi 30179-25). </em></p> <p><img src=\"images/image_thumb-4-575.png\" alt=\"Couldn't Stream Office error \" loading=\"lazy\"></p> <p> </p> <h4> Cách khắc phục: Không thể phát trực tuyến Office 2013, 2016, 2019 hoặc 365. </h4> <p> * Quan trọng: Thông báo lỗi &quot;Không thể phát trực tuyến Office&quot; có thể xuất hiện vì những lý do sau: </p> <ol> <li> <ol> <li> Chương trình Chống vi-rút / Tường lửa của bạn có thể ngăn kết nối với Máy chủ Microsoft để Cập nhật Office. </li> <li> Bạn có thể hết dung lượng ổ đĩa. </li> </ol> </li> </ol> <p> Vì vậy, trước khi bạn tiếp tục phương pháp bên dưới, hãy thử các bước sau trước khi cài đặt, gỡ cài đặt hoặc cập nhật Office: </p> <ol> <li> <ol> <li> Tắt (hoặc gỡ cài đặt hoàn toàn) chương trình Chống vi-rút / Tường lửa của bạn. </li> <li> Giải phóng dung lượng trên ổ cứng của bạn rồi thử cài đặt lại hoặc cập nhật Office. </li> </ol> </li> </ol> <p> Nếu sau khi thử các cách trên, bạn vẫn gặp lỗi &quot;Không thể phát trực tuyến Office&quot;, hãy tiến hành gỡ bỏ hoàn toàn và cài đặt lại Office. Để làm việc đó: </p> <p> 1. Tải xuống <a href=\"https://aka.ms/SaRA-officeUninstallFromPC\" target=\"_blank\" rel=\"nofollow noopener\"> Gỡ cài đặt Công cụ hỗ trợ Microsoft Office </a> . <br> 2. Khi quá trình tải xuống hoàn tất, nhấp đúp để chạy &quot;SetupProd_OffScrub.exe&quot;. <br> 3. Nhấp vào <strong> Tải về </strong> để cài đặt &#39;Microsoft Support and Recovery Assistant&#39;. </p> <p><img src=\"images/image_thumb-5-986.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Khi quá trình cài đặt hoàn tất, hãy nhấp vào <strong> Đồng ý </strong> và sau đó nhấp vào <strong> Đúng. </strong></p> <p><img src=\"images/image_thumb-6-745.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Chờ cho đến khi &#39;Hỗ trợ của Microsoft và Hỗ trợ khôi phục&#39; khắc phục sự cố. <br> 6. Chọn hộp kiểm, ở bên trái của tên sản phẩm Office để <strong> chọn tất cả các sản phẩm Office đã cài đặt </strong> và bấm vào <strong> Kế tiếp </strong> . </p> <p><img src=\"images/image_thumb-7-956.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Bây giờ, hãy đợi cho đến khi quá trình gỡ bỏ Office hoàn tất và khi việc này được thực hiện, <strong> khởi động lại </strong> máy tính của bạn. <br> 8. Sau khi khởi động lại, hãy tiếp tục và cài đặt lại Office bằng cách làm theo hướng dẫn từ các liên kết sau: </p> <ul> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Văn phòng 365 </a></li> <li><a href=\"https://support.office.com/article/4414eaaf-0478-48be-9c42-23adc4716658?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Văn phòng 2019 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Office 2016 </a></li> <li><a href=\"https://support.office.com/article/7c695b06-6d1a-4917-809c-98ce43f86479?wt.mc_id=SCL_DemsToken_262f265f-4c5e-4c46-852f-2a3890829d34\" target=\"_blank\" rel=\"nofollow noopener\"> Văn phòng 2013 </a></li> </ul> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}