{"title":"Khắc phục Dịch vụ Đe dọa Windows 10 đã bị dừng và không thể khởi động (Đã giải quyết)","content":"<p> Trong hướng dẫn này, bạn sẽ tìm thấy hướng dẫn từng bước để giải quyết &quot;Lỗi không mong muốn, Xin lỗi, chúng tôi đã gặp sự cố&quot;, sau khi nhấn nút &#39;Khởi động lại ngay bây giờ&#39; để bắt đầu dịch vụ Đe dọa nhằm khắc phục sự cố &quot;Dịch vụ Đe dọa đã dừng . Khởi động lại ngay bây giờ &quot;trong Hệ điều hành Windows 10. </p> <p><img src=\"images/image_thumb-689.png\" alt=\"Threat Service has Stopped and Cannot Start\" loading=\"lazy\"></p> <p> </p> <p> Sự cố chi tiết: Tính năng Vi rút và Đe dọa trong Trình chống vi rút của Bộ bảo vệ Windows hiển thị &quot;Không xác định&quot; và do dịch vụ Đe dọa đã dừng và không thể bắt đầu với (các) lỗi: </p> <ul> <li><em> Lỗi không mong muốn, Xin lỗi, chúng tôi đã gặp sự cố. Vui lòng thử lại. </em></li> <li><em> Trang không có sẵn. Quản trị viên CNTT của bạn có quyền truy cập hạn chế vào một số khu vực của ứng dụng này và mục bạn đã cố gắng truy cập không khả dụng. Liên hệ với bộ phận trợ giúp CNTT để biết thêm thông tin. </em></li> </ul> <p><img src=\"images/image_thumb-1-155.png\" alt=\"Unable to Start Threat Service. Page not available.\" loading=\"lazy\"></p> <p> </p> <h4> Cách khắc phục: Dịch vụ Đe doạ đã Dừng và Không thể Khởi động trong Bộ bảo vệ Windows 10. </h4> <h6> Bước 1. Loại bỏ bất kỳ phần mềm chống vi-rút nào khác. </h6> <p> Bước đầu tiên để sửa lỗi &quot;Threat Service has Stopped&quot; là gỡ cài đặt bất kỳ phần mềm chống vi-rút nào khác khỏi PC của bạn. </p> <p> </p> <h6> Bước 2. Bật Chính sách của Bộ bảo vệ Windows. </h6> <p> 1. Mở <strong> Trình chỉnh sửa sổ đăng ký </strong> : Để làm việc đó: </p> <ul> <li> Nhấn đồng thời Windows <img src=\"images/image_thumb36-454.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. </li> <li> Kiểu <strong> regedit </strong> &amp; Nhấn <strong> Đi vào. </strong></li> </ul> <p><img src=\"images/image_thumb7-613.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Điều hướng đến khóa sau ở ngăn bên trái: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Policies \\ Microsoft \\ Windows Defender </li> </ul> <p> 4. Tại ngăn bên phải thay đổi giá trị &#39;DisableAntiSpyware&#39; từ 1 thành <strong> 0 * </strong></p> <p> * Lưu ý: Nếu bạn không tìm thấy giá trị &#39;DisableAntiSpyware&#39;, hãy nhấp chuột phải vào khoảng trống và chọn <strong> Mới </strong> -&gt; <strong> Giá trị DWORD (32-bit) </strong> và sau đó đặt cho giá trị là tên &quot; <strong> DisableAntiSpyware </strong> &quot; </p> <p><img src=\"images/image_thumb-2-284.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Đóng Registry Editor và <strong> khởi động lại </strong> PC của bạn. <br> 6. Bây giờ hãy kiểm tra xem Bảo vệ mối đe dọa có ổn không và nếu sự cố vẫn tiếp diễn, hãy tiếp tục bước tiếp theo. </p> <p> </p> <h6> Bước 3. Bật Dịch vụ chống vi-rút của Bộ bảo vệ Windows trong Sổ đăng ký. </h6> <p> 1. Mở Registry Editor. <br> 2. Điều hướng đến khóa sau ở ngăn bên trái: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SYSTEM \\ CurrentControlSet \\ Services \\ WinDefend </li> </ul> <p> 3. Tại ngăn bên phải, hãy sửa đổi <strong> Khởi đầu </strong> giá trị từ 4 đến <strong> 2 </strong> . * </p> <p> * Lưu ý: Nếu bạn không thể sửa đổi giá trị đăng ký, hãy khởi động Windows 10 ở Chế độ An toàn và thử lại. </p> <p><img src=\"images/image_thumb-3-898.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Đóng Registry Editor và <strong> khởi động lại </strong> PC của bạn. <br> 6. Bây giờ hãy kiểm tra xem Bảo vệ mối đe dọa có ổn không và nếu sự cố vẫn tiếp diễn, hãy tiếp tục bước tiếp theo. </p> <p> </p> <h6> Bước 4. Khắc phục sự cố của Bộ bảo vệ Windows với DISM. </h6> <p> Phương pháp tiếp theo để giải quyết lỗi Trung tâm Bảo mật của Bộ bảo vệ Windows 10 &quot;Dịch vụ Đe dọa đã Dừng và Không thể Bắt đầu&quot;, là sửa chữa Windows bằng cách sử dụng công cụ Sẵn sàng Cập nhật Hệ thống (DISM). </p> <p> 1. Mở <strong> Command Prompt với tư cách là quản trị viên </strong> . Để làm việc đó: </p> <ul> <li> Tại hộp tìm kiếm, gõ: <strong> dấu nhắc lệnh </strong> hoặc là <strong> cmd </strong></li> <li> Nhấp chuột phải vào <strong> Dấu nhắc lệnh </strong> kết quả và chọn <strong> Chạy như quản trị viên. </strong></li> </ul> <p><img src=\"images/image_thumb-10-227.png\" alt=\"command prompt as administrator\" loading=\"lazy\"></p> <p> </p> <p> 2. Trong dấu nhắc lệnh, hãy đưa ra lệnh xuống dưới đây và nhấn <strong> Đi vào: </strong></p> <ul> <li><strong> DISM.exe / Trực tuyến / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-47-140.png\" alt=\"repair windows update corruptions\" loading=\"lazy\"></p> <p> </p> <p> 3. Khi thao tác DISM hoàn tất, hãy nhập lệnh sau và nhấn <strong> Đi vào </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb31-197.png\" alt=\"scan repair system files\" loading=\"lazy\"></p> <p> 4. Bây giờ hãy đợi cho đến khi Trình kiểm tra Tệp Hệ thống sửa chữa Tệp Hệ thống Windows. <br> 5. Khi điều này hoàn thành, <strong> khởi động lại </strong> máy tính của bạn. </p> <p> </p> <h6> Bước 5. Sửa chữa Windows 10 với nâng cấp tại chỗ. </h6> <p> Phương pháp cuối cùng để giải quyết sự cố cài đặt Windows 10 Update là <a href=\"https://www.repairwin.com/repair-reinstall-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> sửa chữa Windows 10 với Nâng cấp Tại chỗ. </a></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}