{"title":"Khắc phục: Máy chủ không truy cập được. Bạn có thể không được phép sử dụng tài nguyên mạng này. Tay cầm không hợp lệ. (Đã giải quyết)","content":"<p> Hướng dẫn này bao gồm các hướng dẫn để khắc phục lỗi sau khi cố gắng truy cập vào thư mục chia sẻ trên mạng: &quot;Máy chủ không thể truy cập được. Bạn có thể không có quyền sử dụng tài nguyên mạng này. Hãy liên hệ với quản trị viên của máy chủ này để tìm hiểu xem bạn có quyền truy cập không quyền. Xử lý không hợp lệ. &quot; </p> <p><img src=\"images/image_thumb-5-437.png\" alt=\"You might not have permission to use this network resource\" loading=\"lazy\"></p> <p> </p> <h2> Cách khắc phục: Không thể truy cập thư mục được chia sẻ. Bạn có thể không được phép sử dụng tài nguyên mạng này. Tay cầm không hợp lệ. </h2> <p> Thông thường, sự cố kết nối chia sẻ tệp &quot;Bạn có thể không có quyền sử dụng tài nguyên mạng này&quot; xuất hiện khi người dùng cố gắng truy cập vào thư mục chia sẻ mạng mà không có quyền cần thiết. Trong trường hợp này và để giải quyết vấn đề, bạn phải đảm bảo rằng người dùng có quyền truy cập thích hợp vào thư mục được chia sẻ. </p> <p> Tuy nhiên, nếu bạn biết rằng quyền của người dùng trên thư mục chia sẻ là chính xác và sự cố kết nối &quot;Bạn có thể không có quyền sử dụng tài nguyên mạng này&quot; xuất hiện đột ngột và không có lý do rõ ràng, thì sự cố có thể là do cài đặt Windows. Cập nhật. Tại trường hợp này, hãy tiếp tục đọc bên dưới để khắc phục sự cố. </p> <p> * Lưu ý: Nếu bạn gặp phải lỗi chia sẻ vào giữa tháng 1 năm 2019, thì thủ phạm là Bản cập nhật bảo mật Windows sau: <a href=\"https://support.microsoft.com/el-gr/help/4480970/windows-7-update-kb4480970\" target=\"_blank\" rel=\"nofollow noopener\"> Ngày 8 tháng 1 năm 2019 — KB4480970 (Bản tổng hợp Hàng tháng) </a> . </p> <h6> Phương pháp 1. Gỡ cài đặt Windows Update mới nhất. </h6> <p> Trên máy có thư mục chia sẻ: </p> <p> 1. Nhấp chuột phải vào biểu tượng &#39;Máy tính của tôi&#39; và chọn <strong> Tính chất </strong> . <br> 2. Nhấp vào <strong> cập nhật hệ điều hành Window </strong> . </p> <p><img src=\"images/image_thumb-6-686.png\" alt=\"fix Network Shared Folder is Not Accessible\" loading=\"lazy\"></p> <p> </p> <p> 3. Nhấp vào <strong> Bản cập nhật đã cài đặt </strong> . </p> <p><img src=\"images/image_thumb-7-999.png\" alt=\"fix cannot access shared folder\" loading=\"lazy\"></p> <p> </p> <p> 4. Sắp xếp các bản cập nhật theo ngày đã cài đặt, bằng cách nhấp vào <strong> Được cài đặt trên. </strong></p> <p><img src=\"images/image_thumb-8-158.png\" alt=\"uninstall windows update\" loading=\"lazy\"></p> <p> </p> <p> 5. Đánh dấu bản cập nhật đã cài đặt mới nhất cho Windows và nhấp vào <strong> Gỡ cài đặt. </strong> * </p> <p> * ví dụ. Nếu bạn gặp phải lỗi chia sẻ vào giữa tháng 1 năm 2019, hãy tiếp tục và gỡ cài đặt &quot;Bản cập nhật bảo mật cho Microsoft Windows KB4480970&quot;. </p> <p><img src=\"images/image_thumb-9-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Khi quá trình cài đặt hoàn tất, <strong> khởi động lại </strong> máy tính. <br> 7. Sau khi khởi động lại, hãy thử lại để truy cập vào thư mục chia sẻ từ máy khách. Sau đó, áp dụng các hành động được đề xuất tùy theo trường hợp của bạn: </p> <ul> <li><strong> Trường hợp A: </strong> Nếu sự cố vẫn tiếp diễn, hãy tiếp tục gỡ cài đặt tất cả các bản cập nhật đã cài đặt mới nhất hoặc tiếp tục <a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> phương pháp 2 </a> phía dưới. </li> <li><strong> Trường hợp B: </strong> Nếu sự cố được giải quyết, hãy ngăn cài đặt bản cập nhật đã xóa trong tương lai. Để làm việc đó: </li> </ul> <blockquote><p> 1. Điều hướng đến Windows Update và <strong> Kiểm tra cập nhật </strong> . <br> 2. Nhấp vào <strong> Cập nhật quan trọng </strong> . </p></blockquote> <p><img src=\"images/image_thumb-22-393.png\" alt=\"view important updates\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 3. Nhấp chuột phải vào bản cập nhật có vấn đề và nhấp vào <strong> Ẩn cập nhật </strong> . <br> 4. Cuối cùng bấm <strong> đồng ý </strong> và sau đó đóng Windows Update. </p></blockquote> <p><img src=\"images/image_thumb-23-795.png\" alt=\"hide update windows 7\" loading=\"lazy\"></p> <h6> Phương pháp 2. Khôi phục PC của bạn về Trạng thái làm việc trước đó. </h6> <p> Trên máy có thư mục chia sẻ: </p> <p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb-632.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại <strong> rstrui </strong> &amp; nhấp chuột <strong> đồng ý </strong> để khởi chạy Khôi phục Hệ thống. </p> <p><img src=\"images/rstui-1-300x148-611.png\" alt=\"rstui\" loading=\"lazy\"></p> <p> </p> <p> 3. Nhấp vào <strong> Kế tiếp </strong> ở màn hình đầu tiên. <br> 4. Chọn trạng thái làm việc sớm hơn (Ngày / Giờ) và nhấp vào <strong> Kế tiếp </strong> để bắt đầu quá trình khôi phục. </p> <p><img src=\"images/image_thumb-50-355.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Sau khi khôi phục hệ thống, hãy thử lại để truy cập vào thư mục được chia sẻ từ máy khách. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trong các mạng xã hội để giúp lan truyền về vấn đề này. </p>"}