{"title":"Khắc phục: Không có phiên bản trước nào có sẵn trong Windows 10 (Đã giải quyết)","content":"<p> Trên máy tính chạy Windows 10 với <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Bảo vệ hệ thống </a> được bật, sự cố sau xuất hiện khi cố gắng khôi phục tệp / thư mục bằng tính năng &#39;Khôi phục phiên bản trước&#39;: &quot;Không có phiên bản trước nào khả dụng&quot;. </p> <p> <img src=\"images/image_thumb-39-628.png\" alt=\"There No Previous Versions Available in Windows 10 \" loading=\"lazy\"></p> <p> </p> <p> Lỗi &quot;Không có phiên bản trước nào khả dụng&quot; xảy ra vì trong Windows 10, tính năng &quot;Khôi phục phiên bản trước&quot; chỉ hoạt động nếu bạn đã định cấu hình &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Lịch sử tệp </a> &#39;để sao lưu các tệp của bạn. Điều này có nghĩa là tính năng &#39;Khôi phục các phiên bản trước&#39; trong Windows 10, sẽ xem xét vị trí sao lưu của &quot;công cụ Sao lưu lịch sử tệp&quot; để tìm phiên bản trước của tệp / thư mục, chứ không phải tại Điểm khôi phục hệ thống, như xảy ra trong Windows 7. Để bật Lịch sử tệp trong Windows 10, hãy làm theo hướng dẫn trong các bài viết sau: </p> <ul> <li><strong> Những bài viết liên quan: </strong></li> <li> <ul> <li><a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách sao lưu tệp cá nhân với Lịch sử tệp trong Windows 10. </a></li> <li><a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách tạo bản sao bóng của tệp của bạn bằng Trình lập lịch tác vụ trong Windows 10 </a></li> </ul> </li> </ul> <h4> Cách khắc phục: Không có phiên bản tệp nào trước đây trong Windows 10. </h4> <p> Nếu &#39; <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Lịch sử tệp </a> &#39;đã được bật * trên PC chạy Windows 10 của bạn, nhưng bạn nhận được thông báo &quot;Không có phiên bản trước nào khả dụng&quot;, khi bạn cố gắng khôi phục phiên bản trước của tệp hoặc thư mục, hãy làm theo hướng dẫn bên dưới: </p> <p> * Lưu ý: Hướng dẫn bên dưới <strong> không hoạt động nếu <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Lịch sử tệp không được bật ALREADY </a></strong> trên PC chạy Windows 10 của bạn. </p> <p> 1. Tải xuống và cài đặt <a href=\"http://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowExplorer </a> tiện ích trên PC của bạn. <br> 2. Mở &#39;ShadowExplorer&#39; và chọn ngày bạn muốn khôi phục tệp. * </p> <p> * Lưu ý: Nếu bạn không thấy ngày trước đó, điều đó có nghĩa là Lịch sử Tệp đã bị vô hiệu hóa. Hãy nhớ rằng ngay cả khi bạn bật Lịch sử tệp ngay bây giờ, kết quả sẽ giống nhau, vì Lịch sử tệp tạo ảnh chụp nhanh các tệp của bạn từ thời điểm nó được kích hoạt và sau đó. </p> <p><img src=\"images/image_thumb-40-348.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Điều hướng đến vị trí lưu trữ của tệp / thư mục mà bạn muốn khôi phục về phiên bản trước của nó. <br> 4. Khi bạn định vị tệp mà bạn muốn khôi phục, hãy nhấp chuột phải vào tệp đó và chọn <strong> Xuất khẩu </strong> . </p> <p><img src=\"images/image_thumb-41-653.png\" alt=\"restore previous versions shadow explorer\" loading=\"lazy\"></p> <p> </p> <p> 5. Chọn một đĩa (vị trí) khác để lưu tệp đã khôi phục và nhấp vào <strong> đồng ý </strong> . * </p> <p><strong> Quan trọng: </strong> Lưu (các) tệp đã khôi phục vào một đĩa khác (ví dụ: ổ đĩa flash) và chỉ sau khi đảm bảo rằng bạn có đúng tệp, hãy sao chép chúng vào vị trí ban đầu để tránh ghi đè lên các tệp gốc. </p> <p><img src=\"images/image_thumb-38-815.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trong các mạng xã hội để giúp lan truyền về vấn đề này. </p>"}