{"title":"Khắc phục: Lỗi 0x800707e7, 0x000007E7 trong Bản cập nhật Windows 10.","content":"<p> Mã lỗi Cập nhật Windows 10 &quot;0x800707E7 - 0x3000D: Cài đặt không thành công trong giai đoạn FIRST_BOOT với lỗi trong hoạt động MIGRATE_DATA&quot;, thường xảy ra khi Windows không thể di chuyển hồ sơ người dùng. </p> <p> Lỗi 0x800707E7 trong Bản cập nhật Windows 10, thường gặp trên máy tính có cạc đồ họa NVIDIA đang sử dụng Dịch vụ cập nhật NVIDIA để cập nhật trình điều khiển hoặc phần mềm NVIDIA khác. Cụ thể hơn, trên các hệ thống card NVIDIA, khi bạn cài đặt phần mềm NVIDIA, một người dùng mới sẽ tự động được tạo trong Windows, có tên là &quot;UpdatusUser&quot; được sử dụng bởi dịch vụ NVIDIA Update. </p> <p> Trong hướng dẫn này, bạn sẽ tìm thấy hướng dẫn từng bước để giải quyết các lỗi sau trong Windows 10 Update: </p> <ul> <li> <ul> <li> 0x800707E7 - 0x3000D: Cài đặt không thành công trong giai đoạn FIRST_BOOT với lỗi trong quá trình hoạt động MIGRATE_DATA </li> <li> 0x000007E7: ERROR_PROFILE_DOES_NOT_MATCH_DEVICE, Cấu hình được chỉ định dành cho thiết bị thuộc loại khác với thiết bị được chỉ định. </li> </ul> </li> </ul> <h2> Cách giải quyết lỗi cập nhật Windows 10 0x800707e7, 0x000007E7. </h2> <h3> Bước 1. Gỡ cài đặt Phần mềm NVIDIA khỏi Máy của bạn. </h3> <p> Nếu bạn sở hữu một card đồ họa NVIDIA, hãy điều hướng đến <strong> Bảng điều khiển </strong> -&gt; <strong> Chương trình và các tính năng </strong> và <strong> Gỡ cài đặt </strong> tất cả <strong> Phần mềm NVIDIA </strong> . * </p> <p> * Lưu ý: Bước này, chỉ áp dụng cho các hệ thống có Thẻ NVIDIA. Nếu bạn không sở hữu card đồ họa NVIDIA, hãy chuyển sang bước 2. </p> <p><strong> Để Gỡ cài đặt Phần mềm của NVIDIA. </strong></p> <p> 1. Điều hướng trong <strong> Chương trình và các tính năng </strong> trong Bảng điều khiển. Để làm việc đó: </p> <blockquote><p> 1. Nhấn đồng thời Windows <img src=\"images/image_thumb36-131.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại: <strong> appwiz.cpl </strong> và bấm vào <strong> đồng ý </strong> . </p></blockquote> <p><img src=\"images/image_thumb-24-479.png\" alt=\"programs and features\" loading=\"lazy\"></p> <p> </p> <p> 2. Chọn từng phần mềm NVIDIA và nhấp vào <strong> Gỡ cài đặt. </strong></p> <p><img src=\"images/image_thumb-67-843.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Làm theo hướng dẫn trên màn hình để xóa phần mềm NVIDIA khỏi máy tính của bạn. <br> 4. Khi quá trình gỡ cài đặt hoàn tất <strong> khởi động lại </strong> PC của bạn và tiếp tục bước tiếp theo. </p> <h3> Bước 2. Xóa &quot;UpdatusUser&quot; và bất kỳ Hồ sơ người dùng không xác định nào. </h3> <p> 1. Nhấp chuột phải vào biểu tượng máy tính của bạn (PC này) trên Explorer và chọn <strong> Tính chất </strong> . <br> 2. Nhấp vào <strong> Thiết lập hệ thống nâng cao </strong> . <br> 3. Tại <strong> Thông tin người dùng </strong> , nhấp chuột <strong> Cài đặt </strong> . </p> <p><img src=\"images/image_thumb-68-812.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Chọn và <strong> xóa bỏ </strong> các <strong> UpdatusUser </strong> hồ sơ hoặc bất kỳ hồ sơ nào khác mà bạn chưa biết ( <strong> ngoại trừ </strong> hồ sơ của bạn và <strong> Cấu hình mặc định </strong> ). </p> <p><img src=\"images/image_thumb-69-946.png\" alt=\"Delete User Profile\" loading=\"lazy\"></p> <p> 4. Khi hoàn tất, hãy nhấp vào <strong> đồng ý </strong> và tiếp tục bước tiếp theo. </p> <h3></h3> <h3> Bước 3. Xóa hồ sơ người dùng không xác định trong sổ đăng ký. </h3> <p> 1. Mở Registry Editor: để làm điều đó: </p> <blockquote><p> 1. Nhấn Windows <img src=\"images/image_thumb41-520.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại <strong> regedit </strong> và hãy nhấn <strong> Đi vào </strong> . </p></blockquote> <p><img src=\"images/image_thumb7_thumb-235.png\" alt=\"Open Registry Editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Trong Registry Editor, điều hướng đến khóa sau ở ngăn bên trái: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows NT \\ CurrentVersion \\ ProfileList </li> </ul> <p> 4a. Bây giờ mở rộng <strong> Danh sách hồ sơ </strong> và nhấp vào từng cấu hình &quot;S-1-5-21-xxxx&quot; và xem bất kỳ cấu hình nào trong số chúng có giá trị &quot; <strong> C: \\ Users \\ UpdatusUser &quot; </strong> tại <strong> ProfileImagePath. </strong></p> <p><img src=\"images/image_thumb-70-754.png\" alt=\"FIX: 0x800707e7 or 0x000007E7 errors in Windows 10 Update.\" loading=\"lazy\"></p> <p> 4b. Nếu bạn tìm thấy dấu &quot; <strong> C: \\ Users \\ UpdatusUser &quot; </strong> giá trị <strong> </strong> trên một hồ sơ, sau đó chọn hồ sơ ở ngăn bên trái và <strong> Xóa bỏ </strong> nó. </p> <p><img src=\"images/image_thumb-71-506.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Cuối cùng xem tên đầy đủ của từng khóa hồ sơ &quot;S-1-5-21-xxxx&quot; (trong &quot;khóa Danh sách hồ sơ&quot;) và <strong> xóa bỏ </strong> bất kỳ khóa hồ sơ nào có <strong> .bak </strong> phần mở rộng ở cuối tên của nó. </p> <p><img src=\"images/image_thumb-72-738.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Khi hoàn tất, đóng Registry Editor và <strong> khởi động lại </strong> PC của bạn. <br> 7. Sau khi khởi động lại: </p> <blockquote> <p> a. Hướng đến <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" target=\"_blank\" rel=\"nofollow noopener\"> Trang web tải xuống Windows 10 </a> và nhấp vào <strong> Cập nhật bây giờ </strong> cái nút. </p> <p><img src=\"images/image_thumb-65-120.png\" alt=\"Download Windows 10 21H1 \" loading=\"lazy\"></p> <p> b. Lưu tệp &quot;Windows10Upgrade9252.exe&quot; trên màn hình của bạn. <br> c. Nhấp đúp vào tệp đã tải xuống để mở <strong> Hỗ trợ nâng cấp Windows </strong> . <br> d. Nhấp chuột <strong> Cập nhật bây giờ </strong> để bắt đầu cập nhật. </p></blockquote> <p> 8. Windows Update bây giờ sẽ được hoàn tất suôn sẻ và không có lỗi 0x800707e7 (hoặc 0x000007E7). <br> 9. Cuối cùng, sau khi cập nhật Windows 10 và nếu bạn sở hữu cạc đồ họa NVIDIA, hãy tiến hành và cài đặt lại phần mềm của NVIDIA. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trong các mạng xã hội để giúp lan truyền rộng rãi về vấn đề này. </p>"}