{"title":"Khắc phục: Chúng tôi không thể cài đặt Office do Office 16 Nhấp để chạy Đăng ký cấu phần mở rộng. (Đã giải quyết)","content":"<p> Nếu bạn không thể cài đặt Office do cài đặt &quot;Office 16 Nhấp để Chạy Đăng ký Thành phần Khả năng Mở rộng&quot;, thì hãy tiếp tục đọc hướng dẫn này, trong đó có các hướng dẫn chi tiết để giải quyết các sự cố Thiết lập Office sau: </p> <p><strong> Vấn đề số 1: </strong> Khi cố gắng cài đặt phiên bản 32-bit của Microsoft Office, bạn nhận được lỗi: <br> <em> &quot;Chúng tôi không thể cài đặt phiên bản 32 bit của Office vì chúng tôi đã tìm thấy các chương trình 64 bit sau trên PC của bạn: <br> Thành phần mở rộng Office 16 Click-to-Run Đăng ký 64-bit <br> Vui lòng gỡ cài đặt tất cả các chương trình Office 64 bit, sau đó thử cài đặt lại Office 32 bit. Nếu bạn muốn cài đặt Office 64 bit thay thế, hãy chạy thiết lập 64 bit. &quot; </em></p> <p><img src=\"images/image_thumb-6-215.png\" alt=\"FIX: We can't Install Office because of Office 16 Click to Run Extensibility Component Registration\" loading=\"lazy\"></p> <p> </p> <p><strong> Vấn đề số 2 </strong> : Khi cố gắng cài đặt phiên bản 64-bit của Microsoft Office, bạn nhận được lỗi: <br> <em> &quot;Chúng tôi không thể cài đặt phiên bản 64 bit của Office vì chúng tôi đã tìm thấy các chương trình 32 bit sau trên PC của bạn: <br> <em> Thành phần mở rộng Office 16 Click-to-Run Đăng ký 32-bit <br> <em> Vui lòng gỡ cài đặt tất cả các chương trình Office 32 bit, sau đó thử cài đặt lại Office 64 bit. Nếu bạn muốn cài đặt Office 32 bit thay thế, hãy chạy thiết lập 32 bit. &quot; </em></em></em></p> <p> </p> <h2> Cách khắc phục: Chúng tôi không thể cài đặt phiên bản Office này vì chúng tôi đã tìm thấy các chương trình sau trên PC của bạn: Đăng ký thành phần hỗ trợ mở rộng Office 16 Click-to-Run 32-bit. </h2> <p> 1. Nhấn <strong> các cửa sổ </strong> <img src=\"images/image_thumb41-277.png\" alt=\"image\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại <strong> người cài đặt </strong> và hãy nhấn <strong> Đi vào </strong> để điều hướng đến thư mục &quot;C: \\ Windows \\ Installer&quot;. </p> <p><img src=\"images/image_thumb-7-594.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Từ <strong> Lượt xem </strong> menu, bấm vào <strong> Thêm cột </strong> và sau đó nhấp vào <strong> Chọn cột </strong></p> <p><img src=\"images/image_thumb-8-367.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. <strong> Kiểm tra </strong> các <strong> Môn học </strong> và bấm vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-9-532.png\" alt=\"image\" loading=\"lazy\"></p> <p><a href=\"https://www.repairwin.com/wp-content/uploads/2020/04/image-43.png\" target=\"_blank\" rel=\"nofollow noopener\"> </a></p> <p> 5. Sắp xếp kết quả theo Chủ đề và sau đó cuộn xuống cho đến khi bạn tìm thấy &quot; <em> Thành phần mở rộng Office 16 Click-to-Run &quot; </em> được đề cập trên thông báo lỗi thiết lập Office. </p> <p><img src=\"images/image_thumb-10-106.png\" alt=\"image\" loading=\"lazy\"></p> <p> 6. Khi bạn tìm thấy nó, hãy nhấp chuột phải vào nó và chọn <strong> Gỡ cài đặt </strong> . </p> <p><img src=\"images/image_thumb-11-389.png\" alt=\"Remove office Click to Run installer\" loading=\"lazy\"></p> <p> 7. Khi quá trình Gỡ cài đặt hoàn tất, sau đó tiến hành cài đặt lại Microsoft Office. * </p> <p> * Lưu ý: Nếu bạn vẫn gặp lỗi tương tự, thì… </p> <p> 1. Tiếp tục và gỡ cài đặt tất cả &quot;Thành phần Office 16 Click-to-Run&quot; và nếu thiết lập lại không thành công… <br> 2. Gỡ cài đặt hoàn toàn Microsoft Office khỏi PC của bạn bằng cách sử dụng các hướng dẫn trong này <a href=\"https://www.repairwin.com/fix-couldnt-uninstall-office-365-2016-2013-2010-or-2007/\" target=\"_blank\" rel=\"nofollow noopener\"> hướng dẫn </a> và sau đó tiến hành cài đặt lại Office. </p> <ul> <li> <p> Bài viết liên quan:: <a href=\"https://www.repairwin.com/fix-couldnt-uninstall-office-365-2016-2013-2010-or-2007/\" target=\"_blank\" rel=\"noopener noreferrer\"> Khắc phục: Không thể Gỡ cài đặt Office 365, 2016, 2013, 2010 hoặc 2007. </a></p> </li> </ul> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về điều này. </p>"}