{"title":"Khắc phục: Không thể chấm dứt quá trình. Không thể hoàn thành thao tác, Quyền truy cập bị từ chối.","content":"<p> Nếu bạn không thể chấm dứt một quy trình hoặc dịch vụ trong Windows do bạn đang gặp lỗi &quot;Không thể chấm dứt quy trình. Không thể hoàn thành thao tác, Quyền truy cập bị từ chối&quot;, thì hãy tiếp tục đọc phần bên dưới để tìm hiểu cách khắc phục sự cố. </p> <p><img src=\"images/image_thumb-10-874.png\" alt=\"Unable to terminate process. Access is denied\" loading=\"lazy\"></p> <p> Cách thông thường để dừng quá trình đang chạy trong Windows là mở Trình quản lý tác vụ, nhấp chuột phải vào tên quá trình và chọn &#39;Kết thúc tác vụ&#39;. Tuy nhiên, như bạn có thể biết, đôi khi không thể dừng quá trình vì bạn nhận được thông báo &quot;Không thể chấm dứt quá trình. Quyền truy cập bị từ chối&quot;. </p> <p> Tương tự, bạn có thể gặp sự cố tương tự nếu bạn muốn dừng một dịch vụ nhưng không thể, vì tùy chọn &quot;Dừng&quot; chuyển sang màu xám hoặc do bạn nhận được lỗi &quot;Không thể dừng dịch vụ. Quyền truy cập bị từ chối&quot; khi cố gắng dừng dịch vụ. </p> <p><img src=\"images/image_thumb-11-145.png\" alt=\"Unable to Terminate Service\" loading=\"lazy\"></p> <p> Trong hướng dẫn này, bạn sẽ học cách chấm dứt bất kỳ dịch vụ hoặc quy trình nào mà bạn không thể chấm dứt bằng cách sử dụng các cách thông thường. </p> <h4> Cách Buộc Dừng Bất kỳ Dịch vụ hoặc Chương trình nào từ PowerShell trong Hệ điều hành Windows 10/8/7. </h4> <ul> <li><a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> Cách buộc đóng bất kỳ ứng dụng nào từ PowerShell. </a></li> <li><a href=\"#part-2\" target=\"_blank\" rel=\"nofollow noopener\"> Cách buộc đóng bất kỳ dịch vụ nào từ PowerShell. </a></li> </ul> <h6></h6> <h6> Phần 1. Cách Chấm dứt Ứng dụng khỏi PowerShell. </h6> <p> 1. Mở PowerShell với tư cách Quản trị viên. </p> <p> 2. Trong PowerShell, gõ lệnh sau để lấy ID quy trình (PID). </p> <ul> <li><strong> danh sach cong viec </strong></li> </ul> <p><img src=\"images/image_thumb-12-275.png\" alt=\"Terminate process from powershell\" loading=\"lazy\"></p> <p> </p> <p> 3. Ghi lại tên của ứng dụng mà bạn muốn xóa rồi nhập lệnh sau để đóng tất cả các phiên bản của ứng dụng. * </p> <ul> <li> Stop-Process -Tên &quot;Application_Name&quot; </li> </ul> <p> * Lưu ý: Tại Application_Name, gõ tên ứng dụng không có đuôi .exe. Ví dụ: nếu bạn muốn buộc đóng ứng dụng &quot;chrome.exe&quot;, hãy nhập: </p> <ul> <li><em> Stop-Process -Tên &quot;chrome&quot; </em></li> </ul> <p><img src=\"images/image_thumb-16-974.png\" alt=\"Stop Program PowerShell\" loading=\"lazy\"></p> <p> </p> <p><strong> TIỀN BOA: </strong> Nếu bạn muốn kết thúc một phiên bản chương trình, hãy nhập lệnh sau: </p> <ul> <li> Dừng-Xử lý -ID PID </li> </ul> <p> * Lưu ý: Tại PID, nhập số duy nhất của phiên bản chương trình. </p> <p> </p> <h6> Phần 2. Cách Chấm dứt Dịch vụ từ PowerShell. </h6> <p> 1. Mở trình quản lý tác vụ và từ <strong> Dịch vụ </strong> tab, chú ý <strong> PID </strong> của dịch vụ mà bạn muốn dừng. </p> <p><em> ví dụ. Trong ví dụ này, chúng tôi sẽ buộc dừng dịch vụ &quot;AdobeARMservice&quot; với PID <strong> 1640 </strong> . </em></p> <p><img src=\"images/image_thumb-14-150.png\" alt=\"Force Stop Service PowerShell\" loading=\"lazy\"></p> <p> </p> <p> 2. Sau đó, chạy <strong> PowerShell với tư cách quản trị viên </strong> và gõ lệnh này: </p> <ul> <li> kill -id PID </li> </ul> <p> * Lưu ý: Khi PID nhập PID bạn nhận thấy trong Trình quản lý tác vụ. Trong ví dụ này, lệnh sẽ là: </p> <ul> <li><em> kill -id 1640 </em></li> </ul> <p><img src=\"images/image_thumb-15-147.png\" alt=\"Kill Running Service from PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}