{"title":"Khắc phục: Thư mục Outlook DRAFTS bị thiếu từ Ngăn dẫn hướng trong Outlook 2013, 2010 hoặc 2007. (Đã giải quyết)","content":"<p> Sự cố sau đã xảy ra ở một trong những khách hàng của tôi: Đột nhiên và không có lý do rõ ràng là thư mục Thư nháp bị thiếu trong ngăn dẫn hướng trong Outlook 2013. Hành động đầu tiên để khôi phục thư mục Thư nháp bị thiếu, là tìm kiếm trong tất cả các thư mục Outlook khác để thực hiện đảm bảo rằng thư mục không bị di chuyển hoặc bị xóa do nhầm lẫn. Nếu bạn vẫn không thể tìm thấy thư mục bị thiếu, hãy tiếp tục bên dưới để khắc phục sự cố. </p> <p><img src=\"images/image_thumb-37-460.png\" alt=\"Drafts folder Missing Outlook\" loading=\"lazy\"></p> <p> </p> <p> Hướng dẫn này chứa các hướng dẫn về cách khôi phục thư mục bị thiếu trong Outlook 2007, 2010, 2013, 2016 hoặc 365. </p> <h4> Cách khôi phục thư mục bị thiếu từ ngăn điều hướng Outlook. </h4> <h6> Phương pháp 1. Quét hệ thống của bạn để tìm Virus và Phần mềm độc hại. </h6> <p> Bước đầu tiên để giải quyết vấn đề &quot;thiếu thư mục&quot; trong Outlook là đảm bảo rằng hệ thống của bạn không có vi-rút / phần mềm độc hại. Đối với nhiệm vụ đó, hãy làm theo hướng dẫn trong hướng dẫn này: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách quét vi rút và các chương trình độc hại khác trên máy tính của bạn. </a></p> <p> </p> <h6> Phương pháp 2. ĐẶT LẠI Thư mục Outlook. </h6> <p> Sau khi quét vi-rút, hãy tiếp tục và đặt lại các thư mục Outlook về mặc định bằng cách sử dụng quy trình bên dưới: </p> <p> 1. Đóng ứng dụng Outlook. <br> 2. Nhấn nút <strong> các cửa sổ </strong> <img src=\"images/image_thumb8_thumb_thumb-622.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 3. Trong hộp Tìm kiếm, nhập: <strong> outlook / resetfolders </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-36-732.png\" alt=\"outlook reset folders\" loading=\"lazy\"></p> <p> </p> <p> 4. Outlook sẽ mở và tất cả các thư mục bị thiếu sẽ được khôi phục lại. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? </p> <p> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về điều này. </p>"}