{"title":"Khắc phục: Tập lệnh đang chạy bị tắt trên Hệ thống này trong Windows 10 (Đã giải quyết)","content":"<p> Nếu bạn đang cố gắng chạy tập lệnh trong Windows 10 PowerShell và bạn nhận được thông báo lỗi &quot;Không thể tải vì tập lệnh đang chạy bị tắt trên hệ thống này&quot;, hãy tiếp tục đọc phần bên dưới để khắc phục sự cố. </p> <p><img src=\"images/image_thumb-8-134.png\" alt=\"FIX: script cannot be loaded because is disabled on Windows 10\" loading=\"lazy\"></p> <p> </p> <h2> Cách khắc phục: Không thể chạy Tập lệnh PowerShell vì Chính sách bảo mật ngăn tập lệnh chạy trong Windows 10. </h2> <p> Lỗi PowerShell &quot;% ScriptName% .ps1 không thể tải vì bị tắt trên hệ thống này&quot;, xuất hiện do chính sách bảo mật ngăn các tập lệnh đang chạy. Để loại bỏ hạn chế và kích hoạt các tập lệnh đang chạy trong Windows 10, hãy tiến hành như sau: </p> <p> 1. Mở <strong> PowerShell với tư cách là Quản trị viên </strong> . Để làm việc đó: </p> <blockquote><p> 1. Nhấn nút <strong> các cửa sổ <img src=\"images/image_thumb-97-958.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> phím để mở hộp lệnh &#39;Run&#39; <strong><br> </strong> 2. Loại <strong> quyền hạn </strong> và sau đó nhấn <strong> CTRL </strong> + <strong> SHIFT </strong> + <strong> ĐI VÀO. </strong></p></blockquote> <p><img src=\"images/image_thumb-41-395.png\" alt=\"image\" loading=\"lazy\"></p> <p> 2. Tại PowerShell, hãy sao chép / dán lệnh bên dưới và nhấn <strong> Đi vào </strong> : </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Không hạn chế </li> </ul> <p> 3. Nhấn <strong> Y </strong> va đanh <strong> Đi vào </strong> tại thông báo cảnh báo chính sách thực thi để chấp nhận thay đổi .. </p> <p><img src=\"images/image_thumb-9-581.png\" alt=\"Enable Running Scripts on Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Sau khi thay đổi chính sách hoàn tất, <strong> đóng </strong> cửa sổ PowerShell. </p> <p> 5. Bây giờ, hãy chạy tập lệnh đã cho bạn lỗi &quot;Tập lệnh bị vô hiệu hóa&quot; với <strong> quản trị viên </strong> các đặc quyền. Lỗi sẽ biến mất ngay bây giờ. * </p> <blockquote><p> * Lưu ý: Nếu bạn vẫn nhận được lỗi &quot;Tập lệnh bị tắt trên hệ thống này&quot;, hãy đưa ra một trong các lệnh sau và thử lại để chạy tập lệnh của bạn: </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy RemoteSigned </li> <li> thiết lập-thực thi chính sách được thiết kế từ xa </li> </ul> </blockquote> <p> 6. Cuối cùng, hoàn nguyên về cài đặt chính sách thực thi PowerShell trước đó (hạn chế), bằng cách chạy lệnh này trong PowerShell (Quản trị): * </p> <ul> <li> Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy bị hạn chế </li> </ul> <p> * Lưu ý: Sau khi chạy lệnh trên, bạn sẽ nhận được thông báo cảnh báo giải thích các rủi ro bảo mật khi thay đổi chính sách thực thi. nhấn <strong> Y </strong> , và sau đó nhấn <strong> Đi vào </strong> để chấp nhận thay đổi và hoàn nguyên về cài đặt chính sách trước đó của bạn. </p> <p><img src=\"images/image_thumb-10-246.png\" alt=\"Disable running scripts windows 10\" loading=\"lazy\"></p> <p> 7. Đóng cửa sổ PowerShell và bạn đã hoàn tất! </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}