{"title":"KHẮC PHỤC: Mối quan hệ tin cậy giữa máy trạm này và miền chính không thành công (đã giải quyết)","content":"<p> Nếu bạn nhận được lỗi &quot;Mối quan hệ tin cậy giữa máy trạm này và miền chính không thành công&quot; khi bạn cố gắng đăng nhập trong miền của mình hoặc khi bạn cố gắng truy cập vào một thư mục được chia sẻ trên một máy khác trên miền, hãy tiếp tục đọc bên dưới để giải quyết sự cố. </p> <p> Lỗi &quot;Mối quan hệ tin cậy giữa máy trạm và miền chính không thành công&quot;, có thể xuất hiện vì những lý do sau: </p> <ul> <li> Máy tính trùng tên với một máy tính khác trong Miền. </li> <li> Thông tin đăng nhập tên miền (Tên người dùng hoặc Mật khẩu) không hợp lệ. </li> <li> Tài khoản của máy tính đã hết hạn. * </li> </ul> <p> * Lưu ý: Một số tổ chức tạo sẵn máy tính (hoặc máy tính nhái) để sử dụng sau này. Nếu tài khoản của máy tính đã hết hạn, nó sẽ không thể xác thực với miền được nữa. Trong những trường hợp như vậy, các máy tính không thể xác thực với miền phải được xóa khỏi miền và liên kết lại với miền đó. (bước 4) </p> <p><img src=\"images/image_thumb-32-740.png\" alt=\"FIX: Trust Relationship Between this Workstation and the Primary Domain Failed \" loading=\"lazy\"></p> <h4> Cách khắc phục: Mối quan hệ tin cậy giữa máy trạm và miền không thành công. </h4> <h6> Phương pháp 1. Xác minh rằng thông tin đăng nhập tên miền là chính xác. </h6> <p> Trước hết hãy đảm bảo rằng các thông tin đăng nhập là chính xác và đặc biệt là mật khẩu. nếu bạn đã nhân bản máy từ một hình ảnh máy tính được chụp trong quá khứ và kể từ đó mã đã thay đổi. </p> <h6> Phương pháp 2. Kiểm tra tên máy tính trùng lặp. </h6> <p> Đảm bảo rằng tên máy tính là duy nhất và không có máy tính nào khác trên mạng có cùng tên. </p> <h6> Phương pháp 3. Kiểm tra địa chỉ IP trùng lặp. </h6> <p> Đảm bảo rằng Địa chỉ IP của Máy tính là duy nhất và không xung đột với Địa chỉ IP khác trên Mạng. </p> <h6> Phương pháp 4. Xóa và tham gia lại máy tính trong miền. </h6> <p> Phương pháp thông thường để sửa mối quan hệ tin cậy giữa máy tính và miền là xóa và thêm lại máy tính bị ảnh hưởng vào miền. </p> <h5> Bước 1. Xóa tài khoản máy tính khỏi miền. </h5> <p> 1. Đăng nhập vào Máy chủ Thư mục Hoạt động. <br> 2. Mở <strong> Kích hoạt các người dùng và máy tính. <br> </strong> 3. Mở rộng <strong> Máy vi tính </strong> thùng đựng hàng. <br> 4. Nhấp chuột phải vào máy tính bị ảnh hưởng và chọn <strong> Xóa bỏ. </strong></p> <p><img src=\"images/image_thumb-39-366.png\" alt=\"Delete Computer Account from Domain\" loading=\"lazy\"></p> <h5> Bước 1. Xóa và tham gia lại Máy tính trong Miền. </h5> <p> 1. Đăng nhập vào máy tính bị ảnh hưởng bằng tài khoản Quản trị viên ĐỊA PHƯƠNG (Tên máy tính \\ Quản trị viên). </p> <p> 2. Nhấn Windows <img src=\"images/image_thumb8_thumb-480.png\" alt=\"image_thumb8\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. </p> <p> 2a. Kiểu <strong> sysdm.cpl </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb7_thumb-169.png\" alt=\"system properties\" loading=\"lazy\"></p> <p> 3. Tại tab &#39;Tên máy tính&#39;, nhấp vào <strong> Thay đổi </strong> . </p> <p><img src=\"images/image_thumb-37-924.png\" alt=\"Remove Computer from Domain\" loading=\"lazy\"></p> <p> 4. Tại Thành viên của, chọn <strong> Nhóm làm việc </strong> , nhập tên nhóm làm việc (ví dụ: &quot;WORKGROUP&quot;) và nhấp vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-34-169.png\" alt=\"Change Computer Name - Membership\" loading=\"lazy\"></p> <p> 5. Nhập thông tin đăng nhập của Quản trị viên và nhấp vào <strong> đồng ý </strong> . <br> 6. <strong> Khởi động lại </strong> máy tính. </p> <p> 7. Thực hiện lại các bước 1-4 nhưng lần này, ở bước 4, chọn <strong> Miền, </strong> gõ Tên miền và nhấp vào <strong> ĐỒNG Ý. </strong></p> <p><img src=\"images/image_thumb-38-928.png\" alt=\"Add computer to domain\" loading=\"lazy\"></p> <p> 8. Nhập thông tin đăng nhập Quản trị viên miền và nhấp vào <strong> đồng ý </strong> . <br> 9. <strong> Khởi động lại </strong> PC của bạn và đăng nhập vào miền bằng tài khoản người dùng miền. </p> <h6> Phương pháp 5. Đặt lại tài khoản máy tính trong miền. </h6> <p> 1. Đăng nhập vào Máy chủ Thư mục Hoạt động. <br> 2. Mở <strong> Kích hoạt các người dùng và máy tính. <br> </strong> 3. Mở rộng <strong> Máy vi tính </strong> thùng đựng hàng. <br> 4. Nhấp chuột phải vào máy tính bị ảnh hưởng và chọn <strong> Cài đặt lại tài khoản. </strong></p> <p><img src=\"images/image_thumb-36-935.png\" alt=\"Reset Computer Account in Domain\" loading=\"lazy\"></p> <p> 5. Cuối cùng, <strong> khởi động lại </strong> các <strong> máy bị ảnh hưởng </strong> và đăng nhập trong Miền. </p> <p> Đó là tất cả mọi người! Phương pháp nào hiệu quả với bạn? Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}