{"title":"KHẮC PHỤC: LỖI BỘ NHỚ ĐƯỢC PHÁT HIỆN ĐẶC BIỆT do ntoskrnl.exe BSOD 0x000000c1 (Đã giải quyết)","content":"<p> Trên máy tính chạy Windows 10, lỗi BSOD sau xuất hiện: &quot;ĐẶC BIỆT_POOL_DETECTED_MEMORY_CORRUPTION, gây ra bởi tệp ntoskrnl.exe với mã lỗi 0x000000c1. Lỗi kiểm tra lỗi&quot; 0x000000c1 - LỖI BỘ NHỚ ĐÃ PHÁT HIỆN ĐẶC BIỆT &quot;thường do một phần mềm đã cài đặt hoặc một thiết bị gây ra trình điều khiển và không phải do sự cố phần cứng. </p> <p><strong> POOL ĐẶC BIỆT PHÁT HIỆN LỖI BỘ NHỚ, Mã kiểm tra lỗi 0x000000c1 Lỗi BSOD trong Chi tiết: </strong><br> &quot; <em> Sự cố đã được phát hiện và Windows đã được tắt để tránh thiệt hại <br> đến máy tính của bạn. <br> </em><em> Sự cố dường như do tệp sau: ntoskrnl.exe gây ra <br> ĐẶC BIỆT_POOL_DETECTED_MEMORY_CORRUPTION <br> … .. <br> *** DỪNG: 0x000000c1 (0xfffff30dd554cfc0, 0xfffff30dd554c22c, 0x0000000000034038, <br> 0x0000000000000032) </em></p> <p><em> *** ntoskrnl.exe - Địa chỉ 0xfffff803c544aca0 cơ sở tại 0xfffff803c52a2000 DateStamp <br> 0x5b63c7b5 &quot; </em></p> <p><img src=\"images/image_thumb-1-562.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Hướng dẫn này chứa các hướng dẫn chi tiết để giải quyết lỗi màn hình xanh 0x000000c1 - LỖI BỘ NHỚ ĐƯỢC PHÁT HIỆN ĐẶC BIỆT do tệp &quot;ntoskrnl.exe&quot; gây ra. </p> <p> </p> <h2> CÁCH SỬA CHỮA DỪNG 0x000000C1: LỖI BỘ NHỚ PHÁT HIỆN POOL ĐẶC BIỆT DO NTOSKENL.EXE gây ra. </h2> <p> Sự cố màn hình xanh &quot;Dừng 0x000000C1: LỖI BỘ NHỚ ĐÃ PHÁT HIỆN HỒ BƠI ĐẶC BIỆT&quot; có thể do một số lý do, ví dụ: trình điều khiển thiết bị bị lỗi, tệp hệ thống bị hỏng, vi rút tấn công hoặc từ một chương trình chạy nền. Để khắc phục sự cố, hãy làm theo các phương pháp bên dưới: </p> <h6> Phương pháp 1. Quét hệ thống của bạn để tìm Virus và Phần mềm độc hại. </h6> <p> Bước đầu tiên để giải quyết sự cố màn hình xanh &quot;LỖI BỘ NHỚ ĐƯỢC PHÁT HIỆN ĐẶC BIỆT&quot; là đảm bảo rằng hệ thống của bạn không có vi-rút / phần mềm độc hại. Đối với nhiệm vụ đó, hãy làm theo hướng dẫn trong hướng dẫn này: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách quét vi rút và các chương trình độc hại khác trên máy tính của bạn. </a></p> <p> </p> <h6> Phương pháp 2. Gỡ cài đặt Phần mềm Bảo mật / Chống vi-rút của bạn. </h6> <p> &quot;Sự cố màn hình xanh&quot; ĐẶC BIỆT ĐƯỢC PHÁT HIỆN BỘ NHỚ &quot;, có thể gây ra sau khi cập nhật tự động chương trình Chống vi-rút / Bảo mật của bạn (đặc biệt nếu bạn đang sử dụng AVAST hoặc AVG). Vì vậy, hãy tiếp tục và gỡ cài đặt hoàn toàn chương trình chống vi-rút khỏi hệ thống của bạn và khởi động lại máy tính của bạn. <br> - Nếu sự cố BSOD không xảy ra sau khi diệt vi-rút, hãy tiến hành tải xuống và cài đặt lại phiên bản mới nhất của phần mềm bảo mật trên hệ thống của bạn. </p> <p> </p> <h6> Phương pháp 3. Khởi động Windows ở trạng thái khởi động sạch. </h6> <p> Phương pháp tiếp theo, để giải quyết sự cố BSOD &quot;ĐẶC BIỆT ĐƯỢC PHÁT HIỆN BỘ NHỚ&quot;, là khởi động Windows trong <a href=\"https://www.repairwin.com/how-to-start-windows-in-clean-boot-state/\" target=\"_blank\" rel=\"nofollow noopener\"> &quot;khởi động sạch sẽ </a> &quot;để xác định chương trình nào khiến hệ thống của bạn gặp sự cố. </p> <p> Để khởi động Windows ở trạng thái Khởi động sạch: </p> <p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-465.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại <strong> msconfig </strong> và hãy nhấn <strong> Đi vào </strong> . </p> <p><img src=\"images/image_thumb-47-632.png\" alt=\"msconfig\" loading=\"lazy\"></p> <p> </p> <p> 3. Tại tab Dịch vụ, <strong> Ẩn tất cả các Dịch vụ của Microsoft </strong> hộp kiểm và sau đó nhấn <strong> Vô hiệu hóa tất cả </strong> , để ngăn tất cả các dịch vụ không phải của Microsoft khởi động khi khởi động Windows. </p> <p> </p> <p><img src=\"images/image_thumb5_thumb-480.png\" alt=\"clean boot state\" loading=\"lazy\"></p> <p> 4. Sau đó chọn <strong> Khởi động </strong> tab và <strong> Vô hiệu hóa </strong> tất cả các chương trình khác khởi động trong quá trình khởi động Windows và chạy trên nền. * </p> <p> * Lưu ý: Bật <strong> Windows 10 </strong> hoặc là <strong> số 8 </strong> , lựa chọn <strong> Mở trình quản lý tác vụ </strong> để tắt các chương trình khởi động. </p> <p><img src=\"images/image_thumb-29-570.png\" alt=\"Windows clean boot\" loading=\"lazy\"></p> <p> </p> <p> 5. Khi hoàn tất, hãy nhấp vào <strong> đồng ý </strong> và <strong> Khởi động lại </strong> máy tính của bạn. <br> 6. Nếu sau khi khởi động lại, máy tính của bạn hoạt động tốt và không có sự cố BSOD, hãy khởi chạy lại tiện ích Cấu hình Hệ thống và bật từng mục đã tắt và khởi động lại hệ thống của bạn, cho đến khi bạn tìm ra cái nào gây ra sự cố BSoD. * </p> <p> * Lưu ý đến <strong> lối ra </strong> từ <strong> Khởi động sạch </strong> trạng thái, khởi chạy tiện ích Cấu hình Hệ thống và tại <strong> Chung </strong> Chọn tab <strong> Khởi động bình thường. </strong></p> <p> </p> <h6> Phương pháp 4. Kiểm tra Bộ nhớ (RAM) và Đĩa cứng (HDD) xem có vấn đề gì không. </h6> <p> Sự cố màn hình xanh, có thể do mô-đun RAM bị hỏng hoặc ổ cứng bị hỏng. Để kiểm tra và chẩn đoán các thành phần RAM và HDD của bạn xem có vấn đề gì không, hãy làm theo hướng dẫn trong các hướng dẫn sau: </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-diagnose-computer-memory-problems-with-memtest86/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách chẩn đoán sự cố bộ nhớ máy tính với Memtest86 + </a></li> <li><a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> Công cụ chẩn đoán &amp; kiểm tra ổ cứng tốt nhất để kiểm tra tình trạng ổ cứng </a></li> </ul> <p> </p> <p> </p> <h6> Phương pháp 5. Cập nhật trình điều khiển thiết bị. </h6> <p> Trong một số trường hợp, sự cố BSOD &quot;ĐẶC BIỆT_POOL_DETECTED_MEMORY_CORRUPTION gây ra bởi mô-đun ntoskrnl.exe&quot;, xảy ra do trình điều khiển thiết bị không hợp lệ hoặc bị hỏng. Vì vậy, hãy tiếp tục và cập nhật trình điều khiển của các thiết bị sau trên máy tính của bạn theo thứ tự sau: </p> <p> 1. Bộ chuyển đổi Video (VGA). <br> 2. Chipset. <br> 3. Bộ điều hợp Ethernet. <br> 4. Bộ điều hợp Wi-Fi (nếu có). </p> <p> </p> <h6> Phương pháp 6. <strong> Phân tích Minidump. </strong></h6> <p> Khi Windows gặp sự cố với màn hình xanh lam, hãy lưu trữ các chi tiết của màn hình BSoD vào (các) tệp nhỏ, được gọi là &quot; <strong> MiniDump </strong> &quot;. Phân tích của <strong> Minidump </strong> (các) tệp có thể giúp bạn khắc phục sự cố và giải quyết sự cố màn hình xanh. Để hoàn thành tác vụ này, hãy làm theo hướng dẫn trong bài viết này: <a href=\"https://www.repairwin.com/how-to-analyze-minidump-files-bluescreenview/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách phân tích tệp MiniDump với BlueScreenView </a> . </p> <p> Đó là tất cả! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}