{"title":"Khắc phục: Vấn đề sử dụng đĩa cao SrTasks.exe (Đã giải quyết)","content":"<p> Sự cố sau có thể xuất hiện trên máy tính chạy Windows 10. &quot;SrTasks.exe&quot; làm cho đĩa hoạt động ở mức 100%. Quy trình &quot;SrTasks.exe&quot; (Nhiệm vụ nền bảo vệ hệ thống của Microsoft), là một quy trình hợp pháp của Windows và nó được sử dụng để khởi động Dịch vụ sao chép bóng âm lượng và dịch vụ Nhà cung cấp bản sao bóng phần mềm Microsoft. </p> <p> Quá trình &quot;SrTasks.exe&quot; khởi động các dịch vụ liên quan cần thiết để tạo các điểm khôi phục và thông thường sẽ không ảnh hưởng liên tục đến hiệu suất hệ thống, và đặc biệt là trong các hệ thống đã tắt &quot;Bảo vệ Hệ thống&quot;. </p> <p><img src=\"images/image_thumb-58-374.png\" alt=\"FIX SrTasks.exe High Disk Usage - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Hướng dẫn này bao gồm các hướng dẫn để giải quyết sự cố SrTasks.exe 100% Disk Usage trên Windows 10. </p> <h4> Cách sửa lỗi sử dụng đĩa cao SrTasks.exe trong Windows 10. </h4> <p> </p> <h6> Phương pháp 1. Quét máy tính của bạn để tìm Phần mềm độc hại và Vi rút. </h6> <p> Bước đầu tiên để khắc phục sự cố &quot;SrTasks.exe sử dụng đĩa cao&quot; là đảm bảo rằng hệ thống của bạn không có vi-rút / phần mềm độc hại. Đối với nhiệm vụ đó, hãy làm theo hướng dẫn trong hướng dẫn này: <a href=\"https://www.repairwin.com/virus-malware-removal-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách quét vi rút và các chương trình độc hại khác trên máy tính của bạn. </a></p> <p> </p> <h6> Phương pháp 2. Tắt bảo vệ hệ thống. </h6> <p> Phương pháp thứ hai để giải quyết vấn đề sử dụng đĩa cao gây ra từ quá trình &quot;SrTasks.exe&quot;, là tắt Bảo vệ Khôi phục Hệ thống trên PC của bạn. Để làm việc đó: </p> <p> 1. Mở Windows explorer, nhấp chuột phải vào &#39;This PC&#39; và chọn <strong> Tính chất </strong> . </p> <p><img src=\"images/image_thumb-70-978.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Chọn <strong> Bảo vệ hệ thống </strong> ở bên trái. </p> <p><img src=\"images/image_thumb-71-135.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Đánh dấu <strong> Đĩa cục bộ C: (Hệ thống) </strong> và bấm vào <strong> Định cấu hình. </strong></p> <p><img src=\"images/image_thumb-59-973.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Tại tùy chọn Bảo vệ Hệ thống, hãy chọn <strong> Tắt bảo vệ hệ thống </strong> và bấm vào <strong> ĐỒNG Ý. * </strong></p> <p> </p> <p> * Lưu ý: Nếu &quot;Bảo vệ hệ thống&quot; đã bị vô hiệu hóa, hãy tiếp tục phương pháp tiếp theo. </p> <p><img src=\"images/image_thumb-60-732.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Khởi động lại </strong> PC của bạn và sau đó kiểm tra xem vấn đề sử dụng đĩa cao đã được giải quyết chưa. Nếu sự cố vẫn tiếp diễn, hãy bật lại bảo vệ hệ thống và tiếp tục phương pháp tiếp theo. </p> <p> </p> <h6> Phương pháp 3. Tắt dịch vụ Superfetch. </h6> <p> Trong nhiều trường hợp, sự cố sử dụng 100% đĩa được giải quyết sau khi tắt dịch vụ Superfetch. Để tắt dịch vụ &quot;Superfetch&quot;: </p> <p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-289.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Trong hộp Tìm kiếm, nhập: <strong><em> services.msc </em></strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-12-431.png\" alt=\"services.msc\" loading=\"lazy\"></p> <p> </p> <p> 3. Tại danh sách dịch vụ, nhấp đúp vào dịch vụ Superfetch để mở các thuộc tính của nó. <br> 4. Đặt &#39;Loại khởi động&#39; thành <strong> Tàn tật </strong> và sau đó <strong> ĐỒNG Ý. </strong></p> <p><img src=\"images/image_thumb-61-575.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. <strong> Khởi động lại </strong> máy tính của bạn. Nếu sau khi khởi động lại, sự cố vẫn tiếp diễn, hãy bật lại dịch vụ &quot;SuperFetch&quot; và tiếp tục phương pháp tiếp theo. </p> <p> </p> <h6> Phương pháp-4. Chạy Kiểm tra đĩa để tìm và sửa lỗi đĩa cứng. </h6> <p> 1. Mở <strong> Command Prompt với tư cách là quản trị viên </strong> . Để làm việc đó: </p> <p> </p> <p> 1. Nhấn nút <strong> các cửa sổ <img src=\"images/image_thumb-97-652.png\" alt=\"image\" loading=\"lazy\"> </strong> + <strong> R </strong> phím để mở hộp lệnh &#39;Run&#39; <strong><br> </strong> 2. Loại <strong> CMD </strong> và sau đó nhấn <strong> CTRL </strong> + <strong> SHIFT </strong> + <strong> ĐI VÀO. </strong></p> <p><img src=\"images/image_thumb-35-581.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Tại dấu nhắc lệnh, đưa ra lệnh sau để sửa chữa đĩa của bạn và nhấn <strong> Đi vào </strong> . </p> <ul> <li><strong> chkdsk C: / F / R </strong></li> </ul> <p> 3. Nhấn nút <strong> Y </strong> để lên lịch kiểm tra ở lần khởi động lại tiếp theo. <br> 4. <strong> Khởi động lại </strong> máy tính của bạn. </p> <p><img src=\"images/image_thumb-62-779.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Bây giờ hãy đợi quá trình kiểm tra đĩa kết thúc. (sẽ mất vài giờ). <br> 6. Khi quá trình kiểm tra đĩa hoàn tất, hãy kiểm tra xem &quot;SrTasks.exe High Disk Usage&quot; đã giải quyết chưa. </p> <p> </p> <p> </p> <h6> Phương pháp 5. Khắc phục sự cố Windows bằng cách Chạy Tác vụ Bảo trì. </h6> <p> 1. Điều hướng đến <strong> Bảng điều khiển </strong> và mở ra <strong> Xử lý sự cố </strong> . * </p> <p> * Lưu ý: Nếu bạn không thấy <strong> Xử lý sự cố </strong> tùy chọn, đặt &#39;Xem theo&#39; thành <strong> Các biểu tượng nhỏ. </strong></p> <p><img src=\"images/image_thumb-63-494.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Trong &#39;Hệ thống và Bảo mật&#39;, hãy chọn <strong> Chạy các nhiệm vụ bảo trì </strong> . </p> <p><img src=\"images/image_thumb-27-812.png\" alt=\"run maintenance in windows 10 & Windows 8\" loading=\"lazy\"></p> <p> </p> <p> 3. Nhấn <strong> Kế tiếp </strong> và sau đó đợi cho đến khi tiện ích Bảo trì Hệ thống phát hiện sự cố. <br> 4. Làm theo hướng dẫn trên màn hình để khắc phục các sự cố được tìm thấy. </p> <p> </p> <h6> Phương pháp 6. Sửa chữa các tập tin hệ thống Windows. </h6> <p> Một phương pháp khác để giải quyết vấn đề sử dụng đĩa cao SrTasks.exe trong Windows 10, là sửa chữa Windows bằng cách sử dụng lệnh DISM và SFC. </p> <p> 1. Mở <strong> Command Prompt với tư cách là quản trị viên </strong> . <br> 2. Trong dấu nhắc lệnh, đưa ra lệnh sau và nhấn <strong> Đi vào: </strong></p> <ul> <li><strong> DISM.exe / Trực tuyến / Cleanup-image / Restorehealth </strong></li> </ul> <p><img src=\"images/image_thumb-36-583.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Khi thao tác DISM hoàn tất, hãy nhập lệnh sau và nhấn <strong> Đi vào </strong> : </p> <ul> <li><strong> sfc / scannow </strong></li> </ul> <p><img src=\"images/image_thumb-37-428.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Bây giờ hãy đợi cho đến khi Trình kiểm tra Tệp Hệ thống sửa chữa Tệp Hệ thống Windows. <br> 5. Khi điều này hoàn thành, <strong> khởi động lại </strong> máy tính của bạn. </p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}