{"title":"Khắc phục: Hết pin trong Windows 10 (Đã giải quyết)","content":"<p> Với Windows 10, nhiều người dùng phàn nàn rằng pin máy tính xách tay của họ nhanh hết pin ngay cả khi sử dụng ít hoặc ngay cả khi tắt máy hoàn toàn. Vấn đề &quot;ngốn pin&quot; này xảy ra trong Windows 10, vì hai lý do cơ bản. Nguyên nhân đầu tiên là do Windows 10 tải quá nhiều ứng dụng nền gây tốn pin ngay cả khi chúng không được sử dụng. </p> <p> Nguyên nhân tiếp theo gây hao pin, ngay cả khi tắt máy hoàn toàn, là do tính năng &quot;Khởi động nhanh&quot;. Windows 10 (và Windows 8 / 8.1) đã bật tính năng &quot;Khởi động nhanh&quot; theo mặc định, cho phép hệ thống khởi động và khởi động nhanh hơn. Trên thực tế, khi &quot;Khởi động nhanh&quot; được bật, Windows 10 không thực hiện tắt toàn bộ hệ thống và tiếp tục từ trạng thái ngủ đông. </p> <p> Trong hướng dẫn này, bạn sẽ tìm thấy các hướng dẫn để ngăn Windows 10 tiêu hao pin. </p> <h4> Cách khắc phục sự cố hết pin trong Windows 10. </h4> <p> </p> <h6> Bước 1. Ngăn ứng dụng chạy trong nền. </h6> <p> Bước đầu tiên, để giải quyết vấn đề ngốn pin trong Windows 10, là tránh các ứng dụng chạy ẩn. Để tắt các ứng dụng nền: </p> <p> 1. Điều hướng đến <strong> Khởi đầu </strong> -&gt; <strong> Cài đặt </strong> -&gt; <strong> Riêng tư </strong> . <br> 2. Chọn <strong> Ứng dụng nền </strong> ở bên trái và sau đó ở bên phải, hãy đặt dấu &quot; <strong> Cho phép các ứng dụng chạy trong nền &quot; </strong> chuyển sang <strong> Tắt, </strong> hoặc chọn từng ứng dụng mà bạn không muốn chạy trên nền và tắt chúng đi. </p> <p><img src=\"images/image_thumb-8-676.png\" alt=\"Prevent Apps from Running in the Background - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Bước 2. Bật Trình tiết kiệm pin. </h6> <p> Bước tiếp theo, là bật trình tiết kiệm pin để kéo dài tuổi thọ pin bằng cách hạn chế hoạt động nền. </p> <p> 1. Điều hướng đến <strong> Khởi đầu </strong> -&gt; <strong> Cài đặt </strong> -&gt; <strong> Hệ thống </strong> . <br> 2. Tại <strong> Ắc quy </strong> các tùy chọn: </p> <blockquote> <p> a. Nhấp vào &quot;Xem ứng dụng nào đang ảnh hưởng đến tuổi thọ pin của bạn&quot; để tìm hiểu mức sử dụng pin từ các ứng dụng đang mở. <br> b. <strong> Kiểm tra </strong> các &quot; <strong> Tự động bật trình tiết kiệm pin nếu pin của tôi bị lỗi bên dưới &quot; </strong> và di chuyển thanh trượt đến vị trí thích hợp. <br> c. Ngoài ra, hãy chọn &quot;Giảm độ sáng màn hình khi ở trong trình tiết kiệm pin. </p> </blockquote> <p><img src=\"images/image_thumb-9-289.png\" alt=\"turn on battery saver Windows 10\" loading=\"lazy\"></p> <p> </p> <h6> Bước 3. Tắt tính năng Khởi động nhanh. </h6> <p> Bước tiếp theo là buộc Windows 10 phải tắt hoàn toàn bằng cách tắt tính năng khởi động nhanh. </p> <p> 1. Điều hướng đến <strong> Khởi đầu </strong> -&gt; <strong> Cài đặt </strong> -&gt; <strong> Hệ thống </strong> . <br> 2. Tại <strong> Quyền lực </strong> tùy chọn nhấp chuột <strong> Cài đặt nguồn bổ sung. </strong></p> <p><img src=\"images/image_thumb-10-405.png\" alt=\"FIX Battery Drain in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Chọn <strong> Chọn chức năng của các nút nguồn </strong> ở bên trái. </p> <p><img src=\"images/image_thumb-11-439.png\" alt=\"image\" loading=\"lazy\"></p> <p> 4. Sau đó nhấp vào <strong> Thay đổi cài đặt hiện không khả dụng </strong> . </p> <p><img src=\"images/image_thumb-12-235.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 6. <strong> Bỏ chọn </strong> các <strong> Bật khởi động nhanh (khuyến nghị) </strong> tùy chọn và nhấp vào <strong> Lưu thay đổi. * </strong></p> <p> * Lưu ý: Nếu tùy chọn khởi động nhanh đã được bỏ chọn, hãy chọn nó và khởi động lại máy tính của bạn. Sau khi khởi động lại, bỏ chọn nó và khởi động lại máy tính của bạn. </p> <p><img src=\"images/image_thumb-13-410.png\" alt=\"Turn Off Fast Startup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 7. <strong> Khởi động lại </strong> máy tính của bạn. </p> <h6></h6> <h6> Bước 4. Tắt chế độ Hibernate. </h6> <p> &#39;Hibernate&#39; là một tính năng nguồn, sử dụng ít năng lượng hơn chế độ ngủ và khi bạn khởi động lại PC, bạn sẽ quay lại nơi bạn đã dừng lại. Trong một số trường hợp, tính năng ngủ đông khiến PC Windows 10 của bạn không tắt hoàn toàn. Để tắt chế độ ngủ đông: </p> <p> </p> <p> 1. Tại hộp tìm kiếm, gõ: <strong> dấu nhắc lệnh </strong> hoặc là <strong> cmd <br> </strong> 2. Nhấp chuột phải vào <strong> Command Prompt và chọn Run as Administrator </strong></p> <p><img src=\"images/image_thumb-14-379.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Tại dấu nhắc lệnh, đưa ra lệnh sau và nhấn <strong> Đi vào. </strong></p> <ul> <li><strong> powercfg -h tắt </strong></li> </ul> <p><img src=\"images/image_thumb-15-234.png\" alt=\"Disable Hibernate Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. <strong> Khởi động lại </strong> máy tính của bạn. * </p> <p> * Lưu ý: Nếu bạn muốn bật lại tính năng &#39;Ngủ đông&#39;, chỉ cần nhập lệnh này vào dấu nhắc lệnh quản trị: </p> <ul> <li> <ul> <li> powercfg -h tắt </li> </ul> </li> </ul> <p> </p> <h6> Bước 5. Sửa đổi Cài đặt Nguồn trên Bộ điều hợp Mạng. </h6> <p> Phương pháp tiếp theo để khắc phục sự cố ngốn pin trong Windows 10 là sửa đổi cài đặt nguồn trên bộ điều hợp mạng. </p> <p> 1. Mở <strong> Quản lý thiết bị </strong> . <br> 2. Mở rộng <strong> Bộ điều hợp mạng </strong> . <br> 3. Nhấp chuột phải vào bộ điều hợp mạng đã cài đặt và chọn <strong> Tính chất </strong> . <br> 3. Chọn <strong> Quản lý năng lượng </strong> chuyển hướng. <br> 4. <strong> Bỏ chọn </strong> các <strong> &#39;Cho phép thiết bị này đánh thức máy tính </strong> hộp kiểm &#39;và nhấp vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-7-574.png\" alt=\"modify power settings\" loading=\"lazy\"></p> <h6></h6> <h6> Bước 6. Quay lại Trình điều khiển Giao diện Công cụ Quản lý Intel. </h6> <p> Nếu sự cố tiêu hao pin xuất hiện sau khi cài đặt bản cập nhật Windows 10, hãy tiếp tục và khôi phục trình điều khiển cho Giao diện Công cụ Quản lý Intel. Để làm việc đó: </p> <p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-592.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Loại: <strong> devmgmt.msc </strong> &amp; nhấp chuột <strong> đồng ý </strong> . <br> 3. Mở rộng <strong> Hệ thống thiết bị </strong> . <br> 4. Nhấp chuột phải vào <strong> Giao diện công cụ quản lý Intel </strong> và chọn <strong> Tính chất </strong> . </p> <p><img src=\"images/image_thumb-5-532.png\" alt=\"device properties\" loading=\"lazy\"></p> <p> </p> <p> 5. Chọn tab Trình điều khiển và nhấp vào <strong> Quay lại trình điều khiển </strong> . * </p> <p> </p> <p> * Nếu <strong> Quay lại trình điều khiển </strong> chuyển sang màu xám, sau đó điều hướng đến trang web hỗ trợ của nhà sản xuất máy tính xách tay hoặc bo mạch chủ của bạn để tải xuống và cài đặt phiên bản trình điều khiển cũ hơn cho Giao diện Công cụ Quản lý Intel. </p> <p><img src=\"images/image_thumb-6-551.png\" alt=\"roll back driver\" loading=\"lazy\"></p> <p> </p> <p> 6. <strong> Khởi động lại </strong> máy tính của bạn. </p> <h6> Bước 7. Các đề xuất khác để giải quyết vấn đề ngốn pin. </h6> <p> 1. Thay bộ sạc của máy tính xách tay và luôn sử dụng bộ sạc có thương hiệu để kéo dài tuổi thọ pin của bạn. <br> 2. Nếu pin máy tính xách tay của bạn đã cũ, rất có thể dung lượng của nó đã bị giảm và cần được thay thế. Để chẩn đoán tình trạng pin của bạn, hãy sử dụng <a href=\"http://www.nirsoft.net/utils/battery_information_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> BatteryInfoView </a> tiện ích. </p> <p><img src=\"images/image_thumb-16-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trong các mạng xã hội để giúp lan truyền về vấn đề này. </p>"}