{"title":"Khắc phục: Có vẻ như bạn đã bắt đầu nâng cấp và khởi động từ phương tiện cài đặt (Đã giải quyết)","content":"<p> Sự cố sau có thể xuất hiện nếu bạn cố gắng thực hiện cài đặt sạch hoặc nâng cấp sửa chữa Windows 10 từ phương tiện cài đặt: &quot;Có vẻ như bạn đã bắt đầu nâng cấp và khởi động từ phương tiện cài đặt. Nếu bạn muốn tiếp tục nâng cấp, hãy xóa media từ PC của bạn và nhấp vào Có. Nếu bạn muốn thực hiện cài đặt sạch thay thế, hãy nhấp vào Không &quot;. </p> <p><img src=\"images/image_thumb-36-818.png\" alt=\"FIX: It looks like you started an upgrade and booted from installation media \" loading=\"lazy\"></p> <p> </p> <p> Thông báo lỗi trên có nghĩa là bạn đã làm gián đoạn quá trình nâng cấp Windows 10 sau khi bắt đầu. Như thông báo cho biết, nếu bạn muốn thực hiện cài đặt sạch Windows 10, bạn phải chọn &quot;Không&quot; để tiếp tục, nếu không, hãy xóa phương tiện cài đặt và nhấp vào &quot;Có&quot; để tiếp tục nâng cấp Windows 10. </p> <p> Nói chung, thông báo trên không phải là vấn đề, nhưng sẽ trở thành vấn đề lớn nếu bản cập nhật Windows không cài đặt được hoặc nếu Windows 10 bị mắc kẹt sau khi cố gắng cài đặt bản cập nhật và bạn muốn sửa chữa Windows 10 bằng cách khởi động từ bản cài đặt phương tiện truyền thông. </p> <p> Trong hướng dẫn này, bạn sẽ tìm thấy hướng dẫn chi tiết, về cách bỏ qua thông báo &quot;Có vẻ như bạn đã bắt đầu nâng cấp và khởi động từ phương tiện cài đặt&quot;, bằng cách hủy quá trình cập nhật hiện đang chạy của Windows 10, để thực hiện sửa chữa Windows 10 nâng cấp từ phương tiện cài đặt. </p> <h4> Cách hủy bản cập nhật Windows 10 đang tiến hành nếu Windows không thể khởi động * </h4> <p><strong> * Quan trọng: </strong> Nếu bạn có thể khởi động vào Windows 10, nhưng bạn không thể cài đặt bản cập nhật từ môi trường Windows, trước tiên hãy áp dụng các tác vụ sau: </p> <blockquote><p> 1. Điều hướng đến <strong> Khởi đầu </strong> &gt; <strong> Cài đặt </strong> &gt; <strong> Cập nhật và bảo mật </strong> và nhấp vào &quot;Khởi động lại ngay&quot;, để bắt đầu quá trình cập nhật. <br> 2. Sau lần khởi động lại đầu tiên, hãy để tiến độ &quot;Đang làm việc trên các bản cập nhật&quot; để đi đến 1-2%. <br> 3. Khi việc này hoàn tất, hãy nhấn <strong> Quyền lực </strong> trong 10-15 giây, để tắt hoàn toàn PC của bạn. <br> 4. Cắm phương tiện cài đặt Windows và Bật nguồn PC của bạn. <br> 5. Làm theo các bước còn lại bên dưới để hủy cập nhật đang diễn ra. </p></blockquote> <p> </p> <h6> Bước 1. Hủy các hành động đang chờ xử lý của Windows Update. </h6> <p> 1. Khởi động hệ thống của bạn từ phương tiện cài đặt Windows. <br> 2. Khi thông báo &quot;Có vẻ như bạn đã bắt đầu nâng cấp và khởi động từ phương tiện cài đặt…&quot; xuất hiện, hãy nhấn <strong> SHIFT </strong> + <strong> F10 </strong> phím để khởi chạy dấu nhắc lệnh. </p> <p><img src=\"images/image_thumb-37-729.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Tại dấu nhắc lệnh, lấy danh sách tất cả các ổ đĩa trên hệ thống của bạn bằng lệnh sau: </p> <ul> <li><strong> wmic logicdisk lấy tên </strong></li> </ul> <p><img src=\"images/image_thumb1_thumb_thumb-991.png\" alt=\"remove updates winre\" loading=\"lazy\"></p> <p> </p> <p> 4. Sau đó, tìm ra ổ đĩa nào chứa thư mục &quot;Windows&quot;, bằng cách gõ lệnh sau: * </p> <p> </p> <ul> <li><strong> dir DriveLetter: </strong></li> </ul> <p> * ví dụ. Để xem nội dung của ổ C:, hãy nhập: &quot; <strong> dir C: </strong> &quot;(không có dấu ngoặc kép). Nếu bạn không thể thấy thư mục&quot; Windows &quot;trên ổ C: thì hãy tiếp tục đến ký tự ổ đĩa tiếp theo (ví dụ:&quot; dir D: &quot;,&quot; dir E: &quot;, v.v.), cho đến khi bạn thấy Thư mục &quot;Windows&quot; trên một trong các ổ đĩa được liệt kê (từ lệnh trên). </p> <p> ví dụ: Như bạn có thể thấy ở ảnh chụp màn hình bên dưới, thư mục Windows (tại ví dụ này) nằm ở <strong> D </strong> : lái xe.] </p> <p><img src=\"images/image_thumb-69-578.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Sau khi bạn tìm thấy ổ đĩa &quot;Windows&quot; nằm trên ổ nào (ví dụ: tại ổ &quot;D:&quot; trong ví dụ này), hãy điều hướng đến ổ đó bằng cách nhập DriveLetter <strong> : </strong> + <strong> Đi vào </strong> . </p> <p> 6. Sau đó, tạo một thư mục xước trên ổ Windows bằng cách gõ lệnh sau: </p> <p> </p> <ul> <li><strong> mkdir D: \\ Scratch </strong></li> </ul> <p><img src=\"images/image_thumb-70-229.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Sau đó đưa ra lệnh dưới đây để hoàn nguyên các hành động đang chờ xử lý của bản cập nhật đang diễn ra: </p> <ul> <li><strong> DISM / Hình ảnh: D: \\ / ScratchDir: D: \\ Scratch / Cleanup-Image / RevertPendingActions </strong></li> </ul> <p> * Lưu ý: Thay đổi ký tự ổ đĩa <strong> D </strong> theo trường hợp của bạn. </p> <p> 8. Khi lệnh DISM trên được thực thi, bạn sẽ nhận được thông báo sau trên màn hình: </p> <p> &quot; <em> Đang hoàn nguyên các hành động đang chờ xử lý từ hình ảnh…. <br> Hoạt động đã hoàn thành. Việc hoàn nguyên các hành động đang chờ xử lý sẽ được thực hiện sau khi khởi động lại. <br> Hoạt động đã hoàn tất thành công. &quot; </em></p> <p><img src=\"images/image_thumb-38-751.png\" alt=\"DISM - RevertPendingActions\" loading=\"lazy\"></p> <p> </p> <p> 9. Đóng cửa sổ nhắc lệnh, xóa phương tiện cài đặt và để Windows khởi động bình thường. </p> <p> 10. Sau khi khởi động lại, bạn sẽ thấy thông báo sau trên màn hình: &quot;Đang hoàn tác các thay đổi được thực hiện đối với máy tính của bạn.&quot; Khi quá trình này kết thúc, Windows sẽ khởi động bình thường. </p> <p><img src=\"images/image_thumb-39-836.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <h6> Bước 2. Xóa các tập tin nâng cấp bằng Disk Cleanup. </h6> <p> Sau khi khởi động trong Windows 10, bạn phải chuẩn bị Windows 10 để sửa chữa / nâng cấp USB, bằng cách xóa các bản cập nhật đã tải xuống bằng công cụ Disk Cleanup. Để làm việc đó: </p> <p> 1. Mở File explorer, nhấp chuột phải vào ổ C: và chọn <strong> Tính chất </strong> . <br> 2. Nhấp vào <strong> Dọn dẹp đĩa </strong> cái nút. </p> <p><img src=\"images/image_thumb_thumb-190.png\" alt=\"Disk cleanup Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Sau đó nhấp vào <strong> Dọn dẹp các tệp hệ thống </strong> . </p> <p><img src=\"images/image_thumb-40-950.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Bây giờ hãy kiểm tra để loại bỏ các tệp sau và nhấp vào <strong> đồng ý </strong> : </p> <ul> <li> <ul> <li> <ul> <li> Dọn dẹp Windows Update. </li> <li> Windows Defender Antivirus. </li> <li> Tệp chương trình đã tải xuống. </li> <li> Các tệp Internet tạm thời. </li> <li> Các bản cài đặt Windows trước đó. </li> <li> Thùng rác. </li> <li> Hồ sơ tạm thời. </li> <li> Tệp cài đặt Windows tạm thời </li> </ul> </li> </ul> </li> </ul> <p><img src=\"images/image_thumb-41-458.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Khi được hỏi, <strong> Xóa các tập tin </strong> . </p> <p><img src=\"images/image_thumb-42-931.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Khi quá trình dọn dẹp hoàn tất, hãy đóng các thuộc tính đĩa và tiếp tục bước tiếp theo. </p> <p> </p> <h6> Bước 3. Xóa thư mục &#39;SoftwareDistribution&#39;. </h6> <p> &quot;C: \\ Windows \\ <strong> Phân phối phần mềm </strong> &quot;, là nơi Windows lưu trữ các Bản cập nhật Windows. Nhiều lần, thư mục này bị hỏng và bạn phải tạo lại nó để tải xuống lại các bản cập nhật từ đầu. Vì vậy, hãy tiến hành như sau: </p> <p><strong> 1. Dừng Dịch vụ Windows Update: </strong> Để làm việc đó: </p> <blockquote><p> a. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-201.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> b. Trong hộp Tìm kiếm, nhập: <strong><em> services.msc </em></strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p></blockquote> <p><img src=\"images/image_thumb-12-264.png\" alt=\"services\" loading=\"lazy\"></p> <p> </p> <p> </p> <blockquote><p> c. Trong bảng điều khiển Dịch vụ, xác định vị trí &quot; <strong> Cập nhật hệ điều hành Window&quot; </strong> dịch vụ. <br> d. Nhấp chuột phải vào <strong> cập nhật hệ điều hành Window </strong> dịch vụ và chọn &quot; <strong> Dừng lại </strong> &quot;. </p></blockquote> <p><img src=\"images/image_thumb-9-434.png\" alt=\"stop windows update service\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. Xóa thư mục SoftwareDistribution. </strong></p> <blockquote><p> a. Mở Windows Explorer và điều hướng đến: <strong> C: \\ Windows </strong> thư mục. <br> b. Tìm và <strong> Xóa bỏ </strong> các &quot; <strong><em> Phân phối phần mềm </em></strong> &quot;(hoặc đổi tên nó. ví dụ: thành&quot; SoftwareDistributionOLD &quot;). </p></blockquote> <p> </p> <p><img src=\"images/image_thumb-10-140.png\" alt=\"softwaredistribution\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Khởi động lại máy tính của bạn </strong> để áp dụng các thay đổi. </p> <p> </p> <h6> Bước 4. Nâng cấp Windows 10 từ phương tiện cài đặt. </h6> <p> Bây giờ, bạn đã sẵn sàng sửa chữa-nâng cấp Windows 10 từ phương tiện cài đặt. Để làm việc đó: </p> <p> 1. <strong> Khởi động lại </strong> máy tính của bạn và <strong> khởi động </strong> từ USB Windows (hoặc DVD) <strong> phương tiện cài đặt </strong> . <br> 2. Tại trình hướng dẫn Cài đặt Windows, nhấn <strong> Kế tiếp </strong> và sau đó nhấp vào <strong> Cài đặt ngay </strong> . <br> 3. <strong> Chấp nhận </strong> &#39;Thỏa thuận cấp phép&#39;. <br> 4. Khi được hỏi, hãy chọn Nâng cấp <strong> : Cài đặt Windows và giữ các tệp, cài đặt và ứng dụng </strong> . </p> <blockquote><p><img src=\"images/image_thumb8_thumb-241.png\" alt=\"image_thumb8\" loading=\"lazy\"></p></blockquote> <p> 5. Sau đó, làm theo hướng dẫn trên màn hình để nâng cấp Windows 10. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}