{"title":"Cách kiểm tra các bản cập nhật trong Office 2019, 2016 hoặc 2013 trong Windows 10.","content":"<p> Trong hướng dẫn này, bạn sẽ học cách kiểm tra thủ công các bản cập nhật trong Office 2019, 2016 và Office 2013. Trong tất cả các phiên bản Office, có hai cách để cài đặt các bản cập nhật Office có sẵn: Tự động và Thủ công. </p> <h4> Cách cập nhật Office 209/2016/2013/2010 theo cách thủ công. </h4> <h6> Phương pháp 1. Cách kiểm tra thủ công các bản cập nhật Office trong Office 2019, 2016 và Office 2013. </h6> <p> Để kiểm tra và cài đặt thủ công các bản cập nhật Office có sẵn, trong tất cả các phiên bản Office: </p> <p> 1. Mở bất kỳ chương trình Office nào (ví dụ: Word). <br> 2. Từ <strong> Tập tin </strong> menu, chọn <strong> Tài khoản </strong> . * </p> <p> * Lưu ý: Trong Office 2010 chọn <strong> Cứu giúp. </strong></p> <p> 3. Mở rộng <strong> Cập nhật các tùy chọn </strong> và bấm vào <strong> Cập nhật bây giờ </strong> . * </p> <p> * Lưu ý: Nếu &#39;Tùy chọn Cập nhật&#39; không khả dụng, hãy làm theo hướng dẫn tại Phương pháp-2 bên dưới. </p> <p><img src=\"images/image_thumb-19-478.png\" alt=\"How to Check for Updates in Office 2019, 2016 or 2013 in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Phương pháp 2. Cách tự động cài đặt bản cập nhật Office cho Office 2019, 2016 và Office 2013. </h6> <p> Nếu bạn muốn Windows tự động tải xuống và cài đặt các bản cập nhật Office có sẵn, hãy điều hướng đến cài đặt cập nhật Windows và kiểm tra cài đặt sau: </p> <ul> <li> Nhận bản cập nhật cho các sản phẩm khác của Microsoft khi bạn cập nhật Windows (Windows 10) </li> <li> Cung cấp cho tôi bản cập nhật cho các sản phẩm khác của Microsoft khi tôi cập nhật Windows (Windows 7) </li> </ul> <h5> Để tự động cài đặt các bản cập nhật Office trong Windows 10. </h5> <p><strong> 1. </strong> Đi đến <strong> Cài đặt </strong> -&gt; <strong> Cập nhật và Bảo mật -&gt; Tùy chọn nâng cao. </strong></p> <p><img src=\"images/image_thumb-20-149.png\" alt=\"Change Update Options Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Tại tùy chọn Cập nhật, hãy kéo thanh trượt &#39;Nhận bản cập nhật cho các sản phẩm khác của Microsoft khi bạn cập nhật Windows&#39; sang <strong> TRÊN. </strong></p> <p><img src=\"images/image_thumb-21-717.png\" alt=\"automatically install office updates windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Điều hướng đến màn hình trước và nhấp vào <strong> Kiểm tra cập nhật </strong> khi bạn muốn cài đặt các bản cập nhật Office có sẵn ngay lập tức. </p> <p> </p> <h5> Để tự động cài đặt các bản cập nhật Office trong Windows 7. </h5> <p> 1. Điều hướng đến <strong> Bảng điều khiển </strong> -&gt; <strong> cập nhật hệ điều hành Window </strong> và bấm vào <strong> Thay đổi cài đặt </strong> . </p> <p><img src=\"images/image_thumb-22-108.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Chọn <strong> Cung cấp cho tôi bản cập nhật cho các sản phẩm khác của Microsoft khi tôi cập nhật Windows </strong> hộp kiểm và nhấp vào <strong> Ứng dụng </strong> . </p> <p> 3. Nhấp vào <strong> Kiểm tra cập nhật </strong> để cài đặt tất cả các Bản cập nhật có sẵn. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp phổ biến rộng rãi về hướng dẫn này. </p> <p> </p>"}