{"title":"Cách Xóa thông báo CHẾ ĐỘ XEM ĐƯỢC BẢO VỆ trong tất cả các Tài liệu Word hoặc Excel đã nhận hoặc tải xuống.","content":"<p> &quot;Chế độ xem được bảo vệ&quot; là một tính năng được thêm vào trong các phiên bản Office mới nhất, nhằm bảo vệ máy tính của bạn khỏi bất kỳ loại vi-rút nào có thể được nhúng trong bất kỳ tệp nào được tải xuống từ Internet hoặc nhận được qua e-mail. Mặc dù có thể dễ dàng loại bỏ cảnh báo &quot;Chế độ xem được bảo vệ&quot; bằng cách nhấp vào &quot;Bật Chỉnh sửa&quot;, nhưng thật khó chịu khi bạn nhận được nhiều tài liệu từ các nguồn đáng tin cậy. </p> <p><img src=\"images/image_thumb-19-615.png\" alt=\"How to Remove Protected View Notification in Word-Excel\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Bài viết liên quan: </strong> <a href=\"https://www.repairwin.com/fix-file-cannot-be-previewed-in-outlook-word-experienced-an-error-when-opening-attachment/?preview=true\" target=\"_blank\" rel=\"nofollow noopener\"> Khắc phục: Không thể xem trước hoặc mở tệp đính kèm e-mail Word hoặc Excel trong Office 2013, 206, 2019 hoặc 365 </a> . </li> </ul> <h4> Cách vô hiệu hóa cảnh báo dạng xem được bảo vệ trong Word hoặc Excel. </h4> <p> Để xóa Cảnh báo CHẾ ĐỘ XEM ĐƯỢC BẢO VỆ trong Microsoft Word hoặc Excel phiên bản 2013, 2016, 2019 hoặc 365: </p> <p> 1. Từ <strong> Tập tin </strong> nhấp chuột vào menu <strong> Tùy chọn </strong> . <br> 2. Tại <strong> Trung tâm Tin tưởng </strong> tùy chọn, chọn <strong> Cài đặt Trung tâm Tin cậy </strong> . </p> <p><img src=\"images/image_thumb-16-270.png\" alt=\"fix Word experienced an error trying to open the file\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Bỏ chọn </strong> tất cả &quot; <strong> Bật Chế độ xem được Bảo vệ .. </strong> &quot;hộp kiểm và nhấp vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-17-740.png\" alt=\"disable protected view option word - excel\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về điều này. </p>"}