{"title":"Cách xóa bảo vệ BitLocker khỏi Ổ đĩa hệ thống C: Không có khóa hoặc mật khẩu khôi phục BitLocker.","content":"<p> Bài viết này bao gồm hướng dẫn từng bước về cách gỡ bỏ BitLocker Protection trên ổ đĩa hệ thống C: để có thể xóa cài đặt Windows 10 trên máy tính được bảo vệ bởi BitLocker, nếu bạn không có khóa BitLocker Recovery hoặc mật khẩu BitLocker hoặc nếu bạn không thể mở khóa ổ BitLocker vì bất kỳ lý do gì. </p> <p><img src=\"images/image_thumb-51-648.png\" alt=\"Fix Refresh your PC error: Drive where windows is installed is locked\" loading=\"lazy\"></p> <p> </p> <p> Khi thiết bị Windows 10 (máy tính xách tay hoặc PC) được bảo vệ bằng BitLocker, thì cách duy nhất để truy cập nội dung của nó hoặc để đặt lại thiết bị (bằng cách sử dụng các tính năng &quot;Đặt lại PC này&quot;, &quot;Làm mới PC của bạn&quot;) hoặc cài đặt lại Windows, là để mở khóa ổ đĩa hệ điều hành C: bằng cách sử dụng Khóa khôi phục BitLocker hoặc mật khẩu BitLocker. </p> <p> Nếu bạn không có khóa BitLocker Recovery hoặc mật khẩu BitLocker để mở khóa ổ đĩa hệ thống C :, hoặc khóa BitLocker không được chấp nhận, thì tùy chọn duy nhất bạn còn lại (thật không may), là xóa hoàn toàn ổ đĩa và thực hiện cài đặt Windows sạch. </p> <p> Trong hướng dẫn này, bạn sẽ tìm thấy hướng dẫn về cách giải quyết sự cố sau khi cố gắng cài đặt Windows 10 hoặc đặt lại thiết bị Windows 10 ở trạng thái mặc định ban đầu: &quot;Ổ đĩa cài đặt Windows bị khóa. Hãy mở khóa ổ đĩa và thử lại &quot;. </p> <h4> Cách làm sạch Cài đặt Windows 10 trên máy tính được bảo vệ bởi BitLocker (Khắc phục: Không thể cài đặt / làm mới Windows 10 - Ổ đĩa bị khóa bằng BitLocker.) </h4> <p><strong> Yêu cầu: </strong> <strong> Phương tiện cài đặt Windows 10 (USB hoặc DVD). </strong><br> Nếu bạn không sở hữu Phương tiện cài đặt Windows thì bạn có thể tạo một Phương tiện cài đặt bằng cách sử dụng <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Công cụ tạo phương tiện của Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách tạo phương tiện cài đặt Windows 10 USB. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách tạo phương tiện cài đặt Windows 10 DVD. </a></li> </ul> <p> Để thực hiện cài đặt sạch Windows 10, trên Máy tính / Ổ đĩa được bảo vệ BitLocker, hãy làm theo hướng dẫn bên dưới: * </p> <p><strong> * THẬN TRỌNG: THỦ TỤC DƯỚI ĐÂY SẼ XÓA TẤT CẢ CÁC DỮ LIỆU ĐƯỢC LƯU TRỮ TRÊN Ổ CÒN KHÓA. CHỈ TIẾN HÀNH NẾU BẠN <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> KHÔNG THỂ MỞ KHÓA Ổ ĐẠP / MÁY TÍNH ĐƯỢC BẢO VỆ BITLOCKER. </a></strong></p> <p> 1. Khởi động hệ thống của bạn từ phương tiện cài đặt Windows 10. * </p> <p> * Ghi chú: <strong> </strong> Để có thể khởi động từ Windows Media (USB hoặc DVD), hãy làm theo các bước sau: </p> <ul> <li><strong> Phương pháp 1: </strong> Sau khi Bật nguồn, nhấn phím Chức năng tương ứng (thường là phím &quot;F12&quot; hoặc &quot;F8&quot;) để xem các tùy chọn &quot;Boot Order&quot; hoặc &quot;Boot Menu&quot;. Sau đó, chọn thiết bị USB (hoặc DVD) có chứa Phương tiện cài đặt Windows (tệp) và nhấn Enter. </li> <li><strong> Phương pháp 2: </strong> Vào Thiết lập BIOS (Cài đặt) và đặt Phương tiện Cài đặt Windows làm &quot;Thiết bị Khởi động Đầu tiên&quot; tại menu &quot;Thứ tự Khởi động&quot;. Sau đó <strong> Lưu và thoát </strong> từ cài đặt BIOS. </li> </ul> <p> 2. Ở màn hình bên dưới, nhấn nút <strong> SHIFT </strong> + <strong> F10 </strong> phím để khởi chạy dấu nhắc lệnh. (hoặc nhấn <strong> Kế tiếp </strong> &gt; <strong> Sửa chữa máy tính của tôi </strong> &gt; <strong> Khắc phục sự cố </strong> &gt; <strong> Dấu nhắc lệnh </strong> ). * </p> <p> * Lưu ý: Nếu bạn được nhắc nhập khóa khôi phục, hãy nhấp vào <strong> BỎ QUA ổ đĩa này </strong> . </p> <p><img src=\"images/image_thumb15_thumb-290.png\" alt=\"How to Remove Updates from the Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. Trong dấu nhắc lệnh, đưa ra các lệnh sau theo thứ tự: </p> <ul> <li><strong> diskpart </strong></li> <li><strong> đĩa danh sách </strong></li> <li><strong> chọn đĩa 0 </strong></li> <li><strong> danh sách khối lượng </strong></li> </ul> <p> 4. Bây giờ xác định vị trí ổ đĩa nào trong số các ổ đĩa được liệt kê có kích thước lớn hơn tính bằng GB. Thông thường, khối lượng lớn hơn là nơi Windows được cài đặt trên (ổ bị khóa). * </p> <p> * ví dụ. Ở ảnh chụp màn hình bên dưới, &quot;Tập 2&quot; có kích thước lớn hơn. </p> <p> </p> <p><img src=\"images/image_thumb-10-992.png\" alt=\"fix drive is locked Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Sau đó chọn âm lượng lớn hơn bằng cách gõ lệnh này: * </p> <ul> <li><strong> chọn số âm lượng </strong></li> </ul> <p> * Lưu ý: Thay đổi số âm lượng ở lệnh trên tùy theo trường hợp của bạn (ví dụ: &quot;chọn tập 2&quot;) </p> <p> 5. Cuối cùng xóa ổ đĩa đã chọn bằng cách đưa ra lệnh này: </p> <p> </p> <ul> <li><strong> xóa ghi đè âm lượng </strong></li> </ul> <p><img src=\"images/image_thumb-14-714.png\" alt=\"delete volume override\" loading=\"lazy\"></p> <p> </p> <p> 6. Loại <strong> lối ra </strong> để đóng công cụ DISKPART và sau đó đóng Dấu nhắc lệnh. <br> 7. Tắt rồi BẬT lại thiết bị của bạn. <br> 8. Khởi động từ Phương tiện Cài đặt Windows. <br> 9. Nhấp vào <strong> Kế tiếp </strong> và sau đó <strong> Cài đặt ngay </strong> . <br> 10. Chọn &quot;Tôi không có khóa sản phẩm&quot; và sau đó chấp nhận Thỏa thuận cấp phép. <br> 11. Chọn &quot;Cài đặt tùy chỉnh&quot; và sau đó xóa tất cả các phân vùng / ổ đĩa còn lại trên đĩa. </p> <p><img src=\"images/image_thumb-12-362.png\" alt=\"cannot reset windows 10 drive locked with bitlocker\" loading=\"lazy\"></p> <p> </p> <p> 12. Khi hoàn tất, hãy chọn &quot;Không gian chưa được phân bổ&quot; và nhấp vào <strong> Kế tiếp. <br> </strong> 13. Làm theo lời nhắc trên màn hình để <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> cài đặt sạch Windows 10 </a> . </p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trong các mạng xã hội để giúp lan truyền về vấn đề này. </p>"}