{"title":"Cách cài đặt lại Windows 10 nếu Windows không khởi động.","content":"<p> Trong hướng dẫn này, bạn sẽ tìm thấy hướng dẫn chi tiết về cách cài đặt lại Windows 10, nếu Windows không khởi động được. Trong một hướng dẫn trước, tôi đã đề cập đến cách <a href=\"https://www.repairwin.com/how-to-reset-windows-10-to-a-clean-state/\" target=\"_blank\" rel=\"nofollow noopener\"> cài đặt lại Windows 10 bằng cách sử dụng tính năng &quot;ĐẶT LẠI PC này </a> . Tuy nhiên, &quot;ĐẶT LẠI PC này&quot; chỉ khả dụng nếu Windows 10 có thể khởi động bình thường hoặc nếu bạn có thể khởi chạy menu &quot;Khởi động Nâng cao&quot; sau khi khởi động lên Windows. (Không có tùy chọn &quot;ĐẶT LẠI PC này&quot; khi khởi động từ USB). </p> <p> Hướng dẫn này chứa các hướng dẫn để cài đặt lại Windows 10 nếu Windows không khởi động được mà không làm mất tệp của bạn. </p> <h2> Cách cài đặt lại ghép nối Windows 10 nếu Windows không thể khởi động. </h2> <p><strong> Yêu cầu </strong> : Để cài đặt lại Windows 10 nếu Windows không khởi động bình thường, bạn sẽ cần khởi động máy tính của mình từ phương tiện cài đặt Windows (USB hoặc DVD) và bật Menu Tùy chọn Nâng cao (menu phím F8). Nếu bạn không sở hữu Phương tiện cài đặt Windows thì bạn có thể tạo một Phương tiện cài đặt bằng cách sử dụng <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Công cụ tạo phương tiện của Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách tạo phương tiện cài đặt Windows 10 USB. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách tạo phương tiện cài đặt Windows 10 DVD. </a></li> </ul> <p> 1. Khởi động máy tính của bạn từ phương tiện cài đặt Windows. <br> 3. Nhấn <strong> Kế tiếp </strong> tại màn hình Tùy chọn ngôn ngữ. <br> 4. Chọn <strong> Sửa máy tính của bạn </strong> . <br> 5. Sau đó chọn <strong> Khắc phục sự cố -&gt; </strong><strong> Tùy chọn nâng cao -&gt; Dấu nhắc lệnh. </strong></p> <p> 6. Tại cửa sổ nhắc lệnh, gõ lệnh sau và nhấn <strong> Đi vào: </strong></p> <ul> <li><strong> bcdedit / set {default} bootmenupolicy kế thừa </strong></li> </ul> <p><img src=\"images/image_thumb-33-821.png\" alt=\"advanced boot options\" loading=\"lazy\"></p> <p> 7. Loại <strong> lối ra </strong> để đóng cửa sổ nhắc lệnh. <br> 8. Gỡ bỏ phương tiện cài đặt Windows. <br> 9. Đóng tất cả các cửa sổ để khởi động lại hoặc tắt PC của bạn. </p> <p> 10. <strong> nhấn </strong> các <strong> F8 </strong> Chìa khóa <strong> nhiều lần </strong> trong quá trình bật nguồn máy tính. </p> <p> 11. Tại &quot;Menu Tùy chọn Nâng cao&quot;, đánh dấu &quot; <strong> Sửa máy tính của bạn </strong> &quot;rồi nhấn <strong> ĐI VÀO </strong> . </p> <p><img src=\"images/image_thumb-13-334.png\" alt=\"Repair your Computer in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 12. Tại màn hình &#39;Chọn một tùy chọn&#39;, chọn <strong> Khắc phục sự cố </strong> và sau đó nhấp vào <strong> Đặt lại PC này -&gt; Giữ tệp của tôi. </strong> * </p> <p> Ghi chú: <br> 1. Dấu &quot; <strong> Giữ tệp của tôi &quot; </strong> tùy chọn, sẽ xóa tất cả các ứng dụng và cài đặt của bạn nhưng sẽ giữ lại các tệp cá nhân của bạn. <br> 2. Các <strong> &quot;Loại bỏ mọi thứ&quot; </strong> sẽ xóa tất cả ứng dụng, cài đặt và tệp. Bằng cách chọn tùy chọn này, PC của bạn sẽ được khôi phục về trạng thái sạch. <br> 3. Nếu bạn chọn &quot;Xóa mọi thứ&quot;, hãy đảm bảo rằng bạn có bản sao lưu gần đây của các tệp cá nhân của mình vào một phương tiện lưu trữ khác (ví dụ: đĩa USB), nếu không tất cả các tệp của bạn sẽ bị mất. </p> <p><img src=\"images/image_thumb-14-296.png\" alt=\"How to Reinstall Windows 10 if Windows Won't Boot.\" loading=\"lazy\"></p> <p> </p> <p> 13. Ở màn hình tiếp theo, chọn một tài khoản có quyền quản trị. ) và ở màn hình tiếp theo, hãy nhập mật khẩu của bạn và nhấp vào <strong> Kế tiếp </strong> . </p> <p><img src=\"images/image_thumb-15-869.png\" alt=\"How to Reinstall Windows 10 if Windows cannot Boot.\" loading=\"lazy\"></p> <p> 14. Nhập mật khẩu cho tài khoản đã chọn và nhấp vào <strong> Tiếp tục. </strong></p> <p><img src=\"images/image_thumb-16-692.png\" alt=\"How to Reinstall Windows 10 if Windows fails to boot.\" loading=\"lazy\"></p> <p> </p> <p> 15. Chờ cho đến khi cài đặt hoàn tất. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp phổ biến rộng rãi về hướng dẫn này. </p>"}