{"title":"Cách chặn YouTube trên Windows 10.","content":"<p> Vì học từ xa đã trở thành một phần trong cuộc sống của trẻ em trong những năm gần đây, nhiều bậc cha mẹ đang tìm cách chặn video YouTube trong quá trình học trực tuyến hoặc giảm thời gian trẻ ngồi trước máy tính để xem video thay vì thực hiện các hoạt động khác. </p> <p> Bên cạnh việc nghiện YouTube khiến các bậc cha mẹ lo lắng, trong những năm gần đây đã có nhiều video YouTube có nội dung không phù hợp hoặc nguy hiểm cho trẻ em được phát hành và vì lý do này là cần thiết để hạn chế quyền truy cập YouTube, đặc biệt là khi không có sự giám sát của cha mẹ. </p> <p> Trong hướng dẫn này, bạn sẽ học cách ngăn truy cập trang web YouTube trên tất cả các trình duyệt. * </p> <p> * Lưu ý: Nếu bạn chỉ muốn chặn một trang web trong Chrome hoặc trong Firefox, hãy đọc bài viết này: <a href=\"https://www.repairwin.com/block-websites-on-chrome-firefox/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách chặn trang web trên Chrome và Firefox. </a></p> <h2> Cách chặn YouTube trên mọi trình duyệt trên HĐH Windows 10, 8 hoặc 7. </h2> <p> Cách đáng tin cậy nhất để chặn bất kỳ trang web nào trên bất kỳ trình duyệt nào trên PC Windows là sử dụng tệp &quot;hosts&quot;. Các <strong> máy chủ </strong> tệp là tệp hệ điều hành ánh xạ tên máy chủ (tên miền) với địa chỉ IP. Nói một cách dễ hiểu, khi bạn nhập địa chỉ của một trang web vào trình duyệt của mình, máy tính sẽ nhìn vào địa chỉ cục bộ trước tiên <strong> máy chủ </strong> tệp để giải quyết Địa chỉ IP của nó. Nếu tên trang web không xuất hiện trong tệp máy chủ, thì nó đang cố gắng tìm địa chỉ IP của nó từ dịch vụ DNS mà bạn đang sử dụng trên thiết bị của mình. </p> <p> Để chặn YouTube trên bất kỳ trình duyệt web nào (ví dụ: Chrome, Firefox, Edge, v.v.) trên Windows thông qua tệp máy chủ: </p> <p> 1. Mở <strong> Sổ tay </strong> ứng dụng <strong> với tư cách là Quản trị viên </strong> . Để làm việc đó: </p> <blockquote><p> a. Kiểu <strong> sổ tay </strong> trên hộp tìm kiếm </p> <p> b. <strong> Nhấp chuột phải </strong> trên <strong> Sổ tay </strong> và chọn <strong> Chạy như quản trị viên </strong> . </p> <p><img src=\"images/image_thumb-584.png\" alt=\"run notepad as administrator\" loading=\"lazy\"></p></blockquote> <p> </p> <p> 2. Từ <strong> Tập tin </strong> menu, chọn <strong> Mở. <br> </strong> 3. Điều hướng đến vị trí này trên đĩa của bạn: </p> <ul> <li> C: \\ Windows \\ System32 \\ drivers \\ etc </li> </ul> <p> 4. Thay đổi &quot;Loại tệp&quot; thành <strong> Tất cả các tệp </strong> và sau đó mở <strong> máy chủ </strong> tập tin </p> <p><img src=\"images/image_thumb-1-968.png\" alt=\"block sites hosts file\" loading=\"lazy\"></p> <p> </p> <p> 5. Ở cuối thêm các dòng sau: * </p> <ul> <li> 127.0.0.1 youtube.com </li> <li> 127.0.0.1 www.youtube.com </li> <li> 127.0.0.1 m.youtube.com </li> </ul> <p> * Lưu ý: Nhấn TAB sau khi nhập 127.0.0.1 </p> <p><img src=\"images/image_thumb-2-460.png\" alt=\"block youtube hosts\" loading=\"lazy\"></p> <p> </p> <p> 6. Khi hoàn tất, hãy nhấp vào <strong> Tập tin </strong> &gt; <strong> Tiết kiệm </strong> và đóng notepad. </p> <p> 7. Cuối cùng mở trình duyệt của bạn và thử truy cập YouTube. Thông thường, bạn sẽ nhận được thông báo: &quot;Kết nối với Internet. Bạn đang ngoại tuyến. Hãy kiểm tra kết nối của bạn&quot;. </p> <p><img src=\"images/image_thumb-3-490.png\" alt=\"block youtube.com hosts\" loading=\"lazy\"></p> <p> </p> <p> 8. Bạn đã hoàn thành. Nếu bạn muốn bỏ chặn YouTube trong tương lai, chỉ cần làm theo các bước tương tự. nhưng lần này hãy xóa ba (3) dòng đã thêm trong tệp máy chủ hoặc nhập ký hiệu <strong> # </strong> ở phía trước mỗi dòng được thêm vào. </p> <p> Đó là tất cả mọi người! Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}