{"title":"CÁCH THỨC: Xóa Lịch sử Internet, Mật khẩu và Cookie khỏi Trình duyệt Web của bạn (Chrome, Firefox, IE)","content":"<p> Khi bạn truy cập một trang web bằng trình duyệt web của mình, trang web sẽ gửi một số thông tin đến trình duyệt và trình duyệt lưu trữ thông tin đó vào các tệp văn bản nhỏ được gọi là <strong> bánh quy </strong> S. Cookie lưu trữ các tùy chọn của người dùng đối với trang web đó, ví dụ: thông tin đăng nhập, vì vậy người dùng không phải nhập lại chi tiết đăng nhập (tên người dùng và / hoặc mật khẩu) khi quay lại cùng một trang web. Cookie cũng có thể lưu lại lịch sử của những trang nào của trang web mà người dùng đã truy cập, vì vậy người dùng không cần phải nhớ chúng hoặc điều hướng qua tất cả các trang của trang web cho đến khi tìm thấy những gì mình muốn. </p> <p> Đồng thời, khi bạn truy cập một trang web, trình duyệt sẽ lưu trữ bản sao cục bộ của tất cả các trang bạn đã truy cập, để tiết kiệm băng thông kết nối và giảm thời gian tải của các trang web vào lần tiếp theo bạn truy cập chúng. &#39;Bản sao cục bộ của các trang web &quot;này được gọi là&quot; <strong> Tệp Internet tạm thời </strong> &quot;của <strong> Bộ nhớ đệm </strong> . </p> <p> Cookie và Cache, sau một thời gian có thể chiếm một lượng lớn dung lượng ổ đĩa và cần phải xóa chúng. Trong các trường hợp khác, bạn có thể cần xóa bộ nhớ cache và cookie của trình duyệt để tải lại hoàn toàn nội dung của trang web hoặc vì lý do bảo mật và quyền riêng tư: ví dụ: nếu bạn không muốn, một người thứ ba sẽ tìm ra những trang web bạn đã truy cập (hay còn gọi là: &quot; <strong> Lịch sử duyệt web </strong> &quot;) hoặc là chi tiết đăng nhập của bạn vào một trang web (ví dụ: GMAIL). </p> <p> Trong hướng dẫn này, bạn sẽ tìm thấy hai (2) cách dễ dàng để xóa Lịch sử duyệt web, Tệp Internet tạm thời (Cache) và Cookie khỏi Internet Explorer, Chrome &amp; Firefox. </p> <h4> Cách Xóa Lịch sử Duyệt web, Mật khẩu đã Lưu và Cookie trong Chrome, Firefox &amp; Internet Explorer. </h4> <h5><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Phương pháp 1. Xóa dữ liệu duyệt web khỏi một trình duyệt cụ thể. </a></h5> <h5><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Phương pháp 2. Xóa dữ liệu duyệt web khỏi tất cả các trình duyệt web chỉ với một cú nhấp chuột! </a></h5> <p> </p> <h5> Phương pháp 1. Xóa lịch sử, bộ nhớ cache và cookie khỏi một trình duyệt cụ thể. </h5> <p> Nói chung, mỗi trình duyệt web có các tùy chọn để xóa dữ liệu duyệt web được lưu trữ thông qua menu Cài đặt / Tùy chọn, nhưng Nếu bạn muốn dễ dàng truy cập các tùy chọn đó (mà không phải điều hướng bằng chuột qua menu của trình duyệt), hãy nhấn <strong> Ctrl </strong> + <strong> Sự thay đổi </strong> + <strong> Xóa bỏ </strong> các phím với nhau trên cửa sổ trình duyệt đang mở của bạn. Vì thế… </p> <p><strong> Để xóa lịch sử duyệt web, bộ nhớ cache và cookie khỏi Internet Explorer: </strong></p> <p> 1. Mở Internet Explorer và nhấn <strong> Ctrl </strong> + <strong> Sự thay đổi </strong> + <strong> Xóa bỏ. <br> </strong> 2. Chọn loại thông tin bạn muốn xóa và nhấp vào <strong> Xóa bỏ </strong> cái nút. </p> <p><img src=\"images/image_thumb-18-750.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> Để xóa lịch sử duyệt web, bộ nhớ cache và cookie khỏi Chrome: </strong></p> <p> 1. Khởi chạy Chrome và nhấn <strong> Ctrl </strong> + <strong> Sự thay đổi </strong> + <strong> Xóa bỏ. <br> </strong> 2. Chọn loại thông tin bạn muốn xóa và sau đó nhấn <strong> XÓA DỮ LIỆU </strong> . </p> <p><img src=\"images/image_thumb-19-667.png\" alt=\"clear chrome history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p><strong> Để xóa lịch sử duyệt web, bộ nhớ cache và cookie khỏi Firefox: </strong></p> <p> 1. Mở Firefox và nhấn đồng thời <strong> Ctrl </strong> + <strong> Sự thay đổi </strong> + <strong> Xóa bỏ. <br> </strong> 2. Chọn dữ liệu bạn muốn xóa khỏi Firefox và nhấp vào <strong> Xóa ngay bây giờ. </strong></p> <p> </p> <p><img src=\"images/image_thumb-20-864.png\" alt=\"clear firefox history, cookies, etc.\" loading=\"lazy\"></p> <p> </p> <p> </p> <h5> Phương pháp 2: Xóa lịch sử trình duyệt, bộ nhớ cache và cookie khỏi tất cả các trình duyệt web cùng một lúc. </h5> <p> Nếu bạn muốn làm cho cuộc sống của mình dễ dàng hơn, thì bạn có thể sử dụng <a href=\"https://www.ccleaner.com/\" target=\"_blank\" rel=\"nofollow noopener\"> CCleaner </a> tiện ích để dễ dàng xóa các Tệp Internet Tạm thời, Lịch sử và Cookie khỏi tất cả các Trình duyệt Web bạn đang sử dụng, chỉ với một cú nhấp chuột. </p> <p> 1. <a href=\"https://www.ccleaner.com/ccleaner/download\" target=\"_blank\" rel=\"nofollow noopener\"> Tải xuống </a> và cài đặt phiên bản miễn phí của tiện ích CCleaner. </p> <p> 2. Khởi chạy <strong> CCleaner </strong> và điều hướng đến <strong> các cửa sổ </strong> và <strong> Các ứng dụng </strong> tùy chọn tab, để chọn thông tin bạn muốn xóa khỏi trình duyệt web. </p> <p> 3. Khi hoàn tất, hãy nhấp vào <strong> Chạy sạch hơn </strong> . </p> <p><img src=\"images/image_thumb-21-173.png\" alt=\"clear internet history cache cookies - ccleaner\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Đó là tất cả! Nó đã làm việc cho bạn? </p> <p> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}