{"title":"Cách gỡ cài đặt phiên bản Edge Chromium trong Windows 10.","content":"<p> Nhiều người dùng đã báo cáo rằng sau khi cài đặt phiên bản mới dựa trên Chromium của trình duyệt Microsoft Edge trong Windows 10, hệ thống trở nên quá chậm hoặc bị đóng băng vào những thời điểm ngẫu nhiên. Nếu bạn đang gặp phải vấn đề tương tự, hãy tiếp tục đọc phần dưới đây để gỡ cài đặt phiên bản Edge Chromium khỏi PC của bạn. * </p> <p> * Lưu ý: Nếu phiên bản Chromium của Microsoft Edge chưa được cài đặt trên hệ thống của bạn, hãy đọc hướng dẫn về điều này <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> bài báo </a> để ngăn Microsoft Edge tự động cài đặt. </p> <p><img src=\"images/image_thumb-38-388.png\" alt=\"Remove Edge Chromium in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> Phiên bản mới dựa trên Chromium của trình duyệt Microsoft Edge, được cài đặt tự động với <a href=\"https://support.microsoft.com/en-us/help/4559309/update-for-the-new-microsoft-edge-for-windows-10-version-1803-to-2004\" target=\"_blank\" rel=\"nofollow noopener\"> KB4559309 </a> cập nhật. Khi điều này xảy ra, bạn không thể xóa Microsoft Edge khỏi <strong> Khởi đầu </strong> thực đơn <img src=\"images/image_thumb2_thumb_thumb-565.png\" alt=\"image_thumb[2]_thumb\" loading=\"lazy\"> -&gt; <strong> Cài đặt </strong><img src=\"images/image_thumb-66-219.png\" alt=\"image\" loading=\"lazy\"> -&gt; <strong> Ứng dụng </strong> -&gt; <strong> Ứng dụng &amp; Tính năng </strong> tùy chọn, bởi vì <strong> Gỡ cài đặt </strong> tùy chọn chuyển sang màu xám. Để vượt qua hạn chế này, hãy áp dụng các bước bên dưới. </p> <p><img src=\"images/image_thumb-39-654.png\" alt=\"How to Uninstall Edge Chromium version in Windows 10\" loading=\"lazy\"></p> <p> </p> <h4> Cách xóa Edge Chromium khỏi Windows 10. </h4> <p> Để gỡ cài đặt Edge dựa trên Chromium mới trong Windows 10: </p> <p> 1. Điều hướng đến thư mục sau trên PC của bạn: * </p> <ul> <li> C: \\ Program Files (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </li> </ul> <p> * Lưu ý: Tên thư mục &quot;85.0.564.41&quot; cho biết phiên bản đã cài đặt của phiên bản Chromium mới và có thể khác ở PC của bạn. </p> <p> 2. Chọn đường dẫn thư mục trong thanh địa chỉ và nhấp chuột phải vào&gt; <strong> Sao chép. </strong></p> <p><img src=\"images/image_thumb35_thumb-738.png\" alt=\"image_thumb[35]\" loading=\"lazy\"></p> <p> </p> <p> 3. Mở <strong> Command Prompt với tư cách là quản trị viên, </strong> kiểu <strong> CD </strong> và sau đó nhấn <strong> CTRL + V </strong> để dán vào đường dẫn thư mục đã sao chép. Khi hoàn tất, nhấn <strong> Đi vào </strong> . * </p> <p> * ví dụ: Ở ví dụ hiện tại, lệnh sẽ là: </p> <p><em> cd C: \\ Program Files (x86) \\ Microsoft \\ Edge \\ Application \\ 85.0.564.41 \\ Installer </em></p> <p><img src=\"images/image_thumb39_thumb-252.png\" alt=\"Uninstall Edge Chromium\" loading=\"lazy\"></p> <p> </p> <p> 4. Bây giờ, đưa lệnh dưới đây (Sao chép / Dán) trong dấu nhắc lệnh để xóa phiên bản Chromium của trình duyệt Microsoft Edge khỏi PC của bạn. </p> <ul> <li> setup.exe –uninstall –system-level –verbose-logging –force-uninstall </li> </ul> <p><img src=\"images/image_thumb47_thumb-506.png\" alt=\"Uninstall Edge Chromium command\" loading=\"lazy\"></p> <p> 5. Sau khi lệnh trên được thực thi, phiên bản EDGE cũ sẽ được kích hoạt trở lại. Khởi động lại PC của bạn để áp dụng các thay đổi. <br> 6. Sau khi khởi động lại, hãy tiến hành cài đặt thủ công <a href=\"https://www.microsoft.com/en-us/edge\" target=\"_blank\" rel=\"nofollow noopener\"> trình duyệt Edge dựa trên Chromium mới </a> trên PC của bạn, để tránh việc phân phối tự động hoặc ngăn quá trình cài đặt Edge Chromium trong tương lai, bằng cách sử dụng các hướng dẫn trong bài viết này: <a href=\"https://www.repairwin.com/how-to-prevent-edge-chromium-to-be-installed-automatically-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách ngăn Edge Chromium được cài đặt tự động trong Windows 10. </a></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}