{"title":"Cách bảo vệ thư mục bằng mật khẩu trong Windows 10 (Khóa thư mục bằng mật khẩu).","content":"<p> Hướng dẫn này chứa hai phương pháp miễn phí và an toàn khác nhau để bảo vệ mật khẩu một thư mục trong HĐH Windows 10/8/7. Nếu bạn khóa một thư mục bằng mật khẩu, thì bất kỳ ai khác ngoài bạn sẽ không thể truy cập được. Bảo vệ thư mục bằng mật khẩu rất hữu ích trong trường hợp bạn chia sẻ máy tính của mình với người khác và bạn không muốn người khác truy cập và đọc các tệp riêng tư của mình. </p> <ul> <li><strong> Bài viết liên quan: <a href=\"https://www.repairwin.com/how-to-protect-your-pc-with-bitlocker-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách đặt mật khẩu Bảo vệ PC chạy Windows 10 của bạn bằng BitLocker </a> . </strong></li> </ul> <h4> Cách khóa thư mục bằng mật khẩu trong Windows 10. </h4> <h6> Phương pháp 1. Cách Khóa và Mã hóa Tập tin bằng 7-zip (Windows Tất cả các phiên bản). </h6> <p> Phương pháp dễ nhất và an toàn nhất, để bảo vệ thư mục bằng mật khẩu trong Windows, là sử dụng tiện ích lưu trữ 7-Zip, tiện ích cũng hỗ trợ mã hóa. Để mã hóa và bảo vệ mật khẩu một thư mục / tệp với 7-zip: </p> <p> 1. Tải xuống và cài đặt <a href=\"https://www.7-zip.org/\" target=\"_blank\" rel=\"nofollow noopener\"> 7-Zip </a> chương trình lưu trữ. <br> 2. Nhấp chuột phải vào thư mục (hoặc tệp) mà bạn muốn bảo vệ bằng mật khẩu và chọn: <strong> 7-Zip </strong> &gt; <strong> Thêm vào lưu trữ </strong> . </p> <p><img src=\"images/image_thumb-28-978.png\" alt=\"How to Password Protect a Folder\" loading=\"lazy\"></p> <p> </p> <p> 3. Tại tùy chọn &#39;Thêm vào kho lưu trữ&#39;, chỉ định một mật khẩu mạnh và sau đó nhấp vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-29-728.png\" alt=\"set password to archive with 7-zip\" loading=\"lazy\"></p> <p> </p> <p> 4. Sau đó xóa thư mục (hoặc tệp) chưa nén và bạn đã hoàn thành! </p> <h6> Phương pháp 2. Cách mã hóa một thư mục với EFS Protection (Windows Pro &amp; Enterprise). </h6> <p> EFS Protection là một công cụ mã hóa được tích hợp sẵn trong các phiên bản Windows 10 Professional và Enterprise. Nếu bạn bảo vệ một thư mục hoặc một tệp bằng mã hóa EFS thì rất khó để người khác có thể truy cập vào các tệp được mã hóa mà không có khóa giải mã (khóa PFX chứng chỉ). </p> <p> Nhược điểm duy nhất của mã hóa EFS là mã hóa sẽ bị loại bỏ nếu bạn sao chép các tệp được mã hóa trên một máy tính mạng khác hoặc nếu bạn gửi các tệp được mã hóa qua email. </p> <p> Ngoài ra, khi bạn mã hóa các tệp EFS của mình, khóa giải mã (chứng chỉ) sẽ được lưu trữ cục bộ trên máy tính của bạn. Điều này có nghĩa là bất kỳ ai có mật khẩu của bạn cũng sẽ có quyền truy cập vào các tệp được mã hóa của bạn. Vì lý do đó, nếu bạn mã hóa tệp của mình bằng mã hóa EFS, hãy chỉ định mật khẩu đăng nhập mạnh và không chia sẻ mật khẩu đó với người khác. </p> <ul> <li><strong> Bài viết liên quan: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"nofollow noopener\"> Cách giải mã tệp được mã hóa EFS và loại bỏ mã hóa EFS. </a></strong></li> </ul> <p><strong> Để mã hóa một thư mục hoặc tệp bằng EFS: </strong><br> 1. Nhấp chuột phải vào thư mục (hoặc tệp) mà bạn muốn bảo vệ và chọn <strong> Tính chất </strong> . <br> 2. Tại tab Chung, nhấp vào <strong> Nâng cao </strong> . </p> <p><img src=\"images/image_thumb-13-582.png\" alt=\"enable efs protection\" loading=\"lazy\"></p> <p> </p> <p> 3. Chọn <strong> Mã hóa tệp để bảo mật dữ liệu </strong> và sau đó nhấp vào <strong> ĐỒNG Ý. </strong></p> <p><img src=\"images/image_thumb-14-983.png\" alt=\"How to Lock Folder with Password - Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Sau đó nhấp vào <strong> Ứng dụng </strong> và <strong> đồng ý </strong> một lần nữa để lưu các thay đổi và thoát. <br> 5. Lúc này Windows sẽ nhắc bạn sao lưu khóa khôi phục. Nhấp chuột <strong> Sao lưu khóa mã hóa tệp của bạn. </strong></p> <p><img src=\"images/image_thumb-2-823.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Sau đó nhấp vào <strong> Sao lưu ngay bây giờ (khuyến nghị) </strong> và lưu khóa chứng chỉ giải mã vào ổ USB. </p> <p><img src=\"images/image_thumb-15-164.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Tại trình hướng dẫn Xuất chứng chỉ, hãy nhấp vào <strong> Kế tiếp </strong> tại màn hình Chào mừng. <br> 8. Sau đó nhấp vào <strong> Kế tiếp </strong> lại ở màn hình Export File Format. </p> <p><img src=\"images/image_thumb-4-842.png\" alt=\"image\" loading=\"lazy\"></p> <p> 9. Tại tùy chọn Bảo mật: </p> <blockquote> <p> 1. <strong> Kiểm tra </strong> các <strong> Mật khẩu </strong> cái hộp. <br> 2. Nhập mật khẩu cho khóa chứng chỉ đã xuất. <br> 3. Chọn <strong> AES256-SHA256 </strong> mã hóa <br> 4. Nhấp vào <strong> Kế tiếp </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-16-327.png\" alt=\"image\" loading=\"lazy\"></p> <p> 10. Nhấp vào <strong> Duyệt qua </strong> và <strong> Tiết kiệm </strong> tệp chứng chỉ (.pfx) trên máy tính của bạn. <br> 11. Khi hoàn tất, hãy nhấp vào <strong> Kế tiếp </strong> để tiếp tục. </p> <p><img src=\"images/image_thumb-17-804.png\" alt=\"image\" loading=\"lazy\"></p> <p> 12. Cuối cùng bấm <strong> Hoàn thành </strong> . </p> <p><img src=\"images/image_thumb-18-449.png\" alt=\"image\" loading=\"lazy\"></p> <p> 13. Khi quá trình xuất hoàn tất, hãy lưu khóa chứng chỉ đã xuất (tệp .pfx) vào một vị trí an toàn khác (ví dụ: vào đĩa USB). </p> <p><strong> TIỀN BOA: </strong> Khi bạn mã hóa một thư mục (hoặc các tệp) bằng EFS, khóa giải mã (chứng chỉ) được lưu trữ trên thư mục hồ sơ người dùng của bạn. Vì vậy, nếu người dùng khác có mật khẩu đăng nhập Windows của bạn, nó có thể mở và đọc các tệp được mã hóa. Để tránh điều này xảy ra, không chia sẻ mật khẩu đăng nhập của bạn hoặc xóa (gỡ cài đặt) chứng chỉ giải mã khỏi hồ sơ của bạn khi bạn rời khỏi PC và cài đặt lại khi bạn quay lại. * </p> <p> * Lưu ý: Để xóa và nhập lại khóa khôi phục (chứng chỉ), hãy truy cập: </p> <blockquote> <p> a. <strong> Bảng điều khiển </strong> &gt; <strong> Tùy chọn Internet. <br> </strong> b. Tại &#39;Internet Options&#39;, hãy nhấp vào <strong> Nội dung </strong> tab và sau đó nhấp vào <strong> Chứng chỉ </strong> S. <br> c. Tại tab &#39;Cá nhân&#39;, hãy nhấp vào <strong> Tẩy </strong> để xóa khóa giải mã (chứng chỉ) hoặc nhấp vào <strong> Nhập khẩu </strong> để cài đặt lại chứng chỉ giải mã từ ổ USB. </p> </blockquote> <ul> <li> <p><strong> Bài viết liên quan: <a href=\"https://www.repairwin.com/how-to-decrypt-efs-encrypted-files-and-remove-efs-encryption-in-windows-10\" target=\"_blank\" rel=\"noopener noreferrer\"> Cách giải mã tệp được mã hóa EFS và loại bỏ mã hóa EFS. </a></strong></p> </li> </ul> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này </p>"}