{"title":"Cách Đặt lại Cài đặt Photoshop về Mặc định.","content":"<p> Nếu chương trình Photoshop hoạt động lạ, thì cách nhanh nhất để khắc phục sự cố là đặt lại cài đặt của Photoshop về mặc định. Trong hướng dẫn này, bạn sẽ tìm thấy hướng dẫn chi tiết về cách đặt lại Tùy chọn Photoshop về mặc định của chúng. </p> <p> Trong chương trình Adobe Photoshop, tất cả các tùy chỉnh (tùy chọn hiển thị, tùy chọn hiệu suất, tùy chọn độ trong suốt, tùy chọn con trỏ, v.v.) được lưu trong tệp &quot;Tùy chọn Adobe Photoshop&quot; khi thoát ứng dụng. Nếu tệp Preferences bị hỏng, thì chương trình Photoshop sẽ hoạt động kỳ lạ và sau đó cách duy nhất để khắc phục (các) vấn đề là khôi phục cài đặt tùy chọn về giá trị mặc định của chúng. </p> <h4> Làm thế nào để Đặt lại Tùy chọn Photoshop về Mặc định. * </h4> <p> * Lưu ý: Các phương pháp trên sẽ đặt lại tất cả các cài đặt tùy chọn về mặc định. Nếu bạn muốn đặt lại một công cụ cụ thể hoặc tất cả các công cụ Photoshop, hãy áp dụng các hành động sau: </p> <blockquote><p> 1. Từ menu của Photoshop, hãy nhấp vào <strong> các cửa sổ </strong> và sau đó chọn <strong> Tùy chọn </strong> mục. <br> 2. Sau đó chọn công cụ mà bạn muốn đặt lại từ Hộp công cụ. <br> 3. Bây giờ nhấp chuột phải vào công cụ ở bên trái của thanh Tùy chọn và chọn <strong> Đặt lại công cụ </strong> hoặc là <strong> Đặt lại tất cả các công cụ. </strong></p></blockquote> <p><img src=\"images/image_thumb-25-673.png\" alt=\"reset tools photoshop\" loading=\"lazy\"></p> <h6></h6> <h6> Phương pháp 1. Đặt lại Tùy chọn tại Khởi động Photoshop. </h6> <p> Phương pháp đầu tiên để đặt lại cài đặt trong Photoshop là sử dụng phím tắt sau khi khởi chạy Photoshop. Để làm việc đó: </p> <p> 1. <strong> Thoát </strong> Photoshop. <br> 2. <strong> Nhấn đúp chuột </strong> trên biểu tượng Photoshop và ngay lập tức <strong> giữ lại </strong> các <strong> Ctrl + Alt + Shift </strong> phím (trong Windows) hoặc <strong> Command + Option + Shift </strong> (trong Mac OS). <br> 3. Khi được yêu cầu <strong> &quot;Xóa tệp Cài đặt Adobe Photoshop?&quot; </strong> nhấp chuột <strong> Đúng. </strong></p> <p><img src=\"images/image_thumb-24-561.png\" alt=\"delete photoshop settings\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Phương pháp 2. Đặt lại Preferences từ menu của Photoshop. </h6> <p> 1. Khởi chạy Photoshop. <br> 2. Từ <strong> Biên tập </strong> menu, chọn <strong> Sở thích </strong> -&gt; <strong> Chung <br> </strong> 3. Nhấp vào <strong> Đặt lại Tùy chọn trên Thoát. </strong></p> <p><img src=\"images/image_thumb-21-842.png\" alt=\"Reset Adobe Photoshop Preferences on Quit\" loading=\"lazy\"></p> <p> </p> <p> 4. Nhấp vào <strong> đồng ý </strong> khi được yêu cầu đặt lại các tùy chọn khi thoát khỏi Photoshop. </p> <p><img src=\"images/image_thumb-22-194.png\" alt=\"Reset Photoshop Settings on Quit\" loading=\"lazy\"></p> <p> </p> <p> 5. Nhấp vào <strong> đồng ý </strong> một lần nữa để đóng hộp thoại Tùy chọn. <br> 6. Đóng và khởi chạy lại Photoshop. </p> <p> </p> <h6> Phương pháp 3. Xóa hoặc đổi tên tệp Cài đặt Adobe Photoshop. </h6> <p> Phương pháp cuối cùng để đặt lại tùy chọn Photoshop về mặc định, là đổi tên hoặc xóa tệp Cài đặt Photoshop (Adobe Photoshop% Version% Prefs.psp), tại vị trí sau trên PC của bạn: * </p> <ul> <li> C: \\ Users \\% Username% \\ AppData \\ Roaming \\ Adobe \\ Adobe Photoshop% Version% \\ Adobe Photoshop% Version% Settings \\ <strong> Adobe Photoshop% Phiên bản% Prefs.psp </strong></li> </ul> <p> * Lưu ý: Trong MAC OS, điều hướng đến: </p> <ul> <li> Người dùng \\% Tên người dùng% \\ Thư viện \\ Tùy chọn \\ Adobe Photoshop% Phiên bản% Cài đặt \\ <strong> Adobe Photoshop% Phiên bản% Prefs.psp </strong></li> </ul> <p> Để xóa Adobe Preferences trong HĐH Windows 10, 8, 7: </p> <p> 1. <strong> Thoát </strong> Photoshop. <br> 2. Điều hướng đến thư mục &quot;C: \\ Users \\% Username% \\ AppData \\ Roaming \\&quot;. Để làm việc đó: </p> <blockquote><p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-455.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Trong hộp Tìm kiếm, nhập: <strong> %dữ liệu chương trình% </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p></blockquote> <p><img src=\"images/image_thumb-66-926.png\" alt=\"Delete Photoshop Preferences file\" loading=\"lazy\"></p> <p> </p> <p> 4. Sau đó điều hướng đến thư mục &quot;… \\ Adobe \\ Adobe Photoshop% Version% \\ Adobe Photoshop% Version% Settings \\&quot;. <br> 5. <strong> Xóa bỏ </strong> hoặc là <strong> đổi tên </strong> tệp &quot;Adobe Photoshop% Version% Prefs.psp&quot; sang Adobe Photoshop% Version% Prefs.OLD &quot;* </p> <p> * Lưu ý: Nếu bạn sở hữu Photoshop 64-bit, hãy đổi tên hoặc xóa tệp &quot;Adobe Photoshop X64% version% Prefs.psp&quot;. </p> <p><img src=\"images/image_thumb-23-438.png\" alt=\"Re-create Photoshop Settings File\" loading=\"lazy\"></p> <p> </p> <p> 6. Khởi chạy Photoshop. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}