{"title":"Cách điều khiển chuột bằng bàn phím trong Windows 10/8/7.","content":"<p> Hướng dẫn này bao gồm các hướng dẫn về cách điều khiển chuột bằng bàn phím, bằng cách sử dụng tính năng &#39;Phím Chuột &quot;trong Windows. Bài viết có thể hữu ích cho những người không thể sử dụng chuột hoặc trong trường hợp chuột ngừng hoạt động (hoặc không tồn tại) và bạn muốn sử dụng bàn phím của mình như một con chuột. để làm việc với máy tính để hoàn thành công việc khẩn cấp. </p> <p> Các <strong> Phím chuột </strong> tính năng này được tích hợp trong hệ điều hành Windows 10, 7 hoặc 7 và cho phép bạn sử dụng bàn phím số để di chuyển con trỏ chuột trên màn hình và thực hiện tất cả các thao tác thông thường của chuột (nhấp chuột, nhấp đúp, nhấp chuột phải). </p> <h4> Cách sử dụng bàn phím làm chuột. </h4> <h6> Phương pháp 1. Bật Phím chuột bằng cách sử dụng Phím tắt. * </h6> <p> Phương pháp đầu tiên để di chuyển con trỏ chuột [không có chuột <img src=\"images/wlemoticon-openmouthedsmile-273.png\" alt=\"Open-mouthed smile\" loading=\"lazy\"> ], là bật Phím chuột bằng cách sử dụng cách sau: </p> <p> 1. Nhấn <strong> phím Alt trái </strong> + <strong> dịch trái </strong> + <strong> Num Lock </strong></p> <p><img src=\"images/image_thumb-10-220.png\" alt=\"How to Control Mouse with Keyboard \" loading=\"lazy\"></p> <p> </p> <p> 2. Khi cửa sổ Phím Chuột xuất hiện trên màn hình, hãy nhấn <strong> ĐI VÀO </strong> để bật MouseKeys. </p> <p><img src=\"images/image_thumb-2-595.png\" alt=\"turn on mouse keys\" loading=\"lazy\"></p> <p> 3. Sau khi bật Phím Chuột, bạn có thể sử dụng bàn phím (bàn phím số) để thực hiện tất cả các thao tác chuột (di chuyển, nhấp chuột, nhấp chuột phải, nhấp đúp) như trong hình bên dưới. * </p> <p> * Lưu ý: Nếu bạn muốn tăng hoặc giảm tốc độ con trỏ, hãy đọc hướng dẫn trong phương pháp tiếp theo. </p> <p><strong> Các chức năng chuột từ Bàn phím số </strong></p> <p><img src=\"images/image_thumb-8-332.png\" alt=\"mouse functions numeric keypas\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Phương pháp 2. Bật Phím Chuột từ Trung tâm Dễ Truy cập. </h6> <p> Phương pháp thứ hai để có thể điều khiển con trỏ chuột bằng bàn phím của bạn, là bật và định cấu hình tính năng &#39;Phím Chuột&#39; từ trung tâm Ease Access. Để làm việc đó: </p> <p> 1. Điều hướng đến Bảng điều khiển Windows, đặt &#39;Xem theo&#39; thành <strong> Biểu tượng nhỏ </strong> và sau đó mở <strong> Dễ dàng truy cập trung tâm. </strong></p> <p><img src=\"images/image_thumb-3-309.png\" alt=\"use keyboard as mouse\" loading=\"lazy\"></p> <p> </p> <p> 2. Nhấp vào <strong> Làm cho chuột dễ sử dụng hơn. </strong></p> <p><img src=\"images/image_thumb-4-518.png\" alt=\"enable mouse keys - ease of access\" loading=\"lazy\"></p> <p> </p> <p> 3. Sau đó nhấp vào <strong> Thiết lập các phím chuột </strong> . </p> <p><img src=\"images/image_thumb-9-206.png\" alt=\"Configure Pointer Speed \" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Bây giờ, hãy kiểm tra <strong> Bật phím chuột </strong> hộp và nhấp vào <strong> Ứng dụng. </strong><br> <strong> 5. </strong> Bây giờ, hãy thử di chuyển con trỏ chuột bằng cách sử dụng bàn phím số và định cấu hình <strong> Tốc độ con trỏ </strong> Như bạn ước. (Nhấp vào &#39;Áp dụng&#39; ở mọi thay đổi và &#39;OK&#39; để đóng các tùy chọn &#39;Phím Chuột &quot;.) </p> <p><img src=\"images/image_thumb-7-340.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}