{"title":"Cách chia sẻ tệp và thư mục trong hệ điều hành Windows 10, 8.1 hoặc 7.","content":"<p> Tính năng Chia sẻ Tệp trong Windows, cung cấp cho bạn khả năng dễ dàng chia sẻ các thư mục và tệp giữa những người dùng trên mạng của bạn. Bằng cách chia sẻ tệp của bạn với những người dùng khác trên cùng một mạng, bạn sẽ có thể xem và làm việc với các tệp / thư mục giống nhau. </p> <p> Hướng dẫn này bao gồm các hướng dẫn về cách chia sẻ thư mục và / hoặc tệp trong Hệ điều hành Windows 10, 8, 8.1 hoặc 7. </p> <h4> Cách Bật Chia sẻ Tệp trong Windows. </h4> <h5> Bước 1. Thêm Người dùng Bắt buộc vào PC của bạn. </h5> <p> Trước khi bạn tiếp tục chia sẻ tệp của mình với người khác, hãy thêm những người dùng sẽ có quyền truy cập vào thư mục được chia sẻ trên máy tính. Để thực hiện tác vụ đó, hãy làm theo hướng dẫn trong các bài viết sau, theo phiên bản Windows của bạn. </p> <ul> <li><a href=\"https://www.repairwin.com/how-to-create-a-new-user-in-windows-7\" target=\"_blank\" rel=\"nofollow noopener\"> Cách thêm người dùng mới trong Windows 7. </a></li> <li><a href=\"https://www.repairwin.com/how-to-add-a-new-user-account-in-windows-10-8/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách thêm người dùng mới trong Windows 10 / 8.1 </a></li> </ul> <p> </p> <h5> Bước 2. Cách Chia sẻ Thư mục hoặc Tệp với Người khác. </h5> <p> 1. Nhấp chuột phải vào thư mục (hoặc tệp) mà bạn muốn chia sẻ và chọn <strong> Cấp quyền truy cập cho </strong> -&gt; <strong> Những người cụ thể. </strong></p> <p><img src=\"images/image_thumb-56-411.png\" alt=\"How to Share Files and Folders in Windows 10, 8.1, 7\" loading=\"lazy\"></p> <p> </p> <p> 2. Bằng cách sử dụng menu thả xuống, hãy chọn người dùng mà bạn muốn chia sẻ tệp của mình và sau đó nhấp vào <strong> Thêm vào </strong> . </p> <p><img src=\"images/image_thumb-57-274.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Bây giờ hãy nhấp vào mũi tên xuống, bên cạnh người dùng bạn đã thêm và chỉ định quyền truy cập của người đó (Mức độ quyền) </p> <p><img src=\"images/image_thumb-58-517.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Khi hoàn tất, nhấn nút <strong> Chia sẻ </strong> cái nút, </p> <p><img src=\"images/image_thumb-59-431.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Lưu ý liên kết nhất định đến thư mục được chia sẻ * và nhấp vào <strong> Làm xong </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-60-378.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Tại thời điểm này, bạn đã kích hoạt tính năng chia sẻ tập tin trên máy tính của mình. Để truy cập thư mục được chia sẻ từ một PC khác: </p> <blockquote><p> a. Trên thanh địa chỉ của Explorer, nhập liên kết đến thư mục được chia sẻ, như được hiển thị ở bước trước. (ví dụ: &quot;\\\\ DESKTOP-HMG31RD \\ 2Share&quot; không có dấu ngoặc kép) <br> b. nhấn <strong> Đi vào </strong> . <br> c. Nhập tên người dùng và mật khẩu của người dùng mà bạn đã cấp quyền truy cập và nhấn <strong> đồng ý </strong> . </p></blockquote> <p><img src=\"images/image_thumb-61-512.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Thông tin bổ sung: <br> 1.Để thay đổi quyền của người dùng, chỉ cần thực hiện lại quy trình trên và thay đổi Cấp độ quyền của người dùng. <br> 2. Nếu bạn muốn dừng chia sẻ tệp, hãy nhấp chuột phải vào thư mục / tệp được chia sẻ và đi tới <strong> Cấp quyền truy cập cho </strong> -&gt; và chọn <strong> Xóa quyền truy cập </strong> . </p> <p><img src=\"images/image_thumb-62-886.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trong các mạng xã hội để giúp lan truyền về vấn đề này. </p>"}