{"title":"Cách tắt Bitlocker trong Windows Recovery Environment (WinRE).","content":"<p> Hướng dẫn này bao gồm các hướng dẫn về cách tắt tính năng bảo vệ BitLocker và giải mã ổ đĩa được mã hóa BitLocker trong Môi trường Khôi phục Windows. Các hướng dẫn có thể hữu ích, nếu máy tính của bạn được bảo vệ bởi BitLocker và không chấp nhận khóa khôi phục Bitlocker hoặc mật khẩu BitLocker khi khởi động hệ thống và bạn không thể mở khóa ổ đĩa được bảo vệ bởi BitLocker. </p> <p><img src=\"images/image_thumb-52-511.png\" alt=\"Remove Bitlocker from Windows Recovery Environment \" loading=\"lazy\"></p> <h4></h4> <h4> Cách xóa Bảo vệ BitLocker &amp; Giải mã Ổ đĩa được mã hóa BitLocker trong Môi trường Khôi phục Windows (WinRE). </h4> <p><strong> Yêu cầu: </strong><br> <strong> A </strong> . <strong> Phương tiện cài đặt Windows 10 (USB hoặc DVD). </strong> Nếu bạn không sở hữu Phương tiện cài đặt Windows thì bạn có thể tạo một Phương tiện cài đặt bằng cách sử dụng <a href=\"https://www.microsoft.com/software-download/\" target=\"_blank\" rel=\"nofollow noopener\"> Công cụ tạo phương tiện của Microsoft </a> . </p> <ul> <li><a href=\"https://www.repairwin.com/create-windows-10-usb-installation-media/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách tạo phương tiện cài đặt Windows 10 USB. </a></li> <li><a href=\"https://www.repairwin.com/download-create-windows-10-installation-dvd/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách tạo phương tiện cài đặt Windows 10 DVD. </a></li> </ul> <p><strong> B. Khóa khôi phục BitLocker hoặc Mật khẩu BitLocker: </strong> Để tắt tính năng bảo vệ Bitlocker, bạn phải có mật khẩu Bitlocker hoặc Khóa khôi phục Bitlocker để mở khóa ổ đĩa trước rồi mới giải mã ổ đĩa. * </p> <p> * Lưu ý: Nếu bạn không có khóa khôi phục BitLocker, không có cách nào để vượt qua bảo vệ BitLocker. Nếu một đĩa được bảo vệ bởi BitLocker và bạn không có Khóa khôi phục BitLocker hoặc mật khẩu để mở khóa ổ đĩa, thì tùy chọn duy nhất bạn có (để sử dụng lại ổ đĩa) là xóa hoàn toàn ổ đĩa bằng cách sử dụng hướng dẫn trong bài viết này: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách xóa bảo vệ BitLocker khỏi ổ mà không cần mật khẩu hoặc khóa khôi phục BitLocker. </a></p> <p> Khóa khôi phục Bitlocker là một số gồm 48 chữ số và có thể được tìm thấy ở các vị trí sau: </p> <ul> <li> Trên bản in bạn đã lưu, khi bạn bật Bitlocker. </li> <li> Trên ổ USB bạn đã sử dụng, trong quá trình kích hoạt Bitlocker để lưu khóa khôi phục Bitlocker. </li> <li> Tại <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Khóa khôi phục tài khoản Microsoft </a> , bằng cách sử dụng tài khoản MS bạn đang sử dụng để đăng nhập vào thiết bị của mình hoặc bạn đã thêm vào thiết bị để tải xuống ứng dụng từ Microsoft Store hoặc để kích hoạt MS Office hoặc email. </li> <li> Về bạn <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Tài khoản Azure </a> cho PC công việc đăng nhập bằng tài khoản Azure Active Directory. </li> </ul> <p> Sau khi bạn tìm thấy khóa khôi phục BitLocker hoặc mật khẩu ΒitLocker, hãy tiến hành mở khóa ổ đĩa được mã hóa Bitlocker và xóa mã hóa Bitlocker trong WinRE bằng cách làm theo hướng dẫn bên dưới. </p> <p> Để mở khóa và giải mã ổ C: của hệ điều hành từ WinRE: </p> <p> 1. Khởi động hệ thống của bạn từ phương tiện cài đặt Windows 10. <br> 2. Ở màn hình bên dưới, nhấn nút <strong> SHIFT </strong> + <strong> F10 </strong> phím để khởi chạy dấu nhắc lệnh. (hoặc nhấn <strong> Kế tiếp </strong> &gt; <strong> Sửa chữa máy tính của tôi </strong> &gt; <strong> Khắc phục sự cố </strong> &gt; <strong> Dấu nhắc lệnh </strong> ). * </p> <p> * Lưu ý: Nếu bạn được nhắc nhập khóa khôi phục, hãy nhấp vào <strong> BỎ QUA ổ đĩa này </strong> . </p> <p><img src=\"images/image_thumb15_thumb-548.png\" alt=\"How to disable-unlock bitlocker from Windows Recovery Environment (WinRE)\" loading=\"lazy\"></p> <p> </p> <p> 3. Tại dấu nhắc lệnh, gõ lệnh sau để xem ký tự ổ đĩa của ổ đĩa được mã hóa: </p> <ul> <li><strong> quản lý-bde -status </strong></li> </ul> <p> </p> <p> 4. Sau đó, tiến hành mở khóa ổ đĩa được mã hóa bằng cách sử dụng lệnh sau, tùy theo trường hợp của bạn: </p> <p><strong> Trường hợp A. </strong> Nếu bạn biết khóa khôi phục BitLocker, hãy đưa ra lệnh sau: </p> <ul> <li><strong> management-bde -unlock drive-letter: -rp BitLocker-recovery-key </strong></li> </ul> <p> * ví dụ: Nếu bạn muốn mở khóa ổ đĩa &quot;D:&quot; và khóa khôi phục bitlocker là: &quot;123456-123456-123456-123456-123456-123456&quot; thì hãy nhập: </p> <ul> <li> <ul> <li> quản lý-bde -unlock <strong> D </strong> : -rp <strong> 123456-123456-123456-123456-123456-123456 </strong></li> </ul> </li> </ul> <p> </p> <p><strong> Trường hợp B. </strong> Nếu bạn biết mật khẩu BitLocker để mở khóa ổ đĩa, hãy đưa ra lệnh sau: </p> <ul> <li><strong> management-bde -unlock drive-letter: -pw BitLocker-Password </strong></li> </ul> <p> * ví dụ: Nếu bạn muốn mở khóa ổ đĩa &quot;D:&quot; và mật khẩu BitLocker là: &quot;123qwerty&quot; thì hãy nhập: * </p> <ul> <li> <ul> <li> quản lý-bde -unlock <strong> D </strong> : -mật khẩu <strong> 123qwerty </strong></li> </ul> </li> </ul> <p> </p> <p> 5. Sau đó tiến hành giải mã ổ đĩa và tắt chế độ bảo vệ BitLocker bằng lệnh này: </p> <ul> <li><strong> management-bde -off drive-letter: </strong></li> </ul> <p> * ví dụ: Nếu bạn muốn giải mã ổ đĩa &quot;D:&quot;, hãy nhập: </p> <ul> <li> <ul> <li> quản lý-bde –off <strong> D </strong> : </li> </ul> </li> </ul> <p> 6. Quá trình giải mã bắt đầu. Để kiểm tra lại trạng thái giải mã, hãy nhập lệnh sau và đảm bảo rằng ổ đĩa <strong> Được giải mã đầy đủ </strong> và <strong> Đã mở khóa </strong> : </p> <ul> <li><strong> quản lý-bde -status </strong></li> </ul> <p><img src=\"images/image_thumb9_thumb-678.png\" alt=\"decrypt bitlocker encrypted drive windows removery environment\" loading=\"lazy\"></p> <p> </p> <p> 7. Khi bạn hoàn tất, hãy gỡ bỏ phương tiện cài đặt Windows và khởi động lại máy tính. * </p> <p> * Lưu ý: Nếu Windows không thể khởi động, hãy gắn ổ đĩa vào máy tính khác và sao lưu dữ liệu cá nhân của bạn sang phương tiện khác. Sau đó <a href=\"https://www.repairwin.com/best-hard-drive-test-diagnostic-tools-to-check-hard-disks-health/\" target=\"_blank\" rel=\"nofollow noopener\"> chẩn đoán ổ đĩa cho các vấn đề </a> và nếu nó ổn, hãy đặt đĩa trở lại máy tính và thực hiện <a href=\"https://www.repairwin.com/clean-install-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> dọn dẹp cài đặt Windows 10 </a> . </p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trong các mạng xã hội để giúp lan truyền về vấn đề này. </p>"}