{"title":"Cách chặn trang web trên Chrome hoặc Firefox.","content":"<p> Nếu bạn đang tìm kiếm một cách dễ dàng để chặn một trang web trên Chrome hoặc Firefox, hãy tiếp tục đọc phần bên dưới. </p> <p> Mặc dù Internet đối với hầu hết chúng ta đã trở nên cần thiết trong cuộc sống hàng ngày để làm việc hoặc giải trí, nhưng mặt khác, đôi khi rất hữu ích khi có thể chặn một số trang web để tránh bị phân tâm. Ví dụ, không ai muốn con mình bị phân tâm khi xem video trên YouTube khi chúng đọc bài. </p> <p> Trong hướng dẫn này, bạn sẽ học cách chặn các trang web trong Chrome và <a href=\"#firefox\" target=\"_blank\" rel=\"nofollow noopener\"> Firefox </a> các trình duyệt. </p> <p> * Lưu ý: Nếu bạn muốn chặn một trang web trong tất cả các trình duyệt, hãy đọc bài viết này: <a href=\"https://www.repairwin.com/block-youtube-on-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách chặn YouTube trên Windows 10. </a></p> <h2> Cách chặn trang web trên Google Chrome. </h2> <p> Cách đơn giản nhất để chặn một trang web trong Chrome là sử dụng tiện ích mở rộng BlockSite nổi tiếng. Việc cài đặt tiện ích bổ sung BlockSite tương tự như bất kỳ tiện ích mở rộng nào khác. </p> <p> 1. Điều hướng đến <a href=\"https://chrome.google.com/webstore/detail/blocksite-stay-focused-co/eiimnmioipafcokbfikbljfdeojpcgbh\" target=\"_blank\" rel=\"nofollow noopener\"> Phần mở rộng BlockSite </a> trong cửa hàng Chrome trực tuyến và nhấp vào <strong> Thêm vào Chrome </strong> cái nút. </p> <p><img src=\"images/image_thumb-4-439.png\" alt=\"how to block websites chrome\" loading=\"lazy\"></p> <p> 2. Khi được nhắc, hãy nhấp vào <strong> Thêm phần mở rộng </strong> . </p> <p><img src=\"images/image_thumb-5-782.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Khi quá trình cài đặt hoàn tất, hãy chuyển đến menu Chrome&gt; Công cụ khác&gt; Tiện ích mở rộng </p> <p><img src=\"images/image_thumb-6-830.png\" alt=\"chrome tools extensions\" loading=\"lazy\"></p> <p> 4. Tìm <strong> BlockSite </strong> phần mở rộng và nhấp chuột <strong> Chi tiết. </strong></p> <p><img src=\"images/image_thumb-7-415.png\" alt=\"Blocksite details\" loading=\"lazy\"></p> <p> 5. <strong> Mở </strong> các <strong> Tùy chọn tiện ích mở rộng </strong> . </p> <p><img src=\"images/image_thumb-8-135.png\" alt=\"How to Block sites chrome\" loading=\"lazy\"></p> <p> 6. Nhập tên của trang web mà bạn muốn chặn (ví dụ: <a href=\"http://www.youtube.com\" target=\"_blank\" rel=\"nofollow noopener\"> www.youtube.com </a> ) và nhấn biểu tượng dấu cộng (+) để thêm trang web vào danh sách các trang web bị chặn. </p> <p><img src=\"images/image_thumb-9-298.png\" alt=\"blocked sites chrome\" loading=\"lazy\"></p> <p> 7. Đó là nó! Từ bây giờ, khi bạn cố gắng truy cập trang web bị chặn, bạn sẽ được thông báo rằng trang web đó đã bị chặn với tiện ích mở rộng BlockSite. Để sửa đổi danh sách các trang web bị chặn, hãy nhấp vào <strong> Chỉnh sửa danh sách của bạn </strong> để thực hiện bất kỳ thay đổi nào bạn muốn hoặc xóa trang web bị chặn khỏi danh sách. </p> <p><img src=\"images/image_thumb-10-951.png\" alt=\"image\" loading=\"lazy\"></p> <h3> Cách đặt mật khẩu Bảo vệ các trang bị chặn trong phần mở rộng BlockSite. </h3> <p> Nếu bạn muốn ngăn người dùng bỏ chặn một trang web bị chặn: </p> <p> 1. Mở <strong> BlockSite </strong> các tùy chọn mở rộng. <br> 2. Điều hướng đến <strong> Mật khẩu bảo vệ </strong> cài đặt. <br> 3. <strong> Kích hoạt </strong> tùy chọn Bảo vệ <strong> các tùy chọn BlockSite ưa thích của bạn và trang tiện ích mở rộng Chrome có mật khẩu </strong> và sau đó nhập email và mật khẩu của bạn và nhấp vào <strong> Tiết kiệm. </strong></p> <p><img src=\"images/image_thumb-11-711.png\" alt=\"password protect blocked sites\" loading=\"lazy\"></p> <p> 4. BlockSite sẽ gửi cho bạn một email có liên kết để xác minh địa chỉ email của bạn. Sau khi xác minh email, bảo vệ mật khẩu sẽ hoạt động. </p> <h2> Cách chặn trang web trong Mozilla Firefox. </h2> <p> 1. Điều hướng đến <a href=\"https://addons.mozilla.org/en-US/firefox/addon/blocksite/\" target=\"_blank\" rel=\"nofollow noopener\"> Phần mở rộng BlockSite </a> trong tiện ích bổ sung của Firefox. <br> 2. Nhấp vào <strong> Thêm vào Firefox </strong> cái nút. </p> <p><img src=\"images/image_thumb-12-999.png\" alt=\"block websites firefox\" loading=\"lazy\"></p> <p> 2. Khi được nhắc cho phép cài đặt tiện ích mở rộng, hãy nhấp vào <strong> Thêm vào. </strong></p> <p><img src=\"images/image_thumb-13-588.png\" alt=\"Blocksite firefox\" loading=\"lazy\"></p> <p> 3. Khi quá trình cài đặt hoàn tất, hãy chọn xem bạn có muốn chặn các trang web trong cửa sổ Riêng tư (ẩn danh) hay không và nhấp vào <strong> Được chứ </strong> . </p> <p><img src=\"images/image_thumb-14-173.png\" alt=\"how to block site\" loading=\"lazy\"></p> <p> 4. Nếu bạn muốn ngăn phần mở rộng BlockSite đọc dữ liệu trên các trang web bạn truy cập, hãy nhấp vào Có thể là chữ cái. </p> <p><img src=\"images/image_thumb-15-652.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Bây giờ hãy nhấp vào biểu tượng BlockSite và <strong> Chỉnh sửa danh sách khối </strong> để chỉ định trang web nào bạn muốn chặn. </p> <p><img src=\"images/image_thumb-16-657.png\" alt=\"block sites firefox\" loading=\"lazy\"></p> <p> 6. Tại tab Block Sites, hãy nhập tên của trang web mà bạn muốn chặn (ví dụ: &quot;facebook.com&quot;) và sau đó thêm nó vào danh sách các trang web bị chặn. </p> <p><img src=\"images/image_thumb-17-817.png\" alt=\"How to block site Firefox\" loading=\"lazy\"></p> <p> 7. Khi bạn đã thêm các trang web bạn muốn chặn, hãy đóng cài đặt BlockSite và bạn đã hoàn tất. </p> <p> Ngoài chức năng chính, tiện ích mở rộng BlockSite còn có một số chức năng hữu ích khác như: </p> <ul> <li> <p><strong> Chế độ tập trung </strong> : Chặn các trang web trong một thời gian cụ thể (ví dụ: 25 phút) </p> </li> <li> <p><strong> Mật khẩu bảo vệ: </strong> Bảo vệ cài đặt BlockSite của bạn khỏi bị sửa đổi. </p> </li> <li> <p><strong> Chặn bằng từ: </strong> Chặn các URL chứa các từ cụ thể. </p> </li> </ul> <p> Đó là tất cả mọi người! Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng trên blog này trên các mạng xã hội để giúp phổ biến rộng rãi về giải pháp này. </p>"}