{"title":"Cách bật Bảo vệ Khôi phục Hệ thống trong Hệ điều hành Windows 10/8/7.","content":"<p> Hướng dẫn này bao gồm các hướng dẫn về cách bật Bảo vệ Hệ thống trên HĐH Windows 10, 8 &amp; 7. Bảo vệ Khôi phục Hệ thống (thường được gọi là &#39;Bảo vệ Hệ thống&#39;) là một tính năng của Windows cho phép bạn <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> khôi phục lại </a> hệ thống của bạn về thời điểm sớm hơn, nếu Windows không hoạt động bình thường sau một thay đổi đáng kể trên các tệp hệ thống (ví dụ: sau khi cập nhật Windows hoặc sau cuộc tấn công của vi-rút.) </p> <p> Công cụ Khôi phục Hệ thống, sử dụng dịch vụ Volume Shadow Copy để chụp nhanh tệp hệ thống Windows và sổ đăng ký và lưu chúng dưới dạng Điểm khôi phục. Những &quot;Điểm Khôi phục&quot; này có thể được sử dụng để khôi phục hệ thống về tình trạng hoạt động trước đó, nếu Windows không khởi động được hoặc nếu trở nên không ổn định, mà không cần phải cài đặt lại hệ điều hành. </p> <h4> Cách Bật Bảo vệ Khôi phục Hệ thống trong Windows 10. </h4> <p> 1. Mở Windows explorer, nhấp chuột phải vào biểu tượng &#39;This PC&#39; và chọn <strong> Tính chất </strong> . </p> <p><img src=\"images/image_thumb-70-672.png\" alt=\"How to Enable the System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 2. Chọn <strong> Bảo vệ hệ thống </strong> ở bên trái. </p> <p><img src=\"images/image_thumb-71-762.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Đánh dấu <strong> Đĩa cục bộ C: (Hệ thống) </strong> và bấm vào <strong> Định cấu hình. </strong></p> <p><img src=\"images/image_thumb-72-782.png\" alt=\"turn on system restore protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Tại tùy chọn Bảo vệ Hệ thống, hãy chọn <strong> Bật bảo vệ hệ thống </strong> và bấm vào <strong> ĐỒNG Ý. * </strong></p> <p> * Lưu ý: Nếu &quot;Bảo vệ Hệ thống: đã được bật, thì bạn đã OK. </p> <p><img src=\"images/image_thumb-73-192.png\" alt=\"Turn on System Restore Protection in Windows\" loading=\"lazy\"></p> <p> </p> <p> 5. Cuối cùng, tại tùy chọn Bảo vệ Hệ thống, hãy nhấp vào <strong> Tạo nên </strong> để tạo một ảnh chụp nhanh (Điểm khôi phục), về trạng thái hệ thống hiện tại. </p> <p><img src=\"images/image_thumb-75-308.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}