{"title":"Cách Luôn mở Chrome ở chế độ Ẩn danh.","content":"<p> Nếu bạn đang tìm cách làm cho Chrome luôn mở ở chế độ ẩn danh thì hãy tiếp tục đọc phần bên dưới. Khi bạn khởi chạy Chrome ở chế độ ẩn danh, hoạt động trên trình duyệt của bạn vẫn ở chế độ riêng tư với những người dùng khác sử dụng cùng một thiết bị. Ở chế độ ẩn danh, Chrome sẽ không lưu lịch sử duyệt web, cookie và thông tin bạn đã nhập vào biểu mẫu. </p> <p> Cách thủ công, để bắt đầu một phiên Chrome mới ở chế độ ẩn danh, là truy cập menu của Chrome <img src=\"images/image_thumb10_thumb-963.png\" alt=\"image_thumb[10]\" loading=\"lazy\"> và để chọn &quot;Cửa sổ ẩn danh mới&quot; hoặc nhấn CTRL + SHIFT + N. </p> <p><img src=\"images/image_thumb-42-832.png\" alt=\"Chrome New incognito window\" loading=\"lazy\"></p> <p> </p> <p> Trong bài viết này, bạn sẽ tìm thấy hướng dẫn về cách luôn khởi chạy Google Chrome ở chế độ ẩn danh. </p> <h4> Cách Luôn Khởi động Google Chrome ở chế độ ẩn danh. </h4> <p> Nếu bạn muốn luôn khởi động Chrome ở chế độ ẩn danh, hãy tạo một lối tắt Chrome mới và sửa đổi các thuộc tính của nó, như sau: </p> <p> 1, <strong> Nhấp chuột phải </strong> trên <strong> Google Chrome </strong> phím tắt và chọn <strong> Tính chất </strong> . <br> 2. Tại <strong> Chung </strong> , thêm nút chuyển &quot;–incognito&quot; (không có dấu ngoặc kép), ở cuối dòng mục tiêu và nhấp vào <strong> đồng ý </strong> : </p> <p> ví dụ. &quot;C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; –incognito </p> <p><img src=\"images/image_thumb-43-798.png\" alt=\"How to Always Open Chrome in Incognito mode.\" loading=\"lazy\"></p> <p> 3. Từ bây giờ, khi bạn khởi động Chrome từ phím tắt đã sửa đổi, Chrome sẽ mở ở chế độ ẩn danh. * </p> <p><strong> * TIỀN BOA: </strong> Nếu bạn muốn mở Chrome ở chế độ ẩn danh, khi mở siêu liên kết (URL) từ e-mail của bạn hoặc chương trình khác, bạn phải sửa đổi sổ đăng ký. Để làm việc đó: </p> <blockquote> <p> 1. Mở <strong> Trình chỉnh sửa sổ đăng ký </strong> . <br> 2. Trong sổ đăng ký, điều hướng đến khóa sau: </p> <ul> <li> <p> HKEY_CLASSES_ROOT \\ ChromeHTML \\ shell \\ open \\ command </p> </li> </ul> <p> 3. Tại ngăn bên phải, nhấp đúp vào <strong> Mặc định </strong> Giá trị chuỗi REG_SZ. </p> </blockquote> <p><img src=\"images/image_thumb-44-612.png\" alt=\"open url in chrome incognito\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. Thêm nút chuyển, thêm từ &quot;ẩn danh&quot; (không có dấu ngoặc kép), trước &quot;% 1&quot; và nhấp vào <strong> đồng ý </strong> . </p></blockquote> <blockquote><p> ví dụ. Thay đổi dữ liệu giá trị từ: </p> <p> &quot;C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; - &quot;% 1&quot; </p> <p> đến: </p> <p> &quot;C: \\ Program Files \\ Google \\ Chrome \\ Application \\ chrome.exe&quot; –incognito &quot;% 1&quot; </p></blockquote> <p><img src=\"images/image_thumb-45-148.png\" alt=\"open url chrome incognito - registry\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 5. Từ bây giờ, khi nhấp vào một URL (HTML), Chrome sẽ mở nó ở chế độ ẩn danh. </p></blockquote> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}