{"title":"Cách cập nhật thành phần Chrome và Google Chrome theo cách thủ công.","content":"<p> Bất cứ khi nào có bản cập nhật Chrome mới, Google Chrome sẽ nhắc người dùng khởi động lại trình duyệt để cài đặt bản cập nhật. Nhưng đôi khi, sau khi áp dụng bản cập nhật, Chrome có thể bị treo hoặc bị treo. Điều này xảy ra vì Chrome bao gồm một số thành phần riêng lẻ có thể chưa được cập nhật và trong trường hợp này, bạn phải cập nhật chúng theo cách thủ công. </p> <p> Hướng dẫn này bao gồm các hướng dẫn về cách cập nhật Chrome và các thành phần riêng lẻ của Chrome theo cách thủ công. </p> <h4> Cách cập nhật Google Chrome và các thành phần của Chrome theo cách thủ công. </h4> <h6> Phần 1. Cách cập nhật Google Chrome theo cách thủ công. </h6> <p> Để cài đặt phiên bản mới nhất của Google Chrome: </p> <p> 1. Từ menu Chrome <img src=\"images/image_thumb-4-667.png\" alt=\"image\" loading=\"lazy\"> nhấp chuột <strong> Trợ giúp -&gt; Giới thiệu về Google Chrome </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-39-551.png\" alt=\"How to Update Chrome manually\" loading=\"lazy\"></p> <p> </p> <p> 2. Google Chrome sẽ kiểm tra các bản cập nhật và sau đó sẽ tự động cài đặt bản cập nhật cuối cùng. </p> <p><img src=\"images/image_thumb-40-825.png\" alt=\"image\" loading=\"lazy\"></p> <p> 3. Khi cập nhật hoàn tất, hãy nhấp vào <strong> Khởi chạy lại </strong> cái nút. </p> <p><img src=\"images/image_thumb-41-622.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Phần 2. Cách cập nhật các thành phần riêng lẻ của Chrome. </h6> <p> 1. Trên thanh địa chỉ của Chrome, nhập: </p> <ul> <li><strong> chrome: // các thành phần </strong></li> </ul> <p> 2. Nhấp vào <strong> Kiểm tra cập nhật </strong> ở mỗi thành phần Chrome mà bạn muốn cập nhật. </p> <p><img src=\"images/image_thumb-42-446.png\" alt=\"How to Update Chrome Components\" loading=\"lazy\"></p> <p> </p> <p> 3. Khi bạn cập nhật xong, hãy khởi động lại Chrome. </p> <p> Trợ giúp bổ sung: Nếu sau khi cập nhật Chrome và các thành phần của nó, bạn gặp sự cố với trình duyệt của mình thì hãy tiếp tục <a href=\"https://www.repairwin.com/how-to-uninstall-google-chrome-completely-from-your-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> gỡ bỏ hoàn toàn và cài đặt lại Chrome </a> . </p> <p> Đó là tất cả! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}