{"title":"Cách bảo vệ PC của bạn bằng BitLocker trong Windows 10.","content":"<p> Hướng dẫn này bao gồm các hướng dẫn từng bước về cách đặt mật khẩu bảo vệ PC của bạn bằng mã hóa BitLocker. BitLocker là một tính năng mã hóa toàn bộ ổ đĩa có trong các phiên bản Windows 10 Professional và Enterprise và nó có thể giúp bạn bảo vệ dữ liệu cá nhân của bạn khỏi bị truy cập trái phép. </p> <p> Hãy tưởng tượng tình huống sau: Máy tính xách tay cá nhân của bạn bị đánh cắp hoặc bị mất và dữ liệu cá nhân của bạn có sẵn cho những con mắt vô kỷ luật. Để tránh điều này xảy ra, hãy đọc hướng dẫn này và tìm hiểu cách đặt mật khẩu bảo vệ PC và dữ liệu quý giá của bạn bằng mã hóa mạnh để bất kỳ ai không có mật khẩu giải mã đều không thể truy cập được. </p> <ul> <li><strong> Bài viết liên quan: <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách bảo vệ thư mục bằng mật khẩu. </a></strong></li> </ul> <h4> Cách sử dụng BitLocker để Mã hóa và Bảo vệ PC chạy Windows 10 của bạn. </h4> <p> Để bảo vệ ổ đĩa Hệ điều hành, với BitLocker trong Windows 10 Pro hoặc Enterprise: </p> <p> 1. Từ Windows <strong> Bảng điều khiển </strong> , nhấp chuột <strong> Hệ thống và Bảo mật </strong> và sau đó nhấp vào <strong> Mã hóa ổ khóa bit </strong> . </p> <p><img src=\"images/image_thumb-33-320.png\" alt=\"How to Protect your PC with BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Bên cạnh ổ đĩa hệ điều hành C :, nhấp vào <strong> Bật bitlocker </strong> . * </p> <p> * Lưu ý: Nếu sau khi nhấn &#39;Bật BitLocker&#39;, bạn nhận được lỗi &quot;Thiết bị này không thể sử dụng Mô-đun nền tảng đáng tin cậy…&quot;, thì hãy đọc bài viết này để khắc phục sự cố. </p> <p><img src=\"images/image_thumb-34-100.png\" alt=\"turn on bitlocker operating system drive\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 3. Ở màn hình tiếp theo, chọn cách bạn muốn mở khóa ổ đĩa khi khởi động. </p> <blockquote><p> 1. Nếu bạn muốn mở khóa PC của mình bằng cách sử dụng thiết bị USB, hãy nhấp vào <strong> Cắm ổ đĩa flash USB. <br> </strong> 2. Nếu bạn muốn mở khóa PC của mình bằng cách nhập mật khẩu, hãy nhấp vào <strong> nhập mật khẩu </strong> . (như trong ví dụ này) </p></blockquote> <p><img src=\"images/image_thumb-35-212.png\" alt=\"enable bitlocker protection windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Bây giờ gõ một mật khẩu rất mạnh và nhấp vào <strong> Kế tiếp </strong> . </p> <p><img src=\"images/image_thumb-36-435.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Bây giờ chọn nơi bạn muốn lưu * khóa khôi phục và nhấp vào <strong> Kế tiếp </strong> . * </p> <p> * Ví dụ: nếu bạn đăng nhập vào Windows 10 bằng tài khoản Microsoft, sau đó nhấp vào <strong> Lưu vào Tài khoản Microsoft của bạn. </strong> Nếu bạn đăng nhập vào Windows 10 bằng tài khoản cục bộ thì hãy chọn một trong các tùy chọn khác. </p> <p> Ghi chú: <br> 1. Nếu bạn lưu khóa khôi phục BitLocker vào Tài khoản Microsoft của mình, thì bạn có thể xem khóa sau khi đăng nhập vào <a title=\"https://onedrive.live.com/recoverykey.\" href=\"https://onedrive.live.com/recoverykey.\" target=\"_blank\" rel=\"nofollow noopener\"> https://onedrive.live.com/recoverykey. </a><br> 2. Tôi luôn muốn lưu trữ khóa khôi phục trên ổ USB để chuẩn bị khắc phục sự cố BitLocker. </p> <p> </p> <p><img src=\"images/image_thumb-37-801.png\" alt=\"save bitlocker recovery key\" loading=\"lazy\"></p> <p> </p> <p> 6. Ở màn hình tiếp theo, hãy để nguyên cài đặt mặc định nếu PC và / hoặc ổ đĩa của bạn là mới và sau đó nhấp vào <strong> Kế tiếp </strong> lần nữa. </p> <p><img src=\"images/image_thumb-38-708.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Tại các tùy chọn chế độ mã hóa, hãy để nguyên cài đặt mặc định và nhấp vào <strong> Kế tiếp </strong> . </p> <p><img src=\"images/image_thumb-39-785.png\" alt=\"bitlocker encryption mode\" loading=\"lazy\"></p> <p> </p> <p> 8. Ở màn hình cuối cùng, hãy nhấp vào <strong> Tiếp tục </strong> , để khởi động lại và kiểm tra hệ thống trước khi bật tính năng bảo vệ BitLocker. </p> <p><img src=\"images/image_thumb-40-895.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 9. Khi khởi động lại, bạn sẽ được nhắc nhập mật khẩu BitLocker của mình. Nhập mật khẩu của bạn và nhấn <strong> Đi vào </strong> . * </p> <p> * Lưu ý: Nếu BitLocker không thể chấp nhận mật khẩu hoặc nếu bạn gặp phải các sự cố khác, hãy thử một trong các thao tác sau để đăng nhập vào Windows: </p> <blockquote><p> 1. Nhấn phím ESC trên màn hình Mật khẩu của BitLocker để truy cập các tùy chọn khôi phục. <br> 2. Nhấn liên tục phím ESC sau khi khởi động máy tính của bạn, để bỏ qua kiểm tra BitLocker. </p></blockquote> <p> 10. Nếu các bài kiểm tra BitLocker vượt qua, thì sau khi khởi động lên Windows 10, BitLocker sẽ bắt đầu mã hóa ổ đĩa hệ điều hành của bạn. Để xem trạng thái của quá trình mã hóa, hãy nhấp vào thông báo BitLocker trên thanh tác vụ hoặc đi tới Bảng điều khiển&gt; Mã hóa ổ BitLocker. </p> <p><img src=\"images/image_thumb-41-171.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}