{"title":"Cách thay đổi mật khẩu Outlook (Outlook 365, 2016, 2013, 2010 hoặc 2007).","content":"<p> Đôi khi, có nhu cầu thay đổi mật khẩu email của bạn để giữ an toàn cho email của bạn hoặc nếu bạn nghĩ rằng ai đó đã đánh cắp hoặc giành được quyền truy cập vào email của bạn. Trong những trường hợp này, trước tiên bạn nên thay đổi mật khẩu của mình với nhà cung cấp email của bạn và sau đó thay đổi / cập nhật mật khẩu hiện tại trên ứng dụng email Outlook. </p> <p> Vì vậy, nếu bạn cần cập nhật / thay đổi mật khẩu của mình trong Outlook 2016, 2013, 2010 hoặc 2007, hãy làm theo các bước trong hướng dẫn này. </p> <h4> Cách thay đổi / cập nhật mật khẩu tài khoản e-mail trong Outlook (Tất cả các phiên bản) </h4> <p><strong> Quan trọng: </strong> Trước hết, hãy liên hệ với nhà cung cấp dịch vụ email của bạn và yêu cầu họ thay đổi mật khẩu email hiện tại bằng một mật khẩu mới. Nếu bạn đang sử dụng tài khoản Outlook.com, Yahoo hoặc GMAIL thì bạn có thể tự thay đổi mật khẩu của mình sau khi đăng nhập vào tài khoản bằng trình duyệt Web. Sau khi thay đổi mật khẩu, sau đó tiến hành cập nhật / thay đổi mật khẩu trong ứng dụng Outlook, bằng cách sử dụng một trong các phương pháp sau: </p> <h6> Phương pháp 1. Cập nhật / Thay đổi mật khẩu tài khoản email trong ứng dụng Outlook. </h6> <p><strong> 1. </strong> Trong Outlook, bấm <strong> </strong> các <strong> Tập tin </strong> menu và chọn <strong> Cài đặt tài khoản </strong> * </p> <p> * Nếu bạn đang sử dụng Outlook 2007 hoặc Outlook 2003, hãy truy cập <strong> Công cụ </strong> &gt; <strong> Tài khoản </strong> . </p> <p><img src=\"images/image_thumb-15-693.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 2. </strong> Đánh dấu tài khoản của bạn và nhấp vào <strong> Thay đổi </strong> . </p> <p><img src=\"images/image_thumb-17-409.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Nhập mật khẩu mới vào trường &#39;Mật khẩu&#39; và sau đó nhấp vào <strong> Kế tiếp </strong> để lưu các thay đổi. * </p> <p> * Lưu ý cho việc sử dụng Outlook 2016 hoặc Outlook 365: Nếu bạn không thấy màn hình bên dưới, hãy sử dụng các bước trong <strong><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> phương pháp-2 </a></strong> dưới đây để thay đổi mật khẩu. </p> <p><img src=\"images/image_thumb-18-821.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Nhấp chuột <strong> Hoàn thành </strong> và sau đó đóng cửa sổ &#39;Cài đặt Tài khoản&#39;. </p> <p> </p> <h6> Phương pháp 2. Cập nhật / Thay đổi mật khẩu tài khoản email trong ứng dụng &quot;Thiết lập thư&quot;. </h6> <p><strong> 1. </strong> Điều hướng đến Bảng điều khiển Windows. <br> <strong> 2. </strong> Đặt <strong> Xem theo </strong> : đến <strong> Biểu tượng nhỏ </strong> và sau đó mở <strong> Thư </strong> ứng dụng. </p> <p><img src=\"images/image_thumb-19-688.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 3. </strong> Nhấn vào <strong> Các tài khoản email </strong> cái nút. </p> <p><img src=\"images/image_thumb-20-687.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 4. </strong> Đánh dấu tài khoản email của bạn và nhấp vào <strong> Thay đổi </strong> . </p> <p><img src=\"images/image_thumb-21-210.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 5. </strong> Nhập mật khẩu mới vào trường &#39;Mật khẩu&#39; và sau đó nhấp vào <strong> Kế tiếp </strong> để lưu các thay đổi. </p> <p><img src=\"images/image_thumb-22-458.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p><strong> 6. </strong> Nhấp chuột <strong> Hoàn thành </strong> và sau đó đóng cửa sổ &#39;Cài đặt Tài khoản&#39;. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}