{"title":"Cách khôi phục tệp Outlook Express DBX MIỄN PHÍ.","content":"<p> Outlook Express là một chương trình email khách xuất hiện lần đầu trong Windows XP. Nhưng ngay cả ngày hôm nay (năm 2018) một số khách hàng vẫn sử dụng nó, làm chương trình Email chính của họ. Một trong những vấn đề chính mà Outlook Express gặp phải, là vấn đề giới hạn 2GB. </p> <p> Mô tả vấn đề giới hạn kích thước 2GB trong Outlook Express. <br> Khi một trong các thư mục Outlook Express chính (ví dụ: &quot;Hộp thư đến&quot; hoặc &quot;Đã gửi&quot;) vượt quá kích thước 2GB, tệp lưu trữ OE DBX tương ứng có thể bị hỏng và thư mục OE có thể trống. Do sự cố, Outlook Express không thể Gửi hoặc Nhận email và hiển thị lỗi <a href=\"https://www.repairwin.com/fix-outlook-express-error-0x800c0133-due-to-2gb-size-limit/\" target=\"_blank\" rel=\"nofollow noopener\"> 0x800c0133 </a> trong quá trình Gửi / Nhận. </p> <p> Trong hướng dẫn này, tôi sẽ chỉ cho bạn cách sửa tệp DBX bị hỏng từ Outlook Express và lấy lại email của bạn! </p> <h4> Cách khắc phục Tệp DBX Outlook Express bị hỏng. </h4> <p> Nếu một trong các thư mục Outlook Express (hộp thư đến, Gửi, v.v.) bị hỏng, thì hãy làm theo hướng dẫn bên dưới để sửa chữa thư mục lưu trữ DBX và lấy lại email của bạn. </p> <h6> Bước 1. Bật Chế độ xem tệp ẩn. </h6> <p> 1. Mở Windows Explorer. <br> 2. Từ <strong> Công cụ </strong> menu chọn <strong> Tùy chọn thư mục </strong> . <br> 3. Tại tab View, nhấp vào <strong> Hiển thị các tệp và thư mục ẩn </strong> và bấm vào <strong> ĐỒNG Ý. </strong></p> <p><img src=\"images/image_thumb-2-290.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Bước 2. Định vị tệp Outlook Express DBX bị hỏng trên đĩa của bạn. </h6> <p> 1. Mở thư mục cửa hàng Outlook Express. Thường thì thư mục này nằm ở đường dẫn sau trên đĩa của bạn: </p> <ul> <li> C: \\ Documents and Settings \\\\ Local Settings \\ Application Data \\ Identities \\ {} \\ Microsoft \\ <strong> Outlook Express </strong></li> </ul> <blockquote><p> ví dụ. “C: \\ Documents and Settings \\ User \\ Local Settings \\ Application Data \\ Identities \\ {D8F3C56D-965E-41AE-8A23-A58460ABAE00} \\ Microsoft \\ <strong> Outlook Express </strong> ” </p></blockquote> <p> 3. Từ Explorer&#39;s <strong> Lượt xem </strong> menu chọn <strong> Chi tiết </strong> . <br> 4. Định vị tệp DBX nào, vượt quá giới hạn lưu trữ 2GB hoặc xác định vị trí tệp DBX bị hỏng. (tệp DBX bị hỏng, là thư mục MAIL có vẻ trống trong chương trình Outlook Express). </p> <p><img src=\"images/image_thumb-3-887.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 5. Sao chép tệp DBX đó vào một vị trí khác trên đĩa của bạn (ví dụ: vào một thư mục mới trên màn hình của bạn có tên &quot;CorruptDBX&quot;). </p> <p> </p> <h6> Bước 3. Tải xuống UnDBX - Tiện ích phục hồi DBX Outlook Express miễn phí. </h6> <p> UnDBX là một Công cụ sửa chữa Outlook Express DBX miễn phí và tuyệt vời có thể trích xuất tất cả các email Outlook Express có trong định dạng .eml. Ngoài ra, nó có tùy chọn để khắc phục và sửa chữa tệp Outlook Express .DBX bị hỏng. </p> <p> Bạn có thể tải xuống UnDBX từ <a href=\"https://sourceforge.net/projects/undbx/\" target=\"_blank\" rel=\"nofollow noopener\"> đây </a> . </p> <p> </p> <h6> Bước 4. Khôi phục email từ tệp Outlook Express DBX bị hỏng. </h6> <p> 1. Để khôi phục email từ tệp DBX bị hỏng, hãy nhấp đúp để chạy tiện ích UnDBX. <br> 2. Trong tiện ích UnDBX: </p> <blockquote><p> 1. Chọn thư mục chứa tệp .dbx Outlook Express, sau đó <strong> kiểm tra </strong> các &quot; <strong> bật chế độ Khôi phục </strong> &quot;tùy chọn bên dưới. <br> 2. <strong> Chọn một thư mục đích </strong> trên máy tính của bạn, để lưu trữ (giải nén) các tệp .eml. (ví dụ: đến một thư mục trên màn hình của bạn có tên &quot;RecoveryInbox&quot;) <br> 3. Cuối cùng bấm <strong> Bình phục </strong> . </p></blockquote> <p><img src=\"images/image_thumb-5-645.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Khi quá trình khôi phục UnDBX hoàn tất, hãy mở Outlook Express. <br> 4. Điều hướng đến thư mục mà UnDBX đã lưu các tệp .eml đã giải nén. <br> 5. Kéo và thả các email đã trích xuất vào thư mục tương ứng (trong Outlook Express). * </p> <p><strong> * Gợi ý: </strong> Để tránh các thư mục Outlook Express lại bị hỏng (hoặc vượt qua giới hạn 2GB), tôi khuyên bạn nên kéo và thả email theo nhóm (ví dụ: theo năm) và đặt chúng vào các thư mục khác nhau trong OE. Ví dụ: chỉ chọn các email từ năm hiện tại và kéo và thả chúng vào thư mục OE mới có tên năm hiện tại (ví dụ: &quot;Hộp thư đến 2018&quot;). Sau đó, lặp lại (các) bước tương tự với tất cả các email khác từ những năm trước. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}