{"title":"Cách sao lưu tệp cá nhân với Lịch sử tệp trong Windows 10.","content":"<p> Trong hướng dẫn này, tôi sẽ chỉ cho bạn cách định cấu hình Windows 10 để tự động tạo bản sao và ảnh chụp nhanh các tệp của bạn bằng cách sử dụng công cụ sao lưu Lịch sử tệp, để có thể khôi phục chúng (nếu cần), bằng cách sử dụng &quot;Khôi phục các phiên bản trước&quot; đặc tính. </p> <p> Như bạn có thể đã nhận thấy, theo mặc định, Windows 10 không giữ các phiên bản trước của tệp hoặc thư mục của bạn, giống như trong Windows 7. Điều này đang xảy ra, vì Windows 10 không sử dụng dịch vụ &#39;Volume Shadow Copy&#39; nữa để chụp nhanh các tệp của bạn, nhưng thay vào đó nó chỉ sử dụng công cụ sao lưu &#39;Lịch sử Tệp&#39;. </p> <p> &quot;Lịch sử Tệp&quot; là một công cụ sao lưu tích hợp tuyệt vời trong Windows 10, có thể được định cấu hình để sao chép và chụp nhanh các tệp của bạn vào vị trí lưu trữ thay thế ngoài ổ đĩa chính (ví dụ: vào Ổ USB, Mạng, v.v.) . * </p> <p> * Lưu ý: Hạn chế duy nhất của công cụ &quot;Lịch sử tệp&quot; là không cho phép bạn chọn ổ C: làm điểm đến sao lưu thay thế. nếu bạn không sở hữu ổ đĩa phụ có sẵn để sao lưu, thì hãy tiếp tục đọc hướng dẫn này để tìm hiểu cách vượt qua giới hạn này… </p> <ul> <li><strong> Bài viết liên quan: </strong> <a href=\"https://www.repairwin.com/how-to-create-shadow-copies-of-files-with-task-scheduler-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách tạo bản sao bóng cho tệp của bạn bằng Trình lập lịch tác vụ trong Windows 10. </a></li> </ul> <h4> Cách sao lưu tệp cá nhân của bạn bằng công cụ Sao lưu lịch sử tệp trong Windows 10. </h4> <p> 1. Như tôi đã đề cập ở trên, để sao lưu các tệp của bạn bằng công cụ sao lưu Lịch sử Tệp, bạn cần có một ổ lưu trữ khả dụng được kết nối với PC (ví dụ: ổ USB) hoặc một vị trí mạng (ví dụ: một máy tính khác trong Mạng của bạn hoặc thiết bị lưu trữ NAS). * </p> <p> * Lưu ý: Nếu bạn không sở hữu thiết bị lưu trữ thay thế, thì bạn có các tùy chọn sau: </p> <blockquote><p> A. Để <a href=\"https://www.repairwin.com/how-to-easy-manage-partitions-create-resize-move-delete-partitions-in-windows-10-8-7-vista/\" target=\"_blank\" rel=\"nofollow noopener\"> thu nhỏ kích thước ổ đĩa chính C của bạn: \\ </a> và với dung lượng trống có sẵn để tạo một ổ đĩa mới để lưu trữ bản sao lưu hoặc… </p> <p> B. Để lưu trữ bản sao lưu trên ổ đĩa chính C: \\. Trong trường hợp này, hãy tạo một thư mục mới trên ổ C: và đặt tên là &quot;FileHistory&quot; (hoặc bất cứ thứ gì bạn muốn) và tiếp tục bên dưới… </p></blockquote> <p> 2. Điều hướng đến Windows <strong> Bảng điều khiển </strong> và dưới <strong> Hệ thống và Bảo mật, </strong> nhấp chuột <strong> Lưu bản sao lưu </strong><strong> bản sao tệp của bạn với Lịch sử tệp. </strong></p> <p><img src=\"images/image_thumb-42-924.png\" alt=\"How to Backup & Keep Previous Versions of Files in Windows 10.\" loading=\"lazy\"></p> <p> </p> <p> 3. Bây giờ theo trường hợp của bạn, hãy thực hiện như sau: </p> <ul> <li><strong> Trường hợp A. </strong> Nếu bạn sở hữu một ổ đĩa có sẵn để sao lưu, thì: </li> </ul> <blockquote><p> a. Nhấn vào <strong> Bật </strong> trên màn hình để bật &#39;Lịch sử tệp&#39;. <br> b. Tiếp tục <a href=\"#step-4\" target=\"_blank\" rel=\"nofollow noopener\"> bước 4 </a> bên dưới để định cấu hình cài đặt sao lưu &#39;Lịch sử Tệp&#39;. </p></blockquote> <p><img src=\"images/image_thumb-44-788.png\" alt=\"Turn On File History Windows 10\" loading=\"lazy\"></p> <p> </p> <ul> <li><strong> Trường hợp B: </strong> Nếu bạn không sở hữu một ổ đĩa khả dụng để sao lưu Lịch sử Tệp hoặc nếu bạn muốn lưu trữ bản sao lưu trên mạng, thì hãy: </li> </ul> <blockquote><p> a. Nhấp chuột <strong> Chọn một vị trí mạng. </strong></p></blockquote> <p><img src=\"images/image_thumb-56-796.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Ở màn hình tiếp theo: </p> <p> 1. Nếu bạn muốn lưu bản sao lưu trên Mạng, hãy nhập đường dẫn mạng đầy đủ của vị trí lưu trữ bản sao lưu và nhấp vào <strong> Chọn thư mục </strong> . </p> <p> 2. Nếu bạn muốn lưu bản sao lưu trên ổ đĩa chính C: \\, hãy nhập đường dẫn mạng đầy đủ đến thư mục sao lưu cục bộ trên ổ C: \\, tại biểu mẫu sau: * </p> <ul> <li> <strong> \\\\ Tên-Máy tính \\ C $ \\ FileHistory </strong></li> </ul> <p> * Ghi chú: <br> 1. Thay thế giá trị &quot;Tên máy tính&quot; bằng tên PC của bạn. (Để tìm tên máy tính của bạn, nhấp chuột phải vào biểu tượng &quot;PC này&quot; trong Windows Explorer). <br> 2. Hãy nhớ rằng lưu bản sao lưu các tệp cá nhân của bạn trên cùng một ổ đĩa mà chúng đã được lưu trữ <strong> không phải là một giải pháp đáng tin cậy </strong> . Để an toàn, hãy luôn lưu trữ bản sao lưu vào một thiết bị lưu trữ khác. </p></blockquote> <p> ví dụ: nếu tên máy tính là &quot;Pegasus&quot; thì nhập: &quot;\\\\ Pegasus \\ C $ \\ FileHistory&quot; </p> <p><img src=\"images/image_thumb-53-936.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> c. Ở màn hình tiếp theo, hãy nhấp vào <strong> đồng ý </strong> . </p></blockquote> <p><img src=\"images/image_thumb-54-349.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> d. Bây giờ hãy nhấp vào <strong> Bật </strong> để bật công cụ sao lưu Lịch sử tệp, rồi tiếp tục ở dưới để định cấu hình cài đặt sao lưu. </p></blockquote> <p><img src=\"images/image_thumb-48-620.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Để định cấu hình các tùy chọn sao lưu &#39;Lịch sử Tệp&#39;, hãy nhấp vào <strong> Cài đặt nâng cao </strong> bên trái. </p> <p><img src=\"images/image_thumb-49-919.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4a. Sau đó tại <strong> Cài đặt nâng cao </strong> tùy chọn, đặt tần suất sao lưu tệp của bạn và thời gian lưu các phiên bản đã lưu. Khi hoàn tất, hãy nhấp vào <strong> Lưu thay đổi </strong> . </p> <p><img src=\"images/image_thumb-61-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Cuối cùng bấm <strong> Chạy ngay đi </strong> để tạo bản sao lưu đầu tiên của bạn. * </p> <p><img src=\"images/image_thumb-55-463.png\" alt=\"image\" loading=\"lazy\"></p> <p> * Trợ giúp Bổ sung - Ghi chú: <br> 1. Theo mặc định, &#39;Lịch sử Tệp&#39; sẽ sao lưu các thư mục &#39;Thư viện&#39; (Máy tính để bàn, Tài liệu, Mục ưa thích, Nhạc, OneDrive, Ảnh &amp; Video). Nếu bạn muốn loại trừ một trong những thư mục này khỏi bản sao lưu, để bao gồm các thư mục khác hoặc để xem lại tất cả các tùy chọn sao lưu Lịch sử Tệp, sau đó điều hướng đến: </p> <ul> <li> <p><strong> Cài đặt <img src=\"images/image_thumb-58-467.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Cập nhật &amp; Bảo mật </strong> &gt; <strong> Sao lưu </strong> &gt; <strong> Lựa chọn khác. </strong></p> </li> </ul> <p><img src=\"images/image_thumb-57-938.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 2. Để khôi phục các tệp của bạn từ bản sao lưu &#39;Lịch sử Tệp&#39;, hãy điều hướng đến một trong các vị trí sau: </p> <ul> <li><strong> Bảng điều khiển </strong> &gt; <strong> Lịch sử tệp </strong> &gt; <strong> Khôi phục tệp cá nhân. </strong></li> <li><strong> Cài đặt <img src=\"images/image_thumb-59-275.png\" alt=\"image\" loading=\"lazy\"></strong> &gt; <strong> Cập nhật &amp; Bảo mật </strong> &gt; <strong> Sao lưu </strong> &gt; <strong> Lựa chọn khác </strong> &gt; <strong> Khôi phục tệp từ bản sao lưu hiện tại. </strong></li> </ul> <p> 3. Để khôi phục có chọn lọc một tệp hoặc thư mục về phiên bản trước của nó, hãy nhấp chuột phải vào tệp (hoặc thư mục) và chọn <strong> Khôi phục các phiên bản trước </strong> . </p> <p><img src=\"images/image_thumb-60-867.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}