{"title":"Cách thêm tài khoản người dùng mới trong Windows 10/8 / 8.1","content":"<p> Một trong những khả năng của Windows 10 là thêm tài khoản Microsoft trực tuyến trên PC (hoặc thiết bị) của bạn để sử dụng tất cả các dịch vụ của Microsoft (Email, Ứng dụng hiện đại, trò chơi Xbox, Skype, OneDrive, v.v.) bằng một tài khoản. Ngoài ra, nếu bạn thiết lập tài khoản Microsoft trong Windows 10, bạn sẽ có khả năng đăng nhập từ bất kỳ thiết bị Windows 10 nào khác (được kết nối với Internet) và đồng bộ hóa tất cả các ứng dụng, cài đặt và mật khẩu của bạn trên thiết bị mới. </p> <p> Nếu bạn không muốn sử dụng Windows Store hoặc nếu bạn không muốn sử dụng những lợi thế được cung cấp bằng cách sử dụng tài khoản trực tuyến của Microsoft, thì tốt hơn là nên thiết lập Tài khoản cục bộ trong Windows 10. Theo ý kiến ​​của tôi, tài khoản Cục bộ luôn an toàn hơn tài khoản trực tuyến của Microsoft và luôn hoạt động, bất kể kết nối Internet. </p> <p> Hướng dẫn này hiển thị cây (3) các phương pháp khác nhau để thêm tài khoản người dùng mới trong Windows 10 và Windows 8.1 trong trường hợp bạn cần. (ví dụ: nếu bạn muốn chia sẻ máy tính hoặc tệp của mình với người khác). </p> <h2> Cách tạo người dùng mới trong Windows 10, 8.1. </h2> <p><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Phương pháp 1. Tạo Tài khoản Mới từ các tùy chọn Cài đặt. </a></p> <p><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Phương pháp 2. Thêm tài khoản mới bằng cách sử dụng tiện ích &#39;Tài khoản người dùng&#39; trong Windows 10/8. </a></p> <p><a href=\"#method-3\" target=\"_blank\" rel=\"nofollow noopener\"> Phương pháp 3. Tạo người dùng mới bằng Command Prompt trong Windows 10/8. </a></p> <p> </p> <h6> Phương pháp 1. Cách tạo tài khoản mới từ cài đặt trong Windows 10. </h6> <p> 1. Đăng nhập vào Windows bằng tài khoản Quản trị viên. </p> <p> 2. Mở <strong> Cài đặt </strong> <img src=\"images/image_thumb-50-534.png\" alt=\"image\" loading=\"lazy\"> và sau đó nhấp vào <strong> Tài khoản </strong> . </p> <p><img src=\"images/image_thumb-43-324.png\" alt=\"How to Add a New User in Windows 10, 8.1.\" loading=\"lazy\"></p> <p> </p> <p> 3. Chọn <strong> Gia đình và những người dùng khác </strong> ở bên trái và sau đó nhấp vào <strong> Thêm người khác vào PC này. </strong></p> <p><img src=\"images/image_thumb-49-471.png\" alt=\"create new account windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Ở màn hình tiếp theo: </p> <blockquote><p> A. nếu bạn muốn thêm Tài khoản Microsoft mới trên PC, hãy nhập địa chỉ email của người mới và nhấp vào <strong> Kế tiếp </strong> . </p> <p> B. Nếu bạn muốn thêm tài khoản Cục bộ mới (như trong ví dụ này), hãy nhấp vào <strong> Tôi không có thông tin đăng nhập của người này </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-665.png\" alt=\"add local account windows 10\" loading=\"lazy\"></p> <p> 5. Sau đó nhấp vào <strong> Thêm người dùng không có tài khoản Microsoft </strong> . </p> <p><img src=\"images/image_thumb-42-715.png\" alt=\"add a non Microsoft account windows 10\" loading=\"lazy\"></p> <p> </p> <p> 6. Ở màn hình tiếp theo, nhập tên người dùng và mật khẩu cho tài khoản mới. Sau đó chọn và trả lời các câu hỏi bảo mật đã cho * trong trường hợp bạn quên mật khẩu và khi hoàn tất, hãy nhấp vào <strong> Kế tiếp </strong> . </p> <p> * Lưu ý: Nếu bạn không muốn trả lời tất cả những câu hỏi bảo mật &quot;ngu ngốc&quot; này, hãy tiến hành thêm người dùng mới bằng cách sử dụng phương pháp-1 hoặc phương pháp-2 bên dưới. </p> <p><img src=\"images/image_thumb-46-912.png\" alt=\"add new user account windows 10-8\" loading=\"lazy\"></p> <p> </p> <p> 7. Tại thời điểm này, bạn đã kết thúc việc tạo người dùng Chuẩn mới trên Windows 10. Nhưng, nếu bạn muốn cấp đặc quyền quản trị cho người dùng mới: </p> <blockquote><p> a. Chọn người dùng và nhấp vào <strong> Thay đổi loại tài khoản. </strong></p></blockquote> <p><img src=\"images/image_thumb-47-574.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Ở màn hình tiếp theo, thay đổi loại tài khoản thành &#39;Quản trị viên&#39; và nhấp vào <strong> đồng ý </strong> . </p></blockquote> <p><img src=\"images/image_thumb-48-850.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Phương pháp 2. Thêm tài khoản mới bằng cách sử dụng tiện ích &#39;Tài khoản người dùng&#39; trong Windows 10/8. </h6> <p> Một trong những phương pháp yêu thích của tôi để thêm (hoặc xóa) người dùng (trong tất cả các phiên bản Windows), là sử dụng tiện ích &#39;Tài khoản Người dùng&#39;, tiện ích cung cấp tất cả các tùy chọn cần thiết để dễ dàng quản lý tài khoản Windows. (Thêm / Xóa Người dùng, Chỉ định Đặc quyền Người dùng hoặc Thay đổi Mật khẩu Người dùng). </p> <p> 1. Đăng nhập vào Windows bằng tài khoản Quản trị viên. </p> <p> 2. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-578.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 3. Trong hộp &quot;Mở&quot;, nhập: <strong> kiểm soát userpasswords2 </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p> <p> </p> <p><img src=\"images/image_thumb-29-910.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 4. Trong tab Người dùng, hãy nhấp vào <strong> Thêm vào </strong> để thêm tài khoản mà bạn muốn có quyền truy cập vào tệp của mình. </p> <p><img src=\"images/image_thumb_thumb1_thumb-455.png\" alt=\"image_thumb_thumb[1]\" loading=\"lazy\"></p> <p> </p> <p> 5. Chọn <strong> Đăng nhập mà không cần tài khoản Microsoft </strong> để tạo tài khoản cục bộ, hãy điền địa chỉ email của người dùng nếu bạn muốn tạo Tài khoản Microsoft </p> <p><img src=\"images/image_thumb-51-380.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Sau đó chọn <strong> Tài khoản cục bộ </strong> . </p> <p><img src=\"images/image_thumb-52-375.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Điền vào các trường bắt buộc (tên người dùng, mật khẩu và gợi ý mật khẩu) và nhấp vào <strong> Kế tiếp </strong> . </p> <p><img src=\"images/image_thumb-53-204.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Ở màn hình cuối cùng, hãy nhấp vào <strong> Hoàn thành </strong> . </p> <p> 9. Cuối cùng, nếu bạn muốn đặt người dùng mới làm Quản trị viên trên máy tính: </p> <blockquote><p> a. Đánh dấu người dùng và chọn <strong> Tính chất </strong></p></blockquote> <p><img src=\"images/image_thumb-54-635.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> b. Sau đó tại <strong> Tư cách thành viên nhóm </strong> tab, đặt dấu đầu dòng vào <strong> Người quản lý </strong> và bấm vào <strong> đồng ý </strong> . </p></blockquote> <p><img src=\"images/image_thumb-55-972.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <h6> Phương pháp 3. Cách tạo hoặc xóa người dùng bằng Command Prompt trong hệ điều hành Windows 10/8/7. </h6> <p> Phương pháp dễ nhất để thêm hoặc xóa người dùng trên tất cả các phiên bản Windows là sử dụng dấu nhắc lệnh. </p> <p> Để thêm tài khoản mới từ dấu nhắc lệnh: </p> <p> 1. Mở <strong> Command Prompt với tư cách là quản trị viên </strong> . <br> 2. Tại dấu nhắc lệnh, gõ lệnh sau và nhấn <strong> Đi vào </strong> : </p> <ul> <li><strong> mật khẩu tên người dùng net người dùng / thêm </strong></li> </ul> <p> * Lưu ý: Tại lệnh trên, thay đổi các trường &quot;tên người dùng&quot; &amp; &quot;mật khẩu&quot;, tùy theo sự lựa chọn của bạn. </p> <blockquote><p> ví dụ. nếu bạn muốn tạo một tài khoản mới với tên người dùng &quot;John&quot; và mật khẩu &quot;Pas123&quot; thì hãy nhập: </p> <ul> <li> người dùng mạng John Pas123 / thêm </li> </ul> </blockquote> <p><img src=\"images/image_thumb13_thumb-169.png\" alt=\"add account command prompt windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <p> 3. Cuối cùng, nếu bạn muốn thêm người dùng mới vào nhóm Quản trị viên, hãy đưa ra lệnh này: </p> <ul> <li><strong> net localgroup quản trị viên tên người dùng / thêm </strong></li> </ul> <blockquote><p> ví dụ. Trong ví dụ của chúng tôi, lệnh là: </p> <ul> <li> quản trị viên net localgroup John / add </li> </ul> </blockquote> <p><img src=\"images/image_thumb16_thumb-668.png\" alt=\"image_thumb[16]\" loading=\"lazy\"></p> <p> </p> <p> Để xóa người dùng khỏi dấu nhắc lệnh: </p> <p> 1. Mở <strong> Command Prompt với tư cách là quản trị viên </strong> . <br> 2. Tại dấu nhắc lệnh, gõ lệnh sau và nhấn <strong> Đi vào </strong> : </p> <ul> <li><strong> tên người dùng net / xóa </strong></li> </ul> <p> ví dụ. nếu bạn muốn xóa người dùng &quot;John&quot;, hãy nhập: </p> <ul> <li> người dùng net John / xóa </li> </ul> <p><img src=\"images/image_thumb19_thumb-438.png\" alt=\"image_thumb[19]\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trong các mạng xã hội để giúp lan truyền về vấn đề này. </p>"}