{"title":"Cách tạo bản sao bóng của tệp bằng Trình lập lịch tác vụ trong Windows 10.","content":"<p> Trong hướng dẫn trước, tôi đã đề cập đến cách sao lưu các tệp cá nhân của bạn với <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Lịch sử tệp </a> trong Windows 10. Trong hướng dẫn này, tôi sẽ trình bày cách tự động tạo Bản sao bóng của các tệp cá nhân của bạn bằng cách sử dụng Trình lập lịch tác vụ. Bản sao bóng của tệp của bạn, sẽ cho phép bạn hoàn nguyên một tệp hoặc thư mục cụ thể về phiên bản cũ hơn (tại thời điểm). </p> <p> Tính năng Shadow Copy được giới thiệu lần đầu tiên trong Windows Server 2003 và sau đó được thêm vào các phiên bản Windows Vista và 7, như một phần của tính năng Khôi phục Hệ thống. Quá trình &#39;Shadow copy&#39;, có thể sao lưu các bản sao lưu và ảnh chụp nhanh của trạng thái hệ thống hiện tại và các tệp cá nhân, ngay cả khi đang được sử dụng. Quá trình khôi phục tệp từ Bản sao bóng tối thường được gọi là &quot;Khôi phục phiên bản trước&quot;. </p> <h4> Cách tạo bản sao bóng hàng ngày cho tệp của bạn trong Windows 10. * </h4> <p><strong> * Ghi chú: </strong><br> 1. Bằng cách sử dụng các hướng dẫn bên dưới, bạn sẽ có thể tạo Bản sao bóng hàng ngày (ảnh chụp nhanh) của toàn bộ tập &quot;C: \\&quot;. (Tệp Hệ thống Windows và dữ liệu cá nhân) <br> 2. Bản sao Bóng tối có thể được sử dụng để khôi phục tệp của bạn về thời điểm sớm hơn, bằng cách sử dụng tính năng &#39;Khôi phục phiên bản trước&#39; hoặc bằng cách sử dụng tiện ích của bên thứ ba có thể truy cập Bản sao bóng tối, như <a href=\"https://www.shadowexplorer.com/downloads.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowExplorer </a> hoặc là <a href=\"https://www.nirsoft.net/utils/shadow_copy_view.html\" target=\"_blank\" rel=\"nofollow noopener\"> ShadowCopyView </a> . <br> 3. Các bản sao của The Shadow <strong> không thể được sử dụng để khôi phục hệ thống của bạn </strong> đến một thời điểm sớm hơn, bằng cách sử dụng <a href=\"https://www.repairwin.com/windows-10-8-or-8-1-system-restore/\" target=\"_blank\" rel=\"nofollow noopener\"> Khôi phục hệ thống </a> dụng cụ. Nếu bạn muốn có thể khôi phục hệ thống của mình bằng cách sử dụng Khôi phục Hệ thống, hãy tiếp tục và <a href=\"https://www.repairwin.com/how-to-enable-system-restore-protection-in-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Bật tính năng bảo vệ Khôi phục Hệ thống. </a> <br> 4. Cuối cùng, hãy nhớ rằng các Bản sao bóng tối đã tạo, nó không phải là một bản sao lưu đáng tin cậy, vì &#39;Bản sao bóng tối&#39; được lưu trữ trên ổ đĩa chính C: \\ của bạn, và nếu ổ đĩa bị lỗi, bạn sẽ mất tất cả dữ liệu của mình. Để tạo một bản sao lưu dữ liệu đáng tin cậy của bạn, hãy đọc hướng dẫn trong bài viết này: <a href=\"https://www.repairwin.com/how-to-backup-personal-files-with-file-history-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách sao lưu tệp cá nhân với Lịch sử tệp trong Windows 10. </a></p> <p> </p> <p><strong> Để tạo các phiên bản trước của tệp cá nhân của bạn bằng cách sử dụng bản sao bóng: </strong></p> <p> 1. Mở <strong> Bảng kế hoạch </strong> . Nếu bạn không biết cách làm điều đó, thì… </p> <blockquote><p> 1. Tại hộp tìm kiếm gõ <strong> Bài tập </strong> hoặc là <strong> Bảng kế hoạch </strong> . <br> 2. Mở &#39;Trình lập lịch tác vụ&#39; từ kết quả tìm kiếm. </p></blockquote> <p><img src=\"images/image_thumb-31-630.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Tại Task Scheduler, nhấp vào <strong> Tạo công việc </strong> . </p> <p><img src=\"images/image_thumb-23-462.png\" alt=\"How to Start ThrottleStop at Windows Startup\" loading=\"lazy\"></p> <p> </p> <p> 3. Tại <strong> Chung </strong> chuyển hướng: </p> <blockquote><p> 1. Gõ &quot;Create Shadow Copy of My Files&quot; làm tên của nhiệm vụ. <br> 2. <strong> Kiểm tra </strong> các <strong> Chạy với các đặc quyền cao nhất </strong> cái hộp. </p></blockquote> <p> Lưu ý: Nếu bạn muốn bắt đầu tác vụ ở chế độ nền, hãy đặt dấu chấm tại <strong> Chạy cho dù người dùng đã đăng nhập hay chưa </strong> và sau đó nhập mật khẩu đăng nhập của bạn. </p> <p><img src=\"images/image_thumb-62-499.png\" alt=\"create shadow copies task windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Sau đó chọn <strong> Gây nên </strong> tab và nhấp vào <strong> Mới </strong> . <br> 4a. Tại cửa sổ &#39;Trình kích hoạt mới&#39;, chỉ định tần suất tạo ảnh chụp nhanh các tệp của bạn và nhấp vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-63-632.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 5. Sau đó chọn <strong> Hành động </strong> tab và nhấp vào <strong> Mới </strong> . <br> 5a. Tại cửa sổ &#39;Hành động mới&#39;: </p> <blockquote><p> 1. Chọn <strong> Bắt đầu một chương trình </strong> . <br> 2. Tại &#39;Chương trình / tập lệnh&#39;, nhập: <strong> wmic </strong><br> 3. Tại &#39;Thêm đối số (tùy chọn)&#39;, nhập loại: </p> <ul> <li><strong> cuộc gọi shadowcopy tạo Khối lượng = C: \\ </strong></li> </ul> <p> 4. Khi hoàn tất, hãy nhấp vào <strong> ĐỒNG Ý. </strong></p></blockquote> <p><img src=\"images/image_thumb-66-640.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 6. Nhấp vào <strong> đồng ý </strong> một lần nữa để đóng các thuộc tính của nhiệm vụ đã lên lịch. </p> <p><img src=\"images/image_thumb-67-138.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 7. Để tạo bản sao lưu đầu tiên của bạn, hãy nhấp chuột phải vào tác vụ và chọn <strong> Chạy </strong> . </p> <p><img src=\"images/image_thumb-68-388.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Bạn đã hoàn thành! Từ bây giờ, bất cứ khi nào bạn muốn khôi phục tệp / thư mục về phiên bản trước đó, hãy nhấp chuột phải vào tệp / thư mục đó và chọn <strong> Khôi phục các phiên bản trước </strong> . </p> <p><img src=\"images/image_thumb-69-568.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> </p> <p><strong> Thông tin hữu ích: <br> </strong> 1. Dung lượng được phân bổ tối đa có thể được sử dụng để lưu trữ các bản sao bóng là dung lượng mà System Restore có thể sử dụng để lưu trữ cho các Điểm khôi phục. <br> 2. Để tìm ra dung lượng lưu trữ được phân bổ tối đa và đã sử dụng cho các bản sao Shadow, hãy đưa ra lệnh này trong Command Prompt (Admin): </p> <ul> <li><strong> danh sách vssadmin shadowstorage </strong></li> </ul> <p><img src=\"images/image_thumb-76-672.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Để sửa đổi không gian được phân bổ tối đa cho các Bản sao Bóng tối và các Điểm Khôi phục Hệ thống, hãy điều hướng đến <strong> Bảo vệ hệ thống </strong> cài đặt cho <strong> Đĩa cục bộ (C :) </strong><br> 4. Nếu bạn muốn xóa tất cả các bản sao bóng đã lưu, bạn phải xóa cả các điểm khôi phục đã lưu. Nếu bạn muốn làm điều đó, hãy nhấp vào <strong> Xóa tất cả các điểm khôi phục </strong> trong Cài đặt bảo vệ hệ thống. </p> <p><img src=\"images/image_thumb-77-662.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}