{"title":"Cách đăng nhập tự động vào Windows 10/8/7 (Không cần gõ mật khẩu).","content":"<p> Hướng dẫn này bao gồm các hướng dẫn về cách tự động đăng nhập vào Windows 10. Trên thực tế, bạn sẽ học cách tự động đăng nhập vào tài khoản người dùng của mình (tài khoản Microsoft, Local hoặc Domain) mà không cần phải nhập thông tin đăng nhập của bạn lúc Đăng nhập hoặc ở Màn hình khóa . Hướng dẫn áp dụng cho HĐH Windows 10/8/7. </p> <p> Khi bạn thực hiện cài đặt Windows 10 mới, bạn sẽ được nhắc chỉ định tài khoản người dùng và mật khẩu để sử dụng máy tính. Ở bước này, bạn có thể sử dụng tài khoản Microsoft của mình (với mật khẩu tài khoản MS của bạn) hoặc tạo Tài khoản cục bộ mới và mật khẩu mới để đăng nhập Windows. Trong cả hai trường hợp (trừ khi bạn tạo tài khoản cục bộ với mật khẩu trống), bạn sẽ được nhắc nhập mật khẩu của mình mỗi khi khởi động Windows. </p> <p> Bảo vệ máy tính của riêng bạn bằng mật khẩu là một biện pháp bảo mật tốt, đặc biệt nếu bạn dùng chung máy tính với người khác hoặc khi bạn di chuyển với máy tính xách tay của mình hoặc khi PC của bạn thuộc môi trường kinh doanh. Tuy nhiên, nếu bạn là người dùng duy nhất trên máy tính để bàn độc lập của mình hoặc nếu bạn chỉ sử dụng máy tính xách tay ở nhà, thì không cần phải nhập thông tin đăng nhập của bạn mỗi khi bạn muốn sử dụng nó. * </p> <p><strong> Cảnh báo: </strong> KHÔNG BẬT ĐĂNG NHẬP TỰ ĐỘNG trên Windows nếu bạn chia sẻ máy tính của mình với người khác hoặc nếu bạn đang di chuyển với máy tính xách tay hoặc máy tính bảng của mình, vì mọi người tìm thấy máy tính của bạn sẽ dễ dàng truy cập vào tệp của bạn. </p> <h4> Cách tự động đăng nhập vào tài khoản người dùng của bạn trong Windows 10/8/7 / Vista. (Bật đăng nhập tự động) </h4> <h6> Phương pháp 1. Bật Đăng nhập Tự động bằng cách sử dụng tiện ích TỰ ĐỘNG. </h6> <p> Microsoft đã thiết kế một công cụ để tự động hóa quá trình đăng nhập trong Windows. Công cụ này được đặt tên là &quot;Autologon&quot; và cho phép bạn dễ dàng cấu hình Windows để tự động đăng nhập mà không cần phải nhập thông tin đăng nhập của bạn mỗi khi khởi động. Ưu điểm của công cụ này là mật khẩu được lưu trữ mã hóa trong sổ đăng ký. </p> <p> 1. Tải xuống <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/autologon\" target=\"_blank\" rel=\"nofollow noopener\"> Autologon </a> tiện ích. <br> 2. Giải nén tệp đã tải xuống. <br> 3. Chạy &quot;autologon.exe&quot; <br> 4. Nhập mật khẩu của bạn và nhấp vào <strong> Kích hoạt </strong> . </p> <p><img src=\"images/image_thumb-44-251.png\" alt=\"windows auto login\" loading=\"lazy\"></p> <p> * Lưu ý: Nếu bạn muốn chuyển đăng nhập tự động, hãy chạy lại tiện ích và nhấp vào <strong> Vô hiệu hóa </strong> . </p> <p> </p> <h6> Phương pháp 2. Bật Tự động đăng nhập từ bảng điều khiển Tài khoản Người dùng. </h6> <p> Phương pháp thứ hai để bật Tự động đăng nhập vào Windows 10/8/7 là tắt cài đặt &quot;Người dùng phải nhập tên người dùng và mật khẩu để sử dụng máy tính này&quot; trong bảng điều khiển Tài khoản Người dùng. Để làm việc đó: </p> <p> Lưu ý: Nếu bạn đang sử dụng tài khoản cục bộ, có một cách khác đơn giản hơn để buộc Windows đăng nhập tự động: Chỉ cần chỉ định một mật khẩu trống (trống) mới từ Cài đặt&gt; Tài khoản&gt; Tùy chọn đăng nhập&gt; Thay đổi mật khẩu. Sau đó, nhập mật khẩu của bạn một lần và sau đó nhấp vào Tiếp theo hai lần và Kết thúc. </p> <p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-738.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Trong hộp &quot;Mở&quot;, nhập: <strong> kiểm soát userpasswords2 </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-29-873.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Trong tùy chọn Tài khoản Người dùng (tab &#39;Người dùng&#39;), <strong> bỏ chọn </strong> các <strong> Người dùng phải nhập tên người dùng và mật khẩu để sử dụng hộp kiểm máy tính này </strong> và sau đó nhấp vào <strong> Ứng dụng. * </strong></p> <p> * Lưu ý: Nếu bạn muốn tắt đăng nhập tự động trong tương lai, chỉ cần chọn hộp này. </p> <p><img src=\"images/image_thumb-32-315.png\" alt=\"auto login windows 10\" loading=\"lazy\"></p> <p> </p> <p> 4. Nhập (hai lần) mật khẩu tài khoản của bạn và nhấp vào <strong> đồng ý </strong> hai lần để đóng thuộc tính Tài khoản người dùng. </p> <p><img src=\"images/image_thumb-31-509.png\" alt=\"Auto Login to Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> </p> <h6> Phương pháp 3. Bật Tự động Đăng nhập trong Sổ đăng ký (Windows 10/8/7 / Vista). </h6> <p> Phương pháp cuối cùng để tắt đăng nhập bằng mật khẩu, trong HĐH Windows 10, 8 hoặc 7, là bật sổ đăng ký tự động đăng nhập. Để làm việc đó: </p> <p> 1. Nhấn Windows <img src=\"images/image_thumb8_thumb_thumb-512.png\" alt=\"image_thumb8_thumb\" loading=\"lazy\"> + <strong> R </strong> phím để mở hộp lệnh chạy. <br> 2. Trong hộp &quot;Mở&quot;, nhập: <strong> regedit </strong> &amp; nhấp chuột <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb7-114.png\" alt=\"open registry editor\" loading=\"lazy\"></p> <p> </p> <p> 3. Điều hướng đến khóa này từ ngăn bên trái: </p> <ul> <li> HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Microsoft \\ Windows NT \\ CurrentVersion \\ Winlogon </li> </ul> <p> 4. Tại ngăn bên phải: </p> <blockquote><p> a. Nhấp chuột phải vào một không gian trống và chọn <strong> Mới </strong> &gt; <strong> Chuỗi giá trị. </strong></p> <p><img src=\"images/image_thumb-38-930.png\" alt=\"image\" loading=\"lazy\"></p> <p> b. Đổi tên giá trị mới thành <strong> DefaultUserName </strong> và hãy nhấn <strong> Đi vào </strong> . <br> c. Mở giá trị &#39;DefaultUserName&#39; REG_SZ. <br> d. Nhập tên của Tài khoản Người dùng Cục bộ hoặc Tài khoản Microsoft của bạn và nhấp vào <strong> đồng ý </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-42-933.png\" alt=\"enable auto login registry\" loading=\"lazy\"></p> <p> </p> <p> 5a. Thực hiện các bước tương tự và tạo một giá trị REG_SZ (Chuỗi) mới và đặt tên cho nó <strong> Mật khẩu mặc định </strong> . <br> 5b. Nhấp đúp vào &#39;DefaultPassword <strong> &#39; </strong> Giá trị REG_SZ, nhập mật khẩu của bạn vào hộp Dữ liệu giá trị và nhấp vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-43-192.png\" alt=\"image\" loading=\"lazy\"></p> <p> 7a. Cuối cùng, tạo một giá trị REG_SZ mới và đặt tên cho nó <b> AutoAdminLogon </b> . <br> 7b. Nhấp đúp vào giá trị &#39;AutoAdminLogon&#39;, nhập <strong> 1 </strong> trong hộp Dữ liệu giá trị và nhấp vào <strong> đồng ý </strong> . </p> <p><img src=\"images/image_thumb-41-705.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 8. Đóng Registry Editor và Khởi động lại PC của bạn. * </p> <p> * Ghi chú: <br> 1. Nếu máy tính của bạn là một phần của Miền, thì bạn phải tạo một giá trị REG_SZ khác với tên <strong> DefaultDomainName </strong> và sau đó nhập vào hộp dữ liệu giá trị tên miền của bạn. <br> 2. Để tắt tính năng đăng nhập tự động trong tương lai, chỉ cần xóa các giá trị chuỗi mới tạo đã đề cập ở trên. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}