{"title":"Cách Xem và Xuất Mật khẩu Firefox.","content":"<p> Trong hướng dẫn này, tôi sẽ chỉ cho bạn cách xem và quản lý các mật khẩu đã lưu trong trình duyệt web Mozilla Firefox. Như bạn đã biết, trình duyệt Firefox cung cấp cho bạn tùy chọn lưu tên người dùng và mật khẩu đăng nhập của bạn vào lần đầu tiên bạn truy cập một trang web. Nếu bạn chọn lưu thông tin đăng nhập của mình, Firefox sẽ ghi nhớ chúng và lần sau khi bạn đăng nhập vào trang web, bạn sẽ không cần phải nhập lại chúng. </p> <p><img src=\"images/image_thumb-98-507.png\" alt=\"How to View and Export Firefox Passwords.\" loading=\"lazy\"></p> <p> Nếu theo thời gian, bạn quên thông tin đăng nhập của mình, thì hãy đọc hướng dẫn này để tìm hiểu cách xem và xuất mật khẩu đã lưu trữ của Firefox. </p> <h4> Cách quản lý, hiển thị và xuất mật khẩu đã lưu trong Mozilla Firefox. </h4> <p><strong> Cách xem mật khẩu Firefox </strong></p> <p> 1. Từ menu Firefox <img src=\"images/image_thumb-99-587.png\" alt=\"image\" loading=\"lazy\"> chọn <strong> Đăng nhập và Mật khẩu </strong> . </p> <p><img src=\"images/image_thumb-100-999.png\" alt=\"View Saved Passwords Firefox\" loading=\"lazy\"></p> <p> </p> <p> 2. Nhấp vào <strong> Hiển thị mật khẩu </strong> để xem các mật khẩu đã lưu trong các trang web. Ngoài ra trong cửa sổ này, hãy sử dụng <strong> Tẩy </strong> để xóa mật khẩu đã lưu khỏi Firefox. </p> <p><img src=\"images/image_thumb-101-863.png\" alt=\"Manage Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p><strong> Cách lưu tất cả mật khẩu Firefox vào một tệp. </strong></p> <p> Để xem và xuất tất cả mật khẩu được lưu trữ trong Firefox: </p> <p> 1. Tải xuống <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> PasswordFox </a> tiện ích ( <a href=\"http://www.nirsoft.net/utils/passwordfox.html\" target=\"_blank\" rel=\"nofollow noopener\"> http://www.nirsoft.net/utils/passwordfox.html </a> ) <br> 2. Giải nén tệp zip đã tải xuống. <br> 3. Từ thư mục đã giải nén, nhấp đúp để chạy ứng dụng &quot;PasswordFox.exe&quot;. <br> 4. Nhấn <strong> Ctrl </strong> + <strong> A </strong> để chọn tất cả các trang được liệt kê và sau đó từ <strong> Tập tin </strong> menu chọn <strong> Lưu các mục đã chọn. </strong></p> <p><img src=\"images/image_thumb-102-438.png\" alt=\"image\" loading=\"lazy\"></p> <p> 5. Nhập tên cho tệp .txt và nhấp vào <strong> Tiết kiệm </strong> . </p> <p><img src=\"images/image_thumb-103-923.png\" alt=\"How to Save Firefox Passwords\" loading=\"lazy\"></p> <p> </p> <p> 6. Mở tệp đã tạo trong notepad, để xem tất cả các mật khẩu đã lưu trong trình duyệt Mozilla Firefox. </p> <p> Đó là tất cả! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}