{"title":"Cách ngăn Windows 10 tự động cài đặt máy in mạng.","content":"<p> Như bạn có thể đã nhận thấy, Windows 10 tự động cài đặt trình điều khiển cho mọi máy in được kết nối mạng hoặc thiết bị khác. Tuy nhiên, mặc dù đây là một tính năng rất hữu ích, nó cũng rất khó chịu, đặc biệt là trong môi trường kinh doanh, nơi bạn có thể không muốn tất cả các máy in được sử dụng bởi tất cả người dùng mạng. </p> <p> Tất nhiên, nếu bạn không muốn thiết bị mạng và các ứng dụng của nhà sản xuất, bạn có thể xóa thiết bị đó khỏi hệ thống của mình. Tuy nhiên, Windows 10 sẽ tự động cài đặt lại. Để tránh điều này, bạn phải ngăn Windows tự động cài đặt các thiết bị được kết nối mạng (máy in, máy quét, máy ảnh, v.v.) cũng như các ứng dụng và biểu tượng hải quan của chúng từ nhà sản xuất. </p> <h3> Cách DỪNG Windows 10 để Tự động Cài đặt Ứng dụng và Thiết bị Mạng. </h3> <p> 1. Điều hướng đến <strong> Bảng điều khiển </strong> . Để làm việc đó: </p> <blockquote><p> a. Nhập &quot;bảng điều khiển&quot; vào hộp tìm kiếm của Windows <br> b. Nhấp chuột <strong> Bảng điều khiển </strong> từ các kết quả. </p></blockquote> <p><img src=\"images/image_thumb-53-862.png\" alt=\"control panel\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Đặt <strong> Xem bởi </strong> đến <strong> Biểu tượng nhỏ </strong> để xem tất cả các mục trong bảng điều khiển, sau đó nhấp vào <strong> Trung tâm kết nối và chia sẻ. </strong></p> <p><img src=\"images/image_thumb-37-625.png\" alt=\"control panel network and sharing center\" loading=\"lazy\"></p> <p> </p> <p> 3. Chọn <strong> Cài đặt chia sẻ nâng cao </strong> bên trái <strong> . </strong></p> <p><img src=\"images/image_thumb-38-656.png\" alt=\"Prevent Windows 10 to Install Network Printers Automatically\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 4. Xóa &quot; <strong> Bật thiết lập tự động các thiết bị được kết nối mạng &quot; </strong> và bấm vào <strong> Lưu thay đổi. </strong></p> <p><img src=\"images/image_thumb-39-992.png\" alt=\"Turn Off automatic setup of network connected devices \" loading=\"lazy\"></p> <p> </p> <p><strong> Không bắt buộc: </strong> Nếu bạn muốn ngăn Windows 10 tự động tải xuống và cài đặt các ứng dụng và biểu tượng tùy chỉnh của nhà sản xuất cho bất kỳ thiết bị được kết nối nào trên PC của mình, thì hãy: </p> <blockquote><p> 1. Điều hướng đến <strong> Bảng điều khiển </strong> -&gt; <strong> Hệ thống </strong> . <br> 2. Nhấp vào <strong> Bảo vệ hệ thống </strong> bên trái. <br> 3. Tại tab Phần cứng, nhấp vào <strong> Cài đặt cài đặt thiết bị </strong> . </p></blockquote> <p><img src=\"images/image_thumb-40-844.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <blockquote><p> 4. Tại &#39;Cài đặt cài đặt thiết bị&#39;, chọn &quot; <strong> Không (thiết bị của bạn có thể không hoạt động như mong đợi) &quot; </strong> và bấm vào <strong> Lưu thay đổi </strong> . </p></blockquote> <p><img src=\"images/image_thumb-41-728.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp phổ biến rộng rãi về hướng dẫn này. </p>"}