{"title":"Cách tìm Windows Media Player trong Windows 10.","content":"<p> Trong nhiều năm nay, Windows Media Player, là ứng dụng mặc định để phát nhạc và video. Trong Windows 10, Windows Player không còn nữa, trình phát mặc định cho các tệp phương tiện và đã được thay thế bằng ứng dụng &quot;Phim và TV&quot;. </p> <p> Bài viết này được viết cho tất cả người dùng muốn tìm và sử dụng Windows Media Player cổ điển, làm trình phát mặc định để phát nhạc và video của họ. </p> <h4> Cách tìm Windows Media Player trong Windows 10. </h4> <p> Cách nhanh nhất để biết Windows Media Player có được cài đặt trên máy tính của bạn hay không là tìm kiếm nó. Để làm việc đó: </p> <p> 1. Tại hộp tìm kiếm của Cortana, gõ <strong> Trình nghe nhạc của windows </strong> . <br> 2. Nếu trình phát Windows Media được liệt kê trên kết quả, hãy nhấp vào trình phát đó để khởi chạy chương trình. (Nếu không được liệt kê, hãy tiếp tục bên dưới…) </p> <p><img src=\"images/image_thumb-66-377.png\" alt=\"How to Find Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p><strong> TIỀN BOA: </strong> Để đặt Windows Media Player làm trình phát mặc định cho video và nhạc của bạn: </p> <blockquote><p> 1. Điều hướng đến <strong> Khởi đầu </strong> -&gt; <strong> Cài đặt </strong> -&gt; <strong> Ứng dụng </strong> và chọn <strong> Ứng dụng mặc định </strong> ở bên trái. <br> 2. Tại <strong> Máy nghe nhạc </strong> tùy chọn, nhấp vào <strong> Nhạc Groove </strong> và sau đó chọn <strong> Trình nghe nhạc của windows </strong> . <br> 3. <strong> Tại tùy chọn Trình phát video </strong> , nhấp chuột <strong> Phim &amp; TV </strong> và sau đó chọn <strong> Trình nghe nhạc của windows </strong> . </p> <p><img src=\"images/image_thumb-72-358.png\" alt=\"set windows media player default widnows 10\" loading=\"lazy\"></p> </blockquote> <p> </p> <h4> Cách cài đặt Windows Media player trong Windows 10 Home, Pro. </h4> <p> Nếu Windows Media Player không được liệt kê, thì bạn có thể cài đặt nó bằng cách truy cập: </p> <p> 1. <strong> Bảng điều khiển </strong> -&gt; <strong> Chương trình và các tính năng </strong> . <br> 2. Nhấp vào <strong> Bật hoặc tắt các tính năng của Windows </strong> từ bên trái. </p> <p><img src=\"images/image_thumb-68-342.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. Tại <strong> Tính năng phương tiện </strong> , chọn <strong> Trình nghe nhạc của windows </strong> và hãy nhấn <strong> đồng ý </strong> . * </p> <p> * Lưu ý: Nếu bạn đang sở hữu phiên bản Windows 10 N hoặc KN hoặc bạn không thể cài đặt Windows Media Player từ &#39;các tính năng của Windows&#39;, hãy tiếp tục đọc bên dưới… </p> <p><img src=\"images/image_thumb-69-565.png\" alt=\"How to Install Windows Media Player in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <h4> Cách tải xuống và cài đặt trình phát Windows Media trong các phiên bản Windows 10 Home, Pro, N &amp; KN. </h4> <p> Nếu bạn không thể cài đặt Windows Player bằng cách sử dụng các hướng dẫn ở trên hoặc nếu bạn sở hữu Windows 10 N hoặc KN, thì bạn có thể tải xuống Windows Media Player cho Windows 10 bằng cách làm theo hướng dẫn bên dưới: </p> <p> 1. Tải xuống <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=48231\" target=\"_blank\" rel=\"nofollow noopener\"> Gói tính năng phương tiện cho phiên bản N và KN của Windows 10 </a> . </p> <p> * Lưu ý: Tải xuống <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package.msu </strong> cho <strong> Hệ điều hành 32-bit, </strong> và <strong> Microsoft-Windows-MediaFeaturePack-OOB-Package_x64.msu </strong> cho <strong> Hệ điều hành 64-bit. </strong></p> <p> 2. Chạy tệp đã tải xuống và nhấp vào <strong> Đúng </strong> ở màn hình đầu tiên. </p> <p><img src=\"images/image_thumb-70-480.png\" alt=\"image\" loading=\"lazy\"></p> <p> </p> <p> 3. <strong> Chấp nhận </strong> Thỏa thuận cấp phép và sau đó đợi cho đến khi quá trình cài đặt hoàn tất. </p> <p><img src=\"images/image_thumb-71-400.png\" alt=\"download windows media player windows 10\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này. </p>"}