{"title":"Cách tắt BitLocker trong Windows 10.","content":"<p> Hướng dẫn này bao gồm các hướng dẫn về cách tắt Bảo vệ Bitlocker và mã hóa Drive trong Windows 10. Như bạn có thể biết, tính năng mã hóa BitLocker có sẵn trong Windows 10 pro và phiên bản doanh nghiệp, có thể giúp bạn bảo vệ nội dung PC của mình khỏi bị truy cập trái phép. Nhưng đôi khi cần phải tắt Bitlocker trên Windows 10, vì vậy trong hướng dẫn này, bạn có thể tìm thấy cách thực hiện điều đó. </p> <p> Nếu máy tính của bạn được bảo vệ bằng BitLocker, thì khi khởi động hệ thống, bạn sẽ được nhắc kết nối ổ USB mà bạn đã sử dụng trong quá trình kích hoạt BitLocker hoặc nhập mật khẩu BitLocker của bạn để mở khóa ổ C: để tiếp tục khởi động. Nếu bạn không có bất kỳ điều nào trong số này, hãy nhấn <strong> ESC </strong> để nhập khóa khôi phục BitLocker của bạn. * </p> <blockquote><p> * Ghi chú: <br> 1. Nếu Mật khẩu hoặc Khóa khôi phục Bitlocker không được chấp nhận khi khởi động hệ thống, hãy thử mở khóa và giải mã ổ cứng sang một máy tính Windows 10 khác hoặc thử: <a href=\"https://www.repairwin.com/how-to-disable-bitlocker-in-windows-recovery-environment-winre/\" target=\"_blank\" rel=\"nofollow noopener\"> Mở khóa và giải mã ổ đĩa được bảo vệ trong Môi trường khôi phục Windows (WinRE). </a><br> 2. Nếu bạn không thể mở khóa ổ đĩa (ví dụ: Nếu không sở hữu Khóa khôi phục BitLocker hoặc vì khóa BitLocker không được chấp nhận) và bạn muốn xóa mã hóa BitLocker để sử dụng lại ổ đĩa được bảo vệ, hãy đọc hướng dẫn này: <a href=\"https://www.repairwin.com/how-to-remove-bitlocker-protection-without-the-bitlocker-recovery-key-or-password/\" target=\"_blank\" rel=\"nofollow noopener\"> Cách xóa bảo vệ BitLocker khỏi ổ mà không cần mật khẩu hoặc khóa khôi phục BitLocker </a> . </p></blockquote> <p><img src=\"images/image_thumb-53-752.png\" alt=\"How to Disable BitLocker in Windows 10 GUI - PowerShell\" loading=\"lazy\"></p> <p> </p> <p> Sau khi khởi động vào Windows, hãy làm theo hướng dẫn bên dưới để tắt tính năng bảo vệ trình chặn bit và giải mã ổ đĩa. </p> <h4> Cách tắt tính năng bảo vệ BitLocker và giải mã ổ đĩa được mã hóa BitLocker trong Windows 10. </h4> <p> Để tắt tính năng bảo vệ Bitlocker, bạn phải có mật khẩu Bitlocker hoặc khóa khôi phục bitlocker để mở khóa ổ đĩa trước rồi mới giải mã ổ đĩa. </p> <p> Khóa khôi phục Bitlocker là một khóa số gồm 48 chữ số và có thể được tìm thấy tại các địa điểm sau: </p> <ul> <li> Trên bản in bạn đã lưu, khi bạn bật Bitlocker. </li> <li> Trên ổ USB bạn đã sử dụng, trong quá trình kích hoạt Bitlocker để lưu khóa khôi phục Bitlocker. </li> <li> Tại <a href=\"https://onedrive.live.com/recoverykey\" target=\"_blank\" rel=\"nofollow noopener\"> Khóa khôi phục tài khoản Microsoft </a> , bằng cách sử dụng tài khoản MS bạn đang sử dụng để đăng nhập vào thiết bị của mình hoặc bạn đã thêm vào thiết bị để tải xuống ứng dụng từ Microsoft Store hoặc để kích hoạt MS Office hoặc email. </li> <li> Về bạn <a href=\"https://go.microsoft.com/fwlink/?linkid=857635\" target=\"_blank\" rel=\"nofollow noopener\"> Tài khoản Azure </a> cho PC công việc đăng nhập bằng tài khoản Azure Active Directory. </li> </ul> <p> Sau khi bạn tìm thấy khóa khôi phục Bitlocker hoặc mật khẩu của bitlocker, hãy tiến hành mở khóa ổ đĩa được mã hóa Bitlocker và xóa mã hóa Bitlocker bằng một trong các cách sau: </p> <ul> <li><a href=\"#method-1\" target=\"_blank\" rel=\"nofollow noopener\"> Phương pháp 1. Tắt Bảo vệ BitLocker từ Windows GUI. </a></li> <li><a href=\"#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> Phương pháp 2. Vô hiệu hóa BitLocker &amp; Giải mã một ổ đĩa được mã hóa Bitlocker từ PowerShell. </a></li> </ul> <p> </p> <h6> Phương pháp 1. Cách Tắt Bảo vệ Bitlocker trong Windows 10 GUI. </h6> <p> Để tắt tính năng bảo vệ trên Ổ đĩa hệ thống C của bạn: </p> <p> 1. Điều hướng đến Windows <strong> Bảng điều khiển </strong> -&gt; <strong> Hệ thống và Bảo mật </strong> và sau đó nhấp vào <strong> Mã hóa ổ khóa bit </strong> . </p> <p><img src=\"images/image_thumb-33-233.png\" alt=\"How to turn off or Turn Onn BitLocker in Windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> 2. Bên cạnh ổ đĩa hệ điều hành C :, nhấp vào <strong> Tắt BitLocker </strong> . * </p> <p> * Ghi chú: <br> 1. Nếu tùy chọn &quot;Tắt BitLocker&quot;, không khả dụng, hãy mở <strong> nhắc lệnh với tư cách là quản trị viên </strong> và đưa ra lệnh sau: </p> <ul> <li> quản lý-bde -off C: </li> </ul> <p> 2. Để xem trạng thái giải mã (tiến trình) của ổ C :, hãy đưa ra lệnh sau: </p> <ul> <li> management-bde -status C: </li> </ul> <p> </p> <p> </p> <p><img src=\"images/image_thumb-43-236.png\" alt=\"turn off bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> 3. Sau khi Tắt Bitlocker, hãy nhấp vào biểu tượng Bitlocker trên thanh tác vụ để xem quá trình giải mã. </p> <p><img src=\"images/image_thumb-41-694.png\" alt=\"remove bitlocker windows 10\" loading=\"lazy\"></p> <p> </p> <p> </p> <p> Để tắt tính năng bảo vệ trên bất kỳ ổ đĩa được bảo vệ BitLocker nào khác từ Windows GUI: </p> <p> 1. Mở Windows Explorer và sau đó nhấp đúp vào ổ đĩa bị khóa. <br> 2. Nhập mật khẩu Bitlocker hoặc nhấp vào <strong> Lựa chọn khác </strong> để nhập khóa Bitlocker Recovery để mở khóa ổ đĩa. </p> <p><img src=\"images/image_thumb-47-646.png\" alt=\"unlock bitlocker windows 10\" loading=\"lazy\"></p> <p> 2. Sau khi mở khóa ổ đĩa, hãy điều hướng đến <strong> Bảng điều khiển </strong> -&gt; <strong> Hệ thống và Bảo mật </strong> -&gt; <strong> Mã hóa ổ khóa bit </strong> và sau khi chọn ổ đĩa, hãy nhấp vào <strong> Tắt BitLocker </strong> để giải mã ổ đĩa. (xem ảnh chụp màn hình ở trên) </p> <p> </p> <h6> Phương pháp 2. Cách TẮT Bảo vệ BitLocker &amp; Giải mã Ổ đĩa được Mã hóa BitLocker từ PowerShell trong Windows 10. </h6> <p> 1. Mở PowerShell với tư cách Quản trị viên. Để làm việc đó: </p> <ol> <li> <ol> <li> Tại <strong> Cortana </strong> Hộp tìm kiếm của, nhập <strong> quyền hạn </strong></li> <li> Nhấp chuột phải vào <strong> Windows PowerShell </strong> kết quả và chọn <strong> Chạy như quản trị viên. </strong></li> </ol> </li> </ol> <p><img src=\"images/image_thumb_thumb-1-316.png\" alt=\"disable bitlocker powershell windows 10\" loading=\"lazy\"></p> <p> </p> <p> 2. Sau đó, kiểm tra trạng thái mã hóa của từng ổ đĩa trên máy tính của bạn bằng cách gõ lệnh sau: </p> <ul> <li><strong> quản lý-bde -status </strong></li> </ul> <p> </p> <p> 3. Lưu ý ký tự ổ đĩa mà Trạng thái khóa hiển thị <strong> Đã khóa </strong> , và sau đó tiến hành mở khóa ổ đĩa đó bằng cách gõ lệnh sau: * </p> <ul> <li><strong> management-bde -unlock drive-letter: -rp BitLocker-recovery-key </strong></li> </ul> <p> * ví dụ: Nếu bạn muốn mở khóa ổ đĩa &quot;D:&quot; và khóa khôi phục bitlocker là: &quot;123456-123456-123456-123456-123456-123456&quot; thì hãy nhập: </p> <ul> <li> <ul> <li> quản lý-bde -unlock D: -rp 123456-123456-123456-123456-123456-123456 </li> </ul> </li> </ul> <p> </p> <p> * Lưu ý: Nếu bạn biết mật khẩu Bitlocker thì hãy đưa ra lệnh này: </p> <ul> <li><strong> management-bde -unlock drive-letter: -pw BitLocker-Password </strong></li> </ul> <p> * ví dụ: Nếu bạn muốn mở khóa ổ đĩa &quot;D:&quot; và mật khẩu BitLocker là: &quot;123qwerty&quot; thì hãy nhập: * </p> <ul> <li> <ul> <li> management-bde -unlock D: -password 123qwerty </li> </ul> </li> </ul> <p> </p> <p> 4. Sau đó, vô hiệu hóa mã hóa bitlocker và giải mã ổ đĩa được mã hóa, bằng cách sử dụng một trong các lệnh sau: </p> <ul> <li><strong> Vô hiệu hóa-BitLocker -MountPoint &quot;ký tự ổ đĩa:&quot; </strong></li> <li><strong> management-bde -off drive-letter: </strong></li> </ul> <p> * ví dụ: Nếu bạn muốn vô hiệu hóa mã hóa bitlocker trên ổ đĩa &quot;D:&quot;, hãy nhập: </p> <ul> <li> <ul> <li> Tắt-BitLocker -MountPoint &quot;D:&quot; </li> </ul> </li> </ul> <blockquote> <p> HOẶC gõ… </p> </blockquote> <ul> <li> <ul> <li> quản lý-bde –off D: </li> </ul> </li> </ul> <p> 5. Khi quá trình giải mã hoàn tất, hãy tiến hành kiểm tra lại trạng thái mã hóa bằng cách đưa ra lệnh sau: </p> <ul> <li><strong> quản lý-bde -status </strong></li> </ul> <p> 6. Nếu &#39;Trạng thái khóa&#39; hiển thị <strong> Đã mở khóa </strong> và &#39;Trạng thái chuyển đổi&#39; hiển thị <strong> Được giải mã hoàn toàn, </strong> bạn đã hoàn tất! </p> <p><img src=\"images/image_thumb-50-868.png\" alt=\"view bitlocker status\" loading=\"lazy\"></p> <p> </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trong các mạng xã hội để giúp lan truyền về vấn đề này. </p>"}