{"title":"Cách giải mã tệp được mã hóa EFS và loại bỏ mã hóa EFS trong Windows 10.","content":"<p> Trong một hướng dẫn trước, tôi đã mô tả cách để <a href=\"https://www.repairwin.com/how-to-password-protect-a-folder-in-windows-10-lock-folder-with-password/#method-2\" target=\"_blank\" rel=\"nofollow noopener\"> mã hóa các tệp của bạn bằng cách sử dụng mã hóa EFS </a> . Trong hướng dẫn này, bạn sẽ tìm hiểu cách loại bỏ mã hóa EFS và cách giải mã các tệp được mã hóa EFS sau khi chuyển chúng sang một máy tính khác. </p> <h4> Cách giải mã các tệp được mã hóa EFS và Tắt mã hóa EFS. </h4> <ul> <li> <p><a href=\"#part-1\"> Phần 1. Cách tắt và loại bỏ mã hóa EFS trên cùng một PC. </a></p> </li> <li> <p><a href=\"#part-2\"> Phần 2. Cách giải mã tệp EFS trên PC khác. </a></p> </li> </ul> <h6> Phần 1. Cách tắt và loại bỏ mã hóa EFS. </h6> <p> Khi bạn mã hóa tệp của mình bằng EFS, thì khóa giải mã (chứng chỉ) được lưu trữ cục bộ trên máy tính của bạn và các tệp đã được giải mã. Nếu bạn muốn tắt mã hóa EFS để ngừng mã hóa các tệp / thư mục của mình: </p> <p> 1. Nhấp chuột phải vào thư mục / tệp được mã hóa và thay đổi <strong> Quyền sở hữu tệp </strong> đến <strong> Cá nhân </strong> . </p> <p><img src=\"images/image_thumb-26-500.png\" alt=\"how to disable efs encryption\" loading=\"lazy\"></p> <p> 2. Khi hoàn tất, bạn sẽ thấy rằng thư mục / tệp đã được mở khóa. Chỉ cần thực hiện các bước tương tự để xóa mã hóa trên mọi thư mục và tệp được mã hóa khác. </p> <p> 3. Bây giờ, nếu bạn không sử dụng mã hóa EFS cho bất kỳ tệp / thư mục nào khác và bạn muốn xóa hoàn toàn khóa khôi phục EFS (hay còn gọi là &quot;khóa giải mã - chứng chỉ&quot;) khỏi PC của mình: </p> <blockquote> <p> 1. Mở Internet Explorer và từ <strong> Công cụ </strong> menu chọn <strong> Tùy chọn Internet </strong> . (hoặc, mở <strong> Tùy chọn Internet </strong> từ <strong> Bảng điều khiển </strong> .) </p> <p> 2. Tại <strong> Nội dung </strong> nhấp vào tab <strong> Chứng chỉ </strong> . </p> </blockquote> <p><img src=\"images/image_thumb-27-186.png\" alt=\"how to remove efs certificate-recovery key\" loading=\"lazy\"></p> <blockquote> <p> 3. Tại tab Cá nhân, chọn chứng chỉ giải mã và nhấp vào <strong> Tẩy </strong> . * </p> <p><strong> * Chú ý: </strong> Đảm bảo rằng bạn đã xóa (dừng) mã hóa cho tất cả các tệp được mã hóa trước khi xóa chứng chỉ (khóa giải mã) </p> </blockquote> <p><img src=\"images/image_thumb-25-639.png\" alt=\"how to remove efs recovery key\" loading=\"lazy\"></p> <blockquote> <p> 4. <strong> Khởi động lại </strong> máy tính của bạn. </p> </blockquote> <h6></h6> <h6> Phần 2: Cách giải mã các tệp được mã hóa EFS trên một máy tính khác. </h6> <p> Nếu bạn đã chuyển các tệp được mã hóa EFS sang một máy tính khác, thì cách duy nhất để xem (mở) các tệp EFS là sở hữu khóa giải mã. Khóa giải mã là tệp .pfx chứng chỉ, bạn đã xuất khi mã hóa tệp. Nếu bạn không có khóa giải mã EFS, không có cách nào để giải mã các tệp EFS. </p> <p><strong> Để giải mã các tệp được mã hóa EFS, bằng cách sử dụng Khóa giải mã - Chứng chỉ: </strong></p> <p> 1. Nhấp đúp vào khóa giải mã (tệp .pfx chứng chỉ) để cài đặt. <br> 2. Tại màn hình Chào mừng của Trình hướng dẫn Nhập Chứng chỉ, hãy nhấp vào <strong> Kế tiếp </strong> . <br> 3. Sau đó nhấp vào <strong> Kế tiếp </strong> lần nữa. </p> <p><img src=\"images/image_thumb38_thumb-158.png\" alt=\"How to Decrypt EFS Encrypted files\" loading=\"lazy\"></p> <p> 4. Nhập mật khẩu bạn đã sử dụng khi xuất khóa chứng chỉ và nhấp vào <strong> Kế tiếp </strong> . </p> <p><img src=\"images/image_thumb39_thumb-680.png\" alt=\"install efs .pfx certificate\" loading=\"lazy\"></p> <p> 5. Để lại cài đặt mặc định tại tùy chọn Cửa hàng chứng chỉ và nhấp vào <strong> Kế tiếp </strong> . </p> <p><img src=\"images/image_thumb40_thumb-629.png\" alt=\"image_thumb[40]\" loading=\"lazy\"></p> <p> 6. Cuối cùng bấm <strong> Hoàn thành </strong> . </p> <p><img src=\"images/image_thumb41_thumb-225.png\" alt=\"image_thumb[41]\" loading=\"lazy\"></p> <p> </p> <p> 7. Bây giờ bạn có thể mở các tệp được mã hóa. * </p> <p> * Lưu ý: Sau khi giải mã các tập tin, hãy làm theo hướng dẫn tại <a href=\"#part-1\" target=\"_blank\" rel=\"nofollow noopener\"> phần 1 </a> ở trên, để loại bỏ hoàn toàn mã hóa nếu bạn muốn. </p> <p> Đó là tất cả mọi người! Nó đã làm việc cho bạn? <br> Vui lòng để lại nhận xét trong phần bình luận bên dưới hoặc thậm chí tốt hơn: thích và chia sẻ bài đăng blog này trên các mạng xã hội để giúp lan truyền về giải pháp này </p>"}